{
    "prof_info": [
        {
            "prof_name": "Caitlin Trainor",
            "prof_id": 3368,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Modern Dance II",
            "review_date": "January 14, 2014",
            "review_content": "\nCaitlin is a special person, a real gem. She is enthusiastic, encouraging, endearing, and helpful-- a truly great dancer and wonderful instructor. \nI always looked forward to attending her class because it was simultaneously relaxing and energizing. Caitlin managed to create a familiar routine, while still spicing things up and challenging the class. She offers positive feedback and constructive criticism and makes dancing fun. \nI would highly recommend this class to both advanced dancers and beginners alike. It's a must!\nWorkload:\nAttend class (you are allowed two absences free of charge though) and go to two dance productions (at least one professional modern dance show)\n"
        },
        {
            "course_name": "Modern Dance I",
            "review_date": "June 23, 2013",
            "review_content": "\nCaitlin is quite honestly one of the best teachers I have ever had. She is a fantastic dancer with a fresh approach to teaching and life. My time at Barnard would not have been the same without her classes. She pushes you without being too strict and manages to maintain a professional relationship while still being friendly. Do her classes- they will teach you a lot and increase your quality of life!!!\nIt doesn't even matter if you have no idea what Modern Dance is. Many people who took this classes didn't (including myself). \nWorkload:\nTwo 1 hour and 15 minute classes a week and attending two dance performances. You are allowed to miss 2 classes without any consequences. \n"
        },
        {
            "course_name": "Modern Dance I",
            "review_date": "January 19, 2012",
            "review_content": "\nI absolutely love Caitlin! She's fun, sweet, and full of energy! She definitely deserves a gold nugget. Some people are exaggerating on her strictness with time. She is actually super understanding and nice about it, just as long as you don't take advantage. I was actually really skeptical about going into dance after not dancing since elementary school, but after taking it with Caitlin I'm in love with it. She's really talented and had a late start in dance so it's really inspiring to me and the other dancers to see how amazing she is. So I definitely recommend taking modern with Caitlin. She's an amazing teacher and dancer and person, and I'm sure you'll have a really great time as long as you put in a little effort :) I'll definitely be going back for more :)\nWorkload:\nmodern I -  2 professional dance shows: one wildcard (pick what you like) and one modern, and one short reflection paper. however these requirements are basically no work and the shows are very enjoyable! so to put it simply, the workload: JUST DANCE! if you're like me you'll WANT to think about it outside of class to improve :) not sure about modern III but I'm assuming it's similar.\n"
        },
        {
            "course_name": "Modern Dance I",
            "review_date": "January 16, 2012",
            "review_content": "\nGive her the gold nugget back! It's true that Caitlin is rather strict about things such as lateness and behavior during the class, but only because those are rules of dance classes in general. She really wants you to learn while still having fun in class, and honestly everyone should be able to keep their number of absences at 5 or lower because the class is so much fun. Caitlin is a great teacher, very approachable and a great dancer too. She can make the easiest moves look fabulous, always took the time to answer questions during class and stayed after class too to answer more questions. I would say that everybody who was in this class got a lot better at dancing, even though at this stage it's more about the effort you put in rather than your pure skill, so don't be intimated to take the class if you're an absolute clumsy beginner like me. Caitlin will turn it into an enjoyable experience.\nWorkload:\nAttendance + a reflection paper with no set length (should be between 1 and 5 pages though)\n"
        },
        {
            "course_name": "Modern Dance II",
            "review_date": "January 02, 2012",
            "review_content": "\nCaitlin's style of teaching is extremely endearing and helpful for those beginning their study of dance. Her choreography is very physical, and she's proactive about making students learn about their bodies and explaining movement through use of her own.\nShe is, however, very strict about her requirements and not appreciative or approachable about almost any exceptions to her policies. Only take her class if you are confident you will be able to regularly attend and give your all--there's no getting back from that one.\nWorkload:\nSerious, in its own way; attendance is mandatory and missing more than two classes will result in an automatic deduction in your grade and in her opinion of you, which matters a lot.\n"
        },
        {
            "course_name": "Modern I",
            "review_date": "January 21, 2010",
            "review_content": "\nFabulous, fabulous class.  Caitlin is fun, smart, helpful, and extremely talented.  She went at a great pace and made sure everyone in the class was involved and active, while never being overbearing or going too fast.  She is clearly an intelligent woman (Skidmore alum, I believe?) and isn't afraid to physiologically explain what goes on for those who better understand dance in that way.  She caused me to totally connect with my body in a different and deeper way.  I still often find myself doing versions of some of her exercises.  This class was a great workout, but not a stressful or impossible one.  Nobody in the class was any Baryshnikov so don't feel bad if you don't have any dance experience.  If anything, some of our best dancers didn't.  I would recommend it to anyone.\nWorkload:\nYou have to see 2 dance performances (one of which needs to be professional modern dance) and write a final paper (the class is pass-fail though so I wouldn't sweat it too much).  Also, there are a lot of restrictions when it comes to absences so be prepared to make every class.\n"
        },
        {
            "course_name": "Ballet I",
            "review_date": "August 12, 2009",
            "review_content": "\nCaitlin is one of the best teachers I've had in any subject throughout my entire academic career. I was interested in learning ballet, since I love to watch it, and so I took Caitlin's Ballet 1 class just for fun. I had no idea I would fall so in love with the dance.  Caitlin has a talent for instilling passion in her students by showcasing her own love of dance, and by instructing with both precision and unshakable patience. She makes it clear that she expects more of her class than they generally think they can give, which is flattering, challenging, and encouraging. Somehow she tends to be more apt at estimating my ability than I am. She is an incredibly sweet person--so much fun to talk to, dance with, and learn from. Her classes were always the bright spots in my week. She stays after class to answer questions, and she also answers emails in an timely fashion, which is helpful. One of the best things about taking a beginner dance class from Caitlin in college is that she actually started dancing when she was a college junior. Most ballerinas start dancing shortly after learning to walk, and that can be discouraging to someone trying to start in their late teens/early twenties and feeling very behind. It is so inspiring to have a teacher who is a beautiful, talented, and graceful dancer, even having started so late. Caitlin is brilliant, and if you have the opportunity to take a class from her, I strongly recommend it.\nWorkload:\nShow up to class on time and dressed appropriately, with your hair up if it's long. You'll get more out of the course if you work out, stretch, and visualize between classes, but since the grading is P/D/F, you'll get a P just for showing up respectfully to as many classes as possible (you can miss two before she starts docking your grade).\n"
        },
        {
            "course_name": "Modern I",
            "review_date": "January 14, 2008",
            "review_content": "\nCaitlin Trainor was an AMAZING Modern I dance teacher. She has Paul Taylor influences, and her class is very athletic and open. Don't be shy! She'll make you feel very welcomed and comfortable. After class, she would often stay to answer questions and go over some techniques with dancers. I had so much fun in this class (didn't miss a single class!) and it made me consider doing a Dance concentration (I'm an Econ major). \nWorkload:\nRequired to watch 2 professional dance performances, write 1 reflection essay (of any length). She is strict on class participation, though, so be there on time and be there mentally as well as physically. (Graded on a P/F system)\n"
        }
    ]
}