{
    "prof_info": [
        {
            "prof_name": "Karen  Phillips",
            "prof_id": 13327,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry II",
            "review_date": "January 09, 2017",
            "review_content": "\nI feel like I should warn students about this professor. She seemed really cool on the first day of class and she advertised herself as being this incredible professor who made students fall in love with organic, but in reality, she is none of those things. She picks favorites, she does not curve her exams even though the average for all three of our exams was a C or C-, she did not tell us about her grading scale until after the second exam, basically after it was too late to drop her course, and if you don't go to her workshops, it's basically impossible to do well in her class. Some students thought her lecture was interesting, but I thought her drawings on the board were very disorganized and found it difficult to read my notes later. She doesn't use the textbook at all really so everything is from class notes, but again, if those are bad, you cannot do well. \nWorkload:\nYou can work your butt off and still only get a B. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 29, 2016",
            "review_content": "\nFirst of all, there is no doubt that this course is taught more rigorously than other Orgo classes (i.e. doubleday and cornish). But Phillips is ok. She's a good teacher, she explains the material well, although she spent an about 2-3 weeks just talking about hybridization -_- and then powered through enantiomers and stereoisomers like they're common knowledge. I never once opened McMurry so when I switch to d-day, I'll have a weird new relationship with McMurry. Even though she doesn't teach straight outta McMurry, it's ok because you actually learn more of the important mechanisms that she thinks are relevant to synthesis (orgo2). never did learn how to make a cyclopropane from an alkene so that's kinda disappointing, cause she taught that at Hunter. Second, I learned how to answer 11 difficult orgo problems in 75 minutes (5 of which are mechanism questions)... wait scratch that, I really didn't. I usually get one whole-page wrong cause guess what 75min IS NOT ENOUGH!!! It's not like her multiple choice don't take time... so if she ever says \"well, they're MC questions, you should be able to answer them quickly...\" welp, she gives the same length exam to her Hunter kids but they had 1h and 50min, so... \nStructure of the course: WOW, where to begin... wow. SHE HANDS THESE WORKSHOP QUESTIONS, RIGHT? THEN EXPECTS US TO ATTEND HER WORKSHOP ON THE FRIDAY WHEN SHE GAVE OUT THE WORKSHOP ON THE THURSDAY. WOW. WOW. THAT'S NOT THE WORST PART. THERE ARE NO ANSWERS!!!!!! WOW WOW WOW. NOPE, NO ANSWERS. AND THEN DURING WORKSHOP SESSIONS, SHE WOULD KEEP AGREEING TO A STUDENT, AND UNTIL SOMEONE SAYS, \"hey that's wrong...\" ONLY THEN WILL SHE SAY, \"yay, i'm glad you brought that up...\" UGH WOW COOL I re only taking this or bio, then, my friend, godspeed. \n\nWorkload:\nMeh, it's like 1 workshop she gives out every Thursday, and you work it out every Friday like you don't have other things to do with ur life except Orgo... and they're very similar to her exams. Contrary to what she may say in class, HER WORKSHOPS ARE MANDATORY!!!!!!!!!!!!!\n"
        }
    ]
}