{
    "prof_info": [
        {
            "prof_name": "Donovan McFeron",
            "prof_id": 2989,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "December 10, 2008",
            "review_content": "\nDonovan Mcferon is the most spacey guy ever. That's okay, though. He's has his material down cold and will be able to answer any question. If you're extremely bad at math I wouldn't recommend him because he's not very good at dumbing things down. If you are pretty good at teaching yourself, though, and need someone brilliant to reinforce what you learn and answer your questions, he's the man.\nWorkload:\nLight weekly homework that he grades graciously. Two midterms and one final that he will give nice partial credit on if you messed up but mostly knew what you were doing.\n"
        },
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "August 07, 2007",
            "review_content": "\nOverall, Donovan is a very good professor. He genuinely wants his students to do well and is very open to questions or comments. He does move extremely fast in teaching the material, but this may be the nature of a summer course and he doesn't mind if you ask him to slow down. (He also tends to make some mistakes, I think). His grading is fair and he teaches straight from the book so if you miss anything or need further explanation you can just read the chapter. The homework assignments can be tricky and the TA grades them fairly strictly but he is always willing to stay after class and help with any questions. I had a lot of problems with Pre-Calc in Undergrad and I feel like his course really helped explain alot.\nWorkload:\nMidterm - 30%, Final - 40%, HW - 30%. Homework due every week, usually a few chapters per week, about an hour a day. Midterm & Finals are on the tougher side but he does a lot of review.\n"
        },
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "August 19, 2006",
            "review_content": "\nDonovan did a good job at presenting the material in the book in a clear and easy to follow lecture format.  Be prepared to pay attention for the full class time because he goes through the material QUICKLY and covers just about everything in the book (I took the summer class so it may be a bit slower during fall or spring).  His lectures follow the book very closely and he uses many of the same examples from the text (which is very useful in my opinion).  Tests were fair, a lot of formulas to memorize but if you can do the homework you should be okay.  Also, he is a fair grader and wants people to learn and do well.\nWorkload:\nWeekly homework assignments from the book (2 to 4 hrs per week).  Grading is 30% homework, 30% midterm, 40% final\n"
        }
    ]
}