{
    "prof_info": [
        {
            "prof_name": "Megan Doherty",
            "prof_id": 3065,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civ, 1st semester",
            "review_date": "January 05, 2012",
            "review_content": "\nMegan is a really, really nice person and relatively accommodating with students, but as a teacher I have to say she was probably mediocre at best. I should probably preface this review with the acknowledgement that I did have a really awesome Lit Hum professor, and so coming into CC I probably had really high expectations of gaining a similarly phenomenal experience out of CC. That, unfortunately, was not the case - and at first I tried to put the blame on the fact that the texts in the first half of the semester (the religious texts, especially) weren't particularly exciting, and that there wasn't a whole lot of discussion to be mined out of those texts anyway. I chose to give Megan the benefit of the doubt - a CC class, after all, is only as productive and interesting as the discussions that the students themselves choose to have - but as the semester progressed it became increasingly apparent that she just wasn't a very good discussion leader or lecturer (though the class hardly consisted of her lecturing). Granted, the class I was in didn't really have too many enthusiastic or articulate students, but too often Megan would let some student ramble on for too long, or go off tangent into a really trivial and unessential detail about the texts we were discussing, without making any effort to rein in the discussion or redirect it. The result was that we often ended up having discussions about pointless and insignificant aspects of the texts, rather than discussing themes as a whole that were central to the text, and which we should have come away from each lesson with. \nOn that point, a significant deficiency of this class was the fact that I never felt like I came away from each lesson with an understanding of the key points and themes of each text. Oftentimes these points were only gleaned by myself in my own individual reading of the text before and after the class. I did get the sense that Megan probably had her own opinions and understandings of each text, but she never really expressed them, choosing to let the class' spiral into tangentially related frivolities (that also too often involved some member of the class either expostulating over-passionately about trivial details or attempting to make sub-standard arguments when he/she clearly hadn't done the reading). All in all, the quality of discussion in the class was really poor. \nMegan also wasn't the most responsible of teachers - a lot of things were returned to us really late, save for our response papers. The midterm was returned to us significantly later than we might expect from most other classes, as were the our paper proposals with her comments and our papers themselves. Megan also didn't give very many constructive comments that might have helped to improve the quality of the critical thinking process. The review session for our final was conducted at V&T;'s - not the most conducive place for a quick condensation of over 30 very dense, ancient texts of Western civilization. I didn't feel like I came away from this class with any significant revelations on the foundations of Western civilization and religion, which is a shame because I did find many of the texts later in the semester to be extremely thought-provoking and interesting. I think I actually learnt more about Plato and Hobbes while having dinner with a friend (who is a philosophy major) at the end of the semester than I did from being in Megan's class. If you value your learning experience, and want to gain the most you can out of CC, I would stay away from her section. Otherwise, she is a very pleasant, easy-going teacher, from whom it is probably not extremely hard to get an A, albeit without learning very much. \nWorkload:\nStandard weekly CC readings, one midterm (IDs and essay, worth 15%), one final (IDs, short answer and essay, worth 25%), one 8-10 page paper (worth 25%), class participation, attendance, response papers and one presentation (worth 35%). \n"
        },
        {
            "course_name": "Contemporary Civ, 1st semester",
            "review_date": "January 12, 2011",
            "review_content": "\nMegan was an amazing teacher! She often teaches for American Studies I believe, but is a history PhD candidate. She writes for HufPo, and after our first class she was inspired to write about us and our class was published. Her continued interest and devotion to making sure we all learned the material, thought critically, challenged ourselves, and improved academically shone through with all that she did for us. She started the semester giving us feedback on our posts and gave detailed feedback on all our papers and exams. She would talk to me outside of class and engaged me with topics I found particularly interesting. She also gave us a study guide for everything we read, and they were extremely helpful for the midterm and final. Her quickness and the class dynamism made our section my personal favorite for the semester. Overall, a very confident and amazing woman who is devoted to making her students learning experience as comprehensive and enjoyable as possible. The only time I had trouble staying awake was through Descartes, and lets be honest, who could?\nWorkload:\nAbout twice the reading (e.g. 300 pages of Qu'ran in one night) but the two papers we wrote were 7 pages each. Long midterm and final with fair grading meant to push students to be better writers and grades typically went up from the midterm to the final. WORTH THE WORK!\n"
        },
        {
            "course_name": "Britain since 1867",
            "review_date": "January 14, 2008",
            "review_content": "\nMegan is a sharp, knowledgeable TA.  She is happy to answer questions and went out of our way in our section to clarify things with our teacher and forward questions and messages along. Her section is also pretty good. That being said, she is a pretty hard grader.  Her comments on papers are insightful, though perhaps her expectations are a bit lofty. A good TA, but if you get her section, expect to work VERY hard for your grade.\nWorkload:\ntwo primary research 5 page papers, midterm, final, expect to work for a decent grade\n"
        },
        {
            "course_name": "Introduction to American Studies",
            "review_date": "June 04, 2007",
            "review_content": "\nSection with Megan made this class for me.  My section was scheduled after a long and boring economics class, and every week it was wonderful to go from listening to a droning teacher to discussing things like emerson and gatsby.  The reading list was huge (the course was co-taught by two profs of different areas) so we didnÂ’t get to everything in section, but she often emailed in advance to tell us what the key book or essay was.  She made sure we understood the somewhat confusing essay assignments, and encouraged drafts.   We had a big, talkative class, but she seemed to always notice my hand going up and made sure she got to me.  Recommend without reservation.\n"
        },
        {
            "course_name": "Civil War and Reconstruction",
            "review_date": "December 17, 2006",
            "review_content": "\nI really liked being in MeganÂ’s class, she was a great TA.  This was my best section so far, and IÂ’m a senior.  She always came to class so well prepared and facilitated great discussions.  Sometimes she went over relevant material with us on the blackboard to make sure we got it, other times we just talked.  She seemed really devoted to the class and repeatedly told us we should hand in drafts of our papers.  She always got back to my emails straight away, and gave me lots of useful feedback on my draft.  If you get the chance, make sure MeganÂ’s your TA, sheÂ’ll make it a painless experience and you will actually laugh in class.\n\n"
        }
    ]
}