{
    "prof_info": [
        {
            "prof_name": "Allegra Kent",
            "prof_id": 2883,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Ballet I",
            "review_date": "July 12, 2013",
            "review_content": "\nAllegra Kent is a great teacher.  She does a good job of covering the basics and going over form and posture in this class.  Fun, helpful, and easy grading.  Take this class if you've never (or barely) done any ballet before and you want to learn, or if you just want to get some exercise.\nThe class I was in was 2 hours long. First hour was at the barre, small break in the middle, and then the rest was center floor or across the room.  There were some silly floor routines where we were basically running into each other.\nAlso, it's okay if you have to miss a class or two -- she'll just tell you to write a poem and bring it in to her for the next class.\nWorkload:\nJust go to class!\n"
        },
        {
            "course_name": "Ballet I",
            "review_date": "April 12, 2012",
            "review_content": "\nAllegra Kent is a great teacher and amazing dancer herself, although she can no longer dance. She has a very good dancer (I believe a Juilliard dance student) demonstrate for her class though. Although I did not actually take her class, I took a couple make-up classes with her (I was in a higher level but the timing worked for me) and I can already see how professional she is in her teaching. Her corrections were spot on, even if they were very small and detailed. She is a very sweet woman and is not too strict or too lenient. She also did try to help as many students as possible. If you want an enjoyable class in which you will improve in skill, I recommend taking a course with Allegra Kent. I had danced when I was younger but hadn't danced in many years so I didn't want to jump into a high level right away, but I hope to take ballet 5 with her in the future.\nWorkload:\nshow up and dance :)\n"
        },
        {
            "course_name": "Ballet 5",
            "review_date": "October 19, 2006",
            "review_content": "\nI really enjoy taking Allegra Kent's Ballet 5 class on Fridays from 10-12. Yes, the time is early and I always wake up to my alarm wishing I could just go back to sleep, but I always feel so much better once the class starts.  Allegra's funny and sweet personality puts me in a great mood and I leave the class feeling refreshed and smiling. \nIn terms of corrections, I have noticed that Allegra tries to watch as many students as possible. I do not receive feedback every class, but when I do, even the tiniest correction seems to be right on the spot. Sure, she does have one or two favorites who she looks after every class, but I would be surprised if you could find any teacher in the ballet world who does not have a favorite student.  The attention she gives these students is NOT overwhelming, and I do not feel neglected or anything as a result of the attention she gives them.\nOverall, I really enjoy dancing in Allegra's class, and I would recommend that everyone give Allegra a chance and ignore all the negative comments that people make about her teaching. Just as a side note, I have been dancing for 14 years; so trust me, I know quite a bit about ballet teachers.\n"
        },
        {
            "course_name": "Ballet 5",
            "review_date": "October 19, 2006",
            "review_content": "\nI really enjoy taking Allegra Kent's Ballet 5 class on Fridays from 10-12. Yes, the time is early and I always wake up to my alarm wishing I could just go back to sleep, but I always feel so much better once the class starts.  Allegra's funny and sweet personality puts me in a great mood and I leave the class feeling refreshed and smiling. \nIn terms of corrections, I have noticed that Allegra tries to watch as many students as possible. I do not receive feedback every class, but when I do, even the tiniest correction seems to be right on the spot. Sure, she does have one or two favorites who she looks after every class, but I would be surprised if you could find any teacher in the ballet world who does not have a favorite student.  The attention she gives these students is NOT overwhelming, and I do not feel neglected or anything as a result of the attention she gives them.\nOverall, I really enjoy dancing in Allegra's class, and I would recommend that everyone give Allegra a chance and ignore all the negative comments that people make about her teaching. Just as a side note, I have been dancing for 14 years; so trust me, I know quite a bit about ballet teachers.\n"
        }
    ]
}