{
    "prof_info": [
        {
            "prof_name": "Anne Higonnet",
            "prof_id": 1530,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Art History II",
            "review_date": "August 23, 2016",
            "review_content": "\nI took this class because I think that a basic knowledge in art history is an important aspect of functioning as an intellectual person. That said, this class gave me nothing. I went to class a few times in the beginning of the semester but stopped showing up shortly thereafter. The class was boring with most students mindlessly writing down every word Higonnet said (which was seemed thoughtless to me). There was nothing about the class that was at all worth showing up for. It was not at all stimulating and seemed to be a complete waste of time. If you want a class where you can spend an hour and 15 minutes hearing Higonnet speak in flowery, insubstantial, repetitive phrases...go for it. I wouldn't exactly recommend wasting your tuition money on that.\nThe class wasn't all bad though. The artworks chosen were interesting and that made it fun studying for the midterm and final. It's a 4 credit class that is an easy A so that's also nice if you need a GPA boost.My TA also happened to be incredible and she made the class 10000000% more thought provoking as did the museum trips.\nAll in all, everything but the lecture was pretty enjoyable. But you can probably gain just as much by making friends with the Art History PHD students in Avery and a trip to the Met.\n\nWorkload:\none midterm (IDS and comparisons) , one final (IDs, comparisons, essay) , three SUPER short papers (graded by the TAs at their discretion -- not too harsly but make sure to listen to how they would like you to structure the papers)\n\nReally easy work load with weekly readings that I never even glanced at (I don't think anybody did)\n"
        },
        {
            "course_name": "Introduction to Art History II: Renaissance to the Modern Age",
            "review_date": "April 21, 2016",
            "review_content": "\nI liked Professor Higonnet—her lectures were clear. The workload is fairly manageable—she recommends that you do the reading, but honestly, I did no reading at all and did very well on my midterm. All this class requires in terms of testing is memorization, and if you don't go to lecture, make sure to look up the key works (3 or 4 per class) and write down historical significance/any other important information.  I skipped 1/3 of the lectures, maybe more, and did great, but I did go to discussion section every week.  The essays are not as easy, but if you pay attention to her methods of analyzing the art work, you will do fine—just stand in front of the assigned art for an hour and jot down everything that comes to mind.\nTake the testing advice with a grain of salt, because memorization is my forte.  If you aren't good at that, you will have a hard time on the midterm and final.\nWorkload:\n-3 essays, 2-3 pages for the first two, 3-4 pages for the last essay\n-Reading every week (fairly manageable)\n-Midterm (7 ID's, 2 comparisons)\n-Final (More than 7 ID's, 2 comparisons, an essay—it is cumulative)\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "January 12, 2015",
            "review_content": "\nProfessor Higgonet is an amazing lecturer.  Her lectures are engaging and interesting and always perfectly prepared for the class.  I'm an art history major, and I thought this was one of the easiest Art History classes I've taken.  Yes, you have to memorize slides but really a low number comparatively.  I took this class and never had a conversation or interaction with Professor Higgonet.  I liked my TA and they are really the ones there to interact with students.  She doesn't take attendance, doesn't care if you spend the entire class on your laptop on fb, but its worth your while to go to class and pay attention.  \nWorkload:\nHuge amount of readings that don't all have to be done, Midterm, Final, Two papers (4-5 pages and 6-8 pages)\n"
        },
        {
            "course_name": "Introduction to Art History II",
            "review_date": "May 29, 2013",
            "review_content": "\nIn comparison to the first semester intro course with Moxey, this class is amazing. I may feel this way because I personally find the subject matter of this course (Renaissance-Modern Urban Planning) to be WAY more intriguing than the first semester subject matter (cave paintings-renaissance). However, most people agree with me. \nProfessor Higonnet is a fine lecturer. She is obviously more knowledgable about some topics than others, but she willingly acknowledges this. The reading is light and really doesn't need to be done when assigned...I usually started out the semester doing all of them and then when life got crazy I skimmed them lightly. As long as you review for the exams you are fine. \nThe exams are very fair. The midterm only consisted of IDs and comparisons, and the final was the same with an essay. The paper topics involve going to museums but it's fun and is a good chance to just leave morningside heights. \nWorkload:\n2 papers, easily graded. \n1 midterm: 5 IDs 3 comparisons \n1 final: 6 IDs, 3 comparisons, 1 essay \n"
        },
        {
            "course_name": "Introduction to Art History II",
            "review_date": "May 19, 2012",
            "review_content": "\nProf Higonnet is actually brilliant. In each of her lectures she is able to flawlessly integrate history, politics, psychology, and even fashion into her interpretations and explanations of various pieces of art. Honestly, I hated having guest lectures, not because they were always terrible (although they sometimes were) but because I enjoyed her lectures so much. Each lesson was intellectually rich and rewarding to attend. Considering that this is a required introductory course, it is incredibly fortunate that Prof Higonnet lends her expertise to the matter.\nHigonnet builds the curriculum around exhibits occurring throughout the semester, allowing the students to get as much as possible out of the art class. I would highly, highly recommend this course even if you are just looking for an introduction into art of he modern era.\nOverall a wonderful survey of artwork between the renaissance and modernity.\nWorkload:\nanywhere between 10 and 50 pages of reading\na few movies watched on your own\n3-4 museum trips\ndiscussion section\n2 papers (3-4 pages and 5-6 pages)\nmidterm/final noncumulative with 50-60 slides to memorize for each exam (name, date, author)\n"
        },
        {
            "course_name": "Introduction to Art History II",
            "review_date": "October 23, 2009",
            "review_content": "\nI took Intro to Art History with Professor Higonnet last semester and I'm in the process of taking 19th- Century Art with her this semester. I think that a lot of the negative reviews can be explained away because the reviewers were probably going to Professor Higonnet with problems and/or questions that they should have taken to their TAs. She's got 5 TAs for a reason. She's quite the notable art historian, and can't really be troubled with petty questions regarding the grade your TA gave you on a paper...you should really go to your TA with questions about your mid-term, final, papers, etc. It's their job.\nProfessor Higonnet is the reason I decided to be an art history major. I was at the Spring 2009 program planning meeting, and she said something to the effect of \"Art is the only beautiful thing that people have ever done...\" and it melted my heard a little bit. She is eloquent, always prepared, and in a way, it's almost as if she puts on a performance of sorts every lecture. It's highly amusing when she comes up with a new idea or concept while she's lecturing. She's very, very organized. I need structure to perform optimally, and she definitely provides an adequate amount of it. For example, of the three art history professors I have at the moment, she was the first to post a review for the mid-term, and did so almost three weeks before the exam which was really helpful because the others more or less waited until the week before the test. And she does the powerpoints herself and sends out the mass e-mails to the class. I've been in a class in which there has been miscommunication between the professor and the TAs, and even the TAs weren't sure what to tell you what was on the exam, but since she e-mails you her personal expectations, you know just what you're getting into. \nI definitely like 19th-Century Art better than Intro to Art History and I think it's because Professor Higonnet does all of the lectures. I will readily admit that there are some awful guest lecturers in the Intro course-- this applies to both semesters of Barnard's Intro. Some people might be noted scholars, but they're just not very good at communicating their ideas. Her Intro class in the spring is A LOT better than Moxey's class in the fall, however, so if you're thinking of taking Intro to Art History to fulfill a GER, take it in the spring with Professor Higonnet. \nWorkload:\nIt's true that there's a lot of memorization in the Intro class-- that's just the way it is with art history. Not as much in 19th Century art-- you just seem to remember the dates more easily.\nIntro- Mid-Term: 10 IDs, 2 Comparisons of 2 slides each, a 25 minute essay. Final- Same thing, but with more time for the essay and a couple of \"unknowns\" 2 relatively easy, short papers. \n19th Century Art: Mid-Term, same format as Intro, 4-6 page formal/social analysis of a piece of art at a local museum, a longer research paper comparing two late-19th-century works, and the final (the format of which is probably high comparable to the mid-term.\n"
        },
        {
            "course_name": "Introduction to Art History II",
            "review_date": "June 01, 2009",
            "review_content": "\nThis class comes down to one thing - memorizing. If you are able to memorize a bunch of slides, titles, dates, etc and spit it back out on a test you'll do just fine. The papers are fairly easy and the grading really depends on who your TA is. I had Emily Beeney and she was great, somewhat difficult grader but good overall. The guest lecturers can sometimes be hard to understand and you may find yourself falling asleep during the lectures but try not to. The lectures are the most important thing. I wouldn't bother buying the textbook, you don,t need it and any time you want to consult it you can just look online. The weekly readings are annoying if you actually try to do all of them but its very easy to get away with not doing them. Overall, this class is a good way to fulfill your art requirement if you are good at memorizing. The best thing I did was find someone to trade off attending lectures with so I only had to go once a week.\nWorkload:\nFinal: 10 ids, 2 unknown ids, 3 comparisons, 1 essay - 30% of your grade\nMidterm: 10 ids, 2 comparisons, 1 essay - 15%\nSection Participation: once a week, plus museum visits 15%\n1st Paper: 2 -3 pages, 15%\n2nd Paper: 5 - 6 pages, 25%\n\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "May 23, 2009",
            "review_content": "\nThe material is all covered and most of the lectures were interesting. BUT if you happen to have an undesirable  TA your semester can be ruined. Slide memorization is straight forward but the grades given for any writing portion of the class seem arbitrary. If you are considering taking this class to fulfill a visual arts requirement, take something else. \n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "May 23, 2009",
            "review_content": "\nThe material is all covered and most of the lectures were interesting. BUT if you happen to have an undesirable  TA your semester can be ruined. Slide memorization is straight forward but the grades given for any writing portion of the class seem arbitrary. If you are considering taking this class to fulfill a visual arts requirement, take something else. \n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "August 06, 2007",
            "review_content": "\nI had to review in response to what someone had said about this class being a grade ruiner.  While Professor Higonnet does expect a lot of slide memorization for the midterm and final, she tells you exactly what she's looking for.  Really, art history has to have a lot of memorization and slides.  It's not her fault.  \nAside from that, I agree that she is a good lecturer, but sometimes the guest lecturers are a little boring.  I didn't attend class/discussion section enough so I deserved my B+.  Basically, go to class and you'll be surprised at what you remember, when it comes down to studying or taking the exams.  Take a laptop with you, since she posts the powerpoint slides sometimes only minutes before class is due to begin.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 29, 2007",
            "review_content": "\nProf. Higonet was an interesting lecturer, but I would not take this course as the grading was very arbitrary. Although she did not lead discussion sections, she took samples from our papers (which were partially based on discussion) and graded them herself. Some of the exam questions were written in an unclear way and did not make much sense even when explained. Still, the exams were graded very harshly. At the podium, she seems friendly and carismatic, but in person she comes across as petty and mean spirited, especially if you talk to her about your grade. This is a professor that confuses \"challenging\" with \"punishing,\" and your grade will suffer for it.\n"
        },
        {
            "course_name": "Americans in Paris",
            "review_date": "May 03, 2007",
            "review_content": "\nI want to write a review for Professor Higonnet because I believe the dissenting opinion needs to be expressed. I did not like her as a professor at all. She is so aloof and AWKWARD in office hours. Seriously. It's the most awkward office hours you'll ever go to. She also hesistates to give any feedback, ever. I'm not bitter -- in fact I did well in her class, but it's almost frustrating to have someone so knowledgable, but so unreachable. (literally and figuratively). The email comment is no joke. She absolutely ignores her emails. What the hell is up with that?!\nWorkload:\nShe definitely has an ridiculous misconception that her class is the only class, so take from that what you will.\n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "March 04, 2007",
            "review_content": "\nWondeful professor and material covered.  Unfortunately, endless memorization for the midterm and final ruin the class. Higonett seems to assume her class is the only class you are taking which is not only frusterating but also detrimental to your grade in other classes.  It's a shame.\n"
        },
        {
            "course_name": "Collecting (Fall 2006)",
            "review_date": "January 19, 2007",
            "review_content": "\nFirst the good side. Prof. Higonnet was knowledgeable, well organized and articulate. She was in the process of writing a book on museums, so this course was a good adjunct of her. She is friendly and encourages class discussion to a limited degree. Prof. Higonnet made good use of Courseworks to post her syllabus and copies of the various slides used during the course.\nNow, the less good. The readings were well chosen and quite heavy. Unfortunately, never were any of the readings discussed or addressed. They just seemed to be an appendage unrelated to her lectures and had little or no effect on the course grade. As others have noted, SHE DOES NOT ANSWER E-MAILS, even to clarify her syllabus. There were a number of museum visits connected with the course, but her presentations there seemed superficial; she herself did not show up to a few of he museums because she had not received permission, in some case, to lecture there.\nOverall, the course suffered from indigestion since she seemed to discuss every museum under the sun superficially while not going into any depth about the truly important institutions. Perhaps, she was only doing the first draft of her book. The final exam was \"cancelled\" and the course grade depended on a few short and one longer take home papers. This does not mean that her grading was \"easy\".\nA number of students have commented on her clothing and how well dressed she came to class. This is totally irrelevant to the course and is sexist!\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "January 21, 2006",
            "review_content": "\nMy favorite class last semester.  Basically everything that the other reviewers said is true, but all I know is that I would sit in class, engrossed.  There were actually a couple times when I looked at my watch not to see when class ended but in the dread of the lecture ending.  I was just fascinated by the material.  All my friends in the class also loved it.  It's annoying that there are required sections, it's annoying that your papers require actual references to the readings, but a lot of things in life are annoying.  We're at school not just for the outcome but the experience of learning itself.  All I know is that this learning experience was supremely enjoyable.\nWorkload:\nShe's generous by giving a slide list, so just memorize those and you're good.  Pay attention in class.  It's not super slack, but it's more than manageable.  \n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "January 17, 2006",
            "review_content": "\nProf. Higonnet is an amazing woman. She is smart, eloquent, well-dressed, and extremely knowledgable. However, you have to admire her from afar because there are no questions taken during lecture, she doesnt respond to emails, and is basically inexcessible. The TAs are great and helpful...but if you want her attention you may have to schedule meetings with her after. Class.\nThe material for the class is amazing! She does a lot of social theory and vosual culture but the papers are formal analyses that must reflect the ideas in the readings (visual culture and social theory).\nTake this class if you have the time to devote to it. Its not as easy A, but its certainly possible. \nWorkload:\n2 papers (1 formal analysis and 1 comparison of two works). Graded strictly but not insanely. TAs expect a good amount of thought put into developing a thesis.\nMidterm was easy and final was really difficult. The essay questions were all quotes from artists and hisotrians that had to be used to write broad essays...assuming they were leniantly graded because of the difficulty of the questions\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "December 16, 2005",
            "review_content": "\nWhile I like Professor Higonnet, I have mixed feelings about the class. Higgonet intersperses lots of social theory and cultural context in her course, some times (not always) at the price of reducing the time she actually engages with changing pictorial/formal practices. She is very good at this, and if this is your area of interest in art history then you should totally pursue taking her class: she is funny, lively, articulate and informed. The downside is that I believe many people had difficulties \"reading\" a painting formally without any prior art history knowledge, which was problematic considering the TAs wanted the focus of papers to be on formal qualities of specific works of art. Also, if you are more interested in changing pictorial styles, phenomenology etc. Higgonet's class - and arguably any class on 19th century art - will not be the right place for you. \nWorkload:\nfair amount of work - not too little, but not too much. \n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "November 18, 2005",
            "review_content": "\nI like Prof. Higonnet personally, and I'd agree that she's better dressed than the average professor, but I find her lectures confusing and flowery. When she talks about art she tends to use a lot of big words and metaphorical language and then gets lost in, in the end faltering or exclaiming or sighing without completing her sentence or fully pursuing her point.\nThe typical situation is I have some inkling of what she is trying to get at with her delivery, which usually takes the form of vague abstract concepts like \"motherhood\" or \"revolution\"--these are some of the keywords that she drops every five seconds. But while that might be sufficient for gallery chitchat or for artists waxing about their own work, it's not rigorous enough for a univeristy course. For countless times I have sat in the classroom wishing she would just \"drive her point home\" instead of throwing out vocabulary and leaving students to make their conclusions.\nI don't doubt that she is learned and intelligent, and I don't think she is purposefully irresponsible, but she has trouble transmitting her knowledge to us. Part of me also suspects that the vagueness and jargony-for-the-sake-\nof-jargon rhetoric come with the turf of modern art. Buchloh was like that at times, although his lectures felt like he used the jargon and rhetoric with full control. With Higgonet, I'm not always sure if she has thought through what she says.\nThis class is not completely a negative. The art is great and accessible, and just sitting through the slides can be a pleasure. Prof. Higonnet isn't big on formal analysis, but rather she focuses on social and historical contexts, which are helpful to know and somewhat painlessly retained when tied to your visual memory. The readings are long and sometimes dense but generally insightful and selected by Prof. Higgonet with evident thoughtfulness and care. In fact, they are much more rigorous than her lectures, again making me think that her problem is with live verbal delivery, which is quite common.\n\nWorkload:\nA lot of reading, which is expected to be seriously reflected in your papers and exams, and thus not skippable. Not all images shown in class but only those on a selected \"master slide list\" have to be memorized, although the IDs on the exam are unforgiving. There is no partial credit--get one detail wrong (date!) and you get 0 point. Personally, I don't really see the pedagogical purpose of forcing students to memorize dates accurate to the year (unless they reflect something major like the French revolution or they determine the sequence of direct artistic influence). If you went on to be a scholar, you'd look up the data when you needed them. For casual understanding, the time accurate to the decade is enough. So I'm not very happy with the strident grading.\n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "November 12, 2004",
            "review_content": "\nProfessor Higonnet is a great professor. Her lectures are always clear, informative, and engaging (although the same cannot be said of many of Intro to Art History's guest lecturers). Higonnet is truly passionate about what she teaches, and her love of the material is evident in the power and excitement of her lectures. I would highly recommend her to anyone with an interest in the subject.\nWorkload:\nA fairly large amount of reading (that you probably won't need to do a lot of if you attend class regularly), 2 short papers, midterm and final (both with IDs, comparisons, and long essay). Not terribly demanding, but heavy on memorization of artists and dates.\n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "May 01, 2004",
            "review_content": "\nProf. Higonnet is a great professor.  She is funny, intelligent, and curious.  She is totally interested and passionate about what she is teaching.  She can be a little repetetive sometimes and occaisionally disorganized, but I think a lot of it has to do with the TA strike.  Anyway, she is definately a character, always arriving to class in interesting, cool outfits- she's sort of like the aunt you always wish you had.  \nWorkload:\ntotally manageable\n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "May 01, 2004",
            "review_content": "\nProf. Higonnet is a great professor.  She is funny, intelligent, and curious.  She is totally interested and passionate about what she is teaching.  She can be a little repetetive sometimes and occaisionally disorganized, but I think a lot of it has to do with the TA strike.  Anyway, she is definately a character, always arriving to class in interesting, cool outfits- she's sort of like the aunt you always wish you had.  \nWorkload:\ntotally manageable\n"
        },
        {
            "course_name": "Childhood's Adventures in Wonderland",
            "review_date": "November 12, 2003",
            "review_content": "\nWhat a delight! Very smart and insightful.  Workload was fair and manageable.  She was very approachable outsite of class and always willing to help. I would reccomend her to anyone.\nWorkload:\n3 short papers (2-3 pages), 2 oral presentations, no exam\n"
        },
        {
            "course_name": "Impressionism",
            "review_date": "May 05, 2003",
            "review_content": "\nI would definitly agree with the last review--Higonnet is awesome! This is my first art history class and I am so sad I am graduating, because if presented with the chance, I would have definitly taken more classes with her.  Not only is she stylish and supremely cool, she is well spoken, funny, and knows her stuff! I made it a point to get to class early to get a good seat (and beware--lots of 'Lifelong Learners\" show up to this one!) and rarely missed a class just because I wanted to hear what Higonnet had to say (and what she was wearing). \nWorkload:\nnot bad at all--didn't do much of the reading during the semester. 3 museum trips, a midterm, final, a long paper, and a short paper. A fun class overall. \n"
        },
        {
            "course_name": "Impressionism",
            "review_date": "March 28, 2003",
            "review_content": "\nShe is hilarious and brilliant, she teaches you more than just the art but also the way of seeing vidual surrounings in life, she is a really good professor as well as a feminist, it is an enjoyment to be in every class(although nobody takes attendance, the classroom is always full)\nWorkload:\nmidterm, final , 2 papers, pleasant overall!\n"
        }
    ]
}