{
    "prof_info": [
        {
            "prof_name": "Giovanni Ruffini",
            "prof_id": 1073,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "The Roman World in Late Antiquity",
            "review_date": "June 19, 2007",
            "review_content": "\nDr. Ruffini's great - a spellbinding lecturer with an incredibly dry and an oft-irreverent sense of humor.  Who else would compare David Blaine to early Christian monastics?  Sitting through Roman History in middle school left me in awe, but unfortunately this feeling fades away through high school and college as some of us become too jaded about dead people and their eras.  This class, covering the late Roman/early Byzantine period, made me feel like I'm twelve again.  I mean that in a good way - everything was fresh and new, a welcome departure from the typical Roman history classes of Brutus betraying Caesar and the like.  I knew very little about Late Antiquity, the time period that falls between the cracks of the classical and the medieval, and I imagine that's the case for a lot of my fellow history majors too.  Dr. Ruffini made me care about hair-splitting debates over orthodoxy, crazy emperors who went around biting servants, and the long Byzantine downfall.  I was actually angry when I had to miss class, that's how good it is.    \nWorkload:\nNot too bad.  Originally we had to write 2 13-15 page papers, but then it was changed to one 20 page paper, and finally 15 pages.  TONS of primary source readings, but if you liked Herodotus or Thucydides in Lit Hum, it's good fun.  Plus they taper off towards the end.  Midterm and final too, for which Dr. Ruffini gives the class an ID handout.\n"
        },
        {
            "course_name": "Roman World in Late Antiquity, Spring 2007",
            "review_date": "May 16, 2007",
            "review_content": "\nThis guy is one of the best History lecturers/professors at Columbia. He is clear, concise, and truly cares about the material and his students. His lectures were a pleasure to attend as the material was presented clearly. He is not boring and his witty observations are funny and \"down-to-earth.\" If he didn't know something, he'd gladly look it up. This class was not easy but he made the material accesible and entertaining.\nMr. Ruffini is an asset to the History Dept. One of the best at Columbia! \nWorkload:\nTwo exams and a term paper. Lots of reading.\n"
        },
        {
            "course_name": "Ancient Greek History, 800-146 BC",
            "review_date": "May 09, 2002",
            "review_content": "\nNOTE: Giovanni is not actually a professor at Columbia, he's a grad student in ancient history. That said, if he teaches here again, seek out the courses he TAs, regardless of the professor. I never thought a discussion section could be so helpful and fun. He was great at distilling the contents of the lecture and helping to understand complicated governmental systems or battles. He usually knew the answers to our questions and if he didn't he found them out and e- mailed the section with the answer. Simply put, Giovanni is the man.\n"
        }
    ]
}