{
    "prof_info": [
        {
            "prof_name": "Jonathan Voris",
            "prof_id": 12728,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Artificial Intelligence",
            "review_date": "January 13, 2014",
            "review_content": "\nThe rest of the reviews are pretty accurate about this class but I figured I should add in a bit to just explain Prof. Voris. Let me start by saying Prof. Voris is a terrible human being and might be one of the worst people I have ever met. He would often belittle students for asking questions related to class material or about class policies. His assignments were based off what we learned in class with the majority of the difficulty coming from the insane amount of fluff put on top of them. Like he gave us games to encode a solver for and I must have spent 1% of the time on the solving algorithm (the important part of the assignment relevant to the class) and 99% of the time dealing with the absurdly detailed rules of the game that had no reason to exist beside to waste our times. Now back to the real problem Voris. Every time a student asked him for something, like if he could post the blank midterm online after we got it back so we can study it for the final, he would answer in the most demeaning way ever. Every question he felt was a personal attack on himself. Now I am by no means a psych major, but I would say he had a huge fear of being seen as inferior. He would oftentimes go on rants about how in his college, which is some local school that most people have never heard of, he had it so much harder and how Columbia students were entitled and a bunch of cheaters. This rant about how much harder he had it occurred so many times and he would constantly belittle Columbia students as a whole. He clearly was trying to somehow prove his superiority to a bunch of kids who never saw him as inferior in anyway. All I can say is that he has some deep issues and probably would be better suited to teaching at a community college where he does not find the need to always defend himself even if the students are not attacking him. My favorite example of him being an ass if when he was trying to hand out the midterms and basically put them all in one giant pile in the front and told the students to come get it. Of course everyone got up and was gathered around the table. Now what does Voris say? He starts repeatedly yelling (for like 10 minutes straight) \"You all are animals and you should be ashamed of yourselves! I never saw this when I was in school\". He clearly has no idea what he is doing and I hear Columbia is looking to hire a real AI teacher (Voris can't teach very well either so this is a good thing) so hopefully he will never teach a class again. But Voris if you are reading this please go see a Psychologist you have some issues that need to be worked out. \nWorkload:\nEasy midterm and final (Although Voris will be an ass during them so yay?)\nAssignments were unnecessary tedious, but the AI parts were easy \n"
        },
        {
            "course_name": "Artificial Intelligence",
            "review_date": "December 08, 2013",
            "review_content": "\nI took this class with Prof. Jonathan Voris.  I'm pretty sure he was roped into teaching the class right before the semester started, if that's worth anything when considering this review.\nQuick Summary:\nGood lectures (if a bit dry; depends on your taste)\nRanges from very approachable to completely unapproachable\nDoes not deal well with grades.  \nProf. Voris was a good, solid teacher.  He taught the material well, and was mostly light-hearted about the material.  He really seemed to enjoy the class when he took it (7 years ago I think), and he definitely transferred that joy over to teaching it this time around.  I liked his lectures, though sometimes they were a bit dry (often the material was at fault).  Basically, Voris is a good teacher.\nHowever, Prof. Voris comes with a special type of schtick.  The best approximation of an explanation of it is a mix of ego and paranoia.  When it comes to grades, he seems paranoid that every student is willing to kill him if that will give them a better grade.  This is not (much) of an exaggeration; he really is paranoid about this.  When it comes to anything involving grades, simple questions offend him like the deepest of insults, and he is completely unreasonable.  When handing out the midterm, after failing to get students to come up in an alphabetical order, he just dropped all the tests on the table, and sat back, calling the students \"animals\" and \"disgusting\" while everyone searched through the mess to get their tests.  Not cool.\nAlso, if he can't understand a question, he often assumes that the question is stupid, and sometimes even worthy of mockery.  He will always try to explain a question once, but if the explanation is not sufficient for the student, and he thinks that it was, he will make comments like \"I don't understand what's not to get.\" or \"This is pretty simple.\"  He is in desperate need of learning the phrase \"Why don't you come see me after class?  I'll explain it then- we should move on\".\nThis ambiguity often translates to the workload- the projects were good, but the formatting was often unclear.  Tiny details that made actually finishing the damn things a nightmare.  To be fair, many students just seemed to ignore what was actually written in the project assignments in regards to submission details (\"Must run on a CLIC machine\" seemed to be an oft ignored instruction for many students).  All in all though, the details just needed to be crystal clear, and they weren't.\nHis midterm and finals were VERY reasonable.  However, the grading of them weren't.  He hasn't posted our final grades, so it is unknown whether he will curve or not, but some of the ways he took off points were pointless.  The purpose of a test is to test our knowledge of the material, not our ability to decipher certain cryptic instructions.  The questions were good- they were actually really good tests.  But, like I said, the grading was off.\nAll in all, he was good for learning the material, and terrible for anything to do with grades.  Just a bit of a nightmare to deal with the schtick.  Not a bad person, just not adjusted to teaching (yet).  If he shapes up on the grading thing though, he could definitely be a really great prof. in the future!\nWorkload:\n4 projects(15%), a midterm(15%) and a final(20%). 5% class participation.\nAlso pop quizzes, but they are counted as 50% of class participation.  So NBD.\n"
        }
    ]
}