{
    "prof_info": [
        {
            "prof_name": "James Russo",
            "prof_id": 3495,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Genetics",
            "review_date": "May 06, 2006",
            "review_content": "\nAviv and Russo split the lectures. All their lectures are powerpoint based. We had homework due on Monday (only helps if you are borderline between two grades at the end of the semester) and quizzes (20% of grade) every wednesday. Overall, the  class is very typical science class. I attended lectures (I don't understand why one wouldn't at Columbia; you avoid spending more time reading the book and in this class, the book was more a reference for the lectures then actually required reading) and overall found them to be very informative and interesting. However, Aviv's powerpoints are MUCH better organized than Russo's. When I reviewed for the exam, I found it very easy to go over Aviv's lectures. He is less wordy and organizes the slides well. Russo is the opposite. Too many words, not very articulate, and too much information per slide. I never went to recitations so I can't comment on the TAs. The exams were average; not too hard, not too easy. Because they make you take quizzes, I kept up with the material and only had to study/review the day before the two midterms and one final they give. I did above average on both midterms. I haven't taken the final at this point, but it's exactly like the midterms (combination of multiple choice, T/F, fill in the blank, short-answer questions) and is cumulative. One warning about the exams: they take forever. Both midterms, the majority of the class stayed all the way until the end trying to finish. Russo's material is generally harder to study, not just because his powerpoints are worse than Aviv's but because he likes to teach methodology in genetics research, which can be confusing if one doesn't have confidence in understanding scientific research (Aviv more likely will present a breakthrough experiment that helped move genetics forward and you are expected to know the general methodology and conclusion of the experiment; i find it easier to study examples rather than to learn the general methodology like Russo teaches). I liked the professors alright; Not a huge fan of either, but didn't hate them. Overall, I would recommend this class if you're interested in genetics.\nWorkload:\nQuizzes every Wednesday (can drop 1), Homework (optional) every Monday, two midterms and a cumulative final.\n"
        }
    ]
}