{
    "prof_info": [
        {
            "prof_name": "Nader Sohrabi",
            "prof_id": 1779,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "MDE W3000y: Theories of CultureL Middle East and South Asia",
            "review_date": "January 21, 2009",
            "review_content": "\nHe's fine. A really sweet man who occasionally rambles. Nobody attends lecture because he doesn't take attendance.\nBut the readings are really, really good and with an excellent TA, I was able to get SO much out of the class/discussion sections - without actually attending many lectures.\nWorkload:\nIn-class midterm, in-class final, one final paper (4-6 pages), and weekly discussion sections. (In my section, we had to submit a four-sentence summary of the readings each week.)\n"
        },
        {
            "course_name": "Theories of Culture",
            "review_date": "December 15, 2007",
            "review_content": "\nWhat some of the earlier reviewers have said about the boredom of Professor Sohrabi's lectures is somewhat true, although he's definitely not the worst lecture I've encountered here--more in the middle of the pack.  However, he makes very funny asides that serve to make some of his rambling tolerable.\nThat said, I highly recommend this class for its content, which is excellent.  Sohrabi has done a fantastic job of choosing readings, and at the end of the course I can really appreciate the ways they relate to, modify, and contradict each other--which is to say that the course as a whole seems to have come together in some way at the end, even if it doesn't seem to during the fact.\nWorkload:\nAn intense amount of reading; you do need to do some of each reading because lecture won't usually be a substitute, but you don't need read all of each book or article to be able to understand the theory at work.  Tests are reasonable; there is also a paper which is not long.\n"
        },
        {
            "course_name": "Theories of Culture",
            "review_date": "October 19, 2007",
            "review_content": "\nEarlier reviewers have been unfairly harsh to Professor Sohrabi.  No, he will never be called the best of lecturers, but one has only to pay a little more attention to get something out of what he says.  Furthermore, he is a genuinely nice guy who wants to help students, and significantly in a department full of enormous egos, he's not above laughing at himself.  His jokes, silly as they may be, nonetheless served to lighten the lectures considerably.  I would appreciate it if he were a little more organized, but overall he's not bad for a required class.\nWorkload:\nA lot of reading.\n"
        },
        {
            "course_name": "Late Ottoman State and Society",
            "review_date": "December 28, 2006",
            "review_content": "\nSohrabi is a decent guy, approachable, etc., however, he is not suited to lecture. This class should be in a seminar format, if at all, but instead, we have to sit there for 75 minutes, two times a week, and listen to him lecture from his notes. He drones on, and in short, is a frightful bore. Avoid him.\nHe is also a sociologist, not a historian; he knows little about Islamic thought and offers poor insights into an important part of Ottoman thought. There are better options if one is interested in Ottoman history. \nWorkload:\nGood readings, 3-4 hours a week; decent grader.\n"
        },
        {
            "course_name": "Theories of Culture",
            "review_date": "January 06, 2005",
            "review_content": "\nFantastic readings, important theories...lectures are like a slow, torturous death. Painfully drawn out summaries of occassionally difficult but more often quite comprehensible readings were difficult to swallow for an hour fifteen every class, and Nader often gave up and let us out early. I will say he made his best effort and even became quite emotional during the last lecture, hoping even to raise the number of credits received for all our hard work. He also was typically good at providing a decent visual matrix of sorts through which to see the various theories which we encountered. Nevertheless the class is obviously not his forte (which is Ottoman history, especially evident from those lectures he gave on the subject, which stuck out in their enthusiasm and detail). Both TAs were fantastic and, I'm sorry to say, could probably have made the semester more interesting had they lectured more often than Prof. Sohrabi.\nWorkload:\nGargantuan readings- hundreds of pages per class of oten dense theoretical literature. A midterm and final consisting of IDs and essays, and one 10 page research paper touching on various theories encountered.\n"
        },
        {
            "course_name": "Theories of Culture",
            "review_date": "December 25, 2004",
            "review_content": "\nAt the end of the day, I'd say this was a good course, although that probably isn't something that you'll think while taking it. It's interesting stuff, but very academic and quite confusing most of the time. Most of the readings, and there are a lot of them, were very tough to get through, and most of the time I just gave up on them. But, when I had to cram for the final and the stuff began to gel it was neat and I found myself wishing that I had taken the course more seriously. You should take this class with a friend if possible since the lectures are sometimes very tedious, although he usually manages to make the hour go by. However, despite all of my going back and forth on the course, the one thing that seriously impressed me was Prof. Sohrabi. The guy is very nice, and seriously cares. For example, on the last day he got pretty emotional and said something along the lines of \"I just want you guys to learn\" before he left. \nWorkload:\nLot's of reading (they are thinking of making it a 4 pt. course) and one 10 page paper, midterm and final. It's a lot of work, and the material can be downright painful, but in the end, it's worth it. \n"
        },
        {
            "course_name": "Late Ottoman State & Society",
            "review_date": "April 24, 2004",
            "review_content": "\nProfessor Sohrabi is one of the best instructors I have had at Columbia so far. A great lecturer, he knows the topic very well and is extremely enthusiastic about it. Approachable, kind and interesting. \nThe readings he assigns are opposing each other as well, so the student gets an overall view.\nI highly recomend this course to everyone.\nWorkload:\n2-3 hours worth of reading every week.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 14, 2004",
            "review_content": "\nI think the last few reviews of Nader are a bit extreme.  He's not the best CC professor nor is he the worst.  I think this was his first semester teaching it, and I do give him kudos for not making this experience hell.  Nader delivered some great lectures on the more contemporary thinkers.  His grading was pretty fair, and he seemed to care about his students' progress and wanted those who don't participate to talk more.  He's a pretty good instructor.  But I think if anything, his class lacked structure.  His essay topics were usually awful, class discussions often spiraled into useless crap (e.g. angst from literary topics not resolved from Lit Hum, which had absolutely NOTHING to do with CC), he let students who obviously had not done the reading waste a whole bunch of time talking about issues that could have been resolved had they done the reading, and other bad things.  But he's a nice guy.  Smart too.\nWorkload:\nI think you read more but write less in Nader's class.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 17, 2003",
            "review_content": "\nIndeed, this semester has seen professor Sohrabi improve as  the readings moved away from the Greeks and religious texts and closer to ideas that he can talk about with a great fluency, and on which he can lead discussions quite well.  He is a very nice man, very pleasant and open to talk to about your ideas for papers, about the course or about the progress of the class in general.  I wish that he had been more consistently willing to take risks in his direction of our discussion, and try to push the class forward; whenever he did so it was a success.  Yet, there was a degree of intellectual lethargy present in the class that seemed to pose a serious obstacle for Professor Sohrabi.  Too often did he resort to repetition of the most basic points, seemingly unconvinced that the majority of the class had yet caught on, and was therefore unready to move forward.  All in all, though, it could have been much worse.  And, again, he's a really nice guy, and does really know his stuff.\nWorkload:\nCC\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 15, 2003",
            "review_content": "\nGetting a good CC  teacher is like gambling with the devl -- you're probably going to get screwed over. But you're pretty lucky if you get Professor Sohrabi. The last review was unbelievably inaccurate. The class was rough in the beginning of the year because Sohrabi is definately not an expert on Ancient Greeks, or anything too pre-modern. However, the detrimental contributions and inane comments from the class itself did not help. Professor Sohrabi is really good at summarizing and condensing big themes and sweeping comparisons. He balances discussion and lecturing well; again, his lectures were only boring at the very beginning. Most of the time, he makes really interesting points, and he keeps getting better as the course goes on. His grading is pretty fair (although, I must admit, his essay questions leave a LOT to be desired). But overall, the man certainly knows what he is talking about, and he clearly gets excited when his students contribute meaningul comments to discussion. He is exceptionally good at listening to comments and questions and really trying to understand what the student is saying. Basically, as long as you're not too in love with anyone B.C., you're pretty lucky to have Sohrabi. I'm definately looking forward to another semester with him. \nWorkload:\nLighter than most sections: 3 5 page papers (but the questions are pretty rigid, boring, and simplistic), very doable midterm and final, usual reading + one addition. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 14, 2003",
            "review_content": "\nProfessor Sohrabi is far better than the previous review would have you believe. I will admit that the beginning of the year was a little rough; the Ancient Greeks may not be his forte. However, he has become increasingly engaging and stimulating as the year has progressed. While his early lectures were sometimes repetitive and lengthy, that was probably the result of insecurity rather than any other vice or deficiency. The undergraduate specimens are just as much, if not more, to blame for any problems. Professor Sohrabi definately knows what he is talking about, and many class discussions have been excellent. Generally, he is good at balancing lecture and discussion, and he excells at condensing large themes and broad comparisons. He also seems to be a very, very nice guy. Now, only his rather simplistic essay questions need amending.\nWorkload:\nLight compared to most sections. Three 5 page papers, the usual reading, a midterm, and a final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 16, 2003",
            "review_content": "\nThis man clearly does not want to be teaching CC.  He is apathetic toward both students and the coursework.  His knowledge of the material is questionable.  On a good day, he speaks for about 5 minutes of the class period; the rest of the time is dedicated to the College students and their uninteristing personal monologues.  To be honest, I don't pay 40k / year to sit in a room and hear other students, most of whom haven't read, give their opinions.  This man overflows from his chair and asks ridiculous questions that will in no way ever be tested.  Once he asked, \"do you think Bill Gates would agree with Plato's notion of the ideal city?.\"  It is already 3 months into the course and he still does not know our names.  He asked us to photocopy our ID cards and you hear him ruffling through them during class.  Avoid him like sleeping sickness.\nWorkload:\nThis semester, he assigned 3 essays, a midterm, and a final.  He was unprepared to assign two of the essay topics so he let us pick topics of our own.  Mediocre workload.\n"
        }
    ]
}