{
    "prof_info": [
        {
            "prof_name": "Linn Mehta",
            "prof_id": 1756,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "The Americas",
            "review_date": "July 18, 2015",
            "review_content": "\nProf Mehta encourages you to find your own voice and seek out your own interpretation and meaning in the material, which makes her a rare gem among the overly pedantic, egotistical English teachers that we all know too well. I wasn't interested in Latin American literature at all before taking this course but Prof Mehta made me fall in love with it. She's open to a more creative slant on assignments, and she believes in pushing you to find the beauty of the written word. She is one of the best professors I've had at Barnard and I urge you to take her course-she's one of those \"life changing professors\" that the Barnard recruiters were telling us about when they convinced us to come here. \nWorkload:\n4 Papers, the last of which can be either creative or analytical (basically anything of your choosing) and can be an extension of either the second or third paper\n"
        },
        {
            "course_name": "First Year Seminar",
            "review_date": "May 05, 2015",
            "review_content": "\nFirst Year Seminar: The Americas\nProfessor Mehta and I got along like oil and water. Shade was thrown 24/7, and I think there was a mutual dislike of each other, which you could tell even whilst in class, where she would subtly try to make all of my arguments fall through, and always look shocked when I said something that could be construed as smart. She also is very easily side-tracked, and picks favorites.\nI came into the class not quite knowing what to expect, but I'd heard good things about her. We had much more work than other seminar classes, and it was treated more like a first-year English class than a seminar. Each paper had its own spin on it; one time we had to give a speech to the class, one time we had to do a creative writing, etc. \nYou don't really need to read the books to keep up in the class, and most of the class is discussion. This is, however, a pretty work intensive course, with a great deal of readings as well as writings. However much we did not get along, I will admit that my writing did improve in her class. I felt my writing tighten and was much less wishy-washy. which is funny, because she always gave me poor grades on my assignments because she felt I was \"too concise\". She very much likes students who are prolix and are deeply interested in subject matters that come up in her class. Otherwise, she won't really be fond of you. Mehta is very good with drafts, and she always meets with students one-on-one to help them out, and responds in decent time to emailed drafts for more input. Her grading is generally quite fair.\nWorkload:\nFour essays, mandatory time with speaking fellows, numerous readings, homework assignments. Can be handled, but is on the heavier side.\n"
        },
        {
            "course_name": "First Year English: The Americas",
            "review_date": "May 21, 2014",
            "review_content": "\nI am so grateful that I had Professor Mehta for my first-year English course. \nSHE IS AMAZING!!!\nShe single-handedly gave me the \"small liberal arts school\" experience that made me choose to attend Barnard. She works one-on-one with each student, and is interested in their lives outside of class. I found that I spent extra time on her class because I knew that she would give me specific feedback on even my best work, so the more I put in, the more I would get out. I decided to take her class for my first-year Seminar, and again, found it incredibly rewarding. \nWorkload:\nAbout 5 papers with multiple drafts each, flexible deadlines. Small presentations. Lots of reading and in-class discussion. Individual meetings and meetings w/ writing fellows or speaking fellows. \n"
        },
        {
            "course_name": "First Year English: The Americas",
            "review_date": "January 19, 2011",
            "review_content": "\nOne of the nicest and most understanding professors you'll ever have. She has a really intriguing life (she's married to a famous Indian author, and invited her students over to her house for a meal at the end of the semester) and incredible passion for all of her subject material. She's very encouraging during discussion, which is great for first-year students who are hesitant to speak up. The class will really bolster your speaking skills. \nThe reading assignments bordered on excessive, and we didn't even discuss most of it in class. She could have done a better job with facilitating more enthusiastic discussion. The papers assigned covered a broad range of writing styles, and I guarantee you'll be a better writer upon finishing the course. Her conferences are very helpful, though she rarely ever criticizes.\nWorkload:\nmoderate: no exams, just four papers + participation\n"
        },
        {
            "course_name": "The Americas",
            "review_date": "April 09, 2010",
            "review_content": "\nLinn Mehta is a great professor. She knows so much about her field and all the readings that she is always happy to clarify or help get the discussion started. Also she is extremely helpful in improving writing skills. I was lucky enough to have her for both semesters of my first year and my writing improved immensely. I started out as someone who would write about something boring and safe just to make sure it made sense and by the end of the year I could write about much more complicated topics with more confidence and clarity. I would highly recommend this class and Professor Mehta. She is such a nice person, always willing to meet with you to go over drafts or simply to talk about ideas. At the end of the semester, she invites you to her apartment for Indian food which is also very fun. If you have the chance, definitely take this class! It's full of interesting reading, discussion, and writing.\nWorkload:\nLots of weekly reading but not too overwhelming. 3 or 4 shorter papers 2-5 pages in length. One longer 10-12 page paper at the end of the semester.\n"
        },
        {
            "course_name": "The Americas",
            "review_date": "September 02, 2009",
            "review_content": "\nI loved this class and I loved Prof. Mehta. She helped my writing skills so much. I know that for some people in my class she demanded quite a few drafts, which I can understand can be annoying, but it's only because she wants your writing to improve and she wants to give you a good grade. For me, she was always open to me sending her as many drafts as I wanted and she really helped me clarify my writing. After each rough draft she would always write detailed notes and critiques as well as engaging in a 10-15 min long meeting, where instead of speeding through it and looking at her watch like most professors, she acted as if she could give you as much time as necessary to really help improve your writing.  \nWith the class being only 16 girls, she molded herself into more of a member of the discussion than an overseeing professor. When we (as a class) were really getting into the nitty, gritty analytical parts of the literature she was always helpful with her thoughts and helped to move the conversation along. That being said, there was some amazing girls in my class who honestly made the course that awesome. Being a lover of analyzing lit myself, there were quite a few of us in this class so we didn't really need much guidance when it came to discussion. Mehta didn't even really lead the discussion (which I appreciated), she prompted us with a few questions or thoughts but other than that my class was pretty self-sufficient. \nI know a lot of people hate their seminars and whatever, but I was so lucky. This class was amazing. On the last day of class, everyone was saying how this was the way people imagine college classes: deep, interesting, expanding and engaging. \nWorkload:\nA lot of reading, 3 papers (a rough draft is required to be turned in, but is not graded) and then one final 10 page paper (which she gives back to you so you can see where you got points off)\n"
        },
        {
            "course_name": "Americas First Year Seminar",
            "review_date": "May 24, 2008",
            "review_content": "\nMehta is a sweet lady with absolutely no business leading a discussion-based class.  She was so unassertive that our class walked all over her which, reasonably, upset her to the point of scolding us often.  Mehta lectured for almost half the class and then was shocked when we did not participate in the narrow dicussion topics she gave to us.  We were not allowed to lead our own class or set the tone for any of the discussions.  Sitting through an hour and fifteen minutes of this class was insanely excruciating.\nWorkload:\nNot hard.  She will extend any deadline for weeks if asked.  A fair grader to some and a demanding dictator to others (demanding 4 or 5 drafts when others had only 2).\n"
        },
        {
            "course_name": "The Americas",
            "review_date": "September 12, 2007",
            "review_content": "\nI love love LOVE this woman! She knows everything about the subject matter, genuinely cares about her students, and rewards those students who show her how much of an effort they are making. There are not enough nice things I can say about this professor. The class was one of the most rewarding experiences of my life and I would take it again if given the opportunity. I only wish I were an English major to be able to take more classes with her. At the end of the term she invited my class to her apartment to have an Indian lunch. She's just so great. Take classes with this professor! I can't fathom what anyone WOULDN'T love about her. \n\nWorkload:\nlots of readings, a few papers which are rather fun to write. She gives her students a lot of freedom with paper topocs. One big final paper and 5-7 shorter papers. She makes it pretty easy for her students to do well.\n"
        },
        {
            "course_name": "The Americas",
            "review_date": "March 13, 2007",
            "review_content": "\nProfessor Mehta may seem too timid to direct a class at a first glance - but don't be fooled, she is an incredibly strong and knowledgeable professor. Once she begins to lecture on the course material, her reserved demeanor disappears, and you realize she houses a vast expanse of knowledge on everything literature-related. She comes to her lectures very well prepared, equipped with all sorts of hand-outs to complement the material being read. Her lectures are interesting, not just for the literature chosen, but also because of her own enthusiasm and engagement with the material.\nIn addition to her intelletual prowess, she is a very sweet and caring person. She will meet with her students whenever needed at whatever time. She is very kind with her criticism and honors differences in personal style. She makes sure she gets to know her students as individuals outside of the class setting, and is willing to serve as a mentor for any questions you bring to her.\nBOTTOM LINE: The course material is interesting and thoroughly taught. My writing style also improved under her gentle, guiding hand. Despite having the class at the early hour of 9 a.m., I always looked forward to it because Professor Mehta made the small seminar room a warm, comfortable, homey environment for her students.\nWorkload:\nFair - Interesting literature and 4 papers, each with several revisions that she helps you work through.\n"
        },
        {
            "course_name": "The Americas",
            "review_date": "January 08, 2007",
            "review_content": "\nWriting in college is difficult.  Few teachers have Prof. Mehta's patience and skill.  This woman taught me how to WRITE.  She really really cares about her students and allows rewrites.  She meets with everyone after each paper and sometimes its annoying but trust me ull appreciate her.  She is such a sweet woman and really facilitates discussion in her class.  I would love to have another english prof like her.\nWorkload:\nmanagable.  About a book every week or 1 1/2 weeks.  3 or 4 papers and a final paper i think\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "May 03, 2005",
            "review_content": "\nProf. Mehta is one of the most understanding professors I've had yet.  I feel l ike she honestly cares about her students, and she's always available if you need her.  She was very flexible with the paper deadlines, and she always let us write first drafts and even scheduled meetings to discuss them.  If you want to improve your writing, she's a great person to go to.  Unlike most professors at this university, she will give you the paper grade that you deserve, it's no easy A.  (probably an easy B though)  If your paper is bad enough, she'll give it back without a grade, and let you rewrite it.  She's a very caring and wonderful professor.  She even changed the syllabus for this awful class to fit our interests.\nWorkload:\nTONS of reading, a weekly courseworks write-up on each class, one student prepared discussion of a reading, 4 3-4 page papers and 1 5-7.  \n"
        },
        {
            "course_name": "Americas I",
            "review_date": "December 02, 2003",
            "review_content": "\nwhile the class was tedious, it's hard to say whether it was Prof. Mehta's fault or not: the first year english syllabus that she had no control in designing really sucks. also, it was a 9:10 class, so no one wanted to participate. Prof. Mehta is extremeley understanding: very flexible paper deadlines, always available to meet and help, always understanding if you're running behind. she's also happy to get rewrites, and her grading isn't easy, but it's always fair, with room for improvement. she's a good editor and a great resource if you really want to improve your writing or your grades. always available. i thought she was just a really nice person, so i'd be interested in seeing what a class of her own design, that wasn't taught at an ungodly hour, was like.\nWorkload:\nreasonable reading, 2 3 page essays, 1 5 page essay, 1 8-10 page research paper...allows rewrites.\n"
        },
        {
            "course_name": "The Americas",
            "review_date": "November 07, 2003",
            "review_content": "\nNot so hot.  Not suggested.\nWorkload:\nreasonable readings and papers\n"
        }
    ]
}