{
    "prof_info": [
        {
            "prof_name": "Daniel Rothschild",
            "prof_id": 3072,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "May 11, 2009",
            "review_content": "\nProfessor Rothschild seemed to be well meaning, but I have to agree with previous reviewers in saying that he is not a particularly good teacher.  Hopefully he has improved since I took this course in Fall 2007, but at the time I almost always left lecture more confused than when I arrived.  His scribbles on the board were not only confusing, but often incorrect as were the lecture notes he handed out at each class.  Sometimes he would jokingly berate students for not realizing he had made some critical error of logic earlier.  The optional TA discussion sections helped a little bit, although they too seemed confused about a lot of the material.  The textbook was dense, although at least clear.  The homeworks ranged from too easy to way too hard, and if you brought up issues with the homework content or grading, Rothschild would dismiss your comment since \"homework doesn't matter\" even though it did account for 10% of the final grade.  The first exam was very difficult, the second easier, and the final was relatively cake.  Overall I would not recommend taking this class with Rothschild.  What could have been very informative and interesting turned into a confusing mess.\nWorkload:\nWeekly homework assignments, 2 midterms, Final. \n"
        },
        {
            "course_name": "Philosophy of Language",
            "review_date": "February 24, 2009",
            "review_content": "\nDaniel is great at explaining rather complicated concepts.  Additionally, he's honest and careful not to make claims about things he isn't sure of.  He's approachable, makes an effort to work with students outside of office hours, and knows his subject (philosophy of language) very well.  I've heard, more than once, that students have a hard time understanding him when he speaks too quickly.  He does sometimes speak quickly, but it's never been a problem for me.\nAlso, he's anti-possible-worlds.  I recommend his classes.\nWorkload:\nA few articles to read each week, presentation, mid-term paper, final paper.  About dead-average.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "December 07, 2007",
            "review_content": "\nDaniel Rothschild is very young and very smart. It is too bad he cannot teach. He makes tons of mistakes on the board and in his lecture notes, which supplement an already horrendous textbook. His homework assignments presuppose material that we cover in class, and although he wants it to be challenging, it does not help for what we cover in class or what is covered on tests. He speaks very quickly, but often pauses in the middle of a sentence and closes his eyes to regain his train of thought. Because he speaks so quickly, material becomes very hard to comprehend and while he will call on you if your hand is raised, he seems annoyed. I recommend taking this class with another professor. Rothschild seems like he would only be good for 1-on-1 thesis advising in the Philosophy department.\nWorkload:\nabout 10 hw assignments. 2 midterms and a final. Final is 60% new material, 40% old material. He made first test extremely difficult for no reason. 2nd test, he was a little nicer.\n"
        },
        {
            "course_name": "Elementary Logic",
            "review_date": "December 21, 2006",
            "review_content": "\nElementary Logic is NOT a difficult course. But Daniel Rothschild (despite his pleasant nature and good intentions) does not communicate very well. He is, clearly, a new teacher. And he did improve over the course of the semester. So he may become a better instructor in future semesters... But, for now, if you are going to take this class--and you do not have a background in formal logic or programming--be prepared to learn from the book because the lectures are too freakin' confusing. Rothschild actually says things like, \"I know that what I just said didn't make any sense...\" and \"I'm glad I'm not a student in this class!\" Comments like that are honest, charming and self-deprecating. But they don't help you learn the material! I think he knows that he isn't the best communicator, though, so he keeps the exams basic and pretty easy. All you need to do to get an easy \"A\" is do the homework and pick up the basics. Also, if you are TOO confused after class to BEAR going forward, Rothschild and the TAs have plentiful and flexible Office Hours. They are ALL very nice! And they go out of their way to be helpful. \nWorkload:\nNine homework assignments - they each take less than an hour. Weekly reading assignments--you don't have to do them if you can intuitively understand the material. Three in-class exams, one after each segment. NO cumulative Final Exam.\n"
        },
        {
            "course_name": "Elementary Logic",
            "review_date": "December 10, 2006",
            "review_content": "\nEasy class. Weekly homeworks-take about half an hour to do, sometimes less if you know the material well. \nThree exams (non-cumulative) If you know it really well, you don't even need to go to class unless to hand in hw. \nEach exam was about 30% and hw was 10&\nWorkload:\nthree exams, weekly homework assignments from the book\n"
        }
    ]
}