{
    "prof_info": [
        {
            "prof_name": "Amber Carr",
            "prof_id": 12752,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "February 25, 2015",
            "review_content": "\nDr. Carr is one of the best professors I've had at Columbia. Yes, I had her for Frontiers of Science, but let me tell you: she made this class something I actually looked forward to going to. She is one of the sweetest, kindest, and most caring individuals I've met in academia. She really cares about her students and gives her all to ensure that her students are engaged, learning, and content. FoS was probably one of the worst courses ever, but if you had Dr. Carr, you'll know that she is the best. \nShe's a teacher that just wants you to be happy as a student, regardless of whether or not you're actually passionate about the subject matter at hand. That being said, she really tries to find ways to incorporate interesting facts, scientific findings, etc. into her seminars so that concepts make sense and the material doesn't feel vanilla and superfluous. If you're in her class, you're lucky. If you're not and you're trying to be now, you're welcome.\nAmber Carr is a super approachable person and she is such an interesting and awesome person. Her office hours were always super helpful and I personally went every week, some weeks to actually get help and some weeks to just turn in my homework and talk to her and have nice conversations. She is a wonderful person and professor, and she deserves the highest accolades, honestly. \nIf you're lucky to have her, make the most out of this class whether it's the class itself or the superstar who teaches it!\nWorkload:\nStandard FroSci workload, so easily manageable. Weekly problem sets graded for accuracy, but help is in abundance and there should be no reason why you shouldn't complete these with a high grade. In class quizzes for every unit in the class. A midterm and final with cheat sheets for both. A term paper which is both easy and fun to write as she makes the topics engaging and interesting. Occasionally, some small assignments for seminars which are very easy and take little time to complete.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 19, 2014",
            "review_content": "\nDr Carr is great! You can tell she genuinely enjoys teaching, cares about her students, and wants them to do well. Her seminar slides are so much clearer than the lecture slides, and it helps that they're organized according to key questions. She uploads them punctually every week, and I suggest looking over them just to see if you missed anything, and especially when you're making your cheat sheet. I also suggest going to office hours, even if you don't have any questions about the course material itself. I only started going towards the end of the semester, and wish I'd done it earlier. You can always talk to her about her research (some computational chemistry thing, which is actually pretty damn cool).\nSeminar itself wasn't super exciting, although I think that's less her fault than the fact that most of the activities we had to do because whoever came up with the syllabus decided we had to were kind of meh in the first place. On the bright side, Dr Carr is nice and funny and interesting, which makes boring activities more bearable. You also get the impression that she really knows her shit. If neither of those appeals to you, seminar often ends (up to half an hour) early.\nWe had a quiz for each unit, which I found annoying at first, but it turned out that they weren't hard, and Dr Carr is very generous with partial credit. I skimmed the notes briefly just before every quiz and did fine. The quizzes do count in a tiny portion of your grade, but if you mess up on one she lets you earn extra credit to make it up. On hindsight, it was kind of nice to have a checkpoint for the unit, mainly because I am super lazy when it comes to consolidating my work, or maybe just for FroSci in general. She also holds a review session before each exam, but if you can't make it she puts the slides, practice questions and a study guide on Courseworks. All in all, I felt she really prepared us well for the exams.\nThere's also a term paper, but nothing to worry too much about. She's a pretty easy grader. Also, she gave us deadlines for the first draft and peer review, so you definitely won't be cranking it out from scratch the day of final submission - which will be around the annoying time at the end of the semester when everything is due. Trust me, you will be very grateful.\nWorkload:\nStandard FroSci workload: weekly homework (which is actually graded, but as long as you don't completely bs it it should be fine); quiz for each unit; small assignments to prepare for seminar from time to time; term paper. Midterm and final, both of which you get to bring in a cheat sheet.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 02, 2014",
            "review_content": "\nCongratulations!! You were randomly placed into one of Professor Carr's Frontiers of Science discussion section.  Unlike many other Columbia students, you will not come out of Frontiers hating it or feeling like you have got nothing out of it.  Professor Carr is a great professor who truly cares about teaching her students.  Her discussions are fantastic and she will make sure you all the important points that the lecturers made.  She has office hours set up and she is always there and willing to help you.  She frequently stays after office hours helping students though I would recommend that you actually get to her office before her office hours end.  Although discussion is great, Professor Carr does a great job explaining the material during office hours.  Besides her obvious teaching strengths, she is an extremely nice professor who truly wants to help all her students (besides teaching, she has offered to give us advice on how to get a research position as undergraduates).  She does really interesting research and has other experiences that you should talk to her about during office hours (she actually was invited to the UN during one weekend when I was taking her class).  Overall, she is a great professor and I wish Frontiers of Science was a year long class because of her. \nWorkload:\nWeekly problem sets for a grade (pretty easy as long as you try to do them and impossible to fail if you go to office hours), In-Class Assignments (never picked up), Quiz for each unit (not incredibly difficult if you understand the concepts Professor Carr talks about in class), Term paper (not hard as long as you don't procrastinate), Midterm (fair), Final (haven't take this yet but supposed to be like the midterm).  If you go to discussion and office hours and do the homework, you can get an A in this class (lecture might be helpful but I don't know because I was half asleep at all of them). \n\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 07, 2014",
            "review_content": "\nDr. Carr is the sweetest, most understanding, and generous professor. She puts so much time into FroSci and making sure her students understand the material being taught. Though not everyone taking FroSci is a science person, she always provides additional resources to anyone especially interested in any topic and makes herself available outside of classtime to individually help anyone with the course. The workload is minimal for FroSci, and she provides a lot of guidance with writing the term paper. She does a great job covering relevant material in seminar (so much so that the 500 person lecture on Mondays is definitely something you can miss once in a while) and prepares us very well for the midterm and final. It's clear from her teaching that she not only puts a lot of effort into her work, but also that she cares immensely about her students and our experiences in FroSci and at Columbia. Dr. Carr is a gem and made my first semester truly enjoyable. Though I am not one who likes science much, I ended up getting a lot out of FroSci largely in part due to Dr. Carr.\nWorkload:\nI'm not sure what's typical for FroSci, but Dr. Carr's workload was very manageable. Homework sets each week (common to all FroSci students) that we are allowed to collaborate on, so long as the answers are in our own words and handwriting. Attendance to SEMINAR (not lecture) is counted for a grade. She also asks that you send a question or comment pertaining to the lecture after the lecture but before that week's seminar (this is doable without attending lecture for sure, and they don't count for too much). At the end of each unit, she gives a quiz that is worth the same amount of points as one homework assignment and one seminar attendance. She grades pretty leniently and allows you to earn extra credit. Sometimes (but not often) there are small assignments that you have to do to prepare for seminar, but this is never collected or graded. In terms of the term paper, she creates small benchmarks to help you find a topic, develop and outline, write a draft, and peer review before the final draft. They are very manageable and helped me not procrastinate extensively on my term paper. The midterm and final are standard for all FroSci students - you are allowed to bring a cheat sheet with any info whatsoever written on it, front and back. She prepares you very well for the exams. As long as you attend seminar (not even the lecture) and do the work, it's not difficult to do well in her class.\n"
        }
    ]
}