{
    "prof_info": [
        {
            "prof_name": "Jeffrey Lax",
            "prof_id": 2482,
            "total_reviews": 28
        }
    ],
    "reviews": [
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "January 17, 2017",
            "review_content": "\nIf you're taking Logic of Collective Choice with Professor Lax, don't.  This pastiche of disorganisation amalgamates into a cesspool of confusion and contempt - contempt at the otherwise interesting subject matter.  Allow me to elucidate what I believe the problems to be.\nFirstly, this course does not come with any reference material - no textbooks, no online resources, and no handouts.  Attending his bi-weekly lectures are akin to receiving a divine edict - Lax preaches, you absorb.  Basically, you sit yourself down, take out a note pad, and copy down whatever is on the board.  This proves to be extremely tricky during the two midterms he doles out as the subject content that was once fresh in your memory tends to fade, naturally, as the weeks go by.  Without a point of reference, you get so lost.\nSecondly, the lack of overall support.  The stressors brought about by a lack of reference materials could easily be alleviated by knowledgeable teaching assistants who, from the goodness of their hearts, will decide to impart this information during office hours.  This was not the case - Jordan and Javier, the two TAs who accompanied Lax in this process, were equally as clueless as we were.\nWhile I did relatively okay for the class, >10% of his students were awarded an appalling D grade.  Please only take this class if your GPA does not matter to you.\nWorkload:\nRather light.  We had 6 problem sets, 1 was an extra credit.\nThe midterms and final were particularly tricky; exacerbated by the lack of preparation on his part.\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "January 17, 2017",
            "review_content": "\nThis course was one of my favorite at Columbia. Professor Lax is brilliant, witty and deft at explaining often complex topics in a field that is traditionally not taught at the undergraduate level. This also explains why the course content is entirely from going to lecture and actively focusing to absorb material instead of through textbooks or reading. \nThis is unlike most political science courses at Columbia, and I really appreciated how it opened up a different way of thinking. He openly acknowledges his poor handwriting, though repeats material and is open to questions. The grading was tough though fair- work hard, ask questions to him in class and TAs, and you should do fine.\nWorkload:\nProblem sets, two midterms and a final. Problem sets were well-structured and thought-out- also served as great review for the midterms/final. \n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "December 20, 2016",
            "review_content": "\nDON'T LISTEN TO THE NAYSAYERS!\nThis was the most interesting class I have taken thus far at Columbia, and Lax is one of the best professors I have ever had. Some reviews say he is too fast paced, but in class he would ALWAYS take the time to answer any questions and re-explain difficult concepts (with multiple examples).\nWhenever I emailed him, Lax always responded to my questions within an hour or two (even late at night). I never took advantage of office hours, but he seemed very accommodating in scheduling appointments with students. He is clearly very knowledgable and he is good at explaining unfamiliar theorems/concepts. Sometimes Lax goes a little off topic telling stories, but they're funny and it doesn't really impede the class.\nOverall, the workload is pretty light. But if you take this course, YOU MUST GO TO CLASS. As other reviews have said, there is no textbook and the information is NOT online. Take lots of notes!!!\nIt's a logic class, so it has some mathematical elements. Still, I think it's one of the less math-y research methods courses offered.\nTAKE IT - IT'S INTERESTING & LAX IS AN ANGEL\nWorkload:\nFairly light! 6 total problem sets (plus an optional 7th), most of which could be completed in under an hour\nTwo midterms and a final (which I have not yet taken)\n(Also, if you do poorly on a midterm, don't worry. If you do better on the final, Lax will take that into consideration.)\n"
        },
        {
            "course_name": "Judicial Politics",
            "review_date": "May 17, 2016",
            "review_content": "\nI was so scared off by the mixed CULPA reviews at first that I tried avoiding Lax, but my schedule eventually forced me into taking his class, and it's become one of my favorite classes at Columbia. We focused mostly on the Supreme Court, and it was really interesting to learn about all the theories on how justices and other factors can interact with each other to shape opinions and outcomes. Lax is a very engaging lecturer (I know some professors can be annoying with their tangents, but I always found his stories about the personal lives of the Supreme Court justices and the SCOTUS gossip pretty entertaining), and he's well-aware of his faults as a lecturer (talks too fast, HORRENDOUS handwriting, a bit disorganized), but he's more than willing to go over things that the class didn't understand if you ask him to. For the most part, the content was easy enough to understand and remember, but things do get a bit complicated when he brings in diagrams and graphs to explain voting patterns, so maybe that's why people have more negative recollections of Logic of Collective Choice. Not sure how he is one-on-one, seeing as how I never managed to schedule office hours with him, but overall, he seemed like a pretty friendly and approachable guy.\nThe TA for our semester (Ebie) was also amazing - she held very helpful review sessions outside of class time for both the midterm and the final, and she was also very willing to meet to discuss papers and such. \nWorkload:\nReadings are mostly unnecessary to be honest, as long as you review your notes carefully before the midterm and the final, and pay attention in class. There's also a 10-20 page research paper (10-15 for individuals, 15-20 for groups), but spend enough time and effort on discussing the politics behind whatever you're talking about, and it'll be fine.  \n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "April 13, 2015",
            "review_content": "\nI have trouble understanding those who say that Prof. Lax's class is disorganized. While the pace is fast, there is a definite structure to his course; you begin with the basics of sentential logic, and as you move through the semester he gives you additional tools and methods which outline decision-making processes and group dynamics, and which ultimately yield some pretty interesting conclusions! The class is especially valuable if you're a poli. sci. major like me (and I assume that most of you are); you will definitely look at democracy and social decision-making differently. In any case, there is at least a handful of professors whom I have had at Columbia who are worse than Lax, so take the vitriol on some of these reviews with a grain of salt... \nThe important thing to remember is (1) take lots of handwritten notes--there is no textbook and NO useful information online, and representing the logical symbols on a laptop is just a chore; (2) pay attention in class--it's not that hard to do, because he's always cracking jokes (which can be pretty bad, admittedly, but at least entertaining); and (3) just do your problem sets well ahead of their due date, talk to the T.A., and attend the review sessions for the exams, and you'll do fine. Trust me. \n\nWorkload:\nProblem sets maybe twice a month, two mid-terms and a final. Problem sets require about an hour each if you've paid attention, and are straight-forward. Exams are challenging--he pushes you on details of things you may not have talked about in class, so check with your T.A. and be thorough when you study. Consider the exceptions to rules, because he loves to test you on those (as all teachers of logical methods do, apparently...)\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "January 14, 2015",
            "review_content": "\nTake this review seriously. I mean it from the bottom of my heart when I say that Jeffrey Lax is by far the worst teacher I have ever had the misfortune of coming across. I mean it. While yes, he is sometimes funny and seems sweet in the classroom, don't let this fool you. I  went to every single class of his Logic of Collective Choice class, and you bet I paid attention, and studied HARD (more than any other class I had) but I still had no clue what was going on in the class by the end of the semester. You know why? - because Lax is, quite frankly, a SHIT teacher. Do not take this class. Or any other class he teaches. I beg of you. Seriously, shame on Columbia for hiring such a terrible teacher. I might as well have taken a class taught by a hamster - I probably could have learned more, and killed myself a little less of the theorems that YOU CAN'T EVEN FIND ONLINE. Did he just make them up? Who knows. We only know that Lax is a pretentious, awful, disrespectful, altogether crap teacher - I winced just calling him a \"teacher\" - that you should bless yourself to never, never meet. \nWorkload:\nNot a lot. No readings. Still a TOUGH class, on account that Lax is shit. Absolute. Shit. \n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "January 06, 2015",
            "review_content": "\nContent-wise, this class is great.  It really affected the way I understand voting, elections and fairness.  This is a unique class, and I highly recommend taking it for those interested in political science and logic.  There are downsides, but I think the opportunity this class presents in terms of learning outweighs the downsides.\nThe problems with this class stem from Lax's disorganization.  This might be okay if there was a textbook that you could use to compensate, but there is not.  This is a class where you are fully dependent on the Professor for content, and Lax is just not the type of professor that can do that.  Information is scattered, important basics are skipped, and most frustrating: nothing is planned in advance.  When there were handouts on information, I was able to understand the information more in depth, but these were few and far between, were written after the material was taught.  Why can't he just re-use from past years and hand them out on more topics?  This class was also very frustrating because midterms would pop up at his leisure (one week in advance), and you could never plan in advance for problems sets.  This just creates unnecessarily anxiety for students who need to plan more than one week in advance. On the last day of class we did not even talk about what would be included on the final, but the TA addressed the question 2 days before the final. The TA (Andy Guess) was great and filled in the gaps that were necessarily (I don't think I could have done as well as I did without his review sessions), but his review sessions also made it clear just how much more organized the class could be.\nLax is a nice person, and seems to care, but the students would certainly be learning more if he had his act together.\nI am happy I took this class in terms of the information learned, but the process of learning was unnecessarily frustrating.  \nGrade: A\nWorkload:\n8 Problem Sets (varies by semester.  Assigned a few days in advance of due date)\n2 Midterms (1 week notice)\n1 Final (cumulative-ish, mostly focused on latest material.  Old material only as it relates to new material. Same length as midterms)\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "December 25, 2011",
            "review_content": "\nTo those of you who have read all of Professor Lax's negative reviews, please disregard them.  Professor Lax is a nice, funny, awesome professor who teaches a unique class unfounded at any other university in the world.  After taking his class, you will be able to speak on numerous social choice methods, the benefits and limitations of majority rule, and many other theorems related to social choice theory.  To be honest, if you're not interested in learning for the sake of learning, don't take this class.  I found this class to be incredibly interesting but horribly inapplicable to the real world.  This is a class for thinkers and theorists.  If you're not one of those people, don't take this class.\nWhile I would say that it is very possible to get an A- or A in this class (the class is curved to a B+), if you don't go to class, you are in big trouble.  THERE IS NO TEXTBOOK, so don't skip class.  Don't get scared when Professor Lax says that you can't miss any classes, just find someone in the class that would be willing to give you notes and/or go to TA office hours after class.  Professor Lax also speaks quickly, and his handwriting sucks, but don't be afraid to ask him to repeat himself.  This is a class that depends much on participation in terms of experience and grading (can bump you up a notch).  There are legitimate reasons to not take this class, but that doesn't mean that he isn't a good teacher or that the material is bad.\nI took this class because I was looking to fill my schedule after I made a scheduling mistake.  The class sounded cool, so I thought I would take it.  I am very happy that I took the class.  It has been the best class I have taken at Columbia so far.  The midterms are a bit tricky, but Professor Lax loves to see improvement and will assess your grade appropriately.\nI almost forgot: NO READINGS!!!\nWorkload:\nApproximately 6-8 problem sets (take about an hour, try to do with a friend). 2 midterms, 1 final. He says they're cumulative, but they're extremely weighted towards material more recently covered. NO READING!\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "September 08, 2011",
            "review_content": "\nDo not take this class. Period. Yes, it's true there is not much work involved throughout the course of the semester just a few problem sets every few weeks with a midterm and a final. But the midterm and final are EXTREMELY random and he asks the most complex questions in order to confuse people. So many people got terrible grades on the midterms and the final was even worse. He claims there's a curve but after speaking with multiple other people in the class the curve wasn't too strong because of the few geniuses who got 100s on both midterm and final. \nseriously if you are not a genius and can't understand professors who talk too fast and don't explain things well, then DONT TAKE IT!!!!!!! it seriously is the worst and most disappointing class i have ever taken in my three years at columbia.\nsave yourself and never take this class i urge you. it was absolutely miserable.\nWorkload:\nproblem sets every now and then, midterm, final -- don't waste your time\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "May 31, 2011",
            "review_content": "\nI personally found this class to be amongst the best I have taken at Columbia. I found Lax's humor very funny, his style of lecturing straightforward, and the assessment fair. It is true that you need to be alert in his class, and take detailed notes as there is no textbook. However, he will give you everything you need to understand the material, and if you are very careful about note-taking, he also gives answers to every exam question (although his multiple-choice exams are intended to make sure you didn't miss these snippets, so do make sure you do get literally everything down!).  \nI do realize, however, that many people (including most of my friends in the course) find the material difficult. Logic really is a skill in which some do struggle more than others and there is frankly no way Lax could have done more to help students who are naturally less able to complete the mental acrobatics essential to this subject. \nI found Lax more than willing to help - after class, via email, or in office hours. \nA final note, on grading. Lax is not afraid to use the full scale - from A+ through C- (and perhaps lower, although you have to do really poorly to get lower). \nWorkload:\nProblem sets roughly once a week, each takes around 30-40 minutes and they are not difficult (1/3 of grade). 2 non-cumulative multiple choice midterms (1/3 of grade), and an identical non-cumulative multiple choice final (1/3 of grade). \n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "May 10, 2011",
            "review_content": "\nLet me start by saying that this class is not difficult. If I would have put in a little more time actually studying, I would have done much better. \nHowever, the Professor is not particularly effective at doing that thing that we pay tuition for: teaching. His TA's office hours were more incredibly helpful in wading through the countless hours of personal stories woven into a back and forth style of lecturing that is incredibly frustrating. Often times he would backtrack on previous lectures to make corrections. It is impressive how he can keep track of so much stuff and solve some complex questions in class, but he is very disorganized and too apologetic for his never ending string of bad jokes. He is also very awkward with his personal stories about urine. He is a socially inept social choice theorist.   \nHis problem sets were not difficult, but also not clear. It took several emails to the TA's and him to clarify the questions. The midterms and final are not straight forward and just about every question is debatable. I know lots of students who fought for every point they could get and often won. Very cut-throat class. \nOverall, this class teaches you a hobby in political science and economics. No one really takes it seriously accept for the few people who study it. It is like learning how to knit. It might come in handy one day, but not very useful other wise except that you can say you know how. \nWorkload:\n8 problem sets, 2 midterms and a final. All doable.\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "April 25, 2011",
            "review_content": "\nProfessor Lax is pretty hilarious and easy to listen to BUT he talks unbelievably fast and his writing is unreadable. Now, on the class itself: DON'T TAKE THIS CLASS! The review that says this class is an easy A  was written by either a genius or someone who succeeded in playing a cruel joke on all of the kids who are in the class this semester. I have no idea how the information we learned in this class applies to real life (unless you are part of parliament). \nAlso, there is no book for the class. Some see this as an advantage but try listening to a person who speed talks while describing 10 different theorems with no available materials to check for reference. This class was a cruel and unusual punishment for a political science major. The class average on midterms was around 70%. So this class is an \"easy A\" if he scales all the tests by 20 points, oh ya this is after studying for 7+ hours for each test. \nAt the beginning of the course he gives reasons why you shouldn't take this class, LISTEN TO HIM, he knows what he's talking about.\nWorkload:\n8 problem sets that varied in points (most weren't too bad, but some were explained after we handed them in which was annoying), 2 \"cumulative\" midterms (although NOT REALLY cumulative), 1 final\n"
        },
        {
            "course_name": "Judicial Politics",
            "review_date": "November 21, 2010",
            "review_content": "\nPros\n- Great Lecturer\n- Engages the stuents in class\n- The course material is very interesting and Prof. Lax adds on a lot of his own research\nCons\n- Lax never comes to class on time\n- Disorganized\n- There doesn't seem to be a formula for grading\nComplaints\n- The papers  were graded during our final exam.  The three TAs somehow managed to read and assess 60 papers in 3 hours.  A 15-20 page paper deserves more attention than just a few minutes.  That kind of grading, which at some point has to become completely arbitrary, is an insult to every student who worked on their paper for weeks.  \nAdvice\n- Do not purchase the text books (online only), Lax only uses his notes on exams\n- Never miss class and write down everything thing Prof. Lax says.  \n- Record the lecture\n- Keep all of your class handouts\n- Keep looking at other classes before you settle on Judicial Politics, do not rush into this class. \nIf I could grade this class I would rate it a B\nWorkload:\n One midterm, one cumulative final, and one 15 -20 page paper.  The exams are divided into essay and Identification questions.  Be thorough on the identifications, I used 1/2  to a whole page in the blue book for each.\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "January 03, 2010",
            "review_content": "\nThe 12/30/09 reviewer (\"Wow. Lax sucks.\") is way off base. If you keep the over-arching themes of the course in mind, each lecture fits into that big-picture quite well. Lax generally has a few points he wants to make each class. These points will usually be interspersed among jokes and stories (typically entertaining), but if these throw you off the scent of the \"material\" and you're unable to \"procure\" (seriously? are we in a Dickens novel?) the relevant information, then the \"disorder\" is of your own mental making.\nGrading is not arbitrary. The exams are 95% multiple choice. There's an \"essay\" portion on each where you have to explain a concept in jargon-free terms. These are graded generously, as are the problem sets.\nI attended every class and don't recall Lax ever seriously challenging a student. There were a couple of wannabe class clowns (one of whom no doubt wrote the review below), the first a baldie and the second an ark-proprietor, whose feeble comic strivings I can promise you more than deserved the rhetorical drubbings that Lax delivered. He wasn't challenging students here; he was calling lameness, lameness.\nYeah, this is an easy class but it is also a worthwhile one. Don't let a clown tell you otherwise.\n\nWorkload:\nTwo midterms (together one-third of grade), cumulative final (one-third), problem sets and participation (final third).\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "January 01, 2010",
            "review_content": "\nThis is a good course to round out a difficult schedule: it's light--there's not much work involved and the material is straightforward--but also interesting and Lax himself is the academy's answer to John Hodgman. He's entertaining.\nThe class is basically about voting systems. What do we want from such a system; more important, what can we get? You'll review the work of the field's major thinkers (Arrow, May, Sen),  how some proposed solutions to others' conundrums that inaugurated more difficulties. All of this is in service of the course's main point: in choosing a voting rule, trade-offs are inevitable and it's unclear which rule if any approaches an acceptable equilibrium (and what equilibrium?). \nSome criticisms: Lax sometimes presented new material in a muddled way. He would then give us a problem set that tested our understanding and would present the material clearly only at the next session.  Intentional or not, this was annoying but, thankfully, rare. In pressing his conclusion (no voting system is perfect) he would sometimes put forward shaky premises (the violation of condition \"i\" isn't THAT bad; can i get a whut whut? ...okay, FINE). These are just quibbles though--this is a class that you won't regret taking.\nWorkload:\nTwo midterms and a cumulative final. Around 8 problem sets, most given early in the semester. No reading!\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "December 30, 2009",
            "review_content": "\nWow. Lax sucks. He's extremely disorganized and lazy. His lectures make very little sense. I'm not sure he understands what he's teaching. This would be tolerable if there were a textbook. But there's not. Other than desperately trying to book appointments with the overwhelmed TAs (who are themselves often confused), there is literally no way of procuring accurate and complete information. \nGrading was arbitrary, which is unbelievable considering this is logic...not an essay-based course. \nMany people rave about Lax's personality...about how entertaining his courses are. He tries VERY HARD to appear to be young and hip, but really his sense of humor is just sadistic and juvenile; his challenging of students in class just screams that he's overcompensating for a lifetime of mockery by trying to be smart; and his apparent openness to student questions is just an attempt to minimize the actual presentation of material because he is so freaking lazy. \nAt the beginning of the course Lax gives a bunch of reasons you shouldn't take his course. I think he knows that his frankness about this just makes students more likely to take his course. Take his advice at face value. \n\nWorkload:\nTwo midterms, a final. A bunch of problem sets of varying lengths. All of it requires minimal preparation. This was my least work intensive class...I love an easy A...but this crappiness of this class outweighs its very light workload.\n"
        },
        {
            "course_name": "Judicial Politics",
            "review_date": "May 18, 2009",
            "review_content": "\nThis class was a complete waste of my time. I feel I barely learned anything. Lax is rarely entertaining and spends at least a half hour each class rambling about random news that has little to no bearing on judicial politics. His lectures are VERY disorganized. At the beginning of the semester he would actually follow his outlines which are completely disorganized but made it easier to somehow make sense of his ramblings. However, after the midterm he stopped following his outlines and just did as he pleased. He talks very quickly and softly which make it difficult to hear him let alone understand what he's saying. The grading was pretty harsh and the midtem/final were almost impossible to study for because you had no idea what to study. The exams were mostly on his lecture notes, so you can definitely get away with not reading any of the readings. \nWorkload:\nOne midterm, one final, one final paper (includes a proposal). Each are 1/3 of your grade.\n"
        },
        {
            "course_name": "Judicial Politics",
            "review_date": "May 10, 2009",
            "review_content": "\nI like Lax a lot. He's a nice guy and he's approachable. His class is pretty easy, (lots of A range grades). You don't really have to do the reading at all because his exams are from the notes. I'm a poli sci major and I was really excited about Judicial Politics, but it's fallen far short of my expectations. While Lax has a seemingly good lecture style and provides little outlines for each \"topic,\" when I was looking over my notes, I realized that the lectures were ridiculously disorganized, insofar as they're organized in sections, but each section has like fifteen subpoints. This is particularly annoying because the reading (which I did studiously) doesn't really follow the notes perfectly and that makes it difficult to study for the exams.\nThe worst thing about Lax, though, is all of the class time he wastes. He's always late to class, and sometimes he spends half an hour telling little stories (which are usually funny, but nonetheless, we could be covering another eighteen bullet points in that time). He wastes even more time when he lectures us on his own research, some of which hasn't even been published yet (so who's to say that the political science community doesn't think that it's all BS?). I'm hardly an expert in judicial politics, but Lax doesn't have tenure yet, so I doubt that he's the foremost scholar of the subject. Count the number of times he says \"... the link to the paper is on my website.\" All that I've gotten out of the class is a lot of anecdotes about justices and a sort of piecemeal understanding of what Lax thinks about when he writes papers or reads political science journals.\nWorkload:\nMidterm, final, research paper (1/3 each) plus \"participation.\"\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "January 09, 2008",
            "review_content": "\nThis class was great, as was the Professor.  Professor Lax is interesting and engaging, and conducts the class in a manner dependent on class participation.  Sometimes lessons and classes are in a game format.  If you enjoy paradoxes, social choice theory, voting systems, or logic games, this class is a great choice.  Furthermore, Professor Lax also stresses the practical application of the material.\nWorkload:\n8 problem sets, 2 midterms, final\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "September 06, 2007",
            "review_content": "\nThis is a really cool class and Lax presents the material in a very clear and engaging way.  He makes sure you understand and is certainly never boring.  I'm not sure what the reviewer below for this course was getting at, but everyone I knew in the class loved it.  I took it fall of 2006, so maybe it got better that year.  \nThe one thing you have to know going in is that this is not an average polysci class.  You are learning logic and formal ideas that involve proofs.  You have problem sets, not essays.  You learn how different voting systems work and what type of problems they end up producing not by reading anything, but by seeing a theory proven by logic.  Don't be scared though - its really cool stuff that's not that hard to understand.  You can flunk calculus and get an A in this course.  It opens your mind to a whole new way of thinking.  Also, Lax will always help you if you go to his office, which he hardly seems to leave, or ask him after class. \nOne more thing.  There is no text book or set of articles.  That means there is no reading necessary.  Pretty cool for a polysci class!  However, it means you have to show up on a regular basis.  You can miss a couple classes and be fine - get notes and/or go to office hours if you need to, but if you're the type of guy to never show up and then read the book before the exam, take another class.  \nBottom line, awesome class with one of the best professors in polysci.  Take this or whatever you can with Lax.  If everyone in the class actually spent the time to write a review, culpa would probably have already given him a gold star.\nWorkload:\n4-5 relatively easy problem sets, midterm, final.  NO READING!!!  Exams can be tricky - but if you get the ideas, they are actually a breaze.  If you are not a logic person, it might be a little difficult, but Lax will help you through it.  He said he grades this more lieniently than judicial politics, and it's definately true.  According to my transcript, he gave 53% of students A range grades. \n"
        },
        {
            "course_name": "Judicial Politics",
            "review_date": "August 10, 2006",
            "review_content": "\nAbsolutely my best teacher at Columbia so far.  He doesn't just tell you how the system works - he shows you.  He will give the necessary info and then often ask for someone to explain how the internal negotiations will work out.  He's as interative as he possibly could be and even when he is going through pure lecture, he keeps you interested with his witty style and awesome sense of humor.  I'm already signed up for his other class, Logic of collective choice, for next semester and am probably going to major in polysci now.  Take any class you can with Lax.  \nWorkload:\nmidterm, final, 20-page research paper.  Everything is exteremely straight forward.  The exams are based almost purely on the class notes.  The book is unnecessary to do well on the tests, though its well written and has interesting excerpts (I read parts of it before I knew it wasn't needed, but I actually enjoyed reading some of it and I'm not a reader.)  The way the grading on the tests works makes it unlikely to get a solid A, but an A- or B+ is definately doable.  I think the average is around a B/B+.  Regarding the paper - you can do it alone or with up to 3 other people.  I did it with one other person, but only do it as a group if you really trust the other people because otherwise it can be more work than doing it yourself.  Basically, the paper is choosing one supreme court case and applying the general ideas discussed in class to that specific case.  It's certainly not a busywork assignment and can actually be rather interesting.  It doesn't take an extraordinary amount of time either - I did it in 2 nights and got an A- (they were a long 2 nights though).  Basically, just go to class, pay attention, and study from your notes and you'll do quite fine.  \n"
        },
        {
            "course_name": "Judicial Politics",
            "review_date": "July 06, 2005",
            "review_content": "\nNot the best poly sci class to take right now.  Some of the readings were fascinating, others not.  Ditto with the lectures.\nThe man was ill organized in his lectures and syllabus.  Group papers sucked, since not only did coordinating all the assholes in your group take up half your time, but Lax didn't spell out exactly what we were supposed to do in the papers.\nBy 2007 Lax should have all his shit together and JP should be a decent class.\nOh, and Lax has a great sense of humor.  Pure hilarity.  Call Conan and book him for Late Nite.\nWorkload:\nMidterm, Final, Group (of 4) paper.  If you habitually go to the lectures and put in a little studying you'll easily get an A on each exam.  This fact was the saving grace of the class.\n"
        },
        {
            "course_name": "Judicial Politics",
            "review_date": "June 05, 2005",
            "review_content": "\nI'm just going to be slightly more moderate on this one. \nProfessor Lax was not great. His lectures were not incredibly coherent or structured and he didn't give much guidance - in terms of when to do the readings or in terms of what he wanted in the papers. And group projects as a general rule suck. \nThat said, he was an entertaining lecturer which is really nice when class is on the seventh floor of Hamilton at 9 am. And there was a lot of really interesting information that he was knowledgeable about.\nGetting a good grade is kinda unpredictable when you're not sure what to do for the group project and the midterm is graded harshly - even for someone who was always in class and did all the readings. But I am far more knowledgeable about judicial politics than I was before, so...\nWorkload:\nmidterm, 20 page group project, final\n"
        },
        {
            "course_name": "Judicial Politics",
            "review_date": "May 24, 2005",
            "review_content": "\nPluses:\nLax is young, energetic, and engaged with his material.  He always cares about what he's teaching, and he's a good lecturer (certainly a much more interesting speaker than some other polisci profs I've had, sadly).  It was a 9 am lecture, and I was never close to falling asleep. Enough said.\nThe material itself, if you're interested in law and jurisprudence, is pretty good.  Much of the discussion of theories of judicial decisionmaking was new to me, and I learned quite a bit.  When discussing these theories, Lax' presentation of the material was clear and fairly well-organized, and he does a very good job of answering questions from the class (occasionally to the point of absurdity).\n  If you're not interested in legal intricacies and indepth discussions of the Supreme Court, this may not do much for you; but if that's the way you feel, then why would you sign up for this course to begin with?\n(Also worth pointing out that the midterm was not graded particularly harshly, though it definitely helped to actually come to most classes and take good notes. funny, that.)\nMinuses:\nLax is young, hasn't been teaching for very long, and is still trying to figure out how to structure his lecture material (and is also adjusting to Columbia/Columbia students in particular).  You can tell.  The major problem with the class was that the presentation of topics was not particuarly coherent and didn't fit together into any sort of structure or arc.  \nOn several different occasions, we'd spend a fair amount of time discussing particular legal minutiae (the history of the federal courts comes to mind) that didn't end up being particularly relevant to the meat of the course or its theoretical component (but did end up as IDs on the midterm/final); there were also times when we'd go from one topic to the next (or back and forth between topics) without a clearly discernible reason or overarching point. This was a bit of a problem. (The group paper was also pretty farcical, though apparently that's going by the wayside next year). Lax could also stand quite a bit of improvement in responding to emails (you would do much better to buttonhole him after class).\nOverall: If you're interested in judicial decision-making, there's definitely some interesting stuff here.  At the moment, there's a fair amount of stuff you have to wade through to get it, so go in with open eyes.  At the same time, you get a professor who's motivated, who cares about the material and the lectures, and who genuinely cares what his students think (about the material, about his teaching, etc). You could do a lot worse.\n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "May 19, 2005",
            "review_content": "\nI really have to disagree with the previous reviewer. Lax does not present things with very much clarity at all. He lectures from what looks to be a 100-page word doc of notes and if you ask a question about the material that isn't spelled out for him in his notes, he has trouble answering. He teaches things he himself does not fully understand. There was one incident where he taught us a concept, gave us a homework assignment on which we all lost points on the question that tested that concept, couldn't answer our questions on it, and then came back the next class telling us to strike the whole thing from our notes because he couldn't find the original source he learned it from. Lax routinely showed up to class late and cuts our once-a-week sessions short. He has a habit of telling us to expect problem sets to be e-mailed and then never sends them out and never at any point informs us that he has decided not to send out homework. \nI'd have to say that the worst part of the class is the decidedly disorganized presentation of the material. Lax lapses in and out of concepts so that there seems to be very little continuity to any of the main themes when you look back through your notes. He's constantly correcting things he said in past lectures. There was one lecture about quasi-transitivity and acyclicity where he completely spaced out and had to cut the class short. It was a very important topic and though he came back and gave us a brand new set of notes on it during the  next class, I know I personally was thrown off a bit by learning things several different ways until Lax felt he had finally given it to us straight. Finally, I do believe the exams are a bit too nitpicky for a professor who isn't very clear in the first place. Yes, he did curve them in the end but I was a bit angry that he expected so much out of us when he gave us so little. Aside from the garbled social choice theory, I doubt if we covered even half of the material. We barely got to game theory which was disappointing. It takes Lax so many lectures to get a thought out that we were given fresh assignments after the last class before an exam in which the material was to be covered on the exam for both the midterm and final. \nMost of my classmates were frustrated by the fact that they didn't know what to expect from the course based on the title. The topic is very abstract and it never comes any closer to reality. I don't know what the previous reviewer is referring to when she/he said we covered institutions in some way - there were games that included \"congress\" and \"sentaor\" and \"committee\" but that's about it....That's not to say this course couldn't be right for someone who's into political philosophy. Most of the political science majors were put off by the abstractness of the course, so I thought it was important to mention. I think many of the political science students were attracted to the course because it is a seminar with no paper and very little actual work to it. \nI thought Lax was a really cool guy until he gave us a Midterm exam the day we all returned from spring break. It was supposed to be the week before spring break but it became necessary for Lax to take that time to correct his past lectures, basically. He likes to come off like he's one of the boys, but the Monday after break exam tells a different, doesn't it. Overall, I think he's nicer than many other professors but at the same time I think he has no qualms about giving an exam that is too much for his low-level teaching ability. During our final, he announced that he made the exam difficult purposely, but would curve generously. Then he listed about a dozen questions on the board out of the 38 that he felt were \"more challenging.\" In the end, he sent us a cranky e-mail telling us how very disappointed he was in our performance on the exam and had to curve it quite a bit. I mean....to my mind, the solution would have been to give an appropriate exam and have lower expectations. A class is only a mirror of its professor, in many ways. Overall I give him a C. And that's curved up from a C-. \nWorkload:\nSporadic problem sets that vary in difficulty and length. Midterm exam - tricky but not terribly difficult. Not curved. Given to us the day after spring break. Final exam - unnecessarily difficult. \n"
        },
        {
            "course_name": "Logic of Collective Choice",
            "review_date": "May 07, 2005",
            "review_content": "\nAre you interested in problems of social choice, game theory and rational choice theory? If the answer is no, then simply donÂ’t take this class, and save yourself an unpleasant experience. If you are interested in rational choice, then this class is an excellent place to start. Professor Lax presents the material in a clear and understandable way. He is always willing to answer questions, both in and out of class, including helping out with problem sets when needed. \nThe course itself presents some of the highlights of rational choice theory, from ArrowÂ’s Theorem, on through some of SenÂ’s earlier stuff, Â‘chaosÂ’ theories, and a bit on legislative structures. Although all of the theorems are taught thoroughly, there were relatively few proofs, none of which were on the exams (though some did appear on the problem sets).\nWorkload:\nAbout 6-7 problem sets throughout the semester, some easier then others. Lax was always willing to help, when asked. A midterm and a final: The midterm was pretty straight forward, the final was a bit tricky, but graded very reasonably, as was the class as a whole.\n"
        },
        {
            "course_name": "Judicial Politics",
            "review_date": "April 17, 2005",
            "review_content": "\nI would strongly disagree with the last reviewer.  Lax is the absolute man.  First, I don't know how much I trust a reviewer that gets pissed that the professor shows up late, and second the midterm was graded just fine.  If you come to class and take notes you should have no trouble doing well.  It is true that there are some pre-law school groupies that have little to no lives that sit in the front of the class and comment on EVERYTHING the man says.   But the best part about this was often Lax would make fun of them and their vast knowledge of useless info.  All in all, Lax has a great personality and he is one of those profs that make you look forward to class.  In the first couple days of class see if you can get him to tell you the story about his streaking friend or the Scalia sodomy discussion. \nWorkload:\nMidterm, final, group project.  All straightforward if you come to class and take notes. \n"
        },
        {
            "course_name": "Judicial Politics",
            "review_date": "April 09, 2005",
            "review_content": "\nIf you want a slow and torturous death, take this class!  I can not even being to explain to you the amount of misery that this class inflicted upon me.  Where do I even begin?  Lax arrives around 5-10 minutes late to class everyday.  He'll proceed to give a lecture where either he is explaining something mind numbingly simple (judges vote the way they want to vote!) or incredibly complex that few people understand.  He has a small collection of groupies in the front row that seem to hang onto every inane thing that comes out of his mouth.  What's even worse is that the midterm was graded rather harshly and the final paper is a group project.  A group project!?!  We grade each other?!  It makes little to no sense.  Also, we are currently 2 months behind in the syllabus, he hasn't given us the due date for the paper, and can be incredibly slow to respond to important emails.  This is the first class where I doubted my decision to major in Political Science and to attend Law School.  Please, for the sake of your sanity, do not take this class.\nWorkload:\nMidterm and final.  20 page group project.  I can only assume that there is reading involved.\n"
        }
    ]
}