{
    "prof_info": [
        {
            "prof_name": "Trish Sheffield",
            "prof_id": 2213,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Gender and American Advertising, Feminist Texts I",
            "review_date": "January 09, 2006",
            "review_content": "\nI have taken two classes with Prof Sheffield.  The second class was a larger seminar which unfortunately felt more like a lecture half of the time.  The large amount of bg that she tried to cram into our sessions interrupted her and our flow of conversation.  However, she is still a great professor!  I loved Fem Texts I.  I am not sure if she will be back to Columbia... sad.\nWorkload:\ntoo much reading (which she recognized), two papers (8-10, 12-15) but she allows to substitute a creative project to supplement page length\n"
        },
        {
            "course_name": "Feminist Texts II",
            "review_date": "June 19, 2005",
            "review_content": "\nAs the previous reviewer noted, Trish is definitely not afraid to share her own opinions.  Often the class would go something like this: Trish says something, student says something, Trish responds, different student says something, Trish says something, student, Trish . . . You get the picture.  Instead of helping students find their own way in the texts, Trish, in great detail, explains her views and opinions.  As a person, Trish is extremely kind, open, and lovely.  But as a teacher she leaves something to be desired: spoonfeeding you information rather than inspiring individual thought and reflection.\nThe syllabus was fine - some interesting novels and other works and some old standards.  But the pace is rather slow.  If you have little to no experience with feminist works then this class would be a pleasant introduction.  But if you have more experience or want a more rigorous class take Feminist Texts with someone else.\nWorkload:\nAverage:  6 short responses, presentation, two papers.  \n"
        },
        {
            "course_name": "Feminist Texts I",
            "review_date": "November 15, 2004",
            "review_content": "\nTrish, as she has you call her, is a interesting and interested professor. She has good knowledge of a whole spectrum of feminist thought, and is able to integrate her knowledge into the class discussion. She runs the class very interactively, and no one is afraid to share their opinions, including her. Trish also adds a lot of interesting literature to the flexible syllabus and takes away some of the more dry theory, which is a lot of fun. I felt like this class was a 2 hour bright spot in my week -- definitely recommended.\nps Trish also makes sure to have a dinner at her house for the small class. good times!\nWorkload:\n6 1-2 page notes on the readings for class over the semester, 2 papers. Class participation is 50%, which is amazing-- you'll want to participate anyhow\n"
        }
    ]
}