{
    "prof_info": [
        {
            "prof_name": "Andrew Fanoe",
            "prof_id": 10932,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "May 26, 2012",
            "review_content": "\nAndrew was a wonderful instructor. He was a very effective, knowledgeable, and caring instructor who was eager to teach and help his students improve. When students had questions during the lecture, he always made sure to answer questions as thoroughly as he could. Even when the answers to some questions were clear to him and other students, he never showed signs of frustration or annoyance when a particular student struggled with a concept and was happy to answer questions. He constantly showed signs of trying to improve and adjust his teaching style so that his students could have good experiences in the classroom. I got a strong impression that he really cared about teaching.\nAndrew was always very reasonable and understanding. Although I've often felt distanced from my other professors, Andrew was a very approachable and likable instructor. I liked him because I felt like he could relate with us and knew what worked and what didn't, and what students like and don't like. \nHe was a great communicator both inside and outside of the classroom: he clearly conveyed his teachings and was skilled at explaining both simple and complex mathematical concepts. Outside the classroom, he utilized e-mails and provided detailed updates and administrative announcements that I found to be very helpful. \nI enjoyed this class very much and would rank Andrew in the same tier as my other experienced professors. There is no doubt in my mind that Andrew will someday become a fantastic professor that students will love (he is currently a PhD student).\nThe reviewer below didn't do so well in the class, I presume.\n\nWorkload:\nVery reasonable. Weekly HW, 2 midterms, and a final that were all reasonable and very doable.\n"
        },
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "May 09, 2012",
            "review_content": "\nLadies and Gents. \nMr. Fanoe is a nice person. He is friendly and kind though socially awkward, as many other mathematicians. \nWith that being said, he has a lot of work on honing his teaching skills, considering he intends to be a professor. His writing on the board is impressively small, and he is as disorganized as any brilliant mathematician. Sadly, he is usually not aware of the fact that most of the class isn't really keeping up with him. \nHonestly, studying with him was frustrating because he takes things for granted, things that precalculus students usually do not know. His class is badly structured, he skips fundamental stages, which makes it hard to understand his work and every now and then he will cram a lesson's worth of material in the last five minutes of class and another four minutes of your break. \nHOWEVER, if you are ok in math, you can do extremely well. \nWorkload:\nOne short problem set per week. (10-15 exercises)\nFair tests. Two midterms and a final. \n"
        }
    ]
}