{
    "prof_info": [
        {
            "prof_name": "Teresa Harris",
            "prof_id": 2591,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 04, 2009",
            "review_content": "\nA cursory Google search reveals that Teresa has been a grad student for twice as long as it takes most of us to earn our college degree.  I've seen this purgatory wear on people harder than it has on Teresa, but she definitely has an idea of what she wants you to learn and why she wants you to learn it.  Little imagination has gone into the syllabus, and little imagination is required of each student, but you do learn the Art Hum curriculum fairly thoroughly while many of your peers are goofing off at the MoMA or listening to drivel of the noise movement in Music Hum.  Whether or not you want this is really up to you, but it - the 9 AM start time, the compulsory participation, the papers where you have to find a single right answer to the prompt that corresponds to whatever's in Teresa's head, the weekly posts that wear upon the soul, and the tests that require hours of tedious studying to achieve an arbitrary grade - is certainly far from all that's out there, which is not the idea that I got from the other CULPA reviews when I signed up for this section.  Take Teresa if you want a very traditional approach to old traditional art with old traditional pedagogy, but I feel that there must be more rewarding ways of getting through Art Hum or getting an A in a subject that intensely disinterests you, depending on how you feel about the requirement.\nWorkload:\nWorkload: weekly posts, two short papers, compulsory participation, midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "September 11, 2005",
            "review_content": "\nTeresa is a good teacher. She makes the material very interesting and brings a lot of unique observations to the class. She does a fairly good job of leading class discussion (sometimes it takes herculean effort just to draw the most banal observations out of students.) If you want to make the class really interesting, you are going to have to come out of your shell and help spur on discussion of the works. \n\nWorkload:\nHand in a question or observation for each class. Three papers, in-class presentation. Midterm and final. Very reasonable workload and grading is fair.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 28, 2005",
            "review_content": "\nA very desirable way to get through Art Hum. Teresa is nice, smart, and interested in teaching the class. She doesn't emphasize rote memorization too much, but if you pay attention you'll definitely get a lot out of the class. Grading was very fair and well-explained. I can't think of a better teacher for the class.\nWorkload:\nThis was during the summer, so it was reduced: 2 visual analysis papers, three short quizzes, a final, and a short presentation. No big deal. Grading was very reasonable.\n"
        }
    ]
}