{
    "prof_info": [
        {
            "prof_name": "Aise de Jong",
            "prof_id": 3392,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "August 25, 2008",
            "review_content": "\nHe is quite dry as a teacher. He veers into tangents during his lectures quite often however all tangents are somehow related to Math or Physics or an application there of. His tests tend to be much harder than most of the homework assigned, so expect a generous curve. His personality however is very nice, approcahable, and he generally makes himself available at the students convenience. He is knowledgeable about calculus, and does make a strong attempt at teaching the foundations of calculus, however as I mentioned before, he goes on tangents while teaching, making his lectures confusing at times. However if you do the homework, and the webworks, you will pass the class. Talk to him if you aren't and he will help you through the calculus either by assigning you a tutor or helping you during his office hours. \nWorkload:\n2 midterms, 10% webwork, 10% weekly text book homework, Final 40-50%.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 20, 2008",
            "review_content": "\nProfessor De Jong is very smart, but I don't think he's a very good teacher.  He basically copied the book down for us on the board each day, and did a few problems without really explaining them.  His teaching was disorganized, and he was not confident in the information he presented to us (he often stepped back and asked the class if we thought his word choice was correct, for example).  I felt like going to lecture was a total waste of my time because he didn't really teach anything.  His extra review session for the final wasn't helpful either--he just gave us a list of topics on the test...which was the same list as was on our syllabus.  The tests were graded using ridiculous standards so that a 50% was curved to an A.  I had taken Calc I before so I wasn't too terribly affected by his teaching, but if you haven't taken Calc before, I would not recommend this professor ( I wouldn't recommend him anyway, but especially if you haven't taken Calc yet).  \nWorkload:\nweekly homework (textbook) and webwork (online), 2 midterms, final\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 24, 2008",
            "review_content": "\nIf you have had any calculus experience before, this class should be fairly easy for you. However, if this is your first time taking calc, look for a different professor. There is a ridiculous curve (50% or higher A, 33% or higher B)if you have never taken calc before you will easily be in the bottom 30% because all his examples come exactly from the book and he does not cover extra material/provide exceptions to rules. If you are in his class you would be better off staying in your room and reading the book yourself, that way you can make sure that everything you study is correct. \nWorkload:\nWebworks and homework every week, 2 midterms, 1 final \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 19, 2008",
            "review_content": "\nIn my opinion, de Jong was NOT a good professor. His notes came word for word for the textbook. His examples were the same examples in the textbook.He didn't make an effort to see whether students understood what he was teaching during lecture, but he was very nice (and helpful) during his office hours...almost the complete opposite of lecture. Exams are hard but there is a curve so your grades will most likely be fine. Written homeworks are given weekly and are fairly easy. Webworks (online homework) about once a week. All suggested problems should be done when studying for exams! It's definitely possible to get an A in the class (because of the curve), but if you really want to learn calc, i would NOT recommend him. \nWorkload:\n2 Midterms (20% each), Final (40%), Written Homework(about 2-3 problems from each section, about 3-4 sections covered per week) (10%), Webworks (10%) \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 11, 2007",
            "review_content": "\nProf. De Jong's very friendly, he doesnt make you feel pressured or overwhelmed, but if you haven't taken calc before this class might prove to be difficult. Although most students in the class did abyssmally in both midterms we took he didnt create a session outside of class time when we could discuss and understand our mistakes. I've spent many hours in the calc help room, but if you're taking calc I this is probably one of your best options. \nWorkload:\nwebworks every monday (10%), work from the textbook every wednesday (10%), 2 midterms (20% each), 1 final (40%)he drops your lowest textbook homework grade and you only have to get 90% of the webworks correct to get full credit\n"
        }
    ]
}