{
    "prof_info": [
        {
            "prof_name": "Sasha Parmasad",
            "prof_id": 1883,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 20, 2004",
            "review_content": "\nWoe to you if you have been assigned Parmasad.  Fabricate a conflict in schedule or be prepared to accept your sentence of mental rape until brain damaged.  This woman, her class, and your freshman semester by association, will be a NIGHTMARE in which you will be relentlessly and repeatedly subjected to mindless writing \"exercises\". Get out and run for your social life.  \nWorkload:\ntypical u.writing with a sadistic twist of insufferability.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 21, 2004",
            "review_content": "\nI wholeheartedly agree with the previous review. One of the worst classes I have taken, and one of the worst teachers I've ever had. For all the assignments, she never made it clear what she wanted. When we would get graded papers back, we would be downgraded for things that had never been mentioned in class before. She was often unprepared for class. She made assumptions about what we already knew, which were completely unfounded and wrong. She made us do in-class exercises that felt pointless, didn't go anywhere, and didn't relate to the graded assignments. \nYou're not allowed to change UW sections unless you have a conflict. But, like the last review said, if you're assigned to be in Ms. Paramsad's class, you should definitely create a conflict to get out of it.\nWorkload:\nKind of a lot. You have to read about 7 long essays over the course of the semester; there are short ungraded writing assignments due every two weeks or so; and there are 4 long graded papers. The workload is pretty much the same in all UW classes, it doesn't depend on the teacher.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 21, 2003",
            "review_content": "\nTerrible Terrible Terrible.  She has to be one of the worst university writing teachers out there, and that says something considering the generally terrible teachers in the UW department.  She doesn't know what she's doing, and that comes through in the way the class is taught.  One day she showed up to class without a syllabus and she had no idea what she was doing and then let the class go an hour early because she was so lost.  Also, when she pronounces adverbs (especially those that end in \"ally\"), it sounds like she is saying \"bay-sik-ahh-leee\" and it gets really annoying after a while.  You'll see what I mean.  She also is really bad at proofreading and made one person write \"In this essay, I will discuss...\" as their thesis.  Are we still in 3rd grade?  She is a joke and so is this class.  Also, I'm not bitter, I ended up with a great grade in the class, but it was a severe pain in the ass.  Make a conflict ASAP in your schedule so you can switch sections!!!!  Beware the ides of Parmasad!!!!\nWorkload:\nit's UW... lots of reading/writing\n"
        }
    ]
}