{
    "prof_info": [
        {
            "prof_name": "Diane Cook",
            "prof_id": 9592,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 13, 2010",
            "review_content": "\nUniversity Writing is a terrible ordeal, but this really isn't Diane Cook's fault. Prepare to spend more time on UW than you will spend on any other class, perhaps as much as several classes combined. Diane doesn't exactly go light on the workload, either. Homework, taking several hours to complete, was due every class. If a draft of one of the major essays was due that week, I easily spent upwards of ten hours on UW. The beginning of each progression, a process of reading and discussing several essays, was really quite fun. The end of each progression however, drafting and revising long essays, was like pulling teeth for me. Again, this isn't really Diane's fault. Other than lightening the workload a little, there's not much she could have done to make the class better. As for her as an instructor, she seemed to really care about improving my writing (what more can you ask from a UW instructor?). She makes a lot of effort to meet with all of her students to discuss their essays in-depth, and her comments and instruction were almost always helpful in improving my essays. Diane has a quirky sense of humor which made class discussions fun. She's not the most lenient grader, but I never found her unfairly harsh. Ultimately, if you put in a lot (and I mean a lot) of effort and you maintain a good attitude about the class, you can get something out of it.\nWorkload:\nSame as any other UW class:\n4 Progressions:\nLens (20%)\nConversation (30%)\nResearch (40%)\nRetrospective (10%)\nYou can rewrite either your Lens or Conversation essay if need be.\nHomework is due every class, expect it to take a considerable amount of time, supposedly factors into your grade positively or negatively based on its quality.\n"
        }
    ]
}