{
    "prof_info": [
        {
            "prof_name": "Anna Ghurbanyan",
            "prof_id": 4140,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "December 29, 2016",
            "review_content": "\nI expect an A in Anna's lab, so there's my conflict of interest in writing this review. \nA week into the semester when everyone was trying to get into a section they want, I was registered in Anna's class on a Friday and waitlisted in Dani's. Oh my, the effort that went into the begging and whoring that I did to get into Dani's monday lab was unparalleled. I was attedning both Anna's and Dani's lab lectures for two weeks, just so I can try and squeeze myself into Dani's bc lets be honest a lot of people are still saying that Dani > Anna. WELL, NOOOOOOOOOO!!!! LET ME DISPROVE THAT TO YOU. \nI'VE NEVER HAD A BLESSING MORE DISGUISED THAN BEING STUCK IN AG'S LAB LECTURE. \nShe gives us so much practice for pre-lab. Like a lot. if you're about to take Orgo Lab I, brace yourself cause the first prelab is ridiculous, like yikes. It was I think 6 questions but 1 and 2 had a-j. lol Anna, why. but when the quiz came? Damn,  I slayed that. It felt so good, and everyone i know in Dani's class were like, damn I couldn't.... blehbleble... \nThen came the times when she'd make jokes in office hours or buy us pizza and baked ziti and talk about her ham sandwich and her swweet, sweet smell. Anna!! She's so helpful during office hours, so even though Dani's prelabs are graded by completion, ours kinda are too... just go to OH. 2 extra hours a week, maybe less... just make sure you come on-time, cause she uses it like lecture and the first 2 hours are like you trying to get answers.... which are cool and better if youve done/tried the prelab... do that and do the problems again and you'll be ready for her quizzes. They're a lot easier than I expected. It's also better than Dani's cause you don't have lab'lecture every week bc u have your lecture and lab on the same week. Dani has it alternating (i.e. one week lab, the other is quiz so you always have ORGO LAB-related classes)\nMy TA was Lindsey.... not much to say, but she's cool and composed. What I love most about her was that she's so open to letting us do our own thing. She'd let us start an experiment if she knows we already did the demo, and not afraid to just let us make mistakes, which I think in turn, makes me more confident in the lab. \nAnyway, back to Anna.... She also taught me NMR and IR. I went into out IR/NMR bootcamp with no idea about anything. like literally nothing. After 5h, voila. I can read a spectrum as quickly as I read Shakespeare. yay. \ntl;dr... Anna is perfect for those people who are ready to try hard. Don't be like me and don't think that you're \"STUCK\" in AG's lab, bc you ain't. It might just be the best thing that happens to your Chem career  @CU\nWorkload:\nA LOT. Every other week is like extra heavy. 1 week: lecture and then the friday of that same week, you have notebook pages (1-2h), pre-lab (damn damn damn hours)... then rest week, then the week after the week after the 1st week, you have a quiz, lecture, OH, pre-lab, notebook pages again... lather, rinse repeat. \n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "December 08, 2016",
            "review_content": "\nThis is the first year in which Orgo lab has become a full year sequence. Thus, the course was at a much more reasonable pace than that described by previous reviewers! It may explain the difference between their experience of Anna and mine. \nAnna is a good lecturer, clear on expectations, and amiable with her students. While she may come across as brusque if you try to ask questions on Piazza that were already answered in lecture or in a handout, she is actually doing this to help you learn. I found myself learning concepts INCREDIBLY well in this course, and it was very enjoyable. Of course the TAs play a huge part in this as well. Go to TA office hours! I think the new pacing of the course really helps Anna shine, it was probably hard to assign so much in one semester and still seem like a good teacher! I would recommend Anna for organic chem lab. \nWorkload:\n4 labs, 2 lab reports, notebooks, pre-labs (the first one is very labor intensive, the rest get better), bi-weekly quizzes (these are hard unless you review all pre-lab and old pre-lab solutions), final quiz. \n"
        },
        {
            "course_name": "Organic Chemistry  Lab",
            "review_date": "May 31, 2015",
            "review_content": "\nI want to start with reviewing the TA's; they're useless. They put on a facade as if they're willing to assist however they are completely focused on their future endeavors. One of the TA's said and I quote: \"do what you want I don't care, this is my last semester here.\" They have demeaning conversations about students that aren't performing up to par WITH the professor while laughing and pointing at them. Zero professionalism. Zero care. The rubric was inconsistent and Anna does not audit the TA's for consistency nor does she explicitly state what's expected of you and your reporting. I received one bad reporting grade and that set me straight. \nProfessor Ghurbanyan was not concerned with your understanding of the material. Was the professor fully adept? Absolutely, but that will not preclude you from failing nor does it ensure that instructor will ensure that they instill a modicum of knowledge into you. Anna was more concerned with her image with her TA's as she granted them full autonomy. Anna was smug and it was quite comical to behold. It was good practice to be amongst my polar opposite, to aspire to be a better human than a relentless robot. Was she amiable? Absolutely, while she spoke negatively about you behind your back. \nThe workload was extremely excessive, it's to be expected but not when the expected knowledge is outside the scope of the class. You can spend hours reviewing lecture notes, reading the files and resources, doing 100's of problem sets and still be dumbfounded by the quizzes and grading. I escaped unscathed with an A but I constantly applied pressure on the TAs. You will need to bleed them of all their information. I realized that they're all, Anna included under the impression that the students are dolts. Aren't they there to ensure that the information is comprehended? It's not as if you're taught the mechanism and then asked to apply it, no, you're taught general principles and are asked to derive theories. The course is organic chemistry lab,  not a PHD program. Who is running that asylum? It seems as though the reviews have yet to be taken into consideration by the Columbia faculty because the common denominator is the Anna. This course was horrible yet it had the potential to be outstanding IF the course objectives were clearly defined and adhered to, and if arbitrary questions on exams and grading were omitted, as far as personality traits, you can't teach class (double entendre).\n\nWorkload:\nExtremely labor intensive on every level. You must constantly recharge and condition your mental and emotional state in order to survive this course. You will spend at least 20hrs a week on this course and that's just on prepping for quizzes and completing prelabs.\n"
        },
        {
            "course_name": "Organic Chemistry Laboratory",
            "review_date": "May 28, 2014",
            "review_content": "\nLike any course, there are strengths and weaknesses of orgo lab. I'm writing this review because I felt that its weaknesses - particularly in terms of grading and \"lectures\" - were especially frustrating. \nTo put things in perspective, I just completed the postbac program. I earned an A or A+ in every other class or lab, while I managed only a B+ in orgo lab despite putting as many hours into that class as either biology with Dr. Mowshowitz or orgo with Dr. Doubleday.\nFirst, the strengths. The labs themselves are very enjoyable and understandable. If you come to class prepared, you will have a rich experience that enables you to understand organic chemistry concepts in a practical, hands-on manner. Furthermore, Anna is indeed very kind and approachable, as noted by other reviewers.\nNow for the weaknesses. First of all, the grading rubrics often are somewhat mind-boggling. For instance, one quiz question required ranking of chemical species based on polarity. I missed the #1 but had all the other molecules ordered correctly relative to one another. I therefore ended up with incorrect rank numbers - which are completely arbitrary in the first place - despite ordering 4/5 species correctly. This, according to the grading rubric, was somehow worth no partial credit.\nWhat really bothered me about grading, however, was getting assignments handed back late. At least the quizzes were graded relatively promptly and (usually) returned the following week. I studied hard for these and performed well above the class average. In contrast, the second and third lab reports and several lab discussions were returned to me in a packet one week before the end of the course. This was after the final lab report and discussion were due, which meant I had no opportunity to look at graders' comments as I completed subsequent assignments. This should be an integral part of any graded work; it's ridiculous that at a school with an $8 billion endowment, it takes so long to hand back previously-graded assignments.\nPart of the issue with the lab reports is also that they are all due in a span of 6 weeks, which seems absurd given the 15-week semester. While other lab write-ups and discussions took me about 3-5 hours of outside preparation per week, the lab reports easily take 15-20. This was especially difficult for me because I work part-time outside the postbac program. Simply put, plan on allotting a tremendous amount of time toward lab reports during that 6-week stretch; if you can get ahead in your other classes, that will make life better.\nFurthermore, Anna's \"lectures\" during each lab period are frustratingly simple. She basically dumbs down the material, going over the basics of each lab. Maybe this would be useful one week in advance, but anyone who doesn't already understand 90% of her lecture material simply didn't prepare for lab. It would've been much more helpful to spend lecture time going over practice quiz questions, lab report problem areas, or fine mechanistic details. These end up making the big differences between lower and higher grades, and in most cases, students are expected to figure everything out independently. Take advantage of office hours!! \nI'm not trying to bitch and moan here - I'm satisfied enough with my B+ - but I also believe that the organizational limitations of the course prevented me from performing as well as I could have. Enjoy lab but keep that in mind as you take it. Maybe it will make everything slightly less stressful for you than it was for me. \n\nWorkload:\n3-5 hours per week when there isn't a lab report due\n15-20 hours per week when there is\n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "May 16, 2014",
            "review_content": "\nQuite frankly I'm not really sure why the previous reviewers from this year were so disappointed with Anna. If you just stop and put yourself in her shoes for a second you will probably realize that running three 5 hour lab sessions full of gpa-gunning students who are forced to take the course is probably pretty difficult and stressful already. Letting you switch lab dates is a logistical nightmare. She tells you this at the beginning of the semester. This is just my 2 cents but just because she's the gatekeeper to one of the most obnoxious premed reqs at Columbia, it doesn't mean that she is required to cater to your schedule. As a student, it's kind of your responsibility to work with the prof. But then again I'm not taking the MCATs concurrently, so I can't understand the pressure.\nContrary to their experience, I found Anna to be very available and very approachable. She is able to keep the mood light in a pretty stressful class, and is actually a great teacher because she cares whether your are enjoying the course or not. If things taught in lecture were unclear, Anna would always take the time to explain in great detail during office hours. She also occasionally takes the time to ask how she could make the course more bearable. She's also pretty nice during lab time and will answer any questions you have about lab procedure.\nGenerally , the course work is pretty unpleasant, but that is not by fault of the teacher.\nThe 4 infamous lab writeups are basically full on papers every week for a month. I am a humanities major and I have never had to produce as much physical writing in any of my other classes. (~6 full pages of writing and mechanisms in chemdraw each). \nThe quizzes are also somewhat frustrating (each out of 20, with a 'final quiz' out of 30). The average on each of the quizzes hovered around 10 for my section. I think I might just be dumber than average but the general feeling is that there is no real way to adequately prepare for these quizzes because the material is sometimes completely beyond the scope of what was taught. For example, there was a question about the blood brain barrier on a quiz that was supposed to be about separation organic extraction techniques. That being said, everyone is pretty much in the same boat so as long as you have the material down you should pretty much expect to consistently place above average.\nEvery single lab writeup came with a handout with a lot of questions that Anna and the TAs want answered about the lab. Unfortunately, there was also clearly some kind of weird secret rubric to the lab assignments where you get random points taken off for not including certain things that were not explicitly asked for. (For example, points were taken off on one paper for not including drawn resonance structures for one of the intermediates, even though it was not explicitly asked for, and could have been explained in words). The lab writeups were also graded in a bizarre way where on one hand you are 'expected to write for a chemistry savvy audience' but then you get randomly docked marks if certain mechanisms are not drawn in such a way that explicates proton or methyl shifts which are completely trivial to any average organic chemistry student). What was sort of annoying was that you would also sometimes lose points for the same mistake twice (eg. -1 for including something you shouldn't have included in the abstract, and then another -1 for including that same thing in a different section because you \"should not introduce new material in this section\") \nAlso, do not expect to try to get points back on quizzes or lab writeups for any reason after they have been graded. Anna is pretty loyal to her TA's grading and will basically just flat out refuse to do regrades.\nThat being said, do not be frustrated if your grades during the semester look awful. This course is not about getting a raw score above a cutoff.  It is about placing higher than other people in your section on a curve.\nAll I did during the semester was place about 2-5 points above the average in all the assignments and I ended up with an A. \n\nWorkload:\nSo much lab time every week. And so much out-of-lab time doing the lab writeups. And then you get slapped in the face with those quizzes after you do all that work and show up. Agh!\nWay too much work for a 3 point course. But it's good that it's a 3 point course, because the curve is opaque and if you somehow screw up you don't get hit as bad, right?\n"
        },
        {
            "course_name": "Organic Chemistry Laboratory",
            "review_date": "May 14, 2014",
            "review_content": "\nOk, so I probably know the people who wrote the reviews below, and I know that aspects of these reviews are probably justified. But as they will point out, your options are limited with this class, especially when considering scheduling, and the fact that you're probably taking other pre-reqs. \nThis class is the most work you will do as a pre-med doing the standard requirements. Sure, Orgo-II has a ton of memorization, and the tests are probably more stressful, but within the framework of Orgo Lab, you will need to DO more week-to-week work. A review from a couple years ago put it accurately, that to get a decent grade on the lab reports, you will need to spend AT LEAST 15 hours on each of them. Go to the office hours, because the TAs are generally very helpful, and also because Anna left things out of the report guidelines that you could only find out from going to office hours. \nNow, to my unpopular opinion: I have absolutely no idea how I will do in the class, but as of now, I have slightly above the average. I loved this class. Anna is definitely tough, and might not give off an immediately approachable vibe, but I suspect it has to do with dealing with the most competitive, stressful, genuinely angry group of pre-meds on campus. This is why it is SOOO important to approach this class with a fresh sense of academic curiosity--you get the opportunity to apply all of the nonsensical things you learn in orgo-lecture! If you come at from this perspective, and show that you might have at least a 2% chance of being interested in the subject, Anna is super friendly, and very willing to help. \nI fucked up an experiment pretty badly during lab. I won't go into details, but it looked like one of those ridiculous situations only seen in the 1980s \"Lab Safety\" videos. No points were taken off, because Anna knows it's a learning process. If you take a deep breath, and commit to working on the assignments, and don't treat this class as one of your \"basic requirements\" you'll be fine. Too often we get bogged down by saying \"when will I ever need orgo in medicine?\" It's not about that. It's about loving the sciences, and the academic nature of various scientific fields. Not trying to be preachy, because I felt this way too, but too many people below me seem to have blamed the class (with the exception of scheduling complaints--I never experienced those, so I can't comment), when it's the person's own attitude approaching this class. \nWorkload:\nInsane, but not beyond reason. Weekly lab notebook writeups, 5 pre-labs, quizzes each week (to do well, you need to go to office hours AND look at the pre-lab answer keys), 4 gigantic lab reports (don't wait till the last minute, or you will increase your desire to murder the people who designed \"Chem Draw\"). A final 30 point quiz, which isn't really cumulative, but you will need to have kept up with everything. \nYOU WILL BE FINE. PLEASE RELAX AND DON'T STRESS EVERYONE OUT MORE THAN COLUMBIA ALREADY DOES. \n"
        },
        {
            "course_name": "Organic Chemistry Laboratory",
            "review_date": "May 07, 2014",
            "review_content": "\nIt was offensive how little effort Ms. Ghurbanyan put into this class.  Most of the handouts were full of spelling mistakes and many included errors in the actual answers to questions provided to teach the material.  What is more frustrating is that these handouts were dated from previous semesters, which indicates that despite being told about the errors she had not bothered to make corrections.\nAll grading is completed by the TAs - each lab section has three TAs so assignments are graded differently each week with no consistency.  A correction made on a lab report in response to an \"omission\" pointed out by one TA may be just the thing that the next TA deducts points for as too much information.  Ms. Ghurbanyan makes no effort to standardize the grading, or even to ensure that assignments are returned in a timely fashion - she simply blames the TAs rather than taking ownership as the course instructor.\nNo one is taking this class by choice, but given the opportunity take it with someone who pretends to care.\nWorkload:\nTakes a ton of time but is actually pretty easy.  Most of the work is simply busy work (i.e. copy the reagents and their properties from an excel file into your lab note book, no explanation as to why one simply couldn't print out the excel file and bring it).  \n"
        },
        {
            "course_name": "Organic Chemistry Laboratory",
            "review_date": "May 04, 2014",
            "review_content": "\nAnna Ghurbanyan is not of the same caliber of intellect nor ability as all of the other instructors and professors I've had the pleasure of learning from at Columbia.  Normally this type of deficiency could be compensated by an increase in effort, however, Ms. Ghurbanyan appears to put nothing more than the bare minimum into a three credit course required for many science majors - her handouts are full of errors, spelling mistakes, and the dates are not updated from semester to semester.  This is particularly aggravating when an error is obvious in an answer key but the date on the key is summer 2013, as surely the error has been brought to Ms. Ghurbanyan's attention but she has chosen not to address it.  The learning environment is uncomfortable due to the obvious resentment from which Ms. Ghurbanyan appears to suffer while interacting with students, her teaching assistants (who do virtually all of the work), and the administrative staff in the chemistry department office.  She berates students for trivial matters when they are encountering situations for the first time and have received no clear instruction.  She faults her teaching assistants for any elements of confusion rather than taking the onus on herself as the course instructor.  Ms. Ghurbanyan was also both completely inflexible and arbitrary about rescheduling lab sessions for students.  No consistency was displayed as she asked certain individual students to reschedule their MCAT exam dates rather than allowing them to make up their lab period at an alternate time, while simultaneously allowing a single student to attend an alternative lab period when that single student was taking an organic chemistry lecture exam that more than half of the laboratory class was also taking the same day.  \nIf you have to take this class, which you probably do if you're reading this review, make every effort to take a different instructor.  \n\nWorkload:\nFYI - I'm expecting an A-/A in the lab but can't believe how miserable an experience it has been.\n"
        },
        {
            "course_name": "Organic Chemistry Laboratory",
            "review_date": "May 04, 2013",
            "review_content": "\nThe fact that I'm even bothering to write a review about this course attests to how much I disliked it. Simply put, the workload was way beyond the workload one generally ascribes to a three credit course. You really have to bend over backwards to get a good grade in this class. I put a lot of my time into this class relative to my other classes and I still expect this to be my lowest grade for the semester (B+). From the 5 hour long classes to completing the unreasonably time-consuming lab reports prepare to sacrifice your social life for a semester. The overall administration of the course is also not very encouraging, for example you are expected to remember experimental techniques from previous experiments or risk losing \"technique points\" if a TA observes you doing the wrong thing. Most TAs understand that for most of the week you're not concerned with organic chemistry lab so they don't usually scout for opportunities to deduct points from students. You are given weekly quizzes that are quite difficult; I chose not to study for these unlike most of the high achievers in the class, but I still managed to do better than average most of the time. Preparing lab procedures is as bad, if not worse, than general chemistry lab. You'll have to spend a great deal of time reading three different sources to synthesize your lab procedure which has to include an introduction, reaction mechanisms, tables, and a bunch of other exciting stuff. In addition to writing the lab procedure you'll have to do a pre-lab problem set that is also collected and graded. The instruction on writing the lab reports are around four pages each so you can imagine how long it takes to make sure you've gotten everything that's required. You also have to use chembiodraw to design reaction mechanisms to include in your reports; learning to use this program will really test your patience. Most of the synthesis experiments require analysis of IR and NMR data; I can't stress how much time this takes. These are just a few of the things you'll encounter taking this class. Most likely for you not taking this class is not an option, therefore you'll have to really be tolerant and encourage yourself when taking this class.\nLike most other reviewers I agree that Anna is very nice and approachable. Her lab lectures were a great review for the concepts taught in the second semester of the lecture course. She also agreed to feed everyone pizza on one occasion. Despite how great Anna is I don't think this compensates for the overall bad experience I had with the course.  \nWorkload:\nAn endless amount of work every week (see description above). I felt like pulling my hair out in frustration at times, that's how bad it is. \n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "November 24, 2012",
            "review_content": "\nFor someone who has taken a year of orgo... this class isn't that hard. If you've been through second semester orgo and the mechanisms are still kind of fresh in your head, the quizzes, albeit tricky, should not be that bad. And it's usually your quiz performance that matters the most since people generally score similarly (and do pretty well) on the lab reports. For Anna's quizzes, you will be expected to know a lot of second semester material cold (and the topics that appear on quizzes aren't always covered in orgo lab lectures; you're expected to teach yourself if you haven't learned it already).  This, not surprisingly, puts people with a year of orgo under their belt at an advantage.\nRegardless of whether you have taken a year of orgo or not,  the workload lives up to its hype. These lab reports are exhausting.  A previous reviewer said at least 15 hours per lab report? The key word is \"AT LEAST.\" There is an enormous amount of analysis that needs to be done in each lab report, and one of these reports (I'm talking about full-length 2,500-3,000 word scientific papers with graphics and figures and tables that you need to create) can easily take up an entire weekend. This is a class that tests your stamina, in addition to your organic chemistry knowledge; you definitely do not want to rush on these papers; the grade you get on the lab reports generally correlates with the amount of time and effort you put in. At one point during the semester, you will need to juggle three of these papers at once, and I can tell you that it was nuts. I've found the writing intensity of this class to almost rival that of UWriting or CC. There is a TON of lab report writing. These reports really wear you out. \nDespite these brutal papers, orgo lab is not as bad as what a lot of people say. Anna is a wonderful instructor and her enthusiasm is great. It's pretty cool to get to see all the arrow pushing manifest in the laboratory, and although there are moments when the lab reports drive me crazy, I've enjoyed my orgo lab experience. \nWorkload:\nLives up to all the hype \n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "May 19, 2012",
            "review_content": "\nOrgo Lab was more painful than physics lab, which is saying something.  The amount of work required by this course is unfair and unmerited for a 3 hour course.  There is a 4 week stint during the semester in which you have to be thinking about 3 labs at once, and the combination of reading/pre-labs/lab reports/ quizzes is enough to make your head spin.  \nLet me highlight some of my major gripes:\n1 The Lab Reports:\n  These lab reports are no joke.  I easily put in 15 hours of work for each report.  You have to use chem-draw for the mechanism of each experiment (which is self-taught, by the way, so leave plenty of time to try to figure out what the heck you're doing), and then you need to condense what could be 20 pages of information into a maximum of 10 pages.  Anna gives \"guidelines\" for what should be included in each report, but this is more of a laundry list of items in no particular order. The icing on the cake is that she purposefully (according to my TA, whose office hours I went to religiously) left things off of the laundry list so that some students could go \"above and beyond\" (which is absurd, why would I waste precious space in my lab report talking about something that may or may not count for something??)\n2.  The TAs\n  It seemed to be a theme across sections that the TAs were awful. They are grad students that for some reason are not Orgo I or II TAs (I wonder why.....) and it seems like their sole purpose is to make the Orgo Lab experience miserable.  Mine was condescending, unprepared (as in did not read the lab manual before coming to class) and threatened to bleed us of points at every turn.  He had no patience, and was very rude.  \n3.  Anna's quizzes\n  Before each lab starts, Anna does a very basic lecture- Sn1 and Sn2 reactions, and why the solvent must be polar aprotic for Sn2 reactions.  For Diel's Alder, she'll talk about how a 6 memebered ring is formed and exo v. endo products.  Simple stuff.  However, on the quizzes she'll then ask \"how can you do a Diels Alder without forming necessary components of the Diels Alder ring product?\"  Were you not just saying 10 minutes before that the necessary components of the Diels Alder reaction were, well, necessary??\nThis review is not coming from a kid who did poorly- I got an A in the class.  However, this lab experience was the most unpleasant experience I have had at Columbia.  When you take this course, try to take it with a friend and do it on a day in which you can have free time after, because you will leave each day frustrated and wanting to give up forever.  For me, this course out of all the pre-med courses was the weed out course, and the catharsis I felt from finishing was more than I felt when finishing Mowsh's bio class.\nWorkload:\nWay too much.  I can't even list everything here by point breakdown, but just be sure you have at least 20 hrs/ week in the middle of the semester for out of class work time.\n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "August 02, 2011",
            "review_content": "\nWithout being insulting to the other professor(s) who teach this lab course as well, Anna is an amazing professor, the best Orgo Lab instructor and definitely the one you should take (even if you hear that she's a hard ass or whatnot, grading is based upon your TAs (who are in sections with all orgo lab instructors) and quizzes are the same with slight variations across different instructors so the grade distribution is normalized across all sections - Anna gives off the impression that she's the harder teacher but since you get the same grade evaluation across all sections, might as well take the best professor).\nAnna delivers quick, concise lectures for an hour before the lab begins and she actually teaches the stuff better than Orgo I and I instructors did (I had Turro and Lambert (Lambert was amazing)). One problem with her lectures, however, is that she lectures right after you turn in your pre-lab (counts for a grade) and what's on the pre-lab is what she lectures about, so you have to spend about an hour usually figuring out how to do the pre-lab and then Anna goes over it the day it's due, and some of the pre-labs are quite hard or confusing (the first pre-lab required googling information as it wasn't in our textbooks and one of the pre-labs revisited Gen Chem and requried you to do ICE charts although it seemed so anachronistic that you wouldn't know to do ICE charts in an Orgo class).\nAnna is always willing to help and she actually stays in the lab the majority of the time to help students rather than leaving it to the TAs. She also has a great sense of humor (she had some entertaining conflicts with this cheeky student in my class) and is very friendly. She's VERY available during office hours and before class and actually wants students to do well. She's also very quick at getting emails back to you.\nThe grade for Orgo (across all instructors) is curved to a B+, 88% I believe. It's easy to get a B+ if you put in the work (same as everyone else), but it's actually hard to get an A- as everyone's grades are about the same. Don't judge me, but one time (the TA's leave the quizzes for pick up at the front of the room) I rifled through everyone's quizzes to get a look at how my score stacked up and basically the range of quiz grades was 15-17/20 with one person getting a 9 (ouch!). So, obviously to get an A- you need to consistently be the one who gets 17/20 which is pretty damn difficult. A string of 16s and your set for a B+.\nOrgo Lab sucks. But at least Anna is a great professor.\nWorkload:\nHorribly heavy. You have these monster 3-5 hours lab reports....takes about 5 hours for the first few while you're getting used to how they want it done and then 3 hours for the last 2...there were 5 lab reports I believe. \nYou're also expected to draw all chemical reactions for the lab report using the program chemdraw which is also why it takes forever.\n\n"
        },
        {
            "course_name": "Intro to Organic Chemistry lab",
            "review_date": "June 13, 2011",
            "review_content": "\nTook orgo lab with Anna spring semester. I have to say, it was a blast. For those of you who were thinking of taking the course in conjunction with orgo chem, make sure it is during the spring semester because much of the material you learn in this class is covered more thoroughly in orgo chem.\nI would advise taking the tu/th session as her weekly lectures are on tuesdays and the quiz is on thursdays. In addition, for about 40% of the labs, many of us just came in on thursday, took the quiz and then left.\nAs for Anna herself, she is very sweet and bubbly. She will help you if you seek her out. Her quizzes are fair and easily separates those who actually know the stuff vs. those who are trying to bs their way through. All of the grading is done by the TA so it definitely helps knowing them.\nWorkload:\nWeekly quizzes, 4 lab reports, 5 pre-lab assignments, 1 final quiz that is around 40mins long. MUCH easier than intensive chem lab\n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "May 03, 2011",
            "review_content": "\nAnna was a pretty good lecturer. But those full-length lab reports were soul-sucking dementors. Quizzes were sometimes hard and asked questions that were not covered in Anna's lectures. 4 hour lab session + 10 hours working on lab reports + 3 hours writing up the next lab report's procedure and studying for the quiz is worse than two-timing a high-maintenance significant other with another high-maintenance girlfriend/boyfriend on the side. I'm guessing if you're taking this class there is no way around it, but your experience all depends on your TA, and how much you're willing to work your ass off. My TA happened to be a person with a sweet exterior and a heart of cold-blooded-GPA-slashing-evil. His/her grading was tougher than the Chicago Bulls' defense: every little slip-up and mistake is spotted and punished with severity.\nI can't say I've enjoyed this course, but I can say that at times I've definitely hated this course. The labs definitely made me study hard and learn the experimental techniques very well, and I could see that I've learned at the end of it, but this knowledge should not have come at the cost of making me hate the material because of how much time this class took up and how much frustration it caused. I didn't hate orgo before. In fact, I liked it after having a marvelous orgo instructor. But now I do, just a little bit.\nWorkload:\nDid you read soul-sucking dementors?\n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "January 21, 2011",
            "review_content": "\nAnna's so incredibly sweet! As the previous review said, she sounds intimidating when she's lecturing, but one on one, she's the most approachable person ever. If she's around the computer lab when you're using ChemDraw there, she doesn't mind if you ask her to look over your mechanism (of course, it's your TA who actually grades the mechanisms, but having Anna's input doesn't hurt). \nHer quizzes were frustrating at first because they seemed impossible to study for (especially the procedural questions). But they did get better as the term wore on, since her later quizzes were more conceptual and focused more on actual orgo mechanisms/concepts. \nThe lab reports weren't bad at all. Just make sure you answer all the questions, most of which are based on an understanding of the mechanism. Also pay careful attention to the formatting - my TA was a stickler about what kinds of information should show up in the introduction and what should be left in other sections of the report.\nI took the lab with orgo II, and I highly recommend taking this route. I think part of the reason why the lab reports became relatively painless (and even easy) by the end was because I didn't have to spend time teaching myself the mechanisms and the concepts behind them - it was all review at that point. I've heard people say that the curve is better/more lenient and the expectations lower in the fall, but, assuming this to be true, I'm not sure that's worth all the frustration and headache of teaching yourself the material (especially if you're an undergrad with so many other commitments). And to be honest, there's something quite amazing about taking all those concepts you learned from the textbook and lecture notes and seeing how they work out in actual laboratory situations. \nWorkload:\nReally not that bad. \n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "January 06, 2011",
            "review_content": "\nAna was an awesome Orgo Lab instructor! At first she comes off as kind of a hard-ass because she delivers each lab's 30 mins - 1 hour mini-lecture very forcefully, but she was a complete sweetheart when it came to asking for advice on the lab in progress or for help on lab reports. One time she even went around the lab asking people to try the new organic moisturizing cream she had recently synthesized. I took the lab concurrent with the first semester of orgo, which I found to be very nice. Yes, some of the things taught in lab were not yet covered in lecture, but generally Ana did not expect that we knew them in the same depth as we had to in the lecture (I had Doubleday). Thus, learning the material in lab laid a nice groundwork for learning it again in lecture, and vice versa when it was covered in lecture first. Grading was a little bit convoluted, but Ana and the TA's take everything into consideration when assigning your final grade, including the effort you put into the course.\nWorkload:\nPrelabs (10 points each for the first 6, then 0 points) + Notebook (10 points, then 5 points once you start writing lab reports) + Technique (15 points) + quizzes (20 points each, then 30 for the final quiz) + Four Lab Reports (45 points) \n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "February 01, 2010",
            "review_content": "\nIf you ask the chemistry department when to take this course, they will tell you that in their experience, it makes no difference whether you take it with first or second semester of orgo. The grades might be statistically similar with both groups of students, as they claim, but the major difference is that while one group must spend hours reading ahead/frantically googling to learn the material, the other group has very little excess work.\nFor those like me (especially those with a bad orgo professor who are basically totally lost until they teach themselves before midterm), the class could be frustrating. Concepts that the others knew were hastily taught in 15 minutes and tested on right after. My performance on the quizzes, thus, was dreadful. Luckily the class is curved nicely enough that I still ended up doing relatively well.\nIt wasn't too much the fault of the Instructors, they couldn't really afford to take more time to teach the material and it probably served as a fine review for those taking it concurrent with second semester orgo.\nThe lab itself was much better than gen chem lab (as is almost everything) and in my section at least, relatively low stress. Lots of standing around talking waiting for things to distill. We usually got out by 4ish and often the TAs let us do a shortened procedure from what's in the lab text. No practical or written examinations, just weekly quizzes for which the class-wide average is usually near a 50 (class is curved, so don't freak out when you see bad quiz grade.) The lab reports are worth a lot more points than the quizzes anyway.\nThe lab reports take a long time, especially if you need to teach yourself the theory, but they aren't horribly bad. Plus, you only have to do 4 or 5 (can't remember)- the earlier labs are report-free.\nWorkload:\nLittle/no orgo knowledge: medium to high\nOne semester of orgo knowledge: low to medium\nPrelab problem set (short), prelab notebook write-up, a few lab reports towards the end\n"
        }
    ]
}