{
    "prof_info": [
        {
            "prof_name": "Souleymane Diagne",
            "prof_id": 4241,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Islamic Philosophy",
            "review_date": "August 14, 2016",
            "review_content": "\nDiagne is totally brilliant, and also a very sweet man. He has a very calm disposition, and clearly cares deeply about the material in class. He encourages everyone to contribute. If you try hard and talk with him before assignments, you will do well. \nWorkload:\n2 long papers with numerous complex reading assignments. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 19, 2012",
            "review_content": "\nWe took to calling him Magister. The title is fitting. Diagne is simply brilliant. I really am in awe of how smart he is. WOW. So freaking smart. \nHe structured CC well I thought. I mean, this is a class where most people don't do the reading. It's hard to create a forum for discussion amongst those who haven't read Aristotle about Aristotle. Diagne somehow does it though. He starts off with a lecture and then asks very direct questions (the questions which will most indubitably be on the midterm and final) which those who have read (both of them) can debate. \nMagister also never shuts anyone down. He's really encouraging when people participate. I found myself almost incapable of participating just because he's so smart though. I would hate for him to think I were unintelligent. Regardless, participation is only 10% of your grade and even if you never say a word, you can get full credit + extra credit if you show up to every class. I think having only 10% participation actually worked quite well because those who never read but think they're such brilliant bs-ers were quiet. (Well...mostly quiet. There was definitely one exception there.) \nI sat through Lit Hum wishing it would end, staring at the clock. In CC, which arguably was much less interesting, I somehow was shocked when I looked at the clock. Every time forty minutes had managed to slip by. Class went by quickly. \nDiagne is a brilliant guy and a brilliant professor. If you're in his section, stay in it. STAY IN IT. LISTEN TO ME. Count yourself lucky you'll be in the presence of greatness twice a week for an hour and fifty minutes. \nWorkload:\nA midterm (basically what we talked about in class, and only over the first four books), two papers of 6-7 pages, and a final (only over the last four books). All tests were open book too. \n"
        },
        {
            "course_name": "Islamic Philosophy",
            "review_date": "May 19, 2010",
            "review_content": "\nThis class was supposed to be a seminar, but it turned out to have about 50 students in it, half of whom were grad students, so the set up and grading system were kind of different than your usual lecture or seminar. Two grad students would present the week's reading during the first half of every class, and the second half would be devoted to lecturing and questions. \nIt was generally an excellent syllabus for an overview of Islamic Philosophy. Diagne did a really good job of weaving together recurring themes. So even though \"Islamic Philosophy\" sounds a little vague and unwieldy, I definitely felt like the syllabus was both cohesive and comprehensive. The reading was pretty manageable, and because the grad student presentations basically summarized the texts and bullet pointed key ideas, you didn't really have to read everything to get a fairly good idea of what was going on. \nI found the participation aspect of the class kind of strange though. Diagne definitely tried to encourage students to ask questions, and mentioned that participation and attendance were part of the grade. But because the class was so large, it was kind of difficult to talk much/ at all. He did call attendance at the beginning of every class and could match every name to a face by around half-way through the semester, which is kind of impressive (given that most professors don't even bother with names names in a 50-person class). \nAs a professor, Diagne was really sweet, had an awesome sense of humor and was never without a huge smile on his face. He was really approachable and extremely down to earth, despite being extraordinarily smart and brilliantly versed in every philosopher we read. He also made it really easy to relate the Islamic philosophers to philosophers from CC, so everything was framed in the larger philosophical context. At the same time, because he knew the texts so well, there were always opportunities for close and intertextual readings. \nWorkload:\nI think the grad students were graded on their presentations and a final project of some sort. The undergrads were graded on a midterm paper and a final paper of about 10 pages each. The papers were graded by the TA, so going to his office hours definitely helped. Diagne said that he would add \"a point\" (to what, I'm not sure - I suppose participation point) for perfect attendance, and also apparently factored participation in somehow, but I'm not sure of the exact distribution. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 12, 2010",
            "review_content": "\nA Senegalese philosopher, an expert on Descartes, and a man well versed in a number of languages and cultures, Professor Diagne provides one of the nicest CC experiences imaginable. On the first day of class, he walked in with a huge smile on his face, and as the semester progressed, it really became clear how very much he cared about his students. \nWhat's great about Professor Diagne is that he is exceedingly challenging but rewards your efforts magnificently. If you think you're performing at a B or B+ level, it's likely you'll come out with a final grade of A- or A. His style: short lectures, followed by class discussion. At the beginning of each class, he writes 4-8 important questions (or bullet-points) to guide students in their discourse.\nProfessor Diagne also found a great way not to penalize shy students, while also rewarding students who participated: \"Attendance/Participation\" counted for 10% of our final grade. If you go to every class, even if you never say a word, you get 10/10. If you participate a lot, you'll get something like a 12 or 13. So, it's to your benefit to speak up, but you won't be hurt if you don't.\nOur class was one of the few CC sections that didn't have a real final exam. Instead, we had an in-class open-book test over only the last four works. It was really nice not to have to go back and cram for a 3-hour hell session.\nTake Professor Diagne's CC class if you can--he's awesome.\nWorkload:\nModerate. For homework, no responses or discussion questions--just the reading. Three IN-CLASS, NON-CUMULATIVE, OPEN-BOOK tests, each worth 20%. Two 5-7 pg. papers, each worth 15%. Attendance 10%. Extra credit for participation.\n"
        }
    ]
}