{
    "prof_info": [
        {
            "prof_name": "Diana Heller",
            "prof_id": 10699,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "September 28, 2016",
            "review_content": "\nRidiculously unhelpful, boring material, tests with irrelevant material. \nShe called Africa a country. \nWorkload:\nReading, huge tests. \n"
        },
        {
            "course_name": "Biology 1001 Lab",
            "review_date": "November 12, 2014",
            "review_content": "\nDr. Heller is a wonderful lab instructor and i disagree with all the negative reviews previously written. I look forward to bio lab every week because she is so kind and caring. She has a genuine love for biology which is evident in the way she looks out for all of her students to ensure we understand the experiments. She creates a very relaxed and chilled out environment in the lab which allows for casual conversation as well as stimulating discussions. Personally i have major problems with computers and statistical analysis but without hesitation she is willing to help. She doesn't expect your experiments to be flawless and understands if you mess up a bit. All around great experience and i'd recommend taking her section. \nWorkload:\nStandard for all BIOL 1001 Labs- 2 lab reports, couple little essays, Natural History Museum activity. Midterm and Final practicals\n"
        },
        {
            "course_name": "Contemporary Issues in Biology (Lecture)",
            "review_date": "April 06, 2014",
            "review_content": "\nProfessor Heller does not treat students with the same respect she reserves for adults, and is often condescending. In the lab environment, Professor Heller is unsure of herself and a harsh grader. I have also received misinformation concerning exams from Professor Heller. Nearly everyone P/F her class, not because the material is difficult, but because Professor Heller is a nightmare of a teacher. Contemporary Issues in Biology has been the worst class I have taken at Barnard/Columbia thus far. Though the course material is incredibly useful to know, many students choose not to come to class and claim that Professor Heller relays inaccurate information. It is incredibly unfortunate that Professor Heller is one of the only professors teaching introductory biology. This course has a lot of potential, and Professor Heller does not come close to doing the material any justice. Avoid Professor Heller if at all possible.\nWorkload:\nSimple, but with absurdly difficult exams.\n"
        },
        {
            "course_name": "Contemporary Issues in Biology (Lecture)",
            "review_date": "April 16, 2013",
            "review_content": "\nI really don't understand why she gets such a bad rep. Other than being a bit monotonous, she's not bad at all. The material is straight forward and her lectures summarize absolutely everything. I read the textbook as well and I was golden. If you've taken bio in high school you will breeze through this class. Even though lab was just irritating, it definitely wasn't difficult. \nThis is an entirely doable class and she is very helpful at office hours. I don't know why people dislike her so much. I found the class pretty straight-forward. \nWorkload:\n2 midterms, a final, all multiple choice. The final wasn't cumulative so it's basically another midterm. No homework. A few lab papers, nothing difficult or unmanageable. \n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lab)",
            "review_date": "April 01, 2013",
            "review_content": "\nShe is boring. The class material is boring, but she is even more boring.\nThe grading for labs is barely explain and when you go to the instructors, they confuse you even more. People I know get low grades and P/D/F the next semester, if take it at all.\nProfessor Heller is a nice person, but boy is she unhelpful! When you come into her lecture, you see a bunch of slides and her talking on the background. Well, if you hadn't read the book the night before, she will make no sense. So read the book - then at least you will understand what on this planet Professor Heller is talking about!\n\nWorkload:\nNo homeworks, two midterms, one final. The book is boring, but you will have to read it once to get a B or B+.\n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "December 04, 2012",
            "review_content": "\nThis is possibly the worst class I have ever taken at my time at Barnard (three years). She does not know or understand how to teach a course, let alone biology. I am better off skipping every class and teaching myself (which is what I do anyway). She does not prepare you for any test nor does she teach the material well. I leave lecture being more confused and angry than I was before I got there.\nShe cannot explain any question asked in class well and once she even laughed at a girl who asked how we are supposed to identify an answer on the test. All she said was \"practice more.\"\nI do not recommend this class to anybody. The tests are hard and the lectures are pointless. I did not learn a thing\nWorkload:\nRandom participation questions (during class)\ntwo midterms, one final - both very hard\n"
        },
        {
            "course_name": "Biology 1001 Lab",
            "review_date": "May 08, 2012",
            "review_content": "\nProfessor Heller is the worst teacher. I took this class because it was supposed to be meant for students who just wanted to get through the lab science requirement. Professor Heller would send out the notes the day before with huge pieces missing and then read the slides. I would be so busy copying the notes that I didn't hear anything she said. It was also really hard to study for the exams because there was no way to know what kinds of questions she would ask. Every exam the average was between a C- and a B-, you would think that would tip her off to the fact that no one was understanding her but she doesn't seem to realize or mind.\n\nWorkload:\nThere was no work in this class except the exams that everyone consistently failed. She also uses pop quizzes that aren't graded but if you miss more than one your participation grade goes down really fast so you actually have to show up.\n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "January 05, 2012",
            "review_content": "\nThis class was downright awful. I took it because my adviser said that Bio 1001 was the best class for people who aren't \"scientifically inclined\" - such a lie! While Prof. Heller seems to be a nice person, she has no clue how to teach. When asked to explain something differently, she would say the exact same explanation, but slower. She never seemed to think that 25pt curve on every single exam might indicate that we didn't get what she was teaching. She would spend an incredibly long time on something as mundane and simple as Punnett squares, and then zip through photosynthesis in two lectures. Her exam questions made no sense and it was pretty much impossible to study for. I spent more time on this class than I did for the two classes I took for my major combined, and I still had to PDF to do okay. Ridiculous. I'm so pissed I have to take Bio 1002 next semester to fulfill my requirement.\nWorkload:\nReadings that weren't usually necessary - she sometimes used different terms in lecture, and those are the ones she tested on. Lab saved my grade (two lab reports and a bunch of other really easy assignments). \n"
        },
        {
            "course_name": "Contemporary Issues in Biology (Lecture)",
            "review_date": "December 03, 2011",
            "review_content": "\nThis class was such a waste of time, and Professor Heller didn't make it any better. Her excuse for repeatedly not knowing answers to questions was \"I'm not a doctor.\" Her exam questions came out of left field, and the fact that we required 25-point curves on exams for a couple people to get As never really sunk in with her. I would definitely not take this class with her again- she has no idea how to teach biology to non-science majors.\nWorkload:\nReading and a movie outside of class that wasn't necessary; lab sheets that were generally pretty easy (major grade-saver); 3 tough exams with generous curves; attendance not taken and PowerPoints on Courseworks, so there was no reason to even show up\n"
        },
        {
            "course_name": "Contemporary Issues in Biology (Lecture)",
            "review_date": "April 11, 2011",
            "review_content": "\nI've had an awful time in this class, and I came in with a lot of biology from high school. I think the number of people P/D/F this classes speaks for itself. She seems like a perfectly nice person but her lectures are dreadfully boring (and repetitive, you can seriously come in 15 minutes late and not miss a thing because she's recapping the entire lecture from the class before). All the power points are put on courseworks. I could have dealt if the class was boring but what really gets me is the exams. She does an awful job of indicating what material is actually going to be on the exams. This semester for example we spent over a week talking about HIV, plus a lab that focused on it. Then on a 50 question midterm, there were 3, maybe, questions on HIV. It makes it a really frustrating course to study for because even if you study exactly what she tells you to, and not be prepared for the exam (not to mention she frequently has to re-write questions in the middle of the test because someone points out a question that makes no sense). No one cares (no ever shows up to class) because they're only there to fulfill their science requirement and she doesn't get that. I will be so glad when this class is over. \nWorkload:\n3 exams (one is the final, it's not cumulative) plus a few \"surprise\" assignments throughout the semester that are incredibly easy and mainly exist to make people show up to lecture once in a while. Plus work from lab (which fluctuates). There is required reading but it's really not necessary to do. \n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "December 21, 2010",
            "review_content": "\nthis class is NOT easy! she does not know everything about the subjects and it shows! she is not very approachable, but tries to be. her exams are all curved because the test is good for bio majors! it is impossible to leave all the studying for the night before the exams because they are HARD! thankfully she curves so the damage is not completely terrible! the final was very challenging because the cumulative portion has very specific questions even though she said it was going to be on the \"big ideas.\" overall, i would recommend it if you are interested in the material because you do learn a lot, but it is not the easiest way to fulfill the science requirement. \nWorkload:\n2 exams (1/3 of the grade), final exam (1/3 of the grade) and the lab attached to the lecture is 1/3 \n"
        }
    ]
}