{
    "prof_info": [
        {
            "prof_name": "Susan Gladstone",
            "prof_id": 6499,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Senior Seminar: International Topics Urban Studies",
            "review_date": "September 25, 2013",
            "review_content": "\nHello all! Even though I graduated a few years ago, I feel the need to respond to the review posted below about Susan and clarify a few things based on my experience (and the similar experiences of many of my classmates) during our senior thesis seminar. Susan has her own style, there is no doubt about it. She has a dry sense of humor and sometimes felt like a coach telling us to get our acts together when we were late on parts of our theses. She also happens to be THE SINGLE MOST INSPIRING PROFESSOR I ever had at Columbia. From the first day of class, she told us that part of her job was to make sure we were all doing something exciting and engaging when we graduated... and then she helped us make it happen. She talked to each student in our seminar individually about our post-graduation plans, always wrote letters of recommendation, and counseled us in ways that Columbia Career Services never did (at least for me). Everyone in my small thesis class graduated and went off to do exciting things (graduate school, urban studies-related internships, living abroad), and I know that Susan contributed in varying degrees to push each of us toward these goals. She represents the only real hands-on support I got at Columbia. As far as the thesis process itself, maybe she gives less intensive comments than some of the other teachers, but that is missing the point: She makes our thesis \"real-life\" for us! Most of the students in my class got to travel to whatever country we were studying over winter break (thanks so Susan pushing us to apply for funding) and I went back to Rio de Janeiro after graduating to continue the work that I started during my senior thesis. Of course I am not saying, \"take Susan's class and your future will work out magically.\" I am saying that I (and other students I spoke with) felt constantly inspired by Susan to make our studies real and relevant outside of Columbia. If that's not the point of being a professor, I don't know what is. \nWorkload:\nSets deadlines for different chapters of the thesis which were pretty lenient and fair (given that this is a year-long thesis seminar!)\n"
        },
        {
            "course_name": "Senior Seminar: International Topics Urban Studies",
            "review_date": "May 18, 2013",
            "review_content": "\nI wish that Susan had demonstrated some level of respect and enthusiasm for teaching this course. As it was, I felt disrespected by her unwillingness to offer constructive criticism or feedback of any kind throughout the thesis process. This entire year was endlessly frustrating for me as a student trying to complete the culminating work of my major. Susan did not offer me helpful feedback, much less any feedback at all. She changed deadlines nonchalantly (to compensate for her own tardiness) and treated us as though we were incorrect in thinking the final due date was earlier. When confronted, she explained that she was providing minimal to no comments on drafts because she \"didn't want to waste her time\" given that chapter drafts would be drastically different in the complete draft. Without any feedback, I made almost no changes between handing in chapter drafts and the complete draft. When we handed in our complete drafts, Susan promised we would understand \"why teachers tell you to double space.\" This proved to be false. Our original syllabus gave a deadline of April 15 for our full, complete draft. At some point mid-semester, the entire syllabus was pushed back a week; thus we all understood the final due date to be April 22. On April 15, the day our complete drafts were to be returned - three weeks after we had turned them in - Susan lied to us and said that the deadline for the full draft had always been April 29. Upon receiving my complete draft the next week, I turned to every page to find a single check mark. Unfortunately I was unsurprised because this had been Susan's typical \"feedback\" on each of my past drafts. In the beginning of my thesis I had accidentally included an incomplete thought; I had ended mid-sentence in explaining the argument I would make using a central theory. There was no comment or marking on this sentence, no indication I had made any mistake at all. This proved to me that Susan had not bothered to read my thesis. Despite the fact that I had approached her and explained how more constructive feedback would be helpful to my writing and research process, this never happened throughout the course of the year. In the end, Susan's attitude about my thesis affected the effort I put into it. I felt she did not care about my work, and because I knew I would be turning in the final product to her for a grade, I did not care about my work either. In my complete draft I had written a rushed conclusion that did not do my entire thesis justice nor properly summarize my arguments. Susan's only note on the final page of my complete draft was that I had written a good conclusion. I regret choosing this thesis section and wish I had had a different experience in writing my thesis because I loved my topic and argument. Susan's attitude and ability as a professor transformed my passion and enthusiasm for the process into anger and apathy.\nWorkload:\nFirst semester: weekly readings from \"Craft of Research\" on how to write a research paper... Second semester: chapter drafts ~every month/every six weeks? informal presentations accompany these chapter drafts; you are expected to give a final, formal presentation as well\n"
        },
        {
            "course_name": "Urban Studies Colloquium",
            "review_date": "May 31, 2011",
            "review_content": "\nSusan is a nice person in general and helpful during first semester. However, something happened in second semester for the Senior Seminar in International Topics. We only had class about nine times (out of fourteen weeks). She would cancel class an hour before it was scheduled without providing a reason. Although she was often late (30-1hr) first semester she promised she would not be late second semester. But this didn't really happen. She would also routinely give our thesis corrections back more than a few weeks later than promised. This is very stressful given that by the time you get your corrections back your paper may have gone in an entirely different direction. oftentimes the comments were so sparse that it did not seem to warrant the month long wait. In the end she had to push our final deadline back two weeks to make up for her lateness in returning our final drafts. We all just wanted to get it over with but it was dragged out even further. The point of handing in the thesis early is to be able to focus on other classes and finals but this didnt really happen with Susan. To get the most out of this class you will have to rely on your thesis partner. The same is true of all the urban studies senior thesis seminars as I have heard even worse horror stories.The research experience is completely worth it though. But be warned that just because she is consistently late in everything it does NOT mean she will allow you to be. She has little patience for it in others. \nShe does, however, bring AWESOME guest speakers each semester. \nWorkload:\nfirst semester- few articles each week, annotated bibliography of your research finding, first draft by winter vacation. Also periodic informal presentations of where you are in your research\nsecond semester- draft due right when you get back from vacation (dont wait till the last minute!). New Draft due every few weeks. About 3 more in total. No readings this semester but field trips and guest speakers. \nYour final thesis has to be 50+ pages\n"
        }
    ]
}