{
    "prof_info": [
        {
            "prof_name": "Irvin Hunt",
            "prof_id": 10800,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Literary Texts, Critical Methods (Seminar)",
            "review_date": "January 26, 2012",
            "review_content": "\nI just spent a long time writing out a very harsh review of Irvin Hunt, but decided that it was overly biased and heated, not to mention rambling. My basic opinion is that I find Hunt's communication abilities and, more importantly, his grasp on the material, to be simply unacceptable. Not only did I not feel that I learned anything new from him, I felt that there was a basic lack of clarity in the way he conducted class and the discussions that resulted. Two class periods was enough to totally convince me that an entire semester with Hunt would be highly unproductive. I recognize the limitations inherent in my viewpoint: having only attended two classes before switching sections, I cannot give anyone advice about the trajectory of the entire semester. I suppose all that I can really say is that, if anyone attends one class with him and finds it very frustrating, but wishes to wait and see if maybe the next class will be better, I can tell you that in my experience the next class was even worse. Potential students: I advise you to trust your instincts. I get the impression that the class would have been pretty easy, but the two classes I had with Hunt were quite possibly the most intellectually infuriating four hours of my life.\nWorkload:\nDetermined by the course more than the section leader. Can only comment on the assignment due for the second class: a 3 page response to a poem, easy enough\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "June 30, 2011",
            "review_content": "\nIrvin Hunt is not for everyone. If you want your UW class to be all sunshine and roses, stay away from him. He knows what he wants, and he has no compunction about blasting your ideas out of the sky. The previous reviewer hated him for that. I find it refreshing.\nIrvin can be egotistical, unfocused, and occasionally downright obnoxious. His ravings may be a load of horse dung, or they may be genius; I guess that's a perspective thing. It is true that he cares more about his favorite TV show (Curb Your Enthusiasm--hard to argue...) than about his students. I don't understand why that shocks some people (then again, this is Columbia, so a lot of these people have been coddled since they were a glint on their daddy's meatus). You can laugh at his stupid quirks, or you can sulk. Irvin doesn't really care. That being said, he generally recognizes effort and rewards enthusiasm. It is true that he gives you fewer options than other UW instructors. Many will see this as a negative, I again disagree. It forces you to actually read and write in a new way, which is the purpose of the class. While this leaves less time for the \"exploration\" (mental masturbation) that others crave, it gets the job done. Again, just make a good faith effort, do things Irvin's way, and you'll get something out of the class. At the least, you'll get a decent grade. At best, you'll laugh your ass off.\nThe verdict: If you have thick skin, take this class. Irvin is very smart, and occasionally has interesting ideas. If you want someone to reinforce your self-esteem, look elsewhere.\nWorkload:\nStandard UWriting. Three essays, one retrospective speech of five minutes. Exercises for each class, ranging from several paragraphs to several pages of writing.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 17, 2011",
            "review_content": "\nHunt was disparaging, confrontational, and egoistic in the way he handled class. Classes were filled with long lectures instead of stimulating discussion, and when he did solicit student opinion, he often shot it down saying things like \"you're incredibly off-mark,\" or \"you're so wrong that I don't know how to respond.\" He often went on long digressions about his favorite TV show, or his own dissertation research. Furthermore, unlike every other UWriting section, he did not allow us to choose our own research essay topic, but instead mandated that we all discuss humor, his own dissertation topic. We did not read several articles and vote on a seed text, instead, we were handed an article on stand-up comedy and were given a very restricted range of questions we could pose in our essay. He also rarely, if ever, allowed us to disagree with the authors of the texts that we read, saying that since these authors spent years working on their themes, while we read it over the course of a week, we were unqualified to comment negatively on them. His written feedback was the only useful part of this course, as it did indeed force us to dig deeper into the texts. However, in conferences, he often didn't remember which essay was ours, and spent ten minutes re-reading our essays before giving us any feedback, and then left shortly thereafter, since conferences often didn't last more than fifteen minutes.\nHonestly, the worst teacher I've had at Columbia. He's clearly more interested in his own research than teaching, which was showcased by his constant referral to his dissertation topic without thinking about its relevance to us.\nWorkload:\nsame as any UWriting class\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 23, 2010",
            "review_content": "\nHe's obviously an incredibly smart guy, but unless you give him exactly what he wants to hear, he will tear your argument to pieces. He obviously knows what he's talking about (having gotten two master's degrees and currently working on his PhD in English) and he presents a unique view into the history of writing style and interpretations, but in class, he spent more time arguing his own position than listening to what his students had to say. If he listened to his students more, he could be a really solid, fun-to-have teacher. Unless you want to simply regurgitate the format and style he presents to you at the beginning in every paper, though, try to switch to a different teacher for now. \nWorkload:\nFair for a UWriting class. \n"
        }
    ]
}