{
    "prof_info": [
        {
            "prof_name": "Knarig Arabshian",
            "prof_id": 3184,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Topics in Computer Science: Intro to the Semantic Web",
            "review_date": "April 28, 2011",
            "review_content": "\nFrom my course evaluation:\nI am sorry to say, but this course was a waste of time and money. The professor began the semester hiding behind a desk, and it only got worse from there.\nAs more and more people stopped coming, she seemed to lose more and more of her confidence. \nThe midterm was a disaster, much too long and needlessly picky on syntax. Certain things are done best by computers, so what is the point of having them on an exam other than to be able to ascribe a grade at the end?\nFollowing the midterm, the professor basically lectured (read 'read straight from the slides, which were straight out of the book') directly to the computer, only raising her head to bury it in the textbook or to look at the blackboard. Not to say that she didn't respond to questions, but half the class could have disappeared and she wouldn't have noticed.\nOverall, the course seemed to be more about teaching things that could be easily tested, rather than understanding concepts in depth.\nThis is not a teacher who should be returning next semester. \nWorkload:\nNot too intense, but a lot of self teaching, as the lectures were largely inadequate.\n"
        },
        {
            "course_name": "Intro to Computer Science- Programming in C",
            "review_date": "March 05, 2007",
            "review_content": "\nMs. Arabshian is a very sweet teacher. She's very young, and she's very approachable. She will give you all the time in the world if you need help understanding something. She presents all her lessons well, using powerpoint presentations. Good speaker. I took the class with no programming experience as a freshman, and got an A. I did, however, go to her office hours every week, so she got to know me and I did get extra review. But I wouldn't do the assigned readings, and usually didn't pay good attention in class. Programming is fun, but sometimes frustrating when you don't see your mistake. She will extend deadlines if everyone is behind.\nWorkload:\nDoable. 6 hw assignments, all programming. 1 midterm, 1 final. Both fair. Extra credit assignments at the end are possible. Very fair grader.\nReadings aren't necessary. Attendance counts. 6 homework assignments, they get progressively harder and longer as you gain skills (in theory). Fun class if you like algorithms.\n"
        }
    ]
}