{
    "prof_info": [
        {
            "prof_name": "Michael Harris",
            "prof_id": 1314,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry I",
            "review_date": "January 19, 2004",
            "review_content": "\nMichael was a very nice person.  He was more than happy to help and even reminded us repeatedly about his office hours.  Even if you had the most basic question, he'd be glad to take an hour explaining it to you.  I think I learned more from him than from the lecture.  \nWorkload:\n8-9 quizzes, the best 5 will count, most quizzes are pretty easy.\n"
        },
        {
            "course_name": "Chem I",
            "review_date": "December 31, 2003",
            "review_content": "\nThat was a horrible review! Michael is a great TA! If he doesn't know something it's because it's first level chem and he's doing in-depth lab research already.  He was very accessable and always willing to answer questions.  If he was uncertain of something, he would take his time to find the answer for you before the next class.  If he's your TA, then you're in good hands.  His classes aren't difficult, but they're not a joke or waste of time either.\nWorkload:\none quiz every week (the material was usually reviewed within class); and review of hw question topics (hw not checked)\n"
        },
        {
            "course_name": "Chem 1405",
            "review_date": "February 03, 2003",
            "review_content": "\nVery helpful, was willing to chat after class and beyond his appointed office hour.  Extremely dedicated, was willing to get back to us if he wasn't sure on an answer.  Accessible via email, rather prompt (never longer than 24 hours).  Extremely smart, tried to make somewhat bland course material with extra trivia.  \nKind of cute in an unshaven genius way to boot.\nWorkload:\n7 quizzes, 5 counted.  No extra work above and beyond the Chem 1403 Lecture.\n"
        },
        {
            "course_name": "Chem 1405 Recitation",
            "review_date": "December 02, 2002",
            "review_content": "\nMichael Harris is a disaster of a man. Not once was he able to adequately answer my questions about the course material. Maybe deep inside his big balding head he knew chemsitry, but he could never express this knowledge in a helpful manner. I left every recitation more confused than when I entered, and stopped attending them after I had taken the five required quizzes.\nWorkload:\nSeven quizzes total, top five grades counted. No work outside of class\n"
        }
    ]
}