{
    "prof_info": [
        {
            "prof_name": "Olivia Powell",
            "prof_id": 8347,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 15, 2014",
            "review_content": "\nOlivia was probably my favorite teacher ever. I'm in SEAS and even I had a blast in her class. The way she taught makes you understand the piece more rather than memorizing definitions like some of my friends had to do in other classes. If you are a visual learner, this is the perfect class for you. We went through many different eras of art. I want to say that I remember more from that class than I do from any other class that I took at Columbia. And what's even better is that I had more fun in that Art Hum class than any other class ever.\nInteresting thing. So it is now a year and a half since having taking Art Hum with Olivia Powell. I went to the Caribbean on vacation and I met a cute girl who happened to be an art history major at one of our rival Ivy League schools. Well Finally!! I had the most beautiful conversation with this girl about art. She enjoyed sculpture, so I brought up what I had learned about Bernini. This was one of those high society type conversations that I would expect to be able to have after attending Columbia while conducting million dollar business deals. Well, let's just say the rest of the night with that girl in the Caribbean was superb. It wasn't me getting \"lucky\". It was skill and charm and knowledge picked up through Art Hum.\nI want to thank Olivia Powell for her AMAZING class. \nfyi, for any guys looking into art hum classes, Olivia is gorgeous!\nWorkload:\nno weekly assignments.\n3 visits to the Fricke and or Met.\n2 papers, midterm, final.\nall was graded easily.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 11, 2009",
            "review_content": "\nOlivia was one of the most encouraging and competent teachers I've ever had.  While there was the usual 2-3 students monopolizing the in-class conversation, Olivia tried to include everyone and encourage each person by pointing out many different ways of looking at the art and taking the time to listen to student suggestions; for example, she changed around her syllabus to make time for artists we found interesting, and scheduled optional trips to the MET with two meeting times to accommodate students.  \nI was nervous to take this course with very little prior knowledge of art, but she paid attention to the needs of her students.  Most notable, I think Olivia just wants her students to succeed, to understand and enjoy the material and not stress too much about grades, and if you utilize office hours for papers she'll really help you formulate ideas and edit before they're due. \nIf you're disillusioned with the Core as much as I was, take Art Hum with Olivia, she may convince you too that it can be worthwhile.\nWorkload:\n2 papers \nmidterm\nfinal - she changed the final from the dept norm. and it was one essay involving two works which we chose ourselves in advance. \n\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "October 11, 2009",
            "review_content": "\nThe Best EVERRR! very encouraging, thoughtful teacher, especially for people who have no prior experience with art analysis. as an engineer, i have gained so much more interest and appreciation for art and art history in general. i find myself wanting to go to the MET during any free time i have in order to learn more about art from various periods in history and parts of the world. i didn't do very well on my first paper but then i met with olivia and she worked with me until my second paper was worthy of an A. i really appreciated how much she cared to help me improve my analysis skills. fantastic! take her at any cost\nWorkload:\nreasonable. 40% participation. 20% first paper, 20% final paper, and 10% midterm 10% final which are both easy\n"
        }
    ]
}