{
    "prof_info": [
        {
            "prof_name": "Zhongqi Shi",
            "prof_id": 3051,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Chinese",
            "review_date": "December 26, 2008",
            "review_content": "\nShi Laoshi is the best. He is very enthusiastic, engaging, and intelligent. He co-authored the text book for Advanced Chinese (third year) and is one of the voices on the on-line recordings. He obviously knows what he is talking about, yet he never acts condescendingly toward his students; even to blatantly incorrect answers, Shi Laoshi responds with kindness, gently guiding the student to the correct answer. Please do not take his kindness for granted. Although he will accept late homework, it is nonetheless possible to push the envelope too far.\nShi Laoshi also compliments each chapter of the book with interesting clips that he plays from his laptop using a projector. These clips help re-enforce the material, and allow you to relax for the last 5 to 10 minutes of class. These range from satirical news clips to humorous excerpts from Chinese soaps. In this class, it is easy to both learn the material and love it at the same time. I highly recommend this class to anyone interested Advanced Chinese. \nWorkload:\nDaily character quizzes, daily exercises from the workbook, occasional essays that he assigns on Thursdays, and an exam every 2 to 3 weeks.\n"
        },
        {
            "course_name": "Advanced Chinese N",
            "review_date": "May 06, 2007",
            "review_content": "\nReally nice, energetic professor. Explains material especially the different word usages/similarities well. Wrote his own textbook, pretty intersesting topics (i.e. One-Child Policy in China, online dating, Starbucks in Forbidden Palace, young couples choosing between career vs. family, etc.) First (fall) semester pretty standard, getting you used to the material and his teaching methods, but second (spring)semester a lot of fun: after every chapter is a review class where you have partnered activities, competition games, a movie, online videos, etc. Overall a great class, a great professor.\nWorkload:\nPretty standard for 5 credit language class: almost daily quizzes, an essay every two weeks, 4 tests (per 2-3 chapters), oral midterm, oral final, final. Weekly discussion sections required.\n"
        },
        {
            "course_name": "Advanced Chinese N",
            "review_date": "February 20, 2007",
            "review_content": "\nHe's actually a really good teacher, but not an easy one. He makes class fun and always looks for new ways to engage the class in discussion. He tries to change his teaching style so that the students benefits more, such as having a day of review instead of moving through all the chapters day by day. I really enjoyed his class because it's challenging and you learn quite a lot at the end. If you don't like class participation, however, don't take his class. He calls on people at random to answer questions (but they're usually simple ones everybody can answer). All in all, good chinese class. Totally recommended!\nWorkload:\nAround 30 vocab words for every class. Daily dictations (except for review days), book exercises, copying text, weekly essay and rewrite, test every three weeks or so. Not an incredibly hard grader, but sometimes picky.\n"
        },
        {
            "course_name": "Advanced Chinese N",
            "review_date": "November 14, 2006",
            "review_content": "\nShi Laoshi is a fantastic instructor! He conducts class efficiently but will always stop to answer questions; he is also very knowledgeable. He is flexible, which some people might think is a fault in a language teacher, but which I found to be helpful, seeing as the class is not particularly easy. Finally, he is funny and sweet (and cute!), and just a very likeable guy. He brought energy to the class and kept things moving, so that he was almost able to make up for a class full of people not very interested in answering his questions. You will enjoy Shi Laoshi's class.\nWorkload:\n20-30 new words to learn for each class, dictation each class, essay and rewrite once a week, written excercises once a week, three tests a semester + final, short drill session once a week; manageable, especially for people used to Chinese classes\n"
        }
    ]
}