{
    "prof_info": [
        {
            "prof_name": "Alexander Rothe",
            "prof_id": 10065,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 17, 2017",
            "review_content": "\nLike most, I was fulfilling a requirement, and I did not expect how fun and educational the class would be because of Professor Rothe's excellent teaching. He consistently was very prepared and did a great job of discussing pieces as how they were representative (or not) of a broader historical time period. He would actively encourage us to return to the key concepts and descriptors we learned in the beginning and use them as tools to analyze the music, which I felt was helpful for reinforcing them. \nIt is clear how passionate he is about the subject when he discusses experiences like his visit to Notre-Dame or shares his favorite musicians and their work. He also had a fun sense of humor that made class more enjoyable. If you have a chance, Music Hum with Professor Rothe is a great experiences. \n\nWorkload:\nReadings, quizzes, concert papers, midterm, final, attendance- manageable, reasonable workload for Music Hum/Core standards. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 14, 2014",
            "review_content": "\nProfessor Rothe is great. I would completely recommend him. He's very knowledgeable and passionate (he often asks 'have you heard of xx's films/songs/art?' and it was kind of endearing how he would also look a little crestfallen if no one raised their hands but delighted when someone did). I didn't have a strong music background and my class was a mix. But he managed it well by being very patient and also using the knowledge of the experienced musicians. The class was also not very discussion-based, which was fine by me because he had plenty of insights. \nI loved the historical focus of the class. Take his class!!\nWorkload:\nManageable, if you study. MCQs are tricky. Quizzes, midterm, final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 18, 2013",
            "review_content": "\nRothe isn't as awkward as everyone else says; he's actually wicked funny.\nAlso, he's a terrific teacher and I totally recommend you take the class with him. Why? Because you won't have to memorize what 60 very similar-sounding pieces sound like and he's super chill. I've been talking to my other friends who had music hum, and they said they had to do that memorization, and as someone even classically trained in music it seemed a bit ridiculous. Rothe isn't like that. He repeats that he isn't trying to make it unnecessarily hard on you, so our 3 quizzes over the semester are exactly what he tells you they will be like--very historically based, identification between like 6 pieces (which are very different, because some are operas with and without video and like costumes guys come on, some are symphonies, some are clearly only with one instrument, etc.). 6 different works for the midterm, guys.\nAll in all, take the class with Rothe. If you look over the material, it's an easy A. Actually do the readings, it's an easy A. It's more historical-based than other music hum sections, as Rothe doesn't see music in a vacuum. He also is into operatic stagings and talks a lot about that, if you're into that.\nHE'S THE BEST.\nWorkload:\nshort readings for every class. 3 quizzes worth 30% total, two papers worth 15% total, final, midterm, attendance\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "September 29, 2010",
            "review_content": "\nSo far Rothe has done a fairly reasonable job.\nHe's not nearly as shy or awkard as some may say. \nHe's only learning how to be a professor!!!\nHe knows how to teach music, and he knows a lot about German and Latin music, as well as Jazz and Rock music.\nYou may think the class only covers Classical Music, but it also covers World Music as well as Progressive music.\nGive him some time and he'll be excellent.\nHe'll be an amazing first year or second year teacher for CU student.\nI mean we are at Columbia University right???\nWorkload:\nNot Much. 2 Exams, Quizzes, and 2 Papers\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 13, 2010",
            "review_content": "\nYou are very lucky if you end up getting Alexander Rothe for this class. Sure he was a bit awkward and nervous at first (which he admits) but he relaxed as the semester progressed. I thought about changing sections after two classes as he seemed to favor those students that had a musical background and quickly dived in the concept of notations, which can feel like a new language for non-music students. But I was wrong and I am happy I didnt change. I truly enjoyed this class although there is a lot of memorization. He gives good advise on the assignments, he is a generous grader and will understand if you need to hand in assignments passed the due dates.   \nWorkload:\nMidterm and non-cumulative final. (The midterm is harder than the final). 2 essay assignments (3-4 pages each), 2 concert reports (ca 3 pages). \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 13, 2010",
            "review_content": "\nI liked Alex as a person, but I struggled to enjoy his class. He's a very awkward and painfully shy teacher who would go 5 minutes or longer while talking without looking at students. At the beginning of the semester I was annoyed, but by the end felt bad for him, as he seemed very uncomfortable in a teaching role. Fortunately it was an easy class and once the semester was over I largely forgot the negative aspects. If you get him, keep your expectations low.\nOh, nearly forgot: if you don't have any formal musical training, you'll likely feel completely lost at times. Don't try to ask him for help, as it'll be like asking him to teach you Mandarin using Swahili. Find someone in the department. \nWorkload:\nVery short daily readings, 2 concert reports, 2 papers, easy midterm and final if you review the songs/terms early and often. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 12, 2010",
            "review_content": "\nWorst class I've ever had...by far. Music Hum has its potential but Alexander Rothe made sure to teach the most boring class ever. He is really sweet and understanding, even when it comes to deadlines. Once, we had another Music Hum professor guest teach, and although it was a 9AM class and I had only slept for three hours, it was the most awake I'd ever been. With Alex, I could have a full night's sleep and class would still be a massive snooze-fest. I thought I'd love Music Hum because I've been a classically trained musician for over 10 years. Turns out, it was just a giant disappointment \nWorkload:\nMinimal, daily readings and 2-3 papers with a midterm and final \n"
        }
    ]
}