{
    "prof_info": [
        {
            "prof_name": "Jordan Bear",
            "prof_id": 8135,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 18, 2010",
            "review_content": "\nGreat class.  Before the final, he told us that for the test  \"90% of success is showing up.\"  I'd say that also applies to Jordan Bear's Art Hum class.  His slides and lectures are clear and well prepared and though he tries to foster class participation, he isn't crippled when he gets no response.  He also acknowledges that Art Hum covers a ridiculously large period of time and tries to give context to the larger art community surrounding the specific artist on the syllabus for the day.  The readings are interesting but not totally necessary - there is text analysis on his midterm and final but from showing up to class generally you can figure out the artist being written about and go from there.  All in all I learned a lot with little stress. \nWorkload:\n3 museum visits, 2 essays (3-5 pages), midterm, final (1 hour), weekly readings (10-25 pages)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 12, 2010",
            "review_content": "\nJordan Bear is solid - at least silver nugget material.  His lectures are extremely clear, and he encourages discussion without needing to use it as a crutch.   I would recommend attending as many lectures as possible because not only is he very engaging, but his presentations provide you with a great foundation for the course (even if you skimp on the reading).  More importantly, even if you have no art history knowledge, you will come out of Art Hum with a greater ability to assess/judge art (without a great deal of effort).  You literally just need to sit back, relax and let Bear take care of business.  It was the most painless class I've had at Columbia, and he is a very fair grader.\nIt's also a great class to end your week on.  \nWorkload:\nTwo papers, 3-5 pages (requires museum visits).  Light, but mostly good reading.  Midterm and a final (both very straightforward).  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 04, 2010",
            "review_content": "\nFirst off, Art Hum is Art Hum. A quiet, warm room with the lights off will make you fall asleep regardless of the professor. What matters is what happens when you are awake.\nProfessor Bear does a pretty decent job of that. At first he seemed a little bit smug, but then it became clear it was a combination of frustration and amusement at the absurdity of teaching Bernini and the like in one day. Once he starts making jokes and laughing at yours, you begin to like the guy. And that's before you see the grading. Professor Bear takes the class nice and easy - his quiet and somewhat sardonic tone emphasizing it (though perhaps not helping on the dozing off front) - and drops heavy hints of what will be on the exam.\nReading is usually a 10-20 page article each week that could read while taking care of something else.\nThere are two 3-5 page papers which require a visit to a museum exhibit and on which he is a generous grader. The midterm and the final are the length of a typical class, and consist of IDs (for which he gave a Powerpoint of the possible works for us to study from), a couple of short compare-contrast essays on works, and a couple of short essays on passages from the reading. Both are easy as pie.\nSince the registrar doesn't reveal instructors after registration, this review won't be too helpful in selecting your mystery section. However, if you do find out that you got Professor Bear, don't worry, you didn't pull a short straw.\nWorkload:\nTwo 3-5 page papers on exhibits. Midterm and Final consisting of IDs (study guide provided by Professor), short essays on works and reading passages. All graded easily. Weekly reading takes less than half an hour.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 02, 2010",
            "review_content": "\nProfessor Bear is great!! He's very friendly, and doesn't punish students for not being art experts. He is very easy-going, and allows a lot of discussion. The only problem with that is that sometimes class would be dominated by obnoxious students. He assigns short readings every week, you can push these off until the midterm and final but there are text excerpts on the tests so you have to look over them at some point. There are two short papers, 3-5 pages each. On the first one he gives you a choice between 5 paintings and on the second you have to review an exhibition of your choice. Before the midterm and final, he posts a review slideshow for studying. This makes it very easy to get a perfect score on the slide id portion of the exam. He's a very fair grader, and is one of the few faculty members I have encountered that actually provide useful feedback on papers. I highly recommend taking a class with Prof. Bear. \nWorkload:\n2 short papers (3-5 pgs.) He gives you choices about what you can write about. Midterm and final and short readings each week. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 02, 2010",
            "review_content": "\nArt Humanities was solid with Jordan Bear. His lectures were very clear, precise, and he never went too far off topic. He also enunciates when speaking and doesn't talk to fast so it is easy to jot down everything. He uses terms that are graspable so that anyone could understand his lectures. But there wasn't anything too amazing about the lectures and I found myself sometimes having my head wandering (and with the lights dimmed, it sometimes is tempting to close your eyes for a bit). \nBut even without my mind 100% present at the time, almost all of the information he presented seemed to stick, so I guess he extremely effective in the way he taught the course!\nAssignments were straightforward: two papers and a minimal amount of reading. He does do a passage ID where you have to note the author and the context on the final. My main concern over the course was that what we were tested on in the midterm and final had little to do about what he talked about in lecture rather it was on the readings and slide identification.\nI would recommend Jordan Bear's section of Art Hum. He made the material very approachable and accessible. Overall, a very solid course. \n\nWorkload:\nMidterm, final, two essays, small amount of reading.\n"
        }
    ]
}