{
    "prof_info": [
        {
            "prof_name": "Leanne Dodge",
            "prof_id": 11806,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 18, 2013",
            "review_content": "\nLeanne is a very kind, nice teacher, who assigns a ton of homework and grades harshly. The class content isn't bad. We go over various periods of European and American music from chants in the 1400s to Minimalism and Jazz in the 20th century. Most of the class is spent on classical music and opera though. The class can get boring at times and a few people do sleep in class (which probably kills the easy 20% you could get from participation).\nShe assigns listening and reading every class. I didn't actually listen to any of the music till before the exams, but you should if you want to do well. The midterm was kind of hard since a lot of the chants and classical music are hard hard to distinguish. The final was easier because we covered more varied \"modern\" music.\nI suggest you take this class only if you have to. This is an average MusicHum class from what I hear. There are better teachers who makes the class an easy A. There are awful teachers who make students attend 6 concerts. I suggest not rushing MusicHum and waiting till you get a section with an easier professor.\nWorkload:\nlistening and reading every class\nlistening based midterm and in class final (15 and 10% respectively)\nlistening based take home final (10%)\n2 critical response essays - 1 for a concert and the other for the opera La Traviata (20% each)\npresentation (5%)\nparticipation (20%)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 17, 2012",
            "review_content": "\nIf there's any way to describe this class, it would be...awkward, but I'll get to that later. The class is pretty cut and dry, straight off the syllabus. There's a little bit of all the musical genres/periods, and we were usually a class behind schedule. Most of the class focuses on listening, so we mainly analyzed music in class. Which means that most information content would be from the book, though I doubt many people actually did the readings since they turned out to be unnecessary. Work wasn't stressful, but there seemed to be A TON of assignments before every class on Courseworks. Most people probably didn't do them, and it was fine. I would assume most people did fine, but you might have to put a little work into it simply because of the amount of material we covered. I've seen syllabi from a couple Music Hum sections, and this one definitely seemed to have the most (albeit easy) work. \nDespite this, this class was flat out awkward. Leanne is a very nice person who is responsive and always willing to help, but a lot of times, she would make jokes that the class would laugh at just to be polite and humor her. Having the class at 9 AM probably made it worse. There's nothing in particular that's wrong with the class, but it certainly will get boring at times and you won't leave feeling inspired about music. It's good exposure to a wide array of musical styles that's good to know, but more likely than not, it be a memorable or fond experience. \nWorkload:\nOne short presentation, one musical analysis paper (5 pg), one analysis of an opera (La Traviata, which was amazing even for the non-opera lovers) we went to as a class, and 1 short quiz the second or third day of class. Papers were pretty easy; she grades hard on your style and grammar, perhaps more-so than content, which surprised some people. Listening-heavy midterm, and a short listening final with a take-home essay. Might be difficult if you don't have any experience with music.\n"
        }
    ]
}