{
    "prof_info": [
        {
            "prof_name": "Nehama Bersohn",
            "prof_id": 129,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Hebrew for Heritage Speakers I",
            "review_date": "December 11, 2013",
            "review_content": "\nProfessor Bersohn is a FANTASTIC professor. After 12 years of Hebrew classes, I have learned more in one semester than I did throughout high school. Maybe even throughout K-12.\nShe is deeply passionate about Israel, Judaism, and the subject matter. She cares a lot about her students and is willing to do anything to help them.\nShe has an edge, which I really enjoy. She keeps class interesting and she keeps students on their toes. \nPrepare yourself to actually learn stuff in this Hebrew class -maybe for the first time in your life... that's how it has felt for me.\nI feel really lucky to be able to have her again next semester. \nPerk: you get class off for Jewish holidays.\nWorkload:\n15-30 minutes per night, and maybe an extra hour or two before a test. Nightly homework and probably 4-5 tests per semester. One final.\nBe prepared that the final is during reading week!! \n"
        },
        {
            "course_name": "Intermediate Modern Hebrew II",
            "review_date": "May 01, 2012",
            "review_content": "\nNechama, above the other hebrew teachers here, is a professor. While the other classes here have a hebrew-school vibe, Nechama tones it down tremendously and is incredibly on top of her shit. She is brilliant and you will definitely learn and be challenged in this class. \nHOWEVER, that did not prevent this class from turning somewhat into a class on Judaism, no matter how she tried otherwise. The first few days of class my understanding was that that we would be studying Israeli literature and culture, and I was excited about this. I understood that there is an element of tradition to Israeli culture, but that it is also much much more than that. Nechama did many times try to maintain balance the tradition with the modern, but eventually catered solely to the religious crowd. ALL of her examples for new words came from the Bible, and many (if not most) of her sentences began with \"For those of you who went to day school...\". \nIf you did go to day school, you will feel very comfortable in this class. If you did not, then less so. I personally did not come to this class to study Judaism, I came to learn Hebrew. I know these are by no means mutually exclusive, but they are also not identical. Nechama repeatedly emphasized how important it is to understand the Jewish tradition in order to understand Israeli literature (once in a while she even sounded apologetic about it, which I appreciated- Michal would blatantly refer the the Bible at every moment, no apologies.) I understand all of this but this did not make it easier to digest all of the torah and gemara and midrash and references to god thrown my way. Nechama is incredibly well versed- I feel like it would not have been a stretch for her to give examples from literature rather than biblical texts. This course became extremely frustrating for me- this is possibly as much the class's fault as it is hers, but this post is just to raise awareness about the extreme(ly) orthodox tone of this class. \nWorkload:\nDaily assignments, some longer than others. Stories, poems, occasional short essays, five quizzes total. She only grades the quizzes but gives back comments on all the assignments and assumes you're putting in your best. \n"
        },
        {
            "course_name": "Intermediate Modern Hebrew I",
            "review_date": "December 15, 2010",
            "review_content": "\nI love Gveret Bersohn!\nI've learned so much in just one semester. I'm actually able to have small conversations, compared to last year when I was too scared to even speak in class.\nTo like this class and do well you have to pay attention and do the work, which shouldn't be a problem for anyone who wants to learn a language well. \nShe is a stickler about being late, so just accept it and get to class on time. She's right, it is disrespectful to walk into class late. That said she won't hate you for the rest of your life if by chance you don't wake up in time.\n\nWorkload:\nMinimum: 15 minutes a night. A couple quizzes/tests each semester. \nIf you want to learn everything very solidly, I would put in more time.\nVery reasonable! \n"
        },
        {
            "course_name": "Upper Intermediate Hebrew II",
            "review_date": "November 11, 2009",
            "review_content": "\nI have to agree with many of the other reviews.  Nehama Bersohn is the best Hebrew teacher I've ever had, and after many years at Jewish day schools/Hebrew school/private tutoring, that is saying something.  That said, you must take this class seriously to actually learn.  It will be tempting to come in late, as the class meets every day, and not to do the frequent homework, and many of my classmates do that.  You will be penalized, but you will also be disrespecting a truly wonderful teacher who just wants to help you learn.\nShe also takes a personal interest in each student and is always willing to offer extra help or support, which is really nice.  She definitely has grumpy days, but she sees the same students every day, so that seems inevitable.  I would definitely recommend this class if you actually want to learn Hebrew. If you really, really want an easy language class, take Yiddish. I hear it's fun. \nWorkload:\nReasonable. About 15-30 minutes per night. If you do all the work and study as she assigns it, you won't have to study too hard for tests. \n"
        },
        {
            "course_name": "Intermediate Modern Hebrew I",
            "review_date": "March 06, 2008",
            "review_content": "\nI've learned an enormous amount, and the semester is just halfway through.  As another reviewer mentioned, Nehama has a vast repository of historical and biblical quotes at her command, as well as expressions and cute little colloquialisms.  She's high-energy and always seems to be in a good mood.  Language instruction has never been so much fun.  A note to daydreamers: She cares about getting verbal responses (and rapt attention) from every single student -- so prepare to wake up and pay attention at 9 a.m.!\nWorkload:\nI found it pretty light and straightforward.  There's about 15 minutes of homework every night.  Tests were pretty much a transcription of things we'd learned in class.  No surprises--just study what you learned and take notes in class.  Most of the learning goes on *in class*.\n"
        },
        {
            "course_name": "Intermediate Hebrew: Intensive Grammer review_content",
            "review_date": "December 13, 2006",
            "review_content": "\nNehama Bersohn is probably one of the best Hebrew teachers I have ever had (and this is coming out of 12 years of Hebrew day school). She encourages everyone's participation and, because she keeps her classes small, she doesn't hesitate to spend as much as necessary to explain things that aren't completely understood all around. She's a genuinely nice woman and she is ABSOLUTELY brilliant - the woman can quote tanach (Hebrew bible) off the top of her head and she actually genuinely knows the reasons for all the tedious grammar rules she was teaching.\nI wish she taught some advanced Hebrew classes so I could continue to take classes with her!\nWorkload:\nVery reasonable - a few grammar exercises, usually a page or two in the book per class (that take ten minutes to do, tops), a bunch of quizzes and a final. If you do the work and study for the quizzes and final, you'll get an A.\n"
        },
        {
            "course_name": "Intermediate Hebrew: Intensive Grammer review_content",
            "review_date": "August 10, 2006",
            "review_content": "\nMost of my hebrew teachers prior to college were downright bad.  I was not looking forward to more hebrew, but Prof. Bersohn was awesome.  She even managed to make grammar not so boring.  She knows the Bible so well that she can relate what you are learning to something you recognize from prayers or just a famous pasuk (verse from bible) or phrase.  She is also one of the nicest teachers you will ever encounter.  Yes, its true, she makes fun of you if you are late.  I was definately her favorite to pick on.  But its all out of love.  She really cares about her students and tries to help them out in any and every way.  If you have the choice, without a doubt, take Prof. Bersohn.  \nWorkload:\nA small (5 minute maybe) assignment each night which you can do during class (you can pretty much figure out what the next days work will be - just the next few pages in the book), a few quizzes (not bad at all), a midterm, and a final (both quite doable).  In the end, not placing out of hebrew gave me enjoyable classes for 2 semesters.  \n"
        },
        {
            "course_name": "Intermediate Modern Hebrew I",
            "review_date": "August 27, 2003",
            "review_content": "\nThis woman is a diva.  She has that abrupt tough-guy front, but I think she's actually a sweety on the inside.  She likes to be very bitchy and makes fun of you if you're late or absent, but she's pretty harmless - it's her dry sense of humor and wit.  Anyway, I think she's an excellent teacher, and definitely a brilliant woman.  I really learned a lot without too much effort as far as hw and studying were concerned.  If you want to learn Hebrew, take this class!  She's also a nice grader!\nWorkload:\nFair - reading assignment everynight.  You translate it in class the next day (she expects you to have understood it, so you do have to read it, but you don't necessarily have to write it down).  Weekly grammar quizzes the first semester, much less second semester.  They're straight forward - if you pay attention and study what she says is going to be on the quiz, you'll ace it.\n"
        },
        {
            "course_name": "Intermediate Modern Hebrew I",
            "review_date": "May 03, 2003",
            "review_content": "\nBersohn is a great professor.  Although the class meets 9am Monday-Friday (forget about going out Thursday night!), she does a great job in making sure that everyone understands the material.  Bersohn emphasizes speaking, and  the bulk of the written material is straight out of the (semi-outdated) text.  She often refers to outside stories when reading text passages, which proves to be very helpful in students understanding listening & language comprehension.  Because the class is small, everyone participates.  Quizzes are frequent, which is a definite stress reliever.  Very good class overall.\nWorkload:\nBoth semesters: nightly homework (appx 10-30 min depending on how much she assigns), regular quizzes... attendance mandatory.  In Hebrew II there is a final.\n"
        },
        {
            "course_name": "Intermediate Modern Hebrew I",
            "review_date": "March 08, 2003",
            "review_content": "\nExcellent, dedicated professor.  Bersohn kept the students on their toes at all times, as she would continually call on us to answer questions on vocabulary or grammar, ensuring each student was \"picked-on\" in equal weight.\nWhile some of the students found Professor Bersohn to be cold, this was largely a result of her hard nosed approach to learning.  She could often tell when a student was not putting in the effort, and when she did, she cut them no slack.  However, if she knew you were making the effort, even if languages were not your forte, you could still be successful in the class. \nAs a language teacher, she is excellent, clear, and willing to repeat herself until all in the class comprehend.  While she might be intimidating to some students, she entertains all quesions, with little or no grief.  \nWorkload:\nThe workload was fair, and required a student to spend at least one hour per day outside class completing the daily homeworks.  \nFrequent quizes ensured that we learned the material, and enabled us to better prepare for the periodic long exams.\n"
        },
        {
            "course_name": "Intermediate Modern Hebrew I",
            "review_date": "December 11, 2002",
            "review_content": "\nI joined this class to fill my language requirement, and having bad experiences in high school foreign language, I wasn't exactly looking forward to to the 9am Monday-Friday class. Nevertheless, Bersohn makes this class worth taking. She conducts most of the class in Hebrew, and because of the small class size, we all participated a lot. As a result, everyone in the class improved on their speaking. There is nightly homework that is collected very infrequently... maybe 20 minutes worth a night, and she goes over it in class. There is a test or two a week, but as long as you did all the homework, you can ace each one with very little studying. A good portion of the course is on learning the different grammatical forms, and though it can be tedious, she helps us comprehend them by putting up Talmudic proverbs. All around good course. \nWorkload:\nA test or two a week covering workbook material, vocabulary, and grammar. Nightly homework (20 min or so)... not too difficult. Relatively easy grader on tests.\n"
        },
        {
            "course_name": "Intermediate Modern Hebrew I",
            "review_date": "December 11, 2002",
            "review_content": "\nI joined this class to fill my language requirement, and having bad experiences in high school foreign language, I wasn't exactly looking forward to to the 9am Monday-Friday class. Nevertheless, Bersohn makes this class worth taking. She conducts most of the class in Hebrew, and because of the small class size, we all participated a lot. As a result, everyone in the class improved on their speaking. There is nightly homework that is collected very infrequently... maybe 20 minutes worth a night, and she goes over it in class. There is a test or two a week, but as long as you did all the homework, you can ace each one with very little studying. A good portion of the course is on learning the different grammatical forms, and though it can be tedious, she helps us comprehend them by putting up Talmudic proverbs. All around good course. \nWorkload:\nA test or two a week covering workbook material, vocabulary, and grammar. Nightly homework (20 min or so)... not too difficult. Relatively easy grader on tests.\n"
        },
        {
            "course_name": "Intermediate Modern Hebrew I",
            "review_date": "December 31, 1999",
            "review_content": "\nI couldn't disagree more with that review! I found her to be downright nasty sometimes. She almost made me cry once. She was nice at the beginning of the year but she's a [insert one of your favorite nouns here] if ever I've met one.\nWorkload:\nAnnoying quizzes and HW dittos. Tests. Final.\n"
        }
    ]
}