{
    "prof_info": [
        {
            "prof_name": "David Helfand",
            "prof_id": 354,
            "total_reviews": 36
        }
    ],
    "reviews": [
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "November 14, 2016",
            "review_content": "\nEarth, Moon, and Planets - meets 2x a week\nHelfand is a great professor, lecturer, and person. I learned a lot in his class, found lecture pretty entertaining (he has some great demonstrations), and the work load was not bad at all. The problem sets can be tricky but you can work in groups and if you go to OF he explains everything. Quizzes were all open note and not bad at all and you were allowed a cheat sheet for the midterm. You don't have to do the assigned textbook reading (even though its super manageable), all you have to do is listen during lecture.\nOverall 10/10, loved the class, loved the professor - he actually cares about his students and puts a lot of effort into his lesson plans, making sure he explains everything in a very clear, detailed manner. He was always able to answer any questions I had and in general is an interesting dude.\nTAKE THIS CLASS :D\nWorkload:\n1) Go to class - I missed 2 and was fine but its always worth it to go\n2) Problem Sets took about 3 hours max and there were 5 in total.\n3) Midterm and Final - didn't have to study much, mostly based on equations and he gives you equation sheet\n4) Simulations - all in class except 1, takes about 20 min --> no extra work\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "October 21, 2010",
            "review_content": "\nIf you get this guy, thank your lucky stars. He will make that unnecessarily long two-hour discussion section a little more bearable.\nAbout Frontiers of Science in general, chances are you won't like it. If you like science, the necessarily short amount of time spent and shallow engagement with each subject will likely frustrate you. If you don't like science, you won't like this class because it involves science and a little bit of math and you didn't come here for that.\nLectures are recorded and Powerpoints posted online, so there's no real compelling reason to go to lecture. Many don't go, but I did so half out of interest and half out of a weird sense of duty. In any case you'll need to budget an hour and a half sometime during the week to go/listen to the lecture and 30-90 mins a week to do your WIA (short problem sets, pretty easy).\nWhich brings us back to the once-weekly discussion. It's too long, but its length gives each section time to do some pretty cool experiments and demos. Helfand himself is a force. He came up with this course and he really believes in it and its methods for better or worse. He was a little more informed in the Astronomy stuff because that's his area, but he was dynamic no matter what we were discussing. Plus he's just legitimately an interesting and cool guy.\nIn conclusion, Helfand is good. Frontiers isn't, but it's not too bad. Much better than UWriting (shudder) in terms of the interesting material to amount of work ratio.\nWorkload:\nNot much at all. WIA's took an hour and a half a week at most, usually much less. They can and should be done with friends. Don't really have to go to lecture, just listen to it at some point. Quizzes at the end of each unit aren't hard. Midterm and Final composed of short answer questions. Some are difficult but think about it and you'll be okay. I got an A without breaking a sweat, but I'm a science-person. Less science inclined people had a little more trouble.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "August 05, 2009",
            "review_content": "\nAbout the class in general:\nFrontiers of Science, in general, is an ill-conceived, poorly-executed class. Science people are frustrated at the inane pseudo-science projects (create a made-up planet? really?) and non-science people stumble over the math and barely-explained equations. The worst of both worlds. The class attempts to combine scientific \"current events\" along with teaching a handful of random \"scientific\" skills and thinking processes, and ends up coming out a mess of disparate topics. The best decision I ever made was to never attend lecture. The two-hour recitation made me want to slit my wrists over and over, and god save you if you get stuck with an idiot group for a project. But, you need to take this class, so sorry freshman.\nAbout him as a section leader: \nHe writes the exams. With that in mind, it is rather useful having him as a section leader, since he 1] knows exactly what is on them (and gives useful tips) and 2] is invested in you doing well. He is knowledgeable and passionate, although the general horror of the class tainted my love for him as a section leader. But anyway, he is decent and will perhaps make the experience mildly less painful than other section leaders.\nWorkload:\ndepends, the class is constantly changing.\n"
        },
        {
            "course_name": "Beyond the Solar System",
            "review_date": "May 19, 2006",
            "review_content": "\nThere are few at Columbia let alone any university that are as passionate as David Helfand. I took this class for him, not knowing it was one of the hardest science requirements. I went from failing the course to doing very well in the end - this I attribute entirely to him and his drive to teach me, a humanities student how to think like a scientist. If you care about learning, this man is a godsend. If you want to get out of Columbia without doing a thing, perhaps you should look another direction. \nIt is rare to have a professor who will devote so much to a student - I advise taking advantage of this wealth of a professor.\nWorkload:\nNot so bad, though this depends on your math skill levels. \nIn the end the work is worth it.\n"
        },
        {
            "course_name": "Beyond the Solar System",
            "review_date": "April 04, 2006",
            "review_content": "\nThis class is not an easy A...or an A at all, at least for those of us non-math people.  However, if you're willing to forgo that grade, I would definately recommend it.  Helfand's lectures are both theatrical and informative, and the workload is not at all difficult.  Quizes are open note, and you can take one sheet of notebook paper with whatever you like written on it to the midterm and final.  This is because Helfand encourages students to digest the material and think about it, rather than memorizing.  He himself is incredibly well informed on astronomy and pretty much everything else.\nWorkload:\nOne problem set and open note quiz every other week, midterm, final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 17, 2005",
            "review_content": "\nWow. Professor Helfand is the best section leader ever. He makes things interesting, answers the discussion questions well because he does research beforehand, and makes you feel like you're the only class he teaches when really, he's probably got more important things going on. A great man, and a great professor. Count your lucky stars if you get this guy as a discussion leader. \n"
        },
        {
            "course_name": "Beyond the Solar System",
            "review_date": "September 04, 2005",
            "review_content": "\nHelfand is a terrific professor, and this class is an ideal way to satisfy part of the science requirement for people who are interested in science but aren't considering any kind of science major.\nHelfand is an absorbing lecturer, funny and informative. The class is not geared toward science-majors, but it doesn't feel dumbed-down. There is a special focus on using the subject matter to illustrate the fundamental principles of scientific inquiry (much like Frontiers is supposed to do, but better).\nHelfand really has a gift for making the material understandable, and each of his lectures of is full of \"man...science is cool\" moments.\nHelfand admits that his class isn't the easiest way to satisfy the science requirement (it's not), but the effort is worth it. This is the deal: go to lecture, take a lot of notes. There is a lot of information, and Helfand will make it clear what is most important. Don't bother with the reading in the textbook. If you have trouble with the problem sets (they can be tricky), go to office hours, and Helfand will walk you through almost everything.\nWorkload:\n5 problem sets, 5 quizzes, midterm, final. He drops your lowest quiz grade and lowest problem set grade.\n"
        },
        {
            "course_name": "Beyond the Solar System",
            "review_date": "June 18, 2005",
            "review_content": "\nThe reviewer below must have been in a different class than the rest of us.  Firstly, attendance was almost always healthy.  If you've seen Prof. Helfand lecture, that should be profoundly unsurprising.  He speaks clearly and engagingly and stops frequently to solicit questions from the class.  Ask questions!  He likes it, and it helps in understanding the subject matter.\nThe class isn't particularly difficult, especially if you have a good science background (nothing too big -- AP sciences in high school are sufficient).  That said, some of the units can be a bit abstract or counterintuitive at first.  If you're uncomfortable with things like unit conversions and scientific notation, this is not the class for you.  Nor should you take this class as a way to breeze through the Science Requirement.  For those who are interested in astronomy and don't mind some basic numbers-work but are worried about odd concepts, this is where Prof. Helfand's openness comes in handy.  You can ask questions in class, at regular review sessions, at office hours, at an appointment that you set up, or via e-mail, to which Prof. Helfand usually responds within 12 hours or so, even the night before a problem set is due.\nIf you go to the vast majority of classes and don't let your questions go unanswered, an A should be within reach.  On top of that, the class is a lot of fun and Prof. Helfand helps greatly in making an innately interesting subject fascinating.\nWorkload:\nFive problem sets and five quizzes, with your lowest score on each dropped.  There's also a midterm and a final.  The class average on all four components is curved to 80.\n"
        },
        {
            "course_name": "Beyond the Solar System",
            "review_date": "May 23, 2005",
            "review_content": "\nI took this class wanting a challenge that was doable.  Yet if you are not a math person, do not take this class.  Notice that I say \"math person\", not \"science person\".  That is because this class requires almost no scientific thinking, contrary to Helfand's claims at the beginning of the semester.  Rather, the thinking required for the class consists almost solely of petty, mathematical computations on the problem sets and exams.  Previous reviewers have raved about Helfand's amazing lectures and speaking style (\"he was a theater major!\" exlaims one.)  Yet this is Helfand's only plus, which is sad because he has nothing to say.  Also, Helfand lamented dramatically during lectures that he was \"losing touch with the students for the first time in 27 years\" or some bullshit like that.  Indeed, Helfand speaks truth: almost no one attended lectures and everyone attended his review sessions that were held the night the problem sets were due.  Is this really the way to learn or to run a class?  Do not take this class if you actually want to learn something astronomy.  Fritz Paerels is a much better...\nWorkload:\nIllogically worded problem sets that had nothing to do with the material covered in class, a midterm and final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 11, 2005",
            "review_content": "\nHelfand is an erudite who dominates the class, but beware, this is NOT a course where you will learn the names of constellations or even look through a telescope.  Helfand has a passion for his work and it shows.  He goes the extra yard to make himself available.  \nThe concepts are difficult for most.  I saw many 50% on the Midterm, quizes and Problem Sets.  \nWorkload:\nProblem Sets, Quizes, Midterm (timed), Final.  You WILL need to attend EVERY class.  He DOES give extra credit opportunities.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 11, 2005",
            "review_content": "\nHelfand is an erudite who dominates the class, but beware, this is NOT a course where you will learn the names of constellations or even look through a telescope.  Helfand has a passion for his work and it shows.  He goes the extra yard to make himself available.  \nThe concepts are difficult for most.  I saw many 50% on the Midterm, quizes and Problem Sets.  \nWorkload:\nProblem Sets, Quizes, Midterm (timed), Final.  You WILL need to attend EVERY class.  He DOES give extra credit opportunities.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 28, 2004",
            "review_content": "\nIf you are looking for an incredible experience, take HIS section.  Because of Professor Helfand, I actually enjoyed science.  He is engaging and somewhat comical, and he truly loves to teach!  \nWorkload:\nWeekly problem sets that are not incredibly difficult (and not graded), four problem sets that cover each of the \"frontiers\" which are challenging (he will help you!!!), no midterm and a hard final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 23, 2004",
            "review_content": "\nHe encouraged lots of questions and for people to go to his office hours. He seemed to care quite a lot about students; at the beginning of the semester he invited each of us to his office for a get-to-know-you discussion, and he always responded to emails promptly. Try to make it to class on time though. I had a habit of going to each one at least 5-10 minutes late, and it looked like it pissed him off (understandably so). There's some arrogance when you talk to him, but it's not too big a deal. All in all, a good seminar leader\nWorkload:\nweekly discussion questions (collects but doesn't grade)\na problem set every 3 weeks (can work in groups of up to 3 people within your seminar section-- not too challenging)\nFinal exam\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 17, 2004",
            "review_content": "\nHelfand was a funny, informative, and engaging lecturer. He performed science experiments on stage, doing things like pouring liquid nitrogen on stuff and making his hair stand on end with static electricity. He's definitely got personality, and his lectures were clear, easy to understand, and very interesting. Overall, he's a great guy -- take any class he offers.\nWorkload:\nstandard frontiers workload 4 problem sets, no midterm, dept final. I didn't have him as a seminar leader, so I don't know what he assigned for the weekly hw\n"
        },
        {
            "course_name": "First Year Seminar",
            "review_date": "November 11, 2004",
            "review_content": "\nThis guy is AWESOME. He conceived of the whole Frontiers of Science idea in the first place, and I was blessed to have him as my seminar leader. He genuinely cares about his class, encourages thinking and is one of those science guys who can explain his thoughts in English, not metaphysical psychobabble. It's been my favourite class this semester, and I definitely recommend taking any of his other classes if not Frontiers...just for the way he teaches, if nothing else\n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "October 21, 2004",
            "review_content": "\nPeople complain way too much about this class.  Admitedly, first semester was pretty boring.  But the second semester was absolutely fascinating...I never wanted to miss a class.  His take on the history of the earth's climate, as well as the history of the universe, made the class worthwhile.  \nThe problem sets are also challenging, but not overly so.  If you work with a couple people and come to office hours, each can be done in less than 2 hours.\nWorkload:\nSeveral problem sets, midterm, and final.  Nothing to lose sleep about.\n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "May 16, 2004",
            "review_content": "\nProf. Helfand is amazing. I never thought I would make it through the science requirement alive, but after a full year of Helfand I am glad to say that science-phobic students have a great option. That being said, this is NOT a class you can totally blow off. It will get hard and frustrating if you do that since there is no textbook to fall back on. But if you go to the lectures, do the problem-sets and go to Helfand during office hours - he is probably the most accessible and friendliest professor I've met at Columbia - by the time the final rolls around you'll be in good shape. one of the few science classes at Columbia where the prof. will bet with his students, perform soliloquy's from Hamlet or run into a wall at full speed, all in the interest of teaching.\nWorkload:\nnot too bad at all. midterm and final questions are very similar to problem sets and quizzes so just make sure you can do those problems and you'll do fine.\n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "May 08, 2004",
            "review_content": "\nI think whether or not you like this course is dependent on what your expectations are coming into it.  If you're a non-science major who wants as little to do with science as possible (like me), you'll hate it, everything about it.  If, on the other hand, you take an open mind to the class and expect that there's going to be some interesting (some would say off-topic and inane) material covered, all at warp speed, then by golly, you might even like the class.  Can't say much bad about Helfand as a person, although his teaching skills are not finely tuned to the audience - he goes way too fast and goes off into concepts that are impossible to explain in the incredibly short time he gives them.  All in all, beware of this course.  If you're willing to step up, by all means take it - no lab required, little work, etc.  But it's not easy, and you're not necessarily going to get a good grade, so beware.\nWorkload:\n5 problem sets/quizzes, lowest of each is dropped, ridiculous midterm and final, both including problems you've never seen and have no idea how to do.\n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "April 29, 2004",
            "review_content": "\nYes, the problem sets and the tests are challenging.  You will actually have to work, not just to figure out the answers, but to figure out how to figure out the answers.  This can be intimindating and frustrating.  But it also ensures that you understand what you're doing, rather than just regurgitating information or plugging numbers into information with all the comprehension of their meaning that your calculator has.  And for gods' sake, there are only 5 problem sets for the entire semester, one of which is optional!  In a class for which there is no reading or other homework, spending a few hours on a problem set 4 or 5 times a semester is an astonishingly small workload.  The quizzes cover the exact same material as the problem sets and are open-notes, as are the midterm and final.  And they're all curved.  How can this be \"unfair\"?\nFrankly, I found the work in this class to be intimidating and my grade was not as good, or as easy, as I would have liked.  But not for a moment would I criticize the course or professor for that.  In fact, I skirted the A-/B+ border without putting in that much time, doing problem sets in a group, attending office hours to get help, or having done virtually any math in my last four years of studying history.  This is a challenging class, certainly, but its demands are neither unmanageable nor excessive.\nAnd in fact, the class is highly enjoyable.  Professor Helfand--once a theater major--is a highly entertaining speaker--vivacious, passionate, and funny.  He'll do anything to draw his students in, get them interested, or flip on their mental lights.  His stunts--like running a gambling scam to prove how much better statistics are than luck or superstition, or charging full-body into a locked door to show... well, something about physics--are legendary.  And he does convey his subject matter.  His lectures are not just entertaining; they're very well-organized and convey a lot of information very well.  It's also pretty easy to tell which data he's telling us just for the sake of curiosity or enlightenment, and which are necessary for a grade.  Professor Helfand is the kind of instructor who gets an ovation at the end of the semester, and deserves every bit of it.\nAbout the material: it covers everything, or tries to.  One of Helfand's main goals is to convey how relevant science and scientific thinking are to every aspect of our lives, and for me, at least, it's changed the way I look at the world and at knowledge.  The beginning of the first semester is somewhat dry, because the course has no prereqs other than algebra and he has to cover, as quickly as possible, some rudiments of chemistry and physics (and later, probablility and statistics.)  Then it gets interesting as he applies these concepts to questions as diverse as global warming, the authenticity of the shroud of Turin, radiation at Hiroshima, what killed the dinosaurs, supernovae, the diets of prehistoric man, and the origin of the universe.  He teaches as much about how scientists know what they know as about what they know, which is really valuable, and which I didn't expect as much of in an intro class.  If you get bored with any topic he addresses, or find it too confusing, never fear, because he'll be somewhere else soon.\n\nWorkload:\n5 problem sets (1-3 hours each) and 5 quizzes; lowest grade on each is dropped.  You can do the psets in goups and get copious help from the prof.  1 midterm, 1 final.  All tests are open-notes, with all equations and quantities provided.\n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "January 28, 2004",
            "review_content": "\nI don't agree with the previous few critics about the class.  I though that Prof. Helfand was a GREAT teacher-- funny, interesting, AND clear.  Although, I do have to admit that his problem sets were CHALLENGING, but they were definitely do-able if you were to go to his office hours.  He was available before EVERY problem set was due to answer ANY questions, and he would practically DO the problems out on the board.  His lectures were great, and I would recommend the class to anyone who is remotely interested in thinking, rathering than memorizing.\nWorkload:\nproblem sets, quizzes for each problem set, midterm, and final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 18, 2004",
            "review_content": "\nMan.  Do not take this class.  At least until it's seriously re-worked. It was a waste of a freshman course that at least could have been put towards another science course for requirements.  Basically, you forget you're in the class for two weeks because lectures are incredibly painful (at nine oclock in the morning on a FRIDAY) and all information you could research on the internet and present yourself.  Which means many people don't go to any.  And then, when a problem set is due you stay up late until the morning of lecture attempting to complete problems you know you should be able to do, but somehow can't because it's the most mindless busy work... therefore making you feel stupid.  Apparently this class is about learning the process.  This should have been made more clear in the beginning... I thought I was going to learn something besides Intergrated Science I in high school.  The goal of the class should be geared more towards creating a group of adults who will be more aware of current issues within the sciences (which was attempted), and most importantly how to help and actually do something about what one should walk away from the class with.\n\nWorkload:\nTechnically light, problem sets every two weeks, no midterm this time, participation, and final.  Final does not have anything unexpected it's very much like the best problems from the sets.  Word of advice: go to your discussion section in addition to someone else's who you've heard is a good disc leader.  Don't be afraid to drop in on other sections.\n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "January 10, 2004",
            "review_content": "\nObviously, Prof. Helfand is a much-loved, well-respected professor-- and for good reason.  He is a funny, intelligent man who tries very hard to make his classes interesting--which is why I feel guilty admitting that I strongly disliked the class, and would certainly NOT recommend it.  Initially, the lectures seemed funny and entertaining--until I tried to take my notes and complete one of his problem sets, and realized that, despite having been to every class and being a fairly good note-taker, I had no idea how to do them.  From there on, things deteriorated.  The class is simultaneously mind-numbingly easy and ridiculously difficult.  I was bored during lectures, but found myself spending hours trying to interpret his problem sets, before giving up and going to office hours.  The lack of a book makes it still more difficult to decipher the material, and pretty much  impossible to study for his tests.  If you have a genuine gift for science, take this class, don't show up for lectures, and get an easy A.  However, if, like me, science is one of your worst subjects and you are looking for a painless way through the science requirement, look elsewhere.\nWorkload:\nFive VERY difficult problem sets that even my engineering friends had trouble with, five quizzes (drops the lowest quiz and problem set), one VERY difficult midterm, and one hard final.  \n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "December 27, 2003",
            "review_content": "\nI thought I had brilliantly defeated Columbia's stupid science requirement by picking the jokiest joke class ever to fulfill it. I figured I would show up to class once in a while, take the tests, ace them easily, and maybe learn an interesting thing or two. Instead, the class turned out to be very hard, with tricky problem sets, and the hardest midterm I had ever taken. But really if I didn't have such unfair expectations for the class, I would have liked it much more. The topics of the class are varied and diverse. Professor Helfand covers topics from carbon dating and half-lifes to the effects of sunspots on radio waves. He is very clearly a brilliant man, and his lectures are entertaining, despite the speed with which he moves through topics and the tremendous knowledge he assumes we have (and which of course we do not). He seemed to be despondent about the class at the end, and even came out and said that he was disappointed that the class didn't seem to be having fun. But that's probably our own fault for reading the idiotic CULPA reviews that said this class was a joke. Ignore them, understand that there is work to be done in this class with no textbook to refer back to for exams, and that you will be entertained occasionally, and always challenged to think, and you will like the class just fine. If you think this class will be a joke, you will not find it so fun. Not an easy A at all.\nWorkload:\n5 Problem Sets which can be done in groups of 3, 5 Quizzes, Midterm, Final. They're all tricky. Not a joke. \n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "December 16, 2003",
            "review_content": "\nThis class is a disaster.  I'm surprised more people haven't written to complain about it.  All these reviews will tell you Helfand is a funny, nice guy who genuinely seems to care what his students think - which is true.  But it's not like you're going to enjoy the class material, or the ridiculously difficult (for no apparent reason) problem sets.  Classes are disorganized and there seems to be no sense that we are going anywhere in this course.  One week it's analyzing roof tiles from Hiroshima, the next it's determining the diet of skeletons.  This sounds fun and interesting, but wait until you have to take notes and do problems on it - this is where Helfand ruins it.  No textbook, so no way of getting the information except from lectures.  Not that by going to lectures you would have any idea how to do the problem sets anyway.  Better set your watch to go off when he has office hours every week, just so you can get a passing grade on the problem sets.  Anyway, a lot of us are stuck in it for the next semester since it's part of a sequence.  Trust me, if you have the choice, take another sequence.  This is NOT an easy way to do the science requirement.\nWorkload:\n5 problem sets (drop lowest grade), midterm, final.  Problem sets take a few hours apiece, though, since the problems are so ridiculous and out of left field.\n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "November 18, 2003",
            "review_content": "\nThis class is terrible! You think you're signing up for one of those joke classes, but there's one problem: there's no textbook! So if you miss a class, there's no way for you to find out what you missed. Some aspects of this course are interesting, but I'm still not really sure what it's main goal is. It's a bunch of physics, chemistry, statistics and probably all thrown together. Some stuff is very basic and very boring.  Ironically, I have yet to see why this class is in the Astronomy department.... I signed up for it thinking it would be an easy, fairly interesting astronomy course, and it turned out to be a boring, hard course with no ultimate aim. Helfand is a great guy and very funny, but don't be fooled by the first class where you go in and listen to him talk and make jokes the whole time. The next class and many more to come are just boring stuff, like basic probability and basic aspects of chemistry, which are never really applied to anything useful. If you go to every class I'm sure you'll do well, but any time I went to class I would have to fight to stay awake and to stop thinking about what a waste of time this class was. I say avoid it at all costs. \nWorkload:\nbiweekly problem sets which take a surprisingly long time to do, but you can work in groups of 3 [which doesn't help much], 1 midterm 1 final\n"
        },
        {
            "course_name": "C1403-C1404 Earth, Moon, and Planets; Beyond the Solar System",
            "review_date": "April 25, 2003",
            "review_content": "\nI took both semesters of David Helfand's class to complete the sequence-science requirement, and I am very glad I did.  He is knowledgable, entertaining, knows how to deliver an awesome lecture.  He thoroughly cares about the class, and he has offered to repeat whole lectures on weekends for when a lot of kids can't make it (like in the case of war protests and religious holidays).  Fast, funny, intelligent: you couldn't ask for more in a professor.  A tip: I tried to do the problem sets by myself the first semester, that was a big mistake.  Don't be timid, find a group to team up with; it makes everything easier and faster.\nWorkload:\nMedium.  Five Quizzes, Five Problem Sets, One Midterm, One Final.  He drops the lowest quiz grade. \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "January 21, 2003",
            "review_content": "\nGreat professor who really cares about his students.  He is very well respected in the astronomy community, and his fuzzy beard says it all.  He makes every effort to make sure his students understand the material, which itself is interesting.  The problem sets and quizzes are meant to make you think and he gives you all the equations and constants, and you can even bring notes to the exams.  A great course to fulfill the requirement and make you like science again. \nWorkload:\n5 quizzes and psets. midterm, final, all doable if a little confusing at first\n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "December 15, 2002",
            "review_content": "\nIncredible professor, incredible class. I signed up thinking science was, like the swim test, a three-semester waste of my time and realized within the first five minutes of class how incredible science can be. Without a doubt the best lecturer I've had at Columbia thus far, and the only science course I've heard of (or sampled) that makes me want more. Take this class.\nWorkload:\nProblem sets, midterm, final. All challenging but thoroughly explained, and, if you need help, Helfand will always find time.\n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "December 15, 2002",
            "review_content": "\nIncredible professor, incredible class. I signed up thinking science was, like the swim test, a three-semester waste of my time and realized within the first five minutes of class how incredible science can be. Without a doubt the best lecturer I've had at Columbia thus far, and the only science course I've heard of (or sampled) that makes me want more. Take this class.\nWorkload:\nProblem sets, midterm, final. All challenging but thoroughly explained, and, if you need help, Helfand will always find time.\n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "October 07, 2002",
            "review_content": "\nProfessor Helfand is incredibly condesending toward his students and their abilities in understanding science. I am a physics major and I found his class belittling. The problem sets are not so much mathematically challening but rather confusing and he provides little outside help. \nWorkload:\nModerate amount. Midterm, problem sets, final. \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "May 22, 2002",
            "review_content": "\nHelfand is a great and dynamic prof. He really cares for his students and tried his best to make the class into a discussion session too. The matter can be really interesting at times when he talks about cool stuff like black holes and space-time stuff. However, this class can appear to be a bit random at times. On the whole, a good way to complete the science requirement!\nWorkload:\nNot too much work. Psets can be hard but Helfand is really helpful with them. Tests are decently straightforward and there is a standard curve. 5 weekely quizes are a joke. \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "January 25, 2002",
            "review_content": "\nHelfand is an excellent professor -- engaging, funny, clear, remarkably accessible considering the size (nearly 100 students) of the class. The class itself is a mixed bag. Helfand sees it as an astronomy-tinged introduction to scientific thinking, and a few of the general-science topics (for instance, back-of-the-envelope estimations) are worthwhile. Most, though, aren't: the class went through basic chemistry and high school physics, which much of the class already knew. And if the difference between speed and velocity never managed to reach you, you're not about to suddenly grasp physics in two classes. As a result of this, the bulk of the midterm marks were either Cs or As: the science-phobic struggled, and those with some scientific knowledge cruised. All that said, when the course dealt with actual astronomy, it was consistently fascinating and well-taught. Recommended with reservations, but still recommended.\nWorkload:\n5 problem sets, not impossible but definitely challenging. 5 quizzes, easy if you did the corresponding problem set. Midterm and final of reasonable difficulty.\n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "September 09, 2001",
            "review_content": "\nWhether it's his calculation of the number of dump trucks needed to cart away the global weekly toenail-clipping waste, or his demonstration of centrifugal force by standing on a spinning platform and whirling about much faster than you think a grown man would be comfortable with, or his betting real money -- at 20-to-1 odds -- that at least two people in the class have the same birthday, Helfand is a delight. No wonder he did segments on Comedy Central's \"The Daily Show with Jon Stewart\" last year. He's witty and engaging and makes astronomy, physics, chemistry, and everything else he covers in this class fascinating--even to a history major. Hands down, the best science professor I have ever encountered.\nWorkload:\nFive quizzes and problem sets per semester, which aren't simple but aren't impossible, plus a midterm and a final, both of which are graded on a generous curve. No reading.\n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "April 09, 2001",
            "review_content": "\nI've seen these three titles (The Universal Timekeeper, An Introduction to Scientific Habits of the Mind, Astronomy-Physics-Geology) associated with the course in various places, but I can assure you of practically zero geology. Helfand is great! I took this year-long course as a science requirement filler (ugh) and have been rewarded beyond all expectation. Helfand is an excellent lecturer, well-prepared, organized, and on top of the material. He throws in well-placed humor and the occasional anecdote to spice up his for-the-most-part-entertaining lectures. I never expected to get so much out of a science class. Universal Timekeeper is a broad, important introduction to lots of science. Helfand makes everything extremely relevant, and often succeeds in turning the lecture into a big discussion section. Despite his extremely busy schedule, he always makes time to meet with students and is more than willing to hold review sessions. The focus is not at all on memorization or even on doing the problems, but on learning the overall concepts and developing \"scientific habits of mind.\"\nWorkload:\n5 Problem Sets (drop the lowest); 5 quizzes (drop the lowest); midterm and a final, both very similar to the problem sets. The grading is pretty lenient. The problem sets are challenging (in a good way), yet not too hard, and it turns out to be a few hours of work once every two or three weeks.\n"
        },
        {
            "course_name": "The Universal Timekeeper",
            "review_date": "April 08, 2001",
            "review_content": "\nHelfand is brilliant and charismatic, but unmotivated and uninterested students pull this class down. Progresses from obscenely basic to somewhat challenging as the term goes on. I could have taught the first half of the course in greater detail, based on what i remember from 10th grade chemistry. It really does get better with time though. With no reading, this is a thinking class--take it if you find science intellectually stimulating but don't have the math for real courses... and make sure you have a high tolerance for slow classmates.\nWorkload:\nPretty light--problem sets/quizzes every week, a midterm and a final, but no reading whatsoever.\n"
        },
        {
            "course_name": "C1403-C1404 Earth, Moon, and Planets; Beyond the Solar System",
            "review_date": "December 31, 1999",
            "review_content": "\nHelfand is a funny, dynamic professor who cares about his subject and will make you care about it too. He's involved in major research, but doesn't seem troubled by teaching an intro course. Helfand goes fast, and his problem sets are very challenging. Exams are tough, but curved, although it is entirely possible to do poorly in the course. Nonetheless, not an all-around hard course, and a great way to complete the hated science requirement.\nWorkload:\n(Same for both courses) Midterm, final, and regular quizzes (easy) and problem sets (hard).\n"
        }
    ]
}