{
    "prof_info": [
        {
            "prof_name": "Donald Hood",
            "prof_id": 1858,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 21, 2012",
            "review_content": "\nFrontiers is kind of boring, but Don Hood makes it manageable. As someone who is \"not a science person\", I wasn't looking forward to having to deal with the class, but first off it's really not that bad (if you can think logically and read graphs, you're mostly set), and secondly having this wonderful man as a discussion leader made things a lot better. He's not a harsh grader at all, and while the workload is standard across sections, he gets that you're probably not very excited about the class and grades accordingly.\nHe was one of the lecturers for our semester, and his were actually pretty interesting, and well-organized to cater to both the sciency people and the humanities people. \nAnd, he invited us over to his house for dinner at the end of the course! If you're in his section, STAY THERE. \nWorkload:\nWeekly problem set (pretty easy), quizzes at the end of each unit (basic), midterm and final (graded leniently), and a \"research paper\" that involves analyzing a scientific article (also graded quite nicely). Not bad at all, compared with other sections.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 25, 2010",
            "review_content": "\nThis guy is the BEST. He cares a lot for his students, and he does very comprehensive reviews of the material. He takes time to get to know his students well. Although seminar definitely drags on sometimes, it's well worth it in the end. In terms of the weekly lecture, truly don't bother going. Most students get, by the end, that it's really not worth it. The lectures are posted online, even with an mp3 recording in case something is hard to understand.\nAlthough frontiers is pointless as a class, Don Hood will make your experience a lot more pleasant.\nWorkload:\nWeekly assignment (graded on a check plus/ check system), 1 quiz per topic, a midterm, and a final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "July 06, 2010",
            "review_content": "\nOne of the most caring and all around intelligent professors that I've had the pleasure to have, Dr. Hood was a true blessing for Frontiers. He headed up the program and actually was the lecturer on Neuropsychology, so his seminars were extremely focused during our weeks on that subject. While I heard many other seminar leaders only knew about one of the lecture series, Hood attempted (and succeeded) in becoming as much of an expert that we needed in each section. Funny, devoted, caring and just simply enjoyable, Hood made Frontiers for me (a strict Humanities student) much more bearable (and at times even enjoyable) experience than I expected. Get him if you can!\nWorkload:\nNo extra work from that which is assigned to all students. You have to truly complete your WIAs, and your finals must make coherent sense, but he's not a difficult grader. Very fair, in my opinion.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "March 24, 2008",
            "review_content": "\nDon Hood is a great section leader. He did an excellent job explaining all the topics covered during lecture. He was a fairly easy grader when it came to the WIAs (Weekly Individual Assignments). These assignments were anything but individual. He actually encouraged us to work with our classmates on them. He was a fair grader on the exams and an overall easy-going guy.\nWorkload:\nWeekly WIAs; midterm; final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 08, 2006",
            "review_content": "\nDr. Hood is by far the best teacher I've had in my entire college career.  He is brilliant, caring, funny, and down-to-\nearth, understanding that FroSci is not our only class.  His grading is easy, and he makes the material interesting, but doesn't go too in-depth in the material (perfect for an intro science course).  Also, he is one of the creators of the course, so he knows exactly what is to show up on the final.  He is such an engaging teacher that I decided to major in neuroscience!  If you are lucky enough to be in Dr. Hood's seminar, STAY!!!!\nWorkload:\nThe usual FroSci problem sets, lecture questions, final exam.  Do well on the problem sets.\n"
        },
        {
            "course_name": "Issues in Brain and Behavior",
            "review_date": "August 23, 2005",
            "review_content": "\nWow!  This class was the very best I have take in my four years at CU and thanks in most part to Professors Hood and Hirsch!!!  They are phenominal.  The course was a real challenge but it was worth every minute.  The course content was all over excelent--how can you complain about a course that has 6 interested students (half of them post docs), 2 award winning professors, and a multi-million dollar lab which we used regularly.  I loved how the material was eally examined in depth.  We read many scientific papers, and I mean really read-beyond just skimming the abstract!  We learned how to replicate and crtique other people's work.  We were required to produce real work at the end of the semester and even though I have to say I was unprepared and quite challenged- it was the greatest learning experimenet.  Dr. Hood and Hirsch both were extremely thorough, clear, patient and also fun!  I can't say enough about how much I recommend this class to anybody serious about neuroscience, or anybody who feels up to the challenge of thinking like a real scientist.    \nWorkload:\nWeekly reading in textbook and a few scientific papers.  Even though this took time- the work was chosen well so it was always interesting and relevant.  Weekly question set based on assigned reading.  (The usual.)\nFinal Project- design experiment (possibly do it on classmates) and write a complete scientific paper.   Also give powerpoint presentation to class about your project.  \nThis class is serious and challenging but you will be rewarded for effort and participation.  \nA+++ Highly recommended.  \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 09, 2005",
            "review_content": "\nLet me just say that Don Hood made not only my experience in this course much more rewarding and enjoyable than it could have been, but made my first semester at Columbia that more appealing.  I truly lucked out by getting him.  One of the nicest, enthusiastic and approachable professors that I had this semester, Don's passion for his subject area came through and his teaching style led to great results on the standardized final.  I would definitely take another seminar with him again if I had the chance.  \nWorkload:\nWeekly discussion questions, 4 long problem sets, final\n"
        },
        {
            "course_name": "Issues in Brain and Behavior",
            "review_date": "September 05, 2004",
            "review_content": "\nClass was co-taught with Don Hood. First semester offered, a lot of it seemed by the seat of their pants. The educated, talented pants worn by these two respectable professors. Dr. Hirsch is fabulously positive, always smiling, I can't think of a critical thing she's ever said about anyone. Class participation is strongly encouraged, one never feels intimidated. The subject matter is unbelievably fascinating- one of the times where you feel privileged to go to a school like Columbia where undergrads have access to million dollar fMRI scanners. \nWorkload:\nweekly readings and postings (not hard, just have to submit something), 15-20 page research proposal. Professors Hood and Hirsch help you every step of the way. The material is interesting enough it doesn't seem tedious.  \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 16, 2003",
            "review_content": "\nThough very interesting, the experimental freshman class was riddled with problems: poorly written problem sets that often were not based off of the lectures, an attempt to cover too much information too quickly, and often a lack of connection among the topics. But the course will probably vastly improve since it was a pilot course, so now onto Don Hood:\nIn this seminar class of about 15 students, the class would usually start out with him summarizing the previous general lecture and would often be interspersed with student questions (and some discussion). His lecture style falls somewhere in between chirpy / engaging and dry / unenthusiastic. The problem is that much of the material was not his own specialty and he might even be learning it for the first time. But the lectures on his area of expertise (which is presumably relevant to his other classes) had an interesting subject matter and he would often become more engaging or excited about the material. He was organized enough that he was easy to follow in his lecture. He would present facts rather simply while providing a good foundation for when he would talk about bigger ideas and concepts. I rarely left feeling I did not understand some subject material Â– and if so he invites and always answers questions. He is also very approachable after class and will easily talk to you (at which point you also realize he is rather lighthearted and even slightly amusing). I donÂ’t know how good he is about being open during his office hours, but he is probably the best professor I have seen in regards to promptly responding to student e-mails (during the daytime). Grading was based only on hideous problem sets, but compared to the other professors teaching the class I understand he fell somewhere in between. So his grading is definitely fair (if not charitable). \n\nWorkload:\nSlightly less than most classes. Five problem sets, which can often resemble busy work, each takes an entire night (think: ~6 hours). No midterm, one 3-hour (easy, but annoying) final.\n"
        }
    ]
}