{
    "prof_info": [
        {
            "prof_name": "Chris Edling",
            "prof_id": 12775,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "September 17, 2015",
            "review_content": "\nI had Chris for UWriting, and he was an amazing professor. Extremely nice, very helpful (both in and out of class) and a very fair grader. He also brought food to the class sometimes, which was always welcome.\nChris taught really well, graded fairly and gave very helpful comments. He also had one-on-one meetings with students to speak to us about our drafts and see if we were going in the right direction. Not a super hard class if you do what Chris says (He's very fair about work and extensions). He also gave a lot of very practical advice, like how to get past writer's block, email etiquette, how to make your argument sound stronger, etc.\nChris also gives 2 free extension 'coupons' at the beginning of the semester which you can use if you want more time for a paper. Other than that, he also gave other extension opportunities (like 'attending this event and you get an extra extension coupon', etc).\nTLDR: If you get Chris for UW, consider yourself blessed.\nWorkload:\nStandard UW workload: 4 Essays (3 drafts for each) and weekly readings.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 21, 2013",
            "review_content": "\nI am not a morning person. So imagine my delight when my section of University Writing--not a class I was particularly excited for and a tricky one to switch in and out of--was slotted at 8:40AM, to my knowledge the earliest one available. Yikes. Spoiler alert, though, Chris Edling made it bearable. The dude is just a good teacher. His classes are rigorously structured, which might sound like a bummer but more than anything lends a rare feel of productivity to a class that could so easily swing the other way. UWriting done his way felt substantive, helped along by his persistence in hammering certain tenets home (ICE your quotations! Problem! Claim! Evidence! Motive!). The notes he provides on drafts are immensely helpful, not only for grade-grubbers (do what he says and you'll probably get the A) but also for those idealists who actually want to make their writing more precise and compelling. And if you snag the \"Gender\" variation of this course like I did, you'll get a handful of interesting reading--along with some sorta wearying stuff, but hey--and some good conversations about a topic the guy happens to like a lot.\nAnd, you know what? He's a nice guy, too. Struggling through classes just like the rest of us, Chris never once gave off an air of \"I have more important things to do.\" He brought a ton of unsolicited (but deeply appreciated!) food to class once, took a group picture of our class at the end of our final class, and always seemed 100% there. Years later, I might even look back fondly upon University Writing--something I'm sure a metric ton of my classmates can't also say. Two thumbs up.\nWorkload:\nFour essays, manageable reading, and some trifles of homework thrown in there. I might as well speak to grading, too: I got an A for the semester. The only essay I really dedicated time to was my second one (\"Progression 2\" in UW-speak), and the last two I wrote in a few coffee-fueled hours the night before. He's charitable.\n"
        }
    ]
}