{
    "prof_info": [
        {
            "prof_name": "Tongo Eisen-Martin",
            "prof_id": 3609,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Youth Voices on Lockdown",
            "review_date": "March 23, 2009",
            "review_content": "\nTongo Eisen-Martin is a stunning disappointment. \nWorst professor I have ever had. I agree wholly with the other reviewer, who was in the same class as I was.\n"
        },
        {
            "course_name": "Youth Voices on Lockdown",
            "review_date": "January 15, 2009",
            "review_content": "\nThis class was the biggest disappointment I have had at Columbia. Ideally, it would involve teaching a weekly creative writing seminar to incarcerated adolescents on Riker's Island. However, we almost never were even permitted to enter the facility. This last semester appeared to be exceptionally bad, as I heard positive feedback from people who had taken the course before. Our frequent inability to access the jail was not necessarily Tongo's fault. \nHowever, Tongo is extremely disorganized, negative, and punitive. It's kind of ironic he is harsh and unhelpful, considering he is trying to fight punishment and institute alternatives to incarceration. He may do well teaching the students in jail, but with our class he was completely useless. He explained virtually nothing about how to teach a class, gave no sample lesson plans, but then would yell at everyone for supposedly misbehaving. There was zero guidance in what was for many a first-time experience. I remember one email from him stated that our returning to Riker's after being expelled (some girls were dressed inappropriately--hint, don't wear spandex or a backless top to jail) \"is a victory that any of you could easily turn into a defeat.\" This is just typical of the way he talks. We never debriefed on any of our experiences in the jail, and he never used a single negative experience as a springboard to discussion. He never TAUGHT anything. \nWorking with the students is challenging, and would have been somewhat rewarding had we had more than a sum total of about 3 hours with them over the entire semester, but given the circumstances the entire experience was frustrating. \nWorkload:\nVirtually nothing--just wake up at 6 AM on Fridays to go into Riker's and stand in line for 4 hours, maybe walking into class for 2 minutes. Weekly brief write-ups on classes you teach, if you do, and a short final paper. Grading appears to be arbitrary or based on personal preference.\n"
        }
    ]
}