{
    "prof_info": [
        {
            "prof_name": "Natalie Kampen",
            "prof_id": 751,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Feminist Texts I",
            "review_date": "November 14, 2009",
            "review_content": "\nhere you will find a slew of positive reviews, gushing about this professor. do not be fooled. \nmy complaint is basic: \ni received A's on all of the written assignments for this class, and was a consistent and lively participant in class discussion. somehow, to kampen, this means i deserved a B+.\nof course, i am disputing this grade. as i am forced to entertain her excuses for giving me a B+, i will just say that personal resentment, and other geriatric inclinations, are to blame. and this, is unacceptable.\nif you want a professor who is cute and cuddly, kampen is your woman. but don't think that you can work hard and be secure that you will receive the grade you earned. be prepared. \nWorkload:\na lot of reading, 3 papers. quite doable.\n"
        },
        {
            "course_name": "Roman Art and the Image of the Family",
            "review_date": "July 29, 2007",
            "review_content": "\nTallie, as she affectionately signs her emails, is one of the most personable and approachable professors I have come across in my career at Columbia.  Her lectures, though on a topic I didn't really appreciate, were fun because she was so passionate about the material.  (We even took trips to the Met - once to see the new Greek and Roman Galleries).  Writing the papers was hard, but she was accessible to aid in your research since it is such an obscure and unexplored topic.  \nWorkload:\n3 Papers, Final \n"
        },
        {
            "course_name": "Feminist Texts I",
            "review_date": "May 09, 2007",
            "review_content": "\nTally was absolutely fabulous!!! If you get a chance to take a class with her, consider yourself amazingly lucky! She is intelligent and well-spoken and has a great sense of humor. She reconfirmed my decision to be a Women's and Gender Studies major. She was excellent about responding quickly to email, answering questions, providing feedback on rough drafts of papers, etc. Her syllabus was well-organized and she stuck to it, so you always knew what was expected for each day of class. She was also great about soliciting students' feedback and responding to our needs (such as extending paper deadlines and asking us which reading assignments we liked most and least so she could revise the syllabus for next year). And she graded/returned papers very quickly! Tally was understanding and approachable and made class interesting and fun. I never wanted to miss her class and I never had trouble staying awake in it, and I actually enjoyed writing the papers for this class and I liked the reading assignments (with the exception of maybe 1 or 2 texts). I learned so much in this class while really having a blast. The only thing I'd ask Tally to change about the structure of this class is to have her be in charge of leading the discussion (as she did in the beginning of the semester, but later she switched to assigning student discussion leaders... and I liked it better when she guided the discussion because I felt it was more focused that way). But really, this was the best Women's Studies class I've ever taken and I'd definitely recommend it!! I miss Tally already! Take her class!\nWorkload:\nweekly readings (anywhere from about 100 to 400 pages per week, usually around 250), 3 papers (two 4-page papers and one 9-page), class participation, work with a partner to plan and lead class discussion for one day, a couple of courseworks postings\n"
        },
        {
            "course_name": "Feminist Texts I",
            "review_date": "May 10, 2006",
            "review_content": "\ni didn't really understand what this class was about but it's a major requirement and sounded interesting.  tally revamped it and chose a lot of interesting texts which we read chronologically.  she bent over backward to make it not entirely western based; i'm not sure if this was a good or bad thing.  i think femtexts 2 will be a lot more interesting to me, but tally was an easy grader, we had some good discussions and i was opened up to new vocabulary about how to consider the female experience.  i wished it had been a bigger part of my semester, but a once-a-week class just didn't make that big an impact.  still, it's easy, interesting, and you meet some cool people and consider different ideas.\nWorkload:\na ton of reading if you actually do it all but it's not necessary.  two 3 page papers, one 10 page paper, required discussion question on courseworks each week.\n"
        },
        {
            "course_name": "Feminist Texts I",
            "review_date": "May 10, 2006",
            "review_content": "\ni didn't really understand what this class was about but it's a major requirement and sounded interesting.  tally revamped it and chose a lot of interesting texts which we read chronologically.  she bent over backward to make it not entirely western based; i'm not sure if this was a good or bad thing.  i think femtexts 2 will be a lot more interesting to me, but tally was an easy grader, we had some good discussions and i was opened up to new vocabulary about how to consider the female experience.  i wished it had been a bigger part of my semester, but a once-a-week class just didn't make that big an impact.  still, it's easy, interesting, and you meet some cool people and consider different ideas.\nWorkload:\na ton of reading if you actually do it all but it's not necessary.  two 3 page papers, one 10 page paper, required discussion question on courseworks each week.\n"
        },
        {
            "course_name": "Roman Art & Architecture",
            "review_date": "November 14, 2004",
            "review_content": "\nKampen's lectures were always \"politically correct,\" & no one challenged these views even as one had to listen to students drivel on about queer studies. her lectures & use of slides were supurb but her grading was difficult & random. she does not accept excuses for incomplete work\nWorkload:\na final research paper & oral presentation\n"
        },
        {
            "course_name": "Roman Art & Architecture",
            "review_date": "May 21, 2004",
            "review_content": "\nI have taken twelve art history courses at Columbia, and if I were to pick one to drop, this would be the one.  Kampen is nice, yes, she lectures well, that is true, but she is very unfair.  She does not give slide lists, and the TA's, who were surely the least helpful TA's I have ever had, certainly did nothing to remedy the situation.  Of course, she does not give you all of the information for the slides during the lectures, and you are responsible for spending time in Avery finding all of the images that are not on the website.  Unless you are truly interested in Roman art and architecture, I would not take this class.  \n***These corrections were sent to CULPA: \"Kampen has very clear slide lists and slides online. She also puts some of her lectures on Courseworks. No TA's.\"\nWorkload:\nmid-term, final, 10 page paper, a quiz on one of the books, reading (that is usually worthless)\n"
        },
        {
            "course_name": "Roman Art and Architecture/Senior Thesis",
            "review_date": "December 01, 2003",
            "review_content": "\nTally is the most amazing professor at Columbia.  Her knowledge of Roman art is immense (except she never remembers the dates for everything).  But that isnt a big deal.  Lectures were always really interesting, and I had no trouble staying awake, which I sometimes do in a slides/lecture class.  She is always available for her students to talk to, and is incredibly sympathetic, understanding, and humerous.  She is advising me for my thesis now, and I really enjoy every minute I spend working with her.  Take a class with her if you can, you will love the experience and you will love her!\nWorkload:\nFor Roman Art:  Light reading.  Slide midterm and final, not terribly hard.  The occasional \"quiz\" to keep you honest, but nothing too hard and half the time she doesnt count it anyway.  One 10 page paper, but not terribly difficult.  The load is a bit lighter than most art history seminars.    \n"
        },
        {
            "course_name": "Roman Art and Architecture/Senior Thesis",
            "review_date": "December 01, 2003",
            "review_content": "\nTally is the most amazing professor at Columbia.  Her knowledge of Roman art is immense (except she never remembers the dates for everything).  But that isnt a big deal.  Lectures were always really interesting, and I had no trouble staying awake, which I sometimes do in a slides/lecture class.  She is always available for her students to talk to, and is incredibly sympathetic, understanding, and humerous.  She is advising me for my thesis now, and I really enjoy every minute I spend working with her.  Take a class with her if you can, you will love the experience and you will love her!\nWorkload:\nFor Roman Art:  Light reading.  Slide midterm and final, not terribly hard.  The occasional \"quiz\" to keep you honest, but nothing too hard and half the time she doesnt count it anyway.  One 10 page paper, but not terribly difficult.  The load is a bit lighter than most art history seminars.    \n"
        },
        {
            "course_name": "Intro to Women and Gener Studies",
            "review_date": "February 02, 2003",
            "review_content": "\nTally is sweet, sympathetic, hilarious, briliant, engaging, and she really cares about teaching even intro-class students. The problem with this class was mostly that it was too large, meaning that one day a week was just taking notes on Tally's or Professor Ortner's lecture (interrupted by a few annoying students contradicting the lecture or bringing their unfounded or egotistical opinions to the class's attention), and the second day was a discussion section in which people randomly gave their opinions about things but nothing of any value really came from hearing students talk out loud about their personal experiences.  Take the 9am discussion section just to be with Tally, but be warned that even though she tries to veer students away from rambling or telling stories, this is mostly what people have to offer. \nThe essays assigned for the class were far too random and you can't really connect your papers with what you read or learned in class.  Also, Professor Ortner is not friendly nor funny like Tally, and her readings and lectures tend to walk the line between bearable and boring.\nWorkload:\nLots of reading (sometimes sleep-inducing, sometimes interesting), reading quizzes (you have to do the reading to get these), four 5-page papers.\n"
        },
        {
            "course_name": "Intro to Women and Gener Studies",
            "review_date": "November 22, 2002",
            "review_content": "\nThere is just no enough I can say about Tally. She is just what you would want your best friend's mother to be. She is sweet, caring, extremely funny, tells it like it is, and is not afraid to state the true facts. She is always willing to meet with students for extra help. Tally knows her subject so well that just listening to her think aloud will enlighten you. She talks fast and doesn't remember what she said before, so you can't ask her to repeat stuff, but the kid sitting next to you probably got what you missed and vise versa. The class is fascinating and with Tally teaching, you couldn't ask for a better combo.\nWorkload:\n3 easy quizzes on the readings \"to keep you honest.\" They barely count for anything and as long as you read most of teh readiongs and listen in lecture, you are fine. 4 5-page papers on subjects that have nothign to do with the reading and are pretty much free topics.\n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "November 14, 2001",
            "review_content": "\nProf. Kampen is an excellent, engaging lecturer, with a wealth of knowledge in so many areas, though she passes the course over to other specialized professors for most of the sessions. It seems that her focus is in Ancient Greek, Roman, and Jewish work, but I've found her helpful across the board. One note: she hates people leaving mid-lecture-- don't do it! You won't want to anyway.... Plus, she incorporates NYC into the curriculum with Museum visits and relevant papers.\nWorkload:\n2 papers: one 2-3 pgs, one 5 pgs. Midterm, Final. Readings vary by the length of the chapter assigned. Usually not too bad. Leave at least 2 full days to study for the exams, though.\n"
        },
        {
            "course_name": "Introduction to Women's and Gender Studies",
            "review_date": "November 13, 2001",
            "review_content": "\nNatalie Kampen is one of the most engaging professors I've heard lecture. She \"gets\" her students, and speaks accordingly. Always willing to help out, she's pleasant to deal with. Take this course!!!\nWorkload:\n3 5-page papers (fairly easily graded), take home Final.\n"
        },
        {
            "course_name": "Introduction to Women's and Gender Studies",
            "review_date": "November 13, 2001",
            "review_content": "\nNatalie Kampen is one of the most engaging professors I've heard lecture. She \"gets\" her students, and speaks accordingly. Always willing to help out, she's pleasant to deal with. Take this course!!!\nWorkload:\n3 5-page papers (fairly easily graded), take home Final.\n"
        }
    ]
}