{
    "prof_info": [
        {
            "prof_name": "David Rothman",
            "prof_id": 2313,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Nuremberg and Beyond: Human Rights and Medicine",
            "review_date": "January 04, 2005",
            "review_content": "\nDespite RothmanÂ’s international renown, he is incredibly friendly and interested in the work of his age 21 and under students. He is also exceptionally humorous, and does his best to make the class more like a coffee time chat where there is some fun to be had and a some jokes to be made. If you do the readings, youÂ’ll be sure to have something to say about the material, and since both he and his wife know the stuff so well, youÂ’ll be reassured that you understood whatÂ’s going on, and youÂ’ll know how to think when you write the paper. A true and devoted expert in the field of medical history, I would part the waters to come back to CU and take a class with the Rothmans. \n"
        },
        {
            "course_name": "Nuremberg and Beyond: Human Rights and Medicine",
            "review_date": "December 24, 2004",
            "review_content": "\nThey have a rediculously large amount of field experience - the two of them have travelled all over the world giving lectures, working with Medicins sans Frontiers, and other research.  They mostly work at the School of Public Health, but teach this undergrad seminar.  \nI learned a whole lot in this class.  Unlike previous seminars where you're supposed to \"read\" 400 pages a week, this was about 50-100 pages of manageable reading - and always extremely interesting.  Also, instead of having to buy either a lot of books or an expensive coursepack, the Rothmans post all of their lectures on line.  Sure, it will kill your paper quota but it's fine at the end of the day.  \nThe topics in this course were very interesting - it began with the Human Rights doctrine, hippocratic oath... then to Nazi Medicine... and more recent issues like female genital cutting, organ trafficking, and AIDS in the third world.  The Rothmans know so much about everything and they were able to play off each other well (think of your grandparents - except  holding PhDs).  They wonderfully moderated discussions, and really opened my mind.\nThe class was all discussion - and it was great.  The paper was 50% of the grade, but we had no drafts due, peer edits, etc.  The whole thing was to hand in the paper on the last day.  All he said was \"publishable length.\"  So about a minimum of 15 pgs.  Many people wrote closer to 30 pages.  I have no idea how it was graded, or if it wound up counting for more than 50%.  However, I will say that your paper better be really good because it doesn't seem like this course is an easy A by any means.\nTake this class... you'll learn so much from it, and don't focus so much on the grading (or lack thereof).  Also, David Rothman was once featured on the Daily Show (in one of those segments).  Ask him about it.\nWorkload:\nWeekly readings ~50-100 pgs of really interesting material on a subject.  Rothman was always able to balance out two sides of an argument with these readings.\nOne paper.  Very unclear about guidelines but probably at least 15 pages.  \n"
        }
    ]
}