{
    "prof_info": [
        {
            "prof_name": "Katiti King",
            "prof_id": 2349,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Jazz Dance I",
            "review_date": "October 14, 2010",
            "review_content": "\nIt was not the best dance class that I ever took, but I did enjoy it and felt that I learned.  HOwever, I think her grading is ridiculous.  I missed one class the whole semester and ended up with a B+.  It's an intro course in DANCE.  I realize that sometimes teachers in these fields feel that they need to try to justify themselves as being academic or difficult by being j*rks about grades, but come on.  I came to class, I was serious about it and I participated to the full extent of my abilities.  I think that is the most that you can expect from a student at the Intro level.  To punish people for not being professional dancers in an intro course, seems to show that she is insecure about herself and needs to grade tough to prove something.   \nWorkload:\nfine\n"
        },
        {
            "course_name": "Jazz 2",
            "review_date": "February 05, 2009",
            "review_content": "\nGreat class! Her warm-up is awesome, her movements combine elements from many different types of dance (jazz, modern, African, Latin). Very nice woman!\nWorkload:\nNada\n"
        },
        {
            "course_name": "Jazz I",
            "review_date": "September 14, 2005",
            "review_content": "\nI'll make it straight forward. I didn't like her, which is a shame because it seems like she's the only professor who teaches Jazz I, II, and III. I love dancing and have had many years of experience, but I found Katiti's class boring and repetitive. I agree with other students that she plays favorites big time. I didn't feel like I was improving at all during the semester, and it was quite tedious towards the end of the semester. \nWorkload:\nNot much, as any intro dance class.\n"
        },
        {
            "course_name": "Jazz I",
            "review_date": "June 10, 2005",
            "review_content": "\nAs someone with lots of dance experience, I found her somewhat helpful in technique improvement. Very understanding re: absences. MOST DEFINITELY plays favorites, so don't get upset if you aren't one of them. A sweet woman, not a great dance teacher by any standards.\nWorkload:\nAttendance. If you can't manage that, maybe a paper to make up.\n"
        },
        {
            "course_name": "Jazz Dance III",
            "review_date": "May 16, 2005",
            "review_content": "\nKatiti really, genuinely wants each student to be the best dancer he or she can be. This is fantastic if you are looking for strict technical improvement. This is not so fantastic if you have a problem being constantly called out during class for your mistakes; something that really takes getting used to and can be abrasive at first. There is not a lot of variety in her classes, even in advanced jazz, which I think she would attribute to a desire for depth rather than breadth. Regardless, it can get boring. Most notably, I asked for a syllabus early in the semester after she did not hand them out. I attempted to follow it and had perfect attendance. I still got a B+. So, if you're looking to have fun in a dance class and get a grade that will help your GPA, this is not the class to take, although you probably will be a stronger dancer when you are finished with it. \nWorkload:\nMakeup classes for more than two absences, and she's a tough grader. \n"
        },
        {
            "course_name": "Jazz Dance I",
            "review_date": "March 07, 2005",
            "review_content": "\nShe is overly critical and condescending in my opinion.  Apparenly this class is harder to do well in than orgo. You learn one routine all semester and stretch the rest of the semester. She also has favorites and if you are not one of them WATCH OUT \n"
        },
        {
            "course_name": "Jazz I",
            "review_date": "January 17, 2005",
            "review_content": "\nIn contrast to the previous reviewer, I enjoyed this class.  It wasn't life-changing, just a good way to get some exercise.  Katiti was laid-back, it's true, and she did have her adorable toddler son in class twice when a babysitter fell through, but if you like to move your body twice a week and this fits your schedule, you might just appreciate her teaching style and sharp sense of humor.\nWorkload:\nClass.  Don't miss more than 4.\n"
        },
        {
            "course_name": "Jazz I",
            "review_date": "December 29, 2004",
            "review_content": "\nShe did not come to class about 4 times during the semester.  She is the most unprofessional teacher I have ever encountered.  She has a standard for you she doesn't expect of herself.  We did the same thing all semester long, from day one to the last day.  I won't be too enthusiastic about taking anything with her ever again.\nWorkload:\nattend class!\n"
        }
    ]
}