{
    "prof_info": [
        {
            "prof_name": "Adrian Espinoza Staines",
            "prof_id": 12762,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Hispanic Cultures II: Enlightenment to the Present",
            "review_date": "December 15, 2016",
            "review_content": "\nAdrian is a passionate instructor that expects you to engage with the material. If you don't know a lot about Spanish and Latin American history he won't hesitate to explain things to you.\nThis is one of the best classes I've taken at Columbia. There should be an option to take this instead of CC. The readings were all relevant, except the religious texts at the beginning which were really difficult to read. However, Adrian explained everything and was always open to provide background information and handouts in english to help us understand! \nAlthough this class is known to be challenging, it was worth it because Adrian made it interesting, so at times it didn't even feel that hard. It was cool that sometimes Adrian would adapt the discussion based what we were actually interested in talking about.\nEven though Adrian can be very sarcastic, which might make you feel judged for being completely lost because his accent can be difficult to understand, he's actually a funny and encouraging professor that is willing to help you do well in the class. This class is more \"about learning\" than anything else so he doesn't like mundane summaries and does not judge you if you make Spanish mistakes as long as you bring up something interesting. \nAlthough he is not an easy professor, and sometimes the workload might seem impossible, he makes his students, including non-native speakers, feel comfortable and welcome to contribute to the class discussion. \nHe even brings food and snacks to class!\nWorkload:\nThis class will teach you how to skim in Spanish, because it's not possible to read everything while taking 5 classes. \n-A discussion post and reading before every class\n-One 8 page midterm. One 8-page final. \n-A few movies as well as 2-3 readings for every class\n-One 10-minute in-class presentation\n\n"
        },
        {
            "course_name": "Hispanic Cultures II",
            "review_date": "January 03, 2015",
            "review_content": "\nAdrian is an incredibly kind person and an excellent, knowledgeable instructor - I enjoyed Hispanic Cultures II despite the department-mandatedly boring curricula. Despite the weekly readings which were often pretty mundane (but challenging), Adrian enriched our academic experience with his own knowledge of the topics and texts covered, encouraged classroom debate, and understood when we were confused or sleep-deprived during midterm season. I HIGHLY recommend this class, but mostly recommend any class Adrian teaches - he is a gem and one of the smartest and most compassionate instructors and people you'll find at Columbia. If you participate enough, attend class, and write papers that exhibit dedication to the topics, you'll get a grade you're happy with. \nWorkload:\nModerate - about 6 four-page papers, graded carefully but with lots of helpful commentary and fair grading. One 10-12 page final paper (all in Spanish). 1 in-class presentation, no exams. \n"
        },
        {
            "course_name": "Advanced Language Through Content",
            "review_date": "December 18, 2013",
            "review_content": "\nAbsolutely one of the best Spanish classes I have ever taken. \nThe course material was interesting, albeit very depressing at times. Most of what we read or watched was in Spanish (obviously) and was very well-organized to take us through Mexico from the 1910 Revolution through the modern drug trafficking happening today. There were one or two duds in the readings (that is, material that appeared to be a poor choice) but outside of those, most of it could be easily understood and gave us insights into the history of Mexico. There was also a trip to see a real Day of the Dead altar, which was pretty nice too. \nAdrian himself, however, really made the class stand out. He has a really laid back demeanor and can be really funny at times. His Spanish can be a bit fast at times but if you ask him what a word means or ask him to repeat himself, he'll gladly oblige. He seems really dedicated to helping you understand the language first and foremost, and has positive things to say about every student. It can be hard to feel that your Spanish is good or even adequate, but Adrain will really help you feel like, yes, you can do it. \nAnd it's not just language he'll help you with! If you're struggling to come up with an essay topic, or want advice, he'll point you in the right direction. I wanted to write about something before it was formally presented in class, and he suggested an awesome resource and gave me pointers. \nAs for grading, his grading is very generous. A lot of the work is mostly credit/no credit (at least I think it was, he never really was clear about it) and he appears to appreciate insights more than actual language. That's not to say he doesn't care about his language, but if you can make good points he'll appreciate them even if you're struggling with Spanish. \nAll in all, I wish I could take this class again! If you get the chance, please take this class, you won't regret it! \nWorkload:\nReading or a movie due every class. There were 10 \"reading guides,\" most of which were responses to the works. There are also packets he gives in class, which ask you to discuss the topics in the readings with small groups and write out your answers. If you don't finish in class (you won't) it becomes homework. In all, homework on a typical day was no more than 30 minutes to 1 hour. \nFour essays, about 1000 words each. Two have to be expository and the other two can be creative short stories based off something from the syllabus. \nOne presentation, about three or four minutes, about an author. These are easy and short. He gives you chips or candy after you finish, too. \nOne final, which lasted about an hour: one essay about a text we read (~300 words), five multiple choice questions and five short answer (about one sentence each). Easy enough if you kept up with the readings. \n"
        }
    ]
}