{
    "prof_info": [
        {
            "prof_name": "Robert Legvold",
            "prof_id": 526,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Foreign Policies of Former Soviet States",
            "review_date": "December 23, 2005",
            "review_content": "\nProf. Legvold is one of those FEW examples of PoliSci professors who are both big-names in their fields AND excellent lecturers.  Despite not being immensely interested in the post-Soviet world, his lectures were always interesting.  They met for 2 hours straight every Tuesday and never once was I bored, tuned out, or disinterested.  This man is amazing.\nThe onyl fault I would see with the course is its over-emphasis of Russian foreign policy at the expense of a more in-depth view of the Caucasus and Central Asia (Poland and the Baltics aren't even part of the syllabus).  Legvold's area of interest is obviously Slavic-oriented, but he does make a good point of relating the centrality of Russia to the foreign policies of the other states.\nWorkload:\nDiscussion sections that are more or less optional, tons of readings (though the critical ones are always designated beforehand in class), midterm and final, and a 20-page term paper.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 15, 2004",
            "review_content": "\nProf. Legvold is the most intelligent and fair people you will meet at Columbia.  He really takes the philosphy of CC to heart and FOLLOWS it.  While some of his other reviews have said that he favors people, you can tell that he read those reviews and made an effort to change his behavior in class, because now he asks for students to omit thier names on exam booklets and papers so that he can grade them more fairly.  And he does grade fairly.  Class discussions are NEVER boring...seriously.  He stimulates students, he forces students to challenge their beliefs, he knows all of the background and really understands the works.  If you are quiet in class, he will ask your opinion at times, but he does not try to put people on the spot.  He is the epitome of a fair and engaged professor, who really just wants his students to read and understand the material so that they can start forming their own opinions.  What you see is what you get - he is just a great professor.  If you get into his CC class second semester (he only teaches in the spring), then consider yourself lucky; if you don't get him, you should switch in.  He is what makes CC the gem of the CORE.\nWorkload:\nTwo 7-10 page papers, midterm, final, lots of extra reading added on, but it's very interesting and not burdensome\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 09, 2004",
            "review_content": "\nThis man is really, really great.  He's one of those totally brilliant foreign policy intellectuals who understood the intricacies of the US-Soviet Union relations, but in CC he asks you questions that really get at the core of your beliefs (no pun intended).  He sometimes goes all Socratic method on students, so going to class unprepared can be scary, but if you get him for 2nd semester, consider yourself very lucky.  You'll learn more about yourself in this class than anywhere.  I've never had a professor that cared so much about what his students really thought, and then implored them to explain why they thought so without passing judgement.  Brilliant, brilliant man.\nWorkload:\nA little more reading than others are assigned, two 5-7 pg. essays, midterm and final, all fairly graded\n"
        },
        {
            "course_name": "Foreign Policies of Former Soviet States",
            "review_date": "November 18, 2003",
            "review_content": "\nThe guy is god. Knows so much. Reading are not too much, class is very very interesting. Best political science class I've taken so far.\nI reccomend this class to everyone.\nWorkload:\nnot too much, a bit of reading\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 24, 2002",
            "review_content": "\nLegvold only teaches the spring semester of CC, so there is no way you can know if you will end up in his class. If you become one of those unfortunate souls, LEAVE! honestly, the only prof i've ever had to actually call on students. he assigns lots of readings outside the standard syllabus, and assigns too much of the readings that are on the syllabus. doesn't even seem to understand the material as well as the smarter students! classes are spent on easter egg hunts trying to find what an author wrote on a specific line of the hundredth page of the reading. his grading system might have been fair, but it was bizarrely twisted with pluses and minuses - who knows what was going on? legvold isn't particularly friendly, and takes the life out of a class that has a lot of potential.\nWorkload:\nmore reading than other CC classes. midterm and final, each of which are pure essays\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nAvoid, at all costs, taking CC with this professor. While undeniably intelligent (he specializes in Russian politics and makes interesting connections to the texts), he is an aggressive man who ruthlessly shoots down students who can't answer his nit-picky questions about the texts. Shows favortism as well, particularly to students who talk a whole lot about abstract principles without any actual grounding (or relevance) to the text. Tacks on a whole lot of supplemental readings as well.\nWorkload:\nAverage CC load, a couple short papers (5 pages), some extra reading and his midterm/final was mostly reasonable. He grades a bit on the hard side, but not impossible. The most unbearable part of the class were the lectures. \n"
        }
    ]
}