{
    "prof_info": [
        {
            "prof_name": "Karen Emmerich",
            "prof_id": 2695,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 25, 2010",
            "review_content": "\nKaren is a truly wonderful teacher - she's extremely laid back (she happily pushes due dates back all the time), she's very friendly, funny, and engaging. She treats the class like it really exists for the students' purposes, and she won't make you do anything that she doesn't think will actually benefit you.\nYou will also quickly discover that Karen is an absolute genius. Basically everything she says makes perfect sense, and she's unbelievably insightful.\nShe has each person lead a class discussion during second semester, but it's very chill and laid-back. She also doesn't add very much reading to the syllabus (unlike some lit hum teachers). She understands that the reading load is substantial, and she doesn't expect anything unreasonable from her students.\nTake this class! It's enjoyable and very reasonable.\nWorkload:\nWeekly posting (no big deal at all), some essays (number depends on what you want to do), midterm and final. All very reasonable, no surprises.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 22, 2010",
            "review_content": "\nI went into this class a little nervous. I'm definitely more comfortable with literature than the sciences...but I was afraid that I didn't have the kind of background the other Columbia students around me seemed to have with Greek mythology, or the material in general. Karen quieted my fears. At the beginning of the year, she asked for a fifteen minute meeting with everyone individually. She just wanted to get to know us; she asked me where I was from, about my family, what I wanted to major in, and how I was adjusting to college. She is one of the most genuine teachers I have ever met AND she is without a doubt extremely knowledgeable. The discussions are lively and engaging. Consider yourself lucky if you end up in her lit hum class!! \nWorkload:\na few papers...nothing really to fear. if you are stumped on a topic she is more than willing to help you out!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 03, 2010",
            "review_content": "\n  I like Karen a lot; she is laid back about assignments, is flexible with due dates, and really makes an honest effort to let the kids in her class lead the discussions.  She is extremely knowledgable about the literature and really believes that teaching and making good conversation about the works are more important than the grades kids earn.  That being said, when it comes to grading I feel that she is extremely exacting.  After talking with friends, it is clear that she is a pretty tough grader, especially on papers, and is not so lenient about the midterm and final (whereas other teachers might curve the tests or might change it around a bit to give their students an edge Karen sticks with the test, even when she herself admits that they are pretty difficult).  If you take Uwriting during lit hum with Karen, you'll be okay for the papers but if not you'll definitely be disadvantaged.  Overall, the class is great but just be ready to work extremely hard on the few assignments given out.\nWorkload:\nMidterm Final, 3 papers, weekly postings (abuot 250 words not a big deal) and of course plenty of reading \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 16, 2009",
            "review_content": "\nKaren is really great. She's so flexible about assignments and essays, including what you want to write about. She genuinely wants you to enjoy the experience and to do well in the class. She prepares you pretty well for the final and is generous in points. She's a fair grader, and always gives you good advice. I would recommend Karen definitely...she's so chill and really cares about her students and having a good lit hum experience!\nWorkload:\nnot that much...obviously do all the reading. there's the midterm and final... she doesn't add any texts unless everyone in the class wants to. she is understanding that there's a lot of reading, so she takes some more extra days than other teachers if the class feels that we need to. two papers. you have to lead the class in a large discussion for one day (really not that big of a deal), and once a week, write a short post about what you read and thought. really not that bad compared to other teachers! \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 11, 2005",
            "review_content": "\nKaren is great. She gave lots of helpful feedback on papers, had great suggestions for possible directions to go in, and was really responsive to students' needs. She's fun and laid back, flexible about paper deadlines and excited about writing. take her if you can. Her grading is fair and she wants you to do well. \nWorkload:\n3 papers, 4th optional, a few homeworks, readings for classes you're not writing for. Most of the class was based on small-group workshopping.\n"
        }
    ]
}