{
    "prof_info": [
        {
            "prof_name": "Elizabeth  Greenwood",
            "prof_id": 12298,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "April 21, 2013",
            "review_content": "\nI thought Liz was an incredible teacher.\nA lot of kids get annoyed at having to take University Writing because they say they \"already know how to write.\" I thought this about myself until I took her class; my writing improved SO much and she takes so much time to read and comment thoughtfully on what you've written (she gives back a full, single-spaced letter with each essay, in addition to the comments in the margins). If you are taking University Writing, I would DEFINITELY recommend trying to get into her class.\nThe class is a lot of work (as is any University Writing section), but don't try to skimp on it. You will get so much out of the class if you do all the assignments thoughtfully and carefully and really consider her feedback.\nOn top of being a great teacher, she's also just a generally warm, friendly, nice, thoughtful, and interesting person. When I was a freshman I didn't realize how important it was to build relationships with teachers, and she's a teacher I wish I had gotten to know and learn from more.\nWorkload:\nLike any University Writing section, the workload is heavy but never unreasonable. She grades strictly but very fairly, and she gave us an opportunity to re-write and re-submit any essay at the end of the term for a full re-grade.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 24, 2012",
            "review_content": "\nI thought Liz was a great teacher. She's really enthusiastic and made UWriting at least bearable if not enjoyable. She's fairly young and relates to her students pretty well. She remembers a lot of tidbits about everyone in the class and will make sure to chat with you. Overall she's a really positive person - she just wants people to participate in class, even if you say something wrong.\nThere was a LOT of reading, but this seems like the norm for all UWriting classes. Make sure you do the reading, because the essays are based off of them. I made the mistake of glossing over a lot of the readings, and I had to go back and read them thoroughly because I had trouble writing my formal drafts. \nOne gripe was that her exercises could take a long time to complete. However, they're graded for completion and could help you write the essays so it wasn't too bad. Also, a lot of the class discussions were based on these exercises so if you didn't do them you were kind of lost.\nI thought Liz was a fair grader on the essays. I got B+/A-s on pretty much all of the them, which seemed about right. I'm sure if I had put in more effort I could have done even better. She has mandatory conferences for every essay, and it's really important that you go in there with some good questions because she gives you solid feedback and is very clear on her expectations. She will also write about a page of comments/feedback for every formal draft (ungraded) that you turn in, and again she'll make her expectations very clear. She'll remember what advice she gave, too, so be sure to fix whatever she tells you to because she'll notice the improvement.\nMost of all, I have to say that my writing truly improved after taking this class. Don't just do it for the grade - pay attention to what is being taught. She pointed out a lot of flaws in my writing that my teachers/peers had never commented on before.\nShe's also pretty attractive so that made the morning trudge to class a little more bearable.\nWorkload:\nA lot of reading, exercises assigned/due every class. Four essays, like every other section.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 05, 2012",
            "review_content": "\nThe first day or maybe month of class you will probably think you've landed in a fun University Writing Section.  Don't let her sunny disposition fool you.  Unless you are one of her three favorite students, you probably will find nothing but frustration from this class. Not only does she assign more work than other University Writing sections, but her feedback on one draft will directly oppose her feedback on other ones. You should always go to office hours, and not write in a sophisticated matter whatsoever. She is looking for high school level writing and attempts to produce other works will be harmful to your GPA.  My real advice is to get out as soon as possible. \nWorkload:\nMore than other Uwriting Sections, and she is a harder grader. Most sections you'll start low, but as your writing improves, so will your grade. Not with this one!\n"
        }
    ]
}