{
    "prof_info": [
        {
            "prof_name": "Angelina Craig",
            "prof_id": 1251,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Spanish I",
            "review_date": "March 11, 2009",
            "review_content": "\nAngelina is clear, helpful, understanding, and a very capable teacher. She answers all questions and makes herself available to her students. She is extremely knowledgeable in all aspects of Spanish and does a fantastic job relaying her knowledge to her students.Take her class!\nWorkload:\nLight. She assigns what you need to know.\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "May 20, 2006",
            "review_content": "\nIf your looking for a Spanish teacher who is both demanding yet fair, Angelina Craig is for you. Unlike other Spanish teachers I've had, she does not hold students accountable for ridiculous amounts of busy work. She is very reasonable and motherly and very fun to have as a teacher. I must warn you however, DO NOT SPEAK ENGLISH IN HER CLASS!!! Solamente espanol or its OFF with your head!!!\n\nWorkload:\nChapter quizes about once a week or maybe once every two weeks. A few compositions and then the typical workbook exercizes (she never assigns all of them).\n"
        },
        {
            "course_name": "Int. Spanish II",
            "review_date": "May 16, 2004",
            "review_content": "\nAbsolutely wonderful.  Prof. Craig took over my Int Span 2 class after the strike, and I can safely say that I learned more from her in a week than I did over the course of the entire semester.  She has this bizarre ability to create transitions from one topic to the next, and it always left us stunned, sitting there, thinking \"wow...how did she go from discussing rockets to the passive voice?\"  Sure, I only had her for two weeks, but those two weeks were the first time that I actually ENJOYED Spanish.  Take her for anything if you can, she is an amazing amazing amazing teacher.\nWorkload:\nStandard.  Workbook exercises, etc.  Quizzes (she is a fair and easy grader, which makes you not obsess as much and allows you to realize what you actually know), speaking test, final\n"
        },
        {
            "course_name": "SPAN V3353y Literature and Culture of Spain: Medieval",
            "review_date": "April 18, 2004",
            "review_content": "\n   This is a survey class that picks up the highlights of the period such as /El cantar del Mio Cid/, /Lazarillo de Tormes/ and /La Celestina/. It's paced at about a novel per week, which is fast but not impossible--though keep in mind that you are reading in medieval Spanish for the most part.\n   Prof. Craig is a /very/ sweet, warm, and motherly. She is very organized and explains concepts very clearly, touching upon most of the major themes in each work. She enjoys and knows the material well (her senior thesis was in some way related to this field). She often refers to scholarly criticism (although she in no way expects you to be able to reproduce their arguments on exams). However, much of the class is usually taken up by plot summary rather than in-depth analysis, and if not for the intervention of interesting comments by peers, the class might be boring indeed. \nWorkload:\nMidterm and final, and an optional term paper. No other written work required, so participation is a must.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "November 14, 2002",
            "review_content": "\nFall '02: Professor Craig is now the Acting Director of the Spanish Language Program, and therefore she knows quite a bit about teaching Spanish classes. She always explains concepts clearly and is obviously willing to help students out, no matter their level of experience. The class is conducted primarily in Spanish, but she will explain difficult concepts in English if a majority of the students don't know what she's saying. Quizzes are bi-weekly, more or less, and aren't difficult, though she can be a bit nitpicky. Homework is daily, but rarely takes more than half an hour. Overall, Professor Craig is an excellent way to get started with Spanish: she provides a solid foundation and is willing to help students understand any confusing concepts.\nWorkload:\nHomework: Usually reading and workbook exercises. Quizzes: Every two weeks, given for each chapter, including listening, translating and composition. She also requires the corresponding chapter in the language lab manual to be completed by the quiz. Midterm: very easy.\n"
        }
    ]
}