{
    "prof_info": [
        {
            "prof_name": "Kevin Fellezs",
            "prof_id": 11430,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to African-American Studies",
            "review_date": "January 31, 2014",
            "review_content": "\nThere are two sides to every story.  \nMarxism was discussed on numerous occasions as a plausible antithesis to humans paraded as capital in this country (among other New World countries), but it was never touted as the bonafide way in either Fellezs' lectures or Darlene's discussion section, nor was anyone's voice stifled from disagreeing with the benefits of socialism or communism or despotic/darwinian nature of capitalism.  This reviewer created a complete mischaracterization and false dichotomy to fit his own aims, whatever they may be.  I cannot speak for the TA Yannick's teaching style though it is widely accepted among our classmates who gossip(ed) like pornstars scromp that he educated from a narrow radical bent that many students found restrictive to say the least.   \nRegardless, anyone who gripes about the reading load in a Global Core class at Columbia, a class which they chose on their own accord, having two weeks to review the syllabus before dropping, discredits himself/herself the moment he/she speaks. It's like a smoker complaining about his lung cancer while concurrently smoking a cigarette.  WE came here to read.  WE came here for a rigorous education.  It's literally Columbia's badge of honor, our badge of honor; a badge that signifies that we attend a school that is proud to make us read more about the world than any other undergraduate school in the country; unfortunately, so many of us still like pretending school is just a game, just a name, just a ticket to the big leagues and not a place to learn.   \nHere's a good mean spirited ad hominem attack of the previous reviewer:  Mr. Good/Bad/&Ugly; is likely a little sissy deep down who chose not to show some courage and speak his mind about capitalism face to face with his instructors and classmates and instead chose Culpa as the perfect domain to complain about his own inferiority complex, while tipping his hand that he honestly does not belong in this institution.  \nNo one is perfect, I know I am not, that's clear here in my second rate response, but neither are professors or TA's.  Sometimes, one of the great gifts that a student has at his own disposal is to shine his or her own light back at academia until academia cannot help but take note of the student's acumen, regardless if it differs from their own luster. \nCulpa is no place to quibble about spilt milk you had a chance to mop up from the get go.\nWorkload:\nLong and Lovely\n"
        },
        {
            "course_name": "Introduction to African-American Studies",
            "review_date": "October 04, 2013",
            "review_content": "\nThis is the first time I've written a review, and I believe it is for good reason. \nThis course is disappointing to say the least, yet it has so much potential. I will start with the good, and progress to the bad and ugly.\nGood:\nThe professor is very chill and requirements are very lax.\nThe readings are interesting.\nYou will learn something and it will at times be thought provoking.\nThe professor covers all the readings in class in case you didn't read it.\nBad:\nThe class takes this anti-capitalist stance. While I am totally fine with a critique of capitalism, this class (and its professor, but mostly the TA's) seem to take an anti-capitalist point of view and spew Communism without providing the same level of critique. While it is not a comparative politics/economics class, it nonetheless was disappointing that there was no counter argument of anti-Communism. While this is more prevalent amongst the TA's, the professor also falls into it.\nThere are a lot of assigned readings, most of them are interesting, but 300+ pages a week for a Global Core is my last priority.\nDo you want to critically challenge some of the things in the class. Forget about it. It is a class where if you know the formula (ie. repeat what they say and write it down), you will get a good grade.\nUgly:\nDiscussion sections and the TA's. This is the part that compels me to write this review. In a full class discussion led by the TA, some students asked questions that reflected some level of ignorance. However, the class is billed as being a \"safe space\" to ask those questions and grow. While it may have seemed a tad comical, I believe it was nonetheless a genuine part of some students' learning process on race in America. One of the TA's made snide comments about the students' lack of knowledge and left the class saying, \"That was painful to have to sit through all that.\" This I believe encapsulates the attitude in the class, the professor/TA were there to educate us and make us feel bad for not knowing things. Instead of being there as a conduit of promoting discussion and provoking critical thinking, it turned into: \"Oh, you don't know this? Then you're stupid and wrong.\"\nThe other TA had an obsession with \"radical thought\". While this TA's perspectives were interesting, this TA nonetheless dominated the discussion section, shut down opposing opinions of the students. This TA said it was a \"radical intellectual experiment\". It was more or less an hour of him sputtering out anarchist/Marxist nonsense every week (my favorites: 1) Water is like a drug that alters the body, so why do we ban crack? 2) We didn't have prisons and there was still evil in the past, so why should we have prisons now?). May I add that this TA said all this while on his iPad.\nI knew that I shouldn't say my actual opinion (more or less anti-Communism) because I would be shut down and get a lower grade on my papers etc.\nUltimately avoid this class. Sure it has its ups, but the TA's absolutely destroyed the class for me. A class that had (and still has) so much potential went to waste in my opinion because of the attitudes of the TA's (and to some degree the professor).\n\nWorkload:\nVery light.\nWorkload:\n6- 1 page response papers every other week in response to the readings\n1- Midterm (may be take home?)\n1- Final (may be take home?)\nAttendance of discussion section\n"
        }
    ]
}