{
    "prof_info": [
        {
            "prof_name": "Yasmine Ergas",
            "prof_id": 4983,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "International Human Rights Law",
            "review_date": "March 04, 2014",
            "review_content": "\nI have to say that I find her to be a very interesting person. And outside of class she's great, but I could not handle her teaching style. I truly wish I had waited a semester and taken it with someone else. She's super rambely and unstructured. I rarely felt like the readings mattered to lecture, and she asked for a lot of reading sometimes (this was super weird, some weeks it was 40 pages, others 180, wth?). It wasn't a terrible class, and I did fine, which is sad, considering I felt i could've gotten so much more out it had I had a mores structured and logical approach to the course. \nWorkload:\nVaries slightly on the high side, but not terrible.\n"
        },
        {
            "course_name": "International Human Rights Law",
            "review_date": "December 27, 2011",
            "review_content": "\nThe class was pretty laid back.  Professor Ergas' lectures felt unstructured at times but I enjoyed the examination of the complex process of creating international law.  Some complained that she was too abstract but I think her approach made me more capable of analyzing new scenarios as they arise rather than just understanding individual cases.  I feel much stronger reading, thinking about, and discussing IHRL and Human Rights in general now that I've taken this class.  \n\nWorkload:\nMostly reading - up to about 150/week at the max.  She says that others consider it a heavy reading load, but I didn't find it heavier than the reading for plenty of my other classes. An at-home midterm and final in which she emails you the questions at a specific time and you have four hours to email back with your analysis of a given human rights situation based on real events.  There's no getting around the reading, but that's the only requirement other than discussion. \n"
        }
    ]
}