{
    "prof_info": [
        {
            "prof_name": "Bruce Cronin",
            "prof_id": 2983,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Human Rights and Human Wrongs",
            "review_date": "January 06, 2015",
            "review_content": "\nI have never met a more lazy professor in my four years at Columbia.  \nIf you are looking for an easy course for which you have to do hardly any work, this is a great option.\nIf you are looking to learn something, DO NOT TAKE THIS COURSE.\nEach class was led by a student giving a presentation - they had to carry the class for two hours.  While a student presentation is sometimes nice, the professor should be expected to teach at some point.  He never taught.  It was such a waste of a class.\nHe also is not responsive, nor puts in any effort to the class.  He never knew what we were talking about in advance of the class, he didnt bother to learn the names of the 9 people who were in our class, responds very late to emails, and it took him a month or so to approve our final paper topics. It was clear that he never knew or cared about what was flying.  I did very well in the class, but do not feel accomplished or that I gained anything. \nI really do not recommend this class to anyone who is looking to learn in college.  \nAvoid Cronin at all costs. \n\nWorkload:\n2 hour Presentation\n25-page Final Paper\nLengthy weekly readings - don't have to do them to do well in the class\n\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 06, 2011",
            "review_content": "\nNow, those people who keep saying that Pr. Cronin's lectures are extremely boring, I would recommend to take Pr. Marten's class and see how you going to be overwhelmed by her overly enthusiastic/extremely dramatic lectures. It is true, there were no fireworks during his classes, but I did not fall asleep either. He is a really nice, funny, and easygoing person. The material was interesting, some of the readings were even extremely interesting, but, of course, if you are a conservative, you might not like them too much. The simulations were fun to do and the papers, including the final take home exam, not too hard to write. Now, I would not say this class is 'easy, easy, easy\", but it's absolutely doable. The TA that I had was Seva and he was great - very knowledgeble and helpful. Overall, a good class, although I expected to get an A instead of A-, but, again, I didn't have any experience in poli sci before this semester so I am not complaining.\nWorkload:\nAmount of readings is average for poli sci, 1 ID's midterm, 2 short simulation papers, 1 take home 2 essays final exam. \n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 10, 2010",
            "review_content": "\nPerhaps the most succinct way to articulate this class is \"meh.\" Cronin lectures by reading his power point presentations to the class, who feverishly types down every word. With a weak delivery, inability to watch the clock (we always left class five minutes late), and generally straightforward/obvious material, foreign policy simply did not come to life.\nI stopped doing the readings altogether after around the third week. Save yourself those first two weeks and use them as a reference for the take-home final or to study from for the midterm. Either way, you'd be better served just borrowing the books every now and then from a friend rather than drop the ~$80 required to buy them all.\nSection activity is largely contingent on your TA's ability, but mine were usually interesting and had spirited debate. The \"decision-making simulation\" that counts as 20% of your grade is a gimme assignment, but also ridiculously fun. Too bad we only did this twice.\nAll in all, a relatively simple class. Cronin's not going to throw you many curveballs and he's certainly not going to ask for anything more than a surface analysis/comprehension of the material presented oh-so-conveniently on those power point slides.\nWorkload:\nMidterm, decision-making simulation (two 2-page papers... seriously easy), final.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "November 17, 2009",
            "review_content": "\nEasy class with extremely bias liberal analysis of past policy, stopped going because of it and just showed up for tests and discussion. I stopped doing the readings after the second week because of the obvious liberal tone. Cronin lies about Reagan, and got caught in one during lecture. Books are very expensive for this class and worthless as well. TA Dianne was much better than Cronin and was very neutral oriented in explaining past policy, so I just took notes from her lectures, she is really good at not wasting anybody's time. Mid term was cake and only lost a few points, for answering with the American exceptionalist attitude. On the paper same thing, would have gotten an A if I pointed out flaws in conservative policy rather than point out liberal failures. Overall class was a waste of time, if you basic idea of policy history before this class, you can pull a B with very little commitment.\nWorkload:\nNever wrecked my weekend, but be prepared to endure massive brain exhaustion from being in a state of 'what'. Also you will need to set aside time for some Rush Limbaugh therapy, after listening to this guy speak, to be thinking like a normal person again. \n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "May 16, 2009",
            "review_content": "\nThis course is easy, easy, easy. The lectures are pretty interesting and relatively basic, meaning that if you happen watch or check the news, you'll understand the course. Cronin is a nice guy and a funny lecturer - the kind of teacher that you want at 9 in the morning. Dianne is also the TA you want. She's a nice TA and she's a really easy grader.\nSkim as much of the reading that you can, but don't stress about it too much. Focus on the beginning material (the foundations of American foreign policy) and the section on \"security policy:\" security policy was the focus of the take-home final this semester but it could change to something like economic policy next term.\nWorkload:\nsimple midterm, take-home final, \"decision-making simulation\" with two 2-page papers on topics like the war in afghanistan and israel/palestine, weekly discussion. Hastedt and Forsythe are the important books to read.\n"
        },
        {
            "course_name": "International Politics Seminar: Human Rights in World Politics",
            "review_date": "February 28, 2008",
            "review_content": "\nCronin is the man! He's got charisma and he's only boring when the class is unresponsive, so you get what you give.He can get provocative at times, which is great for an exciting debate and he tries to present every side of an argument. He's difficult to speak with outside of class time but easy to contact via email. He loves baseball and if you don't, you're in for a long semester of jokes and analogies about the Yankees and the Sox, that you're just not going to get. \nI enjoyed his class and learned a lot, but ultimately any class on human rights can be frustrating and depressing.\nWorkload:\none in class presentation on one of the week's assigned readings and a seminar paper 25 pages in length. It's up to you to churn the final one out, because there are no initial drafts, I prefer that system. \n"
        },
        {
            "course_name": "International Politics Seminar: Human Rights in World Politics",
            "review_date": "December 03, 2007",
            "review_content": "\nProf. Cronin is not a bad professor.  But he is also not great.  He definitely knows his stuff, but lacks in the enthusiasm department. I've taken a few seminars and many classes in the Political Science Department and this one was probably my biggest let down...especially after how hard it was to get into the class (massive waitlist).  To people to don't get into his class for whatever reason, don't be too upset.\nClass was always structured around the readings which were presented on by a new student each week.  The problem is, however, that we, the students, don't know what we're talking about and he lets people go on and on before correcting them or bringing the class back on track.\nThe readings assigned are definitely interesting but can be repetitive at times.\nAlso, unlike other seminars that I have taken in the Political Science Department, Prof. Cronin does not help much with the seminar paper.  There is no deadline for a first or second draft, and no time in given (save for 15 minutes when he gives a little talk on his expectations for the paper) in class for extensive discussions or peer reviews.  This could be great for some students who prefer to not have many deadlines.  But for others, like myself, I would have like more structure around the seminar paper so that it didn't sneek up as much at the end of the semester.\nWorkload:\nridiculous amounts of reading every week, but you really only have to do the reading on the week you are assigned to present.  After that, you can just read whatever is relevant to your seminar paper which is a massive 25-30 pages and the majority of your grade.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 08, 2007",
            "review_content": "\nCronin's class was ridiculously easy while at the same time being informative and fun at times. His lectures are totally skippable because they cover what is in the book. the lectures (all powerpoint) are still pretty informative and funny. it's a good intro class to politics that does not require much work at all. Avoid him if you're a redsox fan because he loves the yankees.\nWorkload:\nsuper easy in class midterm and an easy 10 page take home final. a 4 page policy paper for a simulation of the arab-israeli situation is also very easy.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 18, 2006",
            "review_content": "\nProfessor Cronin presents a great overview of international relations. This is not a particularly challenging course and will not leave with a newfound appreciation for international relations; however, Professor Cronin solidly applies the theories discussed in class to current and historical events in a way that will allow you to integrate the knowledge from this class into your everyday discussions about politics. As someone who applied to Columbia because of its polisci department I was pleased but not overwhelmed by this class. It will absolutely provide anyone taking the class with a more nuanced view of international politics. A great class for first semester freshmen.\nWorkload:\nEasy. Maximum of 100 pages of reading a week. Midterm: just memorizing 40 predetermined vocab words. Take home final. Short policy paper for mock mid-east summit,\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 09, 2006",
            "review_content": "\nOn the whole, Professor Cronin is okay- not great, not terrible. He structures the lectures with the same power points each class. Most of the class fussed around on their laptops or slept while a few people asked questions and Cronin strived to get through the whole of his lecture. Often he rambled or went off on more or less irrelevant tangents. There is a lot of assigned reading (probably 100-125 pages per week), but most of it has little to do with the lecture material because the lectures and the assignments are so disjointed. Occasionally he made jokes or danced. He's a good guy, easy-to-talk-to, and clearly knows what he's talking about, he just has trouble engaging a large lecture. If you want a really easy Intro to International Politics class, take this one. If you want to actually really learn something, I don't necessarily recommend it.\nWorkload:\nConsiderably light for a PoliSci course- 100-125 pages of reading per week (which you really only need to prepare half of for your discussion section each week), 1 very easy midterm, 1 strategy paper/international relations simulation (even he admits this is a gimme), and two 3-5 paged papers for the final.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "August 11, 2006",
            "review_content": "\nSo there are two international politics classes next semester, and after wondering why Marten had 147 slots filled and Cronin had only 4, i did some research. it's not that he's bad (well, who knows, maybe he will be) but he is new, and no one really knows about him.  \nhe's taught internationally, published some acclaimed work, and was most recently an assistant professor at CCNY. he's now moved uptown. the students at ccny say this about his course: (from ratemyprofessors.com)\n\"I took him on Int. Law. Be prepared to write fast and listen carefully to waht he says. Midterm is really easy. Final tricky. Good professor, funny and experienced. Its worthy.\"\n\"doesnt take attendance, is always ready to teach, requires a couple of papers no test so thats good you ll pass just do ur work, which is not much\" \nBy the time preregistration opens up again for sophomores, i'll probably not be able to get into prof. marten's section. but even though he's new to the school, i think he'll be okay. i'm signing up for the class. \nCCNY website:http://www.ccny.cuny.edu/psc/BruceCronin.htm\nbiography (second one down):http://www.globalknowledgereview.com/page6.htm\n"
        }
    ]
}