{
    "prof_info": [
        {
            "prof_name": "Tobias Wilke",
            "prof_id": 9646,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 18, 2012",
            "review_content": "\nI had a really great experience in Professor Wilke's Lit Hum class. He is incredibly nice, very helpful, and really understanding, especially about absences and missed work. I missed something like seven email responses in a row and he let me make all of them up and still gave me a really great grade. If you're absent, just shoot him and email and apologize and he's usually okay with it. He is german though, so try and avoid being late to class because he counts every two latenesses as an absence. \nHe asks really thoughtful and conversation-inducing questions. The only problem is that the class I was in wasn't really able to handle them as at least half were asleep or doing calc homework in the back. He really likes it when students participate and will definitely up your grade if you are always willing to be part of the conversation. That said, don't be \"that kid\" who never shuts up or gets really heated about whats being said. Overall, Wilke's a really great Lit Hum professor and overall great guy. \nWorkload:\nWeekly 250 word email responses that aren't graded and are really easy to write, two to three essays each of which is five to six pages and are very fairly and generously graded, and your standard Lit Hum midterm and final which he spends an entire class helping you prepare for. Don't forget to participate in class!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 12, 2010",
            "review_content": "\nI had an overall positive experience with Tobias. The guy knew the LitHum books inside and out. He was for the most part always well-prepared, and asked many conversation-inducing questions, although we were not always up to the task of inducing said convo. I thought he graded fairly for the amount of effort I put in (which was minimal.. woops), but I'm sure if you talk to him during office hours and / or email him with drafts of your paper he would be more than obliged to help you, and it would probably make you just look good in general. He was a chill guy though overall, very understanding if you forget to respond one week (just tells you to make it up) or miss class (for a legitimate reason) and is just looking for some semblance of effort from his students. Good guy, enjoyable lithum experience\nWorkload:\nweekly, super-informal responses emailed to him (more for participation than actual writing / analytical skill evaluation), 2 papers a semester, a midterm each semester and finals\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 19, 2009",
            "review_content": "\nWilke seems like a nice guy. He has no major eccentricities, besides a mild German accent . The classes are good in that he gets students going in the right direction for discussions. That being said, class the classes are only exciting as students make them. When people come in exhausted/hungover/disinterested time can kind of go by slowly (it's nearly two hours per class).\nOne major advantage of being Wilke's class is that he is a very fair grader. Most of the criticism I've gotten on my papers was spot on. I also feel he was very fair with the volume of reading assignments.\n\nWorkload:\n2-3 papers per semester (5-6 pages), one weekly reading response of about 200 words. You'll usually be told what parts of the reading to focus on.\n"
        }
    ]
}