{
    "prof_info": [
        {
            "prof_name": "Jacqueline van Gorkom",
            "prof_id": 2231,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Galaxies and Cosmology",
            "review_date": "May 11, 2016",
            "review_content": "\nThis is one of my favorite classes I've taken at Columbia. Professor Van Gorkom managed to make this class simultaneously clear and deep.  This class wasn't difficult but I learned a lot. This class works for both science majors and non-science majors. She's one of the only science professors I've had who really enjoys teaching.  \nWorkload:\nSome problem sets, a midterm and a final. \n"
        },
        {
            "course_name": "Galaxies and Cosmology",
            "review_date": "April 19, 2016",
            "review_content": "\nProfessor van Gorkom is one of my favorite professors at Columbia. She was incredibly approachable, easy to speak to, and she was also very interested in the subject matter. She is an accomplished radio-astronomer and she often speaks about how her own work relates to the things that we discuss in class. I found the class very easy, and the problem sets interesting as well. Maybe the fact that this class is so enjoyable and the things that we discussed were so interesting made me form a bias in favor of this professor, but I honestly think that she is one of the sweetest, most genuine, and quite frankly hilarious, professors that I have ever had. I hope that I can take another class from her in the future. If you have the opportunity to take this class, please do it. You don't even have to go to class to get a decent grade (based on several friends that skipped often), but I think you will find the material so interesting that you won't want to miss it.\nWorkload:\nA few problem sets before and after the midterm, a fairly easy midterm and a manageable final. Overall, a pretty light workload if you find the subject material interesting and don't mind studying for a bit.\n"
        },
        {
            "course_name": "Stars, Galaxies, and Cosmologies",
            "review_date": "May 06, 2012",
            "review_content": "\nThis is actually a really good lab class for non-science majors who need to fulfill the requirement. It is definitely more conceptual than math-based, but there is still a knowledge of basic math for this class. \nThe class is somewhat boring, and a lot of people chose not to go. She puts all of the slides online after class, so you don't ever really need to take notes, but it is sometimes helpful to go in order to clarify or ask questions.\nShe seems very sweet, although her accent is a little bit understand at first. She happly answers questions and answers them well. I didn't have a lot of problems with the harshness of the grading, and often got 100% or more on assignments or quizzes with minimal effort. \nWorkload:\n4 homework assignments (make a group for these)\n4 quizzes\nMidterm and a final\nAll of the quizzes are open note, and you are allowed to bring a cheatsheet for the midterm and the final. \n"
        },
        {
            "course_name": "Stars, Galaxies, and Cosmologies",
            "review_date": "March 20, 2012",
            "review_content": "\nWorst class I've ever taken because I am a humanities major. She is a very nice woman but her classes weren't much help to the homework or the exams. She is a very fair grader and acknowledges your efforts. The problem sets were very annoying because her lectures didn't have much to do with the questions. But the homeworks and the quizzes overall aren't too bad compared to the earth-shattering exams. I have never seen a midterm graded out of 20 points. \nHer TAs need to be fired because they grade WAYYYYYYY harsher than Professor Van Gorkom herself which is absolutely ridiculous.\nWorkload:\nProblem sets for homeworks, quizzes, mindblowingly confusing midterm, final\n"
        },
        {
            "course_name": "Stars, Galaxies, and Cosmologies",
            "review_date": "September 10, 2009",
            "review_content": "\nProfessor van Gorkom is an extremely friendly and accessible professor who is eager to help her students. She loves astronomy and can get students excited about the subject matter. That said, I was often frustrated at the fact that the lectures did not prepare us AT ALL for the difficulty of the problem sets. The problem sets were heavy on the math and physics, while the lectures involved fun discussions about pretty pictures of stars. You walk away from the lectures thinking the class is a breeze, and then you get hit with a problem set from hell. She is more than willing to help you sort it out, but that's not always enough. This tests actually aren't nearly as bad, though- they focus more on the concepts you read up on in the book, which are simple enough to grasp if you devote the necessary time and effort- which is quite a bit. All in all, the lectures are clearly pretty useless, so if you don't understand her through her accent, don't worry. And seriously, the accent isn't quite as bad as some of the previous reviews suggest.\nBasically, although I think van Gorkom is a sweetie who really knows her stuff, for a liberal arts student like myself, taking this class is a source of unnecessary stress.\nWorkload:\nAbout 4 difficult problem sets, 2 or 3 quizzes, and a midterm and final (to which you are allowed to bring a comprehensive \"cheat-sheet\")\n"
        },
        {
            "course_name": "Stars, Galaxies, and Cosmologies",
            "review_date": "September 10, 2009",
            "review_content": "\nProfessor van Gorkom is an extremely friendly and accessible professor who is eager to help her students. She loves astronomy and can get students excited about the subject matter. That said, I was often frustrated at the fact that the lectures did not prepare us AT ALL for the difficulty of the problem sets. The problem sets were heavy on the math and physics, while the lectures involved fun discussions about pretty pictures of stars. You walk away from the lectures thinking the class is a breeze, and then you get hit with a problem set from hell. She is more than willing to help you sort it out, but that's not always enough. This tests actually aren't nearly as bad, though- they focus more on the concepts you read up on in the book, which are simple enough to grasp if you devote the necessary time and effort- which is quite a bit. All in all, the lectures are clearly pretty useless, so if you don't understand her through her accent, don't worry. And seriously, the accent isn't quite as bad as some of the previous reviews suggest.\nBasically, although I think van Gorkom is a sweetie who really knows her stuff, for a liberal arts student like myself, taking this class is a source of unnecessary stress.\nWorkload:\nAbout 4 difficult problem sets, 2 or 3 quizzes, and a midterm and final (to which you are allowed to bring a comprehensive \"cheat-sheet\")\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 07, 2007",
            "review_content": "\nAs a disclaimer, I am a non-science person and actually enjoyed Frontiers of Science.  Jacqueline is a really serious scientist in her own right, but in the classroom she was engaging and funny.  Most importantly, she actually would stop to address every single dumb question when someone needed help.  She is one of the few instructors I visited for office hours, and as in class, she was always ready to help no matter how elementary my qestions were (or how soon before the exam).\nFrom what I've heard about other Frontiers section instructors, Jacqueline is an extremely lucky catch.  But as with any class, you get what you give.\nWorkload:\naverage frontiers workload\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 09, 2007",
            "review_content": "\nProfessor Van Gorkom is a delight. She's smart (very very smart actually, if you ever get a chance to look into what she studies) funny, kind and totally dedicated to making frontiers as painless as possible. She even brought out a genuine interest in astronomy in me, a dedicated literature/philosophy major. If you can wrangle it, get into her section!\nWorkload:\nTotally in the norm compared to other frontiers sections. No worries.\n"
        },
        {
            "course_name": "Stars, Galaxies, and Cosmologies",
            "review_date": "June 03, 2006",
            "review_content": "\nI have no idea why people had a hard time understanding Professor Van Gorkom's accent.  I have a auditory processing problem and had no trouble with it.  Get over it people!  She is phenomenal, it is amazingly clear that she loves teaching her subject.  I was always excited to attend her lectures.  While the problem sets may seem difficult at first, with practice they get easier and you get loads of partial credit.  She is also very accessible, she always responded ASAP to my e-mails and made time to meet with me.  Also, she rescheduled the midterm, so that it did not conflict with a religious holiday.  I have recommended this class to my friends.  \nWorkload:\nThe workload isn't bad: 6 problem sets, a midterm, and a final.  \n"
        },
        {
            "course_name": "Stars, Galaxies, and Cosmologies",
            "review_date": "November 30, 2005",
            "review_content": "\nI have to agree with previous reviewers and say get over your problem with her accent.  I found her easy to understand and overall a great professor.  She is passionate about Astronomy and wants to share that passion with her students.  She is a fair grader, giving LOTS of partial credit if you show your methods, etc.  Most of the problem sets can be done easily by just looking up the topic in the book.  I am math and science stupid and I am passing the class just fine.  I reccomend her over the Columbia professors.  You get a lot more individual attention, but can still skip the lecture as you feel necessary.\nWorkload:\n5-6 problem sets (she drops the lowest grade), midterm, and final.\n"
        },
        {
            "course_name": "Stars, Galaxies, and Cosmologies",
            "review_date": "October 15, 2005",
            "review_content": "\nAll those people who have a problem with her accent, really need to GROW UP, and try listening with both ears.  If you can motivate yourselves to do the reading, you will be really rewarded in class. She may not be the most effective teacher, but she really is an interesting lady, and she really really cares about her students. ALthough the material she assigns in the problem sets isnt really reviewed much in class, you can figure it out, and she makes herself SO SO available for help.  I like the way she runs her class as well, she loves when people ask questions, and she likes letting the class debate in it, its really up to the people in the class to make it a good class.  If you take the time to get to know her, she will take the time to get to know you, and ask you about your experiences with science and math, to get a feel of what your background is, and ask about your major and things like that. So stop hating!!\nWorkload:\n5/6 problem sets, reading weekly assigned chapters, midterm, final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "August 31, 2005",
            "review_content": "\nok.  I must interject into all these bad reviews of Gorkom and say, \"Grow Up.\"  I took her in my first semester so I had nothing to compare her to.  however, I have since had a TA that was an idiot and prof that could give a shit.  Gorkom is neither.  She may not be the most naturally gifted and entertaining prof but she is incredibly kind and helpful.  Yes.  She will tell you blatantly that your are wrong when you say stupid things.  But isn't that the point of school?  (Science isn't like the humanities.  There are answers that are just plain wrong.)  However, she's not mean about it.  She just says, \"No.\" And then looks for someone who has the right answer.  She is incredibly available to her students and true to her \"matter of fact\" style, when something wasn't clear on a problem set she would say \"Yes.  That wasn't very clear was it?  Let me fix that.\"  The point--she also has no problem telling herself she's wrong.  Fair warning.  She does have a strange habit of pausing before answering.  This is a little off putting because at first you think it has something to do with you.  It doesn't.  Its just something she does.  She may be translating.  It may be an affective disorder.  She may spend too much time reading.  I don't know.  But, i used to suffer from anxiety and my hands would shake.  it didn't make me a bad person.  She pauses.  people come in different flavors.   If you can realize that its just a quirky personal trait of someone who is clearly both brilliant and a forerunner in her field (not many women became astronomers when she did.  i think she was the first female astronomer at some of the institutes she worked at??  princeton or something?), you will find that Van Gorkom is a very sweet, very competant professor who will happily answer all your inane questions and indulge your strange scientific whims.   I am not a science major and she would still try to answer my silly questions about quantum mechanics as they related to the rudimentary astronomy we were learning.  Everyone teaches differently.  She's a nice lady.  End of story.\nWorkload:\nsame as all the other sections.  a lot but worth it in my opinion\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 16, 2005",
            "review_content": "\nIt's not even about the accent, which if you try to understand, you probably can. It's about the fact that -- maybe this is a cultural thing -- she doesn't understand how to tactfully address incorrect answers AT ALL. The effect of this is as follows: A kid raises his hand in the first discussion, gets wholeheartedly smacked down by Jackie, and then never, ever, speaks again because he is afraid of the humiliation. It's not because she is a mean person; she certainly isn't. She just doesn't really understand the etiquette that applies to the classroom. \nFrontiers sucks and everyone knows it. So does UW, but at least every kid has the bare minimum knowledge when it comes to writing. Frontiers is a course that demands a bare minimum of scientific knowledge that a lot of us just don't have. We all took English, but not all of us took physics. It was a humiliating experience for me, and I couldn't wait for it to end. \nWorkload:\nThe problem sets are hard, bottom line. There is fairly tedious, extensive homework also. However, if you try, Jackie won't screw you over with the grade, which is one thing that was great about her. \n"
        },
        {
            "course_name": "Intro To Astronomy II",
            "review_date": "April 26, 2005",
            "review_content": "\nYes, she has an accent. I think she knows this as well as we students have. She tries to help her students. She cares. And if you have a problem with her accent, ask her to speak louder. She will not be offended.\nI found Professor van Gorkam to be a very knowledgeable lady and approachable too. This means that if you cannot possibly figure out a problem from the problem set on your own, you can make a visit and she will prod you to the solution. \nIf you are in a small class like intro to ast. then take advantage of it. Impress her. Answer her questions when everyone else is drawing a blank because they decided not to read the quick summary at the back of each chapter. She will reward you. Or if you're genuinely interested, read the chapter and answer her question in depth. Then she'll really love you. Of course we have to remind ourselves that she's in a field where a lot of the things she's teaching, she's also reseraching too and there are no definite answers to, only theories. If you just show her that you too can come up with a theory based on info from the book, she'll appreciate it.  \nWorkload:\nfair, midterm and final, five problem sets, extra credit assignment\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 04, 2005",
            "review_content": "\nWas the worst class I've ever taken! She has a heavy accent and is sometimes hard to understand. Be careful with your answers because if you are wrong she is quick to point that out. \nWorkload:\nWeekly discussion questions must be e-mailed to her the night before the class. Problem sets after each unit.  No midterm  just the final. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 03, 2005",
            "review_content": "\nI disagree with prior reviewers who said Prof. van Gorkom's accent was impossible to understand - it wasn't.  However, the fact remains that she wasn't a very good teacher.  Perhaps it's because she's incredibly brilliant, but she can't explain things to students very well, on the few occasions when she tried.  She asks questions, smiles and looks at you blankly while you struggle to answer, refuses to cut you off so you end up just spattering nonsense for awhile, and then when you finally conclude with, \"But I don't know, I'm probably wrong,\" she finally tells you, \"Yes, completely.\"  My class even theorized that she took pleasure in us being wrong.  I tend to agree.  If you haven't already learned the material, she'll be of very little help.  She's also a tough grader, so overall I agree that you should avoid her section if possible.\nAs for Frontiers as a whole, the one word that comes to mind is \"sucks.\"  The lectures are entertaining and cover interesting material, but don't matter at all for the grades of the course.  The problem sets are long and ask convoluted questions that you don't know what they're even asking.  Not having a midterm seemed good at first, but now that the course is over, it probably would have been very helpful in preparing for the final.  The final itself was not easy, even though you'd think it would be since it doesn't require any actual knowledge.  Although the intentions of the course are noble enough, it is badly executed and pointless.\nWorkload:\nEmail discussion questions to her every week and a problem set for each module.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 13, 2004",
            "review_content": "\nVan Gorkom has the most difficult accent to comprehend.  However, on top of the fact that she comes from an isolated cave in the underwater world of the Netherlands, she likes to talk to one side of the classroom (I don't know which is better: having her to talk to you or not having to listen to her).  Van Gorkom is not helpful when it comes to understanding course material and expects her students to know all of the answers coming in.  If you don't know an answer, be afraid, because she will shut you down and think you're stupid.  Oh yeah, and this class should be 20 points because it feels like you're there for the entire day., so bring a bag lunch and a pillow.\nThe course sucks enough as it is and having Van Gorkom just adds to the suckiness.  The only good quality I can give Van Gorkom is that she does make herself very available to help her students on the problem sets, however, she grades them ridiculously hard. \nShe definitely takes a lot of getting used to.  If you get her and can switch, do it as soon as possible.  If you can't, just deal with the fact that you're in for an awful semester.  \nWorkload:\nStandard weekly discussion questions on readings, standard monthly problem sets, and then article discussions.  This is just a discussion: all Frontiers classes have about the same amount of work.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "November 23, 2004",
            "review_content": "\nshe is awful!! she can hardly speak english. she has this thick awful accent and her teaching skills are virtually non-existent. \nif you get her for frontiers of science discussion try your best to swtich sections. her class is so boring, its literally an hour and 15 minutes of torture. trust me spare yourself. she's a tough grader.\nWorkload:\nweekly discussion questions that you have to email to her, monthly problem sets, final and every week relevant article discussions. a little more than tne usual frontiers discussion section.\n"
        }
    ]
}