{
    "prof_info": [
        {
            "prof_name": "Rosemary Hicks",
            "prof_id": 4236,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 01, 2010",
            "review_content": "\nI was surprised when I read the two previous reviews: although she was not my favorite professor and I do think this course could have been taught a lot better, I didn't think she was as awful as these reviewers claim.  She clearly knew what she was talking about, and she didn't dominate the conversation too much--instead, she did a good job guiding our thoughts.  One complaint, though, is that, towards the end of the semester, she largely gave up trying to explain what each text was actually saying, and we focused largely on how it was structuring its argument (a valid component, to be sure, but difficult to discuss when you're ignoring what that argument is).  So by the end of the class, I felt that the material of some texts had been largely ignored.\nAlso, I really objected to the way she graded.  Too often, I felt that she was looking for a very specific answer in the essays she assigned, which I don't see as the best approach in a philosophy course with inherently subjective questions.  This led to somewhat unpredictable grades, because she wasn't grading your answer according to how compelling your argument was, but whether it was \"correct\" or \"incorrect\" (which seem like difficult values to assign in a philosophy course).\nOverall, not an awful experience, but there were definitely some things I would like to see changed.\nWorkload:\nReasonable, not more than any other CC class.  A take-home midterm and two papers.  She's also understanding about the amount of work that CC requires--she even made our final optional.  (But she only told us the day of the final--I would have appreciated if she had told us earlier, as I could have flown home a full four days earlier if I had known).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 10, 2009",
            "review_content": "\nClass is a waste of time.  The review from a few days ago summed it up nicely, I'm glad I'm not the only one who thinks there is something seriously wrong with the way that she teaches.\nShe approaches the works as something to be dissected, but goes about it all wrong.  It's like taking apart a car, but at every stage when we cover the various pieces she does not tell us what they are, but rather what they are not.  This is not the same sort of conception of a wheel found in western culture, this is a different interpretation of a bumper than the this-car/other-car dichotomy - just a constant droning of how things are not what we think, but never giving a proper explanation of what things actually are.  This would be merely annoying if she didn't ask us to somehow create something out of this on papers.  All we have is a pile of parts on the floor, and are we're asked to put it back together and go somewhere with it, but always making sure that we don't have any assumptions like that wheels should go on the ground or that the engine should provide the propulsion.  Obviously, this doesn't work out very well.\nThe second complaint is the level of diction in the class: a CC class should not be using precise and technical philosophical terms because most students have not had years of philosophy classes.  She actively encourages us to use this very precise jargon, which doesn't work because she of course refuses to define anything except in terms of what it is not - the best I could get out of her on mysticism was that it wasn't the orientalist eastern mystic/rational western dichotomy.  This is not a definition.  While it may be true, it's completely useless.  Discussion in the class is the college equivalent of a five year old with a hammer banging on the walls, yelling \"I'm fixing it!\".  The discussion is a mad-lib of buzzwords.  You can see the process every time someone speaks: there is the first wave of excitement as a student thinks of a new and fresh idea, the pause a second or two later as they realize that their words are too concrete and straightforward to fulfill the style which she demands and their ideas too well-defined to avoid invoking her ire on some obscure point that drags the conversation back to what things are not.\nI was much nicer in my class evaluation because you can tell she does have an idea what she is talking about, but her refusal to define anything in terms of what it is rather than what it is not and her use of the English language as an impediment to understanding means that as a student, you should avoid having her as your professor if at all possible.\nWorkload:\nTwo papers, weekly posting.  Gave us a take home midterm with three questions, four pages each, and only four days to do it.  She had this hilarious idea that she was doing us a favor by giving us less time because we would be able to spend less time on it.  The about face - \"You shouldn't spend more than eight hours on it.\" vs \"I expected a fairly high level of quality, because I did give you all weekend\" - was a classic exercise in doublethink.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 06, 2009",
            "review_content": "\nRosemary Hicks is one of the worse teachers at Columbia. Her course was nightmare-ish in both her inability to teach and her hidden and yet palpable hostility to select students. I do not remember a learning a single thing from her class, probably because I was too scared to say anything the entire semester for fear of being shot down by her condescending remarks. Only 4 students from the 20-student class stayed on for the second semester (yes... it was that bad). Rosemary's attitudes towards students were little short of inappropriate, for example in the way she would guilt trip students by bringing up her personal life or disagree with any comment without a feminist bent to it. Oh and also... her assigned workload was much heavier than the other teachers and not to mention whimsical, as she would assign extra papers out of nowhere with a week's notice during exam period. Take this class if you enjoy sleepless nights. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 07, 2009",
            "review_content": "\nI'm not going to lie, I was very disappointed with Rosemary Hicks' CC class. CC is supposed to be the pillar of a Columbia education, what really makes Columbia so great, and yet this class was tedious and unfulfilling. Rosemary preferred to take a backseat and listen to students' first impressions of the texts rather than teaching herself, so the class became more of a discussion among ourselves in which Rosemary would butt in to correct students on details here and there. This was Hicks' first year teaching and she did not seem comfortable with the subject matter, which she hid by encouraging an historical reading of the texts. Rather than discussing philosophy, we were encouraged to understand the history and background of each philosopher in what seemed to be an elementary history course. In one-on-one meetings, Rosemary was not terribly approachable and preferred to quiz students on the readings rather than to offer constructive feedback. The midterm and final also had esoteric questions on them that were graded harshly. One example of this was that 33% of the final exam was based on a small text that we talked about maybe for 10 minutes in class. Rosemary was also not shy to let us know how far to the left she was in her political beliefs and was surprisingly close-minded towards new viewpoints, which in my mind existentially defeats the purpose of this course. \nWorkload:\npostings every week, two papers, a midterm and a final\n"
        }
    ]
}