{
    "prof_info": [
        {
            "prof_name": "Richard John",
            "prof_id": 9758,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 05, 2014",
            "review_content": "\nRichard John is an enthusiastic teacher. He will get very involved with the material and will provide a lot of energy for the classroom. He is a historian and so will spend a fair amount of time giving historical information to provide context to each of the readings, which does make the readings more interesting. This was his first time teaching the course so he would often ask for student input on how to carry out discussion. Most classes consisted of him talking about the text and asking for student input on each point that he brought up. A few times he split the class into two groups and made them debate a topic from the point of view of two different authors. There were also a few occasions on which he spent the class asking each person in the room to comment on the text (this was the least organized of the three methods). On the whole though this is a section very much led by the professor, which has the advantage of being structured. However, this did mean that John spent more time talking about the aspects of the texts that he found interesting than those brought up by students. John is also strongly opinionated, and tends to give less credence than he should in such a class to arguments he does not agree with. This can be particularly problematic as most students here hold leftist views, while John often leans to the right, so students' views are sometimes unfairly dismissed. Overall, the section is interesting and a decent one to be in.\nWorkload:\n3 essays (4-6 pages each) or 2 essays (7-8 pages each) - 30 %\nMidterm: Passage IDs, significance IDs, essay (a list of significance IDs is given beforehand) - 15 %\nFinal: same format as midterm + one or two more types of questions - 15 %\nClass participation (includes handing in a summary or reflections on each week's reading when there is not an exam or a paper due that week) - 40 %\n\n"
        }
    ]
}