{
    "prof_info": [
        {
            "prof_name": "JW McCormack",
            "prof_id": 12555,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "April 16, 2016",
            "review_content": "\n\"To say JW stands for anything is a betrayal to the name JW\"\nThis class is lit. He tries to make it seem difficult like Shamus Khan does in the social world, but J Dubs is an easy grader and a huge pushover.\nWorkload:\nLots of pages but you don't have to read any of them. \n3 papers (first 2 are 4-6 pages long and the last one is 8-10)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 23, 2014",
            "review_content": "\nMcCormack replaced our previous teacher for UWriting. However, the way he conducted the class was not fruitful and didn't contribute to me as a writer. He spent a bulk of the class just him talking on one or two of the essays being evaluated, and during the rest he handed out a bunch of handouts that were supposed to be helpful, but were very formulaic. I certainly did not feel my creativity improve, but I also felt that I was just trying to fit certain guidelines without knowing why, and no matter how hard I tried, I always seemed to fail at it. \nHe also has conferences for every progression, but he doesn't give very good constructive advice.\nI didn't like the classes very much since they were very one sided and not fun to participate at. He seemed to dictate some rules and wasn't helpful for much else.\nWorkload:\nThe progressions and some assignments to prepare you for the first or final drafts; not too many readings.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 06, 2014",
            "review_content": "\nI came in to this class nervous, due in large part to all the horror stories you hear about UWriting. I'm leaving it, oblivious of my final grade, but all the same completely satisfied with my progress in the class. I really enjoyed UW, and most of the credit for that goes to JW, who made every effort to make class more interesting and to push us in new directions beyond just learning how to \"write better\". The readings he assigned for each progression were for the most part extremely interesting; they weren't always simple, but once I managed to get through them, I always felt better equipped to write my essays. JW's class is also great, because he gives us some great tips on how to structure our essays without much of a hassle and doesn't make you adopt a specific style of writing, thereby allowing you to grow into your own style over the course of the semester. \nAs a grader, he's extremely fair: Progression 1 was generally kind of low-scoring across the board. I got a B+ prog. 1 and A in prog. 2 and I didn't feel like I had to work tremendously hard for either of those grades. \nOverall, I'd definitely recommend this section; even if you hate the class, JW's good-humored sarcasm and quirky style of teaching should keep you entertained at the very least.\nWorkload:\nNot much to be honest. Each progression had 3 or 4 assignments to go along with it but these weren't mandatory or anything, and they weren't at all time-consuming, and were actually helpful. He's very reasonable with the due dates for the final drafts as well, so its not a super high-stress class.\n"
        },
        {
            "course_name": "UWriting",
            "review_date": "February 14, 2014",
            "review_content": "\nI thought JW was an oddball at first, a corduroyed fiction-writer with tenuous handwriting that usually gives up after the third chalky letter.  He always asks you to explain what you mean even when it's perfectly obvious, and furrows his brow to pretend he doesn't know what you're talking about until you've fully articulated your thought.  But he grew on me over the semester and I have very fond memories of UWriting.  JW gives excellent feedback on drafts, making lots of notes that may crush your soul but he always ends with an encouraging paragraph.  He assigned some dense reading but it was all very interesting (he assigned Zizek's Human Rights and its Discontents and it nearly destroyed me in Butler but I'm glad I read it).  JW is very approachable, very smart, and will help you become a better writer.\nWorkload:\nTypical UWriting, exploratory drafts, small regular exercises.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 22, 2012",
            "review_content": "\nI thought this class was ok. I felt like I actually learned from the class and my writing definitely improved. For each progression, he usually assigns a short 500word assignment to go with each article or text that serve as the basis for the paper. His grading seemed fair, for the most part. I can't say much on that because I gave up after progression 2--got a B overall.\nIf I had the choice, I probably would not have chosen this section.\nWorkload:\nTypical UWriting class but hard grader\n"
        }
    ]
}