{
    "prof_info": [
        {
            "prof_name": "David Bayer",
            "prof_id": 117,
            "total_reviews": 43
        }
    ],
    "reviews": [
        {
            "course_name": "Linear Algebra",
            "review_date": "January 04, 2017",
            "review_content": "\nIf you want to learn tricks to solve problems then take Linear Algebra with Bayer. \nIf you want to learn actual Linear Algebra then do yourself a favor and suck it up and take this course with someone else. \nIf you are taking this course as a pre-req. for another course, then don't make the same mistake that I did. Take it with someone because you will not know what you will need to know if you take it with Bayer. \nWorkload:\nLight\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 22, 2016",
            "review_content": "\nProfessor Bayer is clearly an extremely intelligent guy. However, this class is not for you if you're not willing to self study the material. Bayer jumps right into linear algebra and doesn't really explain the basic concepts very clearly in lecture. If you're smart, learn them beforehand. If not, cram them the night before the midterm. \nThe midterms are very straightforward and the study guides Bayer puts together are very helpful. There are generally over fifty questions with worked out solutions that'll give you a pretty good hint as to what you'll see on the exam. Exam grades are usually very good and it's not hard to get an A--seeing as Bayer gives out as many as he possibly can (!!!). The midterms aren't cumulative, but the material builds on itself so it essentially is. \nIn terms of homework there hardly is any. Bayer will assign roughly 10 or 20 questions due at each midterm and 4 or 5 due before the final. The questions come out of the book and usually don't look anything like what you'd see on an exam so it's pretty easy to do the day before it's due. \n\nWorkload:\n2 midterms, 3 homework sets (very, very short), and 1 final\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 21, 2016",
            "review_content": "\nDO NOT TAKE. \nSimply the worst math class I have ever taken. The lecture's are boring, scattered, and are entirely untethered from the book. Bayer does not teach you concepts, only methods with no reasoning. There are no theorems, no explanations. Just him working through problems trying to convey a method. The TA's themselves frequently do not know how to explain the methods he uses other than \"that's the bayer way of doing it.\" You are left entirely confused, and have to study by essentially trying to copy the method from his answer sheets until you get the method.\nIf you are taking this as a quant major, it isn't worth it -- you will need linear algebra down the road, and this will not teach you it.  If you are taking this as a non-major looking to try out an easier, useful non-calc math class, you will also be hugely disappointed. Although it is true that this class is well-curved (typically, almost a 50% A-range), it is so incomprehensible that you will really struggle. In fact, the A-range fact is somewhat misleading, because an extraordinarily large number of students drop out by the midterm because of his terrible teaching style, leaving only those quant majors who are able to get by.\n\nWorkload:\n2 midterms, and a final.\n3 problem sets from the book which are totally unrelated to what is taught in class, and on the midterm, handed in with each exam.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 21, 2016",
            "review_content": "\nDO NOT TAKE. \nSimply the worst math class I have ever taken. The lecture's are boring, scattered, and are entirely untethered from the book. Bayer does not teach you concepts, only methods with no reasoning. There are no theorems, no explanations. Just him working through problems trying to convey a method. The TA's themselves frequently do not know how to explain the methods he uses other than \"that's the bayer way of doing it.\" You are left entirely confused, and have to study by essentially trying to copy the method from his answer sheets until you get the method.\nIf you are taking this as a quant major, it isn't worth it -- you will need linear algebra down the road, and this will not teach you it.  If you are taking this as a non-major looking to try out an easier, useful non-calc math class, you will also be hugely disappointed. Although it is true that this class is well-curved (typically, almost a 50% A-range), it is so incomprehensible that you will really struggle. In fact, the A-range fact is somewhat misleading, because an extraordinarily large number of students drop out by the midterm because of his terrible teaching style, leaving only those quant majors who are able to get by.\n\nWorkload:\n2 midterms, and a final.\n3 problem sets from the book which are totally unrelated to what is taught in class, and on the midterm, handed in with each exam.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "February 18, 2014",
            "review_content": "\nDisclaimer: I'm writing this after switching out of Bayer's class 2-3 weeks into this semester.\nAfter reading the CULPA reviews of Bayer, going to the first lecture, and briefly talking to him about getting into his (full) class, everything seemed fine. Sure, maybe he wouldn't teach with the rigor I'm used to in math classes, but hey--it'll be easier to get an A, and he's a very nice and intelligent guy.\nHowever, come the first midterm, I realized what was terribly wrong with this class, and it's exactly the type of stuff people had pointed out below: Bayer DOES NOT TEACH THE FUNDAMENTALS OF LINEAR ALGEBRA (at least for the short time that I was in his class, i.e. up to the first midterm). Rather, he teaches you how to do specific types of problems, and you have to memorize how to do them for exams. He gives little, if any, geometric or mathematical underpinning to the concepts he teaches, and you just end up desperately memorizing algorithms for solving his problems and hoping he doesn't change up the problems slightly so that your method falters. In the words of a girl at a review session, \"It's like constipation.\" As others have said, I can't imagine finishing that course with a real foundation in linear algebra, which is obviously bad if (1) you *need* to thoroughly understand it for some later class, and/or (2) understanding why things work is enjoyable/super useful to you.\nAt this point you may be thinking, \"Wow, that sucks. But can't I just read the textbook/watch Khan Academy to learn the fundamentals alongside Bayer's class?\" That's what I thought, and the answer is: NOPE. To quote two TAs verbatim, \"The textbook is...kind of useless.\" Bayer's lectures do not, in any discernible way, shape, or form, follow the Bretscher textbook that the department uses, so it's nigh-impossible to read along with his lectures. (The same goes for Khan Academy.)\nNow, if you *have* to take Bayer for some reason...well, I'm sorry. But be comforted in these facts: (1) His tests and homeworks are *incredibly* formulaic, and he posts huge amounts of review materials on his page before each exam. If you memorize how to do his problems, you'll probably ace the exams. (2) He's a really nice and approachable guy, and is very clearly passionate about lecturing (evidenced by his lack of shoes/the layer of chalk dust that coats him by the end of lectures). In my opinion, however, his style of teaching just doesn't cut it if you want/need a thorough grasp of linear algebra.\nWorkload:\nShort weekly homeworks, 3 midterms, 1 final.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 06, 2014",
            "review_content": "\nProf. Bayer is very good for some students, very bad for others. Don't think \"Ah, silver nugget, let's go for that!\" without reading these reviews. \nIf you're looking for an easy, ridiculously generously curved introduction to Linear Algebra so that you can multiply matrices, compute a determinant and inverse, and fulfill a requirement- this may well be the class for you. There's no homework (BTW, don't bother to buy the book), the tests are easy and straightforward, and you can happily skip most classes as long as you leave a few days before each of the four tests to study. He gives As (not A-level, mind you, full As) to at least one third of the class by my count. Before every exam he gives more than enough practice problems, exams and problem sessions. \nAdditionally, Prof. Bayer is very nice and seemed approachable, and gives back grades very quickly after tests. He's also funny and doesn't talk over your head, which is good news for not-so-mathy people. \nThat being said, you will learn next to no actual linear algebra in this class. After 5 semesters at Columbia I consider this the most useless (though also one of the easiest) class I've taken. The best way of putting this is that the majority or vast majority of students in the class would probably fail, or do very badly, on a linear algebra exam of any other professor. That's because of two main things. First, he generally teaches by example, almost never explaining the general rule or principle. He explicitly states that his main purpose is for you to be able to compute quickly, not understand in-depth concepts. The second reason is that the exams are predictable collections of pre-determined questions, so you'll be studying just those question types you know will be on the exam, and that you can do by memorizing techniques rather than understanding the ideas. This makes the class terrible for anyone who really wants to understand Linear Algebra thoroughly, or even understand the basic ways in which it works. \nSo all in all, do not take this class if you're a math major, someone who needs to know why things work the way they do and not just how, or if \"hand-waving\" frustrates you in any way. But if you, like me, are taking this class just to get over with it and come out with a good grade, this should probably be right up your alley. \nWorkload:\nMinimal. 4 tests, each 25% of the grade, very generously curved (study well and aim for 100%, learn how to check your work and do so- you'll have plenty of time), though keep in mind that everyone else will be doing well too (on the third exam, 57% of the class got 100%). No problem sets (not even worth doing for those who want to put in the extra effort). \n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 29, 2013",
            "review_content": "\nThis is a Math class which requires no more skills than simple arithmetic and making sure you copy over a matrix correctly from the question. A 6th grade kid could memorize Bayer's practice exams and do fine in this class. Like another review says, he teaches only 'neat tricks' and completely leaves out any actual fundamentals of linear algebra. I just don't get how you teach a linear algebra class without ever mentioning a null space. \nYou learn nothing in this class and the exams are super easy. They're so easy that everyone does well, so if you mess up once, there's no catching up. Bayer's grading philosophy is the OPPOSITE of every decent Math teacher I've ever had, He cares more about your final answer than your working. I received 2/5 on a question that had everything right but the answer. \nAlso, there's no homework in this class, which is great because it lessens your weekly workload, but who teaches Math without making student practice regularly? It just doesn't work. And since all you need for the exams is to study the practice exams, this class gets condensed into 4 days: your 3 midterms and your final. Nothing else of significance occurs in that classroom, assuming that these exams are significant at all. \nThis is a classic case of a Columbia professor who has a silver nugget on CULPA for being 'super nice' and an easy grader. This is not the definition of a good professor. If you're interested in learning anything at all about linear algebra, stay away from this class. \nWorkload:\nNo homework, 3 midterms and a final that are exactly like his practice problems. Have a blast.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "November 19, 2013",
            "review_content": "\nPro's:\nHe teaches you lot's of neat tricks, and I kind of liked his personality. No homework. \nCon's:\nHe only teaches tricks. None of the standard methods are taught. You will learn how to  do 5 or 6 very specific types of problems for each midterm. Tests are too easy: lot's of 100's goes to a vicious curve.\nLectures can be helpful because he goes over pretty much the exact problems that will be on the tests, but he does not tell you about the principles he applies to solve these problems. Lots of practice exams are on his website which accurately reflect real exams.\nWorkload:\nNo homework.\n3 midterms\n1 final\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "July 08, 2013",
            "review_content": "\nARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED ARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED \nARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED \nARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED ARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED \nARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED ARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED ARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED \nARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED ARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED ARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED \nARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED ARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED ARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED \nARROGANT PARANOID FUNNY TOUGH BRILLIANT INSANE OVERRATED \nWorkload:\nNO HOMEWORK!  suggested txt problems are a waste of time, practice exams are very helpful, this class has been made hard because too many A's where given out in the past, so exams where made very difficult to achieve a normal looking curve.  If your looking to get an A, get ready to spend A SOLID WEEK OF CRAZY training prior to each exam.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 30, 2013",
            "review_content": "\nTaking a class with Bayer has its advantages and disadvantages. He has a very particular teaching style which I find to be way too hands-off and disorganized to follow. After the first midterm, only roughly a third of the class attended lectures frequently. I attended every lecture and still felt lost without further assistance. I ended up getting a straight A in his class nonetheless but only because of the help of a tutor. I am usually an A or A- student when it comes to math classes and one of my family members is a mathematician who has taught math at the university level so my strong reaction to Bayer is not one of a sour struggling clueless student. That being said, he is a brilliant mathematician who certainly knows the material inside and out and tries to help his students along the way to that kind of understanding as well.\nHere is a sampling of what I submitted for my courseworks evaluations for Professor Bayer:\nI think laying down a foundation and defining terms in very clear ways would be enormously helpful before going into different ways/tricks of solving problems. I felt like I didn't have any foundation whatsoever and that the basics were lost on me for the whole course. I also feel like the lectures were extremely all over the place and disorganized. I think going back to basics when introducing a topic would be extremely useful for the students and then the cool/special cases could be introduced so that we can actually understand them. Also, I feel like WEEKLY HOMEWORK IS EXTREMELY NECESSARY IN EACH AND EVERY MATH CLASS in order for the students to have weekly practice and know where they stand in their grasping of the concepts from getting feedback/grades on weekly homework. I did appreciate the previous exam material available online but because the answers were not posted and it wasn't clear where to look for questions pertaining to the particular unit that was being covered, I felt stuck and like I had no guidance. I ended up getting a tutor for this class, which is the only way I was able to do well on exams.\nI put a tremendous amount of effort into this course because I felt like I didn't learn hardly anything from lectures so I had to have my tutor re-explain everything for me. I usually do quite well in math classes so this is unusual for me - it is very unlikely that I just wasn't smart/quick enough to grasp the material the first time around.\nWorkload:\nabsolutely NO homework whatsoever\nhe has posted practice midterms and finals from previous years on his course website. Only about 1/10th of these actually have answers so checking your work or the way you approach a problem is pretty difficult (although in Linear Algebra, almost all the types of problems have answers that can be checked by plugging back into initial equations or conditions).\n3 midterms and a final. If you actually understand the material inside and out you will be ABSOLUTELY FINE.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "June 12, 2012",
            "review_content": "\nTotally brilliant. I'm not naturally passionate about math, but Linear Algebra instantly became my favorite class. I loved his teaching style. Despite a disorganized personal appearance, his lectures were crystal clear. He explained why he made certain choices as a professor. He liked to do examples in multiple ways so that all students could understand one method or another. \nProfessor Bayer structures this class without graded assignments, so students have to be able to self-motivate. I found myself falling  behind in my own practice problems, then catching up before each test (there were three total). But as long as you are capable of learning things on your own without assignments, this is a great class. And I never used my textbook. He has lots of examples up online, so don't bother buying the book. \nWorkload:\nJust three tests.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "April 05, 2012",
            "review_content": "\nBayer is very interesting as a person and very intelligent, but I think that doesn't necessarily equate to being able to teach.  He's incredibly unorganized and assumes that everyone in the class knows what matrices are and how to work with them.  One class, he breezed over a new topic but then spent about ten minutes talking to us about how to factor a second degree polynomial.\nHe posts tons of practice exams on his site, which are the key to studying.  However, I feel that, by doing his previous test problems, I'm learning a method for how to solve his specific questions, I'm not learning linear algebra.  If I took another linear algebra course elsewhere I'd have to start essentially from scratch.\nSo sure, if you're naturally really good at math and have never had to study it, you probably will get an A.  For me, I had to work really hard to do decently, and I still don't feel as though I'm learning anything. I really don't recommend this class.\nWorkload:\nSuggested problems from the textbook, but the only grades are the two midterms and final.  \n"
        },
        {
            "course_name": "Combinatorics",
            "review_date": "December 17, 2011",
            "review_content": "\nGreat experience all the way around. I know some people find Bayer to be a bit too disorganized, but I really enjoyed the class and his teaching style. He's extremely passionate about math and shows it in his teaching. He doesn't take himself too seriously and is very accessible and makes everyone in class feel comfortable. He explains the concepts very well and is good at presenting the same material in different ways so that everyone will understand it,.\nCombinatorics is a pretty interesting field of math -- I often felt that it had a puzzle-solving feeling to it.\nWorkload:\nNo problem sets! 2 midterms and a final. That's it!\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "June 18, 2011",
            "review_content": "\nBayer is not only a phenomenal teacher, he's also an all around incredible guy. Spend time talking to the man, he always has fascinating stories. He also is a great teacher, being in class is not necessary but very fun and helpful. You don't need the textbook since he'll make sure he teaches a ton of different approaches in class, including some really great short cuts. This class was easy, but only because he gave us the tools to make it easy. Take this class with Bayer, you'll get a good grade, learn something, and have fun while you're at it.\nWorkload:\nLight. Two very easy midterms, a very hard final graded on a generous curve. Practice tests and tests from the past 10 years are available on his website.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 14, 2011",
            "review_content": "\nWarning!\nThis class is extremely easy.\nYou have to be really dumb to not do well in this class. To elucidate my point, I'd like to point out that more than half the class got 100% on the first midterm, and the trend was more or less maintained through the second midterm and the final. \nI went to the class only for midterms and the final, and I got an A+. The secret to doing that is to solve all the previous exam questions he has on his website before the test. And you'll learn it by doing it. The questions are always asked in the same fashion as he has been for the last 10 years, so no surprises there.\nFor all the people heading to the bookstore to buy/rent the textbook for this course, I'd say please don't. It will be completely useless with Bayer because you don't have any homework.  \nWorkload:\nNegligible. Just spend 5-6 hours preparing before every midterm and you'll be swell. If you are really worried about the test then go to the lecture before the midterm and you'll know exactly what to look for in his past exams.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "April 29, 2011",
            "review_content": "\nLinear Algebra is a requirement for many majors, so there were people from many different backgrounds, which was interesting. It is supposed to be very different from Calculus III - and it is. Though matrices might seem confusing at first, by the end of the course I realize how useful they can be in so many problems, especially if you are interested in economics.\nBayer is an amazing instructor and focuses on intuitive approaches to math, rather than old textbook formula-learning. He writes on the black board extensively, so it is one of those classes where keeping up with lectures is a must. He has a sense of humor and also recalls many funny stories. He is also eager to push students into more advanced math classes and to explain complex topics which are not really in the scope of Linear Algebra, but fascinating nonetheless. I really enjoyed his approach and would recommend Bayer to anyone actually interested in Math.\nWorkload:\nTwo midterms, one final.\nVery very easy material, so the class average is very high (>90%). \nHe posts midterms from previous years on his website, if you study from that you are sure to nail the tests as the exercises follow roughly the same pattern. \n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "January 13, 2011",
            "review_content": "\nDave is one of the stranger teachers I've ever encountered. His enthusiasm is tangible due to his tendency, as he puts it, to wear his lectures (by the end of each class his clothes and face are invariably covered in chalk dust).\nHis lectures are often hard to follow, which is my one real criticism. He tends to act like he's about to present a theorem, then feint away to an example. Examples are, in fact, his trademark. He believes that it is better to have a handle on a few small examples than to learn all of the abstract theory without knowing how to work with algebraic objects. Perhaps as a result of this, there is no homework. The first semester, he posted a few suggested problems for each topic, but the second semester was much more experimental. To prepare for each midterm, we were just given a selection of old exams and old practice exams. The key, however, was the problem sessions in the week before the exams. In these sessions (which will go until there are no questions remaining) he works through these practice questions, which are just like those on the test, and you will see exactly what he's expecting.\nThe first semester had about 50 people. The second semester had less than half of that, so class got a lot more fun, and he would interact more with the class, posing questions directed at our intuition followed by the inevitable \"Why?\" to which a satisfactory response need not be perfect; he's seeking to develop a general style of mathematical thinking, so a one word answer may sometimes suffice.\nWorkload:\n3 exams.\n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "May 19, 2010",
            "review_content": "\nBest math professor at this school in my opinion.  Quirky, but nice, and brilliant.  Waited offsequence to take his class, loved it.\nIt's clear that he really enjoys teaching.  He works very hard at making sure you have an in depth understanding of a few key concepts rather than a general knowledge about a variety of concepts.\nHe also makes the classes very interesting, and it's probably the only class I can honestly say I wasn't bored with at any point.\nIt also helps that Modern Algebra is an awesome subject.\nWorkload:\nNot much, but some will be inspired to do extra work because it's interesting. \n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "May 16, 2009",
            "review_content": "\nDave Bayer is a really awesome person and he will make you love math. Take his class!\nHe's very accessible during his office hours and very good at explaining the material in alternative ways so that everyone understands.\nWorkload:\n3 tests, pretty easy because he says EXACTLY what will be on it. (e.g. For the second test he just asked to prove 3 out of the 5 theorems he told us beforehand)\n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "January 08, 2009",
            "review_content": "\nSeeing as there are no reviews for Bayer's class on the Algebra sequence, and that he's teaching the off track again this spring, this seems necessary.  Bayer is a phenomenal teacher but certainly not orthodox: you will not have the 'textbook on the board' style.  His lectures are simply inspiring, illustrating not just the many connections in areas of math but also important historical and philosophical development of math and invaluable insight in how to think like a mathematician.  Take this course sooner than you think, you can handle it (after calc + lin alg).  However, you WILL NOT learn algebra just from him, as he assigns no homework.  This might lead to apathy, but if you read the book and do a few problems along the way, you'll have as good a grasp on algebra as the kids who took Gallagher or Neumann's courses.  He's using Artin's Algebra, but I also recommend Herstein's Topics in Algebra:take this course!\nWorkload:\n2 midterms, 1 final.  With each such test, an optional practice test is given (harder than the tests): if you write up the whole practice test, it counts for half of your test grade! great policy.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "April 20, 2008",
            "review_content": "\nFirst the good part: it's an easy A/A-. Now the bad part: There is nothing you can learn from this class. The prof is condescending, and he never teaches the basics: he simply assumes you know them and then goes on to illustrate extensively his own methods (which by the way are useless) of solving his own problems. This class itself is completely useless: if you are a math major, it will leave you unprepared for higher level classes, and if you are taking it for personal enrichment, it will be a total waste of your time. The only use you can draw from this class is getting an A-, but it will cost you 3 hours of your life, every week, for 4-5 months, for which you will get nothing else but the grade in return. \n \nWorkload:\nNone; homework is never discussed in this class. Two midterms and final -- carbon copies of the ones posted online. \n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "July 16, 2007",
            "review_content": "\nDave is probably the most brilliant math teacher that you will come across. You finally get to see the practical applications of math rather than running around in endless proofs which seem of no consequence. The curve is mighty mighty generous. If you studied only the night before the exam, but studied well, you can easily get an A. Yeah, you probably didn't understand linear algebra really well, cause the way he teaches it is unconventional without the proofs. But you can see the way he thinks through analogies, and you start to think like that, and then math surprisingly becomes a hell lot of fun. Oh, and don't touch the text book. Its useless. Do only the practice exams.\nWorkload:\nYou just need to solve his practice tests. If you solve all of them, you'll get an A in the exam. 4 exams. 25% each. \n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 15, 2007",
            "review_content": "\nWhen I was first trying to decided if I wanted to take LA with Bayer, I was thoroughly confused by the conflicting reviews on CULPA. Having just finished his class, I decided to write this definitive review, the only one YOU need to read to know all about Bayer. Let none question, or argue afterwards.\nFirst of all, my final score of 85, was in the 33rd percentile, and I got an A. I'm pretty happy with that. The text book is indeed useless. Even though he posts chapters that he supposedly is covering, reading those chapters won't help you at all for the tests. The best way to get high grades is to have one friend go to all the classes, take all the notes (especially on the day before the test when he tells you EXACTLY what's going to be on the test). Then have said friend, teach everyone else taking the class how to do the problems the night before the test. Presto, instant high scores.  \nAlthough you do have to be careful, he isn't so clear in his explainations of how to do the problems sometimes and your friend can be wrong some times. Also, he will throw curve balls when everyone's getting high scores. To be on the safe side, you'd better better go to office hours and ask him for help so that you are sure you know how to do the problems that he told you will be on the test. \nYes, as a lecturer, Bayer goes on a lot of tangents. They are mildly entertaining, but nothing really endearing. These tangents really aren't so bad considerring your mind can take a break and day dream a little. And yes, when you go to office hours, he can be a little condescending, but unless you're the type who expects profs to kiss ass all the time, it's really not that bad. He's perfectly willing to answer your questions and help you. And yeah, if you're really into math, you'll have fun with him during office hours.\nOnce you're armed with knowing exactly what's on the test, with Bayer's own solutions to the problems, and with your friend's notes, you're pretty much set. I mean, 30% of the class gets A's. Com'on.\nWorkload:\n4 tests. The final is the same length as all the mid-terms, which is really nice considerring you don't really have to prepare for it.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "April 11, 2007",
            "review_content": "\nSo Bayer is very laid back and very approachable. He's friendly and class is relatively interesting, especially considering the pretty boring nature of most topics covered. He grades fairly and generously, his curve is usually centered almost around an A- is the impression I got and he himself admits to grading too generously at times. \nI'd recommend him to anyone with one warning; he kind of likes to use methods that he \"creates\" for some simple problems (like finding the inverse of  certain matrices) and expects to see you use his strategy on exams.\nWorkload:\nHW is suggested but makes for a great way to study before exams. He gives four exams which are all equally weighted and each exam has 5 questions that are usually pretty straightforward. The last question can at times be a bit tricky but it's never anything too crazy.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "March 30, 2007",
            "review_content": "\nDave is the best math teacher ever.  I never thought Linear Algebra could be presented as easily as he did. Have trouble with math?  Dave breaks down Linear Algebra so a 3rd grader could understand it.  Dave teaches you his own methods for doing complex tasks that other professors wouldn't be able to test on.\nThe guy is a damn genius. He does all of the lecture with no script (like many professors) doesn't screw up, and everything always comes out as whole numbers.\nPeople can say his class is easy all they want, but there were a lot people with hurt feelings when they saw that they were at the bottom of the curve.\nIf you're looking to have your hand held like a 16 year old, you're in the wrong place.  You're whole grade is based off of 4 tests, so you have to have the dicipline to keep up on your own.  This also rules out the possibility that you can just cram for 2 test and ace the class.\nWorkload:\n4 tests.  Homework Optional\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 21, 2007",
            "review_content": "\nthe worst teacher ever, in my opinion. he tries to make the class interesting but he always fails. midterms and final exam questions are very analogous to the exam questions from the last few years. \nWorkload:\nalmost nothing. \n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 15, 2007",
            "review_content": "\nTake this course if you don't want to work for a good grade and could care less if you've learned the material.  Dave comes up with his own ways for solving problems and totally ignores the book, which I've heard is very good but is useless since he teaches different crap.  He expects you to come up with generic formulas after doing a problem on an exam.  A nearly impossible task.  Good thing is, his curve is amazing so your likely to do fine if you don't get good grades on the exams.\nWorkload:\n3 exams, a final (each count for 25% of your grade).  suggested (but useless) homework- not collected.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 02, 2007",
            "review_content": "\nDespite being a grown-up Jeff Spicoli, Professor Bayer's lectures made sense of the potential madness known as linear algebra.  I sat in for two graduate student-taught linear classes during the summer and they consisted either of intense, non-stop writing or class discussions that left the class with more questions than answers.  Prof B understands the flaws behind these methods and has developed his own innovative style.  He genuinely cares about his teaching and adapts to accomodate.  Always entertaining, he often goes off on tangents in his own lectures but his classes never left me confused nor bored.  He explains just about everything clearly and the material he discusses ambigulously can easily be researched on the web (i.e. casting out nines on wikipedia).  Plus he's very receptive to questions about linear algebra, rock climbing and swimming.  With the Fall 2006 class, he decided to have three exams and a final, with the final being the remaining material not covered.  Prior to Fall 2006, he had only two exams and a final.  The exams and final consist of five problems with the first four being straight forward while the fifth was a bit more tricky.  As written by another reviewer, Prof B recommends solving problems from the text but doesn't collect homework so homework doesn't figure into the class grades.  In fact, Prof B's lectures diverge so much from the required text that a student could earn a good grade without purchasing it.  He suggested this in class and his class website recommends ways to save money for those interested in purchasing the textbook.  Prof B grades on a fair curve.  However, those who didn't attend class regularly tended to score poorly.  I highly recommend Professor Bayer for students willing to attend every class and solve problems without the incentive to do so.\n"
        },
        {
            "course_name": "Surfaces and Knots",
            "review_date": "August 26, 2005",
            "review_content": "\nThis class was one of my favourites last semester. Contrary to what some other people have said, I felt that he explained the material very clearly and understandably. I enjoyed the precautions that he took to make sure that no one cheated (although I sure some people found a way). In office hours (I went once, before the final) he was also very helpful. A word of caution however: if you are not a visual thinker, do not take this class! Personally, I enjoyed the challenge that the material presented me (it's not longer an easy A, but the A is not un-reachable) and I hope to take Groups and Symmetry with him eventually. Awesome Prof., definitely deserves a gold star. \nWorkload:\none quiz, two midterms, one final, no assignments\n"
        },
        {
            "course_name": "Surfaces and Knots",
            "review_date": "May 26, 2005",
            "review_content": "\nThis was the dumbest class I have ever taken in the course of my academic career and Dave Bayer was easily the worst professor that I have ever had. Before you chalk this review up to the ramblings of a bitter student, I did very well in this class and so on that count, I have no reason to resent Bayer. This class was so boring, it was painful to sit through. If Bayer had spent half the time and energy he spends trying to trap his students on exams or catch them cheating on actually teaching the material in a clear way, this class might have been more bearable. Bayer seems to dislike his students intensely, and resents having to teach. His attitude basically was that we're all liars and cheaters until proven otherwise and treated us as adversaries. I've never been to his office hours, but the way he answered students' questions in class was rude. He wouldn't even listen to the question before launching into an explanation that had nothing to do with what the person was asking.\nMy two \"favorite\" Bayer moments: 1. When he took off points on people's midterms because they hadn't drawn lines the way he wanted. He never told us how he wanted the lines drawn but he said that we should have picked up on his subtleties.  2. When he didn't post the answer key to a section of review questions for the final so that the people who didn't come to class would have a harder time figuring it out-yeah, except that the people who did come to class didn't know whether they were doing it correctly either.\nTake a real math class with a teacher who will respect you, and teach you what you need to know. Your brain will thank you.\nWorkload:\nOne quiz, two midterms, one final. No assignments. At the end of the term he will send you a very nasty e-mail breaking down how you did on each and how you got your grade. Come to all the lectures. You will have to teach yourself most of the material, but that is very easy to do if you've been in class. Just make sure to take a book.\n"
        },
        {
            "course_name": "Surfaces and Knots",
            "review_date": "May 13, 2005",
            "review_content": "\nDave is the best math teacher I've ever had.  Long after I've forgotten everything I learned in Calculus, I'll remember what I learned in Surfaces and Knots.  It may have been an easy grade in the past, but the course has become more difficult.   As another reviewer noted, Dave is passionate about teaching, and he has a way of making complex ideas understandable for non-math majors.  Take his classes; attend his lectures.\nWorkload:\nNo Homework, no required textbook.  Just attend lectures and learn!  1 Quiz (10%); 2 Exams (25% Per); 1 Final (40%)\n"
        },
        {
            "course_name": "Surfaces and Knots",
            "review_date": "May 13, 2005",
            "review_content": "\nI honeslty don't know how people who don't show up to class can do well. I am not a math person at all, but I definitely think I would have been better off taking an easy algebra class. If you are not a visual person, and can't visualize the \"unknotting\" of knots, etc., do NOT take this class! The final was really hard! This class was not the easy 'A' I had hoped for- as a matter of fact, I regret not taking it pass/fail.\nWorkload:\n1 easy quiz, 2 midterms, 1 hard final that counts for 40%. Absolutely no assignments.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "July 30, 2004",
            "review_content": "\nI honestly really enjoyed Prof. Bayer's class.  True, you can get through it with a good grade without understanding linear algebra if you just learn a few tricks and study past exams.  But if you do want to learn the material, Bayer teaches it.  And explains it in several clear, logical ways in addition to the standard book method.  I'm not a math major, but I was interested in the subject and he treated me with nothing but respect.  Then again, I went to class and didn't try to cheat.\nOverall, Prof. Bayer's a odd but pretty entertaining guy.  I'd go to class wondering what today's very quotable random aside would be.  If you need to take the class, you can get by without a huge effort.  If you're interested in the subject, you can learn it in his class's much more relaxed atmosphere, provided you don't depend on either just the lectures or just the text.  \nWorkload:\nTwo midterms and a final.  And yes, one problem can really cost you.  But if you budget your time, Bayer has explained the material well enough for you to know several ways of checking each problem.  So it's definitely possible to leave the test room and be confident you got 100% (and be justified in that confidence).  And you'll know what you're getting into; he gives plenty of info about the tests.  \nVery reasonable curve for the final grades, which you can get the gist of from his website for previously taught courses.  No homework, which can be a good or bad thing, depending on your perspective.  \n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "June 21, 2004",
            "review_content": "\nDavid Bayer's class was a colossal waste of time, and he is an arrogant, pompous, condescending, disorganized mess as a professor. First of all, his presentation of the material is sloppy. He's so busy trying to sneak in stupid anecdotes from his time as a student or making political jokes (which are always innappropriate, but particularly irritating when you disagree with him), that he wastes a good portion of class time. He often makes mistakes on the board, and if you don't catch them then you're screwed. He also teaches the class as though he's talking to himself, as he scribbles away on the board babbling as if he's just working out a problem and we're not even there. He is so annoying, and the lecture is so useless that if you are going to class, you'd better double up on the Ritalin beforehand. Because of this, few people go to class, and fewer can sit through the whole lecture.\nHomework is assigned, but not collected or graded and solutions are not posted. Same goes for sample exams, for the first midterm he didnt even post any samples; later on, samples were available but solutions were not. Basically, you learn nothing in class, you have no indicator of your progress or problems (since there are no quizzes/homeworks or solutions) until the individual exams, at which point 30-40% of your grade is at stake. While the material appears to be easy, Bayer is very sneaky and bitter about the lack of attendance in class, so he purposely creates traps for people to do poorly. Even if you walk out of an exam confident that you did well, don't be so sure. He also arranges the curve so that about 5% (maybe more) of the class will receive an F as a final grade (keep in mind, that Fs are irrevocable once assigned).\nDavid Bayer does not use his class to teach Linear Algebra (Lord knows you don't learn it!) but to make a point. He thinks that since no one comes to class (which wouldn't be the case if he wasn't too lazy to grade problem sets or give quizzes) he should impose some consequence after the fact. While he doesn't know who anyone is in the class, he deals out this punishment blindly just to make an example of his students. He even came up with a complex scheme to catch people cheating which he devoted an entire semester to; perhaps if he put that much effort into teaching the course none of these other schemes would be necessary. He also has no respect for anyone who is not a math major (or something close to it). Overall, a stupid class, a horrible teacher, and an overbearing hidden agenda...avoid it like the plague.\nWorkload:\nNothing...2 Midterms & 1 Final. Don't be fooled though, the small workload comes out of laziness, which more than spills over into his teaching style.\n"
        },
        {
            "course_name": "Surfaces and Knots",
            "review_date": "May 17, 2004",
            "review_content": "\nThis class is no longer going to be one of those that you can skip everyday. Dave says he only wants to teach people who are passionate about the subject which was evident this semester on the final. He designed a section that was impossibe to figure out by going to the last few classes and was evident that most people couldn't figure it out because almost everyone went from getting a perfect score down to B's. So be warned. I'm sure Groups and Symmetry is going to be like this too now. \nWorkload:\nDon't really know how he is going to restructure the class but it sounds like its still going to be 3 tests but now you have to go to class\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 12, 2004",
            "review_content": "\nIf someone says that Bayer is a good teacher then he/she does not know anything about linear algebra. Instead of teaching the concepts and the different approach of linear algebra Bayer teaches you faster ways to solve his easy problems. He posts previous exams which are almost identical to actual exams. I really did not learn anything about linear algebra. However, I got an A in this class. I never understood the material conceptually but I was able to solve his problems. More precisely, easy class, bad teacher, you'll learn nothing about linear algebra. If you want to learn something go with the other section. If you want an A take his class. \nThere are no homeworks. So be careful with the exams because if you screw up one question in one of the exams that may cost you almost a grade.\nWorkload:\nNone. Just learn how to solve the practice problems. Don't waste time going to lecture\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "April 20, 2004",
            "review_content": "\nBest professor I have encountered at Columbia thus far (and ironically enough, he is a Barnard professor).  He knows linear algebra inside out, and for that reason, he is able to teach it so well. He knows exactly how to approach the material and make it interesting. I really wasn't expecting to enjoy this class, but it turned out to be GREAT! Without a doubt, if you are planning on taking this class, do what you can to take it with Prof. Bayer.\nWorkload:\n2 Midterms (30% each) and 1 Final (40%). Homework is listed on syllabus but never discussed or handed in. Neither midterm was \"easy\" but if you just take the time to do the practice exams (and you understand how to do each question), you will get an A- at the very least. Suggested preparation for exams: do the assigned homework problems (at least some of them) so that you know what you're doing when you try the practice exams. Once you do the practice exams, retake them a couple more times to make sure you understand how to do each problem (5 problems per midterm/practice exam). If you can do the practice exam 100% correctly, you should be able to do the same on the real exam.\n"
        },
        {
            "course_name": "Groups and Symmetry",
            "review_date": "December 11, 2003",
            "review_content": "\nDave is really great. This class was the easiest class I have taken at Columbia, but at the same time, I probably learned more than in any other math class I have taken.  His lectures are really straight-forward and entertaining.  He is always open to student questions, and different ways of thinking, and likely to give you extra points on an exam that you don't really deserve.  \nWorkload:\ntwo midterms, final. all direcly covering what was taught in class. he posts all possible versions of the exam on his website before examination. so there really is no excuse people no to take this class.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "July 02, 2003",
            "review_content": "\nBayer's class is pretty straightforward. The two midterms and final are pretty much the same as previous years, which are online as practice tests. Minimum stress class, with easy grades.\nWorkload:\n2 midterms and final. No homework to hand in.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 31, 2003",
            "review_content": "\nProfessor Bayer was great!  He has really clear and organized lectures that runs through the material he stresses.  There are also plenty of sample/practice exams for midterms and the final, and the format is essentially the same for the real exams, just different numbers.  He's pretty easy with grades, so if you have a choice, definitely take a class with him!  He's clear and organized, and speaks in a language that students actually understand, is easy at grading...etc.  I mean, what else can you ask for?  \nWorkload:\nassigned problems from the book, but not collected... no quizzes, just two midterms each worth 30% and a final that's worth 40%.  pretty light.\n"
        },
        {
            "course_name": "Surfaces and Knots",
            "review_date": "May 29, 2003",
            "review_content": "\nthis man and this class were excellent. easy grade aside, the class is really interesting for visual thinkers (ie:me).  the format of the class makes the exams easy to take. i recommend going to class at least sometimes.  it's refreshing to go to a class where the professor is actually interesting, engaging, and where his passion for the subject is written in chalk all over his face. ;)\nWorkload:\n3 exams\n"
        },
        {
            "course_name": "Surfaces and Knots",
            "review_date": "May 29, 2003",
            "review_content": "\nthis man and this class were excellent. easy grade aside, the class is really interesting for visual thinkers (ie:me).  the format of the class makes the exams easy to take. i recommend going to class at least sometimes.  it's refreshing to go to a class where the professor is actually interesting, engaging, and where his passion for the subject is written in chalk all over his face. ;)\nWorkload:\n3 exams\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 31, 1999",
            "review_content": "\nBayer's great. His tests are fair and reasonable; they test the material you've learned, and if you do the homework, you'll do well on them. Don't be afraid to improvise -- you'll get credit for wacky ideas, as long as you write them down. His lectures are clear, coherent, andenjoyable, and he draws a LOT of pictures, which is really great in a Calc class. He's enthusiastic, friendly, and interested in his students. Take a course with him if you can -- it's definitely worth it.\n"
        }
    ]
}