{
    "prof_info": [
        {
            "prof_name": "Kelly O'Donnell",
            "prof_id": 10721,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 20, 2013",
            "review_content": "\nVery good seminar leader. Kelly is enthusiastic about the material and generally friendly towards her students. For some reason  I felt like she didn't really like me too much, but I got a good grade in the class so maybe it was all in my head.\nHer seminars were a very good recap of what went on in lecture, though going to lecture isn't a bad idea. She posts the seminar slides on Courseworks, which I would recommend using as a summary of the extensive lecture slides.\nKelly is definitely a hard grader, but your final grade is curved against the rest of your seminar so it doesn't really matter in the end. She is nit-picky about certain details on your homework and only gives out check-plusses for essentially perfect homework assignments. This can be pretty frustrating if you spend the time to do the homework thoroughly but only get a check. Still, the number one thing I would recommend for doing well in the course is taking the time to do the homework instead of copying it. You can fall behind in the course if you copy the homework too often, however laughable falling behind in FroSci may sound. Also, the homework reflects the exam material very well, so it's good practice.\nKelly's also fairly nit-picky about the specifics of the term paper, so I would recommend handing in the optional rough draft to get her feedback. I banged out the paper the night before it was due and got a less than desirable grade. My paper was fairly well-written but missed some of the specific things she was looking for.\nLike many others, I feel that FroSci is a pretty useless course, but Kelly did a more than decent job covering the material and engaging us. Even when the class was lethargic and unresponsive in the morning, she never really get frustrated with us. Overall, one of the better FroSci section leaders you can get.\nWorkload:\nWeekly homework assignments (standard for every FroSci section) - these were due on Fridays by noon, which was annoying if you went out on Thursday night. Still, I handed mine in late many times and I don't think she ever deducted points.\n4 announced quizzes, one every 3 weeks (one for every unit). Pretty straightforward, covering basic concepts.\nMidterm and final - she grades these harder than other section leaders (her class averages were below the overall FroSci averages) but again, your grade is curved against your individual seminar to account for these discrepancies in grading. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 20, 2012",
            "review_content": "\nKelly is a great seminar leader! I really enjoyed her class overall and she's incredibly knowledgeable, engaging, and fun. She's a little quirky but she really loves science and I think she does a good job of using that to engage the students. \nShe does a really good job filtering out the Frontiers lectures so that you only learn the most important material (which also prepares you well for exams). I went to like four or five lectures the whole semester but attendance to seminar is mandatory and if you pay like half attention during seminar she goes over everything from lecture but is quicker and clearer. \nSeminars are split up (as all of them are, I think) into an hour of lecture recap and then an hour of activity. I only knew a couple people in my seminar but there was a good dynamic in that some were interested in science and there was always some good discussion going on if you were into that. If you weren't it was a good time to check out after listening to the lecture recap for a while. She lets you use laptops and that's a good way to pass the time because two hours of seminar is really really unnecessary. \nBefore I was in her class I heard that she was a harder grader than the other seminar leaders, and I definitely agree. She is very precise with the WIAs and things that are handed in, in general, and she's also a harder grader on exams. However, definitely note that each discussion section is curved separately to take into account the different levels of grading and expectations of each leader. As long as you beat the curve you're in B+/A-/A territory. \nAs far as exams go, I would definitely say that Kelly prepares her sections very very well for them. She has review sessions where she goes over key questions and the classes in general cover everything you need to know from each lecture. Also if you don't spend the whole semester copying WIAs and you work with others on them you won't need to spend much time studying for the exams at all.\nMake sure to hand in your paper for the rough draft due date so she'll take a look at it and give you some feedback. Like most things she knows what she wants out of the paper. Also, she never gives pop quizzes--she always tells you when each quiz will be so that you can prepare. And I don't think they count for much at all. \nAs a critique of the course as a whole, I definitely felt that the class got useless sometimes. But I also learned a lot about statistics (which will be valuable I think no matter what) and also have a higher degree of basic science knowledge. So I hope that they keep improving the course (one concept they really need to fix are the scientific habits--so useless).\nWorkload:\nWIA each week that can take some time especially if you haven't been paying attention in class, but make sure you do them and know why you got things wrong b/c that will help a lot with exams\nQuiz for each unit (so four total)\nTechnically there's reading but no one does it\nOne midterm (20%), one cumulative final focused on the second semester (40%) - they are not awful but the cheat sheet doesn't help that much because you run out of time if you spend too much time looking for answers\nOne final paper (5-6 pages?) where you critique a scientific paper - annoying but you can do it in a night if you need to\n"
        }
    ]
}