{
    "prof_info": [
        {
            "prof_name": "David O'Connell",
            "prof_id": 3476,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to American Politics",
            "review_date": "September 06, 2012",
            "review_content": "\nHe is phenomenal. He really cares and wants to make sure the students understand the reading. He goes over each and pulls out the main points that students need with discussion and other mediums (powerpoints, news articles, etc.) Additionally, he's really entertaining and makes re-learning facts/history that American students have learned about five different times in elementary/middle/high school interesting. Take him if possible. If not, be happy with whatever second best TA you are stuck with.\n\nWorkload:\nclass reading. a short, rare outside reading\n"
        },
        {
            "course_name": "Introduction to American Politics - Discussion",
            "review_date": "January 06, 2010",
            "review_content": "\nDavid is a fantastic TA. First of all he is truly passionate in his field and has a great deal of knowledge in the subject. He is very down to earth, approachable, and kind. It is clear that he is a TA because he is looking to work with students and goes to great lengths to stress how available he is to meet with them. Having met with him a few times I can say he is extremely helpful and invested in ensuring that every student is given the opportunity to do their best work. He prepares students well for the test and is a far grader. He literally makes himself available till midnight the night before major assignments. He also brings food to discussion, which is not particularly painful at all (at times it is good), which is rare given the shenanigans that often occur in huge lecture sections. He is one of the best TAs I have had in three years in the university and I cannot say enough good things.\nWorkload:\nA few assignments, midterm, final, readings (sometimes allowed but he explains them very well)\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 13, 2009",
            "review_content": "\nDavid is an amazing TA - do your best to get in his section! He puts a huge amount of work into being a TA and it's clear that it's his top priority. Discussion sessions were well-organized, and David always tried to inspire debate and ask for people's opinions on the material (though participation was not graded). He's also a very cool and friendly guy, and gets really excited about the material (which is not easy to get excited about in an intro course like this). \nFor exams, David is totally on your side and tries to help you succeed, offering multiple review sessions/office hours and a review sheet. His grading is pretty fair. Highly recommend! \nWorkload:\n(course-wide) 3 very straightforward exams; usually one chapter of textbook reading per week accompanied by shorter theory-type articles; attendance at discussion sections. \n"
        },
        {
            "course_name": "Introduction to American Politics - Discussion",
            "review_date": "January 10, 2009",
            "review_content": "\nDavid is an incredible TA and if you have the chance to get into his section, do it. For a student who does most of the work, is cordial and can get down to incessant pop culture references, David will do anything in his power to help you out. He will meet with his students anytime and respond to e-mails and questions promptly. Also, his review sections the night before the midterms and the final were godsends. \nHe is dedicated, knowledgeable, personable and a great teacher. \n\nWorkload:\nA good amount of reading, but easy to keep up with most of it with good time management. Understanding the main textbook is a breeze if you go to the lectures (Phillips basically just recaps the chapter in lecture). 2 midterms and one final that is exactly like the midterms. \n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "July 16, 2008",
            "review_content": "\nDavid is by far the most dedicated, knowledgeable, and approachable TA I have had throughout my years at this institution.  It is obvious he considers being a TA a priority, as he returns emails and papers quickly and is always available, even outside of his office hours.  He is a fair grader for papers, and holds a thorough, organized, and detailed review session that is invaluable for the final exam.  On top of all of that, he is a genuinely nice guy.  If you have the opportunity to take a class with him, definitely do it.   \nWorkload:\nOne take-home midterm, one research paper on the topic of your choice, and one in-class final (all graded by the TAs).\n"
        }
    ]
}