{
    "prof_info": [
        {
            "prof_name": "Duygu Ula",
            "prof_id": 13734,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Subverting the Script",
            "review_date": "February 25, 2021",
            "review_content": "\nProfessor Ula is an excellent educator; I cannot recommend her enough. She brings such a close level of thought into the way she facilitates classes and teaches writing in a way that is wholly unpretentious. She makes reading theory accessible and drafting essays a do-able and deliberate process, all while doing what (I think) FYW is really meant to do: forge community for Barnard first-years. She genuinely cares and it shows.\nWorkload:\nShe is a fair and reasonable grader. The workload is manageable and well-spaced out.\n"
        },
        {
            "course_name": "Subverting the Script",
            "review_date": "January 09, 2021",
            "review_content": "\nProfessor Ula is super sweet!! Honestly, I was probably not the best student in terms of work ethic and participation, but I never felt any resentment, but only understanding. Her feedback is SO helpful on your papers. In terms of her course, I enjoyed what she picked for us to read for the most part.\nWorkload:\n3 papers in total, varying length\nSome exercises\n"
        },
        {
            "course_name": "First-Year Writing: Legacy of the Mediterranean",
            "review_date": "December 03, 2020",
            "review_content": "\nThe sweetest professor ever, I cannot recommend her enough. Not only can you tell that she deeply cares about her students, but she also is a great professor. Discussions in her class were always engaging and she does a good job letting the conversation flow while also correcting mistakes. Really helped me improve my writing and was a very fair grader. If you listen to her advice you will get an A\nWorkload:\n3 papers\nWeekly short response HW graded on completion\n3 books to read, light reading overall\n"
        },
        {
            "course_name": "First-Year Writing: Legacy of the Mediterranean",
            "review_date": "November 18, 2020",
            "review_content": "\nI can't praise this class or Professor Ula enough. I wasn't sure if I would like taking a class less rooted in the classics than some of the other FYW classes, but I ended up loving it. Part of that was due to the texts - we read some short poems and prose pieces, then Virginia Woolf's Orlando, and finally James Baldwin's Giovanni's Room, which was incredible. We also read an essay each from Judith Butler and Edward Said. But it was mostly due to Professor Ula. She expertly facilitated class discussion so that it was always fruitful and never fell flat. She lectured very little, instead asking us questions, giving us brief historical context, and explaining parts of the essays and books that we were unsure about. Without her and the class discussion, I would've been completely overwhelmed by the essays especially, but I came out of the class with a strong grasp on two seminal critical theories.\nProfessor Ula was also extremely helpful in giving feedback, particularly in office hours. She kept a good balance between encouraging and pointing out areas of improvement, and gave specific, constructive advice. One meeting, all I had was a tangled collection of ideas for my essay and she helped me formulate it into a concrete essay plan.\nAside from academics, she's also just a really nice person. One class, she noticed that I had been quiet and down, and afterwards pulled me aside to ask me if I was alright. It might sound small, but it shows that she really cares about her students. I don't think I've had as kind a professor before or since.\n\nWorkload:\nA close reading essay, a theory essay, and a research essay, the first two of which you revise after receiving Professor Ula's feedback. Relatively light readings, although Orlando readings were sometimes a little longer. Around 6 short response papers / exercises plus drafts and peer reviews.\n"
        },
        {
            "course_name": "First-Year Writing: Legacy of the Mediterranean",
            "review_date": "April 29, 2020",
            "review_content": "\nLoved this class, loved Professor Ula. She's a really great teacher - she was always really approachable and took the time to help my writing improve and also to encourage me to take risks that paid off really well. She ran classes well too, even online. Definitely the best online professor I had. The books are all great books, especially Giovanni's Room, but Orlando is also a fun and wacky read. Can't recommend her enough as a FYW prof. \nWorkload:\nThree essays, all of which you get to draft before submitting, and some writing exercises. \n"
        },
        {
            "course_name": "First Year Writing: Legacy of the Mediterranean - Queer/Migrant",
            "review_date": "November 18, 2019",
            "review_content": "\nTo preface this, my interest is not in the Queer/Migrant field, but I had a very late registration time, so I didn't have much choice for FYW. This course follows the same curriculum as the traditional FYW: Legacy in the Med. courses, but with completely different books. We read \"My Cat Yugoslavia\" (a little out-there), \"Orlando\" by Virginia Woolf, and \"Giovanni's Room\" by Baldwin. Out of these books, I only enjoyed Baldwin. \nProf. Ula is very approachable, understanding, and kind. She is easy to contact. She does a good job facilitating student participation in discussion. However, I felt that the analysis of \"Orlando\" was weak, which was why I didn't fully enjoy reading it. \nOverall a fine class. If you're interested in classics though, take Breyer or Lynn.\nWorkload:\n3 books, 3 essays, theory texts, intermittent shorter essays graded on completion -- very manageable. Fair/easy grader.\n"
        }
    ]
}