{
    "prof_info": [
        {
            "prof_name": "Bernard Salanie",
            "prof_id": 2639,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Principles of Economics",
            "review_date": "January 03, 2015",
            "review_content": "\nLiterally atrocious.\nHe just spoke gibberish and incorrectly did Algebra for the entire lecture. I often found myself trying to take his sentences and reconstruct them in French, vainly hoping to make sense of his lectures.\nHe blasts through difficult concepts and does not do a good job of explaining simple ones which be belabors for days.\nDo not take this class.\nI feel robbed of a semester of my life after this-- I did not learn economics at all but got an A- because everyone else was just as clueless.\nnot even reading the textbook helps.\nWorkload:\n1 problem set per week (takes an hour) and optional reading (which is also minimalistic)\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 10, 2014",
            "review_content": "\nProfessor Salanie creates questions for problem sets and exams that can not be solved through the use of the textbook that has been assigned. This would not be so great of a problem if he was able to clearly articulate the material during lectures, but instead he uses circular reasoning to come to questionable solutions (if he ever does reach a conclusion). He is very difficult to follow and does not appear to come in to class with any specific plan of what he wishes to express, which would explain why he often goes off on tangents and rarely defines even the most basic of concepts. Although Principles is apparently supposed to teach us the basics of economic theory, the class taught by Salanie is entirely based off of math and its applications, which is very difficult for those of us who have no background in economics which would allow us to understand the underlying concepts. Essentially, the only people who do not seem to be having extreme difficulty with the course are those who have already taken both macroeconomics and microeconomics courses already. \nThe TAs are extremely competent, and fully responsible for saving my grade. Because the textbook is so far from the material that we are tested on, the only useful resource for the class are the TAs.\nWorkload:\n11 problem sets (10 of which count towards final grade) which the TA's occasionally have difficulty solving/ determining what is being asked.\n1 midterm, 1 final. \nAll graded problems are written by Professor Salanie; it is generally difficult to determine what is being asked, and reading the textbook has helped solve only 2 of the 11 problem sets. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "September 07, 2012",
            "review_content": "\nTrue that his lectures are not the best. But certainly, he is a very nice guy and cares about his students. Because of bad culpa review about him, i hesitated to take his class at first, but i ended up getting A. and it was very easy A. Although the class' average Midterm grades was not good, he really generously curved, so actually the average was B+, which is not bad at all. All being said, I think it was definitely worth it, considering how little efforts I put in there, and the grade I got. Even if he is not a good lecturer, he does go over important things, and you can study your own that part. \nWorkload:\nweekly problems sets - a bit hard. But you can ask TAs and they will answer you so well. \nMid term- Even though a bit hard, very generously curved. (even 60 % was around B+ or B)\nFinal - Not hard at all. Easier than homework problems and he already gave very good hints at the last lecture.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "November 21, 2011",
            "review_content": "\nProfessor Salanie is not a bad teacher, but his class was completely uninspiring. He goes over the material in an organized and coherent fashion, but he speaks in a low voice and tends to backtrack so much that it's hard to stay interested. To be fair, he does try very hard to go over all the relevant material, and to his credit he gets the point across. But be prepared to read all the chapters in the book (which is very helpful, get it) mainly because you will be too bored in class to pay attention. \nHis midterm and final are straightforward, but more math-oriented than the other Principles of Economics teachers. It's simple math, but he comes up with bizarre scenarios at times that will leave you questioning every single answer you write down. In the end the grading is fair - both the midterm and the final averaged in the 65-75 range and were curved to a B+, I believe.\nAll in all, this is an okay class if you have taken high school economics and know most of the basics, and just want to get Principles of Economics over with. But if you are looking for an engaging lecturer that will nurture your interest in the field, find another professor. \nWorkload:\nNot bad at all. Weekly problem sets from the textbook that won't take you more than an hour. Midterm and final. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "November 30, 2010",
            "review_content": "\nProfessor Salanie's Principles of Economics class is perfect for students who've already taken AP Micro/Macro-Economics and who want to skip lectures every now and then without missing out on the content of a good lecture.\nSalanie's lectures tend to be bad. Really bad. He has an accent and has serious communication issues, making basic economic principles much harder to comprehend that they should be.\nYou're much better off reading assigned chapters and using the book's examples in order to learn the principles the course is meant to teach. However, if you want an \"A\" in his class, you should take a very close look at how he chooses to frame questions within his own problem sets (which you're going to have to do for homework anyway), since he structures his exams in pretty much the same style.\nSalanie has a penchant for bringing in mathematics, algebra, and (more than anything) impossible hypothetical situations (for example, in one infamous homework, he asked us to draw the graph of a monopoly firm where the Marginal Revenue curve equaled the Demand curve) where he has no business doing so. Many problems in the homework are for the most part unintelligible and (if you read the book) leave you feeling as if you did something wrong.\nWhere other classes averaged 80-90 percent on their midterm, Salanie's class averaged 70% with a standard deviation of 14. Enough said.\nAvoid this professor if you have a serious interest in economics. If you absolutely have to take a class with him because of your schedule, my only piece of advice would be to read the book, understand its concepts, and forget about anything Salanie said in his lectures when you move on to Intermediate.\nWorkload:\n1 Problem Set every week, handed in on Thursday. Usually has only 2-3 question and at most takes 30min to do. Also assigns 2-3 sections for reading every class (1 hour's worth of reading at the most). Very easy.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 15, 2006",
            "review_content": "\nAbsolute WORST professor IÂ’ve ever had.  The other reviews area right on the point.  This guy is not a teacher, you will not learn much if anything from his lectures.  He cannot make the point (however simple) across during his lectures.  His notes are poorly written, difficult to read and interpret, and worst of all have nothing to do with the homework assignments, which in turn have nothing to do with the exams.  \nHe does not teach out of the book and I suspect he has never even read the book himself.  Homework assignments are directly related to the book.  Exams are very difficult, require above average mathematical proficiency, have little to do with conventional and practical economical concepts, and are graded very harshly.\nIf you take this class you will end up with a poor grade, hours of frustration, and a feeling like you did not learn much if anything worthwhile.\nI took macro during the same semester with Prof. Sala-i-martin who was one of the best professors IÂ’ve had in recent times.  Luckily he salvaged my interest in economics.\n\nWorkload:\nEasy problem sets (usually consisting of 3-4 questions).  Don't be fooled though, these problem sets have NOTHING to do with exams.  Impossible midterm and harsh final, both graded unfairly.  Even if you're average in class you WILL end up with a poor grade.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 13, 2006",
            "review_content": "\nThis is a professor who likes to teach theories and concepts but not explain them with examples. You have to pay close attention during lectures to really understand exactly what you need to learn. You'll find yourself not taking any useful notes in lectures because 1) Professor Salanie offers his powerpoint presentations after lectures online and 2) no concrete examples are offered in class and the main points are already in the book. This means you will have to struggle to remain focused on the material during class.\nThe homeworks are generally very short and only act to make sure you understand the concepts. I felt that the homeworks might be more appropriate for the Principles of Economics course. On the other hand, the exams take you into detailed calculations that the homeworks might not have prepared you for.\nHowever, the recitations make up for what the professor and the homeworks don't teach: the TAs show problem solving techniques and work through detailed examples during recitations.\nAfter taking this class, I felt that I have learned the microeconomics concepts AND can work through problems at this level.\nWorkload:\nGroup homeworks are easy - less than an hour's worth per week, but recitation is an implicit requirement for this class. You WILL need to go (an hour a week) to be prepared for the exams.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 05, 2006",
            "review_content": "\nWORST TEACHER EVER, HIS LECTURES ARE DISORAGANIZED, AND UNLESS YOU ARE EXTREMELY INTERESTED IN COMPLEX MATH WITH LITTLE REAL APPLICATIONS, YOU WILL NOT ENJOY THIS CLASS. His notes don't make sense, he doesnt write any of the practice midterms or the homeworks, and leaves it all up to the TAs, which go purely by the book, so if you read the book youll have no prolbem with the homeworks or the practice exams, but they have no bearing on the material covered for the actual tests, which are filled with variables and proofs and a lot of conceptual puzzles with no practical problems, the as actually worse than the midterm, and even after realizing he was achieving poor results, he still curves to a B-.\nWorkload:\nharldy any work, but its hard to do well because the class is not oreinted toward the testing.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 22, 2005",
            "review_content": "\nthis man has no place in the classroom. he is the absolute worst instructor I've had here.  his teaching style is all abstract (and mostly irrelevant).  he solves no in-class examples.  all the other warnings *cough* \"reviews\" ... are dead on.  please do not take this class.  you are not the smart kid that will be the exception.  do not take this class.  it is a complete waste of time, and you will do terribly.  this man made my junior year miserable.\nWorkload:\neasy hws (4 mc) that are somehow graded so harshly.  impossible midterm, completely unfair final.  class curved to a C.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 21, 2005",
            "review_content": "\nBy far the worst teacher I've ever had since kindergarden!!!!!\nHe might as well teach his classes in french; I asure you it would not make a difference. The final was just as bad, if not worse, than the infamous midterm, discussed by all other reviewers. I attended Susan Elmes' class a fiew times to see the difference and I must say she is really great! For one she speaks a language you could follow. I think Bernard Salanie has ADD because he is constantly distracted by his own jokes that only very fiew people understand; I think only French people actually. His classes are organized as if he was drunk twenty four hours a day. In short, as he might understand Economics, his understanding is almost completely locked into his own head. Maybe he wants to gard all his knowlege so that noone can threaten his superb status in the world of Economics, or maybe he simply wants to discurage people from studying it.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 21, 2005",
            "review_content": "\nBy far the worst teacher I've ever had since kindergarden!!!!!\nHe might as well teach his classes in french; I asure you it would not make a difference. The final was just as bad, if not worse, than the infamous midterm, discussed by all other reviewers. I attended Susan Elmes' class a fiew times to see the difference and I must say she is really great! For one she speaks a language you could follow. I think Bernard Salanie has ADD because he is constantly distracted by his own jokes that only very fiew people understand; I think only French people actually. His classes are organized as if he was drunk twenty four hours a day. In short, as he might understand Economics, his understanding is almost completely locked into his own head. Maybe he wants to gard all his knowlege so that noone can threaten his superb status in the world of Economics, or maybe he simply wants to discurage people from studying it.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 14, 2005",
            "review_content": "\nOutside of class, Professor Salanie seems like a nice guy.  He makes funny jokes, he has a cool accent (French), and he's very intelligent.  He has an affinity for computers, the internet, and technology and seems to know quite a bit about technological economics.  I think I could have been friends with Salanie, had I not taken this class ...\nUnfortunately, this class was a nightmare.  Salanie's one of those teachers who understands everything crystal clear, but seems to have tremendous difficulty conveying his ideas in a logical and understandable manner.  After Salanie finished writing things on the board, it nearly always looked like Grafitti -- completely disorganized and incoherent.  Salanie tried to rectify that by producing powerpoint slides (that he later made available online) but those ended up even worse.  The slides eventually stopped; my guess is he got lazy.\nI have never missed a lecture, and throughout the course of the semester, Salanie only performed (1) practice problem, and that was a week before the final.  Salanie's lectures were very abstract and I had difficulty applying what he said in class (which made sense at the time) to the problem sets.  The book we used was very clear and had excellent practice problems, but it became useless when trying to solve the problem sets or when preparing for the midterm and final.\nPlease, please, please, for your own sake, do not take this class with Salanie.  It's very difficult, and you will not learn anything.  Take the class with another professor -- it will be difficult no doubt, but at least you will learn something.  This class was a waste of time.  It was the most frustrating class I've ever taken.\n\nWorkload:\nVery easy problem sets.  Impossible midterm.  EXTRA-impossible final.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 14, 2005",
            "review_content": "\nthis guy is TERRIBLE. his lectures were terrible. all he talks about is how much better france is than the united states.  the midterm was terrible. the average was a 45 because none of the problems had anything to do with what he taught in class. this is coming from someone who has a good grade in the class, but i just hate this man. he is a terrible professor.\nWorkload:\neasy weekly problem sets which have nothing to do with the midterm or final, very hard midterm and final\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 11, 2005",
            "review_content": "\nProf Salanie reminds me of a cynical, self deprecating, French version of Santa Claus.  A telling example: on our last day of class he solved the practice final on the board and was stymied by one of the earlier problems (throughout the semester we only used variables, no numbers, so this was new to him) and instead of finding the real answer he said it was \"six-hundred and sixty six, my favorite number.\"  Sideways glances ensued among the class.  After rolling along through the rest of the test we got to the last question, which Bernard solved in his head and, you guessed it, the answer was in his French accented words \"six-hundred and sixty six, the SIGN OF THE BEAST!,\" and because the precise answer was 2/3 * 1000 he drew bunches of 666s after the decimal point across the board for effect.  It was surreal, but in a jovial way because Bernard was smiling.  \nDespite not doing problems on the board on a regular basis, Bernard does teach the economic concepts well, albeit in an often mathematically challenging way.  However, this is micro, not macro, folks - there's supposed to be a lot more math, and that's not his fault.  Bernard does intersperse his calculus with interesting stories and case examples (I hope you like bananas), so the class is not a total snooze.  I'd take him again over Elmes.\nWorkload:\nDifficult midterm, but don't worry, you still get the Columbia curve!  My stat midterm mean was a 55 and no one was up in arms about that.  Why pick on Salanie?  Problem sets went from easy to hard (perhaps because people complained they weren't prepared for the midterm...be careful what you wish for) and count for 25% of your grade, which is high.  Final remains to be seen.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 08, 2005",
            "review_content": "\nProfessor Salanie is a terrible teacher in all respects.  You will learn very little, will do terribly, and will become frustrated.  Avoid this man at all costs.\nThis is Professor Salanie's first semester at Columbia (he is from France).  It appears as though Susan Elmes, a notoriously difficult though instructional professor, is his mentor.  As such, Salanie's exams are incredibly difficult given that students do not have the required knowledge to answer the exam questions.  Even worse, as if to spite students, Salanie curves his class to a B-/C. \nSalanie's problem sets are very simple, most likely because he doesn't want to spend time creating them.  Problem sets are usually 4 multiple choice questions straight from the textbook.  However, DO NOT BE FOOLED, the exams are impossible (the mean was a 45 / 100).  Salanie, perhaps used to French grading systems, was upset to notify the class that he \"may have to curve the exam\" so that some students are able to pass.  That was stated with complete seriousness.\nOutside of the class, Salanie seems like he could be a cool guy.  He says some pretty dirty jokes (the French kind of dirty -- VERY dirty), is very intelligent, and like to bike ride.  Unfortunately, he has no teaching ability, is a very strict grader, and has no problem if half the class recieves a C or less.  What upset me most was that the class was unfair.  Oh yeah, and Salanie is totally inaccessible.  Don't even bother e-mailing him or stopping by during office hours -- he won't be there.\nIf I could do this semester over, I would have taken Elmes.  Yes, Elmes is a very difficult Professor, but if you're going to get a mediocre grade anyway, at least learn something...  This class was a complete waste of everyone's time.\nWorkload:\nEasy homeworks (that end up not counting because everyone gets 10s) 25%, Midterm 35%, Final 45%.  Final grade curved to B-/C.  Final and midterm grade determine course grade.  Both are impossible.  You will not do well.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 03, 2005",
            "review_content": "\n**AVOID AT ALL COSTS **\nThis semester was Professor Salanie's first at Columbia.  It appeared as though Susan Elmes, a microeconomics professor notorious for difficult exams and intense homework assignments, was Salanie's mentor with this course.  However, unlike Elmes, Salanie lacks teaching ability.  At least Elmes teaches you the required material beforehand -- she teaches you how to defend yourself before the attack.  With Salanie, it's just an ambush.  Imagine the most impossible midterm ever without the knowledge of how to solve the problems!  Complete frustration.\nSince Salanie is french, and france is known for its mostly good food, here is a recipe to create a Salanie from scratch:\n100 LBS LAZINESS.  This includes incomplete nonsensical powerpoint presentations, a hodgepodge of chickenstratch notes with \"m\"s that look like \"n\"s so it's even more difficult to know which variables he's talking about and lectures that start 10 - 15 minutes late because he is unprepared.\n25 LBS DISINTEREST.  Salanie would rather have kidney stones than teach a class of American students.  Each class is bombarded with jokes on why french are better than Americans.  Salanie has never solved a single practice problem during class.  There are no examples.  When questioned about the lack of examples, Salanie responded, \"I am not here to teach you what is required to pass the exams.\"\n25 LBS MISLEADING HW.  His homework assignments are so easy (mostly 4 multiple choice questions)!  This is due to the massive laziness (see above).  Most students complete them during class.  Unfortunately, these assignments have nothing to do with the lectures or the textbook.\n20 LBS IMPOSSIBLE MIDTERM.  Salanie was shocked when the mean of the midterm was 45 / 100.  But how is a student to expect impossible problems when the practice midterm (which he snatched from Elmes because he was too lazy to make one himself) and the homework assignments were so easy?  Even worse, the midterm was curved to a B- / C.  It really couldn't have gotten worse.\n20 LBS INACCESSIBILITY.  Don't even bother trying to get in touch with Professor Salanie.  It's an uphill battle.  He is never in his office during the required hours and when one does show up, he becomes disgusted by \"stupid questions.\"\nDIRECTIONS: Place in a classroom, don't do anything, and hope something comes out.\nThe concepts of microeconomics are easy.  But for some reason, the professors of the department (Salanie, Elmes, etc ...) insist on making it difficult by bringing in other subjects and tedious assignments, at times unnecessarily, to add difficulty.  Most of the concepts of the course involve simple equations, finding intersecting lines and differentiating; but, that becomes tedious and difficult when you involved 3+ variables, functions that you don't know how to differentiate (logarithmic derivatives, laplace transforms, etc ...), and other terms you've never encountered.\nIf you're going to take this course, take it with Elmes.  Yes she's a difficult teacher, but at least you'll learn something.  This entire semester has been a waste of time.  This man stole my youth.\nWorkload:\nVery easy homework assignments.  Impossible midterm with terms and variables the class has never seen before (mean was 45 / 100) curved to a B-/C.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "November 29, 2005",
            "review_content": "\nAvoid this man at all costs. The earlier review is dead-on in all of its criticisms. \nSalanie is far and away the worst teacher I've had in the econ department.\nWorkload:\nEasy problem sets 1x per week that usually take less than 30 minutes. Very difficult midterm, with questions that had not been taught at all in class.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "November 07, 2005",
            "review_content": "\nThis semester is Salanie's first semester teaching.  I'm currently enrolled in his microeconomics class.\nSalanie's lectures are generally incoherent and poorly organized.  He seems unprepared for lecture (even when he has lecture slides), he does not explain concepts clearly, does not solve problems in class, and occasionally loses track of the material in the middle of teaching.  But that's of no consequence, because most of the time he's teaching an irrelevant proof that he does not expect the class to know anyhow. \nThe lectures do not closely correspond to the material in the textbook.  This lack of correspondence has been problematic for two reasons. \na) his lectures have been unhelpful\nb) his midterm questions were rigorous mathematical problems.  He did not solve problems of this nature in class and did not assign similar problems for homework.   The fact that the textbook was not adequate to prepare students for a midterm of this nature compounded the problem. \nThe mean on Salanie's midterm was a 45, which reflects his poor instruction rather than the difficulty of the exam.  Mathematically inclined students performed much better than the majority of the class, especially those who had taken already taken macroeconomics.  I scored above the mean, but with the appropriate resources i could have done considerably better. \nSalanie recently indicated that he plans to curve the class around a B-. \nMost likely, Salanie will remain the poor teacher he currently is.  However, as he adapts to Columbia and to teaching undergraduates he may learn to organize his class more effectively and conduct it more fairly.\nWorkload:\nWeekly problem sets, not especially time consuming. Midterm, final.\n"
        }
    ]
}