{
    "prof_info": [
        {
            "prof_name": "Kimberly Marten",
            "prof_id": 2361,
            "total_reviews": 58
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 17, 2016",
            "review_content": "\nProfessor Marten was one of the hardest working professors. You can just tell that she loves teaching and she is genuinely passionate. I think it also helps that she has other stuff going on in her professional life beyond teaching polisci so her life is dynamic which also makes her lectures dynamic. She definitely is engaging and makes you question on how you used to perceive global politics. In short, she's great lecturer.\nBut did I like her teaching style? Perhaps, but not entirely. First of all, you can clearly tell that she's biased. And for me, that was neither a bad or a good thing, but some people don't like it when professors are biased - so that's for you peeps. \nSecond of all, she goes through the frigging powerpoints so quickly. You look down and write some stuff, look up and she's talking about a completely new topic. And the way she writes all her notes up on the slides psychologically encourages people to write down her notes word by word when that clearly was not the case; hence many people end up just rewriting notes and not listening. At least I fell into that trap in the beginning. And she goes over rather complex ideas so quickly that you might lose track of what is being discussed at times, but if you do her readings ,you should be fine. But overall, her teaching style was just too quick for anyone to really copy down her notes - I would encourage instead listening more carefully and writing scarcely (although she doesnt post her powerpoint...) \nHer midterms and finals were definitely tough. Not the easiest bunch, although if you tried, you could get an A- at least. \nBut don't treat this as an easy \"A\" just because it's an \"introduction\" class. Also the grading can get subjective because different TAs grade differently - just gotta pray! \n\nWorkload:\n100~150 pages of reading a week - not required to read all tho. \n2 midterms - take home papers\n1 final - take home paper \nAll three were pretty challenging but not end of the world hard. \n20% participation, 20% 1st midterm, 30% 2nd miterm, 30% final. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 18, 2016",
            "review_content": "\nWorst professor at Columbia. Does not care about her students or your grades. Allows TA's to use different grading system for your papers, which your entire grade consists of. Totally biased. A waste of time. DO NOT TAKE ANY CLASS WITH THIS WOMAN!\nWorkload:\n3 Papers, which will be grade unfairly. Discussion sections which are a waste of time, but mandatory. You will learn nothing useful in this class\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "August 27, 2015",
            "review_content": "\nShe is a great lecture, but definitely biased. Her lectures were clear. She speaks quite quickly. Seems like the majority of the class got B/B+ grades. A huge survey that tends to turn historical over political. \nWorkload:\nREADINGS. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 16, 2013",
            "review_content": "\nProf. Marten is the business. Super into her lectures, and clearly cares about teaching well. Had heard a friend complain about her lecture speed but she must have worked on that because it wasn't really a problem for anyone in my class. She's really adamant about drilling in the theoretical framework, but its good because it would be a really unpleasant surprise to figure out in the last week of class that you have no idea what's going on on that front. Coherent syllabus, relevant readings. She brought in a former Navy gunman to give a first-hand account of the Cuban Missile Crisis, which was really interesting.\nThe class is huge, and carries all those disadvantages, but its damn solid. Jervis may be the bigger name, and he may be a good lecturer as well, but I really doubt I would have gotten as much out of the class if he taught it.\nWorkload:\nA lot of readings if you do them all. But, they're not all necessary. In fact, she recommends to read them after lecture so that you know which parts are most important and which parts to skim. Standard course load for a poli sci lecture, if not a little light. Two midterms--one in class and one take home. One in class final.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 24, 2013",
            "review_content": "\nThis is a phenomenal class. For one, Marten is just naturally an incredibly engaging lecturer. Yet, in addition to knowing the material inside and out, she has a lot of real world experience that in many cases really brings the material to life. I would highly recommend this class for anyone even minimally interested in international politics...by the end of the class, you will have a new appreciation for the subject. \nShe's also really great outside of class. I highly recommend going to her office hours if you have any questions. She's very friendly and open (even with her 1000 Harvard degrees!). \nOne minor thing that I didn't like that much about the class were the weekly sections. They were not very productive, and I never really felt like I left having learned anything. The TAs are great, though!\nWorkload:\nNot impossible, but not easy. There are ~40 pages of reading per class before the first midterm (in class), and then about ~80 pages of reading per class afterwards. Mostly articles. The second midterm is two short papers (5 pages each), and the final is two in-class essays. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 17, 2012",
            "review_content": "\nIf you get the chance, TAKE KIMBERLY MARTEN. I swear, she's unbelievably good. She's so, so engaging, and really, really intelligent. She alone makes this class worth it, and what we study is also really interesting, so it's a win-win. She has a lot of real world experience and a lot of passion that she applies to the class. There is a lot of intense reading, but if you do it you'll be right. Seriously, take Marten. She's spectacular.\nWorkload:\nQuite intense. Not easy, but doable.\n"
        },
        {
            "course_name": "Russia and the West",
            "review_date": "February 02, 2011",
            "review_content": "\nProfessor Marten is a wonderful, engaging, and very intelligent professor. Her lectures are great, and I don't think anyone's tried to argue to the contrary here.\nThat said, there are problems with this course, though I would disagree with the nature of them as mentioned in previous reviews. Here's my take:\n1) As for accusations of bias: Professor Marten certainly does not pull punches when it comes to Russia. That said, I didn't really see much bias in her assessments. The Soviet Union WAS an economic disaster. Contemporary Russia IS extremely corrupt. Violent nationalism is prevalent. Money and power are concentrated in an extremely small elite while the masses live in abject poverty. You can certainly sugar coat these facts, but that's not the job of a political science professor.\n2) In terms of speculation: I agree, this was a big part of the course. On the other hand, the Russian government is pretty closed to scholarship, and often speculation is necessary. I didn't always agree with Professor Marten on her conclusions, but she did always preface her speculations with \"this is pure speculation.\"\n3) In terms of needing to agree with her: I didn't experience this.\n4) In terms of workload: I really don't know what the previous reviewer is talking about. Most political science classes assign 200+ pages a week or more plus an in-depth research paper, mid-term, and final. This class was nowhere near that workload.\n5) Class structure: The real flaw of the class is its weak attempt to integrate itself into political theory. IR theory is discussed and oversimplified in one class period, and theory is never again mentioned. \nWorkload:\nNot bad at all. 100-150 pages of reading a week, a position paper (7 pages), short reaction paper (2 pages), essay-based midterm and final for which you get to bring a cheat sheet.\n"
        },
        {
            "course_name": "Russia and the West",
            "review_date": "January 05, 2011",
            "review_content": "\nAs the previous reviews said, Professor Marten is an extremely engaging lecturer; she is also, no doubt, an extremely intelligent and likable person. However, there are a few problems with this class you have to consider before taking it. First of all, her style can get overly enthusiastic at times, which makes her lectures look more like, in the words of one of my classmates, a 'puppet show'. Basically, a major part of her lectures, especially on the modern-day Russia, are based on pure speculations and emotions (believe me, she gets really, really dramatic at times). A lot of what she said was over-exaggerated or simply not true. Now, here comes the second problem with her course - she claims that you don't have to believe and endorse everything she says, but if you dare to express an opposing opinion in class, she will make you look like an idiot. Now, the third problem, which might be a problem just for me, is that the basic message of this whole class is that Russia is scary, corrupt, and horrible and the West, and, mainly, the USA, is righteous, free, and all-together wonderful. No crime that was committed by the Russian government can have alternative explanations, while all the crimes committed by the US government can be justified by 'mistake'. 'conspiracy theories', or 'negative public opinion at home'. Finally, the fourth problem with the course is its incredible amount of work, especially in the second part of the course. I know that many of the students, including myself, simply gave up on readings in order to be on time with all the papers, speeches, and negotiations for the project. Now, that all being said, I also want to add that the project itself was lots of fun and I would say that it made the whole class worth taking. Another good part about the course was its TA - Israel - probably the best TA I have ever had! He is incredibly smart and approachable. If he ever becomes a professor in Columbia, take his class!!! In terms of Prof. Marten, she is nice, and I got a good grade in the class, which is why I don't regret taking it, but I would advise to take all those things into consideration before taking this course.\nP.S. Oh, and, once again, if the class was supposed to give us an unbiased information and alternative views on the political situation in Russia, than why we spent most of the class talking and reading about Putin (including the whole 300-page on his reign) when Medvedev, who was only briefly mentioned both in class and in the readings, has been Russian President for almost three years now!!!!\n\nWorkload:\nHeavy, even for a pol sci course. The second part of the course is disproportionally heavy. two exams, two papers connected to negotiations, 2 3-minute speeches, one extra credit short paper (optional).\n"
        },
        {
            "course_name": "Russia and the West",
            "review_date": "December 25, 2010",
            "review_content": "\nI took this class after seeing her silver nugget, but honestly I'm kinda let down. Granted, her lectures are indeed amazingly engaging. It's been a long time since I've been able to pay attention for an hour and a half's worth of class, but she manages to keep your attention on even the most boring topics (oil politics in central asia, georgia's developing economy, etc). Rarely did I watch the clock.\nWith that said, this class was closer to history than political science. The first half of the course is devoted to learning Tsar chronology and how it impacts modern Russia. The second half is a bit more relevant, but still frustratingly centered around events. Marten shies away from applying theoretical frameworks to these events (Jervis, as a counterexample, really employs theory).\nOh, and it also felt like getting anything higher than a B+ was impossible. On the midterm, she told us she didn't give anyone an A, and only a few A-. Take it for what you will.\nWorkload:\nMidterm exam, simulation position paper, in-class simulation exercise, simulation reflection paper, final exam\n"
        },
        {
            "course_name": "Russia and the West",
            "review_date": "December 07, 2010",
            "review_content": "\nAfter reading all of the terrific reviews of this course and the professor I was quite frankly disappointed. I was also surprised at her silver nugget status.\nPrevious reviewers neglected to mention the inability to engage with the professor over course material either in lecture where students dread the result of asking a question or at office hours where she only ever returns your question back at you. Despite her enthusiasm for the subject, Professor Marten seems like a very angry person and I was disappointed to have that directed at me on a number of occasions when asking clarifying questions in lecture or at office hours. A course like this has to be more than well put together PowerPoints and understandable readings. Even though it is not a seminar, the professor should still do better in terms of interpersonal skills and engagement with students if they are here to teach.\nHer inflexibility on class policies was admirable in its consistency, but extremely frustrating for a student who really was trying their best in this course. Students are only human and we merely ask the same of our professors.\nWorkload:\nReasonable, but you're entirely on your own unless the TA is enthusiastic.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "October 19, 2009",
            "review_content": "\nI took both, the Introduction to International Politics and Russia and the West course with professor Marten and I strongly, STRONGLY RECOMMEND HER COURSES!  \nWorkload:\nAbsolutely bearable. If you took CC or Lit Hum, you can handle this! The reading she picks are absolutely amazing!\n"
        },
        {
            "course_name": "Russia and the West",
            "review_date": "May 25, 2009",
            "review_content": "\nI don't really need to write this review; this Professor's amazing reputation precedes her, and rightly so. But there aren't any new Russia and the West reviews, so here goes. Professor Marten is the best teacher I've ever had, period. She knows exactly how to represent all the different sides of an issue without losing her razor-sharp analysis in the process. When it comes to the complexities of Russia's foreign policy with its neighbors and the West, that is really saying something. She accomplishes this by staying very methodical in her explanation, using a ton of history to deeply explain each conflict, and then breaking down the various explanations, usually according to the major IR theory paradigms. \nThe course is likewise arranged very logically, starting way back the Tsars and then covering the USSR in its entirety before moving on to the Yeltsin and Putin regimes. Even if you don't agree with her on every point, that's okay, and in fact encouraged by Prof. Marten, to the extent that you can back up your views with sound theoretical understanding and use, and that you know a majority of the facts about which you speak. She will challenge you in discussion (15 minuts at the end of each class), no matter what position you take, so be prepared to learn to really hold your own and make more cogent arguments. This is a very big teaching priority for her. Debate is not only allowed, but encouraged.\n Finally, it was really fun to take this class because Professor Marten made it fun. At the beginning we made predictions about what we thought the next months had in store for Russian politics, and at the end it was a blast to get our responses handed back to us and discuss as a group how we fared. There was also a simulated energy summit that we spent a good part of the last weeks' time preparing for and which was incredibly useful for helping us understand probably the most complex of Russia's current geopolitical conflicts: the Ukraine gas crisis of Jan. 2009 and its aftermath. Take this class!\nWorkload:\n2 challenging exams, lots of interesting reading that you don't have to do all of (but it helps)... 7 page policy memo, 5 page retrospective, participation in the simulation was a big portion. In short, very doable.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 30, 2009",
            "review_content": "\nI liked her, for the most part.  She is very enthusiastic, which made it easy to sit through and take notes during the solar flares that are her lectures.  Expect to take notes as fast as you can for the entire hour and fifteen minutes, every time.  \nShe presented each of the competing theories objectively.  It was clear that she was trying to make the students pick a theoretical lens of their own rather than try to sell them on hers.  She was usually spoke very intelligently, yet accessibly, about most of the topics.  \nThat said, as a former veteran I was usually disappointed by her treatment of war and warfare.  I understand that she was speaking primarily to a group of 18-20 year old women with virtually no understanding of military issues (the class being taught at Barnard), but for me it came off as dumbed-down.  I agree with those who say that military issues are clearly not her area of expertise.  \nI also agree that she seems to relish tearing students apart when they challenge her viewpoints to any degree.  It didn't seem to make any sense. She may not realize how she comes across to her students when she puts them down in this way. \nThe discussion section was a waste of time.  This might have been because of my TA's style, I don't know.  He usually reiterated the theoretical frameworks and then asked the students to explain how the historical events in question should be interpreted through those frameworks.  There was very little interaction between students; it was all student-TA.  I had a difficult time understanding the theories this way.  I learned much more during informal study sessions that a group of my friends put together.  \nWorkload:\nyou already know. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 19, 2009",
            "review_content": "\nI'll keep this short and sweet: TAKE THIS CLASS! \nMarten is an incredibly good professor. My most enjoyable class because the material was related to everything we've experienced in life, politically, and all the significant parts of world (Okay, U.S.) history that make up our understanding of Foreign Relations. \nHer lectures follow a strict outline with LOTS of material to cover. She comes off as a bit of a bitch at first, but it has more to do with her not having time for individual questions in her already packed lectures, she's actually quite nice. More about this: Don't ask a question in the middle of lecture, write it down and save it for the end of class or she'll let you have it. Trust me, I know.\nThe most important thing you can do for yourself is put together a reading group after the first class. Go to the front of the class and just grab 3 other people to get started and then pull the rest from your discussion group. (Whoever sounds smart.)\nThe class was not hard, just intense, but the subject matter makes it interesting. If you are interested in 20th century history or politics in general then THIS CLASS IS A MUST. I have nothing but good things to say about it. Those who didn't like the class should have never taken it in the first place and then focused their complaints on Marten or \"it's too hard, wahh\" - They can all suck it. This class kicked ass!\nWorkload:\nREADING: Much reading, but if you get 4 smart people together you can divvy up the readings and email summaries to each other. My group had ten people, it worked out so that we only had to do 20-40 pages of reading once every two weeks. Piece of cake. Aside from that, most of the pieces are really good, about terrorism, the cold war, cuban missile crisis... very cool.\nMID-TERM/FINAL: The midterm and final are pretty much the same thing, she weights them evenly, but you get more time for the final. You also get to bring a double sided cheat sheet that you write or print out yourself. If you have good enough eyesight you can fit all your notes onto two pages. \n\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 11, 2009",
            "review_content": "\nAbsolutely fabulous class, but be prepared to work really hard. I really disliked Marten's lecturing style at first, but after a few classes she really grew on me. Be warned: she goes extremely quickly and crams as much information as possible into each lecture. I've never taken so many notes before for any class. She's not really a \"performer\" in that she doesn't move around a lot or go out of her way to entertain you, but she is incredibly knowledgeable and her lectures are clear and easy to follow. The material was great and covered everything from WWI/II and the Cold War to Jihadism, peacekeeping and economic issues. My one warning is that the work load was enormous. Granted I'm a relatively slow reader, but I ended up spending 6-8 hours per class on the reading. A significant portion of the reading was not touched on in class and we were expected to master it for the exams. The readings themselves were interesting and not too hard to master, but the sheer quantity of them was a real challenge for me. Overall, I highly recommend the class, but be prepared to work!\nWorkload:\nSeveral articles (and an occasional book) per class. Mandatory weekly discussion sections (really helpful!) Two midterms and a final. Can have a cheat sheet for each exam. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 25, 2008",
            "review_content": "\nMost brilliant and engaging professor coupled with the most interesting and though provoking material. What is the result? The best class I ever had in my life. However, there is always a cost, and the one you pay taking International Politics with Marten is high. Expect to have as much reading as all your classes put together. We probably read anything from 180-300 pages a week, and most of it was very dense material, which for you to do well o the tests you had to have a very good grasp of them, be able to refer back to them, and analyse them when writting you definitions and essays on the midterm and the final. Also you will find that there is not nearly enough time to say all you have to say since all of the issues are very complex,and there is always so much to consider when you are dealing with diverse and convoluted world.So yes, you do need to do the reading. But that being said you have choices on what to write on the test, so if you were able to only do the majority of the assigned reading for the week, you will be fine. In addition to that the reading and the information you are dealing with is so interesting that to a certain extent the readings became pleasurable. Even if you are not a poli-sci major the information you will learn from this class is extremely pertinent to today's world. The class is almost a very very very fast paced summary (with analysis of course) of every major international conflict since world WWI with emphasizes on the most recent issues. So the breakdown of the class is basically 1 section focusing on the main approaches to international politics, analysis of WWI, WWII, and the Cold War. The 2nd section focuses on political economy, EU, international trade, and 90s conflicts. While section 3 focuses, American supremacy, Afghanistan, Iraq and North Korea.\nWorkload:\nAs I said, 180-300 a week of articles and essays + one 200-300 pages book + one 400 pages. You will have about 1 week to read each book, but they are not essential for the test; the articles are the most important. 2 midterms and 1 final which is not cumulative\n"
        },
        {
            "course_name": "Colloquium: Political Violence and Terrorism",
            "review_date": "December 15, 2008",
            "review_content": "\nHer style of teaching is, at first, very off-putting because she is very combative and challenging and won't accept any vague comments. If you can remember every theory you read in the weekly readings and can connect them to your own points, you'll be successful in discussion, but otherwise, she will hate you and confront you every chance she gets.\nThat said, I learned SO much in this class - we read the true basis of all security and terrorism theories each week and you really learn so much about the subject using different case studies (Afghanistan FATA region, Chechnya, Israel/Palestine). Also, the structure of the course is very well set up to cover every aspect of the subject. She is incredibly brilliant and the subject matter is incredibly relevant today - TAKE THIS COURSE!!\n\nWorkload:\nAbout 200 pages of reading per week, weekly discussion posts about the readings and questions, three 3-5 page papers on days you choose, final 25+ page paper due at the end.\n"
        },
        {
            "course_name": "Colloquium: Political Violence and Terrorism",
            "review_date": "February 23, 2008",
            "review_content": "\nI loved International Politics with KM, but this class was a disappointment. KM was her usual amicable if intense self, but the material was clearly outside of her realm of expertise. Maybe it's because I had high expectations going into it, but I felt that the readings and discussion were analytically superficial and intellectually lightweight. \nCase studies ranged from OK to really good, but the theoretical readings she assigned were just bad. \nThere's a lot of great/classic material on terrorism and sub-state violence that's out there, but don't expect this class to cover it.\nIf you want KM at her best, I say take Russia and the West. \nOtherwise, to get a better grip on what you'd expect this class to cover, I recommend Gottleib's Terrorism and Counter-Terrorism or Bett's War, Peace, and Strategy. \nIf I had to do it over again, I wouldn't have wasted my time.\nWorkload:\nMandatory weekly reading responses and a final 25-page research paper. She grades the papers harshly but gives you a lil' boost with the participation grade.\nIt was my first colloquium, but everyone commented that it was harder than others they've taken. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 13, 2007",
            "review_content": "\nTo begin with, WOW!!!! Prof. Marten is, in my opinion, absolutely fantastic! She is brilliant, passionate, and generally keeps her own opinions to herself or, when she does tell us what she thinks, makes sure we know it is her opinion and not universally regarded fact. She is an engaging and entertaining lecturer who takes a few questions for the class each session, and you will want to pay attention. She goes through an enormous amount in each lecture, 4-5 pages of notes (both sides) per class, but it is well worth it. The workload is not too bad. 2 essays of 5-7 pages using only the course readings as research, and a final. There is also a discussion section. There is ALOT of reading, but if you like politics you will find many of them interesting, though somewhat tedious. I truly love Prof. Marten, certainly in comparison to Robet Jervis, who was so boring in the one class of his that I attended that I walked out with a headache because I fell asleep so much! If you at all interested in the vital topic of international politics, I highly encourage to take this class with this wonderful professor!\nWorkload:\n2 essays 5-7 pages each, Final. LOTS of reading, but can be interesting, though tedious. Discussions section required. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 28, 2006",
            "review_content": "\nShe's an extremely engaging lecturer but bring your laptops...she talks a mile a minute and crams a ton of information into each lecture.  Her lectures summarize the readings for you but those summaries won't be enough for you to bs your midterm essays so you'll have to do some of the readings.\nWorkload:\nShe assigns a shit load of readings but you don't have to do them all to do well on the two midterm essays & the final.  For each midterm essay, you have a choice between two essay prompts.  For the final, there are a few (4ish) IDs, one essay similar to the midterm prompts, and another essay about a political science controversy.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 27, 2006",
            "review_content": "\nI firmly disagree with a previous posting about this being a boring, high school-esque class. This is the most comprehensive introduction to the diverse and complex field of int'l relations you will get anywhere. It is an introductory class that covers a huge amount of information. You couldn't ask for a better expert in this subject. Professor Marten is member of the Council on Foreign Relations, has written op-eds for the NY Times, and was embedded with Canadian Forces in Afghanistan. She is well organized, and writes an outline for each of her lectures at the beginning of class. She is very clear of what her expectations are for her papers and exam. PAY ATTENTION to her directions. There are two 5-7 page papers that must be completed in one week, and a fair final that has 7 ID terms and two essays. You must do the readings! If you can't read all of them, at least skim the ones you can't get to, because for both the essays and the final you have to be able to synthesize, analyze and make comparisons of the readings at a much more sophisticated level than if you try to get by with just her lectures. To do well on the essays, make a strong argument, back it up with examples from the readings, define your terms, and address the opposing argument. Professor Marten does not shy away from controversy, and you will cover issues of terrorism, the Jewish lobby debate, and globalization. She is very engaging, even when presenting dry information. She is incredibly smart and funny, and very accessible. I wish her upper level classes were in areas that interest me, because I would love to take her again. I can't emphasize what a fantastic person she is. My one critique would be that she doesn't spend enough time addressing radical or progressive  frameworks and really relies on the dominant conservative and liberal frameworks. \nWorkload:\n2 5-7 page papers and one final. A decent amount of reading that MUST BE DONE in order to get a good grade. My suggestion: form a study group where each of you in responsible for one reading a week and swap summaries. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 14, 2006",
            "review_content": "\nFirst off, everything you've heard is true: Prof. Marten is a fantastic teacher. She knows her stuff and she's really really good at explaining things. But there is one curious thing: I think she can be really malicious sometimes. Why? I'm not entirely sure. It's like she's afraid of being challenged or something, which doesn't make sense because a) she's the dept. chair, and b) everyone really respects her. But occasionally, it seems that if you ask a question that she doesn't like or point out an inconsistency in what she says, she just gets crazy and uncomfortably forceful. Very bizarre.\nExample: Prof. Marten gave somewhat confusing instructions on the midterm (citing is optional and not so important, she said) then came down on us after the fact and said \"you didn't cite enough!\" An international student with a heavy accent then asked a \"but you said...\" question and she just ripped into him, the poor guy. \nI'm hoping these episodes are due to some sort of exogenous factor because I like Prof. Marten so much that I don't want to attribute it to any fundamental character flaw. \nSo I say this: Prof. Marten is the best Intro to IR teacher out there, but just watch yourself. She has a darkside that is hard to explain or understand. \nWorkload:\nHeavy. Lots of reading, all of which is required. Harsh grading on the midterm. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "October 17, 2006",
            "review_content": "\nSTOP.\nReality check: this class is about as close to a high school course as i have ever been at Columbia.\nIf you want a teacher who has created a simple version of history she is completely convinced is true and infallible, who will present it to you in an oustoundingly clear, outlined way, and ask you to skim a couple of articles for her class every day...congratulations.  This is your spot.\nYou can sit with all the barnard groupies in the front row and worship Marten, as if she doesn't have a high enough opinion of herself.\nThis class is easy.  It doesn't require thinking.  It requires the ability to nod and take notes and take whatever your professor says to be the word of God.\nIf you want to think for yourself, ask questions, challenge yourself intellectually...then skip it.  Its not worth your time.\nIf you know anything about 20th century politics or international affairs, RUN.\nIf you enjoy asking questions, SPRINT: Marten takes any questioning of her 'infallible' theories as a personal affront.\nI have never written a poor review of a professor.  She never gave me a bad grade.  She never was a jerk to me, personally, in class.  I just watched as she shot down questions from anybody who had a solid background or half a brain.\nDissapointing.\nWorkload:\nIf you know how to skim, this is an hour and a half - per night course.  Go to lecture every day.  This is a lighter load course.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "October 16, 2006",
            "review_content": "\nShe should run for President!  \nWorkload:\nTough. Lots of reading, 2 challenging midterm essays and a final. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "March 04, 2006",
            "review_content": "\nFrom what I hear, hers is one of the few engaging intro-level poli sci classes. \nand because it's an intro class, it'll cover a lot of what seems like just facts. \nThis was my first poli sci class, and i felt like she did a good job of teaching us various models of looking at international relations. However, you need to have had some sort of a global perspective to begin with in order to follow a lot of what she talks about; if you've never made it a point of reading international news, then don't bother taking up a space in this class.\nThat said, Prof. Marten is a really engaging lecturer. She puts an outline up on the board at the beginning, which is incredibly helpful if you end up zoning out for a while. Definitely shop for a good TA, because the discussion is the only way to pick up on important points if you don't do all the reading. \nWorkload:\nHeavy and sometimes boring reading, 2 papers (dont expect to do these last minute), and a final.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 31, 2006",
            "review_content": "\nProfessor Marten is the professor to take if you are really interested in International politics and want to know as much about it as possible.  If international is your subfield, you should definitely take her.  If you are forced to take this class, or want an easy class, this is NOT the prof for you.  She gives you A TON of information, and her class is challenging.  The workload is actually pretty standard for a poli sci class (which is a lot, but that's poli sci).  Even though the class is more challenging than it is with other professors, you will walk away an expert in international politics.  She is extremely clear and informative and her class puts you in a much better position for your classes in the future.  I walked away exhausted, but knowing that my work was worth it because I actually learned and understood so much.\nWorkload:\nEveryone is saying it is a lot.  It is pretty standard.  Getting a good TA is VITAL though, because the readings are really important and you do need to understand them.  Shop around for TAs because it'll make your work worthwhile.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 15, 2006",
            "review_content": "\nThis class is extremely daunting.  There are roughly 65 readings (books & journal articles).  The lectures are just as daunting with Marten speeding through a flurry of names, dates & terms & often going overtime.  There are 2 midterm essays that you have a week to write but the questions are so vague & you have so much material to include within 5-7 pages that you will spend 6 days just staring at the question & not knowing how to write it.  Those are graded quite harshly by the TAs who are also overwhelmed by the material as evidenced by their struggle to cover at least a small part of the readings in the weekly discussion sections.  You will also be dumb-founded about how to study for the final, which is cumulative.  However, the exam is pretty straightforward & final grades are relatively generous.  Marten herself comes off as very scary & intimidating at the beginning of the semester, but she is pretty willing to take time to answer questions in class, as long as they are relevant, & by the last class, she had really won me over.  \nWorkload:\nHuge.  About 65 book & journal readings.  2 5-7 page papers. 1 final exam.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 04, 2006",
            "review_content": "\nIs she brilliant? Absolutely. \nIs she an good professor? Not in the least.\nShe spits out information and calls it teaching. Her lectures have no meaning, it's a jumble of dates and facts that she thinks are important.\nThe only worthwhile class was when she discussed her time in Afghanistan. For once, she taught something instead of reciting her notes right from the page. \nThe interesting material of the class is ruined by her inability to teach.\nIf anything, she's completely overrated as a prof. Like I said - the woman is intelligent for sure. But she is a horrible professor. \nWorkload:\nlots of reading. two take home midterms and a final. grading is fair, depending on your TA (i loved my TA - best part of the class).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 19, 2005",
            "review_content": "\ni read the same reviews you just read, but listen up...i waited til my senoir fall semester to take intro to interpols with this woman BECAUSE of culpa. granted, as a polisci major, it was either this or comparative so i didnt have much of a choice....\nhere's my point: perhaps its because her reviews or so spectacular or that i waited with baited breath for three years to take the class...but ITS A HUGE DISAPPOINTMENT. \nher lectures are FULL of information but she talks so fast that by the end (which tends to be five minutes after the class shoullllllld have ended) everyone's head is spinning. \nshe takes questions, yes...but only when shes not a lecture behind. a rarity.\nthe class is fine. take it if you have to. which lots of you do i think. but its not great. and the reading is ridiculous. \nand here i am, polisci major, a senior!!, and its my most stressful class....do yourself a favor and check out your other options. \nthis ladys not doing me any favors.\nWorkload:\ntons of reading. its insulting. two midterms, a final. nb: the second midterm hits at thanksgiving and youll all be asking eachother WHY youre taking a \"midterm\" right before december.  \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 15, 2005",
            "review_content": "\nThis class is AMAZING. Although the semester isn't over, so far I am very pleased. Professor Marten is an expert in her field. Her lectures are clear and concise as well as her outlines that she posts on the board before class. A variety of topics are covered, most of them VERY interesting. I have never learned so much so quickly. Given that-a lot of reading. An insane amount. But it is doable. \nI highly recommend this class. As a freshmen, it might by kind of indimidating with a lot of poli sci majors sitting next to you. However, it is worth it.\nWorkload:\nA LOT of reading. 2 take home midterms. I'm not going to lie, difficult to really do but if you spend enough time on them, you might get a pretty decent grade. Usually in the B range. Also...the final. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 02, 2005",
            "review_content": "\nShe is amazing and every lecture is riveting.  \nWorkload:\n2 papers and one final, ridiculous amount of reading but itÂ’s not necessary to do it all.  She says she hardly gives out A's most end up with B's.  \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 18, 2005",
            "review_content": "\nKimberly Marten is a great teacher and lecturer.  Her lectures are clear and structured, making them easy to follow.  She even writes an outline on the board before beginning the lecture- a rarity in college ( It shouldn't be) which proves very helpful.  She is very approachable as well.  The midterm essays require the readings and thought, but aren't too dificult.   The final exam was straightforward, but you need to do the reading.  Overall, an excellent course!  \nWorkload:\n2 take-home midterm essays, 1 final exam, lot of reading\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 12, 2005",
            "review_content": "\nAs far as political science lectures go, especially for an introductory course, Prof. Marten offers probably one of the best classes at Columbia.  She is thoughtful, organized, and interesting in her lectures and tries to get everyone thinking by balancing theory and application.  She also tries to keep the class current, which is refreshing, by discussing terrorism and how recent events have  modified IR theory .  Take her class.  She cares about her students and it shows in her lectures and on the syllabus.\nWorkload:\nTwo 5-7 pg papers (she cares about grade distribution so you have to really work for an A), final, section attendance (quality entirely dependent on TA)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 07, 2005",
            "review_content": "\nI disagree with the person who reviewed before me. I think International Politics is a fine course to take first semester, as long as you do the work. This class is not one to take if you don't plan on doing the reading or showing up to class. I read everything (with the exception of a reading out of one of our books which I couldn't understand), and didn't have a problem with it.  And on top of it, she's an incredible professor. She is approachable (although I will admit to being a little scared of her), keeps her own opinion out of her lectures, and is uniquely prepared to teach the class. \nThere was one class spent just going over the time she had spent embedded with Canadian Peacekeepers in Afghanistan. I HIGHLY recomend this class, especially if you are interested in IR or majoring in political science.\nWorkload:\na good amount of reading, some of it rather complex; two take home essays; final\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 03, 2005",
            "review_content": "\nI took this class as a first-year student, in my first semester, which I do not recommend. I started out behind and never quite caught up. The reading is EXTENSIVE, but even Professor Marten says not to do it all. I suggest you find some reliable friends and divide up the readings, summarize them, and trade notes. (I didn't do this...but I should have). I actually enjoyed learning from some of the readings, so I did all the ones that interested me. I found the class fascinating, but overwhelming too. It was history, current events, political theory, and application all at once. I do think she's an excellent lecturer. She's open to questions and some discussion even though she has a ton of material to cover every class and there were like 150 students. You can tell she's liberal, but she tries to present both sides of the story and each theory, which I find admirable. I talked with her during office hours a couple times, and she was very approachable after my initial anxiety. She's friendly and pleasant, and very smart, but human too. She was kind to grant me an extension when I was sick. I found that she was fairly available to her students, although she did travel because of her new book. I learned more in this class than any other. It made me think, and it definitely made me work hard. It was almost traumatic, but very worth it if you can handle a class like this. The TAs weren't too good about going over the material thoroughly. Just keep up and be smart about it, but don't expect an \"intro\" course.\nWorkload:\n2 complex take-home midterm essays and a fair final except that i found the last, long essay difficult (you have to be able to apply what you learn)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 02, 2005",
            "review_content": "\nIt was with much trepidation that I took this course, after having read the reviews on here that go on and on, but honestly, it wasn't that bad.  It does have a lot of reading, but it's nothing unmanageable; I was rarely caught up, but I eventually found time to read almost everything (and I'm pretty lazy, not some anal star pupil).  As for the whole power bitch thing, yes, she definitely enjoys being in control of the class -- she once called out a guy who was reading a magazine during class in front of everyone -- but whatever, that's just the persona she's trying to build.  If you talk to her in person, she's actually pretty sweet -- the barrier is definitely maintained, but I'm sure that if you visited her during office hours a few times she'd take it down at least somewhat if you were truly interested.  Anyway, enough psychological analysis; the class is pretty damn good, you learn a lot, and if you do the work, you should be fine.  However, I'll end the review with a note of warning: I got a B in the class when I expected a B+/A-, a situation that's still unresolved.  Oh, and the TA's were all terrible, which is too bad, because good TAs would have been appreciated.\nWorkload:\ntwo take-home midterms that are really more papers, two potential extracredit film essays, one huge-ass in-class final with short IDs and two essays (!)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 31, 2004",
            "review_content": "\nInternational Politics with Professor Marten is not for the faint of heart. The course covers tons of material, ranging from the international political economy to security keeping in Bosnia and Kosovo to the World Wars. The midterms (two 5-7 page papers and a sit-in final of 2 essays and 4 IDs) required significant review and a very good understanding of the readings (of which there were a ton). I was surprised this was listed as an 'intro' class because, in my opinion, it clearly assumed the student held a lot of previous knowledge about international affairs. Those who have taken a relavent class (ie, economics, previous polisci classes, maybe even a modern world history course) will probably fare significantly better than those without much experience, \nOn the flip side, Professor Marten is an excellent lecturer who keeps things moving quickly. I went to every lecture-she's that good. Some complain that she's ostentatious, but she can back it up (writing for the NYT, publishing her books, political connections, etc).  For those of you who like challenge, this is a class that will really make you think (no, honestly) and make you decide what your political views are. \nThe discussion sections are not particularly helpful, but go to them anyways to secure the A- (for 10% of your total grade) Professor Marten guarentees you if you go to all of them. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 31, 2004",
            "review_content": "\n\"Now, I speak so fast, my own mother can't understand me...  but i'm not teaching a class on international political strategy, analysis, and history.\"\nProfessor Marten speaks so fast.  If you take a pause, you will find yourself amongst 150 other students furiously scribbling notes, head bent down, trying to keep up.\nThe analysis and subject matter are fascinating.  But Marten speaks so fast that it is like trying to understand all the credits at the end of some TV show while the credits are minurized and jam packed and scrolling speedily off the screen.  Such is the constant heart-pounding agitated state you will be in through out class.\nby the time you realize what kind of missle someone used somewhere, she's on to the next shrimp net in south america.  \nThere is so much minute detail... Marten FAILS to actually TEACH the material.  Instead she reads without character- from notes like some stiff and awkward stage-frightened monotone actor...\nShe has lots to say and teach.. but she goes through info like a time line, again, really failing to at least give you somethinking time to put all this info into some cohesive and worthwhile form.  \nSMART LADY- no doubt... but JUST because these Professors WRITE a BOOK... doesn;t mean they know how to teach.\nAlso: probably with good reason... she's a bit of a snob.  in my opinion she doesn't give much care to whether students walk away more knowledgeable or more educated in world affairs... she talks, you listen... and I guess we should all be grateful... I mean, she's written books.\nWorkload:\nTWO vague bland Midterm essay topics... and a comprably pointless EXAM.... don't think... regurgitate.. though the info would be nice to let sit in, you won't be given the chance, because she'll move on so fast you'll forget the end of the sentance you were just writing.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 30, 2004",
            "review_content": "\nKimberly Zisk Marten is an amazing lecturer and is clearly extremely intellegent. \nHer class is very interesting and up to date, but is extremely hard. She only gives 15% of the class A's which makes it extremely competitive, especially for an intro class. The reading list is enormous and seems neverending. A LARGE LARGE portion of your time will be devoted to reading endless artlicles, and stressing over finishing all the homework. Marten also speaks at an extremely fast pace which causes problems when taking notes, but you learn to adapt pretty quickly. Overall, this class is great, but sooooo much work. DO NOT TAKE AS A FRESHMAN!\nWorkload:\nSO much reading, more reading, ughh....neverending reading....2 midterms essays and one final\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "December 29, 2004",
            "review_content": "\nAmazing senior seminar professor, very helpful with structuring a schedule for your thesis and making sure that you are on the right track at the right time. If you don't want to be able to save your thesis for the last minute, Professor Marten provides the perfect combination of guidance and structure for this international politics thesis writing seminar.\nWorkload:\nSenior Thesis, final draft of first chapter due right before christmas break, final draft of entire thesis due at end of the year.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "August 31, 2004",
            "review_content": "\nProf Marten is the best professor I have had.  Her lecturers are never boring and she always includes a question/answer section that helps turn her huge seminars into lively discussions.  That said this class is hard with a lot of readings and notetaking, however the work is well worth it and Marten is readily accessible to students questions/problems.  The opportunities for extra credit don't hurt either.  \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 13, 2004",
            "review_content": "\nGreat lecturer--very organized and gives a clear and comprehensive presentation--she'll have you writing for the full 75 minutes.  She gets a little too caught up in \"professors across the street\" but her skills are up to par.  Reading list is quite extensive but you don't need to do more than skim the articles.  She scared a lot of people in the class by saying she \"didn't give As\" which means that the two take-home midterms (5-7 pgs) are graded on a curve (I'd never heard of a Poli Sci curve but apparently the TAs are only allowed to give 20% As).  Not to worry, if you get a reasonable TA, all the other papers get a grade of B or B+.  My only complaint about the class is the TA sections--poorly organized and completely pointless but unavoidable, the TAs take attendance that counts for 10 % of your grade.  The newer material at the end of the course is pretty interesting--she actually gives a few lectures on bio/chemical weapons, terrorism, and the Wars in Afghanistan and Iraq (most courses that intend to make it to the present day don't make it past the 80s).  Overall she's a pretty good authority on the major topics in IR, and manages to give a nearly unbiased view of all the material (very rare for a Poli Sci teacher).  I would certainly recommend taking IR with her.\nWorkload:\nA lot of reading but all of it can be skimmed (esp. the Cold War reading--so awful).  But make sure you skim enough to cite some of the readings in your midterm papers (topics easy) because you can't simply regurgitate what she's said in lecture.  Final is nothing surprising, a few IDs and two essays--make a comprehensive cheat sheet (she allows you to bring a sheet of notes to the final) and you should be ok.\n"
        },
        {
            "course_name": "Russia and the West",
            "review_date": "November 16, 2003",
            "review_content": "\nIf you want an interesting and intense class, take Russia and the West. Prof. Marten is a great lecturer, very easy to fallow and understand. Even if you know nothing about Russian Politics, it would be a great introduction to this area. Be prepared to read a lot, though, (about 150 pages a week) which is a regular reading load for PoliSci majors, but maybe very difficult for others. She also lets everybody bring a sheet of paper to the midterm and final with your own notes on the readings. This is very helpful if you know how to organize them. My advice- just list the names of the authors and then very briefly outline their main argument without going into details. The questions on the midterm and final are broad, so you will find your paper helpful in juxtaposing contrasting arguments.\nWorkload:\nNormal amount of reading for Polisci, midterm, final, long research paper (25 pages)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 14, 2003",
            "review_content": "\nShe is an excellent teacher. She has her political personal biases, but in class, she reviews all sides and is objective. She knows her material and class is always interesting. The readings are interesting, but much of the materials on the midterm and final can be picked up just by going to lecture instead. She is approachable in her office and she is enthusiastic about her work.\nWorkload:\nDecent amount of reading, Midterm, Final, Long Paper (20 - 25 pages)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "March 12, 2003",
            "review_content": "\nProfessor Marten-Zisk is amazing.  She is hard, but you learn so much in her class.  I became a pol sci major because of her.  She is very organized, knowledge, and clear.  You come out of the class having a better grasp of the world.   The readings and lectures were very interesting, although I wished that we didn't focus so much on 9-11.  Also do be warned that it is going to be lots of readings and note taking.  Her lecture covers a lot, so expect to have intensive hand exercises for every class.   I do recommend taking this class or any class with Professor Marten.  She is very inspirational and definitely one of the best professors I have encountered at Columbia\nWorkload:\nLots of readings, 2 midterm papers, final, and mandatory discussions.  All very doable but they are hard.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 23, 2003",
            "review_content": "\nProfessor Zisk-Marten is a wonderful lecturer who makes class exciting. She outlines every lecture at the beginning of class on the board and sticks to it, making notetaking very easy. The course material she chooses is interesting and pertinent and she seems to be very nice as well.\nWorkload:\nMandatory recitations with TAs who aren't so great, two papers and a final. The reading list is absolutely enormous but you aren't expected to read everything word for word. Its a hard class but its worth it\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 18, 2003",
            "review_content": "\nProf. (Zisk) Marten was a truly wonderful lecturer for this huge intro class.  She provided very clear outlines on the board which she followed closely - making note-taking very easy.  Her lectures were always well organized, clear, and thought provoking.  By referring to her own research fields, Prof. Marten added much to her lectures.  She was also very willing to go over subjects with students during her office hours.\nWorkload:\nHUGE reading list.  While the list was incredibly long and time consuming, nearly all of the readings were thought-provoking and added to what was covered in class.  Two midterm essays (7 pg max) and one long inclass final.  Mandatory discussion section was helpful to review concepts covered in class, but somewhat uninsightful.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 18, 2003",
            "review_content": "\nMarten-Zisk (is a good lecturer, but not a great professor.  Unfortunately the exams are based primarily on the readings, which are long and often boring.  Her reasoning for giving as much reading as she does is that a lot of polisci majors go to law school, so unless you fall into that category, you might want to look elsewhere for an intro to international class.  Her test were two take-home essays and an in-class final.  You had to sign an honor code for the take-homes, promising you would not discuss the material with anyone else, which seemed counter-productive to me, as she asked about current affairs.  Good news is it turns out the reading is not as necessary for your grade as she claims.\nWorkload:\nexcessive reading, two take-homes essay-exams and a final\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 18, 2002",
            "review_content": "\nAs a fresman, Professor Martin was very impressive to me. Although some upper -classmen complained that she was \"nothing special\", I really enjoyed her class. Her lectures are systematic enough so that they are easy to follow, but she is NOT a robot. She makes the information extremely lucid, easy to grasp and very interesting and applicable to today's political situations. She takes plenty of time to answer questions, and class time is well alotted. Martin is a fan of the socratic method of teaching and responds to many questions with further questions. Sometimes this is frustrating but it is often an effective way in urging class participation. All in all, a good class to take.\nWorkload:\nVery do-able...a lot of reading, but don't be discouraged at all! 2 midterm papers (graded fairly) and a final.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 14, 2002",
            "review_content": "\nZisk is an AWESOME lecturer. Each class you learn so much and take so many notes it astounding. She makes a 250 person class feel like 30 buy taking quesitons and asking questions. You never find yourself looking at the clock in her class. That being said, this class is very tough. A ton of reading, accompanied by some tough grading make it not a grade inflator. However, if you are interested in international relations, she is the best.\nWorkload:\nAbsolute absurd amouts of reading, 2 take home midterm essays (5-7 pages), final\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "February 15, 2002",
            "review_content": "\nShe's tough in terms of academic work - no bulls. But if she knows that you are trying really really hard, she will award you accordingly. Her lectures are organized, and quite up to date and interesting. She knows her materials very very well, and is a clear speaker and easy to understand. In person, she's very friendly - go chat to her during office hours - she's very likable and nice. She seems to have a really \"hard-as-nails\" persona in class, but she's actually really down to earth and friendly in person, and she'll love to help you in any way once you get to know her.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 28, 2002",
            "review_content": "\nPofessor zisk is amazing! don't miss this tough-as-nails woman whose cunning intelligence and sense of humor make her lectures totally worth attending. her courses are challenging but well worth it for those who are truly interested in cutting some teeth on foreign affairs.\nWorkload:\nmedium. there's a lot of tedious reading in the U.N. class\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 05, 2001",
            "review_content": "\nI took Zisk's lecture and was so impressed with her clear and organized lecture style that I needed to take her seminar. Although she does not beleive in grade-inflation and her reading list can be daunting, this is a class that you will learn something in. Zisk will put up an outline at the beginning of class and work through it during her lecture. Makes note-taking significantly easier. Zisk takes no crap from anyone but is by far the best prof I've ever had on campus and everyone should take her class (PoliSci major or not)!\nWorkload:\nTwo 5-7 pagers (one practice 3-5 pager) and a final (with a cheat sheet allowed).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 05, 2001",
            "review_content": "\nI took Zisk's lecture and was so impressed with her clear and organized lecture style that I needed to take her seminar. Although she does not beleive in grade-inflation and her reading list can be daunting, this is a class that you will learn something in. Zisk will put up an outline at the beginning of class and work through it during her lecture. Makes note-taking significantly easier. Zisk takes no crap from anyone but is by far the best prof I've ever had on campus and everyone should take her class (PoliSci major or not)!\nWorkload:\nTwo 5-7 pagers (one practice 3-5 pager) and a final (with a cheat sheet allowed).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nBubbly, a bit flighty, but she knows the issues, projects her voice and is enthusiastic. Shop around for a good TA in her class, it'll make a big difference.\nWorkload:\nDepends on the ta, approx 3 practice essays, 2 midterm papers, open-note final (HARD).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nZisk knows her stuff. Her lecture method is the best I've ever seen at Columbia. She clearly outlines all her points on the blackboard and addresses each point in order. Her class is hard. The reading list is surreal (I thought it was a joke when it first was given to me). But the paper assignments aren't too hard (just make sure you get a decent T.A.).\nWorkload:\n3 5-page papers A torturous reading list that should be outlawed under the Constitution's \"cruel and unusual punishment\" article.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Zisk is the most inspirational teacher I have ever had. She manages to cover a tremendous amount of material and make it interesting. She is energetic and brings in her own anecdotes to the lectures. The readings can also be fascinating, though many are dry and tedious.\nWorkload:\nAn intense reading list--count on up to 200+ pages of reading a week. one practice midterm, two midterms, practice IDs and a final.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nNice lady, certainly smart, grapevines about the lecture platform. Practically cries when speaking of Rwanda. First years seem to find the course and Zisk a life-changing experience... older students know better--better than average but not superlatively fantastic. Tells you quite simply how to do well in her class, and it works. Just don't do other things during lecture. She hates it and she'll notice.\nWorkload:\nStandard polisci fare--lots of redundant readings, couple of take-home midterms, final with a crib sheet (LONG but fair). Discussion sections are a pain, but you automatically get an A- section grade just for showing up!\n"
        }
    ]
}