{
    "prof_info": [
        {
            "prof_name": "Virginia Cornish",
            "prof_id": 516,
            "total_reviews": 44
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry I",
            "review_date": "March 15, 2014",
            "review_content": "\nI took this course a while ago (Fall 2010) and received a B+, which was very inconsequential to me since I didn't end up being premed and just wound up using it as a SEAS tech elective. \nOverall I'd say Cornish isn't a terrible instructor. I think she really does care. She sometimes will have people come on the board and write answers, which I kind of liked, since it allows you to get some brownie points if you're keeping up with the work and have studied. If you're one of those people who expects a professor who answers to their every whim (like the person lower down who complained about her not answering emails) then you might be disappointed. She doesn't spoonfeed you what you need to know for the tests and you really do need to know all your reactions (I made flash cards.) You also need to know how to draw molecules and bonds properly, thermodynamics of reactions and she also recommended we memorize Pka constants (I didn't really end up doing this YOLO.) Even if you do this there will still always be some curveballs.  \nI personally had never seen any Organic Chem before, and I'm fairly sure there were like 5-6 people in the class who had that wound up destroying the curve on every test. It happens. I ended up working pretty hard for my B+, but that's life. Overall I wouldn't say you should try to avoid her, but if you want somebody easier I wouldn't necessarily recommend her either. \n\nWorkload:\nPretty sizeable, especially if you want an A, but not unreasonable. You just have to keep up. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 07, 2014",
            "review_content": "\nI wasn't planning on reviewing Prof. Cornish, but after reading some of her reviews...I feel like future Cornish students may need a new perspective. So here it goes:\n1) Do the practice problems.  I did about 80% of the book problems in the problem sets (after the first exam, I did not do the hard \"challenge\" problems).  I also read the book - it was totally necessary to pore over Mcmurry to be able to do the homework problems. However, the \"extra\" problems in the problem sets that are not in the book are more important than the other problems - often there will be a test problem similar to at least one of the homework problems. (I found that having the student solutions manual to the Mcmurry was extremely helpful!!)\n2) There are no surprises on Cornish's exams.  They're all basically the same - they test the concepts that you HAVE to know, and then there's the \"apply-your-knowledge-to-a-new-situation\" problem that is typically doable, but really really hard.  I never got more than half credit on those challenge problems, but it was okay - as Cornish said, as long as you do well on the first (easy) part of the test, you'll do fine on the rest of the test. \n3) I did not live and breathe orgo.  I did not go out and get extra practice problems. I did not go to Cornish/TA's office hours religiously.  I just did the homework and worked to understand the basic concepts. I never got out of the standard deviation on any of the midterms (can't speak about the final because I haven't seen it yet), and I got an A in the class (and I'm typically a B+/A- science person). If I can do it, so can you!\n\nWorkload:\n4 midterms, 1 final (worth 3 midterms) - count 5 midterm credits for 95% of the final grade.  75% of recitation quizzes count for 5% of your overall grade.  Cornish claims to curve to a B/B+, but I'm pretty sure that it's closer to a B+.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 23, 2013",
            "review_content": "\n\"Maybe Cornish isn't for you if you are incapable of independently pursuing information\" - from a previous reviewer. Smug B.S. with a capital B and a capital S. \nMany of my study partners and I spent dozens of hours independently pursuing information, beyond the given problems. We hit other textbooks, problems online, and begged the TAs for extra practice. All this did little if anything to improve our grades in this class. I love organic chemistry, know the material inside-out, and am utterly devastated by my final grade in this class. have no idea how they computed it, given my test scores.\nThe bottom line, for which there is no excuse, is that students who know their stuff often come out of Cornish's class with poor marks, and those who don't, with good ones. I have no idea why this is so. Maybe it's because her tests aren't comprehensive. Maybe there was a network of cheaters my semester. I have actually quite a good bit of evidence that there was subjective grading on the part of the TAs, who intentionally marked up students they liked and marked down students they didn't. Whatever it was, standard deviations of 20 POINTS on exams indicate something is very messed up with the way this class evaluates its students. It seems to have little to do with your knowledge of chemistry, and more to do with personal factors -- your biography, your personality, and so forth. And all this is consistent with Cornish's own biases, about New York versus Georgia, about men versus women in science, about people who have \"integrity\" versus those who don't (as if she's God and can possibly judge that) (yes, I'm quoting directly from her lecture).\nCornish is a great researcher with million-dollar grants, and she says sweet things from time to time, but she does NOT TEACH. Not answering emails = NOT TEACHING. Leaving office hours early to take phone calls = NOT TEACHING. Making you wait on line at office hours only to turn you away because she spent so much time with others = NOT TEACHING. Spending huge amounts of time in lectures erasing the blackboard and writing stuff in chalk that could be flashed in one second on a powerpoint slide = NOT TEACHING. Devoting an entire lecture to her own research when we're all struggling with the basics before the final exam = NOT REALLY TEACHING. Sometime she talks a little bit about organic chemistry, like if you actually get to speak to her during office hours, and sometimes she'll say this and that in lecture, but at the $4000 tuition which we're paying (which she pointed out in class) we deserve just a bit more. $4000 times what, 100 kids in the class = $4,000,000 revenue for this class. Surely you could provide a bit more support for FOUR MILLION DOLLARS.\nI ended up with Cornish because I literally couldn't get a space in any other orgo class. DEAR CHEMISTRY DEPARMENT: GET A DIFFERENT ORGO 1 PROFESSOR.\nWorkload:\nImpossible to say, because even if you dedicate full-time and master the material, you still might end up with a B. That's not because orgo is hard. It's because the testing, and grading procedures, are neither comprehensive, transparent, nor consistent.\n"
        },
        {
            "course_name": "Orgo I and II",
            "review_date": "November 13, 2013",
            "review_content": "\nHonestly people, it gets really old listening to a few overly intense pre med students whine because they can't get the perfect A that up to this point they have always achieved by spooning their textbooks every night and mindlessly absorbing the material word for word. Orgo is by nature a difficult class. People new to it are obviously caught off guard, and apparently quick to lash out and find any excuse for their sub-excellent performance rather than openly admit they struggle to understand novel concepts. Yes, Cornish isn't that great. She could definitely teach way more, tone down the annoying life lesson talk, and stop alternatively treating her students like newborns one day and Phds the next. But is she evil and out to get every student that walks into her class? No. Let's keep in mind that the people most prone to complain about a teacher's lack of approachability are the over-the-top, first-row-sitting, compulsive hand-raisers, who understandably annoy the teachers as much as they annoy every other person in the room. Like many other Professors, Cornish no doubt has a lot on her plate. That being said, she does exude a slight aura of haughtiness and resistance to communicate by email. But when push comes to shove, she is in her office exactly when she says she will be. My advice is this: be prepared to work hard. Maybe Cornish isn't for you if you are incapable of independently pursuing information. But I in fact do find that I have a solid grasp on organic principles after her class. Let go of the expectation of a 100 in this class - that notion is more hypothetical than Kallipolis. You want to go down a chemistry path, be prepared to do the necessary work to get yourself there. \nWorkload:\n4 midterms. Spread the textbook reading and problem sets out and you won't do any more work than your average class. \n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "January 18, 2011",
            "review_content": "\nCornish was great, though probably not who you want to take if you're just trying to skim by. If I had to give Cornish a grade I'd probably give her a B+ and maybe I'm being too harsh. Regardless, I'd recommend her to anyone who actually wants to learn organic chemistry without a second thought. \nI understand most of what has already been said about her. Some of it's bogus though. She's strick, but she really does care, and you will benefit from both if you choose to. I'll try to help you figure out if you want to take her course. \nFirst, she does a pretty good job at letting you know what to expect. The format of the test is always the same. Some of the questions cover fundamental material that would be inexcusable not to understand. A greater amount of the test is about understanding how those fundamentals relate to each other (like considering resonance vs. sterics or the effect of the solvent in boundary cases like secondary carbons). You need to understand all the mechanisms, reagents, solvents, and be able to draw free energy diagrams for every type of reaction. Period. No surprises. \nIf you don't spend some time in the beginning of the semester on fundamentals you will probably hurt later on. And she tells you this. Memorize your pka values, sure, but even more important you need to understand those values relative to each other (i.e. Why does a ketone have a lower pka than an ester? And why is the pka of carboxylic acid anhydride between the two?).  \nNow, Cornish will tell you not to memorize rules and mechanisms and such. She's not lying, but she's also not telling the truth. Memorize all of it. Everything she puts in her notes-- which is not nearly as bad as it sounds. She writes legibly and very, very, slowly-- but you need to understand it too-- as in \"defend your answer to your peers\" understand it.  \nOk, so once you go through all of that (it'll take a while, I promise), it's also about your ability to take a test. She'll tell you that you're probably not going to get the last answer right, and she's probably right. So look at it in the beginning if you want, but only commit to it once you know that the rest of the test is as perfect as your going to get it.  \nWith that said, some advice for that last question. It will surprise you-- and you just might panic and forget to breath just like the rest of the class-- but before your hand cramps from scribbling for partial credit remember two things: \n1. Every time she went over the answer after the test it was always simpler than I had guessed. Follow the hints. Follow the hints. Follow the hints.  \n2. Maybe it's a bit masochistic, but I learned something from every one of Cornish's tests. That last question is designed to teach you something. Even if you dont get it the first time through go back to it and figure it out. It might not help you answer that next big question, but she's going to assume that you understand it all the same. \nOrganic chemistry is an elegant subject. While Cornish's lectures might not be great at helping you see that, she asks that kinds of questions that will.\nWorkload:\nStrenuous, fair. Four midterms, weekly quizzes, and a final. The quizzes count for some negligible amount of your grade, the final counts as four (or maybe it was three?) midterms and you drop the lowest two. \nI got an A- in the course. My first test was just a few points above teh average, and every test I climbed higher above it. I probably didn't understand the material any better (relatively), but I actually started taking her advice and not making foolish mistakes. \nYou'll do fine. You'll learn lots. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 28, 2010",
            "review_content": "\nThere were several concepts Cornish lovesss to test that are NOT assigned as homework from the textbook. I studied the textbook in and out for every exam and averaged 73 on the four midterms. I think the averages this semester were: 77, 60, 53, 60. I think she curved this semester to a B+. Pretty nice, I think. Anyway, the McMuccy textbook (which is very good and necessary to get at least the mean) is definitely not enough to get your solid A for this class. Go to class, pay attention, take detailed notes (especially when she explains WHY certain things are they way they are--which she MIGHT explain very briefly), go to TA office hours to solidly understand concepts she discusses in class but are not in the textbook. If she talks about something in class that you don't fully get, make a note of it and ask in office hours. I've never been to Cornish's office hours, but the TAs this semester were definitely very helpful. \nIt is really important to understand these big concepts in the beginning of the semester, because they will probably be on most or all of the exams. Thermodynamics especially. Expect to draw free energy diagrams to explain things on every single exam. She also loves to ask you to explain the acidity/basicity of a molecule or compare the acidity/basicity of different molecules, using resonance and free energy diagrams support your argument. I had Christine as a TA this semester and she was excellent at explaining this. \nOn the first exam, Cornish asked us to draw a molecule in 3D and label the hybridization of the atoms in a molecule, which, from gen chem, I thought was a piece of cake. But depending on the resonance forms of a molecule, an atom can have a different hybridization. You need to look at the lone pairs and consider their geometry and the resonance forms of the molecule.. which lone pairs are in the pi system of the molecule, and which are not? Which pi orbitals are interacting with eachother? and blahblahblah. When I was studying for the final, a TA pointed out that there were pictures/explanations for this in the SECOND HALF of the textbook. I don't know why weren't informed about this BEFORE we were given the question on the FIRST exam. I was completely unprepared for that. I think that question was like 20 points or something..\nCornish wants to make sure that you're not just memorizing facts, but that you're able to look at something and give a supported argument for WHY something is true. In that way, she's really testing your understanding of the material. It's not easy, but with enough question-asking (i.e. time spent with TA's), it's possible... I just wish I had done that earlier in the semester. Unfortunately, she doesn't do a very thorough job explaining these concepts in class, so it's pretty understandable that most of the class just doesn't know. When you're studying for your test and you see something in your notes you don't quite understand, don't just gloss over it! \nWhen you get your midterms back, be sure look at them very carefully and go to office hours to understand why you got certain questions wrong, especially if they're the big-concept questions in the second half of the exams. Don't just brush them off because you're likely to see it again on the next exam and you'll most probably see it on the final. \nBe able to reason out and explain the pKa values of the different molecules. Explain why different molecules have higher/lower pKa values, which, in turn, affect their acidity and basicity.... \nGood luck.\nWorkload:\n4 midterms worth 1 unit each, 1 final worth 3 units. Drop any 2 of the 7 total units. The homework sets are pretty long. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 22, 2010",
            "review_content": "\nIf you are reading this review in advance of program filing and are considering taking Cornish- run. If you are reading this during shopping week- SPRINT.  and if you are reading this and you're already in the class, then god help you, you will understand every word of this. \nEverything that is wrong with this class:\n1) completely arbitrary and absurd, random, picky grading\n2) empty lectures\n3) memorizing the textbook is barely sufficient to get a 60 on each midterm\n4) she will not help you if you don't understand\n5) she pretends to care when she actually couldn't care less\n6) extremely long homework sets that do not reflect the exam material in any way shape or form. \n7) you won't be able to break a 85 unless you have taken orgo.\n8) last question is always 20-30 points and you cannot get it right unless you know or magically have advanced chemistry revelations.\n9) the entire class is about general chemistry, specifically thermodynamics, NOT to be confused with orgo.\n10) this class will rob you of your sanity and mental peace.\n11) if you think you are immune to failure, you will deeply reconsider.\nWhere to begin, so first day you get to lecture and the only thing that is written on the board is CARBON- 4 VALENCE in kindergarten teacher's print, and you think, what could possibly be so bad about this? Cornish seems very sweet, very approachable and totally easy- IT IS A TRAP. This behavior continues approximately until the drop deadline and you are stuck in what rapidly becomes a vicious nightmare. Cornish's lectures COULD NOT be more empty if she tried, in fact, she probably purposefully plans them to make 0 sense and makes sure they cover abut 1/6000th of what you are expected to know to even crack a 25 on the exam and yes, according to Cornish, a 25 is a VERY good score, it means you \"are really understanding the material\" Come to think of it, there were multiple 0's, 1's, 15's and 18's in the pile of exams and yes, these people did write and did not leave the exams blank. If you are missing one detail that she wants, a minimum of 5 points will be deducted from your exam (and she will not tell you why). This wouldn't be such a big deal if the last question wasn't made (as she admits deliberately) to be impossible and scare you and oh yeah worth 30 points. But according to Cornish, \"you can still do extremelyyyy well if you do not even touch the last question\" ohhhkay Cornish, in what alternative universe is starting at a 70 doing extremely well? The standard deviation of the exams is always near a 20 and the mean generally between 55-60 (gee that seems very normal for a Columbia class of orgo students, right?). By the way, don't ever write your work on your paper because according to Cornish it puts the graders in a very difficult position, \"As you can imagine\" in which they MUST take off points for incorrect work. \nAlso, this is not the kind of class where you can be failing and go to the professor for help, on multiple occasions, I witnessed one person having trouble, crying to the professor and simply being brushed off. Another extremely frustrating part of this class is that Cornish hands out her own \"special\" problem sets and refuses to give answers for them. What's funny is that the TA's don't even understand what she is doing giving out such advanced problems, nor do they know how to readily answer them. Sometimes, at review sessions the TA's would take up to 20 minutes to be able to formulate the words to explain solutions to these problems (mind you these are organic chemistry experts). Perhaps the most ridiculous part of this class is that when you leave, you won't even have a sense of fulfillment in organic chemistry, no no, but rather, you will be a master of pka values, acid base reactions and an artist of free energy diagrams as you will have to draw them at least twice on every single test. If you are planning to take this class, start practicing your drawings now! \nFor me, the worst part of this entire experience was Cornish's obsession with standing in front of the class for 15 minutes, just about every single class, talking about how smart everyone is, how hard everyone works and how she is positive that everyone is doing so well. If she spent half as much time teaching as she does fake prep talking, the class would be a lot smarter. She especially enjoys reiterating this after she writes the mean of 50 on the board before she returns the exams. Honestly, if someone is going to be evil, they should do it openly instead of trying to hide it constantly under a painfully robotic and fake smile. She is truly a coward when it comes to owning up her evil. \nI did extremely well in this class and I still feel the need for anyone who is even considering taking orgo I with Cornish to know how awful this course is. I wish I had believed these reviews- there is no one who is too smart to get penalized by her exams. There is a reason why 50 people agree with each bad review. \nConsider yourself warned. Drop the class. If you are in it before drop period is over, leave. If you need to take orgo this semester and she is the only choice you have, you're better off never taking it at all. \nDon't do it. \nWorkload:\n4 midterms that are fairly difficult and test more on your understanding of thermodynamics than anything else. Final. Weekly quizzes worth 5 points of your entire grade which makes them essentially pointless because you would lose 5 points on an exam if you drew an unsymmetrical lone pair of electrons. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 16, 2010",
            "review_content": "\nI went into this class already knowing alot of organic chemistry.  This class was painful.  Cornish goes painfully slow in her class.  She spends like 4 lectures on naming and drawing line structures.  Then you decide this is going to be easy.  You take a look at the previous year's test, and the 20 point problem is on a subject that you only did one class problem on, and no assigned reading or problems.  Every test is like that.  You can make no assumptions on the importance of the material based on the assignments or how much time she spends teaching it.  \nI had Christine as a TA, and she was amazing.  She also made it clear of the insanity of Cornish.  There were days she would say that she hadn't learned that type of problem until grad school.  \nCornish likes to think she's nice and organized during lecture, by writing every single word.  She'll say \"consider the following reaction\"  and surely enough, she'll begin to write ' Consider the following reaction'.  Sounds silly to complain about, but for every problem of the class, that adds up.  Many she could use the time on the things she thinks matter.\nWorkload:\nWeekly quiz, which to be honest, you probably are studying for another test on any week there isn't a test in this class.  Then 4 tests, only 2 count.  The final.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "May 26, 2009",
            "review_content": "\nProfessor Cornish is not a bad instructor, but then again, 98% of the material is best learned for the textbook. McMurry's textbook is the holy bible when it comes to orgo one - combine with Organic Chemistry as a Second Language and there is no need to actually listen to what Cornish  says. Her exams are not at all hard if you understand the material and have memorized and understood the reactions. Cornish loves thermodynamics so be sure to understand the equations and energy graphs and memorize the energies that she tells you to.\nNow, grading is a whole different story. It sucks. Everyone i know who took her class was absolutely raving mad when they got their grade. The curve was probably to a B-/C+. She spent five minutes every class going on about how if you want that A+, you should be ready for the last question on the exam, but you can do well without even looking at it. Bullshit. Save yourself the agony. Take Doubleday. The material is the same no matter who teaches it. It's all in the textbook. \nWorkload:\n4 strightforward midterms, 1 tough final\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "May 21, 2009",
            "review_content": "\nShe is awful. The only thing I got from her class was increased drive to do better second semester. McMurry problems are definitely way too easy for her exams;  I still have no idea how to to do well on her tests (2/3 straightforward information, 1/3 tricky deceptive problem-solving - she curves the 2/3, meaning 66 on an exam or class avg, to a B; I asked) even after acing second semester organic chemistry. The only thing I can suggest is that you read the textbook, do all her problems (to which, it is true, she doesn't provide answer keys), buy some supplemental prep books (I've head Organic Chemistry as a Second Language is extremely useful), and pray that you understand the trick she decides to test. She goes over some of the basic rxns in class and expects you to know when and how to use which one, despite never having taught you any of that information. She doesn't explain any of the tables or graphs she puts on the board, or why they're important, and then subsequently expects you to draw a derivation of it in a different situation for the exam. All in all, this was a fail class.\nWorkload:\nfour midterms, one final worth 300 pts; drop the lowest 200 pts. quizzes in recitation, psets never due.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "February 27, 2009",
            "review_content": "\nBefore I begin the review, you should know that I took Organic Chemistry before entering Prof. Cornish's class, which really did take a lot of pressure off the details.\nSo, I think I should begin in saying that I understanding basically everyone's opinion of Cornish so far on CULPA. Pretty much all is valid, but there are a few things I wanted to explain to people who may take her in the future.\nFirstly, Cornish is tough, but she curves relatively leniently. So getting in the 80s-90s basically translates into a solid A. I think the mean (usually in the 60s) was around a B+. It takes some major screwing up (SD below the mean at least) to get into the C range. So at least know that everyone struggles in the class, and it's not your responsibility to know every single detail. Heck, I got a 63 on one test, and ended up with an A.\nHowever, and this is a big however, leaving stones unturned in organic chemistry is a recipe for failure, especially in Cornish's class. Everyone understands the simple reactions (SN1, SN2 etc.), but what really separates people is their ability to apply those reactions on a much grander scale. And yes, Cornish can take the \"grand scale\" to a whole new level. So, you may know the basic reactions, but still get absolutely NO POINTS on an exam if you are unable to apply those reactions. It's really unfortunate, but again, realize that most people struggle, so there is plenty of hope.\nSecondly, I would like to emphasize the importance of the textbook. Cornish's notes are extremely important, sure, but the textbook is where the true understanding develops. Typically, she will ask little tricks that come out of her notes. But even so, reading the textbook well in advance really helps in terms of understanding things like radical reactions (which she adores, but hardly explains in class). There are very few questions she asks that are beyond the scope of the textbook. Of course, she will throw in some insane (sometimes literally impossible) problems that no one gets right. But...no one gets them right, so it really has no affect on your grade. I think people should realize this before getting really angry.\nAnd finally, will someone please tell her to erase the board more clearly? It is probably the most annoying thing in the world...everyone reads about it on CULPA, but no one asks.\nSo to conclude, Cornish is not really someone to avoid, unless you really don't care about Orgo. If you are a pre-med, take Cornish. She isn't hard enough to really screw up your grades, and she is qualified enough to really help you understand the concepts (good for MCAT). \nWorkload:\n4 midterms and a final. Don't mess up the final (its basically worth all of the midterms combined, and really will determine what you get in the class). Recitation quizzes are a joke (hard, but worthless).\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "August 22, 2008",
            "review_content": "\nCornish is by far the best chemistry teacher I have ever had.  She will teach you orgo.  You will learn, you will understand, and you will be prepared for second semester.  She is clear, and she is by far the most organized science teacher I have ever seen. (She actually followed her syllabus, and did not get behind at all.)  Because she is so organized, she actually slows down the pace of her teaching near the end of the semester, which is great because every other science class is speeding up like crazy then to fit everything in, so you at least get a break from her.  Yeah, so the second half of her tests are hard.  But when you realize that she curves pretty decently, then you realize that the last question on her tests, though impossible, is essentially extra credit.  If you are willing to put in the time, get a model set, read the text book, do all of her problem sets, and make flashcards, you will do well.  And it is totally crucial to learn orgo properly first semester, because if you don't, you wont have a prayer second semester.  Also, once you have made the right decision and chosen Cornish, keep in mind that though she will tell you that you need to be on top of the material all the time, and should make flashcards about a set of reactions the second that you learn them, and such... this is simply not true.  You can always take a week off after one of her midterms.  Yes, it does take time for these concepts to settle in, but you will have time.  You don't need go crazy about it.  Especially since she has a very generous drop policy --you can drop 2 out of the 4 midterms-- if you don't fully understand it by one exam, you can figure it out by the next and be all right.  \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "February 08, 2008",
            "review_content": "\nPeople - she really is NOT THAT bad (personally I thought she was amazing). If you enter her class with the mindset that you will fail miserably and that you've heard rumors about how she's pure evil, well yes...you'll do horrible. BUT if you appreciate the way in which she teaches and really fill in the gaps by reading the textbook, etc. - you'll do fine, trust me.\nHere are my suggestions/comments:\n1. Know Cornish's test format - they are always the same. Knowing the format will definitely ease some of the tension while taking her exams. Her exams ALWAYS have one very difficult question that seems like it cannot be answered from the material that you know. But once you master the basic material, study and predict what you think she could ask and you won't be surprised when you find yourself getting that last question correct.\n2. I agree that Cornish is a horrible lecturer, and that it's best that you sit in front because she does not erase the chalkboard clearly, talks softly at times, etc. But given these criticisms, she organizes and structures the course very well. She teaches Orgo I in a logical manner so that it all makes sense after a while (i.e., she does not go by the book, but teaches the concepts in what I think is the most effective order) This may be hard to appreciate during the course, but if you talk to students who have different professors, they will complain about how its hard to understand some reactions - a complaint that you probably will never experience in Cornish's class. That is, whatever she teaches - she does her best to make sure that you UNDERSTAND the material.\n3. The key to doing well in her class is now to take what you understand and know all the TRICKS! There are many exceptions in organic chemistry and knowing these is just as important and this is what Cornish loves to test! (ex: Grignard will not occur w/ F, intramolecular reactions, ring stability, etc. You'll find these on her previous exams and lecture problem sessions)\n4. Always be ahead of what she teaches. This is VITAL. Read the chapter(s) in the textbook before she actually goes over it in class. I found that this really helped because I never felt lost or frustrated when she lectured. \n5. Cornish LOVES energy diagrams - expect atleast 1 question on every exam involving energy diagrams, stability, or pKa's. \nSo, if you're the type of student who can sit through a well organized but perhaps poorly given lecture and likes to read the textbook and also appreciates dry humor, well take Cornish. Yes, her exams are 4/5 fair and 1/5 incredibly difficult. In other words, 80% is doable with what you know and that last 20% is where learning the tricks and predicting the types of questions beforehand really help. But if you're the type of student who wants a good lecturer even if the material is not structured in the best way and will get frustrated that you are in Cornish's class without even giving her a chance to prove to you that she's a brilliant professor, then yea...don't take her.\nWorkload:\n4 midterms (each 1 unit), final (3 units) is BRUTAL so really study for it, curve is generous (95%), weekly recitation quizzes  (5%). Drop lowest two quizzes, and lowest 2 units of exams.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "May 06, 2007",
            "review_content": "\nI just finished Orgo II with Snyder (who is truly outstanding), and in hindsight I can now see how awful Cornish really was.  I ended the Fall semester thinking \"Hey, Cornish isn't bad at all\", but that's because I hadn't experienced a REAL Orgo professor yet.\nI went into the class with a 20.5 credit courseload in SEAS, so this may help you put this review into perspective: I suffered through this class and still got a B+.  I put tremendous amounts of work in, only to lose 15 points on exams from just not reviewing her notes enough.  My own fault, but you can understand the frustration.  I took very long and detailed notes from the McMurry textbook, which was not necessary at all, and didn't do quite enough problems.  Do all of those problems!  They only seem hard because she's a poor lecturer, but really McMurry problems are a total joke.\nI too, read all the reviews, and went in Cornish's class thoroughly terrified, telling myself \"maybe people just bitch on CULPA\".  This class IS more manageable than CULPA makes it seem, however there are horror stories about her that are actually true on here, too.  \nMy overall opinion of Cornish is this: she teaches by the Thayer Method, but likes to lie to you about it.  She says her notes are enough and that you don't really need to read the book.  This is dead wrong.  You ought to read the book before you go into lecture, otherwise nothing will make sense to you and your notes will be worthless.  The problem is that you need to understand the background behind all that random stuff she wrote on the board, and she will not provide that for you.  Cornish will not connect the dots for you, nor will she erase them from the board properly...\nSome complaints:\n1.  She is not a good lecturer, ESPECIALLY compared to somebody like Snyder.  She never provides a cause for what she's doing, doesn't give any titles to any damn tables she's writing on the board, never gives a broad categorization of the day's lecture.  She is particularly awful at teaching substitution/elimination reactions.  For those three weeks I felt like she was speaking a different language, until I read the McMurry book and it made great sense.\n2.  She encourages rote memorization.  Cornish never ONCE told us why something is acidic or basic.  She never ONCE mentioend what an electron-donating or electron-withdrawing group is (crucial!).  Instead she gave us about 40 pKa values to just memorize.  On the 2nd midterm, one question involved knowing two pKa values, and then doing some clever math to solve the problem.  I did the clever math properly; I understood the point of the question.  However, I was wrong about one of the pKa values.  The question was worth 15 points, and I got 10 points off.  Think about that! She treats rote memorization as worth 2/3 of a question!  To be fair, one of her infamous homework questions did refer to acidity and basicity via resonance structures, but...\n3.  She doesn't give solutions to her problem sets, which is just stupid.\n4.  The last question on her exam involves application of what you've learned (if you've learned), which can range from totally reasonable to downright impossible.  Example of impossible: She once asked for the mechanism for the Hofmann Rearrangement, which you learn at the end of Orgo II.  The Hofmann Rearrangement is a huge exception to many of the rules you learn, and there is absolutely no way you would know how to do it unless you had seen the reaction before.\nSome upsides:\n1.  Everyone else is confused, too, which makes for some very low means.  Those who do well are the ones who read consistently and have more time to connect the dots and see the big picture.  It really, really helps to also have a supplementary book.  One book a lot of people have is \"Organic Chemistry as a Second Language\" by David Klein, and it's wonderful.  I recommend it.\n2.  Sometimes rote memorization helps put you over the mean.  There's usually one 15 point problem on the test that comes straight out of notes.  Just memorize the mechanisms she puts on the board, for sure.\n3.  Cornish recycles homework and test questions.  Everyone seems to have the solutions to previous year's exams from older friends who took her. Sometimes, a solution to a homework you are looking for is on a previous exam.  This can be helpful.\n4.  When in doubt, draw some resonance structures, and you'll get some points.\nYou really can succeed in this class without ridiculous amounts of work.  It honestly is manageable.  It's far more frustrating in HINDSIGHT.  I do recommend reading the book, despite what she says.  Make good flashcards for yourself for reactions, with detailed mechanisms (can't stress this enough), and when you have one of those \"aha!\" moments where you feel yourself making connections between concepts, always write it down.  God knows Cornish won't make those connections for you.  And a warning: people say that her final is easy, but the mean is still low. It only FEELS easy because the material is no longer new.  \nPeople claim that you'll be better off in Orgo II with Cornish, but I disagree.  My good grade in Orgo II wasn't because of Cornish, it was DESPITE her.\nWorkload:\n4 Midterms, 1 Final (worth 3 midterms), Drop lowest 2 units.  5% of the grade is weekly (impossible) quizzes that basically only count if you're borderline.  A ton of recommended homework, which you should do until you feel like they're a complete joke. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "April 14, 2007",
            "review_content": "\nI took Prof. Cornish because CULPA said that she may be hard, but if you want to learn orgo - take her. I have to agree. She does a pretty good job at getting you to understand theory and underlying concepts of 1st semester. Being exposed to it has been an enormous help in orgo II. Even though it took me the first couple of exams to catch on, by the end of it I was really happy with my understanding of the material. And - guess what? Those first exams didn't really matter because she drops 2 of the exams. SheÂ’s also amazing because only the exams count. There are no problem sets and the quizzes count as 5% of your grade. \nJust FYI Â– you should go to lecture, but her claim that itÂ’s all there and you donÂ’t need your text is not true at all. Read the text and glance over her lecture notes. Most importantly Â– look over her optional problem sets and old exams. It will give you a feel for the types of molecules she likes etc etc. Also, on her exams, the final question is the curve breaker. ItÂ’s always a trick question and if you donÂ’t get the trick too bad for you Â– get peopleÂ’s old exams from past years. This will help you prepare for those questions.\nIn general Â– good professor. You actually learn stuff in orgo besides memorization. You have an advantage in second semester orgo. You get a better grade because the curve is better than other classes. People who donÂ’t do well Â– itÂ’s because they donÂ’t know how to work on their own when there are no graded problem sets. \n\nWorkload:\nNothing is graded except exams (95% of grade) and weekly quizzes (5% of you grade) 2 of the exams are dropped. Problem sets are optional but are a good preparation for the exam. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "February 27, 2007",
            "review_content": "\nCornish was an exceptionally bad professor.\nI think the reason 150 people take her class every year is because, like me, they go to the first few lectures, which are basic reviews of high school chemistry, and figure she'll be alright. But then the material gets much more novel and complex, and that's when the truth comes out.\nThe thing to know about Cornish is that she is extremely Ambitious. She should probably be researching at a private lab somewhere, because (at very least) until she gets a paper published in Nature (which may very well be never) she's just going to continue phoning in her lectures, reading off from her notes in a barely audible monotone, jotting stuff on the board as sloppily as possible, mumbling obvious tips about study habits and such, always too lazy even to erase the board properly, so that--as if her diagrams weren't sloppy enough--now you have to discern whether that stray mark near a molecule is an electron, an arrow, or just chalk residue. \nThis is the first class I've ever taken in which we were let out early almost every time.\nShe doesn't even give out the answers to her problem set questions. Not even the day before the test. There can be only one explanation for this, and that's sheer laziness. (Her excuse that she wants us to \"struggle\" with the questions is such shameful bullshit, because then she could at very least give us the answers _after_ the test, or before the final, which would still be helpful since the material is cumulative). \nEven her exam keys were annoyingly sparse, but she had to finish them off in, literally, a minute, so she could get back to her research.\n\nWorkload:\nYou basically have to learn everything on your own, however long that takes you... Luckily the textbook is good. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 22, 2007",
            "review_content": "\nDespite what other people have said about Cornish being a horrible professor, I actually enjoyed her class and did well.  I think that her lectures were great and she did take the time to help other students who were not doing well.  I think the trick is to sit in front so you can hear her better and see the board.  Also, it's true that she gives a TON of homework, but it's only for the student's benefit, and you don't have to do them all if you get the gist of it (it's not graded!).  About the problems without answers, they were fair.  It forced students to think on their own and learn the material, which if taken seriously, worked... b/c the midterms resembled these problems.  The best part about the class is the curve.  With the format of her exams, she is able to weed out students who understand the material from those who do not.  And compared to bio with Mowshowitz, the problems are straightforward - no need to translate it and figure out what exactly she is looking for.  Her problems are also intersting and new and will probably be more appreciated by students who enjoy organic chem and want a challenge b/c they are difficult.  And people do well in her class and a lot do get As and A-s.  \nIf you take her class, you will be more than prepared for orgo II.  A lot of people I know who took Katz' class said that his lectures were horrible and most had to use the TA.  \nLastly, if you excelled, ask for a letter of recommendation.  She takes the time to write them and if she knows who you are and that you really worked your ass off to get a good grade in her class, you are golden - and will most likely get in a med school of your choice :) Do realize that she is an up and coming scientist... so she's known and respected in her field. \nStudy hard and good luck!\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 27, 2006",
            "review_content": "\nAs a class, the Orgo I material was challenging.  As an instructor, Cornish was terrible.  Although she was always very encouraging and seemed to be willing to help students, it was clear that her main purpose at Columbia is research.  While I have no doubt that she is brilliant in this respect, her teaching skills are very lacking.  Like many other instructors, her lectures are very boring (ok fine organic chemistry isn't supposed to be incredibly interesting).  Cornish's major flaw, however, is  that she lectures in an advanced style that requires prior knowledge of organic chemistry to understand.  While a few of the post bacs and chemistry majors understood what she was saying, the majority of the class was baffled.  Thus, despite Cornish's belief that her lectures were the be all end all, learning the material out of the McMurry textbook (actually fairly decent)  was required for most students.\nThe tests:  Cornish's tests were hard.  They were long answer (no mc)questions which sometimes let you choose which part to complete.  (note: despite having 150+ students in the class, all the tests were graded in a day or to, sometimes to the detriment of students' partial credit).  Cornish also liked putting large molecules on the final questions of tests.  While these questions applied the same principles as the previous (more normal) problems, they were more difficult and sometimes intimidating.  Still, the tests were doable as long as you were solid on the first few questions.  The best part of Cornish's tests was the fact that she was such a poor lecturer that the means were always low (50s and 60s) so you didn't have to ace the test to beat the mean (that said the avg might be 50 with a standard deviation of 30).  Also you can drop 2 parts of 7 (4 tests + 3 part final).\nIf you are willing to put in the time, Cornish is manageable.  You don't have to ace tests like you do in Katz's class in order to get good grades.  If you're not a post bac or you are taking more than 10 credits...Cornish is fairly ridiculous...especially for SEAS students taking a bunch of other classes.  She was a poor lecturer, but fairly standard for Columbia's research oriented chemistry department.\nWorkload:\n4 tests (1 part each) and a final (3 parts)\nweekly recitation quizzes (minimal impact ~5%)\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "December 01, 2006",
            "review_content": "\nCornish is probably the worst professor I have ever taken at Columbia. \nFirst the good - \nThe TA's are very helpful\nThe lecture's are, for the most part, clear\nNow the bad\nThe tests seem to be graded with the premise of giving students a hard time\nThe acoustics in the room are awful and Cornish refuses to wear a microphone\nShe does not erase the board well and the diagrams often become incomprehensible because they blend with what was previously on the board\nShe is extremely unresponsive to students\nTo internalize the material requires LOTS of time - something people here don't have a lot of.\nFOUR MIDTERMS\n\nWorkload:\nNo homeworks, but the work required to prepare for the midterms is immense.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "August 16, 2006",
            "review_content": "\nTake Katz, or anyone else. Cornish is a nice woman, but a terrible professor, I think. Take the class at Barnard where a Columbia kid is smarter than the teacher.\nWorkload:\nWho cares, the class is terrible.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "April 18, 2006",
            "review_content": "\nAs much as it pains me to say it -- take Cornish. Sure, you'll spend the entire semester tearing your hair out, confused over problem sets that bizarrely never come with answers, hating the one competent TA who also happens to be the biggest asshole alive, sweating with anticipation over her ridiculous tests...but in the end I think it's worth it. Only at the very end of the semester do all her cryptic notes and out-there test questions make any sense, so her final is actually much, much easier than the midterms. You'll spend an entire semester feeling like a total idiot and a slave to school, but it makes Orgo II a total breeze and MCAT orgo questions seem ridiculously elementary. Many Katz and Doubleday students seem pretty lost while most of the Cornish people are totally coasting through Orgo II. Cornish herself is a bit nuts...but somehow no matter how much I try to hate her for MAKING MY LIFE HELL I just can't. And those pKa values? Still remember most of them, still use them all the time. The crazy lady was right in the end.\nWorkload:\nCan be ridiculous -- if you're willing to put in the extra effort it will definitely pay off. Dropping 2 exams certainly helps matters. Make sure to switch into a good TA's section because lady won't see her students during office hours, and if you do get in her office she tries her hardest to push you out the door within 2 minutes.\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "April 16, 2006",
            "review_content": "\nThis is a great example of why CULPA sucks.  Anytime people do poorly in a class they blame it on the professor.  If the grading was so arbitrary, if the lectures were so bad, if the tests were so impossible, then how did ANYBODY in the class get an A????  And yes, there were lots of people who got A's and A-'s.  Its time for pre-med students to grow up and drop their bad highschool attitudes about school.  This is college, it's not supposed to be easy.  My tests were never graded unfairly and the test questions were always appropriate for what we had learned.  Just because the test problems are not the exact same ones you had on the homework does not mean that you can't do them.  This class isn't about memorizing the solutions to problems, it is about understanding chemistry and it is not unreasonable for Cornish to put problems on the test that will test students' depth of understanding, not just how many solutions they memorized.\nWorkload:\nno more than c2005 bio\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 17, 2006",
            "review_content": "\nYes, Cornish is not the greatest teacher you will have, but she is a great professor and you are in college now. If you want to stick with your high-school attitude and all you care about is grades, maybe you would want to evade her, but that will be a mistake. She does have a great personality, though it does not appear so at first in class, but just go to her office hours once. The grading seems to be a bit random, but eventually it is fair. The best thing about it is that by the time the final comes you will actually learn shit. In the first few midterms her more challenging problems (one of those would appear on every test) might drive you crazy, but in retrospect it is useful. The third midterm material is really the key, the fourth is just a revision that prepares you for the final. First two midterms are really intro stuff now I realize, though they are not friendly to beginners as I said. Just don't panic and you will do well. The final is really a peace of cake compared to what you feel about midterms. We had plenty of choice between problems on it, so no worries about the hard ones - if you don't see how to do one, it is very likely you will know how to do the alternative. To sum up, this class is a great way to enter Organic Chemistry, you might have to go through hell to reach heaven, but at the end that is rewarding. I am so disappointed she is not teaching the second semester.\nWorkload:\n4 midterms + final worth of 3 midterms = 7 units. Drop 2! Pretty generous I think. Weekly quizes in recitation that are only factored in borderline cases, so nothing to take any special care about. Many HW problems from textbook plus a few of her own that often look like that hard midterm question. Not graded, but important for preparation. Spend at least one whole day right before exams on those 2-3 HW sets or better do part in advance so it sinks in.  \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 22, 2005",
            "review_content": "\nOnce upon a time, I was a happy premed.  Junior year rolled around, and I needed to make the big decision---who to take the first semester of orgo with.  I talked to a lot of people and read all of the reviews, and for some reason, I still picked Cornish.  That was because I was naive...I would do fine with Corish, the people who wrote those dozens of negative reviews were just lazy, not so smart, and very bitter.  After all, CULPA reviews for Dr. Mowshowitz are horrible, but I loved her...\nYeah, so that was a mistake.  The thing is, these reviews are NOT an exaggeration.\nCornish is by no means a bad person, she's actually very nice.  She's lovely to talk to (though you need to wait on line for five hours) and can actually be helpful with life in general.  Unfortunately organic chemistry does not fit into the category of \"life in general.\"  This is where the praise ends.  \nProblems with Cornish's Orgo Class:\n1)  The TAs: The TAs for this course are an embarrassment to teaching at Columbia; the chemistry department should be ashamed of hiring them, and they should be ashamed of the complete lack of effort they put into their job.  I am a TA myself, and I know the amount of work it requires.  If these TAs put in one tenth of that effort, I would be shocked.  The recitations were supremely unhelpful, and my TA would frequently announce that he would not answer a particular question, either because he didn't like it or it \"wasn't important.\"  But then, the question would be on the quiz.  Or the test.  Hmmm...The review sessions were a joke, and it was a small miracle if they were able to actually give a straight answer to a question...most answers boiled down to \"we can't help you, you just have to understand it.\"  In a class with material as complicated as this, you need to have TAs who know the material and care enough to help out a bit.  The fact that the TAs are so unhelpful, unknowledgeable, and apathetic is a real shame.\n2) The tests and grading: I like the idea of having a low mean, but the reason for that low mean should be the difficulty of the test and not the completely arbitrary grading.  After getting a question right, I would find myself losing upwards of ten points, but all that was written on my paper was \"-10;\" not once did it specify WHERE or WHY I lost the points.  When you're grading a test, you need to mark why you're taking off points, you can't just arbitarily remove them.  This culminated on the second midterm, where I got the entire last question correct, but lost 12 points.  I went to Cornish herself to ask why my paper said \"-12,\" and she read my answer and told me that it was \"a beautiful answer, and shows that I really have a great understanding of the material.\"  The problem?  My answer was \"TOO THOROUGH.\"  That's right.  I lost twelve points because my answer was too good; because it included additional information that I thought was actually necessary to a decent answer.  Give me a break. All Cornish had to say was \"That's why we have four midterms, it all comes out in the wash.\"  No no.  The point have having four midterms is so that I can make a mistake, not so that the graders can.\n3) The homework:  Cornish assigns problem sets, lots of them.  You don't have to hand them in.  That's fine.  What is not fine is when you assign problems and then don't provide the answers.  Ever.  Not even before the test.  So you get 3 sets of really difficult problems for each exam, problems Cornish wrote her self, and you don't get the answers.  That's fine, I'll just go to the TAs, who will surely be able to help me out, or at the very least tell me what the answer is so I can reason through it myself.  See point 1 above.\n4) The other students:  This is a suck-up fest, and it really brings out the worst in people.  Students who ask the most idiotic questions, but use that slow, painful, I'm-thinking-really-hard-but-gee-I-just-\ndon't-get-it tone are rewarded.  And the fact that there is no division between post-bacs and undergrads is unfair beyond words.  In Bio, which, mind you, is the course at Columbia which actually weeds out the premeds, the post-bacs take a different section of the same course, and do not compete with undergrads.  Not the case here.  Let the resentment begin.\nSo, in summary, I have very little to say about Cornish herself that's actually bad.  She's a nice person.  She has a lot of potential as a teacher, even if her notes barely scratch the surface of what you need to know.  And her review classes at the end actually tied things together nicely.  However, this class is destroyed by the abysmal TAs, poor test design and incompetent graders, and the general air of unhealthy competition it fosters.  Though Cornish constantly reminds you that \"You're in college now, no one is testing you anymore,\" I have trouble believing that when I have four midterms and Megan Rigney is holding premed meetings announcing that we're all about to slaughter each other as we try to get into medical school.  \nIn short, no class at Columbia has ever made me suffer so much, and I have little more to show for it than my bruised ego and a certain emptiness inside.  For your own sake, don't do this to yourself; you may come out knowing more Orgo than in Katz' class, but it is absolutely not worth it.\nWorkload:\nWeekly problem sets that take a lot of time.  And you don't get the answers to the problems Cornish writes herself.  Standard 4/3 midterm/final hour system, but the tests are poorly written and poorly graded.  Often, you have to be a chemical engineer or have taken orgo lab to know the information necessary to get the right answers.  \nGet ready to enter a serious relationship with John McMurry (textbook author) and his wife Susan (answerbook author), to work harder than you should have to, and to get very little out of it, even if the curve in the end may be more generous than you thought.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 21, 2005",
            "review_content": "\nAlthough I admire Proffessor Cornish immensely for being such an accomplished and intelligent woman, she is definitely not one of the greatest teachers I've had. When she teaches, she teaches as if you already KNOW organic chemistry. She uses complicated terms and molecules to teach the material. I think she forgets it's an \"I\" after Organic Chemistry not \"II\". Basically, you have to read the chapter before every class, which is difficult for some majors who have many other classes to read for. Her tests are often hard and not very straight forward (especially the last and most difficult question). Very little partial credit is given on her tests. To do well in this class you really have know organic chemistry inside out. She's a nice woman though. Very encouraging, although I wouldn't take her class again. Take Katz!\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "August 30, 2005",
            "review_content": "\nIf you want a teacher who should be reserved for people who like torture and mean personalities, take Cornish.  Seriously, you'll learn orgo 1 if you want to by reading the book, whether you take Katz or Cornish.  But if you want to feel like a human being, don't take Cornish.  In my opinion, she doesn't appear to care, and to tell you the truth, I don't think she cares to care.  Her main issue is not teaching organic chemistry 1, but her research.  The mean was so low on one test that she had to retest the entire class, and in the mean time assigned a crazy amount of homework from the book which we all had the answers to anyway!  Who knows how she really handled the two tests when it came to grading, anyway?  I can't even claim to be bitter.  I did very well in her class.  But that doesn't make me recommend her to anyone.  Just take Katz.  I don't know what else to say.  Take Katz.  The end.\nWorkload:\nsee the rest of the reviews. nothing has changed\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "May 13, 2005",
            "review_content": "\nThe workload is a killer.  The professor teaches at a fast pace.  Her notes are well-organized.  She tells you not to read the book, but DO read it.  The book is very well-written and clarifies a lot of concepts that she just skimmed over in class.  She missed probably 5 lectures during the semester, and the sub wasn't that spectacular.\nMany were annoyed with Cornish's attitude towards students.  She may appear to be very caring, but she has this high-handed executive attitude and can get too sarcastic and harsh during lecture in front of everyone on students who ask obvious questions in class.  If you are not a very driven student or pre-med, then take it with Katz.  Cornish is simply too much for engineering students that take it just to fulfill their requirements.\nWorkload:\n4 midterms and a final with the lowest two dropped.  Super long weekly problem sets that take at least 2.5 hours to complete.  Weekly quizzes at recitations.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "March 11, 2005",
            "review_content": "\nCornish is one of the best professors I've had at Columbia.  She is absolutely brilliant  and her well organized lectures show it.  The material really isn't as hard as everybody claims, you just have to go reread the chapters on resonance and electronegativity from g-chem and you'll be just fine.  I have a number of friends who took Katz and (not to bash Katz) and they all looked very lost on the first day of second semester orgo where us Cornish students felt right at home.  If you are pre-med and/or don't know dick about chemistry, stick with Katz and his easy tests,  but if you don't only care about your grades, take Cornish becuase you'll learn a ton and be better off for it later.  Cornish's tests will give you a chance to distinguish yourself (if you deserve it), where as Katz's tests are so easy you never get a chance to show that you know your sh*t (and what's worse, small mistakes can kill your grade because the mean is so high).\nWorkload:\nA huge  load, but that's what you need to get good at orgo.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "February 13, 2005",
            "review_content": "\nCornish is an ok teacher at BEST. The worst part is that she think shes the greatest thing since sliced bread. Things that really annoyed me about her is that she doesnt really teach well at all. She would introduce random things you haven't learned. I mean things that are NOT relavent to what she is teaching at the moment at all. What it does is just confuse you and you end up focusing so much on what this stupid thing she introduced is instead of learning the main concepts of the day. At the end you learn nothing at all. Also, her drawings especially of electron movement is especially messy, making it difficult to tell what exactly is going on. She would use the chalk to simply dot the board to represent an electron, instead of taking a second longer to make a more obivious circle. hmm what else can I say? She also gives u these hard problems that the TA's can't even do. Then she refusese to tell u the answers to these problems. Sometimes I wonder even if she knows how to do them. \nWorkload:\n4 midterms and a final-- midterms are really hard unless ur a orgo genius \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 05, 2005",
            "review_content": "\nNO is all you need to know. Wake up at 6am and take Katz. \nVirginia Cornish is a very well organised lecturer, she returns exams the next lecture and is open to in-class questions. Just like most super geniuses at Columbia, her expectations of us, the students are sky high, and the exams reflect this. You'll come out of the class knowing just as much as your fellow Katzian collegues, but with a lot more grey hair. It rarely happens (but it does nonetheless) that she will pick on a random member of the class for questions, so beware. Also, she recommends that you don't read the book.... READ THE BOOK, it'll keep you afloat. Also, another interesting fact: her curves are a lot harsher than Katz's, so unless you do not care about grades, don't mind sleepless nights over homework, frustrations over exams where the mean gets as low as 40 with a standard deviation of 15 (meaning virtually half the class gets the same grade), spare yourself the pain and take someone else.\nIf you have no other choice but to take her, prepare to study hard. Don't be too put off by the reviews, you'll survive.\nIf you don't believe me, read the other reviews. \nWorkload:\nWeekly quizzes counting 5% of the grade, best 75% of the quizzes counted (basically quizzes don't count). 4 midterms counting one \"unit\" each, best 2 counted, one final counting 3 units. Homeworks are extremely long and are not counted unless the class does badly in a test, in which case the homeworks will count as 1 quiz each.\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "December 31, 2004",
            "review_content": "\nMany of you may be reading this review in order to figure out which Organic Chem class to take Fall semester.  If it is the same as last year, there will be a twice a week Cornish afternoon class and a three times a week Katz morning class. Now although the Katz class may seem slightly undersirable due to the timing, take it from someone who chose Cornish just so to not have to wake up at 9am on Fridays that ABSOLUTELY NOTHING IS WORTH VOLUNTARILY CHOOSING SOMETHING THAT IS GUARANTEED TO SYSTEMATICALLY THROUGHOUT A SEMESTER WHITTLE AWAY AT ANY WILL OR SOUL OR HEART YOU MAY STILL HAVE COME JUNIOR YEAR.  Now there are a lot of Cornish reviews, and it can get confusing because some for some unknown reason seem to be easy on her. Now I must admit,  she attempts to teach you a lot about Organic chemistry and in a way that hopes to get students thinking about the science in an empirical comprehensive way, but ultimately when you have five other full classes to handle, you won't give a crap. She hates the textbook, but unless you are an organic chemist, you have no other way of figuring out anything she says in lecture and the TA's are just horrible. To cut a long, painful story short--even though Cornish grades are lower but there is a curve...the mental anguish of just trying to teach yourself a new science and even recieiving lower numbers on exams is simply not worth it. \nWorkload:\nSame as Katz in theory but no problem sets to turn in for a grade...except of course when our whole class failed a section and had to be placed under problem set probabtion. But tests are very different. They are based off of a comprehensive understanding of the science instead of just the concepts from chapters or lectures. And they have about five questions each worth 20 points where partial credit means \"you got one thing wrong so we will be generous and give you a 5/20\". \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 28, 2004",
            "review_content": "\nProfessor Cornish does not have a very agreeable teaching style. She suggests that we do NOT read the textbook and focus only on her lectures, yet on the exams we have to read the text book in order to get some of the problems. She just assumes that people know what she is talking about and often times that is not the case. She also has a tendency to blame her students for poor performance on the midterms even when it is clearly her fault for not teaching things well. The only positive thing I have to say about this class is that she seems to be a nice person and her curves are fair (of course they have to be, otherwise we would all fail since the averages of midterms hover around 60%). \nWorkload:\n4 midterms (can drop 2), final, weekly quizzes in recitation (usually easy), and weekly non-graded problem sets that will take you all of sunday afternoon. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 28, 2004",
            "review_content": "\nI've had some pretty bad professors at Columbia, but Cornish has managed to be the worst, for the simple reason that she thinks she's an awesome teacher, and she's actually terrible.  Like other people have said, she tells us not to read the book, won't answer questions, avoids her students.  The only lectures where anything made sense were the ones when one of her graduate students sub'd for her.  And he didn't even understand what her incoherent notes said. She talks down to us, glosses over things that are pretty important, and doesn't go in order. It wasn't until the last exam that I was able to have some kind of understanding about what we did on the 2nd exam, because I'd finally learned everything that came between.  Furthermore, she can't take any responsibility for herself. If the mean on the test you gave is a 40, it's probably because you didn't teach the material well and made the test too hard, not that 100 pre-meds didn't study enough.  If you're stuck taking her (like all the SEAS kids were this semester), I'm very sorry.  If you can take Katz, do it. You don't want to have to bitch about this woman all semester.\nWorkload:\n4 midterms, 1 final, problem sets that she'll post on a Saturday and expect you to have done by Monday (and you'll be asked to do basically every question in the chapter, they usually aren't collected but if you don't do them you won't ever learn anything), and weekly quizzes in recitation\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 27, 2004",
            "review_content": "\nProfessor Cornish is a smart woman but thatÂ’s not going to help you learn Orgo or do well in it. Her tirade about everyone in the class being smart and that there is no competition in the class got old and annoying VERY quickly yet she insisted on saying it at least once a week and maybe a few times after an exam where the mean was decent. Cornish gives horrible advice about how to learn orgo such as \"dont read the book, just come to class,\" which if you just do that you definitely wont hit the mean on exams. She also keeps talking about some other text book and says that she doesnÂ’t like the one we are using. I'm sure everyone in the class was thrilled that they just paid $200 for it. And after trashing the text book, the HW assignments after midterm two came with a reading assignment...strange. She also does indeed have a horrible tendency to assign big HW sets before Thanksgiving and Election Day weekends. Imagine trying to do orgo while watching the polls....not fun. She also forced the whole class to hand in three problem sets after the second midterm that had a mean of 40%. Each problem set had about 50 questions from the book, to which everyone had the answers anyhow, so it pretty much turns into who can copy the best the night before it is due. However if you are stuck in this painful class, I definitely recommend doing the HW, at least before the midterms and definitely read the book because her lectures are HORRIBLE. She barely grazes the surface of the material and if you go into an exam knowing only whatÂ’s in your notes you are totally screwed. \nPersonality-wise, Cornish is sometimes horribly awkward during her lectures. She has a tendency to play favorites in class, memorizing the names of two or three students (in a class of 150) and only calling them by name and going as far as calling on others relative to the person she knows such as \"yes, you, next to danny.\" This way she does a wonderful job of alienating and annoying 90% of the class. Also dont bother approaching this woman after class, all she will do is try very hard to run away from you while saying \"email me\". She tries as hard as possible to take a hands-off approach to the class and she will be very cold to you especially if you are part of the majority that doesnt try to constantly suck up. She also does a wonderful job of ignoring emails, so dont even bother emailing her, just mass email all of the TAs, one of them might be nice enough to answer. \nCornish's exams are mostly ridiculously hard. Oh and there r quite a few of them, studying orgo will consume your life. On midterms she tries to slip in one question that no one will know how to answer, and on the final there were two of those extremely difficult questions. She says its to help those who really know their stuff excel, i think she does it just because she is evil and likes to see people suffer. Oh and she also tends to roll over concepts that she (wrongfully) assumes everyone knows though they can easily be explained in one sentence, like  why hydrogen atoms suddenly disappear in some reactions. Furthermore, it became horribly clear before the second midterm that Cornish does not like or respect SEAS students, placing the second midterm on the same day as the Physics 1403 midterm despite SEVERAL requests that it be changed and two other plausible dates.....hmm anyone still wondering why the mean was a 40%? All in all if you dont have to take this section, dont. Cornish will make sure that orgo is as hard as it can possibly be. However if you are taking 3 or 4 classes in total and have an opportunity to live for Orgo for a semester and love to suck up to professors, then Cornish is the perfect choice for you.\nWorkload:\nOne or two problem sets per week, ~50 problems each. We had to hand in three of them because the mean was low during the second midterm. Manditory weekly quizes during recitation, 4 midterms! and a final exam. Grading: Quizes and HW count for only 5% of the grade. Midterms count as one unit while the final counts as 3 units, you get to drop the two lowest units, making up the remaining 95% of your grade. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 23, 2004",
            "review_content": "\nProfessor Cornish is an excellent lecturer and her presentation of the material is excellent. She is brillant and therefore has high expectations for her students. She really pushes the material taught to the limit by forcing you to look at the same question from many different angles. However, it was unfair of her to blame the low mean on the second midterm on the students. She essentially told the whole class that we were slackers and forced us to hand in the problem sets, which was a royal pain. One thing that really annoyed me was the fact that she did not give out answers to the additional problems on her problem sets...going to office hours doesn't help because she'll just tell you to go think about it more and that it's not always about getting the right answer. The \"thinking\" process is more important...but the thinking process doesn't exactly give you more points on an exam.\nWorkload:\nIt's orgo - there's a lot of memorization and then knowing how to apply the material. Weekly recitation quizzes, four midterms and the final counts as three midterms. The lowest two of the seven are dropped.\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "November 15, 2004",
            "review_content": "\nProf Cornish is brilliant and a good lecturer, but her tests are too hard and she blames poor results on the students, which is not fair. The second midterm was very hard for the amount of time we had to learn the material, and instead of correcting her midterms to make them more accomplishable, she blamed us for not doing the homework (which is not true, at least of me). On top of learning new material, we had to turn in 100 problems every week after that, which was ridiculous.My TA would have been a better TA had she been interested in her students doing better. You learn alot in this class, and it's recommended for those who can't wake up for Katz's\nWorkload:\nit's orgo. what do you expect???\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 21, 2004",
            "review_content": "\nI generally agree with the statements about Cornish teaching well, with harder tests than Katz but a curve.  I might add about the statement that the final questions were ridiculously hard and you'd need to read Nature magazine to get them - DON't BE SCARED away by that.  It's not true.  You don't need to have that outside knowledge, all you need is an understanding of the concepts behind the things you memorized (and oh baby it's a lot of memorizing) and you can make decent stabs at answering the questions which may earn you almost full credit\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "January 04, 2004",
            "review_content": "\nAll right, Cornish, IÂ’ll find a way to be nice. She is friendly, and naturally entertaining Â– calls herself a Â“space cadetÂ” for being a little bit inept in administrative issues, but this isnÂ’t really true Â– sheÂ’s fine. Prof. Cornish will interrupt her generally well organized lectures with random remarks about current events, or about her recent lecturing trips abroad, and when I was in her class, about the dramatic Yankees-Red Sox series. I donÂ’t even know if she realizes how odd it sounds, but itÂ’s certainly hilarious. The only issue I had with work in this class is that she loves to give long problem sets at the worst times Â– and an exam covering four chapters that she doesnÂ’t really go over well in class, right after Thanksgiving break! We tried to get the exam moved, but it didnÂ’t go through because a few people had issues. She talks a lot in class about what goes on in her laboratory Â– mainly research on new protein syntheses. The last exam question is often something on this subject Â– and if not, the second half of the exam is all thought questions of some sort. Premeds, save yourselves the heartache, and the grade, and take Katz. Nobody should even consider Cornish unless Orgo was your childhood hobby. The means on tests are always in the 60Â’s. You achieve the mean by knowing the obvious stuff Â– even a cursory glance at the material earns a mean grade. Additional study is likely to be useless, unless you decide to order and read every issue of Nature magazine ever published Â– this is where her exam challenge questions come from. Much better teacher than Katz, but youÂ’re work will pay off a lot better in KatzÂ’s class. \n\nWorkload:\n4 midterms, and a final (was ridiculous this year). Problem sets Â– youÂ’re grade wonÂ’t be any better if you do all of them rather than just the simple ones. She tells you not to read the book Â– do it anyway, it tends to be more comprehensive than she is, and will help you get more of the basic stuff. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 14, 2003",
            "review_content": "\nwow. i hated this class. mainly because the tests had very little correlation to the class. just make sure you take good notes, because she'll test on something she just glossed over for two seconds. and don't think i'm just bitter because i failed...i did well in the class, but i was just continually frustrated by my long days of studying not really helping on the test. she does have some redeeming qualities, though. she's a pretty nice person, and friendly and approachable...\nWorkload:\nfour midterms, worth one unitfinal, worth three unitsthe lowest two units dropped.\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "November 16, 2003",
            "review_content": "\nThis class isn't nearly as bad as many of the other reviews would make it seem.  Cornish is an extremely organized and good lecturer, and while the material is difficult, she does a good job of explaining it.  She always plans her lectures so that there is review time before the tests, and she is very willing to meet with students during office hours and after lecture to talk about any problems or questions.  She doesn't call on random people but only people who raise their hands, and she makes an effort to learn people's names (which you may or may not like).  Nonetheless she is a great teacher and if you take her course, you will learn the subject well.\nUnlike in the past, the tests are during her class which is in the afternoon.  They are 75 minute exams, and if you have studied you will have no problem finishing well within the time frame.  While the tests are hard, the curve allows those who study to be rewarded.  I recommend her class above Katz's, because his tests are so easy that stupid mistakes really hurt you.  In her class, understanding the concepts will take you a long way.\nWorkload:\nWeekly readings and homework assignments.  She tells you not to read the textbook and just to go by the lectures, but my advice is to study both.  But make sure not to neglect the lecture material, because sometimes she may include something that wasn't in the book in the test.  Recitation quizzes (about 6 for the semester, 2 of which can be dropped), 4 midterms (1 unit eaach) and a final (3 units), and 2 units may be dropped.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "April 14, 2003",
            "review_content": "\nCornish is a great lecturer and instructor. She really explains the concepts well... her tests are probably more difficult than Katz's...but there's a curve so it won't really matter which class you take. If you want to learn the material really well, take Cornish.\nWorkload:\nno problem sets, 4 midterms, 1 final + recitation every week (with quizzes)\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 05, 2001",
            "review_content": "\nCornish has extremely well-organized lectures, but she throws a lot of stuff at you that she expects you to know. The mean for the test is in the 50's most of the time. Expect an extremely harsh grading policy. Although she's nice outside of the class, expect hard tests.\nWorkload:\n4 midterms and 1 final. Approximately 10 problem sets throughout the semester, but not graded.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "April 11, 2001",
            "review_content": "\nCornish seems great at first, until you realize that there is know way in hell you will be able to learn half of what she teaches you. Has an annoying tendency to assign two problem sets right before breaks (Thanksgiving and Election weekend). Puts questions on the exams that the TAs can't solve, and loves to randomly call on people in class (hide!). My advice? Take Katz. People worship him -- and he's supposed to be 100 times easier.\nWorkload:\nFour midterms (worth 1 unit each) and a final (worth 3 units) -- lowest 3 units dropped. Weekly graded recitation quizzes. Problem sets not collected (thank God, because you'll never finish them).\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 31, 1999",
            "review_content": "\nI started out disliking Professor Cornish at the beginning of the course, mainly due to her difficult exams. But, after getting accustomed to her teaching style and tests, I actually developed a great appreciation for the topic. The lectures are very organized, and she's always open to students if they have questions. She passionate about the subject matter and tries to incorporate real-life applications into the lectures. The tests are difficult: the mean is usually in the 50's or 60's. She always puts in an obscure question, but as long as you understand the basic material, tests should be fine. Keeping up with the problem sets is a necessity to do well in the class. BEWARE: Cornish loves randomly picking on hapless victims during class. To avoid becoming the object of intense scrutiny, don't sit next to the TAs or in the back.\nWorkload:\nWeekly recitation quizzes, 4 hour and half long exams (waking up 8:30 in the morning is grueling) and a final exam. Problem sets, which aren't graded, are time-consuming but worth the energy.\n"
        }
    ]
}