{
    "prof_info": [
        {
            "prof_name": "Susan Hanrahan",
            "prof_id": 12698,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "UWriting",
            "review_date": "May 23, 2014",
            "review_content": "\nI think the previous review is a bit misleading. While there is a ton of work and Suzie can certainly be picky about following certain requirements regarding papers and being on time to class, many of the problems or negative qualities cited by that reviewer are (I think) issues with UWriting as a class - not necessarily with Suzie as a teacher. UWriting is a tough class to begin with. Writing is openended, so it's difficult to teach to begin with, especially because students come into the course with diverse skill sets and backgrounds, and most of the teachers are young post-grads who have their own busy lives to deal with on top of teaching this class. Suzie assigns a fair amount of homework. The readings aren't horribly long and they're all pretty interesting. The nightly assignments (you will always have homework due in class) can sometimes be redundant but are for the most part easy, don't take up too much time, and get you actually thinking about your paper or doing some type of work towards it. Homework isn't graded but doing the assignments is actually helpful and she provides feedback on everything. Suzie is super available to students to come in for conferences or correspond over email. I have not yet had a professor respond to emails as quickly or thoroughly as Suzie does. While the class is difficult and there is a lot of work, Suzie actually cares about your development as a writer and your personal well-being. She grants extensions if you have extenuating circumstances and writes extensive comments on your drafts and homeworks. She also baked cookies for us after each progression which was really nice of her to do. Sometimes, however, Suzie was a bit disorganized or unclear, but I think that stems from the fact that she's also a busy student who will readily admit that she is not an expert in writing (no one is). She is also an extremely difficult grader. You are probably not going to get an A (or even A-) in this class.\nWorkload:\nTypical of UWriting. Four progressions. Nightly homework exercises and reading.\n"
        },
        {
            "course_name": "UWriting",
            "review_date": "November 07, 2013",
            "review_content": "\nThis class is literally a GPA killer! Don't ever take this class! The class is really boring and you have to do shitload of work that is totally disproportionate with your improvement. I spend the most time in this class and get the lowest grade. I expect most people in our classroom feel the same. \nShe is super anal about rules and details. For example, she wants to submit both a paper and digital copy for each assignment. \nLots and lots of works. Most of the drafts are due by Friday AND there are additional homework on Tuesday and Thursday. So usually you have to spend Thursday evening doing fucking UW homework! \nHonestly, if you see this, run from this woman! I feel bad saying this cuz she is actually not a bad person but God, I just hate her!\nWorkload:\nShitload\n"
        }
    ]
}