{
    "prof_info": [
        {
            "prof_name": "Sara Switzer",
            "prof_id": 1751,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 19, 2005",
            "review_content": "\nSwitzer has a penchant for inciting audience--you--participation.  I suppose that comes with the territory, but, I became completely turned-off by the gratuitous BS that spewed from my peers' mouths.  \nIf you are looking for a historical component to Art History, Switzer's classroom is not the place to find it.  If you enjoy excercising your BS fetish, sign right up.  \nHere's my simple advice:  This course is a crapshoot, try your luck elsewhere.  \nWorkload:\n3 formal analysis, a midterm and final.\nThe midterm is reasonable, but, the sneaky intellectual lightweight tried to pull a fast one on the final.  She had the audacity to put some slides on the final that she seemed to have purposely omitted from the final slide portfolio.  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 17, 2005",
            "review_content": "\nSara is pretty damn amazing.  She makes the art come alive in the classroom and really challenges students to perceive art through their own unique lens (that sentence came write out of a paper i wrote for her class).  The class is most definitely doable and all you have to do is visit a couple of museums so you can write 3 papers, and then study, study, study for the final which is pure memorization (and actually kinda difficult, b/c u have to know EVERY SINGLE PAINTING/SCULPTURE shown in class.  Overall though, art hum was a great experience with Sara and you'd be very lucky to have her as your professor.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 20, 2004",
            "review_content": "\nYeah, she's definitely pretty good; I actually liked this class ahelluva lot.  She's able to make the discussion pretty interesting, even when everyone stares blankly at the slide like stunned cattle.  You're definitely gonna have to work if you want to get an A, but I really found it worth it, and even enjoyed writing the three papers.  Also, the tours she took us on at the met were really interesting.  Still, you are going to be putting a fair amount of time into art hum if you want a good grade.  \nWorkload:\n3 papers where you have to go to the met, St. John the Divine, or somewhere else off campus.  midterm and final, on both of which she'll put some pretty random ass shit.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 26, 2004",
            "review_content": "\nI loved this class!  Sara was amazing & very open once I showed interest in the material.  This class changed the way I looked at art & now I'm seriously contemplating in changing my major.  Her exams are really hard, but at the end, it will all be worth it!\nWorkload:\nVery fair.  However, memorization overload for exams.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 09, 2004",
            "review_content": "\nIt took me a little while to figure out whether she was really nice or retarded, but after a while I realized she's smart and respectful of her students, which isn't something you find often in this class.  It's also really dependent on who your fellow classmates are, so it took a little while to get used to her style and dealing with some of the stupid comments said in class.  But seriously, she knows what she's talking about, gives positive feedback, makes the material interesting, and is totally personable.  Two enthusiastic thumbs up.\nWorkload:\n3 papers, midterm and final, fair grading everywhere\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 20, 2003",
            "review_content": "\nReady to look at and memorize a lot of slides?  Then Sara is your teacher.  Every single class was staring at slides, some interesting and some really boring.  She usually engages the class in analyzing the works, however.  Art with Sara was usually not boring, and she's helpful and nice, especially if you ask for help.  For one of the essays, I asked her to look at a draft and she spend two hours of her own time sludging through my analysis of a sculpture.  I made her revisions and got a B+, so go figure what you can from that.\nWorkload:\nA lot of slides, three essays,, a midterm and a final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 03, 2003",
            "review_content": "\nYou will learn something here for sure. Since there is not much choice for the core classes as to what prof you'll get, you should be happy with her. She is a grad student and has studied in Italy-so she knows her shit! She is pretty demanding and makes clear that arthum is not a cake walk at all...but she is very nice and helpful and incredibly supportive especially when you are interested and attend class regularly. Overall, if you have her be happy-it could be much worse!\nWorkload:\n3 short papers (formal analysis is a bitch) midterm and final ( too much dates to know by heart)\n"
        }
    ]
}