{
    "prof_info": [
        {
            "prof_name": "Kathleen Smith",
            "prof_id": 3225,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "September 06, 2012",
            "review_content": "\nKathleen Smith is a wonderful, wonderful professor. That is, once you accept the fact that she is extremely intimidating and learn to speak up even if you're absolutely terrified. Being a first-year at Barnard you receive an abundance of warmth and support from your deans and faculty member. Kathleen will not be in that category of faculty members.\nThat being said, she is an amazing, AMAZING teacher. As I said, speak up in class, even if you think you have nothing good to say. Participate, get involved in discussion, and do it voluntarily so she doesn't have to call on you for the difficult questions. If possible, sit right near her so she'll know you well. \nShe's a harsh grader, but if you're writing improves through the semester, which it will, your grades will reflect that. Also, you can meet with her after your first draft of your essays and she will have a lot of tips of how to improve. Follow those tips! She knows best.\nKathleen is extremely enthusiastic about the books she teaches and has a lot of great insight. You'll realize how brilliant she is through the semester. Trust me.Take notes on what she says in class- it can help you for your essays.\nLast of all, I am so super jealous of anyone who gets to take this class. I'd love to go back and take it again. \n\nWorkload:\n1-2 Readings a week\n3 Short papers and one long research paper (that you will have help with and it will be spaced out)\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "February 19, 2012",
            "review_content": "\nI had a very difficult time with Professor Smith. Yes, this woman is a genius, but she is also very intimidating and overbearing. I felt she was overly critical, and not necessarily in a constructive way. She would say things like, \"Most of your Courseworks postings this week were really bad. A couple of you had meaningful things to say, but most of them were just really, really bad.\" Another time she said to us, \"Sometimes people get very upset when I give them a bad grade on a paper. They think it means they're a bad writer. But I always tell them, it's okay, this doesn't mean you're a bad writer. You just wrote one paper that was really, really bad.\" There may occasional postings or paper that are just \"bad,\" but I feel she could have been kinder and more supportive of us and our writing. She didn't really seem to want to see me succeed. I felt like I would work and work on papers and talk to Professor Smith multiple times but could never make them good enough for her. I found conferences with her more confusing than helpful. She would try to get us thinking about our topics in new and original ways, which was a really good sentiment, but I often walked out of her often feeling like I had just become more hopelessly confused. Also, I found her extremely indimidating in class discussions. She constantly challenged our ideas and terrified me into staying silent much of the time.\nI think someone who is very confident about speaking in class and who is already a very strong writer would benefit a lot from taking a class with Professor Smith. However, when it comes to encouraging people to have confidence in their ideas and develop writing skills, which are basically what First-Year English is supposed to be about, I found Professor Smith to be quite lacking.\nWorkload:\nQuite manageable -- 3-4 short papers and one 10-12 page research paper.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 16, 2011",
            "review_content": "\nAfter taking a half-semester's worth of CC, I can without doubt say that I miss Kathleen so much. Her ability to guide class discussion without being too overbearing, the way she never shoots down and even develops the most inapplicable responses from students, and the fact that she is able to build a personal relationship with every student in the class. Out of the classes I took freshman year, I can proudly say that I learned the most from Kathleen's LitHum class even without doing all the required reading, and of course there were times when I didn't want to go to class (not because of her teaching but just because it's LitHum), but once compared to the CC professor I have right now, Kathleen Smith is a god. Take her if you're one of the few 20-or so lucky souls who have been blessed with a chance to be enlightened. \nWorkload:\nDoesn't matter. Good ol' LitHum readings that I'd do any day over The Metaphysics or some crap CC book that doesn't make a lot of sense.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 07, 2011",
            "review_content": "\nThis lady is seriously the fucking best. My favorite professor freshman year. Maybe still my favorite professor. She knows everything, and if she doesn't know the answer to your question, she'll admit it, and then return the next time you have class with a bunch of knowledge on the issue and some articles for you to read.\nIf you come to her for help, she will help you, and she will be gracious and thorough and very engaging and really, really fuckin intelligent. She also works super hard outside of her teaching duties. Her phd thesis is baller and I think she was asked to be a dean of GS (?) and pretty sure she tutors kids from low-income communities (?) and she most likely fights crime by night.  \nHonestly she is just brilliant and will always encourage student participation and involvement and then work with your comment to make it more thorough and more incisive, etc. Our entire class had enormous respect for her as an academic and human being. She was really, really funny, too, and the class had a great vibe and people even became friends in it, which was cool.\nWorkload:\nhard but not way too hard, standard lit-hum\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 24, 2010",
            "review_content": "\nShe is simply outstanding. I've never seen a teacher more effectively, dynamically, and, most importantly, organically, guide class discussion. She always comes in with an agenda for discussion, but does not insists on sticking to it, if the discussion promises to head in a an alternate direction. Even the plans that she makes are guided by the students' online discussion postings for the week, and she will call on certains students to elaborate on their postings in class on certain days. These postings, plus the two required presentations per semester, give even the shyest students a chance to be heard in a setting where, often, those who shout the loudest are the ones heard most.  I know for sure that if I didn't have Professor Smith for Lit Hum I would have gotten substantially less out of the class. But, since i have her, it's basically my favorite class so far--and this is coming from a fully math/science guy. \nWorkload:\nUsual readings, 2 papers per semester, 2 in-class presentations per semester, weekly postings. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 10, 2010",
            "review_content": "\n(ON GENESIS)\nKathleen mentions food;\nsomeone draws an apple with\nshimmering meaning\nKathleen is a very memorable person. And when I say that, I mean it in the way that if you take a class with her, you will learn all the necessary information and then some, because every other thing that comes up in discussion will come from your own breadth of knowledge and let you discover hers. Class topics came from postings we did the night before, which had no purpose other than to let us think about the material independently and show her what we were interested in. They were required, but led to more thoughtful and interesting discussions.\nWhen she felt as though we could handle the material and that discussion was going well, she was always the facilitator and never the dictator of a conversation. When she did lecture, she came in with mounds of prepared material for us to read at our leisure and her own researched presentation, frequently a visual and auditory one, that brought us more in touch with the time that we were reading about. Above all, her efforts were purely for our benefit. It's amazing to think of how she did it on top of her extremely busy schedule which includes writing her dissertation.\nI had such a great time with Kathleen's assignments. The main work in this class was keeping up with the readings (~100-300/wk, depending on the book), but we also had to do two essays during the course of each semester. The prompts were usually some delicious mind-candy, either being generally intriguing or encouraging to think of the work more creatively. In fact, our last assignment of the year was creative projects of our choosing, which was not as easy as it sounds. Each member of our class probably spent more time on these projects than they would have writing an essay, and I believe that's a testament to how much each of us like and respect Kathleen.\nKathleen, in short, genuinely cares about each of her students. She is quicker to understand a problem than criticize it, doesn't play favorites, and will foster your strengths and help improve your weaknesses. You will work hard, but you will feel that everything you are doing is productive and worthwhile. She will add some excellent overlooked passages. She will bend rules or even break them or when it means improving something or having the chance to seeing it in a new way. And did I mention that she's hilarious?\nI still think and talk about the ideas we learned in this class at least once a week, if not every day. Maybe it's because our class had a great dynamic. But it's also because of Kathleen made sure we wouldn't forget.\nWorkload:\nTypical Literature Humanities reading, two essays per semester, a midterm, and the final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2010",
            "review_content": "\nConsider yourself SO LUCKY if you are put in Kathleen's section. Seriously. Literature Humanities was the most worthwhile class I took as a freshman- we read great books under the direction of an absolutely brilliant professor. Kathleen would give us a lot of historical background for many of the texts but was never too overbearing- just enough to contextualize the themes and she also often provided supplementary reading (that was always super interesting) if we wanted to know more. She was really good at gauging the direction of the conversation and asking thought-provoking questions- she also often asked us to consider contemporary issues in relation to the themes in our reading. Keep up with the reading so that you can appreciate the class discussion, you won't regret it.\nWorkload:\nLit Hum Syllabus (no books were cut, some readings were added in the 2nd semester), 2 Papers per Semester (the last one of the year was a creative project of one's own design), 2 In-Class Presentations, One online posting per week\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2010",
            "review_content": "\nIf I ran Columbia, I will make it my goal to get this woman tenured as quick as possible. While only a grad student she is easily one of the brightest instructors I have had this year. I enjoyed going to lit hum every class, and with her present there was bound to be fruitful discussion. Unlike other lit hum classes she empowered the students, hardly did she talk, but when she talked she made each of her words valuable. And although she fully empowered students to take control of the discussion, she was in no way spineless. She has a very acute bullshit detector, and makes sure that if you intend to contribute that it is something meaningful. For every work we read she would have supplemental material to help our understanding of the work. Mind you she does not get paid to search, print, and bring extra things to class, yet she was always sure too. As if that was not enough, every now and then she would come in with snacks, and we would eat cookies while talking about Crime and Punishment or pie while debating over Woolf. The class was nothing short of amazing. I don't think there was a person in that class who didn't enjoy her presence.\nNow, I have to be honest, in the beginning she does not come off this way at all. She seemed...odd. She had this very unusual sense of humor and would laugh at her own jokes while the class just stared at her. And her laughs were very weird sounding as if she was half choking on laughter. Not that any of that matters but I thought it would be good to know in case anyone is put off by the first lecture.\nAny and all of you will enjoy her class, so please do yourself a favor and take her. \nWorkload:\nStandard Lit Hum Readings. Optional supplemental readings she would bring in. Two 6 page essays a semester. Two required in class presentations a semester.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 21, 2007",
            "review_content": "\nI took Kathleen's class last semester, and I must say that it was a great introduction to Columbia. My first impression of Kathleen was that she was a bit hands-off, even aloof, and that she was unable to get her message across to the students in my section (which was not necessarily her fault.) It seemed as though that every class period, after Kathleen would transcribe her theories on the board, half of the class was completely lost, whereas the other half was too focused on their own opinions to be concerned with hers. At the beginning, I fell into the latter group, but as we began to write our assigned essays, Kathleen proved her abilities as an advisor by helping us all tremendously.\nDespite dedicating her entire life to her doctoral work, Kathleen was very helpful with scheduling times to speak with us about our essays. Her deep breadth of knowledge was remarkable, as I would not expect a girl from southern Illinois would be able to speak authoritatively about ancient philosophies, major league baseball, inner city health code violations, and pornography, (and also quote Kanye West verbatim). This allowed for us to be fed very interesting topics for our assigned papers, which came with quite a bit of feedback.\nOverall, Kathleen instilled in me a confidence in my writing capabilities, and UW made me enthusiastic about writing essays. She proved that writing any paper assigned, when done creatively, can be an enjoyable experience. Take Kathleen's class!\nWorkload:\nThe usual...4-5 page Lens, 5-6 page conversation, 10-14 page CCP, and 2-3 page retrospective. Also, about ten reading passages assigned on Courseworks, which each took less than an hour. \n"
        }
    ]
}