{
    "prof_info": [
        {
            "prof_name": "Lindsay Gibson",
            "prof_id": 11643,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 23, 2013",
            "review_content": "\nLindsay is a GOD of a teacher. Possibly the best teacher I have ever had. She really knows how to work with each student differently and will spend as much time as you need helping outline an essay or just talking about a topic. The class is very involved in discussion and she loves when you participate. If you can get in this class, you should and you won't regret it a single bit. The essays are manageable and she usually pushes back deadlines or will give you an extension if you ask kindly. The course pack she requires each student to get is very do-able and the readings are really interesting. Lindsay rocks. Take her class. \nWorkload:\nabout 15-30 pages a class of reading from the course pack, as the course progresses you don't have to do the readings because the essays don't really relate to them. never felt stressed with work for this class, Lindsay is always able to help. The essays are the typical u writing essays, 1 3-4 page, 1 4-6 page, 1 6-8 page and a 4th progression. not bad at all, TAKE HER CLASS \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 21, 2013",
            "review_content": "\nAs an earlier review said, Lindsay taught this semester's class solely focused on DFW's writing. Lindsay has a really great sarcastic sense of humor - I was always guaranteed to laugh every single class. I heard many other people complaining about how much they hate UW and the work - Lindsay definitely does her best to make UW the least painful experience possible. She knows that we have other things to do and don't necessarily have time to do all the readings - the way she ran the class was very laid-back. \nWorkload:\nvery light. we only had 3 essays instead of the party line 4. Instead, Lindsay started doing vocab quizzes with us every week (sometimes skipping weeks) that replaced our 4th essay (10% of the grade). The quizzes are easy - she sends out the list of 10 words beforehand and also offers two previous words as bonus. It's an easy way to get an A+ on an essay and also not have to worry about rewrites during reading week!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 12, 2013",
            "review_content": "\nLindsay was great. She taught us how to write with some pizzazz and exposed us to current writers, rather than get mired in stuffy old theory. She has a good sense of humor. And the fact that she doesn't always respond to emails just shows she keeps herself busy and has better things to do. She always was prepared to meet when I needed her, so I figure that's what matters.\nAnyway, thank the academic gods I got her. Uwriting could have been hellish.\nWorkload:\nAll the normal progressions. Interesting readings. Not a bunch of extra stuff.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 03, 2013",
            "review_content": "\nI almost switched out on the first day of uWriting because I can't stand Lindsay's voice. I can't believe nobody's mentioned it yet--she has this weird way of speaking that takes a really long time to get used to. She tries to add something clever to the end of every sentence and on the first day I found it really irritating. It doesn't help that my class was horrific. I was in a Gender Studies section and was surprised to find that not everyone knew what a comma was.\nThat said, if you get Lindsay for uWriting, stay in the class. She's actually kind of funny once you get used to her awkward sense of humor, and she's very understanding about the fact that uWriting is the silliest course in the Core.\nPerhaps the best part about Lindsay is that she doesn't give a flying shit about the structures of uWriting past what she has to to keep her job. Her essays all have a lower word count than the standard essays, she is very lenient about due dates (email her for an extension on anything and she will grant it) and she really has no interest in the reading. She will never give a quiz, she will rarely make you discuss it, and she doesn't really care how many classes you miss as long as you seem like you have a passable excuse. I would recommend Lindsay because although you will never learn anything, she's not going to make you pretend that you did. If you already know how to write, she just expects that you do your essays, and as far as I could tell nobody in my class got anything lower than a B (she says it's very hard for her to give Cs when she knows the people she's grading, whatever that means). Also she is talking about teaching a class exclusively on David Foster Wallace essays, and I think that would be really interesting. Lindsay is also very conscious of the fact that she's really only 6 or 7 years older than her students, so she doesn't pretend that she knows everything. Really she's just a student trying to help other students and compared to the kind of teachers you could have for uWriting, Lindsay is a safe bet.\nWorkload:\nThe usual 4 essays, but Lindsay didn't really care what they were on or when you turned them in. Didn't do any of the reading after the first one--didn't even have the coursepack.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 30, 2013",
            "review_content": "\nI LOVED my UWriting section with Lindsay. She is by far the funniest teacher I've ever had. I was in a gender studies-themed section; Lindsay didn't really care about gender studies and only chose readings that she found \"delightful\", some of which had a definite gender-studies-relevant leaning and some of which did not. She isn't bothered if you haven't done the reading and doesn't make her students do free-writes or responses (busywork required in most of the other sections) and has negotiable due dates. Discussion was always lively.\nAll of that aside, she is a good teacher. Other reviews have described her as inaccessible; I did not find this to be the case. She's readily available during office hours and responded to most of my e-mails; if she doesn't respond, just find her in class. She definitely helped me improve my writing skills, mostly by bringing structure and focus to my writing. She's knowledgeable, engaging, and whip-smart. As a grad student, she understands the workload of her students and isn't totally anal about due dates. She demands that student essays be stapled correctly. \nWorkload:\nSame number of papers (4 progressions), but sometimes with a lower-than-standard word count. Some reading each class, usually interesting. No free-writes or journaling. Each paper had an outline, rough draft, formal draft, and final draft. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 16, 2013",
            "review_content": "\nI went into the class fairly discouraged by the first review on this page, but it turned out to be my favorite class all term. Classes are mostly discussion, and she was very supportive of anyone who commented. She has a unique, humorous way of speaking that made class lively and fun. She's very lenient and understanding of any problems you may have with writing or getting work done for class, and often pushes deadlines back. She's a stickler when it comes to getting to class on time and the format of the papers you turn in, but if you have problems with that, reevaluate your priorities. Readings were chosen by her, and she puts a lot of effort into keeping them interesting. Most people enjoyed almost every reading assignment she gave us, and they're very instructive in terms of writing style, if you appreciate that. \nI did not have the same email problem that the other reviews brought up. I emailed her quite frequently and she always responded. On one occasion, I had to wait two days, but mostly she responds in a timely fashion. She gives tons of helpful feedback on drafts and essays, and she's always available at the Writing Center if you need more advice. As the previous reviewer said, having specific questions is helpful, but even if you have no clue what you're doing, she does a very good job at pointing you in the right way.\nI was fairly confident with my writing going in, and I didn't have much trouble with the assignments, but if your writing is not stellar, she's not the best teacher for that. I feel like she holds back on saying some of the harsher or more general things, choosing instead to focus on details. Several classmates complained that they got grades below what they'd expected from the comments she'd given them on their drafts. If you're looking to improve your writing style, she's probably not the best choice. I would still highly recommend her though, and friends from my class who got lower grades adored her all the same.\nWorkload:\nLight, interesting readings for (almost) every class. Standard number of essays, with a outline/draft beforehand that she gives back promptly with comments attached. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 26, 2012",
            "review_content": "\nAlso a review for UWriting.  The previous reviewer is right in that Lindsay doesn't provide a lot of support to students who are really struggling, but she is a funny, engaging, and (mostly) lenient instructor for writers who feel that they don't need the support.  She never gave us the piles of busy work that other sections get, we very rarely stayed the full amount of class time, and she's hilarious.  About contacting her--true, she almost never answers your email unless you mark in the subject that it's important or urgent, but she's always in the UWriting center during her office hours if you need to see her (and if you do come with specific questions and problems Lindsay's critiques are on point and highly helpful).  Highly recommend Lindsay for a certain type of student.\nWorkload:\nVery light in terms of homework in comparison to other sections, but with the standard number of drafts and papers (1 3-4 pg, 1 4-5 pg, 1 6-8 pg, with a brief proposal, a detailed outline, and a rough draft required for each, with one week intervals to complete each).  Readings from the standard UWriting selection, though Lindsay's choices are better than what some others got.  Due dates are flexible and often postponed.\n"
        },
        {
            "course_name": "Essay Writing (Journalism)",
            "review_date": "May 10, 2012",
            "review_content": "\nThis review is actually for University Writing. She doesn't return emails. She doesn't really give out too much busy work. She grades her essays pretty hard. I tried to e-mail/ask her for help, and she didn't respond. If she does help, she is reluctant and wants you to figure everything out. One time I emailed my essay to her to see if she could find any faults with my argument and all she said \"much improved.\" Then I got a B on the essay. Unless you are a naturally gifted writer, do not enroll in her class, because she doesn't help/guide you at all. \nWorkload:\nNot too much work in the class, but that doesn't make this an easy class! Be prepared to spend all the free time in the class where she doesn't give out HW to edit/nag her to help you with your essay if she is willing. \n"
        }
    ]
}