{
    "prof_info": [
        {
            "prof_name": "Sarah Klock",
            "prof_id": 2891,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "June 06, 2006",
            "review_content": "\nSara is a great teacher. Taking U Writing with Sara really changed the way I viewed things. My high school basically taught me to stick to one side of an argument and totally ignore the other but Sara taught me to see both sides to help better support my arguments. She usually expects top notch writing and grammar and will give you the basic lowdown on the stuff, but she isn't a a grammar school teacher or anything like that. She also likes to discuss a lot of things and she's very supportive of students' ideas. Speak up in class because it really counts towards your grade!  \nWorkload:\nA couple of papers, a lot of mini assignments, and a presentation, and a graded reflection after everything\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 08, 2006",
            "review_content": "\nA very nice teacher with a good understanding of how to teach the course. Very methodical but interesting... kind of a pushover, though. Ridiculously easy to get in touch with and very helpful in and out of class.\nWorkload:\nIt's University Writing... three real papers and one blow-off one, a writing assignment pretty much every night. Straightforward.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 20, 2006",
            "review_content": "\nAmazing. I have never had a more wonderful, lively, fresh, perfect, kind, AND encouraging teacher. She is so dedicated to her work and her students, and it really shows. Take her class if she teaches next year. Fabulous woman and BRILLIANT!\nWorkload:\nstandard UW. doesn't give busy work and hates to waste your time on unnecessary assignments. \n"
        }
    ]
}