{
    "prof_info": [
        {
            "prof_name": "Christina Charuhas",
            "prof_id": 10680,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 22, 2010",
            "review_content": "\nI took Arthum as a freshman so I was in a class of people with previous (and often extensive) background in art history. I had never taken an art history class before this and so it was a bit intimidating at first participating in class discussions.\nBut Christina was wonderful! Her commentary on the art is very concise, and when she solicits feedback from her class, she's quite encouraging with our responses, even when the artistically inclined portion of the class obviously thought otherwise. On the first day of class, she asked everybody to describe their art/art history background. I had the impression that Christina encouraged people who didn't have that background but showed relatively more skepticism towards those that did, even when their comments were vastly more insightful. I thought she did a superb job getting everybody to participate regardless of what you knew about art before class.\nI definitely learned in that class. This ArtHum class teaches you how to approach art and arms you with the language to describe your observations.\nChristina is extremely articulate and I was/am really jealous. This might be because she's a graduate student whose life must be dedicated to reading artistic criticism, but she consistently and effortlessly distilled the crux of the artist or art in her commentary. I  recommend you take thorough notes during class because the language she (and your classmates, if you end up in one where the people are experts on every possible medium in art, like mine were) uses becomes valuable for the essays.\nSo back to the scary artistic classmates. I got the impression some of them weren't as impressed with Christina because of the \"stock\" art we studied (Parthenon, Raphael, Picasso, Warhol, etc. etc.) and because her interpretations were relatively conventional. I don't think that's her fault, because ArtHum is about introduction to art history catered towards people like me, who don't have the background. Even though my class very easily could've handled unconventional or radical interpretations or w/e, Christina kept the class along the curriculum and close to its purpose.\nOverall, Christina is a wonderful teacher for people who come into the class with 0 experience in art. And for those people who want to walk away from the class knowing how to do some basic but legit visual analysis. \nWorkload:\nRegular readings, which she asks the class about every other week. You can easily get away with not reading them, but I'd strongly recommend for those that's new to the subject to do them\n25% Participation\n10% A four page visual analysis on either Grant's Tomb or Cathedral of St. John the Divine.\n20% A take home midterm which is just visual analysis. I sort of regret being as honest as I was with this one.\n15% A seven page visual analysis of two paintings at the Met or the MoMA.\n30% A final project where you designed your own exhibit.\n"
        }
    ]
}