{
    "prof_info": [
        {
            "prof_name": "Paul Stephens",
            "prof_id": 2164,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 21, 2005",
            "review_content": "\nPositives: He's easy-going, approachable, and a fair grader. He gives a good amount of background information (pay attention to those for the trivia questions), and gives a detailed explanation to any abstruse Kantian or Marxian concepts you may have a problem with.\nNegatives: He doesn't comment much (from the 4 papers I've had over the year), and often may go tangential in his lectures.\nOverall: He's a good guy. If you want a laid-back CC class, make sure to choose him. \nWorkload:\n2 papers - a 5-7 page, and a 7-9 page. 1 midterm - term IDs, passage IDs, 20 trivia questions. 1 final - passage IDs, essay. A lot of extra, but manageable,  reading second semester.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 18, 2005",
            "review_content": "\nHaving spent the greater part of my Columbian life rotting away in SEAS, growing increasingly bitter with every \"My Lit Hum professor is so amazing!\" echoing throughout the halls, I knew I had to see what I was missing.  Paul is equal parts funny, easy-going, witty, generous and generally awesome, and he is the epitome of what makes CC amazing.  His class solidified in my mind that SEAS was a waste of my life.  It is also fun to run into him around campus.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 10, 2005",
            "review_content": "\nI disagree with the other two reviews.  I found that the class discussions were not that insightful and that he tended to talk a lot.  Didn't know a lot of background information about the books and context, mostly because his focus is on the second semester books.  Nice guy, but I just don't' think he's that good of a teacher.  Obsessed about \"ataraxia\".  Easy enough class, but not amazing.  \nWorkload:\nOne 5-7 pg paper, one 7-9 pg final paper, midterm-3/5 IDs, term IDs, trivia section-not too bad if you pay attention in class and to main details in the books, final-4/5 IDs, essay.  One student is responsible for bringing in 2 questions for each class.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "October 16, 2004",
            "review_content": "\nThis is one of the best classes I've taken at Columbia. I arrived at this school cynical about the Core Curriculum requirement, and LitHum reinforced that cynicism. Contemporary Civilization had the potential to do the same, but Paul Stephens is not only passionate and knowledgeable about his subject, he also makes it relevant to current events. Not content merely to summarize the philosophies of dead white men, Paul is intent on making the subject matter come alive, which fosters spirited debate and an amazing class dynamic. \nSo while Plato spends the entire length of the Meno trying to discern the meaning of \"arete\" or \"excellence,\" Paul embodies that concept from the first day of class to the final. When Paul finally gets his Ph.D. and gets out of here, it will be a great loss to CC students.\nWorkload:\naverage for CC. one 5-7 page paper a semester, one longer final paper, a midterm, a final. 100+ pages of reading per week.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 08, 2004",
            "review_content": "\nCould be the best professor I have had at Columbia, and his easy-going yet extremely knowledgeable teaching style made for my most positive experience of the Core. Paul is tremendously good-humored, fair (to generous) in his grading, and consistently manages to transfer his enthusiasm for the texts (most texts, anyway) onto the class. Cetainly a CC class to seek out.\nWorkload:\nAbout average for CC. One 5-7 and one 7-9 page paper per semester. A midterm consisting of term definitions, quote IDs, and a rather challenging trivia section (pay attention in class). Final with IDs and Essays.\n"
        }
    ]
}