{
    "prof_info": [
        {
            "prof_name": "Troels Jorgensen",
            "prof_id": 124,
            "total_reviews": 41
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "January 23, 2013",
            "review_content": "\nJorgensen is the best I've had thus far.  He's funny and his notes are crystal clear, and does care to some degree. I feel he has polished his craft of teaching after so many years of dealing with students.  He tries to make the class fun and somewhat theoretical, he teaches what you need to know to move on to further math.  His grading could be unfair though, no partial credit.  Doesn't use a text book either.\nWorkload:\nhomework due every class (1 hour, easy to fair)\n3 Tests (fair to difficult, grading is harsh, no partial credit)\nFinal (fair to difficult, harsh grading, and counts for 90% of grade)\n\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 08, 2013",
            "review_content": "\nI'll be frank with you. I got an F in Jorgensen's class. I had straight A's in Calculus AB at my competitive high school. \nI agree with the other reviews recently written in December of 2012 as well.\nHe does not know how to teach. He assumes you are already a Calculus II expert and spends most of the time just doing problems he thinks are interesting. He works problems very quickly and the students in my class (including me) would frequently get lost. (You could tell because everyone would look at each other and have that \"what is he doing?\"-face on.)\nDo not be fooled by the \"easiness\" of the class. There are 2-4 homework problems each class and 3 tests that supposedly do not count.  \nNo textbook is used.\nHe does not communicate via email or phone, so it's just in-person meeting times. \nI honestly was not the best student, but I do not think I deserved an F of all grades. Maybe a C- or D but never an F. \nI am convinced that Columbia keeps him in the math department because he is a brilliant mathematician and does not consider his horrible teaching.\nPLEASE DO NOT TAKE THIS CLASS OR ANY OTHER CLASSES WITH TROELS JORGENSEN. \nIT IS NOT WORTH YOUR TIME OR MONEY AT ALL. PERIOD.\nI wish someone had told me how horrible this professor was before I took the course. Now I have to deal with an F on my transcript, which is going to be a long and irritating process to fix.\nDon't make my same mistake, say no to Jorgensen. \nWorkload:\n2-4 homework problems per class (each homework is due the next class)\n3 tests (which don't count) \nFinal Exam (COUNTS FOR EVERYTHING)\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 25, 2012",
            "review_content": "\nSo many mixed feelings about this class. I received a pretty terrible grade, but I really just took the class for AP credit and had almost zero work the entire semester, so it was a reasonably fair trade-off, as I had more time to devote to other classes where I actually had a chance to do well. This is definitely the section to be in if you're not overly concerned with your GPA and don't plan on taking much more math.\nLectures: I think the way Troels began the first class set the tone for a lackluster semester. He coming in, walked to the blackboard, and said, \"This is a course in integration,\" then started writing without any introduction or syllabus. I learned next to nothing from Troels' lectures other than the formulas for integration by parts and single-variable curvature (what?). Every class was the same - \"solutions\" for the hw problems which involved leaps in logic that us non-mathematicians were incapable of following, the simplest problem from the next section, and a proof for something like the volume of a sphere which was usually a sign to stop taking notes.\nWhen asked for advice on how to solve one integral, he said, \"You know, when you get to my age, sometimes, you just have to think about it. Maybe ride the subway or take a walk and it will come to you, like 'ah'!\" Truly a brilliant mind.\nExams: Short, but not easy if you haven't taken AP BC. There was never any indication as to what topics would show up; for the final, he told us to study arc length and curvature, then tested us on series and infinite sums. On his third midterm, one question required the use of methods used in calc 3, and when confronted on it, he asked who was enrolled in both courses and shrugged. For most of the exams, the only directions were \"compute,\" and computing is what will make or break you. A few arithmetic errors will drop you from a B to a C on the final, and don't expect partial credit either. If you truly are a math person who doesn't mind the computations, you'll consistently get A's.\nDid poorly on an exam and want help improving? Don't bother going to the math help room - Troels' methods for doing problems are as much of a mystery to them as they are to you. Office hours were \"by appointment\" and were about as useful as the classes. Oh, and he doesn't hand back the homework until AFTER the exam. Good luck!\nGrading: Nothing but smoke and mirrors. On the first day of class, he claimed that as long as you attend class, do the homework, and take the exams, you'll \"pass.\" Not very reassuring. He takes off points on homework and exams for what he considers sloppy handwriting, or showing TOO MUCH work. Your final may count for 100%, or it might not. Midterms and homework might affect your grade, or they might not. Who knows? Just don't expect much unless you've been doing great the entire class. As mentioned before, partial credit is sporadic. On one exam, it appeared as though I'd lost more points than a question was worth, and Troels just said that \"your grade depends on your performance as a whole, not individual questions.\" What? I'm interested in seeing what percentage of the class received grades in the A-range, which was mysteriously absent from my transcript.\nOverall, this was the easiest class I took this semester, but also my worst in terms of amount learned and final grade. If you choose to take this class, come in with low expectations, and be wowed as even those aren't met. Enjoy!\nWorkload:\nAbout 6 hw problems a week (can be solved using wolframalpha). Three midterms. Final that probably counts for 100%, which is impossible to get below a C.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 13, 2012",
            "review_content": "\nLike many have said before me, your final grade is based entirely on the score you get on the final. Depending on how good you are at calculus, this can either be a ridiculously good thing or a ridiculously bad thing. \nSeveral things:\n1). Jorgensen will give you no work. No textbook work, no matlab; you will have no more than two to three easy problems to do for each class. The class is fairly easy, provided you actually go to class and motivate yourself take notes. If you're the type of person who will probably start skipping class into the semester, you probably will not do well.\n2). Jorgensen does not use the book. You don't even need to buy the textbook. He also doesn't use a syllabus. So what does he teach? You could say he makes up his own curriculum. He'll probably teach you curvature functions, hyperbolic curves, cardioids, etc. He will not teach you the various ratio tests and other common Calculus II topics. Hence, since he has the tendency to teach very uncommon things, you don't really have the option of skipping class. \n3). Jorgensen assumes you have pre-existing proficiency with Calculus II, and has the opinion that it's as easy as algebra. Thus, he has a tendency to skip a lot of steps in his explanations. You will probably get lost once or twice every class. There's really no need to worry, because if it looks unduly complicated, it will never show up on the final. \nGood teacher? Not really. However, he was certainly the easiest I had this semester.\nWorkload:\n2-3 homework problems per class\n3 midterms (they don't count)\n1 final (100% of your grade)\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 06, 2011",
            "review_content": "\nJust going to add to the rest of the relatively accurate reviews that I'm doing calc 3 now and we are working through second order differential equations.  Joerg decided to skip chapter 9 of Stewart (Differential Equations) in our calc 2 class.  As I recall, it was replaced with some rambling on the cardioid. I will however quote the Chapter 9's first sentence:\n\"Perhaps the most important of all the applications of calculus is to differential equations.\"\n..good thing we got the cardioid down pat.\n\nWorkload:\nFine\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "September 09, 2011",
            "review_content": "\nAfter introducing new topics, he would go over many examples. His explanations were simple with clear diagrams of gradients and vectors. He was patient with all questions. \nMy only complaint about the course was that he didn't finish the sample syllabus. He stopped about 2/3 of the way through. However, after taking more math, he only skipped the easy stuff and spent the most time on the hard stuff. The material he skipped was easily covered in Calc 4. He also introduced some concepts and terminology slightly outside the suggested syllabus and, 1.5 years later, I'm glad that he did.\nWorkload:\nshort 3 or 4 problem homework due every class. 3 tests during the semester which don't count. Final counts for everything.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 22, 2010",
            "review_content": "\nSuch a bizarre class. Took it first semester freshman year after scraping a 4 in AB my senior year in high school. Looking back, I don't know why I took Calc II--I guess I wanted to challenge myself and although Calc II isn't regarded as a challenging class at Columbia (even for freshmen), I figured it would be for me. \nBoy was I right. Everything about Jorgensen's class was a challenge--from finding time to copy down his explanations of the cardioid before he erases them to figuring out if the word he just said was \"theta\" or \"zero\" to getting a clear answer when you ask about the topics for the upcoming midterm. Teaches maybe half the concepts of Calc II mixed in with random lectures on Calc III topics. This guy just doesn't give a shit, plain and simple. To reinforce what you read already, DO NOT TAKE THIS CLASS IF YOU PLAN TO TAKE HIGHER MATH. You'll get an A or a B if you give half a shit, but that's only because the midterms and homework don't count for anything...and the final (which, as rumored, is 100% of your grade) is insanely easy.\nIf you're a fan of syllabi, lesson plans, office hours, e-mails, review sessions, any student/professor discourse that helps you study and clarify the material, take someone else's class. If, like me, you took this class for no particular reason, regret your decision, and just hope for a satisfactory grade, then at least you have nothing to fear. You pretty much can't fail unless you don't show up most of the time, do none of your homework, and scribble on the final. I got a B- (extremely low for that class, I think) and I either skipped or daydreamed during every lecture, failed every midterm, and did maybe 2/3 of the assignments. I learned how to do two new things: integrate by parts and expand taylor series. The final is a mix of calc I and II, so I guess I shouldn't be surprised. \nOverall: Jorgensen's class is confusingly unsubstantial, a trivial, forgettable foray into mathematics in what I predict will be an otherwise math-less college career. Although I can't guarantee you'll learn anything about calculus when you take it, you might just learn something about black holes. Because that's what this class was for me: A BIG, GAPING BLACK HOLE.\nHappy integrating!\nWorkload:\n1-2 homework questions a night (worth nothing, should only take ten minutes)\n3 midterms, no new material after the third midterm\nFinal=100% of grade (hell, who even knows if that's the score he uses to calculate final grades?)\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 21, 2010",
            "review_content": "\nBad teacher. Nice guy. He is a brilliant man who really knows his stuff. However, in lectures he teaches you nothing. He just goes over complicated problems, skipping several steps in between. If you ask questions, he doesn't answer them. He just waves it off and says to watch and he keeps going. Avoid him if you want to learn any calculus. \nThere is no clear cut way to tell what he really asks of you on the tests. For example, I went up to him during the final to ask a question, and he just told me to go sit down. First of all, very unprofessional and it shows just how unhelpful he can be. \nWorkload:\nNon-existant. Gave daily homework or 1-4 problems max that did not help at all. Anyways, only the final counts for your final grade.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "August 27, 2010",
            "review_content": "\nIf you have any desire to take higher level math classes, avoid Jorgensen at all costs. He does not teach all the material he is supposed to, and what he does teach is presented in such a superficial, unintelligible manner that its not even worth going to class for. I have never taken a class with someone less interested in doing his job. He is clearly just showing up so he can keep collecting paychecks. This class was the biggest waste of $4000 I have ever seen. With a month left in the semester, Jorgensen announced that he was finished teaching new material.\nWorkload:\nOne or two problems a week. Exams are exactly like the homework. Easy A, but you won't learn anything from this guy. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 01, 2010",
            "review_content": "\nHe's a smart mathematician, with a frog-face that never stops smiling at you. He looks at calculus with the same awe that the average undergraduate looks a two-step linear equations and arithmetic problems, and because of this he often omits one or several steps, and assumes you have a firm foundation of calculus I and II. \nThat being said, he doesn't teach much, and doesn't count a single midterm or homework, although he does return corrections and goes over them in class. My suggestion is take him if you're an ace in math, or if you're an econ major that doesn't really need to know a lot more beyond partial derivatives and optimization/local max. min. The final has 6 problems and it includes torsion/curvature, orthogonal trajectories and first order linear ordinary differential equations with integrating factors; three subjects not covered in any other calc III course.\nGreat, because since he doesn't count midterms or homework assignments, you actually learn to solve the mechanics. He often puts harder ones on the homework and in class than on the exams. He doesn't mind in-class eating, only when its popcorn, and he HATES James Stewart's textbook. Troels spends a good time bashing the textbook..so if you're a student that prides on learning everything verbatim from the book, this will be a terrible class for you because Troels goes out of sequence and teaches his own format/style, which he asks to see on the exam as a way to see if one is attending lectures. He's also anal about \"scribbling\", he enjoys neatness on exams so its not too much work for him to understand. He doesn't use e-mail or update courseworks. You can ask him for help if you show up to this office on the 6th floor of math sometime between 10 and 2 on  weekdays, as long as you've let him know the class before hand.\nAgain, the midterms/homeworks don't count, only the final does. (but he won't fail anyone as long as they passed their midterms and did their homework assignments and showed up to class. He'll give you a default C. Not a bad exchange.) H\nWorkload:\nEasiest class you'll ever take:  On average, a total of three homework problems per class. His motto is that if it takes you more than 15 or 20 minutes, you're doing something wrong and should stop immediately. None of the problem sets count.\nThree short midterms, that do not count.\nOne final, that counts as your final grade as well.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 27, 2009",
            "review_content": "\nPrevious reviews accurately described him and his teaching style in detail, but be warned that he always omits steps to reach an answer, so if you're not strong in maths or just don't remember what you have learnt in calculus 1 (& 2,) do stay away from this professor.  The fact that you can't fail is something you might want to take into account though.\nWorkload:\ntwo short homework problems due every class.\nand three midterms\nthe final grade will be 100% on the final exam.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 21, 2009",
            "review_content": "\nWhat a joke. I went from having an A/A+ to a B during his 1 hour final. Made a few algebraic errors and there went my A. He's a bad teacher who grades unjustly. \nWorkload:\nnot much. final counts for everything.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 15, 2008",
            "review_content": "\nDon't take this section if you plan on pursuing math further.  This class is a complete joke.  Tests are easy, but only the Final gets counted.  Jorgensen is a cute professor but cannot explain anything.\nWorkload:\nFrighteningly little. A few homework problems, 2-3 midterms, and a Final, the latter being the only bit generally factored into your grade\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 11, 2008",
            "review_content": "\nTroels is a wonderful teacher with a great sense of humor. His lectures are well-paced and he loves to answer questions. His tests are short and made up of easy homework problems.\nWorkload:\nThere are two or three short homework problems due most classes.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 17, 2008",
            "review_content": "\nBe prepared for the easiest course you're ever going to take at Columbia! \nAs many have stated below me, Troels Jorgensen is an incredibly nice and sweet old man but a terrible teacher. The fact that he is the only teacher who has not handed me a syllabus on the first day should tell you something. Troels' class consists of him doing problems and examples on the board and explaining how they relate to math. But make sure you copy these down exactly the way they appear on the board. I found that although he would change up the parameters for the problems on the homeworks/midterms/final, the general procedure that he uses in class to arrive at the answer is exactly the same. So do yourself a favor: go to lecture, copy down exactly what he does on the board, and memorize the steps he does for each kind of problem. I guarantee that you will do well.\nI'll warn you now: the only grade that Jorgensen will count is the Final Exam. So make sure you prepare for it accordingly. But in case you somehow manage to screw it up, as long as you did all your homeworks and took all the midterms Jorgensen will have mercy and give you a C instead of failing you.\nWorkload:\n+ Homework every night. These are incredibly easy provided you did what I advised and copied down what he does in class/understand the steps he takes to arrive at the answer. Besides, according to him, if you're spending more than 10 minutes on a homework problem you're doing it wrong...\n+ 3 midterms. Are his homework problems easy? Yes. How hard are the midterm questions? They're just like the homework problems...\n+ 1 Final Exam. Were the homeworks/midterms difficult? The final is basically all the midterms in one sitting.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 21, 2007",
            "review_content": "\nProfessor Jorgensen is exactly what the rumors say. Genuinely nice guy. Miserable teacher. \nPros: 1)One hw problem per class.\n2)Tries to make problems come out nice and not messy\n3) He won't demand anything remotely challenging.  4) No reason to go to class\n5) Really wants his students to do well. \n6) Is always willing to meet with students. \nCons: 1) Can't explain anything for his life.\n2) Does not teach the concepts at all- just teaches the methods. \n3) You just read the book to understand what is going on. \nBasically, if you want to go into mathlearn math, don't take him. If you want to fulfill a requirement for econpremedwhatever and don't care a lick about math- take him. \n \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 18, 2007",
            "review_content": "\nvery sweet old man. you will not learn more than is mandatory for him to teach you, but if youre looking for a calc with not a lot of coursework throughout the semester, a heavy bearing on the final, and a guy who is willing to take any excuse, by all means.\nWorkload:\n1-2 problem hw's, easy. tests throughout that count for nothing. 100% final is your grade\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "February 06, 2006",
            "review_content": "\nTroels is a very funny man with strage quirks.  He tells students \"don't spend more than 10 minutes on the hw.  If it takes longer, don't do it.\"  He also doesn't want homework to take more than one page of paper.  He is a very cute man but a terrible teacher.  Most of what he does in class you never need to know.  \nOnly take this class if you have done the material before.  If you have not, stay far far way because the final is 100% of the grade, no joke.  I took BC in HS, got a 5, and just took the class to get an easy A, which I did.  But do NOT take this class if you have to learn the material because it will be hard.  Overall, not reccommended for newcomers.  It's not worth to stress out about a final this much.\nWorkload:\nThe workload is practically nothing.  2 problems due each class.  Three midterms, which count for NOTHING.  They are just to \"gauge whether you are learning or not.\"  HW only counts if your final exam grade is on the border of failing.  If your handwriting is neat, he will not fail you.  \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 18, 2006",
            "review_content": "\nHe's a nice guy and is quite obscure sometimes, which is pretty funny. It's not a good idea to miss class because if you miss a class, you'll miss his explanations of the problems from the textbook, which are basically models for how to do the homework and the problems on the exams. You just need to be careful because, as previous reviews said, your grade is based on what you get on the final. Other than that, the little to none work that he gives, makes your overall workload easier to handle.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 15, 2006",
            "review_content": "\nA nice man with very weird quirks.  He doesn't want you to show work on homeworks and takes points off if your handwriting is not neat or if you showed TOO MUCH work.  His class is extremely stress free until the final.  My biggest complaint about his class was that he didn't tell us how the grades were distributed until the hard final exam where he told us that, low and behold, it counted for 100% of the grade.  Considering I went from an A+ to a B- in the span of 3 hours, it was a pretty frustrating class.  However, I recommend this class based on the low stress it causes. Just know that the final counts for everything and prepare accordingly.\nWorkload:\nOne homework problem every class.  Three short very easy tests.  One hard final which accounts for the entire grade.  The homeworks and tests just ensure that he will not fail you.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 02, 2006",
            "review_content": "\nDamn this class was such a mistake. For someone that had a 4 on the AP BC exam, this class was quite boring--and the final a killer, particularly because none of the easy midterms get calculated into the grade.\nAwful awful experience. Strange too, never before did I have a teacher/professor tell me to not look in the book or use more than one sheet of paper for an assignment.\nWorkload:\n3midterms, dont count\ndaily hw--considered to bring you from an F to a D (in case you need it)\nFINAL - 100% of grade\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 17, 2005",
            "review_content": "\nOn the first day of class he tells you that he doesn't want you to use more than one sheet of paper for the h.w., somewhere in the middle of the semester, when you bug him about midterms, he'll ask you if a week from today works for you. He's very chill, students stroll in late or not at all. If you can pay attention to him, you don't need to read the txtbk or even own it, because he tells you all the (minimal) stuff you need to know. \nWorkload:\nnightly hw that are graded based on whether or not they ar  correct and whether or not they are *neat*. midterms that aren't calculated in the final grade/final that determines your entire grade.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 17, 2005",
            "review_content": "\nOn the first day of class he tells you that he doesn't want you to use more than one sheet of paper for the h.w., somewhere in the middle of the semester, when you bug him about midterms, he'll ask you if a week from today works for you. He's very chill, students stroll in late or not at all. If you can pay attention to him, you don't need to read the txtbk or even own it, because he tells you all the (minimal) stuff you need to know. \nWorkload:\nnightly hw that are graded based on whether or not they ar  correct and whether or not they are *neat*. midterms that aren't calculated in the final grade/final that determines your entire grade.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 17, 2005",
            "review_content": "\nOn the first day of class he tells you that he doesn't want you to use more than one sheet of paper for the h.w., somewhere in the middle of the semester, when you bug him about midterms, he'll ask you if a week from today works for you. He's very chill, students stroll in late or not at all. If you can pay attention to him, you don't need to read the txtbk or even own it, because he tells you all the (minimal) stuff you need to know. \nWorkload:\nnightly hw that are graded based on whether or not they ar  correct and whether or not they are *neat*. midterms that aren't calculated in the final grade/final that determines your entire grade.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 08, 2005",
            "review_content": "\nJorgensen is an easy-going, nice guy, who clearly has a great Math mind.  Unfortunately, these components do not make a good Math teacher.  I was unable to understand the majority of what he taught in class.  He is disorganized in his teaching, often alternating between topics in the same class.  I was forced to teach the entire course to myself from the textbook.  If you can do this, you should be able to get an A in the class.  He gives about two homework problems per class (a relatively light workload) and the tests are largely derived from these problems (there are exceptions though!)  He has very little structure to his class, does not do Webworks (or anything involving a computer including e-mail), and often spends a lot of time on topics that ultimately do not appear on exams.  He gave the impression in class that as long as you do well on the homeworks, you can get a decent grade in the class.  I was able to do well on the tests by studying the textbook.  \nBottom Line: If you're capable of teaching the entire course to yourself from the textbook, don't want to spend too much time in class,and want a light workload, take this class.  If you're the kind of person who wants a structured class with clear lesson plans etc., DO NOT TAKE THIS CLASS.           \nWorkload:\nAbout two homework problems per class (collected and graded).  We had a midterm, one exam, and a final, but he decides on testing as he goes along.  \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 04, 2005",
            "review_content": "\nIf you are an economics major, Troels Jorgensen is the man for you.  Not only is he a terrific guy, but he teaches the material in a \"simple and straight forward manner\".  Troels cares if students are learning and is very approachable.  Midterm grades thus are not a major factor in your final grade.  They are just a gauge of whether or not students are learning the material.  Attendance at class, the quality and \"neatness\" of homework, and a good showing on the final exam are essential to doing well in this class.  Troels does make it clear that he does not hand out many A's, but rather thinks \"B or B+ is a good grade for Calculus III.\"  I'm in agreement, and if you are an economics major looking for the easiest way out of the mathematics requirement, Troels provides the best option.  \nWorkload:\nRelatively simply homework problems for most classes, straight from the textbook.  2 midterms used to gauge if you are learning the material.  Fair Final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 23, 2004",
            "review_content": "\nOne of the worst math teachers I've ever had.  He's boring, talks awkward, and grades horribly.  Randomly takes off points on homework, and the tests have no structure grade-wise.  In short, I'm going to be screwed next year in Calc IV\nWorkload:\nAlmost no work, he doesn't teach, so don't expect to learn much of anything.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 21, 2004",
            "review_content": "\nOh, Troels. If you're going to take more math classes later on, do NOT take his class. You will not learn enough to make it in higher levels. But if you're just taking it to get BC Calc advance credit, definitely this is the way to go. He is cute - awkward and all over the place, but funny. Learn to laugh at the class, and you'll be fine. He does not ever explain why or what exactly he is teaching you, but copy down the steps on the board and eventually you'll realize why it matters later on. The tests are easy - exactly what you'd expect. If you can do the homework problems, don't even study. He is not coherent - he'll stop himself in the middle of a sentence to hand back homework. We learned about half as much as the other Calc 3 classes, but at least we learned it well. Don't bother asking questions in class - he won't understand what you're asking anyway. He is the kind of guy you want to take home, put into a cage, and watch all evening, but not really learn from. \nWorkload:\nA few problems per class, which is very little. 2 midterms, no surprises. A final, again no surprises. Everything I needed to know from the entire semester fit onto 2 pages of notes. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "September 13, 2004",
            "review_content": "\nTroels is a jovial, English-speaking, cheery man. He loves math and is very low key about his classes. If you have taken calc before and didn't do that well, this is your best option for a math at Columbia. Most teachers tend not to speak any English and assign numerous web works problem sets. Troels only gives 2-3 problems a night and if you ask him not to give you homework, he will agree; But youll want to do the homework as that is what his tests are based on. He doesnt really have a teaching plan or grading plan, so make sure he knows who you are and likes you. The tests are basically very fair, but he usually throws one problem at you that you will not be able to do. don't fear because he always says if you got 100 you shouldnt be in the class. he expects people to make mistakes, especially in calc 1. the final exam is extremely fair and basically based on the other tests and the problems he does in class (which usually come straight from the book). Final grades are largely based on the completion of all the homeworks and the final. \nWorkload:\n2-3 homework problems a night and 2-3 midterms (the third will be given only if the class wants it). Final. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "June 28, 2004",
            "review_content": "\nDon't do it to yourself!!!!  DO NOT (I repeat) DO NOT TAKE THIS COURSE w/ this professor!!!  He is a horribly boring little man that does not know where he is going w/ the class or what he will teach 4 the day.  I think he enters the classroom and says o'yes perhaps I will teach the easiest derivative today in class and 4 the homework and exam give a derivative that even I can not solve.  The class often corrected him w/ whatever little knowledge they could.  I do not recommend this professor, you have been warned!  ENTER @ YOUR OWN RISK!\nWorkload:\nHomework everyday of class--2 to 3 problems b/ you will spend a lot of time on them do not e fooled.  And then he says if you can't do it in 1/2 an hr do not bother.  2 Midterms and Final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "March 03, 2004",
            "review_content": "\nHe's funny/adorable/cute. But I want to learn Calc - not buy a pet bunny. This is my first time taking calc ever anywhere, which is what the prerequisite for calc i is supposed to be. But no, he assumes we know this and that and the other, which is not the case. It's easy, but a tip for beginners: when he assigns hw from certain sections, read the whole section and do most of the problems so that you're not too lost, and make sure you have friends who understand this stuff.\nWorkload:\nlight, but the tests are pop tests\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "March 03, 2004",
            "review_content": "\nHe's funny/adorable/cute. But I want to learn Calc - not buy a pet bunny. This is my first time taking calc ever anywhere, which is what the prerequisite for calc i is supposed to be. But no, he assumes we know this and that and the other, which is not the case. It's easy, but a tip for beginners: when he assigns hw from certain sections, read the whole section and do most of the problems so that you're not too lost, and make sure you have friends who understand this stuff.\nWorkload:\nlight, but the tests are pop tests\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 17, 2003",
            "review_content": "\nok. so everyone says he's this easy teacher who barely gives any work. and that's partly true. jorgensen has absolutely no structure to his classes, is ALWAYS painfully boring (if you go to class, remember to bring something else to work on)  and never lets you know what anything is worth in the class, or what the test covers. you go into the tests blindly. however, this can be a relatively easy class if you have taken calc before, and can remember what you have learned, because you won't be learning anything new from him. he is not a fair grader. *CULPA censor* overall, if you knew calc from before, you won't have much trouble math-wise, but you will be frustrated with his unresponsive nature and the fact that he cannot teach at all.\nWorkload:\n3 tests, a final, he requires you to turn in homework...supposedly a huge part of your grade\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "June 08, 2002",
            "review_content": "\nThey say he's an easy A, and this may be true for tests but not the final grade. A seemingly harmless man, but when you don't get a syllabus or grading strategy it's hard to argue with him when he gives you a B in the course after having gotten all A's!!! on all five midterms! (wow, that was a downer). He says he \"does his best\" in grading. If two people have the same answers and show the same work, he'll mark the person with more notes and calculations lower. What kind of system is that? I attempted to receive clarification on problems only to be turned away. He said, \"Don't you have better things to study for?\" Well, if you want to be patronized, waste 30 K on your education to a man who wants to avoid responsibility, and is also partial take this class.\nWorkload:\nRidiculously minimal, almost frustrating. He accepted two problems the whole semester. Ofcourse he didn't grade them. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 08, 2002",
            "review_content": "\nThis class is probably the easiest math class in columbia. He only makes you learn how to do the simplest of each kind of problem, and will do about 80 examples in class that are exactly like the tests except with different numbers.\nWorkload:\nHomework is sporadic and optional, and the tests and final are too easy to cause anyone worry if you either go to class or look at the book\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "May 08, 2002",
            "review_content": "\nTake this class if you're not great at math. He's a great guy and makes lectures not as boring as they could be. His exams are totally easy, and you get a review sheet in advance so you know exactly what to study. Lots of As are given out, including A+s for those who get 100s on everything, which in this class is totally doable. Take this class!!!\nWorkload:\n3 exams and a final exam, all pretty easy. Occasionally, homework is collected and graded.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "October 22, 2001",
            "review_content": "\nWhile there is no apparent rhyme or reason to what Troels choses to teach, he teaches the material well and keeps the class constantly amused. He's a fun guy and quite adorable. His grading policy is a mystery to me but his incredible generousity mitigated my need to probe into it further. Take his class--it's worth your time and it's a requirement for econ majors.\nWorkload:\nWeekly problem sets, two (or three) midterms, final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 31, 1999",
            "review_content": "\nRemarkable as a Calc IA teacher in that he speaks English with reasonable fluency. He's a jolly kind of guy and brings a \"no-pressure\" atmosphere (within reason) to the class. Exams are clear cut, bordering on simple. A good choice for IA.\nWorkload:\nWeekly problem sets (not necessarily graded), 3 tests, Final exam.\n"
        },
        {
            "course_name": "Modern Algebra",
            "review_date": "December 31, 1999",
            "review_content": "\nThere's a bad side and a good side to Jorgensen's classes -- at least his higher-level math classes. The bad side is that the man is so thoroughly disorganized in his teaching of the material that many students opt to skip class. At the start of the semester, he'll give you no information about how the course is graded, nor when the tests will be. One full class was spent learning the students' names (to his credit, he now knows our names well, but still...)! He brings no lecture notes to class. He'll jump from one lesson to another without any continuity whatsoever. He'll frequently have no cogent answers to students' questions, and he'll often get stuck while trying to illustrate examples! He'll suddenly announce test dates *two* days in advance. The lectures give new meaning to the word \"boring\". Add all this to the fact that the material in this class in very hard to comprehend (it's basically set theory... there's as much \"math\" here as there is quantum physics in Lit Hum). The good part of the course is that Jorgensen is very lenient, probably the most lenient professor one can imagine. He'll give you every opportunity to succeed in his class. For example, on the test he announced two days in advance, he let the students ask him questions for the first 10 minutes of the period (after the test was given out!). Then, students were encouraged to try their best, but if they couldn't finish the test, they could take it home and put it in his mailbox at a later date. He sometimes seems genuinely surprised when students hand in a large problem set he assigned -- apparently he doesn't expect many to actually do it, even though it was \"mandatory\". Grades don't really matter to him, and if you go through the course without doing a shred of work (i.e. no homework, bad tests, etc), he still won't fail you. He's also a very nice guy in general, and usually available for help if you need it. However, in my opinion, the bad outweighs the good in this course. Strong recommendation to stay away unless you're a Math major.\nWorkload:\nThe workload itself is relatively small... However, the problems are extremely hard and usually require seeking out extra help. There's no clearly defined \"midterm\", just random tests that may or may not count for your final grade. And of course, there is a final exam.\n"
        },
        {
            "course_name": "Modern Algebra",
            "review_date": "December 31, 1999",
            "review_content": "\nPretty near useless. We spent the majority of three classes on a five-minute proof because he didn't prepare for classes. There's no pressure, which is great; the class is a joke, which is not. Expect to learn maybe a month's worth per semester. Credit for no work is wonderful but don't expect to learn much math.\nWorkload:\nVery, very little. Also can sometimes be convinced to forego exams in exchange for (joke) projects. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 31, 1999",
            "review_content": "\nJorgensen is funny, akward and .... cute in that fuzz math teacher way. Be forewarned, if you have not taken calculus before this class is not for you. He doesn't explain topics at all and jumps around a lot. He has a tendency to avoid answering student questions and does not understand why we don't fully grasp the material. On the other hand, the homeworks are rarely graded and don't count for the final grade, there are three tests but they don't count either. The final is the entire grade. He is extremely lenient and its a funny class to take.\nWorkload:\nhomework, 3 tests (easy if you know basic calculus), one final. \n"
        }
    ]
}