{
    "prof_info": [
        {
            "prof_name": "Flora Schiminovich",
            "prof_id": 208,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate 2",
            "review_date": "May 10, 2006",
            "review_content": "\nA class with Flora is an experience to say the least.  The woman is out of her mind!  I'm sure she was very intelligent at one point, but from what I hear she's losing screws with time.  It is true from the other reviews that you need to suck up to get a good grade in her class; she definitely choses favorites.  The class doesn't really go by the syllabus that much which is departmental so you're screwed when you get to the final.  On the other hand, most of the class is reviewing homework assignments that everyone just copies the answers out of the packet and into the book for, and she frequently lets class out as much as 45 minutes early.  I'm really not sure if she knew she was letting us out so early, because the woman is that out of it.  Don't expect though that it will be completely easy and an easy A, on certain assignments she can be a pretty harsh grader.\nWorkload:\nHomework assignments for each class (answers in the book, 2 midterms, 4 essays (2 revised), final project and exam (same as all other Intermediate 2 classes)\n"
        },
        {
            "course_name": "intermediate spanish",
            "review_date": "April 22, 2006",
            "review_content": "\nI love Flora. Though I would not suggest her to a student who wants to learn Spanish in the classroom. In the beginning her classes were unbearable.. but they have become enjoyable! She is very entertaining and relaxed. \nShe just really doesn't teach much. (Though I've heard her more advanced literature courses are amazing) She doesn't go over very much/ANYTHING in class. She expects students to study themselves without her having to explain ANYTHING. Her tests aren't difficult but she grades harshly in contrast to other language professors I've had. Classes are taken up going over the previous night's assignments to which an average of 4/22 people bother to complete.. or at least, copy answers from the back of the book. I love Spanish and though I've missed out on a proactive professor, going through the syllabus is alone strong and fundamental exposure to the language. It isn't difficult to study from the textbook. She will answer any questions (she's very available) and she allows a first draft on every essay, enabling students to learn from their mistakes and receive higher grades. \nAgain, I have learned to really enjoy her class and her presence.. BUT others in my class can't stand her! She is straightforward (sometimes interpreted as mean) and funny. She refers to herself as \"crazy\", but in a good way. \nIf you are looking for an efficient and helpful classroom experience I'd try somewhere else.... But this is relaxed and pretty easy-- just read the lessons out of the book!\nWorkload:\nStandard for Barnard language courses.. \n"
        },
        {
            "course_name": "Hispanics in the United States",
            "review_date": "December 16, 2005",
            "review_content": "\nFlora is easily the worst professor I've had this school.  She is also probably the only professor I've had who has a Ph.D. yet isn't as smart as most of her students.  She is so unaware of her surroundings that she actually didn't know about the MEALAC conflict until March 2005 (I took the class in Spring 2005).  She makes simplistic generalizations about complex issues and rebuffs students who try to point out subtleties.  You won't learn anything, but the class is definitely easy.  I'd say the only reason to take a class with her is if you are taking several other hard classes and need an additional class to bring you up to the credit minimum or to graduate.  Otherwise, your time would be much better spent doing anything else.\nWorkload:\nA few essays whose topics will remind you of your freshman year of high school; weekly readings it's not necessary to do; a few movies outside of class which it's also not necessary to watch.\n"
        },
        {
            "course_name": "Intermediate 1",
            "review_date": "January 22, 2005",
            "review_content": "\nin my opinion, she's not a teacher. i didn't learn anything. the other reviewers say shes kooky and fun and she is, but if you don't know spanish already, you won't ever, and then you'll be screwed for intermediate 2.\nWorkload:\nessays that she lets you rewrite, exams that come out of no where, and a dept. final that is INSANE\n"
        },
        {
            "course_name": "Latin American Political Theater",
            "review_date": "December 31, 2004",
            "review_content": "\nLatin American Political Theater with Profesora Schiminovich made for an entertaining and interesting semester of spanish. Entertaining because the class only loosely follows its curriculm (lots of leeway for irrelevant material and discourse) and interesting because the way we covered material. \nLight reading that you do on your own time makes the basis for class discussion, Profesora Schiminovich's comments and reading out loud. Different ability levels of Spanish prevent the class from getting overly-deep or analytical, but I personally feel this class was a good transition to college-level Spanish:  you are writing papers, reading more serious texts and talking in more abstract terms than many other foreign language classes. One of the best aspects of the class is the topical approach of broad themes in latin american lit. \nAlthough the class can sometimes get a little slow, Profesora Schiminovich's extroverted and cheerful qualities make up for the occasional boring lapses. I would recommend the class to anyone seeking an introductory college-level spanish program thats looking for a lighter workload and a chance to test the waters among a variety of ability levels. \nWorkload:\nGenerally minimal work that involves reading shorter plays and dramas from Latin American authors. Three papers (3 pg minimum) and two group presentations from a select play. \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 29, 2004",
            "review_content": "\nI have to say that I did not learn much spanish in Flora's class.  She is spacey and acts not all together there, but she is an incredibly smart woman.  I learned a lot of things that were not related to spanish.  I like Flora as an individual but not as a GOOD spanish teacher.  If you are looking forward to learning Spanish switch out.  Her expectations are low, she does pare down the workload and excepts everything late.  She lost all my assignments, so save all your work!   You get a B if your grammar is not up to par already because you don't learn if from her.  All her quizzes were writing sentences.\nWorkload:\n2 quizzes, a final, a final presentation, and workbook exercise (nobody really did them, you get a key)\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "November 12, 2004",
            "review_content": "\nFlora is pretty wacky. She often goes on random tangents in class that stray so far beyond the realm of Spanish grammar that you'll forget what class you're in, but you'll be having fun. Flora is always amusing and friendly, and your grade will be largely determined by how much you laugh at her jokes, engage in flattering conversations with her, and shower her with praise in class (whether or not that praise is in Spanish is usually irrelevant). If you want to work hard and learn a lot of Spanish, Flora is not the professor for you. If you want a ridiculously easy and fun way to fulfill your language requirement, Flora's your best bet. Be prepared to perform a lot of skits, and bring in food when you do class presentations if you want even more assurance of a good grade. \nWorkload:\nHomework assignments that are almost never checked, a couple of short papers that you're allowed to re-write for a higher grade, lots of in-class skits, and a fair amount of class participation. In short, the workload is freakishly  minimal.\n"
        },
        {
            "course_name": "Hispanics in the U.S.",
            "review_date": "November 08, 2004",
            "review_content": "\nSo... the class is easy. I'll grant you that. If you don't really want to do any work and you'd rather stare off into space and blurt out a few spanish words here and there- this is a great class. But for people who are already pretty fluent its pretty much a waste of time or a really easy A. Flora's sweet and def. \"spacey,\" but nice nevertheless. But, when I found myself trying to improve my spanish and trying to be come become Hispanic (or suck up) - I realized that I was wasting my time.\nWorkload:\npapers here and there, watch some movies (that aren't initially included on the syllabus)\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 27, 2004",
            "review_content": "\nFlora is colorful and loud, and tends to be a bit \"spacey\" as another reviewer mentioned.  Her class is embarassingly easy; she frequently pares down the syllabus and she never checks workbook exercises. Her quizzes are fair, and even if you get B's on them you'll end up with an A because of \"participation\" and, well, because everyone gets an A with Flora.\nShe may lose your assignments which is annoying, but you can always just bring in another copy later on.  She accepts things late, too.  A large component of the grade is how perky you seem in class and how much over-acting you do on presentations and the final skit.  Also, be prepared to shower her with praises.  Seriously, sometimes she will ask something like \"Who's the best?\" and everyone yells back \"FLORA!!!\" but this is all worth it for the easy A, random food she brings in some days, singing happy birthday to people in class, etc.\nAlso, don't underestimate her.  She knows a great deal about international politics, literature, women's studies, and other interesting topics.  You may be surprised at what you learn (even if it's not Spanish!). \nWorkload:\neasy.\n"
        },
        {
            "course_name": "Intermediate ",
            "review_date": "September 13, 2003",
            "review_content": "\nYes.  Flora is a little eccentric, but by no means is she insane.  She is a sweet and very endearing woman.  I mean, she's on a first-name-basis with her students.  Plus, it's nice to have a motherly teacher in a place where most of your professors are cold egoists, or extremely intimidating.  Her class is extremely easy. if you can choose between her and another professor-choose her.  You can get away with a lot of bull in her class, but still do your work.   She can be really spacey, but you'll learn if you want to.\nWorkload:\nA few really easy 10 min. tests.  Some middle school-like skits (be a ham and you'll get an A), and nightly workbook exercises that you don't really need to do.  The final is 1/2 skit, 1/2 exam, both are easy A's if you don't take them for granted.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 05, 2002",
            "review_content": "\nRun, do not walk from this crazy woman! not only did this \"argentine flower\" wilt long ago, she openly insults students in class. Be prepared to receive F's on the board (remind you of 2nd grade?), be told to shut up (frequently), have your work publicly ridiculed, and your exams frighteningly scrutinized (if only she taught the material first). Flora does not teach you Spanish, but insists that you speak with the fluency of a native and write perfectly on every exam. I have lost ground since Intermediate I and think that my language skills would be better if I had stopped taking Spanish at that point. She never gave us evaluation forms to fill out...even she fears what we have to say about her. Don't worry, you won't work too hard. Just do what our class did -- pass/fail and sleep. Best of luck if you wind up in this terrible class. Hopefully, you'll only stay there by default -- you have much better options. One recommendation: Daniel Fernandez, wish his class had fit into my schedule this semester.\nWorkload:\nPretty small. 4 short essays (2-4 pages). Homework assignments that nobody actually does.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 27, 2002",
            "review_content": "\nEasy class. She's a ridiculously easy professor. You won't learn that much spanish though, but you'll have fun. Plus she'll take you out to dinner at the end of the semester. Get on her good side and you'll get a good grade, though it is somewhat based on the exams...\nWorkload:\nExams and Finals and maybe a couple papers. Some reading. Nothing so hard.\n"
        },
        {
            "course_name": "Latin American Lit/Culture",
            "review_date": "December 31, 1999",
            "review_content": "\nAn Argentine flower with only a slight (and thus comprehensible) accent. Smiling and gracious, she has trimmed the readings to the bone and doesn't seem to mind when you neglect to do them anyway.\nWorkload:\nTerm paper (5 pp.), group presentation, midterm & final exams.\n"
        }
    ]
}