{
    "prof_info": [
        {
            "prof_name": "Kirsten Lodge",
            "prof_id": 2396,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 16, 2010",
            "review_content": "\nKirsten was an absolutely fabulous Lit-Hum professor. I've heard some awful things about other professors and feel so lucky to have gotten her. She's extremely awkward in the classroom, but it's so obvious that she loves teaching and wants her students to do well. She knows so much about each texts. She could awnser just about any question, regardless of how obscure, often times without even using her notes. Throughout the semester, she planned optional trips to museums, plays, and other outings. You've lucked out if you've gotten Kirsten for Lit-Hum. \nWorkload:\none page responses to the reading for each class (this helps so much for people like me who would not do the reading otherwise), three 3-5 page essays that are fairly graded, a pretty easy midterm, final, and class participation (I slept through quite a few classes and still got an A for participation) Kirsten is a very fair grader as well. Even if you're a miserable writer, you can do well on a paper as long as you say something original.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 22, 2010",
            "review_content": "\nI don't understand why everyone says that Professor Lodge is awkward.  I didn't find her awkward at all, but very friendly and engaging.  It was a great class!  The discussions were amazing, and there were all kinds of extracurricular activities.  She is a fair grader and gives lots of feedback on papers, and she is always willing to meet with you to discuss your paper or anything else.  I highly recommend taking her class.  I learned a lot.\nWorkload:\nLIt Hum texts, 3 short papers, one-page response for each class, midterm, final.  Not more than other Lit Hum classes.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2010",
            "review_content": "\nKirsten is a teacher which on first appearances seems extremely under-confident, and perhaps not in control of her classroom. After a few lessons and your first paper, this image is gone. Kirsten knows what's she's doing, is an extremely capable and at times even harsh grader, and genuinely cares about the intellectual well-being of her classes. She takes her students on multiple outings to plays, performances and screenings to supplement the texts, and is highly knowledgeable on the histories and deeper complexities of the curriculum. Give her a chance, and she'll certainly pull through for you as a great professor. \nWorkload:\nDaily Assignments for each class (1 page), three essays of approximately 3-5 pages, a fairly moderate midterm and final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 10, 2009",
            "review_content": "\nProfessor Lodge is very smart, approachable and reasonable in her class policies.  She is not a terribly engaging discussion leader or lecturer, but she is adept at understanding the literature herself and explaining it to the class when necessary.  She expends a great deal of time and effort teaching this course, and plans many extra-curricular events such as (LitHum) movie nights and trips to see (LitHum) plays.  Professor Lodge is not the best teacher, but she's a good one.\nWorkload:\nMore substantial than some LitHum sections, less intense than others.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 17, 2009",
            "review_content": "\nKirsten is probably the most awkward professor you will have at Columbia. Contrary to what other say, you never get over this. But, if you can get past that, she happens to be very smart. She is probably the best close reader in the world. \nWorkload:\n2 weekly responses (10% of your grade). 3 papers (40%). 1 mid term (20%) and 1 final (20%). Final 10% is class participation.  \n"
        },
        {
            "course_name": "Russian II",
            "review_date": "March 22, 2008",
            "review_content": "\nKirsten is a bit awkward and shy but don't let that dissuade you (you'll grow to love her quirks). She is a great teacher. Unlike some of the younger grad students who teach Russian, Kirsten actually wants to help you. The book they use for Russian 2 isn't very good, so she photocopies dozens of pages from other textbooks for us. If she can't answer a question or doesn't know the word for something she'll look it up and tell you the next day, even though you've forgotten about it. She's also flexible if you need to miss class (she teaches the night class so this happens a lot) and is always available outside of class. You'll learn more with her than in any other section!\nWorkload:\nthe standard russian II--daily homework, tests every two weeks or so. but there's no oral final in her section!\n"
        },
        {
            "course_name": "Russian 1101",
            "review_date": "January 03, 2005",
            "review_content": "\nKirsten may seem a bit awkward at first but she will soon prove to be an excellent and friendly instructor.  She knows the grammar well and will take the time to explain it well in order that she never has to spend time repeating herself (and so she avoids boring motivated students).  She is always available for help and extra practice.  Her style of teaching a foreign language should be a model for more professors.  Definately choose her section.\nWorkload:\nDaily Homework (workbook, mini essays, listening); tests; final.  This course will take up a lot of your time and it is essential to study for all of the tests, even if you do the work all along.\n"
        }
    ]
}