{
    "prof_info": [
        {
            "prof_name": "Rosa Polan",
            "prof_id": 12509,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "May 04, 2013",
            "review_content": "\nEveryone knows that Organic Chemistry Lab is a lot of work. That isn't the fault of the teacher, its just the nature of the class. In saying that, having a good teacher makes the world of a difference and Rosa was without a doubt a VERY good teacher. \nRosa is amazing. So understanding, very helpful and she made this class much more enjoyable then it could have been. Yes this course is very difficult, a lot of work and time consuming, but it you go to office hours you make your life so much easier!! Rosa will really make sure you understand the experiment and help you with whatever you need. I'm not sure what the negative reviews are about because every time I went to ask Rosa a question no matter how simple of a question it was, she never once looked at me like I was \"the most stupid human being she has ever come across.\" She does speak very fast in lecture, but again thats not entirely her fault- there is a ton of material to cover in a short amount of time. Rosa doesn't determine the amount of work that is due or what she has to cover- its a departmental standard that she does her absolute best to follow. \nLike I said, biggest advice for this class is to go to office hours. There are a lot of opportunities to miss little points here and there that you could have fixed if you go to office hours and having your TA/Rosa check over your mechanisms or if you go ask about the pre-lab. Rosa would even sometimes give more specific examples of the types of questions that would be on the quizzes if she saw that you made an effort by coming to office hours. \nRosa is not pretentious and does not have an attitude. Yes she is VERY smart but she is always willing to go over even the smallest and easiest details of the experiment if you ask. Most of all, Rosa is a nice person and is actually awesome. A few of us would even go to office hours towards the end of the year just to hang out with Rosa because she was so cool. I can actually say that I am sad that the class is over just because I won't get to learn from her anymore. She is genuinely excited by and interested in organic chemistry which was always really cool to see. A friend and I once went to her office hour to get help with our problem set for Snyder's class and Rosa even willingly helped us with that! Proof that Rosa isn't the awful person that other reviews make her out to be.  \nWorkload:\nA lot of work, but thats inherent to the course and has nothing to do with the professor. \nWeekly quizzes, notebooks. Pre-labs in the first half of the course and lab reports in the middle of the course. \n"
        },
        {
            "course_name": "Intro to Organic Chemistry lab",
            "review_date": "April 08, 2013",
            "review_content": "\nThis class is a lot of work- there is a 45 minute lecture at the beginning of class, and then the rest of the class is the lab itself. How you do really depends on the TA you get and how he/she grades you relative to the other people in your class, since they grade your quizzes/lab reports/everything else, and the grade you get is based on the curve in your individual TA section. My TA wanted a separate \"clean-up procedure\" section in the lab notebook write-ups, even though that isn't asked for anywhere (that I saw)... go to your TA's office hours and ask if he/she wants something more than the directions ask for. \nIt really makes no difference how hard the quizzes might be or how low the quiz average is, since you are curved based on how you do relative to the other people in your specific TA section. So if the quiz average is low (like a 10/20), that actually becomes a good thing, since it's not hard to get the average if you have an idea and are on the right track, and the class is curved to a B+/A-. If you want to do above the average... go to Rosa's office hours. She writes the quizzes, and will take the time to patiently explain specifics about the reactions to you, and make sure you actually understand them. The lectures can seem rushed sometimes, but that's because there is so much to cover in 45 minutes (and Rosa knows that). She genuinely wants you to do well, and will meet with you outside of office hours if you can't make it. I had a really positive experience because I made the effort to meet with her... if not, the class would probably have been a lot more overwhelming.  \nThe lab reports take a lot more time than you think, so start early. Also, bring your mechanisms to office hours and ask your TA/Rosa to check them before they're due. Same with the pre-lab questions, and IR/NMR data you will turn in later... don't lose points when you could just ask. \n\nWorkload:\nWeekly quizzes, 4 lab reports, 5 graded pre-labs, 10 or 11 notebook write ups (1 per experiment)\n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "April 08, 2013",
            "review_content": "\nI completely disagree with the previous review. I'm currently taking Orgo Lab with Rosa, and I can attest to the fact that she actually IS an approachable and understanding person. Her pre-labs are difficult, but she's more than willing to explain solutions during her office hours. In fact, she's willing to help you with anything if you go to office hours, whether it's lab reports, pre-labs, quiz questions, etc. Yes, the quizzes are hard also, but they're totally manageable if you take the time to study for them. After a while, you'll get the hang of how Rosa prefers to test people on their understanding of an experiment, and your scores will go up (assuming, of course, that you are of at least average intelligence). \nWith regards to her lecture style, I found it no more fast-paced than either Snyder or Lambert. Honestly, much of what she explains is a review of what you would have already learned in the Orgo lecture classes, so there's very little new material other than the nuances of a particular reaction you're conducting that week. \nI've never seen Rosa be anything but kind to a student. She's by no means an asshole. The previous reviewer probably is just bitter over having done poorly in the class because it is challenging and demanding, as it should be.\nOverall, take Orgo Lab with Rosa. It's a lot of work, but she's super helpful and genuinely wants her students to do well. She makes it difficult so that students come to office hours and ask questions. Honestly, I'd just go to office hours to shoot the shit with her because she's actually super chill. \nWorkload:\nThe other reviews are all pretty accurate. No matter how you slice it, this class is a lot of work.\n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "January 26, 2013",
            "review_content": "\nI'm surprised no one has written a review about Rosa's teaching style. Let me start off by saying AVOID AT ALL COSTS.\nDuring the first few weeks of Organic Chemistry Lab, she seemed (emphasis on SEEMED) like an approachable and understanding person. Many people showed up to her office hours during these first few weeks, and then it all went downhill after that. During class, Rosa's lecturing was so fast paced that you couldn't even finish writing down the reaction mechanism before she moved on to another reaction. I wasn't the only person who felt this way, everyone else in my section agreed. Her quizzes were completely (and insanely) difficult, if not impossible, - to the point that quiz averages usually ranged from 8 - 12 out of 20 every week. We did notice that she slowed down a bit during the middle of the semester - but even that was too fast-paced for most of the people in our section.\nWhat was even more disturbing is that Rosa would list some reactions on the board that were NOT explained at all, and tell you that they will show up on the following quiz. This is especially true for the last 4-5 weeks of the class. WHAT IN THE WORLD? Why should we be tested on a reaction that was not even taught? And the questions on the quizzes are not easy at all - you had to learn the reactions yourself and you were tested on them as if you had learned them VERY thoroughly. TA office hours, in my opinion, was 100 times more helpful than going to Rosa.\nWarning: Rosa is a very difficult person to talk to. If you ask her a question, she will look at you as if you are the most stupid human being she has ever come across. (And a lot of people agree with me on this one). Excuse me, but its not my fault you are incomprehensible to about 80 - 90 % of the class during lecture! One time, another student in my section asked about something that was on the board, and rosa's response was \" OH MY GOD...\". That was completely rude- you are supposed to be an educator, not an asshole. \nIn all, please avoid Rosa's class. If you can take one of Ana's sections, please do! It will be just as difficult - but without the pretentiousness and attitude that Rosa often seems to display!\n\nWorkload:\nA lot. Weekly quizzes that are impossible, 4 lab reports, and having to deal with Rosa's pretentiousness. Highly suggest waiting after you have taken Orgo I , even better if you've taken both Orgo I and Orgo II because most of the reactions you will encounter are from Orgo II. \n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "December 06, 2012",
            "review_content": "\nThis wasn't stressed enough in the reviews: do not take this class simultaneously with Orgo I.  I's more than just a matter of being disadvantaged.  If you take this class beforehand, you will feel really frustrated by the depth of organic chemistry knowledge that is being demanded from you.  Don't think you can take this class without at least a semester of Orgo (no matter what the Chemistry department claims); it's definitely \"doable\", if you're willing to risk your performance in the other classes you're in.  \nThe reason for this is the quizzes - the prelabs and reports you can get help on, but the quizzes are by far the most challenging I've encountered in the Chemistry department.  Unlike the superficial, lightweight general chemistry lab quizzes, these are long and really demand thorough knowledge of organic chemistry.  Steel yourself. \nBut it's not all bad!\nThe only reason I (and many others) survived this course is because the people teaching leading it were extremely nice.  Always make sure to visit Rosa (very nice, in my experience) and your TA, they are incredibly helpful resources.  The three TAs I've noted above were particularly helpful: Steven is a great TA in the lab and in office hours, Umed is always willing to go over concepts  with you, and Cathy was extremely nice and good at explaining concepts.  Count yourself lucky if you ever come across any of them, for any class!'\nOverall: I'll say it again: don't take this class before completing at least 1 semester of Organic Chemistry!  The department doesn't require it (not happy with them), but the course does presume you know how to draw mechanisms and other general concepts (there are lectures, but they're meant to be rather simple).  If you have to take it, pray for generous, helpful TAs and a low curve.  The grade distribution is very generous, so try to make your work pay off.\nWorkload:\nAt least an hour of preparation for the lab (at least), plus another hour or two for the pre-labs. Study hard for the quizzes, pay attention to the mini-lectures and pre-labs.  If you're having trouble, talk to the professor.\nQuiz averages for my section were around 50% usually, I've heard of even worse averages.  \nThe reports are long and tedious, but I certainly didn't put 15 hours into them - my section had a page limit, and there are guidelines that make it easy. \nBe prepared to work a lot, and make sure to balance out the rest of your coursework as a precaution.\n\n"
        }
    ]
}