{
    "prof_info": [
        {
            "prof_name": "Rotating staff of teachers",
            "prof_id": 303,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "V2100 The Climate System",
            "review_date": "January 02, 2005",
            "review_content": "\nThis class in Fall 2004 was taught by Nili Harnik , Arnold Gordon, and James Hays. Each teach about 1/3 of the classes. The TA's were Kevin Jones and Jinbao Li. This course was quite dry for the first 2/3. Nili was an incredibly boring and hard to understand foreign professor (I think she's Israeli, but regardless, her English is heavily accented) .  She was a very nice woman, but useless in explaining fairly basic concepts about the atmosphere and radiation.  Students must teach themselves the material she covered. Arnold Gordon seemed better at first (mostly because he is an American and speaks loud and clear), but he was almost as bad. His lectures had the potential to be interesting (El Nino, Ocean circulation etc), but he managed to make it horribly boring. He also would constantly go off topic and brag about his \"adventures\" in Indonesia and Antarctica.  James Hays was by far the best. He was interesting and very knowledgeable, actually knowing how to lecture.  He was the main reason this class was tolerable. In generally it was boring and one had to work constantly.  The TA's run and grade the labs, with minimal supervision of the profs. The labs were by far the worst part of this class. Only 2 really required the student to do a physical experiment (and even then, it was about 5 minutes of writing down numbers rather than something interesting) . The rest required hours and hours of poring over excel spreadsheets making graphs or manipulating data viewers to find trends in radiation, temperature and other similar   things. Incredibly tedious and not very rewarding\nWorkload:\nLots. Each teacher gave (about) weekly problem sets, which were fairly impossible. You are supposedly allowed to resubmit and resubmit them until you pass, but Gordon and Hays didn't do that. Nili and Gordon were incredibly harsh graders, expecting people in their first week dealing with their topics to understand and be able to produce (!!!!) formulas to solve them.  Hays was better, but still a harsh grader.  The midterm was uncurved so the average grade was like a C+/B-. The labs were due Tuesdays, with about 5 hours work to finish each labs work, and another 7-12 hours typing up the write up. If the reason it took so long was difficulty of material it would be one thing, but instead its basically hours and hours of busy work.  They were graded really easily so most people got above a 85 on each of them, but it doesn't feel rewarding you have to spend so much time on them. Do NOT take this class to fulfill science requirement, really directed at Majors and fulfillment of E3B etc requirements.  Also, the labs are much easier done with partners, even though you aren't assigned any. The only way to stay sane in the tedium is to find someone to talk to and do it with. \n"
        },
        {
            "course_name": "V2100 The Climate System",
            "review_date": "April 05, 2001",
            "review_content": "\nThis is the first course any environmentally related major has to take, and oh, what a pain in the ass it is. Aren't intro classes supposed to be sort of fun, so kids will be drawn into the department? I guess that is kind of harsh, and I think these teachers really think this stuff is fun, but goddamn, this class is not fun. I think there are some key things they get wrong here. First, they teach off the web. this can be seen as a good thing, but it really isn't. There is a perfectly good book that goes over basically all the material, in a much more clear and concise manner. Reading the lecture notes usually just confused me. I mean, most of the people go to the lecture anyway, so whatever -- teach out of the book! Secondly, there is a lab - this is definitely the worst part about this class. Just think chemlab; well, it's not that bad, but it's tedious just the same. Here is my suggestion; any Shmo can do these labs, as long as they can follow directions. Why don't they just teach the class so kids can get interested in the material instead of bogging them down on a 3-hour computer lab, and where the writeup takes a retardedly long time, and it feels even longer because it's so haphazard? Also, the midterm was stupid hard. Other than that, the teachers are super nice and very helpful, and the TA's rule too. They know what's up, and their cynicism shows. I definitely WOULD NOT recommend this class to people just looking to fulfill their science requirement. I don't have any better suggestions, but... don't take this one. It's for majors only, and it sucks even for them.\nWorkload:\nComputer labs and writeups every week. Impossible midterm, same with final.\n"
        },
        {
            "course_name": "V2100 The Climate System",
            "review_date": "December 31, 1999",
            "review_content": "\nTaught by a battery of competent researchers, EESC 2100 is a unique course in that almost all of the course material, including the Tuesday lab session, is on the web. Thus, anybody, Columbia student or not, can access the class lessons and theoretically learn all the material without ever having left one's terminal. This course is not for those who hate computers! The laboratory exercises, in particular, tend to leave one hating the pale glow of the monitor after two hours of staring at a screen. Luckily, the Macs are in tiptop condition. Though the professors are obviously very intelligent, the work in the class is graded by the TAs. Most people in the class agree that they are very tough graders! Even hard-core chemistry majors who easily get A's in Chem Lab should not be surprised to get low C's on their EESC 2100 labs.\nWorkload:\nOne lab a week, about 2-3 pages. Four times a semester: problem set that take about 2-3 hours to complete. 1 midterm and 1 final.\n"
        }
    ]
}