{
    "prof_info": [
        {
            "prof_name": "Alexis Soloski",
            "prof_id": 2621,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 20, 2013",
            "review_content": "\nI had Professor Soloski for both semesters and I have nothing but positive things to say about her. She was one of the best, if not the best, professors that I had during my freshman year.\nIf you get assigned to her for Lit Hum, I'd highly recommend staying in her class. Looking at her other reviews, perhaps her class environment is different for her \"Legacy of the Mediterranean\" courses; however, I thoroughly enjoyed having her for Lit Hum. \nSoloski is very quirky and witty, and the class environment was positive and comfortable. You'll find that she's quite funny (I'd recommend checking out her Twitter feed) and connects with her students very well.\nSoloski is extremely knowledgable about the texts. You can tell that she has studied each text very thoroughly and prepares well for every class. She is also a very effective teacher; she provides a lot of valuable insight, and as stated in previous reviews, her theater background really adds another dimension to the course material. The basic format of each seminar was that she would ask analytical questions to foster a class discussion, while intermittently having us read important passages out loud and discuss their significance (this was very helpful for passage IDs on the midterms and finals).\nTo be honest, I did not do a good amount of the reading; however, I still learned a lot during seminar and did reasonably well on the papers and exams. I think she was a fair grader, and every grade I got back seemed appropriate.\nObviously I can't speak for everyone but our class as a whole really liked Soloski, and almost everyone stayed with her for second semester. We even threw her a mini baby shower and bought her presents for our last seminar. As one of my friends put it, \"Soloski is the shit.\"\nWorkload:\n1 page journal entries due about 2 out of every 3 classes; these sound like a hassle, but they're really not bad. They only take about 20 minutes and are graded for completion.\n2 papers per semester; one about 5 pages long, the second about 8 pages long. You should probably go to office hours to discuss your paper with her. I never did and I'm sure it would've improved my paper grades.\nMidterm (written by her): passage IDs (need to know dates of each text) and free response questions. Not difficult if you've paid attention during seminar.\nFinal (written by Lit Hum department): essentially same format, Soloski prepares you well for it.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 03, 2011",
            "review_content": "\nI had Soloski last year, and all in all she is a very enjoyable professor to have. As other reviews have stated on here, her theatre background makes the texts, especially the plays, interesting as she gives special insight into things from the Greek play competitions of the time to the intricacies of Greek man loving (usually not penetrative, is the answer). As for downsides, at times there will be long, long, awkward silences if no one knows the answer (or is usually too tired to talk as it was a 9am class) but after that she will accept the first thing that someone says even if it is utter rubbish. \nSince you can't really choose Lit Hum professors, at least at first, if you end up having her I would say you are lucky, because I really enjoyed my two semesters of Lit Hum. And all but one of the people in the class stayed at the start of the second semester (when you CAN choose to opt out of your class). \nFinally, grading is very fair (I got good grades both semesters) with a decent percentage of the class getting A's. I would advise meeting with her/emailing her a lot when doing an essay though because it will make you a lot clearer on what exactly she wants. \nWorkload:\nReading responses almost every class (but only 250 words and marked but hardly count towards final grade, ll be fine. \n"
        },
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "July 15, 2009",
            "review_content": "\nI agree with the review below for the most part. Soloski can be condescending and obsessed with her own intellect. She is smart and often witty and provides useful comments on essays. However, the class environment is not pleasant, and she makes students feel like they are below her. Sometimes she even shoots down students' ideas in front of the class, and then when she asks questions later and is met with silence, she will jut sit there for like 2 minutes and wait for someone to speak. Very strange! The books are pretty good for this class, though, and Soloski is not horrible...she just is definitely nothing like the glowing reviews from a few years ago. Everyone pretty much agreed that she is condescending and class discussions are weird. But... Im pretty ambivalent about her in general.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 17, 2009",
            "review_content": "\nSoloski clearly knew her stuff and was well-educated in the material and prepared for class. However, her class \"discussions\" consisted of her calling on people to let them speak then ignore what they had said and to lead the class towards saying what SHE was looking for. She was very condescending and often acted like she was \"the cool teacher.\" \nHer essay grading was fair, and she did offer some constructive comments on rough drafts. Some of those included things like, \"do not use semi-colons,\" which seemed entirely ridiculous as I have been using them in my writing for years with no problem. \nPart of my problem with her class was the fact that I hated the Legacy syllabus (that had nothing to do with the Mediterranean) but I also found Soloski's class to be unbearably long every day.\nWorkload:\n3 papers (5-10 pages), readings for every class, sometimes reading responses (200 words). Near the end of the semester reading was essentially optional.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 16, 2008",
            "review_content": "\nFantastic fantastic teacher. At the beginning, she can seem a little intimidating; after all, she really does know her stuff. But after writing my first paper and sitting down with and learning what you can do to improve, you realize she totally is not as scary as she seems and totally has constructive criticism. Very fair grader who makes it very clear how an essay should be structured. A great fun personality who really brings interesting points to the class discussion.\nSince you don't get to choose your First Year English professor, consider yourself lucky if you get Professor Soloski\nWorkload:\n2 essays plus one final research paper\nOn all three there is a first and second draft and she tends to weight the second draft more for the paper's final grade\nBi weekly reading responses that are simple and straightforward- plus, you're allowed to skip two a semester\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 19, 2007",
            "review_content": "\nI completely second the other reviewers.  Best Lit Hum professor ever.  Since her background is in drama and theater arts, she brings a lot of excitement and enthusiasm for all the texts, particularly the Greek dramas.  She's quirky, irreverent, and all in all a lot of fun.  Her stories definitely make a 9 am lit hum class enjoyable.  She's not an easy grader, but thank god, because it prepared me really well for CC.  And speaking from experience, WATCH OUT FOR BEING LATE. she will call your cell phone.  and wake you up.  and politely ask you to come to class. and then applaud when you get there.\nWorkload:\nThe usual, though the reading intensifies as the class progreses (but i'm pretty sure that's standard)  Papers are graded very fairly, midterm is pretty straightfoward, so study.  Final is standardized, but she prepares you well.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2006",
            "review_content": "\nLOVE HER! despite the fact that she gives journal topics almost every class, she's funky, awesome, ENTHUSIASTIC, and incredibly insightful. It's easy to get stuck in a crappy lit hum section and luckily i switched out as soon as i knew that my section was going to be boring. switching into soloski's class was the best thing i did during my first year in college (and i have had my mistakes). as a yale educated undergraduate in english and theatre, she's incredibly knowledgable and provides great exegeseses of the literature! \nWorkload:\nlike i said, a journal entry almost every class, but there are times when she just decides that she doesn't want to have one. three papers a term, and a midterm and final. the usual. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 12, 2005",
            "review_content": "\nAmazing. Everyone loves her. She makes class interesting, even if it was at 9 a.m. and she makes everyone WANT to be there (even athletes). Don't skip too many times- she'll get your cell phone number and call it; but it's out of love. She's a fairly tough grader but she's willing to help and her solid grading makes everyone better in the long run.\nWorkload:\nthe usual lit hum amount, but with The Bacchae (very quickly). homework journals for each class, but you get to miss 4 per semester. 1 creative project that everyone enjoys. 3 essays. participation, midterm, final.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 20, 2005",
            "review_content": "\nAlexis is the most awesome instructor anyone could ever have. Although she's now teaching Lit Hum I recommend taking her class. She's very fun and energetic. In addition, she'll never make you feel like an idiot and will always give good advice on writing. I truly enjoyed this class and would defenitely recommend her, whichever class she's teaching.\nWorkload:\nVery light. A few papers which she grades fairly generously. Is very flexible with deadlines.\n"
        }
    ]
}