{
    "prof_info": [
        {
            "prof_name": "Anton Zeitlin",
            "prof_id": 11928,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus IIA & IIIA",
            "review_date": "January 03, 2017",
            "review_content": "\nProbably the quirkiest professor I've had. Most of what he teaches is copied off the textbook. He follows the examples from the textbook, so if you ever doubting or wondering what the hell is going on, just reference the textbook for his examples.\nCovers Calc II, integrals, methods of integration, polar and parametric, and Series and Sequences.\nHis Russian accent is not as think as people say it is. He's a genuinely nice guy who doesn't always answer student's questions, but nonetheless, a pretty decent professor. He does crack jokes and most of the time students don't get it.\nApparently, he doesn't teach Calc II much, he usually does Calc I and III.\n\nWorkload:\nWeekly homework. About 5-20 problems from the textbook. Always the ones where the answers are NOT in the back. Can take more than 2 hours depending if you're working with other people or finding help online...The more difficult problems in the homework, those type of problems won't appear in the tests.\n2 Midterms which are each 25% of your grade, I believe. Both of which are fine if you study. The first one is generally harder than the second because it focuses purely on methods of integration.\nFinal- 8 problems. If you score a higher grade in your final than your cumulative course grade, he will give you the grade you got on your final.\n"
        },
        {
            "course_name": "Calculus S series",
            "review_date": "December 21, 2016",
            "review_content": "\nProfessor Zeitlin is without a doubt the worst professor I've had so far at Columbia. His lectures are incoherent and he might as well be talking to an empty room for all the student engagement he inspires. Also, his lectures just consist of him writing the same examples that are done out in the textbook on the board, so most people don't even show up to his class.\n He makes fun of students who ask him to explain something again or who ask questions in his class, and likes to talk a lot about how \"obvious\" various proofs are.  He's also really into putting trick questions on midterms and finals, and will never be willing to tell you which concepts to study before tests. PLEASE do yourself a favor and avoid this guy at all costs :(\nWorkload:\nWorkload for this class varied quite a bit. There was a problem set every week, usually about 20 fairly long multi-step problem, and always involving proofs to some extent. Some problem sets were short and painless, and others took forever and involved huge mathematical leaps from class material which were pretty unreasonable to expect from us.  Zeitlin doesn't use Webassign. His midterms and final are hard, but curved. He likes trick questions.\n"
        },
        {
            "course_name": "Calculus S series",
            "review_date": "December 21, 2016",
            "review_content": "\nProfessor Zeitlin is without a doubt the worst professor I've had so far at Columbia. His lectures are incoherent and he might as well be talking to an empty room for all the student engagement he inspires. Also, his lectures just consist of him writing the same examples that are done out in the textbook on the board, so most people don't even show up to his class.\n He makes fun of students who ask him to explain something again or who ask questions in his class, and likes to talk a lot about how \"obvious\" various proofs are.  He's also really into putting trick questions on midterms and finals, and will never be willing to tell you which concepts to study before tests. PLEASE do yourself a favor and avoid this guy at all costs :(\nWorkload:\nWorkload for this class varied quite a bit. There was a problem set every week, usually about 20 fairly long multi-step problem, and always involving proofs to some extent. Some problem sets were short and painless, and others took forever and involved huge mathematical leaps from class material which were pretty unreasonable to expect from us.  Zeitlin doesn't use Webassign. His midterms and final are hard, but curved. He likes trick questions.\n"
        },
        {
            "course_name": "Calculus S series",
            "review_date": "December 21, 2016",
            "review_content": "\nProfessor Zeitlin is without a doubt the worst professor I've had so far at Columbia. His lectures are incoherent and he might as well be talking to an empty room for all the student engagement he inspires. Also, his lectures just consist of him writing the same examples that are done out in the textbook on the board, so most people don't even show up to his class.\n He makes fun of students who ask him to explain something again or who ask questions in his class, and likes to talk a lot about how \"obvious\" various proofs are.  He's also really into putting trick questions on midterms and finals, and will never be willing to tell you which concepts to study before tests. PLEASE do yourself a favor and avoid this guy at all costs :(\nWorkload:\nWorkload for this class varied quite a bit. There was a problem set every week, usually about 20 fairly long multi-step problem, and always involving proofs to some extent. Some problem sets were short and painless, and others took forever and involved huge mathematical leaps from class material which were pretty unreasonable to expect from us.  Zeitlin doesn't use Webassign. His midterms and final are hard, but curved. He likes trick questions.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 03, 2014",
            "review_content": "\nHis lecturing style takes some time to get used too. He doesn't explain everything outright - which I liked, because it always bored me half to death to have a teacher waste time on something that was obvious - and therefore always finishes class early. (We've even been let out after only 35 minutes - it was a short lecture.) \nOther times, his style can be confusing because he doesn't always explain what he's doing on the board, and if you can't hear him all you'll see are formulas scrawled on the board. He has good legible handwriting, though. Reading the book chapter beforehand, or reviewing your notes/asking him a question after lecture will help.\nI'd recommend him for students who are proficient to well-versed in math. If you constantly need a refresher before every lecture, then choose someone else, or get in the habit of reviewing lecture notes a little before class.\nHe doesn't do WebAssign, which is a great bonus. WebAssign sucks. Instead, he just assigns a bunch of textbook problems.\nHis midterms are the best part. If you're wishy washy about choosing a math professor, choose Zeitlin for his tests. No dumb True/False questions, no stupid multiple choice questions. He gives you just six problems, all short answer (three to four lines of math), and I've finished the whole thing in ten or twenty minutes before. Some problems are easy, but the latter problems do require a little bit of thought, so overall I'd say the tests are fair.\nWorkload:\nWeekly textbook homework\nTwo midterms\nOne final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 20, 2014",
            "review_content": "\nThis was Professor Zeitlin's first time teaching Calculus III, and let's say that it \"really showed\". I'll trust the previous reviewers who raved about his Calc I course, but I found his Calc III lectures to be pretty unpleasant. There were some good things about the class, namely: \n1) The homework was very preparatory for his tests, and \n2) His tests were relatively easy -- both midterms averaged a B- uncurved. \nWhat about Zeitlin himself? Well, he doesn't seem like a nice person. I wouldn't ordinarily critique a professor based on his personality, yet it really shows. He gets frustrated whenever anyone asks a question as if he's annoyed that we don't get it. At the same time, he frequently asks for questions! It's confusing...I think that most people in the class became too afraid to ask questions. He generally makes question-askers feel dumb for not understanding something and always talks about how \"easy\" and \"obvious\" the answers are. When reviewing our second midterm, he was legitimately dumbfounded how so many people in the class messed up question 4. Does he expect midterm averages to be 100% or something? In general, I would say Zeitlin is dismissive about student concerns. \nHis lectures are essentially carbon-copies of the textbook (including his examples), which can be good or bad depending on your perspective. A significant portion of the class didn't go to lecture knowing that the textbook could provide the same information in a less convoluted manner. If lectures aren't your thing, you'll probably love this class because you can never go and still get decent grades.\nWorkload:\nVery manageable. 1 problem set a week, none for midterm weeks. The problem sets the weeks before and after the midterms are generally shorter. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 20, 2014",
            "review_content": "\nThis was Professor Zeitlin's first time teaching Calculus III, and let's say that it \"really showed\". I'll trust the previous reviewers who raved about his Calc I course, but I found his Calc III lectures to be pretty unpleasant. There were some good things about the class, namely: \n1) The homework was very preparatory for his tests, and \n2) His tests were relatively easy -- both midterms averaged a B- uncurved. \nWhat about Zeitlin himself? Well, he doesn't seem like a nice person. I wouldn't ordinarily critique a professor based on his personality, yet it really shows. He gets frustrated whenever anyone asks a question as if he's annoyed that we don't get it. At the same time, he frequently asks for questions! It's confusing...I think that most people in the class became too afraid to ask questions. He generally makes question-askers feel dumb for not understanding something and always talks about how \"easy\" and \"obvious\" the answers are. When reviewing our second midterm, he was legitimately dumbfounded how so many people in the class messed up question 4. Does he expect midterm averages to be 100% or something? In general, I would say Zeitlin is dismissive about student concerns. \nHis lectures are essentially carbon-copies of the textbook (including his examples), which can be good or bad depending on your perspective. A significant portion of the class didn't go to lecture knowing that the textbook could provide the same information in a less convoluted manner. If lectures aren't your thing, you'll probably love this class because you can never go and still get decent grades.\nWorkload:\nVery manageable. 1 problem set a week, none for midterm weeks. The problem sets the weeks before and after the midterms are generally shorter. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "July 09, 2013",
            "review_content": "\nHe is a wonderful professor who can explain the fundamental and gives good examples to understand the concept. His exam is a bit tricky but manageable if you fully understand the basic concept and attend every course. If you work hard enough, you will get a chance to have A+ from his course. He always gives very good review showing which questions will appear in the exam and there is no \"math olympic\" style questions. He sometimes makes jokes (Not very funny though). \nWorkload:\nhomework (all of them from the textbook), 2 midterm, 1 final (All reasonable) \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "May 12, 2013",
            "review_content": "\nI would highly recommend taking this class over the other Calc I courses.  He doesn't have web assignments and his test questions are apparently alot easier than other teachers' exams.  He believes \"why give you a curve ball when we are just talking about the fundamentals?\"  He does expect you to know everything up to calculus (trig identities, etc) He is also always available to help you, just give him an email before and he will try to work around your schedule.  \nWorkload:\n10% Homework\n(2) 25% midterms- He gives very similiar examples on his review\n40% Final-Havent taken the final yet but should be similar to midterms\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 21, 2013",
            "review_content": "\nProfessor Zeitlin is an amazing professor. I really enjoyed his class and it seemed he was a very good professor, our average was consistently higher than the other classes. He was extremely dedicated to the course- he would come in at any time (I met with him a couple of times at 9:30 pm) and really was committed to helping students. He also became very good at teaching- at first he had a couple of issues, but it was his first year and he quickly fixed them and listened to student concerns. Our class seemed to do well and I strongly recommend him as a professor!\nWorkload:\nVery manageable, homework every week which counted for 10% of your grade and 3 midterms each for 30%. The TA's weren't good with grading but he would always correct things if there was a problem.\n"
        }
    ]
}