{
    "prof_info": [
        {
            "prof_name": "Kamiar Rahnama Rad",
            "prof_id": 3557,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Statistics",
            "review_date": "December 26, 2009",
            "review_content": "\nSTAY AWAY FROM THIS CLASS. You think it's going to be a piece of cake because there is no calculus involved, but \"Professor\" Rad is the absolute worst teacher I've ever experienced. Going to class is pointless because he can't explain the material, and the book is not a great help either. He gives a quiz every Monday, and it's supposed to be on only what you did the past week, but sometimes he'll throw in a question on something completely random. There are also weekly homeworks which aren't so bad...if you spend an hour and a half teaching yourself the material before you do the problems. \nThe only good thing about this class is that the quizzes and homework count for most of your grade, and the final is only 20%. There is no midterm. There are no more than 3 questions per quiz and the final had a grand total of 4. This class made me want to run to the Bursar's office and demand a refund for this class. I learned nothing, and I dreaded every single class. Getting an A is definitely not impossible, but it just shouldn't have to be that hard for a class like this. Bottom line: Professor Rad is terrible and so is this class.\nWorkload:\nA quiz every Monday--doing the homework problems is a good way to study; Weekly homeworks--you need to teach yourself the material because Professor Rad won't; No midterm; A final I wasted too much time studying for because it's only 4 questions. The quizzes and final questions are taken from review problem sections. \n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "September 08, 2009",
            "review_content": "\nKamiar is NOT a professor.  He's a grad student.  He has a heavy accent, is completely lifeless and dull.  He was our TA for W4107 (Statistical Inference).  He intentionally kept unreasonable office hours, even though all of us asked for a different time.  He said he would be available by appointment but that didn't work either.  One time he tried explaining something but didn't make any sense.  \nWorkload:\nNormal\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "December 18, 2008",
            "review_content": "\nThis class was not particularly difficult.  The textbook was organized well and the material is vaguely interesting if you're curious about statistics.  However, this was a very odd class.  The professor looks like he's plucked right out of grad school and he speaks with a heavy Iranian accent.  (Sometimes two thirds is pronounced \"two turds\").  Classes are very lifeless and dry; I have seen people fall asleep on several occasions. There's pretty much no way to schmooze this guy.  I believe he made a total of 2 jokes the entire semester.\nWorkload:\nHomework is manageable: about one problem set per week.  There are also quizzes every week/ every other week.  He drops the lowest two scores.  The midterm was split into two parts and then there's a cumulative final.  Class is graded on a curve.\n"
        }
    ]
}