{
    "prof_info": [
        {
            "prof_name": "Isabelle Jouanneau-Fertig",
            "prof_id": 1264,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French I",
            "review_date": "September 14, 2015",
            "review_content": "\nLOVE this professor. She's very strict and a bit intense, but you will definitely learn. Also, she's actually quite nice and funny. Her grammar packets are also really helpful, and I basically aced the class by practicing at her packets. \nWorkload:\nMore work than other intermediate courses perhaps, but it's all helpful work. I think it was three essays, midterm, and a final. You're allowed to do rewrites for the compositions, and the final grade is the average of the two.\n"
        },
        {
            "course_name": "French Composition and Conversation",
            "review_date": "April 14, 2015",
            "review_content": "\nI found this a fun class that was good for maintaining my current language level without doing a ridiculous amount of work. If you're looking to improve your grammar or oral ability significantly however, this is probably not the class.\nClass generally involved a light amount of reading, or watching a film beforehand, which we then discussed. Mme Jouanneau-Fertig was good at pushing everyone to speak and I felt she tried to use the occasion to really know you.\nAll in, she's a good professor and a kind lady who goes out of her way to help her students, especially if they're going abroad to study or hoping to do graduate work in France. You won't see great improvement in your French from this, but that's not what this class was designed to do.\nWorkload:\nVery, very reasonable. Weekly journals which seemed a pain, but turned out to be good because she bothered to respond to them. 4 compositions (2 light, 2 which required some work-- rewrites allowed, of which the average of 2 grades was final). One group presentation.\n"
        },
        {
            "course_name": "Intermediate Oral French",
            "review_date": "January 13, 2015",
            "review_content": "\nI had Mme. Jouanneau-Fertig for two courses and am currently trying to get into another class with her. She's one of the best teachers I've had in my college career. She's very structured; she has a syllabus, and she sticks to it closely. In every class she has us review the syllabus and points out any interesting things we should keep in mind, such as quizzes, presentations, and film-viewings. Unlikereview_contentr review_content of French Fundamentals class, Mme. J-F talked to our ridiculously small class (6 people with the cap at 12) in French 95% of the time, which is understandable given that you can only take this class once you've at least taken Intermediate I. In my class, we either finished/ tested out of the French requirement or were taking Intermediate II.\nAs this was my first French class that was not grammar-intensive, I was taken aback by all the grammar and vocab I had to recall, and I was initially frustrated my progress in it. However, because of all the talking we did in class (it was inevitable since there only 6 of us), as well as the interesting various points of discussion, I definitely improved in speaking. Madame is very good at coaching us.\nMadame is a very fair grader. She would take notes while we talk to the class and then later point out what was great and what we need to work on. There are also vocab quizzes, which personally bogged down my grade a little, but that's a matter of discipline. With the amount of vocab we had to study, you can't study for it overnight.\nMadame is an enthusiastic, friendly, and supportive professor, probably one of my favorites. I wouldn't have taken another class with her if I didn't like her personality and teaching style. I would definitely recommend this class for those who struggle with speaking in French. You really improve!\n\nWorkload:\nIn-class participation, vocab quizzes, 1 class-long presentation (in our class it was in groups of 2, but the number of classes she reserved for these presentations and the cap on the number of students allows for groups of 3), 1 10-minute final presentation during class time\n"
        },
        {
            "course_name": "French Composition and Conversation",
            "review_date": "November 20, 2014",
            "review_content": "\n Wonderful teacher! Very sweet and teaches us a lot about French culture in the course. It is not a grammar course, so I wouldn't particularly recommend this class if you need to refine your grammar because that's not really covered in the material. What IS covered in the material, however, is really interesting and fun stuff. The class is definitely participation based, and everyone speaks in class about various subjects such as classes, roommates, clothing, studying abroad, race issues, etc. etc. (we honestly talk about anything and everything!) The workload is pretty light, and there is no final. So if you don't necessarily need to improve your grammar and you want to take a fun and interesting French course I would definitely recommend this class!\nWorkload:\nJournals due almost every class, however they are graded on completion. 3 compositions/essays (usually 3-4 pages,) you have to watch two or three movies and give short presentations on them, vocabulary quizzes, one oral exposition where you and a partner teach a class, and lots of class participation. \n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "January 05, 2013",
            "review_content": "\nBest French class I've ever taken! I've already taken French for about 6 years, so I knew many of the lessons taught in the class. The professor obviously has a love of the French language and wants to spread its joy to you. She showed us pictures of the different regions of France and we even sung all together a French nursery song. She only allows English when clarifying something very difficult to say/understand in French. She works on all aspects of the language with everyone individually. Sometimes she goes around asking everyone to answer individually, but she never makes you feel bad if you get something wrong, she just keeps encouraging you until you get it right. The class is focused on tenses and grammar, but she does not test you on very unusual exceptions.\nWorkload:\nNot too bad if you put in the effort to do the few exercises she assigns to be prepared for each class. The quizzes and tests are similar to the packets done in class. Probably a total of 5-8 hours a week of studying.  \n"
        },
        {
            "course_name": "Commercial-Economic French",
            "review_date": "September 18, 2012",
            "review_content": "\nI was a French major, and I took this class during my last semester of college.  After having studied abroad in Paris, this was the perfect way to consistently speak French back at CU and expand my vocabulary.  This class is quite particular, since it has a more practical focus than most undergrad classes and since the class size is capped at a small number.  As a result, my ability to comprehend and discuss current events (particularly related to economic policy) was stretched immensely.  This class was especially useful to me because I had the opportunity to create my resume in French, practice interviewing in French and familiarize myself with French style and expectations in the business world, and master the job interviewing skills I was working on in English in French!  As a result of this class, I would feel confident applying to jobs in France.\nProf. Jouanneau-Fertig makes students feel comfortable speaking in class and she has a helpful and un-intrusive way of correcting errors.  She also really tailors the class and expectations to individuals' needs and interests.  (For example, there were several seniors applying to jobs, so she helped us tailor our resumes and cover letters to entry level jobs in industries that interested us.)\nProf. Jouanneau-Fertig loves maps, and I feel much more knowledgeable about the geographic, economic, and industrial layout of the French regions.  This type of knowledge is important to have in order to feel comfortable among French colleagues.  For me, the best part of the class was discussing news articles about economic policy in the EU.\nIn terms of the exam: Prof. Jouanneau-Fertig is right when she says her students are extremely prepared for it.  I felt really lucky to have the opportunity to have a sort of \"prep class\" as well that fit into my day, and I've already used a lot of the vocab I learned since graduation!\nWorkload:\nThere are two workbooks that are prep for the exam at the end.  We write frequently resumes of news articles and prepare small speaking assignments for class, but it's not particularly difficult or time-consuming.\n"
        },
        {
            "course_name": "review_content of French Fundamentals",
            "review_date": "January 02, 2012",
            "review_content": "\nThis was an excellent course, the best language class I have ever taken. Prof J-F is truly engaged and engaging--its kind of impossible to space out when she is teaching because she is so charismatic. I feel much more confident in both spoken and written French after taking this course and I understand French grammar in much more depth. Overall I feel this course laid a very strong foundation to continue learning the language and really inspired me to write and express myself in French. The course was paced well because, it never felt too easy or too hard\nWorkload:\nYou definitely have to exert a steady effort to get the most out of the course. It was not an unreasonable amount of work. She assigns more work during the week than over weekends which I liked. \n"
        },
        {
            "course_name": "review_content of French Fundamentals",
            "review_date": "January 21, 2010",
            "review_content": "\nI absolutely adore this woman!  She is extremely kind, funny, and helpful.  She focused a lot on improving oral skills, which was really beneficial, while remaining organized.  She made sure everyone participated but in a non-threatening way so no one was ever afraid to get it wrong.  She assigned a lot of exercises in the workbook but didn't really check to see that you did them.  She taught every subject comprehensively with a smile on her face all the while.  She went at a great pace, not too fast, not too slow.  I would recommend taking any french class with her.  She's such a cutie!\nWorkload:\nExercises that are mostly for you if you need them, a lot of pretty easy quizzes, 4 compositions which you do two drafts of, midterm and final (both easy)\n"
        },
        {
            "course_name": "review_content of French Fundamentals",
            "review_date": "January 21, 2009",
            "review_content": "\nProfessor Jouanneau-Fertig... what a great professor. She is lively and enthusiastic which helps you get more involved, and that's important in a language class. She is the sweetest person, and is always approachable and eager to offer outside help as necessary. She really helps students remember the material by getting you to talk aloud in class. She likes to have lots of cute activities and watching her dance to her Carla Bruni music is priceless. She's extremely organized and sticks to the syllabus. She makes class a lot of fun and very productive at the same time.\nWorkload:\nDaily exercises in the workbook that she rarely checks after the first few classes, so it's really more as a review for yourself if you want/need it. 4 essays- you get to give in first drafts on each of them and your grade is averaged between the first and second drafts. Straightforward exams and quizzes- about 4 in all, including the midterm and final. But watch out for the vocab sections- she pulls random words out of the book and expects you to know them all... but if a lot of people get them wrong she sometimes doesn't count them. She's a very reasonable grader.\n"
        },
        {
            "course_name": "Composition and Conversation",
            "review_date": "December 22, 2007",
            "review_content": "\nI must say my French did not improve in this class at all.  Madame J-F spoke English much more than she should have at this level.  Her grading standards were also not clearly defined.  If you don't have a good French accent, she will take that into heavy consideration with grading.  She seems sweet, but overall, the class was not well done.  The course definitely had a lot of potential, just not with this teacher.  Take this class with Phillip Usher if you can - he is amazing! \nWorkload:\nMostly busy work and compositions.  One final project that is very manageable.  Don't expect to improve your French skills. \n"
        },
        {
            "course_name": "Composition and Conversation",
            "review_date": "May 10, 2006",
            "review_content": "\nShe is so sweet and genuinely loves teaching.   She was always enthusiastic and engaging, and I found that my French did improve, although you have to put in effort and not expect it to just magically happen.  A really positive experience both with her and with the other students.\nWorkload:\nfive 1-2 page creative papers, required participation, an ungraded personal journal due each week, one 40-minute presentation with a partner.  a couple movies you have to see out of class and do writeups for, and some reading (a comic book or excerpts from bigger works).  no midterm/final.  ended up being more work than i had expected, but not too much, and was worth it.\n"
        },
        {
            "course_name": "French Composition and Conversation",
            "review_date": "May 03, 2006",
            "review_content": "\nVery amicable person and fair grader. The actual content of the conversations were dry and seemed to be put together at the last minute. But the compoisitons are fun.  \nWorkload:\nweekly journal, bi-weekly composition, daily oral participation, big oral presentation with partner. no midterm or final\n"
        },
        {
            "course_name": "Intermediate Oral French",
            "review_date": "May 01, 2006",
            "review_content": "\nProfesseur J-F was always extremely organized and excited for class, so much so that she would always try to start a few minutes early. Be warned: in this class punctuality and attendance are a significant consideration in your grade.\nThe course was structured so that each week had a theme, and we always stuck to the syllabus. This was efficient, but it also meant that we never got to discuss anything interesting. In fact, we barely got to talk to each other, except to read a list of simplistic questions back and forth. I do not feel that my French improved, and my grammar certainly deteriorated. \nThe best way I've found to describe the class is that it's like a middle school language course.  There's lots of boring day-to-day vocab, and she has all of these little activities planned out. She does most of the talking, and frankly, doesn't have much of interest to say.\nAnd we got a lot of pretty useless handouts, but not enough to justify the $20 she collected from us at the beginning of the semester.\nWorkload:\nFor the most part, a joke. Who assigned 3 credits to this class? But there is one oral presentation on a topic of your choice. For the final, you just have to talk to her for 3 minutes about anything you want to.\n"
        },
        {
            "course_name": "Commercial-Economic French",
            "review_date": "September 23, 2005",
            "review_content": "\nHands down the best French teacher I have had.  Always flexible, always thoughtful, always on track with the syllabus.  Terrific material if you are interested in working/living in France and excellent competency in the material, since after all Prof. Jouanneau-Fertig is French herself!  There wasn't a day I didn't look forward to this class, nestled between dull economics seminars and arcane philosophy symposiums.\nWorkload:\nEnough to make you learn the material, which turns out to be a bit less than the typical 3 pt. course.\n"
        },
        {
            "course_name": "Commercial-Economic French",
            "review_date": "April 23, 2005",
            "review_content": "\nThe class is only offered in spring, and is open mostly to graduating seniors, though if you're a junior who wants to work in France over the summer, or a student at one of the grad schools, you probably could talk your way in. It's a pretty unique course -- it's designed to help you navigate your way around the job market in France, or be at least comfortable with the rudiments of doing business there. So we learnt the French terms for business terminology, wrote French CVs, learnt how to write cover letters in French, learnt how interviews would generally be conducted... it was cool, IF that's your kind of thing. If you like French lit classes, this is absolutely not the same thing. We also learnt about the socio-econ climate of France, talked about its relationship with the EU, etc etc etc. I loved it, but I know there were some people who did not consider it a sufficiently \"serious\" French class. Whatever works for you, I guess. Mme Jouanneau-Fertig is as friendly and chatty as the other reviews have said.\nWorkload:\nIf you're a French major it's almost a joke; if you're not, it might take some getting used to (especially if you're not fluent). The aforementioned letters and about 4 versions of your CV; about 5 resumes (summaries) of press articles, assorted worksheets. She distributes them like candy. Nothing too hard overall, but you'll have to spend *some* time on them. 3 tests + 1 midterm, no final. Instead, she prepares you for an external exam administered from Paris at the end of the semester. It's optional; you pay $100 to take it and you get a diploma if you pass. That exam is a little extra work, but not too much.\n"
        },
        {
            "course_name": "Composition and Conversation",
            "review_date": "September 02, 2003",
            "review_content": "\nProf. Jouanneau-Fertig is very sweet, and she keeps the class size small and very relaxed.  You have to do a couple of very brief (2 mins.) oral presentations and a couple of short essays (1-2 pgs. each).  There is also a final project -- a 30 min. oral presentation with a partner (she gives you a whole class for it, but she encourages the other students to ask questions, which takes up time since she ususally ends up answering and commenting on all of them).  This class is an easy A, but don't expect to vastly improve your oral or written skills.   \nWorkload:\nVery mangeable.\n"
        },
        {
            "course_name": "Intermediate Oral French",
            "review_date": "November 18, 2002",
            "review_content": "\nMadame Jouanneau-Fertig is genuinely sweet - possibly the nicest teacher I've had here. She organized class trips to Barge Music (where you eat cheese, drink wine, and listen to a small orchestra play on a pier in Brooklyn). She organized the curriculum around our interests. She was really just trying to help us all become more comfortable speaking french, and she succeeded. While our grammar didn't necessarily improve, the class (all 8 of us) was more prepared to jump into conversation in french and better able to communicate in the language.\nWorkload:\nThere were a few vocab quizzes that were no big deal. One big project on a topic of your choice that you present orally to the class, and the teacher is extremely helpful in gathering materials and information.\n"
        }
    ]
}