{
    "prof_info": [
        {
            "prof_name": "Daniela Noe",
            "prof_id": 485,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Intensive Intermediate Italian (I and II) ",
            "review_date": "January 05, 2006",
            "review_content": "\nI can't say enough good things about Professor Noe. The course may lack structure for your taste, but don't let that discourage you from taking it. Professor Noe is a native Italian with an extremely warm and encouraging personality. She imparts a wealth of knowledge about Italian language and culture to her students. She transformed me from a reluctant student of the language to a potential Italian major. She encourages students at all levels to speak the language and improve their conversational skills. She is the most effective language teacher I have ever studied under in my life. Professor Noe corrects all of your mistakes and makes sure that you learn every bit of the material correctly, but she is fair, compassionate, flexible. I recommend her as a professor as surely and confidently as a recommend Italian as a language.    \nWorkload:\nNo more than you'd expect; perfectly reasonable. Professor Noe is a very fair grader. \n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 10, 2005",
            "review_content": "\nAmazing Italian teacher, sweetest lady ever.  Workload standard to any intro language course.  Spoke english rarely.  Some busy work, not too many compositions.  I highly recommend her.\nWorkload:\nTypical...quizzes every two to three weeks, hw every night from txtbk or extra handouts, midterm, final, final oral presentation, labs once a week.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 02, 2005",
            "review_content": "\nDaniela is an incredibly fun professor to have.  She was raised in Italy, so she clearly knows the language, yet she always speaks so that her students can (generally) follow along.  But more importantly, she keeps the class lively and fun.  If you're taking a class that she's teaching, sign up for her section.\nWorkload:\nDaily (short) assignments, language lab most weekends, compositions every three weeks or so, midterm, final.\n"
        },
        {
            "course_name": "Advanced Italian",
            "review_date": "June 15, 2003",
            "review_content": "\nShe is absolutely great and super motivated to help her students improve. She does assign a good amount of work but isn't very picky about when people hand it in...she gets a bit disorganized. Prepare to work and learn a lot, she does her best to make the experience the best for all her students.\nWorkload:\nA bit much at times, but isn't crazy about promptness\n"
        },
        {
            "course_name": "Advanced Italian Conversation II",
            "review_date": "February 26, 2003",
            "review_content": "\nDaniela is certainly one of the nicest professors in the Italian department, but her workload for a 2-point class is simply unreasonable.  She does very well with facilitating discussions on every topic imaginable, and a semester with her will vastly improve your Italian skills.  She tended to forget that we were all enrolled in a conversation class, and assigned grammar homework weekly.  \nWorkload:\nPresentations, grammar packets, dialogue writing.  Would be tolerable if it were anything but a 2 point class.\n"
        },
        {
            "course_name": "Advanced Italian",
            "review_date": "January 18, 2003",
            "review_content": "\nProfessor Noe is great.  She was able to help students at all different levels in the class improve their Italian.  She was easy to reach outside of class and happy to help with any assignments and fun to talk to.  Despite some obnoxious people in the class she managed to keep the subjects interesting.  She loves language in general, so she's better at teaching it than other Italian teachers I've had.  If you have the opportunity to take her, go for it.\nWorkload:\nfrequent short writing assignments and readings, midterm and final; pretty light\n"
        },
        {
            "course_name": "Advanced Italian",
            "review_date": "December 16, 2002",
            "review_content": "\nDaniela Noe is an amazing teacher and a wonderful woman. She is always smiling and takes the time to get to know all of her students. The class material is pretty interesting -- mostly films and short stories, with a few grammar units -- and the workload is fairly light. There is some grammar work and about 10 short essays throughout the semester. Even though the classes can be a bit boring sometimes (when we review grammar), Daniela does her best to make class time useful and fun.  She is very flexible and simply wants her students to enjoy Italian language and culture. She may seem disorganized or frantic at times, but is just part of her Bolognese charm. She is amazing -- take her class if at all possible.\nWorkload:\nabout 10 short essay assignments (1-2 pages), reading, grammar homework, final\n"
        },
        {
            "course_name": "Beginning Italian I and II",
            "review_date": "December 31, 1999",
            "review_content": "\nA very kind yet eccentric woman. Prepare for her glasses (2 pairs) to get inevitably tangled in her hair. Nonetheless, she will teach with glasses attached to follicles, and she will teach well. Genuinely inspiring and available outside of class to answer any questions. Entertaining and fair. Ciao bella.\nWorkload:\ntoo much busywork; easy exams \n"
        }
    ]
}