{
    "prof_info": [
        {
            "prof_name": "Stephanie Beardman",
            "prof_id": 1199,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "April 25, 2012",
            "review_content": "\nI had Professor Beardman for Intro to Philosophy this semester and became very fond of her and the subject matter.  The material is difficult to grasp at times, especially for someone who has never taken a philosophy course before, but she really delves into each concept and is extremely articulate with her English so that if you listen and ask questions, you will gain a comprehensive understanding of the concepts.  She is usually available after class for office hours and is very casual and non-rushed about them.  She also earned brownie points in my mind for making a solid effort to learn everyone's name (there were over 30 people in the class) and to address everyone by his or her name when calling on/responding to students who had questions.  \nOverall, she is very sweet and knows the material extremely well, the reading and assignments are reasonable, and the exams are based on points from the readings stressed in the lectures.  Do take this class either to fulfill a requirement, out of personal interest, or (and especially, I think) if you are considering majoring/minoring in Philosophy.  Professor Beardman not only touches upon a wide range of topics in philosophy, but she also teaches and reinforces the key concepts and methods of thinking in philosophy through the different topics studied.\n\nWorkload:\navg. 10 page readings per lecture, one 1-page paper, one 5-page paper, a midterm and a final.\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "December 26, 2010",
            "review_content": "\nOkay so I am a big science and math geek.  I took this class to fulfill a requirement and I'm actually SO happy I did.  To be honest, at first, I hated the class.  I thought the professor didn't want to answer our questions and I thought that she thought we were too dumb.  She would respond in ways that would make me assume that she didn't think we were capable of higher thinking about philosophy.  However, as the course progressed, I realized that she didn't answer those questions directly because she wanted us to start thinking philosophically.  Also, she wanted to make sure that the class focused on specific arguments, not our own tangents of discussion.  Once I realized this, I appreciated the class a lot more.  She is very good at making sense of the dense readings that are assigned.  She outlines some of the arguments beautifully on the board and she always encourages discussion or comments.  However, she makes sure that we don't get too off topic [although sometimes it will digress].  She's also a very nice person in general and she has a very relaxed way of teaching.  It doesn't feel like work to go to class because she is so friendly and loves to teach what she is teaching.  However, if you don't do the reading due for the day, you will definitely be lost.  She doesn't review much of the reading.  Instead, she will delve into the details and outline the argument.  So, you better do the reading before you go to class or else you'll be pretty lost.  Her exams are very straightforward.  That is, if you do the reading fully and you understand it all.  If you use her notes and her comments, memorize them, and use them in your exam, you'll do perfectly fine.  However, YOU CANNOT GET BY WITHOUT DOING THE READING. DO IT!  And go to her office hours, she's very helpful.\nWorkload:\nWeekly, dense readings ; 3 courseworks posts per month ; 1 short paper and 1 long paper ; 1 midterm and 1 final [in-class]\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "December 13, 2010",
            "review_content": "\nProfessor Beardman is a nice person. She is clearly very, very smart. She is enthusiastic about her subject matter. At times her explanations of difficult concepts aren't terribly helpful, but of course that is because the concepts are difficult. I thought at times she could be a little short with people, but overall she tried to encourage participation and really wanted people to understand what was being taught.\nThe problem with this course was not Professor Beardman. The problem was the other students. If you're a philosophy major, this is not going to be a big deal for you. If you're not, it will be. Having to listen to students recount every detail of their infallible argument against Cartesian Skepticism that they just thought up while sitting in class in the last five minutes is unbearable. No one has any humility these days. Everyone thinks that their idea is the best idea in the history of the world, and even if they themselves did not spend any time working on it, we should all drop whatever we are doing to listen to them explain it in excruciating, class time-consuming detail. \nBeardman tried to cut these interruptions short, but too many of the students apparently didn't respect her or their classmates (or, probably, anyone but themselves) enough to shut up, despite repeated hints (and by hints I mean the professor said, \"Okay, well I don't want us to spend too much time on that, let's move on...\"). The class was an hour and fifteen minutes long. Probably 35-40 minutes of each class was spent by students trying to explain how they had upended hundreds of years of philosophical thought on their way into class that morning. \nI feel bad giving a negative review to a class that could have been a good experience if it weren't for the other students in the class, but overall I really feel like I learned a lot less than I might have, and the course was overall a negative experience for me. My attitude here is a bit cynical, I guess. Most of the Columbia and Barnard students I know from other classes and other semesters would not act like this. So maybe I just got into a bad group. It may also be that for philosophy majors, these types of \"interruptions\" as I call them would be useful, if only to demonstrate the sort of tired counter-arguments that are easily dismissed in philosophy. \nIn any case, if you're not a philosophy major, it's not worth the risk, in my view. There are other ways to fulfill a humanities credit.\nWorkload:\nOne short paper (300 words), graded very harshly\nOne long paper (1500 words), graded much more generously\nOne midterm\nOne final\nMandatory postings on courseworks that count for some portion of the 10% of the grade that is allotted to \"informed participation.\" \n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "October 29, 2010",
            "review_content": "\nProfessor Beardman is a really nice person, however there's something very timid about her teaching style that made this class difficult to sit through. When I took it, it was capped at less than 20 students and it was heavily discussion-based. The readings are interesting, but kind of all over the place. It was hard to understand what she wanted from the papers. She's helpful and easy to contact, however I would say this class was a negative experience for the most part. Took it as a requirement for the philosophy major.\nWorkload:\n2 papers (5-7 pages). Midterm. Final.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "January 21, 2010",
            "review_content": "\nI'll give Professor Beardman this, she was certainly quirky.  What she wasn't was articulate.  She tended to get so wrapped up in just how much she knew about philosophy that she went on extreme tangents mid-sentence that would proceed to preoccupy the next 15 minutes of class.  It also made her assume that as wee little intro course takers we must be idiots incapable of expressing coherent thoughts.  Yeah, sure, we were the confusing ones.  She often contradicted herself and made no sense whatsoever.  None of the material was as complex as she made it sound.  For example, she once said, \"If determinism true, and every event has a cause, and every action has a cause going back to before born, from beginning of everything, the conditions of universe, and laws of nature, if a being knew the state of the universe at any time, and knew all of the laws of nature, and the universe is purely deterministic, you could predict any event in the future,\" except keep in mind that in real life, she would stop mid-sentence to plop in a random phrase without explaining what it had to do with the rest of everything, or randomly repeat a phrase she had already said.  In other words, she rarely used full sentences and pretty much spoke in stream-of-consciousness.  It was also hard to know what to write on the papers with someone so vague and with so few other assignments.\nWorkload:\nShe assigns a hefty amount of readings, but there's no assessment to see you did them and, if you can follow her, she will go over them in class.  10% of your grade is participation (which includes 3 postings on courseworks per month), 15% was a short paper which everyone does terribly on (the highest grade in our class was an 89%), 25% was a long paper, 50% were midterm and final.\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "January 27, 2008",
            "review_content": "\nStephanie Beardman really means well. But, frankly, when it comes to sitting through a professor's lectures for a semester, intention  easily falls to the wayside. I felt that most of the time, the class was confused as to what this woman was even saying about the material. It seemed that she often contradicted herself. She was not clear about topics, concepts, etc. The only saving grace of this class was that it was small, and that she did (thankfully) allow for discussion and debate.  \nWorkload:\nPretty light. 1 short paper, 1 longer paper. 2 quizzes and a final. ALSO, MANDATORY COURSEWORKS POSTING. \n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "July 08, 2005",
            "review_content": "\nFirst, a disclaimer: This course ruined my solid 4.0 at Columbia. But, in Beardman's defense, I've never taken a philosophy course which was a prerequisite and didn't exactly study for the final.  Having said that, I don't think I would have liked the course even if I had done well because I came out not knowing how to write a philosophy paper (although I asked her how to improved during office hours). Also, the texts were really dry and uninspiring. While Beardman is obviously excited about what she teaches, I felt like her lectures didn't elucidate much of the reading but simply summarized a key point here and there before handing over the discussion to the class (which was rather boring). While Beardman is a very nice lady and probably an expert philosopher, it was rather awkward during office hours because she can be really condescending (probably unintentional). I know a lot of people really enjoyed the course although most found it rather challenging but I felt sick of it by the end and unmotivated to study for the exam let alone ever sign up for another philosophy course. If you really enjoy philosophy, perhaps you would do well and appreciate Beardman's penchance for rambling students. There's a lot of great courses at Columbia/Barnard; I suggest trying a different one with a different professor. If you are into self learning, very interested in philosophy and have an uncanny ability to write excellent papers as well as regurgitate minutia on exams, you will probably enjoy this course. \nWorkload:\nVery short, very convoluted readings every week. Two papers and two exams (or one \"quiz\" and one exam) as well as Courseworks postings.\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "January 28, 2005",
            "review_content": "\nThe last three reviews I just read on Beardman sounded to me like sour grapes.  Just because a class seems easy and involves fewer and shorter assignments on average doesn't mean that everyone is going to get a good grade.  I certainly did not make off as easy as I thought I was going to. And I liked the text alot, even though it was like pulling teeth trying to get my hands on a copy.  You'd think Beardman could have been more proactive on this front. Oh well. \n Yes, the discussions were, at times, tiresome.  I think it would have been nice to have a separate and possibly optional discussion section.  Yet, the time spent wasn't just all about students trying to make their 10 percent. I experienced the dronings of a large majority of student speakers but  also enjoyed hearing the minority of well-read and interested speakers. It was better  than sitting through some overdrawn rehasing of the readings.  And, at times, Beardman's lectures were merely drawn out rehashings. \nBut seven times out of ten, her lectures were enjoyable and thought provoking. \n   Overall, I looked forward to class. She clearly loves to teach, and while her one-on-one style sometimes gives the impression of an upscale shopper talking to a salesgirl at Bloomingdales, those who approach her candidly will be rewarded. \n  Most of all, my writing improved.  The way she structures assignments forces her students to ACTUALLY SPEND TIME constructing, preparing, and refining an argument. \n  I'm sorry that so many students felt they were cheated out of what they felt should be an easy grade in some lady's class. \n  I look forward to another class with Beardman. She has at least as much to teach me as I have to teach her.  That's pretty important. \n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "January 02, 2005",
            "review_content": "\nI tend to agree with previous comments, and I am perplexed as to why she is considered a \"nugget\" quality professor.  Granted, Prof. Beardman does have a few positive qualites such as her enthusiasm and seemingly deep knowledge of the subject matter.  However, Moral Philosophy was disorganized and unfulfilling on the whole.  I took her class with the hope to getting something more out of it than I would have from Sidorsky's--who is notoriously boring and unenlightening.  I will admit that I completed the class knowing much more about moral philosophy, but not to the credit of her teaching.  I was generally so dissatisfied by our class discussion (as well as many of the poorly written articles) that I forced myself to learn everything on my own, which was painful and time consuming.  Generally there are two problems with her format of the class:  (1)  She puts too great an emphasis on class participation, making about 10 or 15% of your grade based on this.  As a result,  class is a smattering of irrelevant comments, tangents, and inanities on behalf of the many students who, perhaps meaning well, did not read the material thoroughly.  Students are so concerned with interjecting their thought for the day to keep the 'ole grade up that there is no coherence to the class.  (2)  All of this could be remedied if Prof. Beardman was able to lead cogent class discussion and realize when her attempts to help students become as enthusiastic about the subject matter as she is, are more distructive to the class than productive.  I don't want to be overly critical over her aims, because they are well intended.  However, that does not change the fact that the class is a failure.  Most people leave knowing little more than they began with and many people become disillusioned by class discussion rather  than animated by it.\nWorkload:\nNot too difficult.  A lot of disconnected readings.  Two quizes: multiple choice, short answer, essay.  Two papers:  one page, and five page.  Final exam:  short answer, short essay, longer essay.  In general, her directions for papers are not very thorough and her paper topics are sophmoric.  She expects high quality work, but often gives you no idea of what she is really expecting you to do in the paper--i.e., summarize, restate, describe, or interpret the arguments.  In any case, the assignments are really an academic exercise for which you will not be simply handed an A.  If you want an easy A in Moral Philosophy, take Sidorsky.  If you want a good Moral Philosophy class, transfer to another school.\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "November 07, 2004",
            "review_content": "\nI came to college convinced that I would be a philosophy major. After taking Prof. Beardman's class, I changed my mind. In fact, I plan to stay away from philosophy for quite some time.\nProf. Beardman is a really sweet, intelligent, dynamic woman who clearly enjoys what she does. At the beginning of the course, her enthusiasm was contagious. \nBy the end, it just got annoying. I can't speak for everyone because I know a bunch of people who really enjoyed the class, but I for one, did not. Most of her class is dedicated to discussion, which gets even more frustrating if you have to listen to endless amateur theories given by pretentious students. It's even more frustrating if you are not big on the class participation. As a result of the large amount of discussion that takes place, I found that we didn't actually get to go over the material as much as I would have liked. Granted, Prof. Beardman will make time for you during her office hours if you want to go over certain ideas. \nNevertheless, I think she is so intelligent and involved in her microcosm of philosophy that she is never quite \"there.\" I would have prefered more of a lecture-based class with a clearer sense of structure. \nI definietly feel ambivalent about this class. Prof. Beardman herself is a great woman who is extremely smart and always in a good mood. But I find her teaching style better suited for graduate level courses. Take her class if you like talking. Just remember that you will ultimately be competing with the other big talkers in the class--not just about who makes the more brilliant comment, but about how brilliantly it is delivered as well. \nWorkload:\nNot too bad, although I found that we rushed through too many philosophers in too short of a time. She's not the easiest grader either, but you will find her extremely fair. Her two papers don't allow much room for creativity (so if you think your the next Aristotle and want to simply talk about those brilliant theories of yours, stick to the discussions in class and keep the papers nice and dry).\n"
        },
        {
            "course_name": "FYS: Immortality, Death and the Meaning of Life",
            "review_date": "May 30, 2004",
            "review_content": "\nProfessor Beardman is a very knowledgable woman who is excited about philosophy and the students she teaches.  I have never met a professor that takes so much time reading each student's paper.  She is very atuned to details and is by no means an easy grader, but she is very fair.  Beardman loves class discussion and made the atmosphere of the class really intellectually stimulating.  Beardman is sometimes on the nervous end but she is the most caring and involved of professors.  Meet with her on her office hours and you will be astounded at the amount of time she gives each student!\nWorkload:\nNot too much reading.  At least 5 papers (about 3 pages in length) and some rewrites.  In addition, each student is expected to lead class discussion at least 2 times.\n"
        },
        {
            "course_name": "Mind and Morals",
            "review_date": "December 23, 2003",
            "review_content": "\nARGH. I was looking forward to this class, but it turned out to be the biggest pain I had all semester. Prof. Beardman was nice in class, and she incorporated a lot of discussion (prob. because our \"lecture\" had only 15 students in it), but between the overly-broad scope of the class and the madness of having to write 400 word papers (that were graded very harshly) I hated going to class by October. I agree with the previous reviewer who said that the class should be less broad - I felt like I didn't really gain a deep enough understanding of anything we discussed. Writing 400 word papers may have sounded good in theory, but again, I didn't get to develop any sort of detailed argument. If you're a major, find another way to get rid of the ethic requirement, and if you're not, P/F this class if you're going to take it at all.\nWorkload:\nTwo papers or so to read for each class, maybe about 20 pages on average. Five 400 word papers (one of which was a rewrite), which are graded very difficultly. A final which made me memorize a lot of terms that I don't really remember now. Not too much work, but you'll never want to do it.\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "December 19, 2003",
            "review_content": "\n    In all honesty, my incredible experience with Professor Beardman likely has as much to do with my approach to philosophy at the time as her teaching style. I went into that class a fresh, engaged, newly declared phlosophy major - eager to learn and willing to work, and she met me at every step. She assigned readings for every class, I did them; she assigned papers, I wrote them, she asked for web-postings, I posted them. And, ya know what? It was phenomenal.\n     If you don't like doing work, are looking for an easy A, or want professors to spoonfeed and pamper you, then Professor Beardman may not be the right professor for you. However, if you are truly interested in a given domain of knowledge, taking a class with Professor Beardman will be absolutely amazing.\nWorkload:\none short paper, one longer paper; midterm and final.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "December 16, 2003",
            "review_content": "\ntake this class if you are interested in philosophy and KNOW that you are a philosophy minded person. i thought i was such a person and then spent the entire semester sitting silently in the back of the class, participating only in the mandatory online chat. but prof beardman was an amazing lecturer and tries very hard to engage her students in discussion, which can be great, again, if you are one of those people who want to discuss very trivial philosophical concepts. i definately recommend prof beardman, id take a class with her in the future. as for the class, the readings are really interesting and the concepts can also be interesting if, again, you are interested in the subject.\nWorkload:\neasy conceptual midterm and cummulative final (study and get an A), medium reading (20 pages/week)\n"
        },
        {
            "course_name": "Mind and Morals",
            "review_date": "December 08, 2003",
            "review_content": "\nIÂ’m sure this would have been a good course if 1) I were interested in Ethics or Psychology, or 2) I were just starting out in philosophy. As it was, I found the course to be broad not deep. I was vaguely hoping that it wouldnÂ’t be a survey course (since Moral Philosophy is already one), but it was, with all the Kantian and Utilitarian and Virtue Ethical baggage that comes with such a course. Professor Beardman provided lovely little summaries of the readings but little else.  Her obsession with short papers also hindered real thought development (though IÂ’m sure it prevented many a mental train-wreck as well). Really, if this course proves anything, itÂ’s that the philosophy department should ditch its systemic ethics requirement. I mean, we all have to take CC anyway, so why put us through another semester of hopeless and boring ethical theory (honestly, symbolic logic was more interesting).\nWorkload:\n5 1.5pg papers (what an annoying lenght) and a final. Readings are easy.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "November 11, 2003",
            "review_content": "\nProf. Beardman is an amazing woman.  I came to Barnard without any idea what I wanted to major in, and I took her class the first semester I was here, and now I'm planning to major in Philosophy.  She makes the subject matter so interesting and is so enthusiastic about what she does.  She understands that we're college students and doesn't torture us with endless readings and massive papers.  I would highly recommend taking any and all classes that she offers.  Honestly, she is my favorite professor that I've ever had.\nWorkload:\nNot bad at all: the reading (short pieces most nights) are interesting, and she only makes you do one 300 word paper and one 1500 word.  There's also a midterm and a final, on which, if you pay attention at all, you'll get an A.\n"
        },
        {
            "course_name": "Mind and Morals",
            "review_date": "May 15, 2003",
            "review_content": "\nReally good professor. Enthusiastic, Organized, Unpretentious, Very Intelligent. The class was fun, too. She really encourages discussion (which in some courses may mean that you don't get through much material, but it worked really well in this one). And she chooses really fascinating readings (not too much reading at all, either).\nYou can tell that she wants to make us better thinkers. That seems even more important to her than the content of the course. Instead of asking for a couple long papers, she asked us to write five 1 1/2 page concise essays that tackled a specific question. It's harder than it sounds to do a good job, but it really forces a person to focus his argument / learn to write better overall.\nShe's good. (and for whatever it's worth, I got the feeling that everybody in the class really liked her and her teaching)\nWorkload:\n5 1 1/2 page papers, Final.\nVery little reading: ~ 10 pages per class. And the reading is really interesting.\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "August 29, 2002",
            "review_content": "\nProf. Beardman is so enthusiastic about the material. You can tell she really emjoys her job. She's always willing to discuss during office hours and every class includes an engaging discussion as well. It's one of the best classes I've taken. Even if you're not a philosophy major, you'll probably like taking this class with her. \nWorkload:\nOne short paper, one long paper, a midterm and final. Reading every week. You'll be fine as long as you keep up. It's so interesting that you'll want to anyway. \n"
        }
    ]
}