{
    "prof_info": [
        {
            "prof_name": "Robert Castellano",
            "prof_id": 12951,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "May 12, 2015",
            "review_content": "\nRob is a darling. He teaches calc in a very straight forward way. The main benefit of going to the class is seeing all the examples worked out until it gets arithmetic-y and he just circles the \"good enough for him\" answer. Thank god, because I hate arithmetic. He's definitely a math nerd, and I mean that in the most endearing way possible. That being said, he doesn't like or allow calculators and thinks they are crutches. And, considering that I remember nothing from my calculus that I took years ago WITH a calculator - he may be right. I was a previous Cog Sci and History major at my past schools so I spent a lot of time memorizing cool stories and fun brain stuffs. I did not do math for forever and used a calculator to add single digits to check myself. \nHe also doesn't allow cheat sheets. It's really tough to remember all the formulas correctly, and I prayed for the final that he'd allow just a teeny post-it, but alas...no cheat sheet (post it, etc.) allowed. I missed signs on the final but really started to think about the concept behind it to see if I could infer the forgotten signs (some SERIOUS math was going on in my head) but my feeble mind kept getting distracted by how cold it was in the room.\nHe's really super available and open during office hours - but (as I'm sure you know from all your other classes' office hours) you'll get the most if you come loaded with questions. I know some people came for recapitulations on the last week's lectures that they missed - but he will tell you to go read the book if you come for that. He doesn't help you get exact answers on homework. He'll help you figure out your next steps or see where you went wrong if you show him your work. He is a high-level explainer -but if you ask him to break it down in baby steps, he'll do that for you. But I actually have heard mixed opinions about that from other students. For me personally, he really spent a lot of time with me patiently explaining everything I didn't understand, but I am not one to pretend I understand something when I don't. I probably was the worst/slowest learner in the class. I think he knew this and took pity on me :\\.\nHe's surprisingly social for a math guy, has a really bright smile on all the time, and can take a piss on himself (I dunno if that translates correctly in English - I mean he can joke at his own expense). This is sooooo helpful in making the class time and subject easier to swallow.\nThe workload is a little painful if you need a week to catch up because you fell ill or got caught up in something. You have to stay on it. When I was in the hospital for a week, I had to keep reviewing while going through treatment, or else I knew I'd be far behind. To drive that point home, I know several people in the class who sat through a columbia calc class last semester or took it at a CUNY the summer before before they took it for a letter grade here, and they said it's definitely easy to fall behind especially the weeks the written homeworks are assigned.\nWritten homeworks are sick and twisted. Sorry, you will spend an ungodly amount of hours staring through the paper. But luckily there are only 5 or so of them and they're spread out reallllly well. Go to office hours those weeks. And not just the class before they're due. Go as soon as they're assigned. Or hit Math help room at milbank. But don't let them do it for you. Those homeworks will make you want to puke but it's sorta cool to get an 80% on them knowing you actually got through them yourself (with a little bit of guidance.) \nWebassign is weekly and annoying. But that is the nature of webassign. PS, if you suck at trig stuff, doing the webassign only won't prepare you for the quizzes and especially the tests. You have to knock out problems in the book to get used to the types of questions asked on the tests. I thought in the beginning that webassign would be enough - my understanding improved significantly after I opened the book.\nAs far as test grading and curve... it's a Columbia Calc course. I think they're all the same so I've been told by numerous students and advisors. Don't beat yourself up after you've failed - everyone fails a little. The tests though, I wasn't afraid to speak up and say that the prep-midterms were different than the midterm we had to take. I think he takes our comments to heart. For example, the practice midterm had a whole bunch of polynomials and easier functions to manipulate, but ours was full of exponential variables to the exponential variables to the e to the ln of the absolute value of whatever.One thing a classmate mentioned to Rob that would be helpful is to focus his examples on solving more difficult sorts of these problems - lo and behold his examples were like 75% e/ln/multiple levels of exponential variables and things.\nIn summary, Rob is good at what he does. He's very sweet and helpful, but I get the feeling that you have to be proactive about asking for help. He's super young (looking, at least, I dunno how old he is) so he has a lot of energy and passion for math. I think he knows that it is unlikely that anyone in the class was a real math major and rather just needed the course for a pre-req to something else, but he still wants to give you the solid foundation you'll need when you go on to calc 2 or 3, etc. He can come off aloof so I've heard from others, but I've not experienced that at all. I think he's very warm, welcoming, and happy if you treat him like a human and not just someone who is there at your mercy. Buuut, my dad is a math PhD and my ex-boyfriend is en route toward one, so perhaps i'm just used to it.\nSorry for the dissertation length review.\nPS memorize that unit circle and trig identities!\n\nWorkload:\nweekly quizzes, weekly webassign that is round 20 problems. occasional deadly written hw that requires external help. 2 midterms 1 final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "June 19, 2014",
            "review_content": "\nDisclaimer: I am not a natural by any stretch at mathematics, and was taking Calculus I after many years hiatus from college.\nAvoid taking a course from Robert Castellano at all costs, which are extensive at Columbia. Rob is a grad student in the Math department (yes--you will pay Columbia top dollar to be taught by a grad student). Lectures were not lectures, they were Robert repeating what was in the book verbatim as he drew examples on the board, again, directly from the book. There is no point in going to class when the most instruction you're going to get is a smug automaton of a teacher (if I can call him a teacher). When seeking help during office hours (and there were frequently several people regularly looking to him for help during office hours), he would get this wry grin on his face when we were all stumped as to how to get from A to B on a problem, at which point he would just say \"come on, you know this\", which of course, none of us did. He wouldn't offer help, he would simply smile at our bewilderment, as if it were amusing to him that we were encountering difficulty with the material.\nWhen it came to exam time, the contorted expressions he put in front of us required expert skill at unlocking in order to even begin to show that you can do the Calculus. I have never worked so hard just to turn out completed homework assignments, and then have the exam put in front of me and have it resemble nothing like the species of problems we'd been doing from the book. His exams were written to punish, and I failed every one. If the rest of the class had done much better than me, I wouldn't have passed the class. I received a C-. I've never been so proud of a crappier grade. \nWorkload:\nWorkload was very heavy, 30 - 45 HW questions per assignment, one assignment per one or two sections of the chapter, submitted online through WebAssign. On top of that, you will have written assignments, issued at whim and meant to challenge your conceptual knowledge and your level of expertise. Mind you, you will get no help from Mr. Castellano in developing that level of excellence--you will have only the book (which I thought was awful as well), and your poor, addled brain.\n"
        }
    ]
}