{
    "prof_info": [
        {
            "prof_name": "Elisa Bone",
            "prof_id": 11190,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Biology 1",
            "review_date": "January 18, 2012",
            "review_content": "\nProfessor Bone taught the first half of Environmental Biology I. She was a friendly person, but not a very good teacher. She is Australian so she has an accent, but that's not a problem. She does talk softly though so sometimes it was difficult to hear over the sound of the fan. \nDon't bother asking her questions. Like the previous reviewer said, her specialty barely plays a role in this class. Therefore, she is not very knowledgeable about the subjects she teaches and is likely not to know the answer. \nThe lectures were not very useful, though going over the slides later does help a lot. Reading the textbook is a must because the quizzes are not easy and you need the textbook material to fully understand the slides. Going to the recitations, especially before the quizzes, helped a lot since the TA's re-explained the important concepts. I often didn't fully understand the material until right before the exam and had to read through whatever I haven't read yet (the textbook chapters are pretty long and we go through quite a few chapters per quiz), go through the review sheet, and read the lecture slides. The class just goes way too fast and covers too much for the lectures to be enough. In fact, the lectures seemed to be very simple and made the class seem easy until you read the book and find out how much more complicated the material is. \nWorkload:\nA lot of reading since the textbook is long and a lot of material is covered. 4 quizzes, non-cumulative. No mid-term or final. \n"
        },
        {
            "course_name": "Environmental Biology 1",
            "review_date": "October 20, 2011",
            "review_content": "\nThe way the course is set up is that Professor Bone teaches the first half of the semester, and Dustin Rubenstein teaches the second half of the semester.\nProfessor Bone introduced herself as an invertebrate biologist at the beginning of the semester, and proved that she is not familiar with much more than that. It was common during lectures for students to correct her, or for her to ask students what the answer to a question was because \"they've probably read the textbook more recently than me.\" The lectures, rather than enhancing the textbook through additional material, or focusing the material in the textbook to look at the main points of the text, seemed instead to gloss over all of the topics (regardless of importance) with the addition of more confusing or incorrect analysis. \nThe two quizzes that we had were poorly written, unclear, and the distribution of points was not indicative of the material from the lectures, textbook, or review materials provided by the professor and TAs. Generally speaking, one measure of a well-written test is that students do not need to ask many (if any) questions during the test, but both of the quizzes were filled with ambiguous or unclear questions that forced students to ask the professor for further clarification.\nThis course has taken a fall from glory now that Shahid Naeem no longer teaches it, and all students should carefully consider whether or not they need the course before registering.\nWorkload:\nAbout 3-4 chapters of reading per week.\n4 quizzes over the course of the semester, each counts for 25% of the final grade. No final.\n"
        }
    ]
}