{
    "prof_info": [
        {
            "prof_name": "Kevin Lamb",
            "prof_id": 3420,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 22, 2008",
            "review_content": "\nTo be honest, in the beginning, I didn't like Kevin all that much. But by the end, I had realized that he was not only a good teacher but also an amazing and incredibly intelligent scholar. It also helps that he's a pretty nice guy once you get to know him. He can be tough because he knows SO much about the material that we cover in CC (unlike some other instructors) but that made the class challenging and worthwhile. He was able to answer pretty much any question you threw at him and he was so familiar with the material that I felt like I had learned a lot after each class. I won't sugarcoat things too much though - he does expect you to do the reading and participate in class. He also expects you to spend A LOT of time on the material. He also requires that you post before each class (but by second semester, he was a lot more lax on this issue.) For those who love animated and passionate debate - stay away. Maybe it was the students' fault but we rarely had interesting conversation in the class. Kevin has both advantages and disadvantages but by the end, I felt like I learned a lot from him.\nAlso - if you want to improve your writing, Kevin is definitely good for that. He's a harsh grader for papers but my writing definitely improved!\nWorkload:\nPosts before each class (not a huge deal, we got 5 freebies.) 3 papers (like I said, Kevin's a hard grader for papers.) 1 midterm, 1 final - both very VERY fair. Passage IDs and short answers - as long as you know the basic idea of each philosopher, you'll be fine.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 04, 2008",
            "review_content": "\nI haven't finished my semester with Kevin yet but I feel like I should write a review for people who may be considering his English electives offered next year.  Kevin is a really nice guy who is very approachable.  This is his first (and probably will be his only) time teaching CC and I think he is doing a pretty darn good job.  He really knows his stuff and is very helpful in office hours if you need some clarification on any of the texts.  I didn't have him for both semesters but I hear that he really chilled out a lot from first semester.  I enjoy going to class.  He maintains a low stress environment that is good for discussion.  I'm not an English major, but I would recommend him if you want a class that will thoroughly examine texts and all of their intricacies.  \nWorkload:\nnormal CC - standard reading - he is good about assigning lighter stuff for the short monday to wednesday gap.  2 papers which are of a different style than most CC classes but fairly graded and Kevin is there to help.  midterm and final. i haven't taken the final but the midterm was pretty straightforward and fairly graded\n"
        }
    ]
}