{
    "prof_info": [
        {
            "prof_name": "Brian Morton",
            "prof_id": 408,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Molecular and Mendelian Genetics",
            "review_date": "March 31, 2016",
            "review_content": "\nProfessor Morton is wonderful--you can tell that he really cares about his students and he makes himself very available for questions, both in his office hours and by email. This class is hard, but it's definitely doable, especially if you make use of the great app he makes for it. You should definitely go to lectures because he manages to cram an absurd amount of information into each one, and it will also help you know what you do and don't need to study within the app. The problem sets can take some time but they're great prep for the exams. Start going to office hours early in the semester if you are confused about anything because it can be a hard class to try to catch up in since it is so information-dense. \nWorkload:\nProblem sets, two midterms, one final.\n"
        },
        {
            "course_name": "Molecular and Mendelian Genetics",
            "review_date": "December 16, 2014",
            "review_content": "\nProfessor Morton is a great professor. Like others have said, his tests come entirely from lecture and he has made an app that is basically his lecture written down in an organized fashion. The class is definitely challenging - especially the second half where you memorize some 100 proteins. But you should 100% go to every lecture, because sometimes things written in his app are not covered in lecture, and therefore not necessary to learn. But again, reading the app is super helpful if you miss some things he says in lecture. \nAll-in-all Morton is a really sweet person and will help you as much as you need. He will gladly make time for you outside of office hours if you need the extra help. He learns everyone's names immediately which I thought was insanely nice. I would recommend taking this class with him!\nWorkload:\n2 midterms: first one deals with a lot of probability, second one deals with many processes so it's heavy on the memorization and a final cumulative of the whole course, but not that bad because you take the second midterm a few weeks before so the material is fresh. \n"
        },
        {
            "course_name": "Molecular and Mendelian Genetics",
            "review_date": "March 02, 2014",
            "review_content": "\nBrian Morton is one of the kindest, most caring, and willing to help people at all of Barnard and Columbia. He is always willing to help and immediately responds to all emails and questions. During his office hours he is extremely helpful and answers all of your questions thoroughly. There is no need to use the book, his lectures cover all material. PLUS, he made an app that offers practice questions, definitions, and outlines all processes you need to know. Basically, he just wants you to succeed and does everything in his power to make that happen.\nIn terms of grading, Professor Morton is GREAT about giving partial credit and returns problem sets and tests by the next class. He also manages to learn every single person's name and is eager to get to know his students. He cares about his students' lives outside of class and would be happy to sit down and just talk. \nAdvice: go to lecture!!!! Don't read the book, look at the app. Print out slides, especially during the second half of the semester.\nIn all, Professor Morton is just a genuinely wonderful human being and a great professor. \n\nWorkload:\nNot too bad. The problem sets can be hard and time consuming, but if you go to office hours, either Professor Morton or the TAs will give you any help you need. The tests take a good amount of memorization, but just look at the app. \n"
        },
        {
            "course_name": "Molecular and Mendelian Genetics",
            "review_date": "December 21, 2013",
            "review_content": "\nWhen I took this class I was worried because of previous reviews. I usually don't write reviews but I feel like this one is necessary because I don't agree with other reviews. I am just going to list good and bad things about the professor and this course and you can make the judgement in the end.\nGood\n1.  His lectures consists of power point slides which are mainly pictures from the book which he explains in great detail. Each powerpoint has enough slides for the next few lectures and Morton just goes along them at a pace where he can explain everything, meaning he does not rush through to squeeze a specific amount of information per lecture. This is organized because if you follow along you will know what is going on and what you should expect in the next few lectures.\n2. He is open to questions and tries to explain the best way he can, even if the explanation takes an extra 10 minutes of class time.\n3. Unlike the chem department (Magyar), Morton responds to emails fast, GRADES EXAMS AND HW REALLY FAST (next lecture you get it back), and is open to meeting with you any time. I did not go to much office hours during semester but made use of them towards the end for the final. He stood there for 2 hours explaining questions that me and other people had without any judgement or frustration. He really wants you to understand the material. A huge plus for me was that again, he grades everything before the next lecture. The final grade was posted 3 days after the final. Honestly, he is a great guy and is really approachable.\n4. He follows the book so if there is something you really do not get you can read the book.\n5. Exam comes from lecture material ONLY! For me personally though, I needed to read the book and take notes because I am someone who learns better by reading. I did not really understand all the information from lectures only. Other people did though. Depends on you. I do recommend reading the book though in addition to going to lecture.\n6. He does curve. People in that class really studied for the exam (look at #4 for bad comments)\nBad\n1. He is not the most dynamic professor; lectures can get a little boring sometimes. Not that bad though. \n2. The problem sets are pretty hard- I hated them with all my passion, maybe though because I am just not good with probability\n3. The second exam was much more difficult than the first one- you really need to study for at least 3 days. I studied my ass off for 4 days for the second test.\n4. Most people in the class really study for the exams also, so unless you out study everyone, the curve will not be in your favor. A week before the exam girls were coming in showing off how much flashcards they already made and sometimes complaining over who studied more. That was so annoying so be prepared to study a lot.\n5. Attending lecture is a must! If you don't go, you will not know what you have to know. The book is way more detailed than lectures so if you think you can follow powerpoint with book and not go to class, it is a really bad idea.\n6. Tests are very detailed, especially the second exam. You should know every detail. Final was pretty good though. There were many really easy questions, some intermediate, and a few hard ones. You had a lot of time. The final  does not have much new information on it because you take the second exam a few weeks before the final. Don't worry about the final much.\n7. The book has so many details that it can get really confusing. \n\nWorkload:\nI guess I just went on a rant and listed everything. Hope it still helps. I was really trying to be honest here so you can decide whether you want this class. Overall I liked my experience and learned A LOT! I love bio and I feel like I am so much better at it now. This class is not easy. You really have to put in effort. Some girls just relied on lecture material and did not do that well. I read the book, looked at lectures, went to every class, spent a lot of time on problem sets, and studied for exams, and did well (in the A range). This is the kind of class where the amount you study determines your grade.\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "December 23, 2008",
            "review_content": "\nAVOID at ALL costs! I have always loved biology, that is until I had Morton. Among all the biology teachers/professors I have had in high school and college, he is by far the worst! He is very disorganized, so it is extremely difficult to follow his lectures. Also, his lectures are incredibly boring, it's really hard not to space out at times. Morton pretends to be nice and helpful sometimes, but i don't think he cares a lot about his students at all. If you absolutely have to take this course, then take it with Mansfield! she teaches it in the Spring.\nWorkload:\nfairly heavy, 2 midterms, 1 final. all pretty hard.\n"
        },
        {
            "course_name": "Evolution",
            "review_date": "January 21, 2008",
            "review_content": "\nThis was one of my favorite classes!  The class material was really interesting and Professor Morton covered it with a good balance of lecture slides and spoken lecture.  He's funny, nice, and really knows his stuff.  It's easy to see him outside of class although I never left lecture confused.  I've taken all of the evolution classes at Barnard (Plant, Vertebrate, and this one) and this one covered the most interesting material.  It was also well organized and the book supplemented the material well.\nWorkload:\nTwo problem sets that took a couple of hours a piece, two midterms, and a final.  The test material comes from lecture rather than the reading, but the reading is interesting and not that hard.\n"
        },
        {
            "course_name": "Evolution",
            "review_date": "August 09, 2007",
            "review_content": "\nCan't imagine how the other \"evolution\" rater came up with her rating.  In my experience, this was a terrible class with an egomaniac for a professor. I thought Morton was condescending, mean, and a bit smarmy.  I learned, but only because I was motivated to learn the material on my own.  Lectures were not helpful, nor was Morton.  Why is he still teaching here?  Ugh.\nWorkload:\nstudents are all on their own, no help from Morton, so it is a difficult class.\n"
        },
        {
            "course_name": "Evolution",
            "review_date": "November 14, 2006",
            "review_content": "\nMorton's not so bad. He genuinely wants to help students (for example, he sent a few students sources for their research paper whenever he came across relevant material), and he can be very patient about explaining the concepts. \nI found his lectures difficult to follow, but generally the book helped fill in the blanks. His tests were very specific to his lectures. All in all, no regrets. \nWorkload:\n2 problem sets, 1 term paper, 2 midterms, final\n"
        },
        {
            "course_name": "Evolution",
            "review_date": "November 14, 2006",
            "review_content": "\nBrian Morton is the nicest man ever. He is very approachable and I am definetely taking his Genetics class in the Spring this year.  He is easy to get in contact with, very organized, sweet, and very smart. The workload is fine: moderate amounts of reading, a couple problem sets, and a paper, which you have the entire semester to do. He helps you with the problems sets in and out of class if you need it.  He is very receptive to questions in and out of class, and he is very open if you have questions regarding the midterm.  I love him! Also, he has spoken with me concerning med-schools and applications, etc. and given me great advice. He is funny and very knowledgable, I have yet to miss a class and never want to.  Take a class with Professor Morton! I probably have about a B+ plus right now, but I know he isn't against giving A's.\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "September 08, 2006",
            "review_content": "\nProfessor Morton is a really nice guy and is extremely willing to help in any way he can. Like most other upper level bio classes this class is definately not easy. The problem sets are difficult and the tests require a lot of memorization. Take advantage of Professor Morton's office hours.  He can be very patient and helpful.\nWorkload:\nproblem sets, midterm, final\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "June 01, 2005",
            "review_content": "\nI too took this course a while ago. It takes a week or two for it to come across, but in my opinion Bore-ton really is mean and nasty underneath his very thin fake-nice facade. True, he repeats everything 6 million times during class, but you won't hear it even the first time because you'll be sleeping or staring out the window or making a grocery list--anything to try to stay awake for even  a minute or two. I guess if you really need to catch up on your sleep, this would be a great class to take, but otherwise stay away. I hated this class more than just about any I've taken.Don't let it happen to you.\nWorkload:\nno comment\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "April 27, 2005",
            "review_content": "\ntook the course a while ago, but Professor Morton is definitely Professor Snore-ton.  Boring as all get out, doesn't care at all about the students, aways ready with a sneer or patronizing comment.  Stay away from this class if you have any choice!\nWorkload:\nthe book is your only hope\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "April 20, 2005",
            "review_content": "\nThis was the worst class I've taken at Barnard.  Morton is patronizing, mean, and talks down to the students more than any professor I've had.  Nice?  I don't think so.  Sometimes he was fakey nice, but it didn't fool most of the students in my class for very long.  I agree with the other reviews:  MIND-NUMBINGLY boring for sure, but I don't think the other reviews expressed that he really is not a nice guy.  His grading curve sucked and I hated the class, not because of the grade I got (an A-), but because this guy is really awful.  Avoid like the plague!\nWorkload:\nNot so hard, but count on doing all the work on your own, since Morton never explains anything well enough to make any sense.\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "January 19, 2004",
            "review_content": "\nGenerally agree with the other reviews... if you're the typical columbia pre-med you already know how to do well in this class if you've taken bio.  his pace is relatively repetitive - you'll find yourself taking the same notes over and over - but it doesn't make the class easy.  Book is pointless as far as I found, make sure you go to class and get all the notes - every last three-time-repeated detail of them - and if you can get previous tests to practice on - it's priceless.  Problem sets are tough, very tough, they take much longer than you'd expect.  Start the night before and you won't finish - not for a decent grade anyway.  \nWorkload:\nproblem sets every 2-3 weeks, tough though.  2 tests and a final, first test not too bad, second one covers 90% of the entire syllabus so it's much harder.  \n"
        },
        {
            "course_name": "Genetics",
            "review_date": "December 27, 2003",
            "review_content": "\nBreak News!!!!!\nGenetics is assassinated at Barnard College. WHO IS Responsible????\nProfessor Morton In my opinion, he is a boring professor. Lectures suck, and exams are tough. He is there to show students how much he knows, and how much he can trick students on exams. He even has an attitude that the author of the book does not know as much as he does. The way he speaks, the way he explains the stuff are confusing, and sometimes, it makes me wonder if he really knows what he's talking about.   I don't agree with other ppl saying he is a nice guy, a good looking and an intelligent guy. I think he is funny looking.  He is intelligent enough to be a professor, but no more than that. And he was not nice to me. \nWorkload:\nsleep with the textbook....going to class is a must, not to take notes but to get topics, and discussion. \n"
        },
        {
            "course_name": "Genetics",
            "review_date": "May 03, 2003",
            "review_content": "\nMind-numbingly dull. He should be called Professor Bore-ton. Yes, he's a nice guy, but his lectures are some of the most miserably soporific experiences I have ever had. Despite the fact that much of the material covered in Genetics is fascinating, his monotonous drone makes it very difficult to remain interested or excited during class. He is often irritatingly repetitive, and even worse, sometimes muddles up his explanation of important concepts, so that you have to turn to the text in order to make sense of them. His tests are difficult, and you need to know every last detail of every topic covered - right down to specific subunits of ribosomes and every single protein associated with every kind of replication, transcription, etc. Put in the necessary effort and you'll learn a lot, but trust me, it won't  be much fun. My recommendation?  Drink a lot of coffee before class - not only will it wake you up, it will also make you have to pee about halfway through class, thus providing an excuse to take a much needed break from Morton's monotonous misery.\nWorkload:\n4 problem sets, 2 midterms, 1 final. You will need to be extensively and intimately familiar with ALL material covered if you want to do well on the exams. Study, study, study!!!\n"
        },
        {
            "course_name": "Evolution",
            "review_date": "December 12, 2002",
            "review_content": "\nI used to genuinly like Prof. Morton. He's cute, nice, and seemed like he'd be a very helpful and intelligent teacher who takes a personal interest in his students (he does). And then I took Evolution with him. Suffice it to say that he's got the most awful, droning, sleep inducing monotone that I've ever heard or imagined possible. His damn voice put me to sleep every time, even if he was talking directly to me, even not during lectures. Aside from his voice problem, he was one of those obnoxios teachers who make you buy a textbook, and then completely ignore everything the book says and teach from their notes. And since it was impossible to pay attention in class becasue of his ridiculous voice, and since he didn't teach from the book...you get the picture. An awful experience. He also has this problem where he says completely irrelevant things (sometimes addressed to only one person), and mixes them up with very important, relevant things, frequently in the same sentence. He is capable of talking for half and hour and not say a damn thing, and then test you on that. The only redeeming quality is that he's genuinly nice and always has time to take a personal interest in every student in the class. Other people in the class seemed to like him and had a good experience (the TA seemd to genuinly think that he was a good teacher), though I cannot fathom how the heck they could have learned anything.\nWorkload:\ntwo problem sets, two in-class tests, one final\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "April 22, 2002",
            "review_content": "\nBrian Morton, the good-looking, nice-guy professor with the strong Canadian accent, has a very strong command of the subject. first half of the semster is hard core probability and very math-based. the second half is molecular genetics, more bio based. his class is filled with bio majors, i found the material to be difficult to master, his tests very challenging, and his curve not so accomodating. i guess if youre a natural science and math person, go for it. if youre looking for a cool elective, find something else more worth your time.\nWorkload:\nproblem sets, midterm and final.\n"
        },
        {
            "course_name": "Laboratory in Genetics",
            "review_date": "January 28, 2002",
            "review_content": "\nBrian Morton is an amazing intelligent professor. He challenges you and makes you think. I heard a lot of students found him too hard, but I think his class is one where you get the grade you deserve. You work hard? You get the A. You don't understand the work? You get the D.\nWorkload:\nFour labs\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "December 31, 1999",
            "review_content": "\nA very boring lecturer, with long and difficult tests. I feel bad saying this - he is obviously a very nice guy. Still, he spends the first half of the semester beating mendellian genetics to death and then suddenly shifts gear into an incredibly detailed section on molecular genetics. His exams cover every detail as well, requiring that you know every enzyme and every base pair sequence (\"a 13 b.p. A-T rich sequence repeated three times followed by...\") mentioned in either class or the book.\nWorkload:\nTwo midterms, final; six problem sets\n"
        }
    ]
}