{
    "prof_info": [
        {
            "prof_name": "Paisley Currah",
            "prof_id": 6723,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Sex, Gender, Transgender Queries",
            "review_date": "May 25, 2014",
            "review_content": "\nI took Professor Currah's seminar this semester and had a great experience. This is the only course in the Women's and Gender Studies department that focuses entirely on trans people, and Professor Currah is a visiting professor from CUNY who also does a lot of trans scholarship and activism. He is extremely knowledgable about the topic but from the first day of class made sure that we knew this course was about us. He had a draft of a syllabus for us but asked us to jot down a few particular areas of interest and amended the syllabus towards our interests. Further, he collected two questions from each of us via courseworks or email prior to each class so he could tailor the discussion that day towards the topics from the readings that interested us most or were most controversial in the readings. For the first half of class, a student would give a presentation on a topic from the reading that week and facilitate discussion, and then Professor Currah would lecture for a while about the major points from the readings and lead a broader discussion (while addressing our questions from the courseworks discussion board). It was a pretty effective way of teaching I thought. He also brought in guest speakers for us twice - Justus Eisfeld, Co-director of GATE - Global Action for Trans* Equality, and Dean Spade, trans activist and critical theorist, author of Normal Life (and someone who I look up to a lot) - which was really cool and a great opportunity that I think everyone in the classroom was really grateful for. I think Professor Currah did a good job of balancing trans history with trans 101 type stuff with some more complex theoretical pieces with work on trans advocacy/activism, which was especially great because there were people of a lot of different levels of knowledge on the topic in the classroom. I would definitely recommend this class to anyone interested in the topic.\nWorkload:\nNot bad, especially for a seminar. Maybe 100 pages of reading per session. Attendance and participation (15%). Leading a short presentation on a topic from the readings in class (20%). Reading questions posted to courseworks before class each session (15%). Two 4-5 page response papers (20% - 10% each). One final paper on a topic covered briefly in class reading additional texts that he provides (30%).\n"
        },
        {
            "course_name": "Sex, Gender, Transgender Queries",
            "review_date": "May 06, 2011",
            "review_content": "\nI'm writing to recommend Professor Currah's Sex, Gender, and Transgender Queries class. This professor is very good - he definitely knows the material well, is enthusiastic about it, has a sense of humor and doesn't take himself too seriously, and provides challenging reading assignments. There is a decent amount of reading and some of it is difficult to grasp at first (very theoretical) but it is all extremely interesting and most of it is very recent, cutting-edge scholarship since the field of Transgender Studies has grown significantly in the past decade and is still actively being developed. The class will definitely benefit anyone interested in going into public interest or human rights advocacy/policy work as well as those interested in pursuing gender & sexuality studies as an academic endeavor. The only downside to the class was that it took the professor too long to return grades and feedback on the response papers and presentations.\nWorkload:\nTwo 5-page response papers, a 10-page policy brief and in-class presentation (done with a partner or in a small group), a final 12-page paper, weekly reading assignments and class discussion.\n"
        }
    ]
}