{
    "prof_info": [
        {
            "prof_name": "Victoria Stodden",
            "prof_id": 12204,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Applied Data Mining",
            "review_date": "May 13, 2014",
            "review_content": "\nA fairly strange class. The stats department combined 4026 and 3026 together, so that meant graduate students in the class, that generally made the curve worse during exams. There were a decent amount of graduate students, around 60 - 65% I'm guessing. One midterm, and one final, with problem sets due every week. \nOne of the biggest flaws in this class was that there was no standard syllabus. Stodden basically taught whatever she saw fit and while it was interesting at times, it was often just watching her plug in R code and following her methods vaguely. I would have liked to see a bit more theory in this class, perhaps adding a lab session run by TA's would have helped. Many of the topics were glossed over too quickly and that just made things confusing for everyone. \nThe problem sets were even more confusing, especially towards the end of the semester. Using R code to generate KML for Google Maps doesn't seem that useful to me, but tha's just my opinion. The exams were very hit or miss, Stodden would supply R code and we would write what it does or where the errors were. There wasn't really a way to study for this exam and going through old p-sets wasn't that useful either in the long run. \nOverall, this class suffered from lack of organization and this was evident in the psets and the exams. If you want to learn data mining, I'd suggest taking a higher level class with some theory as you'll probably retain that more than just debugging r code. \nWorkload:\nWeekly psets begin easy but get insanely hard at the end especially when things get extremely confusing. Exams are for the most part manageable but difficult to study for. Curves to around B+ but don't quote me on that. \n"
        },
        {
            "course_name": "Applied Data Mining",
            "review_date": "December 05, 2013",
            "review_content": "\nThe class started off okay but deteriorated really fast right around the midterm, which didn't test us on most of the concepts we learned (except for one question with a subjective answer that was graded harshly) and did test us on a lot of random unimportant things.\nThe lecture notes are incredibly vague. Professor Stodden herself is a wizard at over-complicating simple concepts. I and fellow students were confused by intro-level material in subjects we already knew. Time in lecture is well-spent by starting on the homework assignments.\nCourse material is a weak introduction to a disjointed set of computing skills that tangentially relate to data mining. In general, the content would be better suited as a lab section or tutorial series to supplement another course.\nThe only thing I got out of this class is better R programming skills, which apparently I could have picked up just as easily in the non-applied Data Mining course or Intro to Data Science.\nWorkload:\nMixed. One homework a week, a midterm, and a final.\nThe homeworks can take a long time. This isn't because they're challenging you to think or teasing you into mistakes that you learn from. They're designed to be constructive, in that they basically provide pseudocode for you to fill in with important steps. But after the first three or four assignments the sections became increasingly arbitrary and the projects became increasingly unrelated to the material taught in class.\n"
        },
        {
            "course_name": "Linear Regression W4315",
            "review_date": "November 05, 2012",
            "review_content": "\nAVOID HER AT ALL COSTS. I took STAT4315 with her this semester. \nShe unfortunately doesn't know how to teach and is quite mean to students. She doesn't teach, but writes on board without interacting with students, not allowing time for us to absorb material, or ask questions---its like she talk to herself without actually talking to class. The textbook saved my life to still do above average, but honestly the average for class was C anyway. Also the class is supposed to teach you some SAS but she didnt talk about it more than 5 minutes the whole semester (that was class 2 I think). I learned it on my own but shamefully its all basic training. So dont take the class like me if you want to learn advanced regerssion modelling or/and SAS.\nAnother MAJOR problem with her is that she cancels her classes (yes skips) without letting know the students (even during the nyc hurricane sandy when we all showed up for midterms- she failed to for days or letting us know). Also, her TA was terrible, no one in class could understand what she was saying, partly because she didn't speak clearly (or in decent english), but mostly because she was flying through the material without giving us time to catch on (similar to professor style). I come from quant background but honestly if I have problem in this class, I cannot emphasize what someone with less stat background would do in this class. \nAlso there are no times to see the professor and she doesn't answer emails.\nOnly good thing was I learned some SAS and regressions but only on my own and book.\nTake anyone but her, the alternatives have to be better.  \nWorkload:\nLOT- homework every class- midterms are too long for the time given- learn quick and learn well is key- book is very good.\n"
        }
    ]
}