{
    "prof_info": [
        {
            "prof_name": "Randall Balmer",
            "prof_id": 189,
            "total_reviews": 36
        }
    ],
    "reviews": [
        {
            "course_name": "Religion in America I",
            "review_date": "January 04, 2012",
            "review_content": "\nRandy is a wonderful, charming professor and I thoroughly enjoyed both classes I took with him this semester. His lectures consist of easy to follow (although not posted) powerpoints, with added commentary and explanations. Sometimes the lectures can get a little too theoretical or outright boring, but Professor Balmer is often outwardly apologetic about this and really tries to make the lectures interesting. He is a seriously respected scholar in the field of American religion, so you'll be able to get some really detailed information about some of the topics with which he's worked the most. He's always willing to see students during office hours.\nYou WILL NOT PASS this class if you do not do the reading. He pulls many multiple-choice and short answer questions on exams directly from the reading. The reading is usually directly related to what is discussed in lecture. Some books are painfully boring but on the whole they're not that bad. Missing lecture isn't the worst thing, but make sure you get detailed notes from someone else.\nIn the past, Professor Balmer gave out study guides prior to midterm and final exams, but as of Fall 2011 he has ended that practice. He made the midterms way too tricky for both classes. As a response to students' grief over their bad midterm grades, he offered the class the option to double their final exam grade if they completed a 2-page review of one of the class texts. This proved to be an AMAZING option, since the final was significantly easier than the midterm and if you studied, there was no reason not to do well. \nWorkload:\nSomewhere between 50 and 200 pages a week. More often a few chapters of a book than an entire book at once. \nReligion in America: Two 4-6 page response papers (topics posted 1-2 weeks in advance), 40 points each. Midterm exam 45 points. Final exam, 45 points. Discussion (Pop up discussion class every few weeks. Attendance is what counts.), 30 points.\nEvangelicalism: Research paper - proposal, 10 points; paper 70 points. Midterm exam, 60 points. Final Exam, 60 points. Discussion (Pop up discussion class every few weeks. Attendance is what counts.), 30 points. \n"
        },
        {
            "course_name": "Religion, Politics, and the Presidency",
            "review_date": "December 19, 2010",
            "review_content": "\nFirst, I have to make it clear that Professor Balmer is one of the most genuinely nice people I have had the privilege to meet. He is always available via email or during office hours, is incredibly accommodating, and is always willing to hear you out and help you in whatever way he can. \nThat being said, I was extremely disappointed with this class. It had the potential to be really great, but unfortunately a few things sidetracked our ability to get through the syllabus. First, though this was a strict lecture course, Balmer would repeatedly spend at least half of each class fielding questions and listening to irrelevant personal anecdotes from students. While I think it's great that he was able to facilitate discussion, it's also the professor's job to know when to tell students to see him after class so he is able to finish teaching the material for the day. Second, one of the class assignments was to create a powerpoint and present it to the class. While this assignment could have been successful in a much smaller class, it was a terrible idea in a class of 60+ students, and because of the presentations not only did we not get through most of the syllabus, but what we did cover, we had to rush through with barely any analysis. \nIt's important to keep in mind though that this was Balmer's first time teaching this class, so if/when he decides to teach it again, he may change some of the assignments, etc. Also, if you are simply dying to take a Balmer class, do yourself a favor and take Religion and the Civil Rights Movement. That class is a dream.\nWorkload:\nmidterm and final (noncumulative)... the multiple choice is tricky, but doable\none 4-6 page paper\nchoice of doing either the class presentation or writing a 5 pg book review\n"
        },
        {
            "course_name": "Religion in American Culture",
            "review_date": "December 26, 2009",
            "review_content": "\nI do not have enough nice things to say about this man.  Religion in American Culture I was very well structured, the material was interesting, the workload was very reasonable, and I have never meet anyone more enthusiastic about their subject matter than Randall Balmer.  He is always full of stories, and wants to make sure he has earned the class's attention.  Class was always thought provoking and I can't wait to take Religion in American Culture II.  He is also a very reasonable and kind person when it comes to individual problems.  \nThe readings are interesting, but not a necessity.  He has all the information he wants you to know on power point slides, but he won't test you on the details, so don't bother writing everything down.  I thoroughly enjoyed this class and think Randall Balmer is a great teacher!\nWorkload:\nfree points for \"participation\" (10%), and there were two 4-6 page papers that are graded very generously (20% each), a midterm (25%), and a final (25%).  The multiple choice could be a bit tricky but the IDs and essays on the midterm and final were graded very easily.\n"
        },
        {
            "course_name": "Mormonism",
            "review_date": "December 24, 2009",
            "review_content": "\nI loved this class. Though it was clear that Professor Balmer did not know every little detail about Mormonism, he knew a lot and was always willing to admit that he didn't know. He taught a lot of the basics of Mormonism and I encourage everyone to take the class. The workload wasn't bad, though the reading was often heavy. It was really interesting though, so a lot of the reading was easy to get through.  Everything we learned was really interesting. There were no papers, because he said that the course was very reading heavy (1 book a week), which made life easier. Professor Balmer was always really entertaining and nice. Our TA, Todd, was always helpful, too. \n \nWorkload:\neasy midterm and final- only multiple choice and IDs, a short in class presentation that was pretty simple. Lots of reading, but it didn't have to be done until exam time...\n"
        },
        {
            "course_name": "religion and american culture",
            "review_date": "December 21, 2009",
            "review_content": "\nThis class is one long simplistic powerpoint presentation. The minimal amount of reading (almost all at least co-authored by Balmer) meant that it was really a course on Balmer's view of American religious history. Each day consisted of him flipping through powerpoint slides, waiting as the class copied down names and dates, and then reading the contents of the slides more or less verbatim. He presents US religious history as a serious of bullet points. This felt like a high school class. Sparse on analysis, heavy on apologies whenever he happened to accidentally overburden us with 'too much theology.' Never mind that this is a religion course. Intellectual lightweight is correct. Academic disappointment. \nWorkload:\nMinimal reading, almost all from his book. 2 4-6 page papers on simple topics. Midterm and final with multiple choice and matching sections.\n"
        },
        {
            "course_name": "Religion in American Culture",
            "review_date": "December 17, 2009",
            "review_content": "\nThis class was most definitely a survey of American religious history from colonization through the Civil War.  As such, we covered a lot of ground only sometimes in depth, I learned a lot, and it was very easy.  Professor Balmer's greatest fear (as he demonstrates with repeated apologies for his lack of up-to-date humor or for his hilarious anecdotes that he's sure no one will be interested in) is that the class will be bored or overworked.  I thought he was hilarious in that kind of awkward, professorial kind of way.  At the same time, he knows all about American religious history, and if he doesn't have a full answer to a question, he will research it and give a better answer in the next class.  \nClasses consisted of powerpoint lectures that are not posted online, so take notes!  Luckily, Professor Balmer goes very slowly, leaving plenty of time to copy out almost every slide in full (not that you'll need that much detail for the exams, but it comes useful in papers and is interesting).  On top of going so slowly, class was almost always let out 15 minutes early, so I never had to sprint to my next class.  \nThere were two 4-6 page papers, graded by TAs who seemed to have no role but grading these papers (no discussion section), with given topics.  The midterm and final both have three sections: multiple choice, match the term with the answer (in lieu of writing IDs), and an essay question or two.  Again, easy.  Weekly reading was important for the exams and for the papers, and ranged anywhere from 20-150 pages per week, though only a few times did it hit 150 pages, and those books were easy to read. \nWorkload:\n20-150 pages reading per week (you need to read the books that keep coming up in the syllabus, as well as some of the smaller ones, but you don't have to do everything).  2 4-6 page papers.  Easy midterm, easy final. \n"
        },
        {
            "course_name": "Rel in American Culture II",
            "review_date": "April 22, 2009",
            "review_content": "\nYo I loved this guy. He is so interesting and caring and engaging and I got a lot out of the class academically and personally. I would recommend it and if you are interested in majoring in Religion go to his office hours and get to know him. He is very receptive and caring and a great professor! \nWorkload:\nmedium-low\n"
        },
        {
            "course_name": "Religion and the Civil Rights Movement",
            "review_date": "December 13, 2008",
            "review_content": "\nProfessor Balmer is interesting and warm. His lectures are clearly organized and he's totally into the material, which in itself is fascinating. I loved this class! The reading is a bit much but it's interesting. I highly recommend this man--he really cares about his students. This semester there were about 90 of us in the lecture and he stayed after class answering question after question after question, beaming at the students as they passed. And what an interesting guy! He sometimes goes off on little tangents about his books or his documentary, which is pretty cool because he's Emmy award-winning.\nBalmer is great about multimedia-style presentation as well. We watched some really cool documentaries and read some amazing books. Howard Thurman's \"Jesus and the Disinherited\" was hugely impactful--if you skim through any of the other books, read this one!! It's paradigm-changing, to say the least.\nWatch out for his essays. The prompts are really general and you'll end up having to do tons of research on a topic minutely related to the prompt in order to get an A. The last paper, a \"reflection\" on how this class had affected, if at all, our understanding of history or religion, was graded like a research paper, not a personal reflection. This is probably more of a TA issue though...\nYay this class! Take it! It's awesome!\nWorkload:\nHeavy reading--2 huge biographies, 3 shorter books (150-300 pages), a good deal of historical documents. 2 essays, midterm isn't that bad, and a final.\n"
        },
        {
            "course_name": "religion and american culture",
            "review_date": "December 17, 2007",
            "review_content": "\nThis guy is the man. The material isn't challenging at all, but he's a really good, entertaining lecturer. He can make fun of the more conservative Christian groups sometimes, so don't take the class if you can't take a joke. But he's just awesome, it's so much fun, and I learned a surprising amount. The exams were easy, but annoying, because they focus on random details rather than concepts. I highly recommend this class.\nWorkload:\nnon-cumulative midterm and final (you can finish in 15 minutes if you know your stuff), 2 response papers or a research paper. Some reading that you should do.\n"
        },
        {
            "course_name": "Evangelicalism",
            "review_date": "September 14, 2007",
            "review_content": "\nI enjoyed this class.  I think Professor Balmer is a talented teacher as far as his ability to connect to students.  He was able to elucidate the main facts and themes of American evangelicalism in a way that seemed to strike the right note with everyone in the class.  He was also extremely friendly and helpful in office hours when I went to talk to him.\nOn the other hand, I didn't find his presentation of the material challenging at all.  In part this may have been due to the fact that we didn't have too many thought-\nprovoking discussions, in which his main points were challenged or a different perspective offered.  Also, there are times when you will think you're back in high school-- movies, excessive power point (where everyone proceeds to copy down every single word that is on the screen and thereby delay the class), and really, really easy exams.  The most challenging part of the course was the research paper, which I found very worthwhile.\nOverall, I do recommend this class if you are interested in American religious history.  You'll learn and probably enjoy yourself.\n\nWorkload:\nEasy- 1 research paper, midterm, (non-cumulative) final.  The exams were mostly multiple choice with a few IDs.\n"
        },
        {
            "course_name": "Religion and the Civil Rights Movement",
            "review_date": "September 07, 2005",
            "review_content": "\nBad. Bad. Bad. This class was a real stinker. The class should have been titled Eyes on the Prize: Watching the Movie. At least half the class Prof. Balmer simply came in, started the VCR, and allowed two or three minutes at the end for questions. When he did lecture, the content was either very simplistic or simply factually incorrect. The TA's were little better. They would raise their hands to answer questions (you're a TA, put your hand down) and then would answer them wrong. The final exam was an exercise in nitpicking. Instead of looking at the broad themes of the civil rights movement, he asked questions about who said specific quotes that were never talked about in class and mentioned in passing in the readings. That said, I got an A- for minimum work. It's just a terribly thought out and lazily executed way of approaching a very interesting topic. For shame, Prof. Balmer. Your students deserve better.\nWorkload:\nI don't know. No one read the books. Final is ridiculous but they probably curve the grades up pretty high so no one complains about what a terrible class this is.\n"
        },
        {
            "course_name": "Religion in American Culture",
            "review_date": "June 18, 2005",
            "review_content": "\nA true intellectual lightweight. I'd say in about 2/3 of the classes he could have been making the stuff up as he went along, and the remainder of the sessions Balmer screened movies, not because they told us something earth-shattering (which they didn't) but because his lazy ass wanted to avoid giving a lecture. The outside speakers he brought in were all more interested in advancing their own parochial agendas than telling us anything of value. I wasted a lot of $$ and burned some shoe leather trekking to the Hungarian on weekends to hunker down and finish the ridiculously repetitive books he assigned. I only did the readings because, since the exams are all IDs, you cannot skim to get the general concepts, but instead you must read every word and be on the lookout for words thrown in here and there that might POSSIBLY make it onto a test. Finally, he bent over backwards to allow students to waste the time with idiotic questions that belong back in the 3rd grade. At the end of the course, I felt used like a cheap whore - because I'd allowed this guy to waste so much of my time. After class every day, I quite literally regretted having attended, because sleeping in would have been a better use of my time. One of the biggest academic disappointments I've had. Avoid this guy.\nWorkload:\nEither 2 \"response\" papers or 1 longer research paper; midterm and final. There's a twist to his grading policy which he won't disclose until the last week of class, but since no one has put it up yet, I'm going to blow his cover: He'll let you double your grade from one exam and drop your grade from the other. That is, if you do well on the midterm, you can simply skip the final; or if you do poorly, a bang-up job on the final can make everything right. Simply put, no need to work that hard.\n"
        },
        {
            "course_name": "Religion and American Culture II",
            "review_date": "June 16, 2005",
            "review_content": "\nI came into this class wanting to take a class for my American Studies major, an Atheist with no previous interest or knowledge of religion and no real desire to study it, and left as a Religion minor with Balmer as my major advisor.  It was by far my favorite class and a treat to attend everyday.  It was my first class of the day and I hate waking up; furthermore, all the notes are presented on powerpoint (easy to take down!) which makes copying them from others easy--that being said, I still never missed a class.  It was everything that could be interesting about American religion compiled into one class... we studied some broad topics but mainly the class was focused on interesting tidbits that Balmer deftly explained with interesting anecdotes from his own in-depth study of the topic.  The material was simply fascinating, and in general the TA's brought a lot to the discussion as well and their absence was even felt during the week-long strike in April (though sometimes they did carry on too many irrelevant personal conversations with Balmer during class).\nThere are 4 units (sort of five, we didn't finish--more on that later) and you get to pick 2 to do a paper on, which is nice because you don't have to write on something if it bores you.  You can also choose to do one research paper in lieu of the two, shorter unit papers.  I loved the lectures but I have some qualms about the organization of the class... sometimes the material of the unit didn't really fit together, which made writing a paper on the unit difficult.  This was particularly evident with the unit on immigrants, because there was material on immigrants spanning two units.  Also, we didn't really come close to finishing the material on the syllabus, which is a shame because it all seemed so interesting.  The guest (a Native American woman and Jewish rabbi) lectures were both a waste of time but, to his credit, they were both impromptu as they had called Balmer that morning and I don't think he'd known how they were going to go.  Also, some of the books weren't very good (\"The Secret World of Penitentes,\" a topic in which I was very interested, was so bad that I actually couldn't force myself to finish reading the horrific writing).  But take this class for the lecture and you'll enjoy yourself immensely.\nThere is an in-class midterm and final, both of which are VERY heavily memorization-based.  Fortunately, they eliminated multiple choice on the final, which made it a lot easier since you're studying for the ID's anyway (he gives you the list of possible ID's ahead of time), and Balmer lets you double either your midterm grade or your final grade (if you so choose).  However, it is still difficult to memorize 50 VERY detailed paragraphs worth of material, and if you leave off minor details you will get marked off (you have to write EXACTLY what the TA's are looking for).  This has drawbacks and benefits, but since it really comes down to how much time you're willing to put into studying for the test, you are truly in control of your grade and if you study you will get an A.  I recommend trying really hard on the midterm because if your grade is good enough it will be one less final to study for come finals week.  The rest of the class though is basically no work... you are supposed to read the books at your leisure and have them completed by the end of the unit, however if you are not writing a paper on the unit you don't really need to, since if they're going to be on the final you'll know from the list of ID's he gives you.  However, some of the books were interesting and I kind of filed them under my \"read for pleasure if I have time\" category.\nAll told, I highly recommend this class as a very interesting introduction to a (who knew?) fascinating topic that is very relevant today.  Balmer is a captivating. charismatic lecturer who has good material to work with.  Really, the class was just plain fun, and I am doing whatever I can to make sure I take as many classes with Balmer as I am able to do at Barnard!\nWorkload:\nVery light--2 papers of 6-8 pages which are fairly easy and based on however much reading you want to do for them (skimming one book could be good enough to write the paper).  1-2 books are assigned for each unit (5 in total) but the reading is rarely necessary... only to answer the ID's on the tests but he gives you the list beforehand so you'll be prepared anyway.  Extra credit is available on both the midterm and final, and you can substitute either grade for the other.  All tests and papers are worth 20 points each, for a total of 80 points.  The grading on papers varies by TA... my papers were about equally good and one got a 40 while the other one got a 34 (which is a B and therefore a pretty low grade).  If nothing else, this class is an easy A- if you just apply yourself a little bit and an easy A with some effort when writing the 2 papers and taking the test (you only have to do well on one since it's doubled!)\n"
        },
        {
            "course_name": "Rel in American Culture II",
            "review_date": "May 21, 2005",
            "review_content": "\nThis class is one of the reasons I'm no longer a religion major.  Every day was the same ordeal: walk into class, listen to Balmer make fun of and trivialize various different religious traditions, copy down pages of notes directly from a power point presentation, and listen to rabid TAs interrupt to give their own somewhat related perspectives.  Simply awful.  There was no general theme tying any of the units together (aside from, perhaps, \"these guys are nuts too!\"), the final & midterm were merely memory tests, and the books assigned were generally poorly-written and boring -- one of which was Balmer's own, which you got to read & then watch a movie version of in class.  That said, I really think Balmer is a genuinely nice guy and he's certainly well-known in his field.  Maybe he'd be better in a seminar setting, or if you're interested in hearing your own views about \"crusty fundamentalists\" irreverently receited back to you.\nWorkload:\nAnnoying midterm & final, choice of 2 small papers or one large one, all reasonably graded.\n"
        },
        {
            "course_name": "Religion and the Civil Rights Movement",
            "review_date": "January 12, 2005",
            "review_content": "\nI think professor Balmer is a really wonderful person, but there were definitely positives and negatives about this class. I LOVED the subject matter, but I felt that Balmer placed a lot more importance on memorizing names and dates than on talking about the significance/implications of the material.  Because there was little discussion, this means you dont have to do the vast majority of the reading(good), but that the information you get can be very surface.  The saving grace here is the amazing movie series we watch, Eyes on the Prize, which bring everything to life.  He lectures according to a power-point, we often ended early, it's very painless.  Overall an easy and inspiring class where you can totally choose your level of involvement and get a good grade either way.\nWorkload:\nA ton of reading; it's interesting but in all honesty i did hardly any of it and it did not damage my grade.  The midterm and final are very straight-forward and easy(the midterm was easier in my opinion).  Two 6-8 pg. papers or one 15-20 pg. one(I did this in 2 days, handed it in a day late and never did a rough draft and got almost a perfect score..so im guessing the T.A.'s grade leniently).  Supposedly he is very strict about deadlines, but this was not my experience.\n"
        },
        {
            "course_name": "Religion and the Civil Rights Movement",
            "review_date": "January 01, 2005",
            "review_content": "\nI found this class to be fascinating.  Professor Balmer's lectures are from a power-point presentation so it is easy to follow and take notes.  He weaves interesting pieces of information together, starting with stuff that you will have already learned in an AP history course, but then really delves into the information.  There are lots of books assigned that are unnecessary to read, but some of them are actually quite interesting, and I would suggest at least skimming through most of them.  However, one caveat is that the class is run by his TA's.  He does no grading and does not even write his midterm or final.  However, he is very approachable if you have a problem with them.\nWorkload:\n2 6-8 page papers or 1 15-20 page research paper, an EASY midterm and final.  Lots of reading, but some is not necessary\n"
        },
        {
            "course_name": "Religion and the Civil Rights Movement",
            "review_date": "December 30, 2004",
            "review_content": "\nGreat class! Balmer makes everything interesting. You watch movies all the time. Work load minimal. Technically a lot of reading but you don't need to do it because the lectures tell you everything you need to know.\nWorkload:\nVery little\n"
        },
        {
            "course_name": "Religion and Civil Rights",
            "review_date": "December 08, 2004",
            "review_content": "\nhe's a good guy, definitely.  goes pretty fast in his lectures, but the material is really interesting and he definitely knows his stuff.  he also likes to share little stories with you about his experiences.  you watch a bunch of movies, which is always good, but taking notes and watching movies can get tedious after a while.  lets class out early most of the time. ta's do most of the grading, so you're grades will definitely be unpredictable depending on who grades them.\nWorkload:\neither two papers throughout the semester or one major research paper.  tons of reading, but not really that pivotal to the midterm, which was really easy.  you can get along pretty well without it.  final.\n"
        },
        {
            "course_name": "Religion and Civil Rights",
            "review_date": "November 18, 2004",
            "review_content": "\nBalmer is great! He is a very nice person, and very intelligent. The material in this class focuses a little more on the Civil Rights than on the Religion parts, but all in all, a great class. Balmer does very clear powerpoints with every lecture so note-taking is very easy. We also watched quite a few very interesting documentaries. Definitely take this class!\nWorkload:\nChoice between two papers (4-6 pages each) or one research paper (20 pages). Midterm and non-cumulative final, both of which are multiple choice and people/event short-answer identifications. There is a lot of reading assigned, but not entirely necessary.\n"
        },
        {
            "course_name": "Religion and Civil Rights",
            "review_date": "November 17, 2004",
            "review_content": "\nBalmer is a cool guy -- his lectures aren't particularly fascinating but he really knows what he's talking about.  The reading is somewhat interesting if you choose to do it (no need at all to do it) and he summarizes it in his lectures.  He goes very quickly so you take a lot of notes very fast, but it's well organized.  The paper was graded harshly by the TAs but I didn't spend very much time on it -- I think most others got decently good grades.  The mid-term was very very easy, just read over your notes a few times and you're fine, it's just some multiple choice questions and like 5 IDs.  Very easy.  I recommend this to anyone interested in Civil Rights (it's more Civil Rights than religion) and he shows really good videos like Eyes on the Prize and a movie by Spike Lee.\nWorkload:\nA lot of reading (which you don't need to do at all), two 6-8 page papers OR one longer paper (12-15 maybe? not sure) graded pretty hard.  Easy midterm and final.\n"
        },
        {
            "course_name": "Religion and American Culture I and II, Religion and the Civil Rights Movement",
            "review_date": "November 14, 2004",
            "review_content": "\nI cannot praise Professor Balmer enough!!  Not only is he one of the best lecturers I have ever had, but he is undoubtedly the most approachable. While grading can get tricky because his TA's are often very very picky, grammatically-oriented, and subjective, he is more than willing to meet with a student and review your work if you have a case. He is very personable, inserts wit and humor into his lectures (which admittedly can get very repetitive very quickly), and really knows and explains his stuff well. I would recommend taking anything you can with Balmer!\nWorkload:\nTons of reading- in theory. You dont really have to do any of it, as he will cover it in his comprehensive lectures. He uses slideshows for the majority, interspersed with video presentations to keep it interested. A few short papers (graded harshly by TAs) and SUPER easy midterm and final if you show up to class and listen (which isnt hard considering that hes terrific). \n"
        },
        {
            "course_name": "Religion and American Culture II",
            "review_date": "November 02, 2004",
            "review_content": "\nI cannot defend him enough.  I loved this class and I love him.  I never found him arrogant.  If anything, the students at this University are arrogant.  When someone received a grade below a B+, it is an ingrained reflex that the TA is down right mean.  Please!  Get over yourselves.  The midterm is IDs which apparently, I did not realize, are hard?  I thought not.  Take this class if you're interested in religion, but don't be turned off by these whiney reviews.  He's a great professor with a great class!\nWorkload:\ngo to class, listen, study, read. you'll be fine.  i found the midterm/final easy because i did those.  i wrote the 20 pg research paper, graded by balmer, and was pleased.\n"
        },
        {
            "course_name": "Religion and American Culture I and II, Religion and the Civil Rights Movement",
            "review_date": "August 09, 2004",
            "review_content": "\nSimply put, this man is brilliant and teaches some fantastic courses. The common complaint among the detractors on this site seems to be that he doesn't grade his own papers. This is true, but it hardly takes away from the experience of hearing one of the leading scholars in American religion lecture twice a week. If you are not interested in American religion (particularly American Christianity and evangelicalism, since that is where Balmer has done most of his groundbreaking work), you will not enjoy this class. However, if you are a religion major or have more than a passing interest in the state of religion in America, the class is a must. His credentials as a researcher in this field are nearly unrivaled, and he is passionate about teaching undergraduates. For those people who think he is arrogant or disinterested, try demonstrating genuine interest in what he's saying. I once went to his office hours to ask about a paper and ended up talking about Bush and religion for about an hour because he was so glad to see a student who actually cared about what he was talking about. Don't take the class for an easy 'A'; it's an insult to a great professor. Take it because you'll learn something from one of the greatest Columbia has to offer.\nWorkload:\nrelatively mild: easy final and midterm, several short papers on topics of your choice--a chance for students to explore their own interests, so there shouldn't be many complaints.\n"
        },
        {
            "course_name": "Religion and American Culture II",
            "review_date": "July 19, 2004",
            "review_content": "\nImpressed by BalmerÂ’s extensive brochure-of-a-syllabus and encouraged by a genuine interest in the subject matter, I made the worst mistake of my academic life and registered for Religion and American Culture II.  Week after unbearable week I scribbled his immaculately organized PowerPoint presentations into my notes while languishing bored by his total dullness, and stark lack of analysis. Lectures read like the driest textbook, \"In 1900 this happened, 1902 this event.... blah blah blah blah.\"  He had impressive credentials for sure but threw on a video (staring him) instead of lecturing on the topics of his expertise.  He never read any papers (a TA-only job) and never once did I find comments explaining my grades.  I've heard all sorts of horrors about his grading and fared pretty well at first. I got overall good grades (all A's) on all assignments until one.  Unfortunately, on one occasion personal matters conflicted with a due date and Prof. Balmer made an already shitty situation so so so much worse by being totally inflexible, unavailable and just plain mean. I managed to turn in a pretty good paper late (which really wasnÂ’t so bad considering the circumstances). On account of the tardiness of one response paper he thought it appropriate to drastically cut my final grade from an Â“AÂ” to a \"D\".  Grrrrrr.  So um basically..... DO NOT TAKE HIS CLASS IF YOU HAVE HALF A BRAIN AND WANT TO DO MORE THAN MEMORIZE DATES!!!! (and if you do enroll pray for a tranquil personal life) \nWorkload:\nthree 8-page response papers or one long research paper, difficult midterm and final exam. \n"
        },
        {
            "course_name": "Religion and American Culture II",
            "review_date": "May 07, 2004",
            "review_content": "\nI really enjoyed this class. As people have already stated, the lectures are extremely well organized and interesting. Prof. Balmer is an engaging lecturer; I was really only bored when the TAs gave lectures. My one BIG complaint is that he is quite arrogant, which I find to be completely inappropriate when teaching undergraduates. He assumes knowledge and then acts surprise when you don't know everything about the history of religion in America. Be prepared for this attitude -- it is quite infuriating. All in all, though, a good class.\nWorkload:\nfour short response papers (5-7pgs), midterm and final\n"
        },
        {
            "course_name": "Religion in American Culture",
            "review_date": "January 12, 2004",
            "review_content": "\nThough Balmer himself is as nice and knowledgeble as the others have written, I found his grading style to be atrocious.  I don't think he touched a single paper or exam anyone in the class handed in - didn't read any of them or even verify the grade.  The TAs graded everything, and they were rather unpredictable and in one case, downright mean about the comments.  I was so frustrated and hurt by one particular TA's comment on a paper I threw it out in the nearest trash can -- they were utterly unhelpful and bordered on being personal.  I found it hard to keep up my enthusiasm for the course when I realized neither professor nor TA cared who their students were nor how they were doing.\nWorkload:\nI found it to be a little excessive - 4 papers 4-8 pps (one optional), in-class midterm and final (easy).\n"
        },
        {
            "course_name": "Religion and Civil Rights",
            "review_date": "January 10, 2004",
            "review_content": "\nProfessor Balmer is an excellent professor.  He is not only interested in the material, but seems completely devoted to it.  The majority of his lectures were engaging.  If you are at all interested in this subject matter, take this course! \nWorkload:\nweekly reading, two short papers (or one longer research paper), easy midterm and final\n"
        },
        {
            "course_name": "religion and american culture",
            "review_date": "December 11, 2003",
            "review_content": "\nTake this class. Professor Balmer is a fantastic lecturer and a truly brilliant man. Try \"Googling\" him if you're curious about the man's credentials - he is a bona fide religious historian and expert, a prolific writer, and even an Emmy nominee! The class is fascinating and relatively simple, and though you'll get frustrated that he never starts on time, you'll appreciate his interesting stories and obvious love of the subject matter. It bothered me that some topics were rushed through, but, I can't blame the guy for trying to fit all of pre-Civil War American religious history into a semester. \nOverall, he does a fanastic job and will keep you very much interested. \nWorkload:\nNot too bad. The readings were somewhat excessive, but not entirely necesary. A short 40 minute midterm (they give you the IDs ahead of time!), three 4-8 page papers, and an easy, noncumulative final. You won't be struggling to get an A in this class, either. If you do the work, and at least some of the reading, it's easy as peas. \n"
        },
        {
            "course_name": "religion and american culture",
            "review_date": "November 18, 2003",
            "review_content": "\nThis class is great! If you are at all interested in the impact that religion had throughout American history then definitely take this class. Balmer is a wonderful lecturer, every class was engaging and you definitely come away with a great understanding of the material. \nWorkload:\nYou have to write three 4-8 page papers based on readings and lectures. They aren't too bad and you can resubmit them Also a Midterm( which was very easy), and final. The midterm, final, and each of the essays count for 20% of your grade. NOTE: TA's do ALL the grading, but they were pretty cool so it shouldn't make much of a difference either way.\n"
        },
        {
            "course_name": "Religion and American Culture 1865-present",
            "review_date": "September 10, 2003",
            "review_content": "\nI can't understand why the Religion department decided to let Balmer teach all this material as one semester survey.  He is obviously only interested in discussing modern evangelism and its manifestations, which is surely interesting, but makes it all the more obvious that the rest of the material is what he has to cover out of a sense of duty or political correctness.  The best part about the class was it was over after 45-50 minutes.\nWorkload:\nfive short response papers (try to compress a huge vague survey into four pages and still make a point), very easy midterm and final\n"
        },
        {
            "course_name": "religion and american culture",
            "review_date": "May 12, 2003",
            "review_content": "\nThis class is amazing. This teacher is amazing. He organizes all the lectures on power-point so taking notes is a breeze. Balmer is fascinated by what he is teaching and eager to convey that fascination by funny antidotes, wonderful texts and unbeatable energy. \nWorkload:\n4 papers (4 pages each), and a 1/2 hour midterm and final. \n"
        },
        {
            "course_name": "religion and american culture",
            "review_date": "May 08, 2003",
            "review_content": "\nProf. Balmer is an interesting lecturer.  He uses engaging materials, including different films and speakers.  However, he is unorganized in the class structure in that he did not plan how long to spend on each topic.  So, while we spent over a month on one unit, we spent only two days on another.\nWorkload:\nThe workload is not bad -- four papers, an EASY midterm and final.  Really not a big deal.  But, in your response papers, be sure to put in your personal opinion.  This is not a class where you should avoid using your own voice.  Write \"I think\" and draw in comparisons to your own life -- he loves that!\n"
        },
        {
            "course_name": "religion and american culture",
            "review_date": "April 07, 2003",
            "review_content": "\nIf you care at all about the material in the course, take this class. The man is brilliant and a dynamic lecturer. He also organizes the course very well, and the readings are great. One of the books on the syllabus is his own, but it's worth it-- the book is incredible as well. Balmer can come off a bit pompous, but he has reason-- he knows his stuff.\nWorkload:\nfour short (4-6 pages) papers, short midterm and final.\n"
        },
        {
            "course_name": "religion and american culture",
            "review_date": "December 25, 2002",
            "review_content": "\ngreat course! laid-back and really interesting. you get to watch a few documentaries, lectures are easy to follow, organized and interesting. balmer is arrogant, and your personal interaction is all with the TAs, but he has a right to be and is really a great lecturer. \nWorkload:\nwrite 2 papers (you get to chose which units to write on, so can fit it in with the rest of your schedule), midterm and final with IDs he gives you in advance. don't have to do most of the reading.\n"
        },
        {
            "course_name": "religion and american culture",
            "review_date": "December 25, 2002",
            "review_content": "\ngreat course! laid-back and really interesting. you get to watch a few documentaries, lectures are easy to follow, organized and interesting. balmer is arrogant, and your personal interaction is all with the TAs, but he has a right to be and is really a great lecturer. \nWorkload:\nwrite 2 papers (you get to chose which units to write on, so can fit it in with the rest of your schedule), midterm and final with IDs he gives you in advance. don't have to do most of the reading.\n"
        },
        {
            "course_name": "Native American Religions",
            "review_date": "December 31, 1999",
            "review_content": "\nRandall Balmer, although he is an excellent professor otherwise, doesn't really know much about Native American religions. Ultimately, however, this class is basically one long discussion section, so it doesn't really matter. However, the class still suffers from a reading list that, despite inclusions of several really excellent books, leans more heavily on tedious and frequently shallow anthropological accounts (although this is hardly Balmer's fault; there's really just not enough good scholarship on the subject). The class also suffers from the greatest inherent problem of colloquiums, i.e. the success of the class is largely dependent on your classmates. Suffice it to say that mine wasn't too successful.\nWorkload:\nA book a week, one presentation, and a 17 page research paper.\n"
        }
    ]
}