{
    "prof_info": [
        {
            "prof_name": "George Mihaila",
            "prof_id": 2332,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Industrial Info Systems, soon to be compsci something",
            "review_date": "September 08, 2008",
            "review_content": "\nPretty Boring, but in his defense he does teach the material.  I mean, how exciting can the characteristics of a database be.  Get the book, and learn everything on the slides he posts and you'll be fine.  Also, meet with him for the project as you may be doing everything wrong unless you talk to him.  Learn SQL before you take the course. That's 25% right there\nWorkload:\nIt's all about the project and the midterm and the final.  The grading is very subjective...be sure to check that points are added up correctly and that you didn't get points taken off arbitrarily.\n"
        },
        {
            "course_name": "Industrial Information Planning Systems",
            "review_date": "January 15, 2007",
            "review_content": "\nIf you can attend every lecture, stay completely awake every minute, and understand everything he says during class, you're not human.  \nThis class is by far the worst IEOR requirement you need to take.  Material is completely useless and irrelevent unless you specifically want to pursue a career database design.  \nThe class started out with 60+ people but attendance dropped to less than 10 after a few weeks never to rise again.  The material is extremely mind numbing and the way he teaches doesn't help a bit.\nTeach yourself SQL before entering this class and you should be set for 25%-50% of the course material.  Everything else is wave after wave of useless info that you're forced to memorize and remember.  It's psychological torture.\nBoth textbooks were pretty much optional eventhough he says otherwise, homeworks were pretty useless and many people didn't do them anyway, midterm was hard, final was impossible, but the curve was very generous.  I got something like 25/100 on the final and still managed a B.  Work hard on your project, it's your only hope.\nWorkload:\n4 HW Assignments, 7-8 Project Assignments, midterm and final\n"
        },
        {
            "course_name": "E4409 Industrial Information Planning Systems",
            "review_date": "September 12, 2006",
            "review_content": "\nThere is not really a need to go to class to listen to the professor since everything you need to know, you can learn from the book: Designing Quality Databases with IDEF1X Information Models. The other book is important as well but this one is a must buy.\n\nWorkload:\nReading from Designing Quality Databases and Intro to math programming every week. You should read if you want to do well in the class.\n"
        },
        {
            "course_name": "E4409 Industrial Information Planning Systems",
            "review_date": "December 18, 2005",
            "review_content": "\nProfessor Mihaila is a quirky, but a very nice and friendly man.  Lectures are very organized and taught word-for-\nword from powerpoint presentations.  He makes the presentations available online.  This semester around 70 people were enrolled in the class but usually 5-10 came to lectures (one lecture was just 3 students)!  Since this is an extended class (meets 1x / week) many students would leave during the break.  It was weird to come back after break to see no one in the classroom ...  \nAnyway, don't expect to learn much from the powerpoint slides and lectures (he's very boring and appears uninterested).  Most of the learning comes from reading the textbook.  The IDEF1X book that he requires you to purchase is a waste of money -- I haven't opened it once.  Don't buy it unless you need it -- it'll save you a ton.\nMihaila does SQL in Access, which is a defunct application.  Most of the students in the class are IEOR who have no concept of SQL or programming languages.  If you have any background experience, you will accel.\nOverall, the class was a pleasant experience.  Grading is very fair, the professor is very friendly and nice, homework assignments were light, and lectures were available online.\nWorkload:\n4 very easy homework assignments, 1 project (also very easy but time-consuming, easy midterm and final (which means no curve).\n"
        },
        {
            "course_name": "Industrial Info Planning Systems",
            "review_date": "January 13, 2005",
            "review_content": "\nProf Mihaila has very organized lectures and posts the lecture slides online.   Class is really boring and there isn't much of a point in going since all the homework can be done through reading the book.  But I must say that the professor is really really nice and easy to approach.  He's not too picky about late homeworks or projects.  We also had a really nice TA, so that helped as well.  The class was the 2 hour 30 min kind, but Prof Mihaila usually lets out much earlier than that.  Overall, I learned a lot about database, and I do recommend the class for a easy good grade.\nWorkload:\n4 homeworks, 1 group project,  midterm, final.  Pretty light in my opinion.  The homeworks are not too long, very book oriented and easy to find answers to.; usually doable in about 2 hours.   Project isn't too bad either, just try to keep up with the schedule that he gives as a guildline.  Midterm and final are pretty easy, just look over the previous exams; he does very similar things.\n"
        },
        {
            "course_name": "Industrial Information Systems",
            "review_date": "December 26, 2004",
            "review_content": "\nLectures are very structured but sooooo boring. No point to go to the lectures. He's a nice guy though\nWorkload:\n4 HWs due periodically, plus a semester long project. Midterm, final - study previous years tests because these two components count a lot for your grade\n"
        }
    ]
}