{
    "prof_info": [
        {
            "prof_name": "James Zetzel",
            "prof_id": 302,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Elements of Latin Prose Style",
            "review_date": "August 25, 2010",
            "review_content": "\nProfessor Zetzel knows the Latin language better than anyone I have ever met.  His knowledge of the finer points of style and usage is astonishing, and on top of that he's quite funny.  His conversation has a tendency to meander a bit, but it was usually relevant, and always fascinating.  He has a very dry and ironic sense of humor, and there will be many jokes based on how much the students are suffering and how much he enjoys seeing them suffer; whether these are totally meant in jest is up to the students to decide.\nClass followed a pretty regular schedule: on Mondays we would go over our readings, and on Wednesdays we would turn in our composition assignments, which we would then get back the following Monday.  Initially there was some guidance through technical points of grammar and usage, but eventually we were expected to take matters largely into our own hands.  The style of Latin that Zetzel expects is very strictly late Republican prose: no words from poetry, and avoid the kind of overly fancy constructions that one would find in Imperial prose.\nOne final word of warning: the textbook, Bradley's Arnold, is quite old, and you will quickly grow to hate its awful Victorian English.  That said, its explanations are pretty thorough, and the extra work involved in penetrating the awful Victorian prose just cements your understanding of Latin that much more.\nOverall, though, this was a wonderful class.  I worked my ass off, but it was worth every minute, and my Latin has gotten miles better as a result.  Just don't take this class unless you're a very devoted Latin student; there's no reason to put yourself through this kind of pain otherwise.\nWorkload:\nThe workload for this class is, to put it bluntly, brutal.  The reading assignments are fine: just passages from Caesar and Cicero, although you'll quickly find that they're much more devious than they seem.  But it's the composition assignments that'll have you burning the midnight oil: there was a period when the composition assignments took me at least four hours to write out.  There's no midterm, thankfully, and the final is a couple of take-home assignments.  They are, however, just as nasty as anything else: detailed translation of a passage of horribly-written Latin prose, and a long passage of very idiosyncratic English (ours was Victorian, but he considered assigning Bob Dylan) into Latin.\n"
        },
        {
            "course_name": "Political Theory in the Ancient World",
            "review_date": "July 12, 2005",
            "review_content": "\n(Note: I think this class is usually taught in Poly Sci, so maybe this review should be listed under that department?)\nThink of this class as the first half-semester of Contemporary Civilization, but on steroids.  Republic, Laws, Ethics and Politics, Polybius, loads of Cicero (theoretical works and court speeches), plus earlier Greek authors for context, and later Roman ones for completeness, and then a brief wrestling match with that hobgoblin of the CC syllabus _City of God_.\nThe sheer scope of the material, the fact that some of it is in old, or bad (or both!) translations, and the depth with which it's treated can make it hard to pay attention in this class -- and hard to catch back up if your mind wanders.  Zetzel is a good lecturer, if you like his kind of continual dry humor, which I do, but even he can't really manage to keep everything focused and interesting all the time.  Sometimes he seems to spend a little too much effort trying to illustrate connections and debates across hundreds of years of time and not quite enough digging into particularly difficult passages of some of the texts; but, in fairness, some of the toughest material in the course is in Aristotle and he let the TA work through it in a very good lecture of a thoroughly different style than what we got most days.\nProfessor Zetzel will find all the flaws in your work -- be sure of it -- but won't punish you too much for any of them.  The final exam had a few of the hardest questions I've ever seen on any test in the humanities at Columbia, but thank goodness they were distributed well in advance.\nIf you're serious about political theory, you really do need to take this course.  Zetzel doesn't always manage to make the lectures fascinating but given some of the subject matter they could be *far* worse.  There are some often overlooked gems among the reading, whether you come from a Philosophy, Political Science or (I'm told, anyway) even a Classics background.\nYou will do a lot of work, however, with what can, honestly, sometimes be both difficult and tedious texts.  Consider how much this subject interests you before you take the plunge; CC alone may be enough for many.\nWorkload:\nTwo papers and a final for undergrads; one long (and, I'm told, very difficult) paper for grad students.  Perhaps to be avoided if you have a heavy load and you don't read fast -- there are less papers and tests here than in CC but the amount of reading is comparable.\n"
        },
        {
            "course_name": "Latin Literature of the Republic",
            "review_date": "January 28, 2005",
            "review_content": "\nI almost completely disagree with the other review for this course. \nProf. Zetzel knows as much about the texts as anyone in the field (if you don't believe me, look at any random bibliography on one of them). When he says \"I'm not sure this interpretation is correct,\" he means \"Why don't you look at the three articles I've written on this question?\" He has a great ability to condense hundreds of years of literary discussion into three hours a week, and if you pay attention, you will find that most of his comments are ironic and quite funny, but perhaps only an enthusiastic student will grasp the humor. If you don't pay attention, this course and every other you take in your life will seem boring and dry. No one who isn't genuinely interested in this material should take this course, because it is quite demanding. For each author you will have to read 600-1000 lines of text, oftentimes very difficult lines at that. \nThe course gives one a good grounding in the best known Latin authors, and Zetzel makes his lectures as deep as possible, considering the vast breadth of the subject. To mitigate the difficulty of the course, he drops a third of the quizzes, which is a godsend, and is a nice grader - he doesn't look for a perfect translation on a quiz, just firm evidence that you read the assignment. Prof. Zetzel may be something of an acquired taste, but he is a kind, witty, and renowned scholar. The lectures are a lot more serious and focused that Williams' in Empire, but the grading is worlds kinder.\nWorkload:\nMinimal for a course of this kind. Long weekly readings, 9-10 quizzes (-3 drops), a tiny paper of 3-5 pages (compare Williams' 12-20 pages), and three hours of witty lectures per week.\n"
        },
        {
            "course_name": "Latin Literature of the Republic",
            "review_date": "January 07, 2005",
            "review_content": "\nHe's a nice guy, WAY boring lecturer, knows SO much. I really regret not going to his office hours earlier in the term because he's really interesting and useful to speak with. But his lectures are really really dry. Given that this is a ridiculously demanding course required of Majors in the Classics, count your lucky stars that he's a forgiving grader. \nNext term in Latin of the Empire, you won't be so lucky...\nWorkload:\nquiz almost every week. one paper. exam is standard.\n"
        },
        {
            "course_name": "Ancient Law",
            "review_date": "June 23, 2004",
            "review_content": "\nProfessor Zetzel managed to take subject matter that's often dreaded by those bludgeoned through it as \"comparative law\" in law schools (or so I'm told by my sister, who was simultaneously taking a notionally similar course in the law school at another university) and bring it to life by demonstrating its integral place in the civilizations of ancient Greece and Rome, and connecting it to natural law theory.\nAs noted by reviewers of his CC sections, Professor Zetzel clearly knows far, far more about ancient civilization and the context of the subject at hand than he's able to display in any one class; yet, remarkably, he's entirely willing to answer questions with \"I don't know\" if he doesn't know the answer, which is of course entirely possible when one is discussing minutae of legal principles on the basis of garbled legal speeches from millenia past.\nTo be honest, like many others I signed up for this course because it had \"law\" in the title and I think, eventually, I'm headed to law school.  But, like most of the folks who showed up for the first two classes, I stayed -- though Zetzel's expectations are high and his method rigorous.  Will a grounding in natural law theory and an elementary grasp of how comparative law works get me into law school or serve me well as a lawyer?  I have absolutely no idea; probably not, if I had to guess.  But I would not have missed learning these subjects from Professor Zetzel for anything; he's just that good a teacher.\n\nWorkload:\nPlenty of reading.  Take good notes; he tends to formulate exam questions that just beg for responses trawled in from seemingly offhand comments in the middle of his lectures.  The final paper required an unusual analytic method, but was not too hard.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 16, 2002",
            "review_content": "\nProf. Zetzel is, hands down, the most incisive and intelligent Core teacher I've had. The classes ARE very structured, but he's always open to what students say, and always prepared to take their opinion seriously. Beware, though -- if he finds your opinion ridiculous, or not well-thought-out, he'll make it known with a sharp and witty remark. He's an amazing lecturer, and knows much more than he says he does about the authors and the books of the CC curriculum. I come away from every class feeling like I've truly learned something from our discussion/lecture, instead of feeling like I've wasted two hours in a stagnant student discussion that says absolutely nothing intelligent about the book. Take this class with Prof. Zetzel, if you can -- you'll have much more respect for the Core after you do.\nWorkload:\n10 short responses (not graded), 2 6-pg papers, a midterm & final (he's an easy grader, too!)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nZetzel is head of the CC department and also a professor in the Classics department. He's a very knowledgable person and really really enjoys the CC reading, (as the head, I suppose, he chooses what he likes). His class is well-organized, in that he usually begins by taking opinions from the class and then goes on to give background on the readings and some of the common interpretations of the texts. This class is too well-structured to allow for discussions outside the relevent CC reading...you won't find anyone successfully relating what happened to them at a frat party to Hume, as Zetzel swiftly changes the direction of the conversation. As a grader, Zetzel is very fair.\nWorkload:\nThere are 2-3 essays a semester, with the early ones counting less than the later ones, a midterm and a final. Nothing out of the ordinary, and Zetzel is a fair grader, very few students complain about the grades they receive.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nExtraordinarily knowledgable and yet very likable. Very fair grader. As the chair of CC, he's really excited about the class and has high hopes for the online bulletin board he sets up at the beginning of the semester, though I ended up being the only student who wrote something on the web. He's a CC professor worth switching section for - that was what I did anyway.\nWorkload:\n3 papers, 10 short responses, midterm w/ id's and final w/ id's and 2 essays\n"
        }
    ]
}