{
    "prof_info": [
        {
            "prof_name": "Valentina Nocentini",
            "prof_id": 5249,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Italian II",
            "review_date": "March 28, 2011",
            "review_content": "\nContrary to what the review below says - Valentina is beyond decent, she's 100% incredible. I took 4 years of Italian in high school and even with that background I still felt like I learned more in one semester than all of those 4 years combined. First of all, the atmosphere in her classroom is so conducive to learning because of the \"no-speaking-English\" rule, which, especially with a native, is exactly the kind of practice you need for fluency. And practically every day class would reach a point where I was nearly crying with laughter because of her wild mannerisms and/or jokes, basically she's just freakin' adorable. Not to mention her hilarious lack of computer skills that she admits, a huge accomplishment for her was finally making a facebook\nClass discussions work very well, in my opinion, because once we finish reading an article or watching a short clip online she'll ask a few questions to get the discussion going and once people start talking she just let's us discuss/debate among ourselves (which is nice - we can give her a break from lecturing in order to hold interesting conversations) while she stands there, \"interrupting\" only if we need help with some words; I can't think of any instance where she purposefully cut off a discussion with a good flow - she WANTS us to contribute and express our thoughts as much as possible. She's literally bubbling over with so much excitement and passion for Italian that translates into everyone wanting to learn and waiting to see what she'll come up with next. \nShe never graded harshly or put anything on the quizzes/midterm/final that we were already abundantly prepared for. Valentina always gave really good, thorough answers to any question asked and would take plenty of time to make sure we understood the material. \nAbout Valentina playing favorites, it's essentially bullshit - she loves everyone! It is a language class, so yes, she appreciates participation and proficiency, but that doesn't make her at all less likely to like those who don't contribute as much. \nShe's amazing and her class is amazing - get your ass in her class now. \nWorkload:\nextremely doable; a quiz every two weeks or so that she more than prepares you for, about six 250-300 word compositions (she's not at all picky on your topic as long as it generally relates to the theme or article we've discussed in class), maybe 6 total very short exercises from the workbook over the entire semester that aren't graded, and 1 midterm and 1 final that are essentially just long quizzes (that she, again, prepares you well for). \n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 22, 2011",
            "review_content": "\nValentina is a decent teacher in her own way--however, her and my ways did not mesh well and I think there are a couple broad reasons for that that will apply to others as well. Her only main flaw is that she can be a bit short and snippy, but in Italian, or as far as I know any language class, that's a BIG problem! The whole point of the small seminar class is discussion, and her attitude stunted the discussion potential of students greatly. One annoying aspect of this is that in the rare times that a spontaneous discussion actually got going in the class, it would usually be a tangent branching from the main topic (for example, discussing an article about feminism in 50's Italy launched a much more involved discussion of feminism in modern Iran and France) and instead of encouraging this, Valentina would cut it off so we could \"get back on topic.\" Sigh. In my opinion, those moments that people actually used the language were the priority. \nAlso concerning \"using the language,\" another of me pet peeves with her is that she taught most of the class in Italian, but at the end when assigning homework, she'd switch to English. Homework assignments required only basic words and concepts--we all know how to understand \"read page 50\" in Italian--and hey, if we hadn't before, now we never would, since she for some reason would stop using the language we were there to be learning. \nThere was also a weird almost-favoritism in her classes. I think without consciously meaning to, she ended up seeming to always pick on the same people over again (people who were not themselves dying to be picked on). I think she disliked me, as she would always call on anyone else rather than me unless my hand was the only one raised, but that's less relevant. There was one guy who she absolutely *loved*--he could do no wrong, and I swear she *giggled* whenever she talked to him. It was strange. \nHer attitude in compositions was that we should stick to the basic grammatical structures that we knew well, which was disappointing to me because while I can understand the importance of forming a good foundation grammatically, I wish she had encouraged us to push the envelope of our grasp of the written language. \nShe is not a harsh grader. She's not a monster. But she does have the above shortcomings, and those were enough for me to have had enough. \nWorkload:\nQuizzes bi-weekly or so that review straightforward concepts (not too hard); a handful of 30 word written compositions that, if you write in simple sentences and check for spelling and such, you will get good grades on; exercises from the workbook that once again, are doable. Midterm and final--midterm is basically just another quiz, final is longer but not too scary. \n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "May 15, 2010",
            "review_content": "\nYou will fall in love with Valentina because she is Italian to the core: she's hilarious, gregarious, and relentlessly searches for a good time in every class session.  She cackles with laughter and holds back no emotion in class, and her openness is delightful. When she teaches, you feel more like you're being won over by someone who wants to be your friend than being lectured at. No one is more approachable than Valentina: be honest and respectful and put in a genuine effort (most of the time) and she'll love you forever; demonstrate that you're apathetic or decidedly uninterested in Italian and things will get tense. She's an easy grader and teaches clearly enough. \nIf you have any sense of humor, Valentina's class will quickly and surely become your favorite.\nWorkload:\nAverage (for elementary language courses). \n"
        }
    ]
}