{
    "prof_info": [
        {
            "prof_name": "Robert Hanning",
            "prof_id": 432,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Race and Racism",
            "review_date": "April 26, 2005",
            "review_content": "\nIt's an okay class. He wants you to learn the books, or at least read every single detail, so that you can participate in his long winded discussions of the plot. The only problem that I have with him is that he says toward the beginning of the class that \"there is no such thing as race\". This is very true on a scientific level. But then why does he continue to separate the class into four units based on these non-existent \"races\" (African, Native American, Asian and Latino)? I think he needs to reevaluate some of his comments in class sometimes also.\n\nWorkload:\ntwo 10-12 page papers (you can either write the whole thing on one topic or do a collection of journal entries) and one take home final. no midterm.\n"
        },
        {
            "course_name": "Race and Racism",
            "review_date": "December 30, 2004",
            "review_content": "\nThis class I never showed up to. Unfortunately b/c this professor is extraordinarily knowledgeable. There is a fair amount of reading, but low work load. Two 10-12 page responses and then a take-home final of 12 pgs.Prof. Hanning really appreciates the comments of the students and he will grade you higher if you participate. Class is basically listening to him comment on the novel, so the class is useless if you don't read the books. Recommend the class though if you want an easy class you don't have to always attend, unless you want that A.\nWorkload:\nFor the two papers you can choose to do notebooks where you comment 2 pgs on each book you read until that point. Then the second you can write a 10 pg paper or choose to do the notebook again where you comment on an issue in many books, sommatically 12 pgs. Not too heavy, just don't leave until last minute.\n"
        },
        {
            "course_name": "Race and Racism",
            "review_date": "August 02, 2003",
            "review_content": "\nI agree with a previous poster that this class is an embarrassment. While one poster thought Hanning did well at tying our discussions to contemporary events, I felt quite the opposite; his chronology of american racism (organized into 4 basic categories...African, Indian, Asian, Hispanic) was trite and left many groups ignored.  I also agree that class lectures were very dull with practically no analysis of literary technique.  Much time is wasted with the prof. asking questions about the plot that are so demeaning, you'd think they were rhetorical.  \nWorkload:\n2 10 page papers, and a take home final-- the questions are uninspired but he makes you discuss enough works that they are easy to crank out.  Beware the 2nd paper and 10page takehome are due within a week of each other. Easy grading though. \n"
        },
        {
            "course_name": "Race and Racism",
            "review_date": "May 17, 2003",
            "review_content": "\nThis class is an embarrassment.  Given the interesting subject matter, the syllabus could have been potentially great.  However, Hanning treats racism like a novelty and it shows in the way he organizes the syllabus as well as the course in general.  Class lectures are painfully slow with little literary analysis and too much of Hanning's own curiosity over what this intriguing thing called 'racism' is.   Instead of treating the books as works of literature and analyzing the literary devices used, Hanning spouts off on historical events and makes tenuous linkages across books.  It doesn't help that he leads discussion as if none of the students have ever heard of racism.  His questions are elementary at best, and he nitpicks over irrelevant details.   Terrible class.\nWorkload:\nroughly a book a week; boring syllabus full of self-indulgent, self-loathing works; Two 10-12 page papers (topics decided by students); 8-10 page take-home final\n"
        },
        {
            "course_name": "Race and Racism",
            "review_date": "May 14, 2003",
            "review_content": "\nHe is a very thorough teacher in that he looks at the material very closely; however, he asks questions in class to which he already knows the answers. It is very difficult to answer questions which someone already has a set answer in their minds.\nHe encourages very close readings of the texts. He is very energized about the texts. I did not like the fact that we had all these papers and a take home final to do at the end of the term. I had to write like a 12 page final paper and then do a 10 page take home final exam at the end. I thought that was too much work for the end of the term.\nWorkload:\ntwo 10 page papers. A 10 page take home final exam.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 14, 2001",
            "review_content": "\nAlthough Prof. Hanning is clearly interested in the class and has a good working knowledge of the material he teaches, I found it difficult to get excited about the class. He tended to go off on long tangents that were only mildly interesting. Discussion was extremely limited, and by the end of the term a couple people literally slept through class (a seminar!) and most of the rest of us just did our best to tune out. With all the Lit Hum teachers who don't even want to teach the class, you could to worse than Hanning, but you could also do better.\nWorkload:\nShort papers every other week on topic of your choice, midterm, final. Grading medium to easy.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 14, 2001",
            "review_content": "\nAlthough Prof. Hanning is clearly interested in the class and has a good working knowledge of the material he teaches, I found it difficult to get excited about the class. He tended to go off on long tangents that were only mildly interesting. Discussion was extremely limited, and by the end of the term a couple people literally slept through class (a seminar!) and most of the rest of us just did our best to tune out. With all the Lit Hum teachers who don't even want to teach the class, you could to worse than Hanning, but you could also do better.\nWorkload:\nShort papers every other week on topic of your choice, midterm, final. Grading medium to easy.\n"
        },
        {
            "course_name": "Race and Racism",
            "review_date": "December 31, 1999",
            "review_content": "\nHis class is above all boring. This prof. knows his material and deeply cares about it, but his cynic nature influences all of his lectures and add a negative tint to the class. Don't take a class taught by him at night or on a Thrus. - you'll be tempted to cut every time.\nWorkload:\n2 10 page papers\n"
        },
        {
            "course_name": "Race and Racism",
            "review_date": "December 31, 1999",
            "review_content": "\nProf Hanning is amazing - he is sincerely dedicated to this course, and it is clearly his baby that he has nurtured and loved through the years. The readings are all interesting and provocative, and he has thoughts on everything. At the beginning of every class, he keeps the literature and material tied to the present day by reading small exerpts from NYTimes articles and such. He genuinely cares about the thoughts and ideas of the students, and welcomes challenges and new insights on the material. Sometimes, it's easy to feel a little intimidated by his knowledge (he can start out saying one thing, and end up analyzing some amazing symbolism in a remote part of the book), but he really does embody all that I want out of a Columbia professor. He's brilliant, he has a great sense of humor, and he actually CARES about the students on a personal and academic level. This is one hell of a course and one hell of a professor.\nWorkload:\na lot of reading, but it is mostly in novel format, which makes it seem more bearable. two 10 page papers and a take-home final. he expects a lot of quality...definately not a class to blow off until the last minute. \n"
        }
    ]
}