{
    "prof_info": [
        {
            "prof_name": "Steven Chaikelson",
            "prof_id": 3344,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "New York Theatre",
            "review_date": "December 15, 2008",
            "review_content": "\nIf you want an opportunity to see a lot of plays at a very low price, take this class! It is one of those classes you could only enjoy at a college in the city. Steven is extremely friendly and approachable. The class, however, is about the business of theatre, not really the performances themselves, so for me they could be very tedious. However, if this interests you, Steven is very knowledgeable as was the TA, Abby. \nWorkload:\nAttendance at a play each week, very light reading, easy midterm paper/presentation and take-home final, weekly 2-page write-ups about theatrical performances.\n"
        },
        {
            "course_name": "New York Theatre",
            "review_date": "April 20, 2008",
            "review_content": "\nTake this class. Just DO IT.\nBut take the class when you are willing to give up an evening. It's certainly a fun class -- something you don't HAVE to take notes for because you won't be tested on anything he says in class. Attendance is mandatory, and so are all the plays. But it's totally worth it. What better way to fill your arts requirement than go see Spring Awakening? You see a play every week then do a write-up about it. We got awesome seats to a bunch of off-broadway shows, and overall, although the class takes a big chunk out of your Tuesday (or whatever), it's worth it.\n\nWorkload:\nA few articles that you don't have to read, a book -- read one -- a play, you should probably read that too -- a midterm on a director or something (group project) and a final that is a bunch of essays. don't worry -- it's take home and open book.\n"
        },
        {
            "course_name": "New York Theatre",
            "review_date": "February 04, 2008",
            "review_content": "\nAn awesome class for the adventurous. While the class had absolutely no academic reading and elementary school projects, it was made bearable by attending a Broadway/Off-Broadway or Off-Off Broadway show each week! While the 2 hour class seemed to drag on, I did end up learning a bit more about New York Theater (great for cocktail parties). Steven was very nice and easy to talk to outside of class. \nWorkload:\n- About 20 pages of reading per week (none of which is required or even discussed in class)\n- A midterm presentation and 10 page paper\n- A take-home final\n- Weekly 1 pg. reflections on the show\n"
        },
        {
            "course_name": "New York Theatre",
            "review_date": "January 15, 2008",
            "review_content": "\nTAKE THIS COURSE, it is one of the most enlightening courses I have taken at columbia!\nSteve is awesome, a very nice and understanding guy and he is also knows his stuff about theater. The course is structured, so you dont get any pointless lectures. You get to go to shows, which is the greatest part. It was the class that i looked forward to!\nDo your work, show up to class, and get an A\nWorkload:\nmidterm presentation and paper, light reading of newspaper articles, and a fair final. The final is based on your experiences in the theater and also on your reading, so if you did all of the reading it is very easy.\n"
        },
        {
            "course_name": "New York Theatre",
            "review_date": "December 25, 2007",
            "review_content": "\nI recommend this class more than I recommend fettucini alfredo, and I love fettucini alfredo. Not only do you get to see a show every week for an entire semester for a mere $130 (unless the stagehands strike like they did during my semester), but you get an impressive wealth of knowledge about the theatre industry and specifically how it works in New York. Of course, it helps that Professor Chaikelson is a working producer, because it opens doors for all kinds of learning experiences. We met with producers and stars of shows after seeing them for question-and-answer periods, and used actual marketing packets as class materials. \nBeware, though. Even though the class may officially meet Tuesdays from 5:10-11, about half the shows we saw were on different days, which could be a problem for some people's schedules. \nWorkload:\nWeekly readings, 2 books and 1 play to read (Though he doesn't discuss the books much in class, be sure to read at least one of them. It will come up on the final). A midterm project (a research paper and class presentation-\n-most people used powerpoint) and a take-home final with 3 3-5 page essays, one on an assigned book. \n"
        }
    ]
}