{
    "prof_info": [
        {
            "prof_name": "Sonia Ahsan",
            "prof_id": 3513,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "February 09, 2010",
            "review_content": "\nI had Sonia as a TA my first semester at Columbia, and have been comparing my other TAs to her since. Her passion for the field, her fascinating research, and her devotion to making sure every one of her students understands and does as well in the class as possible makes her the best TA I could imagine. Extremely helpful, understanding, compassionate, and will do anything possible to make sure that you succeed. \nThe lecture was confusing, and seemed less helpful than the weekly discussion sections. Her help and assistance made my first experience with Anthro invaluable, and made me have a passion for the field. Because of her, I will definitely take more Anthro classes in the future. Especially if she's TAing them. \nWorkload:\nMy section opted for each person to complete summaries on each of the works we read in class, and post them on Courseworks. If possible, suggest it for the final! Otherwise, nothing else besides the reading required for the class.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 12, 2009",
            "review_content": "\nThe most endearing quality of Sonia is her willingness to work extremely hard for her students. I missed class 3 times in the semester; once for Yom Kippur and twice because of a doctor's appointment. All 3 times I emailed Sonia for help and she not only emailed me her weekly discussion sheets but in addition to those, she typed out her notes from lecture and emailed me those too, and then even met with me each time to make sure I understood what I had missed. She also gave detailed comments on my midterm and even looked at multiple drafts for the essays and gave substantial comments on each of my drafts. Sonia is really an awesome TA: kind, compassionate, very approachable and extraordinarily nice who always went above and beyond her TA duties. She really helped me understand anthropology. I am a junior and am switching to an anthro. major because of Sonia.\nShe was really a blessing and went above and beyond her TA duties for her students. And the best thing was that she made it seem so easy. I had a great semester with a great TA, professor, and class. Sonia Ahsan is the most memorable TA I have had at Columbia. \nWorkload:\nKinship chart and essay or a ritual essay (you have a choice). Midterm and Final. Very easy A if you attend lecture and discussion and attend the review sessions for the exams.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 16, 2008",
            "review_content": "\nSonia is the BEST TA I have had at Columbia. She is really amazing in the amount of work and effort that she puts in the class. And if you go to class and have grasped the basic premises of anthropology, you are sure to get an A. What a beautiful person and instructor. Puts tears in my eyes! Definitely try to take a class with her as a TA, especially if you are considering anthropology major.\nWorkload:\nnot too bad. midterm/final and one paper. all very doable\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 10, 2008",
            "review_content": "\nSonia Ahsan is a goddess amongst TAs.  In a class that makes little to no sense most of the time, she manages to clarify everything perfectly.  Every week she created question sheets that would address specific themes in the books we had to read and their implications for anthropology as a whole.  It would have been near impossible to understand the class if she weren't the best TA ever.  She was always accessible and understood that this was not our only class.  If we were unable to make it to review sessions, she was more than willing to post notes on CourseWorks, so we could always study from them.  She is an incredibly fair grader who genuinely wants to teach in a way that helps her students learn.  And we do learn.  Students in other TAs sections often ask Sonia's students for notes from section and to help clarify material.  \nWorkload:\nno extra work for discussion.  all she asks is that some people participate.\n"
        }
    ]
}