{
    "prof_info": [
        {
            "prof_name": "Tavius Cheatham",
            "prof_id": 1574,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Indoor Soccer",
            "review_date": "December 14, 2008",
            "review_content": "\nTavius is a sweetheart. He made everyone feel comfortable, which made for fun games of competitive but light-hearted soccer. Fun course!\nWorkload:\nyou can miss quite a few classes and receive full credit!\n"
        },
        {
            "course_name": "weight training",
            "review_date": "May 21, 2008",
            "review_content": "\nTaves is awesome! so laid back, chill, and downright cool. \nwhen we got restless from the beautiful weather, he became easily convinced to take us to the park. as far as weight training goes, he does as actually teach, and is very knowledgeable. all in all, i had a good time.\n\nWorkload:\neasy, duh.\n"
        },
        {
            "course_name": "Volleyball",
            "review_date": "January 26, 2007",
            "review_content": "\nHe's nice and laid-back and we got to go outside to Riverside Park when it was nice.  His class is organized to teach us new techniques.  He tries to help you perfect your technique, but he's not anal about anything.  Really chill guy, good class.  \n"
        },
        {
            "course_name": "Volleyball",
            "review_date": "December 11, 2006",
            "review_content": "\nTavius is awesome! He is so nice and makes sure we have a lot of fun. everyone's volleyball skills improved and he varied the lessons to make sure we were doing new things! take gym with this man!\n"
        },
        {
            "course_name": "Lacrosse",
            "review_date": "September 01, 2003",
            "review_content": "\nTavius really loves lacrosse, and makes it seem easy and fun.  The drills were different every time, never repetitive, and he plays music while you warm up.  I even took this class after I fulfilled the PE requirement.  Tavius rocks! \nWorkload:\nRun around throwing a ball from a stick; attempt to throw ball into net\n"
        },
        {
            "course_name": "Weight training (Barnard)",
            "review_date": "April 22, 2003",
            "review_content": "\nSo great!  Tavius is really young and down to earth and actually manages to make us insecure Barnard girls feel comfortable.  He's funny and laid back and knows his stuff when it comes to working out.\nWorkload:\nJust show up.\n"
        }
    ]
}