{
    "prof_info": [
        {
            "prof_name": "Sheri Berman",
            "prof_id": 3306,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium: States, Nations, Democracy",
            "review_date": "January 15, 2015",
            "review_content": "\nProfessor Berman is great. She's very knowledgable (she's brilliant). If you do your readings you should be able to keep up with the class discussions. Class was always interesting and she's amazingly kind -- when my laptop broke and lost a huge paper for her class she did everything she could to help. Take a class with her, you won't regret it! \nWorkload:\n2 Take Home Midterm Essays -- 20% each\n1 30 Page Colloquium Essay -- 40%\nClass Participation -- 20% \n\n"
        },
        {
            "course_name": "Democracy and Dictatorship ",
            "review_date": "December 10, 2014",
            "review_content": "\nI never write CULPA reviews but this course is too good to pass up. I'm sitting here, grieving over a tedious take home final for this course, but I've truly never been so inspired by a course. Professor Berman is extremely well versed in her field and, unlike other brilliant professors, is equally as good at communicating her knowledge. If you take this class GO TO LECTURE. Without Berman's lectures I would not have walked away from this class with the fully developed picture of the history of Europe that I have now.\nWorkload:\nLots of reading - necessary at some point but I always just read them as I did the exams\n2 take home midterms - very difficult/impossible to get an A but not too hard to get a B+ (each consists of three short essays)\n1 take home final - same structure as midterms but more broad questions, 4 essays\n"
        },
        {
            "course_name": "Democracy and Dictatorship ",
            "review_date": "August 14, 2011",
            "review_content": "\nI took this class a couple of years ago and really liked it.  It really changed the way I thought about poli sci.  Most of the other classes I took were fairly dry and narrow, but this one really taught me about a subject I thought I already knew.  I came into the class thinking I knew a lot about European history already, but it really made me think again about topics I thought I had covered.  The lectures were very clear and very interesting and unlike many other courses really worked with the readings in interesting ways.  The lectures didn't go over the readings but made you think about their different perspectives and strengths and weaknesses.  By the end of the class I understood more about how good debates were structured and how political scientists differed from historians.  I also had a much better understanding of European history and how it was similar to and different from the histories of other parts of the world.  The big patterns of European politics made sense to me and I was able to use that in other classes.  The class made me want to take more political science courses and more European classes.  I would strongly recommend it.\nWorkload:\nAbove average but reasonable.  Take home exams.\n"
        },
        {
            "course_name": "Democracy and Dictatorship ",
            "review_date": "February 16, 2011",
            "review_content": "\nYou should take this class.  Here's why:\nFirst, the lectures are incredibly clear and well organized. I never had to guess what the point was.\nSecond, the lectures were actually entertaining.  I didn't appreciate it at first, but Berman really tried hard to bring the history to life.  A few weeks into the course I began to eagerly look forward to the next installment in the \"story.\"\nThird, you will learn an incredible amount about European history and politics, even if you think you already know a lot about the subject.\nFourth, Berman does a great job linking the history to both poli sci and theories about democracy in other parts of the world.\nSo, overall, awesome class.\nWorkload:\nFairly heavy.  More than average reading, take home exams and final are fairly harshly graded.\n"
        },
        {
            "course_name": "Democracy and Dictatorship ",
            "review_date": "January 26, 2011",
            "review_content": "\nThis was a great class.  The lectures were consistently interesting and unlike in most classes, the lectures added up to a larger whole.  Professor Berman managed to tell the story of Europe history in a way that made sense even though she was covering hundreds of years.  She related the histories of different countries together and also managed to make clear the lessons European history had for countries in other parts of the world.  The class was fairly heavy on history, but also did a great job explaining debates in political science about democratization and consolidation.  So, I learned a lot about the poli sci theory lit. as well as about European history.  The readings were fairly heavy, but usually interesting and the study questions were really helpful.  The professor was also very accessible and coming to her office hours was great.\nWorkload:\nFairly heavy but fair.  Take home exams and a final.\n"
        },
        {
            "course_name": "Making Democracy Work",
            "review_date": "May 04, 2010",
            "review_content": "\nI don't understand the previous review of this class at all. I took this class and had several friends in it, and we all thought it was among the best we had ever taken.  The professor didn't lecture at all, the class essentially consisted of some the best discussions and debates I have had.  Sure, the professor led the discussions and clearly pointed us in certain directions, but she hardly spoke at us and tried to include everyone in the discussions.  More generally, she was incredibly open and tried to steer the conversation towards our own interests.  The readings were a great mix of theoretical and practical; almost every week there was something from the news or popular press and we always tried to connect what we were reading to topics of the day.\nReally, if you want an incredibly interesting class with a dynamic and friendly prof, take this colloquium.\nWorkload:\nOK, fairly heavy.  Probably more reading than the average colloquium (but more interesting), two short papers and a long research paper.\n"
        },
        {
            "course_name": "Democracy and Dictatorship ",
            "review_date": "April 30, 2010",
            "review_content": "\nI love this class. I think the material is so interesting and the Professor Berman presents it in such an interesting way. She gives great insight into european history and politics. The readings are really interesting and you don't have to do them all, just pick ones that are relevant to your question. My one critique is that Berman just talks too fast. this seems unimportant, but she says really profound things at such a speed it's hard to get them down!\nHowever, my TA told me that she does not give A's unless the student writes like a grad-student. this is just ridiculous criteria. Something to be weary of..\nWorkload:\n2 take home exams- 3 questions 3 pages each; final take home exam 4 questions 3 pages each. \n"
        },
        {
            "course_name": "Making Democracy Work",
            "review_date": "December 31, 2009",
            "review_content": "\nAs a senior political science major, I found this class absolutely terrible. The readings up until the last 2 weeks were incredibly dry and theoretical. I understand that a foundational basis is needed to discuss the concept of democracy promotion, but that foundation should not be re-created in an upper level seminar. As juniors and seniors, the basic theories should already be known--- and if not, a brief two or three week review should suffice. It's sad though because the concept of the class and the potential is so great, based on the subject matter and relevance.\nFurthermore, the professor is awful. She chooses favorites right off the bat, as if we are in the fifth grade and does not allow for open thinking or opinions contrary to hers. She is very defensive and unwilling to really engage with students who have different viewpoints. \nLastly, this class does not feel like a seminar. During an hour and fifty minute period, perhaps the final ten minutes are allotted for a minimal question and answer session. Otherwise, the professor's loud and unbearable voice is teaching AT you. \nThis is definitely the worst class I have ever taken as an undergraduate.\nWorkload:\nYou can get by without doing much. One in-class presentation on a newspaper article, two papers (4 pages each, and harshly graded) and a final 25 pg paper. \n"
        },
        {
            "course_name": "Democracy and Dictatorship ",
            "review_date": "December 14, 2009",
            "review_content": "\nI also disagree with some of the previous reviews.  I thought this was a great class.  It was a perfect mix of comparative politics and European history.  The professors lectures were interesting and informative and although the class moved fast and there was a lot of info to absorb, overall themes were clear and re-appeared constantly.  In addition, Berman also did a great job making see the relevance of European history for contemporary cases--something I hadn't expected when I started the course.  I also found the sections really helped me organize and understand the material, but a lot of people didn't make use of them or the study guides, questions, etc.  \nBottom line: this a great class for anyone interested in an intro to comparative politics, the development of democracy or European political history.\nWorkload:\nAbove average but reasonable.  The readings were more interesting than in most classes.  The tests were hard but again not ridiculous if you do the readings and attend lectures.\n"
        },
        {
            "course_name": "Democracy and Dictatorship ",
            "review_date": "July 07, 2009",
            "review_content": "\nI think this was a great course.  I learned so much.   The professors lectures were well organized and super informative.  Sure, there was a lot of history, but she let us know that up front and it was all related to the course's larger themes.  I found all the lecture notes, power points and reading guides to be big helps, but I got the impression a lot of people didn't use them.  I would strongly recommend this class to anyone interested in the European politics, history or the development of democracy.   \nWorkload:\nThe workload was hard but fair.\n"
        },
        {
            "course_name": "Democracy and Dictatorship ",
            "review_date": "May 15, 2009",
            "review_content": "\nUgh. Like the reviewer before me, I wish I had dropped this class. Absolutely painful. Major complaints:\n1) The structure of the course is horrible - learn the history of a country every class?? The shear number of countries we discussed prevented us from really learning about any one of them. \n2) A quiz - memorize 200 terms. I am not in high school and neither are you. Pathetic, honestly. I didn't go to Columbia to develop my memorization skills. I went to learn how to think critically and analytically. You don't do anything thinking in this class.\n3) 3 in class exams?? How about a paper or two instead? Again, this is not high school modern Euro....\nI am a graduating senior in the college. polisci major. This class was the worst class I have taken during my undergraduate career. Highly frustrating.\nReally, I would just say to stay away from comparative politics in general - it's too stale. The fresh faces in the American and International politics departments are too inspiring and motivating to miss!!! \n\nWorkload:\nMedium - high....?\n"
        },
        {
            "course_name": "Democracy and Dictatorship ",
            "review_date": "May 10, 2009",
            "review_content": "\nI wish I had dropped this class. Democracy and Dictatorship was just a superficial survey of European history, with very little analysis at all -- except when it came to the exams. There was far too much reading assigned, and the lectures were simplistic overviews accompanied by PowerPoints that would be better suited for a tenth grade history class. Section was actually helpful. The TA's were pretty good, except for Julia (who isn't TA'ing after this year), who once forgot to show up to class even though she had all of the blue books and quizzes. We had to reschedule it, which was a pain, and one that you're paying 50,000 a year for.\nBerman has some sort of problem with Columbia's grading system (she's Barnard), so the highest you can get is an A (in a lecture of over 100 people). Consider it deflation of half a grade. And, last of all, Berman's strident voice (masking a harsh Brooklyn accent, if I'm not mistaken) will make lecture painful.\nWorkload:\nRidiculous amounts of reading. Two midterms, a \"quiz,\" weekly discussion section, a massive final.\n"
        },
        {
            "course_name": "Democracy and Dictatorship ",
            "review_date": "February 12, 2009",
            "review_content": "\nA terrible disappointment. Reads from her prepared notes and has a voice like bad brakes. Her lectures are scattered and bounce back and forth between dates and significant events - for no apparent reason other than to make things confusing. The only time she stops reading from her notes is when she reads from the lecture slides. Class would be no different if a high school student were reading her notes. Stay Away! \nWorkload:\n2 essay tests, one quiz.\n"
        },
        {
            "course_name": "Making Democracy Work",
            "review_date": "November 14, 2007",
            "review_content": "\nHighly recommended.  Making Democracy Work was a really thought-provoking seminar, and I felt like I learned a lot even though it was more laid-back (in terms of amount of reading) then the other colloquium I took.  We had four three-page essays due twice throughout the semester (so two were due one day, two due another), and at the end you write a policy review, max 25 pages, on a country with an unconsolidated democracy, recommending whether or not the us should intervene.  You do not get that much guidance on this paper, which was intimidating for me, but it is really not as bad at as it sounds.\nAs a thesis advisor I like her a lot too.  Basically, she gives good feedback, and she is very good at leading groups in discussion - there were only eight of us, but there were no awkward silences or anything.  I presume she will be a good lecturer too - very organized, personable, and smart!\nWorkload:\nMedium.  The colloquium is a lot easier than International Security with Marten, and more interesting, I think.  The thesis seminar is pretty standard.\n"
        }
    ]
}