{
    "prof_info": [
        {
            "prof_name": "Resit Canbeyli",
            "prof_id": 2586,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "W2450 Behavioral Neuroscience",
            "review_date": "August 12, 2009",
            "review_content": "\nIf you are looking for an interactive professor who comes up with creative teaching methods to help students better understand the subject at hand... keep looking!  I took this course during a summer session, and each class was a 3 hour lecture crammed with material, which NEVER included a scrap of audio-visual aid (weird for a science class, right?).  Sometimes he will draw a picture of the board and tell us there is a better one in the book, and often he will sprinkle the board with various names and terms (I think for spelling).  \"Is this clear by the way?\" becomes a common theme (just nod and read the textbook).  Your knowledge is assessed on 3 exams, which are quite difficult and require loads of memorization.  Several instances have convinced me that he is also a nit-picky grader.  Prior knowledge of the subject will make it much easier to get a good grade in this class.  I wish I had a different professor :(\nWorkload:\n3 exams based largely on the reading\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "June 28, 2009",
            "review_content": "\n  I would never take this class again. Ever! Too bad it's a summer session and students have only 4 days to withdraw (if you want your money back). When the class started there were 43 people in the class. After the second midterm only 23-25 were left. I personally know people that went and withdrew(and they lost their money) after the second midterm. \n  He is a very very harsh grader. You have to memorize(\"know it by heart\"- \"I will wake you up in the middle of the night and you report me all the learned material in a timely manner with your eyes closed\" kind of memorization). His questions in the exams are not clear. And..here we go..students love that...: He DOES tries to trick you! He even admits that. When he'd go over the exam in class he's say with a vicious smile on his face :\"Oh, yeah,that was a tricky one!\". \n  Another thing about exams is he only gives you 70 mins but the amount of \"in-writing\" that you have to put on the paper is enormous(1 question: full-page essay; 4 questions: half-a-page essays(he gives you the same questions as for a question where you have to write a full-page essay, BUT this time you have to package all the details into half-a-page.That is very hard to do and sometimes is impossible. And don't forget he is a harsh grade and he will take a couple of points off. He might write : \"not clear\"(even if you covered all the definitions and examples correctly but only wrote 4 sentences on an experiment); one diagram; page and a half of matching,true/false and \"come up with a definition when you read this definition\"(that is so stupid because there is so many definitions that you can come up with if he'd give you a word \"language\" for example. IF YOU ARE HUMAN YOU DO NOT HAVE ENOUGH TIME TO WRITE(FORGET ABOUT THINK) ALL THIS. I have tried. I was writing as a maniac(I actually even was training myself to write fast at home for an hour before an exam) and I did not stop to think about questions for a long time(I had no fun in June because I was only studying for Psych class and I forgot how the Sun looks like)  I still did not have enough time to finish to read true/false,match and \"come up with definition\" questions. Many people got in the low 50's after the first exam because they were so thrown off by the pace. \n  He is old and I'm not sure if he even knows how to use a computer. His ancient method of teaching without PowerPoints,handouts,ect. He'd sometimes write words(definitions) on the board. His handwriting is horrible. I had to come up and ask him to spell them later. He never posted grades online and when people were asking him what is the curve, the point averge on the exam, or how many points exactly is \"A\" he never gave clear answers. Why?! Because he can care less.He never did the curve. He doesn't know how to do it! He doesn't even know how to use CourseWorks!\n  His accent is ridiculous and he is very soft-spoken. Plus, he paces back and forth all the time from one end of the class to the other. As an example, one time he was talking about an experiment and I though he was talking about sharks. I was sitting there taking notes but it wasnt making any sense..then I realized that the word \"shark\" supposed to be \"shock\". He mumbles a lot. Actually, wait, that is the way he talks!\n  He has no office hours. And when you tried to ask him questions after the lecture he'd throw something at you and always make it look like that he's on a hurry and have to ran somewhere. His lectures were not helpful AT ALL. All the material that he gave us was really inconsistent with the book material and the review list that he gave up before an exam. I spent all my time online trying to clarify the material. \n  Sometimes I think that he has some kind of agenda to fail us all. He really doesn't care how you would do and what grade you'd get. After all, he's only here for the summer to make extra money and then he'll leave to Turkey to teach at his University and work in his lab. And you?! You will still be living in NYC and get a \"B-\" for all the hard work that you did with a ruined GPA.\nWorkload:\n3 exams. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "June 07, 2008",
            "review_content": "\nHonestly, if you are looking to add an A to your transcript, please take take his class. Exams are very reflective of the material presented in lecture. He presents some of the exam questions in a rather challenging way, but for the most part you will find the answers obvious and the essays exactly what you expected. Dr. Canbeyli is also incredibly kind and helpful, so don't be shy to ask him questions. If anyone is reading this & thinking about coming to the Columbia summer session, you will have plenty of time for other things (i.e. fun) while taking his class. Make sure that you stay on top of the reading though. The class average was actually pretty low for each test, but I have a feeling that those who didn't succeed were habitually neglecting the work. You will enjoy this class!!!\nWorkload:\nVery low. Just keep up on reading and review your lecture notes before exams. There is an optional extra credit paper too, and this is graded easily and can only HELP your grade. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "August 08, 2007",
            "review_content": "\nProf. Canbeyli's (pronounced \"JAHN-BAY-LEE\") primary strength as a lecturer is, with a few exceptions, his deep knowledge of the material he teaches. He is quite adept at giving a two and a half hour lecture without straying from the main topic much or covering too much material too quickly. He provides many examples in class for the theories he discusses, and they genuinely helped to increase my understanding of them. \nHe is particularly knowledgeable about neuroscience and neuroanatomy, given his background as a chemical engineering major while an undergraduate at SEAS. His knowledge on this topic is occasionally stifling, however, as he often goes in to more detail than necessary (or at least more detail than the textbook does).\nToward the end of the course when the material starts dealing less and less with anatomy and more with social psychology and behavior, Professor Canbeyli acknowledges that he is not as well-read in those areas, and it certainly shows in his lectures. His weakest lectures by far were on the topic of linguistics, a weakness he had in common with the authors of the textbook.\nHis tests are quite comprehensive. My only criticism of them is that he stressed \"not memorizing, but understanding\" and yet tests were impossible to do well on without memorizing quite a lot of the material. We had three midterms and no final, and each one required you to know just about every aspect of the theories and terminology in detail in order to do well. Tests consisted of fill-in-the-blank (with no word bank, quite difficult), true or false, matching scientists to their discoveries, drawing diagrams, four short essays chosen from six options, and one long essay chosen from two options.\nThe only other complaint I can make is that he is a bit soft-spoken when lecturing. Sit close to the front if possible. On the whole though, a very well-paced course from a knowledgeable and engaging professor. Knowing everything I do now, I would sign up for this course again to fulfill the science requirement.\nWorkload:\nVery manageable: perhaps 40 pages of textbook reading over three chapters per test. His tests certainly require you to know the material backward and foreward, but he does provide a list of terms well before each test.\n"
        },
        {
            "course_name": "Behavioral Neuroscience",
            "review_date": "June 15, 2006",
            "review_content": "\nProf. Canbeyli is very prepared for the material that he is covering. I can't get over the fact that he can handle 3 hours of lecture without looking at his notes even once. He knows everything thoroughly, which makes this class highly recomendable. He is willing to explain into length everything that students don't understand. I regret the fact that he teaches only during the summer.\nWorkload:\nThe material requires serious consideration and if you are not familiar with it previously, it might be difficult. The exams usually are short essays based on comparison. He loves dates memorization.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "July 04, 2005",
            "review_content": "\nGreat class, professor takes the effort to engage the class in interesting concepts in psychology. Great class to take for the science requirement or to get a general understanding of what psychology is about\nWorkload:\n3 exams - kind of heavy but professor gives a review list on topics to study. optional paper worth 5 pts\n"
        }
    ]
}