{
    "prof_info": [
        {
            "prof_name": "Anne Diebel",
            "prof_id": 3558,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 22, 2015",
            "review_content": "\nAlthough Professor Diebel was very kind, approachable, and accommodating, I did not feel that her class was sufficiently critical or informative, especially in comparison to the wonderfully engaging and compelling section I switched into for my spring semester of Lit Hum. Professor Diebel is very open to any ideas presented in discussion, and often does not present much material herself. This is an okay strategy that regrettably resulted in an uncomfortable atmosphere: incompetent comments trailed to nowhere, with little explanatory or clarifying remarks by Diebel. Professor Diebel's comments on my papers were often puzzling--I sometimes asked rhetorical (i.e. complicated) questions at the end of my discussion papers, to which she would sometimes respond with flippant and unproductive answers unrelated to the questions I asked. Unlike my other Lit Hum section, Professor Diebel's did not take much time to focus on marginal characters or question the assumptions of \"the canon\" which, if cliché, is quite important and, as I learned in the spring, added ~immensely~ to my experience of the texts. \nOf course, I don't mean to demean Professor Diebel. Take this with a grain of salt, as you always should. Basically, this section is probably better than some, but it's not sensational and certainly not memorable.\n\nWorkload:\nStandard Lit Hum workload. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 17, 2015",
            "review_content": "\nProfessor Diebel is sincerely one of the best teachers I've had in my three years here (CC).  So good, that I felt compelled to write this review as a rising senior (maybe I'm getting nostalgic already).  \nFirst off, she was really great at balancing discussion and lecture.  You could tell she was smart and engaged enough in the material (unlike other professors I've had) to be able to actually respond to the momentum of a class extemporaneously and still fill it with articulate and thought-provoking points.  She's also incredibly approachable and just as smart outside of class, for office hours or after class.  She's super helpful with refining paper ideas or just extending the class discussion.   \nIn conclusion, the really bitter reviewer bellow was probably just sad that he or she didn't do well and get a professor who didn't care.\nWorkload:\nStandard for LitHum.  And quizzes, but I think a bunch of other LitHum's do that too.  Fair grader in my experience, but I'm an English major so I don't mind papers.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 26, 2015",
            "review_content": "\nI had professor Diebel for freshman year literature humanities and I have to say, she was one of the worst professors I've ever had. I've never written a review on here before, but I was so surprised to see that people gave her good reviews that I had to put in a comment. She doesn't say much of anything useful and seems to be on some sort of ego-boosting trip. As someone else mentioned, she'll always agree with people, even if they aren't saying much of anything worthwhile. Kids seem to participate just to get the grade (though this may be the same in other classes). She assigns a lot of work and pop quizzes and grades essays harshly, unless you go to her. She's one of those teachers that likes to have their ideas repeated back to them, and doesn't seem at all interested in letting you develop your own analysis. This is not a good professor for anyone who cares to get anything out of lithum. \nWorkload:\nA lot. Standard for most lit hum classes. At least she tries to break it down. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 26, 2014",
            "review_content": "\nAnne was probably one of the most approachable and kindest professors that I've ever had. She never tries to shove her ideas and analyses down your throat and is really enthusiastic about class participation and hearing about what everyone in the class is thinking. She also is really good about getting input from her class about what sorts of discussion formats work best with her students. She's really knowledgeable about all of the texts and is extremely well spoken and easy to understand. \nI personally think she's a rather fair grader. For essays, she gives you a lot of opportunities to either send in drafts, or meet her during office hours (which are really easy to take advantage of). If you take advantage of this and really take her edits to heart, an A is definitely possible. However, I learned the hard way that she takes word and page limits seriously (you don't want to get knocked down a letter grade for trying to go above and beyond).\nShe tries her best to split up up the reading in a manageable way because she really encourages her students to do the reading. Because of that she does do pop-reading quizzes. That being said, you can get away with sparknoting and shmooping the readings and still passing the quizzes (they're just plot based questions and like two quote ID's--nbd). \nHer midterms and finals are pretty basic (passage ID's, quotation analysis, a choice between three themes where you write an essay using three texts). Again, sparknotes and shmoop will get you through the class if you're not feeling super motivated. \nWorkload:\nPop-quizzes throughout the term (she drops the lowest 2 grades). 3 tumblr posts (she gives you deadlines to do these by, and you can definitely get away with doing one the day of, they're not a big deal). 3 papers ranging from 3-5 pages. A midterm and a final. \nUsually, her papers are worth more than the midterms and the final. I think the final paper was 25% but the final was only 15%. So if you put the time and effort into your essays, you'll be fine. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 29, 2014",
            "review_content": "\nI had Professor Diebel for Lit Hum this year, and she's basically incredible. She really encourages student participation and wants to hear people's opinions, and fosters a super comfortable class atmosphere. She also is an extremely fair grader and wants her students to do well and succeed. She's so nice, approachable, and easy to talk to. There seriously are not enough good things to say about her. I think my class pretty much wants to be her when we grow up haha. She's super funny and a brilliantly smart, compassionate person. I'm super bummed I won't be taught by her again. If you get her, you're in for an awesome year. She's basically the best. Seriously love her\nWorkload:\nFair workload and fair grading--two essays a semester, midterm, final, periodic reading quizzes, and some other miscellaneous assignments.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 23, 2013",
            "review_content": "\nAnne is so great! Love love love her! She's very nonthreatening, always encouraging her students to participate. Like no matter what you say, she'll probably agree with it (which yes can get frustrating.. sometime you're like, no literally that classmate was being blatantly dumb, but for the most part it's uplifting). She's readily accessible outside of class either at office hours or via email, responding to emails usually in 24 hours or less. A previous reviewer said her class was not an easy A. I kind of disagree. Like yes you will of course have to work for the grade you want, but compared to what I heard about other lit hum classes, anne's section sounded a lot easier. She splits up the readings and tries to make them as manageable as possible so her students actually try and read. That being said if you don't read you can get by by sparknoting and shmooping (ie I read very little second semester in her class and still got an A- as my final grade). She also has either a quiz or a 1 page reading response for each work you read-- the quizzes are superrr easy, literally 5 plot based questions that can be answered in a sentence or less, and the reading responses are straightforward and simple too (you can basically write a page about anything you found interesting or want to elaborate on in the book). Also she has you do 2, 250 word tumblr posts, but yeah those are mad basic too and you can probably wait till the last minute and pump them out in 30 mins or less. \nBasically in my opinion if you get anne as your professor you are one of the lucky ones. I found her class to be very easy and manageable. Don't switch out. Stay where you are. \nALSO THIS CLASS COMES WITH SNACK TIME SO LIKE DO YOU REALLY WANNA LEAVE?! NO NO YOU DO NOT. \nWorkload:\nReadings for each class. A quiz or reading response for each book. 2 written tumblr posts and 1 art post. 3 papers (the first was 3 pages, the second 3-4, the third 4-5) and yes i will admit she is a slightly harsh grader on the papers but if you email her your ideas or talk to her at office hours she will almost literally write the paper for you. she provides a plethora of ideas and information that are incredibly helpful. If you reach out and bounce ideas off her, you'll do just fine on the papers. A midterm and a final (both of which were worth very little in the final grade,, i think second semester the final was worth like 15%). so yeah yay anne!\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "May 03, 2013",
            "review_content": "\nAnne is a really nice person. She's young and has a great way of connecting with her students while still maintaining a professor/student relationship. Due to the general nature of LitHum, her classes do sometimes tend to get boring, but that's probably true of all LitHum sections. The one problem I really have with her is that she is a pretty harsh grader. She gives a lot of assignments and quizzes and really expects students to come prepared to class each day, so if you are looking for an easy A in LitHum this is definitely NOT the right section for you. That being said, she always makes time for students to meet with her outside of class before a paper, a test, or even just to discuss the books- this is one thing that I really appreciated about her. Overall, it was a pretty substantive and interesting class, but be forewarned that you'll actually need to do work.\nOn a side note, Anne made a snack schedule for each semester which consisted of one student bringing in snack for the class each day. This was always fun and helped to sort of bond the class together during our 5-minute breaks. It's always nice when college is sort of like Kindergarten.\nWorkload:\nAside from the readings, which you basically have to do in her class (and if not, you need to heavily SparkNote/Shmoop/talk to someone who read the books), she gives either a quiz or a written assignment (1 page response to a text) for every text that we cover. About 3 papers a semester, ranging from 3-5 pages per paper. One midterm and one final. Manageable, but expect to do work.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 25, 2010",
            "review_content": "\nAnne is a wonderful instructor.  She is able to make UWriting, with its many intrinsic flaws, a productive course for writers of all backgrounds and levels.  She is fun, understanding, and plainly intelligent.  She is also organized and committed to her work.  Everyone knows that UWriting has its problems, but the value of the course depends almost entirely on the teacher.  Anne makes it worthwhile. If you take advantage of her knowledge and advice, you will, without a doubt, improve as a writer and analytical thinker.  Whoever wrote that she is afraid of her students obviously needs to check his or her presumption a bit and realize that not everyone teaches by intimidation or rules the classroom with an iron fist.  Anne asks for and receives the respect of her students because she deserves it.  She will help students improve their understanding of grammar, style, academia in general, and the content of whatever it is she has selected for study - content being something often absent in UWriting classes due to the heavy focus on the process of writing.\nThe Core is all about instructors.  If you get Anne, be glad - you are one of the lucky ones.\nWorkload:\nStandard.  Assignments, even the more frustrating ones, ultimately proved useful and relevant to the topic at hand. No busy work. Fair grader, and she provides ample annotation so that you have a clear idea of how to improve for next time.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 13, 2009",
            "review_content": "\nAnne is awesome and makes UW survivable. She made my writing stronger by making suggestions that I wouldn't have thought about otherwise. I like how she conducts group discussions and despite her busy schedule she always makes time for E-mails and personal meetings. If you're worried about the fairness of the often subjective grading in UW, you needn't worry here. Anne definately notices when you work hard and when you take your writing seriously. If you have the space, definately take Anne's class.\nWorkload:\n4 essays with revisions. Not too bad.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 30, 2009",
            "review_content": "\nI loved Anne right from the start! She chose extremely interesting and uncommon texts and almost every one gave me something interesting to write about. Her comments on papers and in conferences were incredibly helpful, and even though I felt some of her in class exercises were corny and too \"9th grade english\", overall, she got to me to think at least a little bit more consciously about my writing, and to think about some interesting topics I hadn't explored before. She's also such a sweet person, and as far as UWriting teachers go, not an awful one to have.\nWorkload:\nThe standard readings and papers. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 18, 2008",
            "review_content": "\nLike most U.W. classes, thoroughly mediocre. I've been told that University Writing teachers fall into two categories: those who despise their students and those who are terrified of them; Anne Diebel falls squarely into the latter. She was extremely timid at the beginning of the semester; while this improved slightly as the course went on, even at the end of the year classes consisted mostly of awkward pauses interspersed with brief writing suggestions offered in a way that made me question whether she genuinely believed them herself.\nIt wasn't all bad---our class worked with much more interesting texts than anybody else I talked to, and the written feedback offered on the first two essays was extremely helpful (the quality of this feedback declined as she, like the rest of us, grew weary of the class).\nGrading was also quite lenient: as far as I could tell, anyone who could string together a complete sentence and advance any thesis more compelling than \"Lessig and Lethem talk about different things in their essays\" was guaranteed at least an A-.\nI don't know how many of these criticisms are really the fault of the UW curriculum rather than Ms. Diebel herself. The course sets its instructors up for failure by teaching at a level that is too low for most of the class and well over the heads of the few that never learned to write.\nIn conclusion, there are certainly worse UW sections to be in, and I'm still unconvinced that it gets any better. Even so, I refrain from recommending Anne Diebel simply because it would be unreasonable to describe my University Writing experience as positive.\nWorkload:\nThe standard UW progression: 4 essays of varying length, interspersed with a number of other brief writing exercises. Reading for the Conversation and Research essays was quite heavy, but most of the class didn't do all of it and nobody really noticed.\n"
        }
    ]
}