{
    "prof_info": [
        {
            "prof_name": "Sarah Hansen",
            "prof_id": 3343,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "C1500 General Chemistry Lab",
            "review_date": "December 22, 2016",
            "review_content": "\nProfessor Hansen's class is a lot of work. Before each weekly lecture, Professor Hansen would post videos that would \"cover\" the material that was to be gone over during lecture. The videos varied in length from a minute to over twenty and there would usually be four or five videos to watch. In lecture, there was usually a weekly quiz and then this period of 50 minutes where Professor Hansen would ask everyone to solve questions on material that was only covered in the assigned videos. The TA's were completely unhelpful during lecture and would usually respond to questions with \"didn't you watch the videos?\"\nExpect to put a lot of time into this class. With any section of gen chem lab expect to devote a few hours to writing your pre lab report, studying for the weekly quizzes, and actually going to a potentially four hour lab. However, if you're in Professor Hansen's section expect to double that. You are going to be responsible for most of the learning you do. Go to the help room, but don't expect to learn anything during lecture. \nWorkload:\nHeavy! Weekly quizzes, 1 midterm, 1 final. Weekly pre-lab write ups, sometimes accompanied by lab reports or notebook discussions. \n"
        },
        {
            "course_name": "General Chemistry Lab C1500",
            "review_date": "October 28, 2014",
            "review_content": "\nIt's impossible for Hansen to  possibly be any more in love with (as mentioned in another r view) her \"creation!\" She acts like it's everybody's only class, assigning ungodly amounts of work (useless, busy work) and expecting victims to treat chem lab like a part time job. You get out of lab just to be thrown into more lab work. \nMaybe if this class were not so redundant people would see the value in it.\nWorkload:\nHeavy. Prelabs are frustratingly, pointlessly lengthy. Report sheets and dry labs are frustratingly repeatative. Midterm and final are alright in my book.\nYou can easily get an A, but don't expect to have learned much and be prepared to tear hair out in sheer... Frustration over having to do such pointlessness.\n"
        },
        {
            "course_name": "C1500 General Chemistry Lab",
            "review_date": "October 27, 2014",
            "review_content": "\nWow. I don't know if Chem Lab changed radically over the past year or so, but I definitely didn't take the same class as those who gave it raving reviews, claiming they learned so much. I spoke to a lot of the people in my lab last semester as well and they agreed -- there was little to nothing redeeming about this course. It's designed so you feel like you're constantly thrown into its vicious, tedious cycle week after week and makes the semester drag on and on. Even as somebody who received an A in the class (it's not hard to), it felt like a COMPLETE waste of time doing so.\nSo. The vicious cycle: \n1) Go to lab lecture, which is basically just Sarah talking about stuff you've probably learned or will learn in General Chemistry. Be forced to \"work with the people around you\" in an attempt to make it engaging (it's not). Take a 15 minute quiz that, half the time will have a 70% average. Watch points get deducted over the most anal errors, thus making you feel like you're absolutely awful at chemistry (you're not that bad, stay strong, friend). \n2) They take attendance at the end, so guess what? You're not getting out of lecture. \n3) Go to lab. 3-4 hours of pain, depending on if Hansen wants to tack on EXTRA labs/lab stuff to make her class seem more legitimate and less like a high school chemistry lab. The room has poor air circulation, but somehow it's always a bit nippy, and the TAs are half snarky, half nice. Once you finish (YAYYYYY!) you get out of Havemeyer, your spirits raised... until you realize you have to do it again... but only after... \n4) Completing pre-lab (the most USELESS assignment ever, designed to force you to thoroughly read and copy down all the lab instructions... that have been altered by Hansen... and compare that to what's in the actual manual and write them all down). \n5) Completing report sheets, that you will inevitably lose points on somewhere. \n6) Dry lab! Because your time in the lab wasn't enough to convince you guys this class is taken [way too] seriously. \n7) Writing assignments. (...really?) \n8) Repeat for the next few months. \nI'd like to point out, all the work would be 100% fine in my books if it felt like it was reinforcing something, or clarifying my understanding of chemistry. But nope! It just felt like my time was getting sucked away from other classes and into this. I don't know what Hansen thinks, but this class is NOT her students' only class (nor, based on the conversations I've had with many, remotely close to their favorite). \nPrepare to have a sense of \"Ughhh, not again...\" overwhelm you each week.\nWorkload:\nThe work is easy... the amount is what's unbearable. \n-4 hours = pre-lab\n-2 hours = report sheets\n-1-2 hours = dry lab\n-1-2 hours = writing assignment\n1 Midterm, 1 Final, both alright.\n"
        },
        {
            "course_name": "C1500 General Chemistry Lab",
            "review_date": "December 13, 2010",
            "review_content": "\nBefore this class, I hadn't taken a Chemistry class in over three years and had forgotten absolutely everything I'd ever learned about the subject. Despite this handicap, I'm thrilled to say that I'm doing promisingly well in the class. Sarah and the TAs are the sole reasons for this. \nIn the weekly lecture, Sarah tended to rush through topics - probably to cater to the needs of the more advanced students that made up the majority of the class - which tended to be frustrating. However, she always made up for this by being an endlessly patient and fantastic teacher one-on-one. She was unfailingly happy to answer any questions I had. And I mean literally happy - she always had a smile on her face and made energetic gestures of emphasis when answering my questions. If I ever didn't understand, she would repeat what she said or find a new way to illustrate the concept. \nThe TAs for the course were surprisingly knowledgeable, understood my questions, and could communicate concepts very well (unlike the TAs in some other departments).\nSome extra information I wish I had known before taking this course: the weekly time commitment is quite a lot. You have one four-hour weekly chunk of time in lab as well as a one-hour weekly lecture. On top of this, you need to keep up for the weekly quizzes and do a weekly prelab and lab report.\nWorkload:\n1 weekly prelab (~2 hours of tedious copying), 1 weekly lab report (~3-4 hours of calculations and occasionally a 2-page essay), 1 weekly quiz (4 questions, 15 minutes), midterm (15 questions, multiple choice), final (30 questions, multiple choice)\n"
        },
        {
            "course_name": "C1500 General Chemistry Lab",
            "review_date": "April 12, 2010",
            "review_content": "\nHonestly, I am a little surprised at the last two reviews for this class.  Perhaps it was worse in previous years; I know that the course was modified in Fall 2009 when I took it, and I found it an enjoyable experience.\nFirst about the reports themselves.  You are required to basically copy the manual's introduction, materials, procedure, and data tables each week.  This takes a bit of time and seems tedious, but it allows you to get things done quickly in lab because you actually know what is going on.\nThe reports themselves are not so bad; for about half of them (there are 10 total) you have to write a 2-page discussion about the implications of the results and places for error, etc.  And of course you have to do some calculations and graphs.  Basically, if you are well-versed in general chemistry, these will be very straightforward (the manual also walks you through most concepts and equations).  In all, I found that this class took 5 hours a week outside of lab.\nThere was also the lectures and quizzes.  The concepts are mostly review of things learned in AP chem and Gen Chem, with a few new things here and there.  Sarah Hansen is very decent lecturer and is helpful if you have any questions.  The quizzes are 10-15 minutes each, about 4 easy questions to review what has been going on.  Sarah also posts study materials for these, which is exactly what you need to know.\nThe midterm and final are very similar to the quizzes, so just review them and you will do fine.  Overall, there was nothing stressful about this class - just put in a few hours a week writing the lab and review for the quizzes, and you should do fine.\nWorkload:\nWeekly quiz and lab report (about 5 hours a week), midterm, and final.\n"
        },
        {
            "course_name": "General Chemistry Lab C1500",
            "review_date": "November 04, 2009",
            "review_content": "\n    Worst experience I've ever had with a professor. I agree with the above review of the course overall--very tough and time consuming--my right hand hurt so much from writing lab reports that I actually tried using my left hand as much as possible. \n    Besides the course, though, I found Sarah to be threatening and pushy. She takes her creation (this course) too seriously and has complete disdain for anyone who has questions or concerns. She outright yelled at me on a couple of occasions--a situation I have never had with any other professor thus far.\n   As well, the TA I had was an undergraduate (I am a postbac) and I found the age and maturity gap very difficult to work with. They clearly have their own stuff to deal with and never return emails, even general questions. \nWorkload:\nHorrible. One lab report and quiz per week, however the report can take upwards of five hours if you're not very careful and thorough and the answers to the review problems are not in the book which forces you to deal with some TA's. I feel that it is possible to learn Chemistry without all this b.s. Take Chem 2507 if you can.  \n"
        },
        {
            "course_name": "G. Chem Lab ",
            "review_date": "December 25, 2007",
            "review_content": "\nThis is more a review of the class and less a review of the professor. \nThis class will make you rip every hair out of your head for 3 months, but is very rewarding at the end. \nThe nature of the class is to penalize for every tiny, insignificant error (sig figs, rounding, measurement-error agreement, badly labeled graphs, etc), which can turn an otherwise great lab report into a B or C. Until you learn to give them what they want, it feels like guesswork trying to predict what they are going to be picky about next, but in the end, you turn out very neat, organized, intelligent work. \nYou learn a ton of material, and acquire great confidence in a lab setting. \nRegarding the professor: The lectures are very fast and very worthwhile and are always on the next quiz. Sarah and Kim co-teach the class and both are hard to reach, but the TAs are usually very helpful. \nA word to the wise: This class is VERY competative because it is mostly a class of pre-meds and also your grade is based on standard deviations from the class mean, so everyone wants everyone else to fail. Not fun.\nWorkload:\nPretty tough. A lab report (about 3-4 hours of mindless work), quiz and pre-lab for each lab- 8 total. VERY difficult written final, decent practical final, great curves on most grades. \n"
        }
    ]
}