{
    "prof_info": [
        {
            "prof_name": "Michael Aaron Hawn",
            "prof_id": 637,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 07, 2003",
            "review_content": "\nHawn exudes excellent.  He is the ultimate teacher because he expects hard work but makes the class interesting and fun.  Extremely patient, he will work with you sincerely to improve your writing.  Get into his class!  He does a great job and makes L and R as painless as possible.  \nWorkload:\nseveral 500 essays at the beginning, a few 800, then two research 1000/1200 word papers at the end.  midterm and final are in-class essays\n"
        },
        {
            "course_name": "College Composition I",
            "review_date": "September 08, 2002",
            "review_content": "\nAaron is probably the best instructor I've ever had. Man was he tough on my writing! But he helped me more than I could have ever imagined. He is a walking encyclopedia of the English Language. He made the class fun and interesting, and he is an unbelievably kind and sincere human being. He allows two re-writes of your worst papers, but he expects a measureable improvement.\nWorkload:\nWriting assignment everyday.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 06, 2001",
            "review_content": "\nThe best L&R; teacher ever! Believe it or not, this was my favorite class this semester. Hawn is an interesting lecturer and even the grammar lessons were quite fun. I only remember being bored twice in his class, and it was only for a short time. He is a very hard, but fair grader. Your writing will improve a lot after taking this course. I freaked out when I got a d+ on my first paper, but by the end I was pulling a's. A cool thing about Hawn is that he replaces your original grade with your revision grade. So I rewrote my first paper and the d+ was off my record. If you work really hard and write good papers, you'll get an A- in the class. Otherwise, you'll fall in the B range. Hawn is a genuinely nice person and is very helpful in his criticism. I went to his office hours and it was amazing how much he was able to help me with my papers. You should definitely try to take his class. His class is usually at 9am.\nWorkload:\n10 short papers, 2 revisions of the short papers, 3 long research papers, and 3 revisions of the longer papers \n"
        }
    ]
}