{
    "prof_info": [
        {
            "prof_name": "Elisabeth Friedman",
            "prof_id": 425,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Latin American Politics",
            "review_date": "April 04, 2004",
            "review_content": "\nWorse class taken at Columbia/Barnard. Her lectures are inane and shallow, very little info. gets conveyed. The readings all focus on women/gender/mobilization and seem to avoid socio/political/economic elements. Overall simply horrible. Very specifically biased and and does not present or respect alternative ideas of any sort.  Thankfully, it is my understanding that she is leaving.\nWorkload:\nmedium reading load, no mid-term, final, research paper (needs to be very PC)\n"
        },
        {
            "course_name": "Latin American Politics",
            "review_date": "May 20, 2003",
            "review_content": "\nThis class tries to give an overview of latin american politics and the issues surrounding the est. of democracy.  It is way too much material for a class of only one semester, and at times the course seems a bit hackney.  \nWorkload:\nToo much, midterm final, a 12-15 page research paper, and these 3 short papers about latin american pol. events attended\n\n"
        },
        {
            "course_name": "Latin American Politics",
            "review_date": "May 06, 2003",
            "review_content": "\nI totally agree, she certainly makes you feel like back to grade school. Granted, she knows the material, nevertheless  she tries too hard and is not willing to accept or at least consider different views. She is needlessly intimidating and really does nothing to encourage her students to think creatively -- they are just expected to memorize and repeat what she says like parrots. She gives very little space in choosing the themes for the required paper -- you do what she wants you to do!\nDo not take this course if you are really interested in political science and in Latin America as it will so turn you off. \n\nWorkload:\nhumongous\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "April 09, 2001",
            "review_content": "\nThis class turned me off to political science. Elizabeth Friedman has the unique ability to make her students feel like they are in grade school again--and that's not a good thing. Her attempts to garner class involvement by asking inane questions like \"what kind of political values does your family have?\" or \"what issues do you think people should vote for?\" only produce equally banal responses from students looking mostly to brag about their international origins (btw, poli-sci classes in general are full of these types of people). Friedman's condascending tone, clear political bias (lame, tired election quips abound), and poorly chosen readings counteract her organized lectures, although she frequently doesn't cover whats on the handouts because she often spends too much time asking those silly questions. The TAs and discussions sections in general in this class were awful, making most of the readings totally irrelevant except for the Kesselman text (I sure wish he could teach this class) which is useful as background information on each country, although devoid of the theories of democracy, representation, etc. which her lectures focus on. If you took Zisk's Barnard International Politics, loved it, and hoped to repeat the experience in this class, don't bet on it.\nWorkload:\n10-15 page research paper, mega multiple choice/fill-in-the blank midterm (also quite a bummer), final\n"
        },
        {
            "course_name": "Latin American Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nBoth classes were amazingly organized and engaging...two of the best political science classes I've taken, either at Barnard or Columbia. Sharp as a tack, Friedman is not the type of professor to skirt your questions with long-winded, rambling responses that don't actually answer your questions. She is fantastic at promoting critical thought, and not just the type that's filler for exam material, the kind that you actually want to think about and discuss. Take these classes if you're at all interested in Latin America, gender and feminisim, and the developing world. These classes changed the course of my studies...take anything you can with her.\nWorkload:\nHeavy, but extremely engaging. Lots of small (less than 5p) papers, and extensive finals/research papers, but so engaging you want to keep reading. A+++++\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nThis is a great class. Prof. Friedman makes lectures that could easily be a boring recitation of facts and dates extremely engaging. If I had taken this class 2 years earlier, i would have majored in Political Science. Prof. Friedman is super duper nice and helpful and not in that phony \"gee im so glad you came to my office hours\" way. Genuinely there to teach (yes, as in to bestow knowledge) and help you when you need it. Engaging, challenging and worth it. *Beware of uppity poli sci majors who think they know everything.*\nWorkload:\nFairly standard reading load. One midterm, one final. One 10-15 page paper. Weekly responses to readings for section. the exams are extraordinarily tricky, though. They are \"monster multiple choice\" (her phrase) and are essentially built to stump.\n"
        }
    ]
}