{
    "prof_info": [
        {
            "prof_name": "Brenda Coughlin",
            "prof_id": 1800,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Sociological Imagination",
            "review_date": "January 19, 2004",
            "review_content": "\nCreative, thoughtful and thought provoking teacher. She is a fair grader and wants students to succeed. You'll get what you deserve. She does not hesitate to give an A to someone who has earned it. It is a challenging course but with effort and her reliable office hours you are sure to succeed.    She lectures at times but for the most part encourages class participation which is key to getting a good grade. And when she does lecture she makes sure to pause and make sure everyone is with her. I recommend this course even if you are not a sociology major. \nWorkload:\nReadings which for the most part interesting, one 8-10 page pp on a documentary of your choosing, midterm and final both very reasonable\n"
        },
        {
            "course_name": "SOCI V1202 Sociological Imagination",
            "review_date": "November 18, 2003",
            "review_content": "\nI was a bit cautious in taking this class with her because my past experience with graduate student taught classes had been shaky, but I'm glad I took the chance. She is one of the best instructors I've had, who remembers what it means to be a student. She's very organized and makes sure you know the work that you're supposed to be doing. Her selection of material is also excellent and the she makes sure you understand what you need to know, which makes this class a rarity in the Sociology department. If you're considering majoring in sociology, then take this class. But be warned, she's an exception to the rule.\nWorkload:\nStraight forward reading which is mostly enjoyable, 1 paper (8-10pgs) on a documentary film, midterm and final. Atttendance and participation are also important.\n"
        }
    ]
}