{
    "prof_info": [
        {
            "prof_name": "Oliver Murphey",
            "prof_id": 11136,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "History of the City of New York",
            "review_date": "September 04, 2013",
            "review_content": "\nI did not think Oliver Murphey was capable of leading sections or grading papers. He did not seem to know what he was talking about. He is a nice guy, but his paper comments did not make sense and he was not good at assisting students in the manner they deserve at Columbia. It felt like a waste of time and effort. The course is excellent, so it is a shame to have a weak TA for such an interesting topic. The sections could be excellent due to the interesting readings and current events in NYC etc, but it was lacking and the grading was inconsistent and comments were weak and unfair.\n\nWorkload:\nMedium\n"
        },
        {
            "course_name": "America since 1945",
            "review_date": "May 01, 2011",
            "review_content": "\nOliver made this class less pleasant for me.  He's not a bad guy, but just really, really frustrating.  He always ended discussion with, \"Well, there's a lot I wanted to get to but we never got there...so...yeah.\"  Okay, solution - stop letting people ramble about their own political affiliations and actually lead discussion section!  His comments/reviews of any work or proposals were helpful, but were unnecessarily harsh.  Several times he wrote things like \"awkward\" or \"not really\" or \"great ideas, but bad presentation.\"   I'm sure that Oliver would have been a GREAT TA if he had spent more time clarifying subject material and invoking topic specific discussion rather than letting students talk vaguely about their feelings, their grandmother's feelings, or why they feel Reagan is so cool.  Not helpful.  \nWorkload:\nLOTS of weekly reading and discussion postings.  Also midterm, final, and intense final paper\n"
        }
    ]
}