{
    "prof_info": [
        {
            "prof_name": "Ghada Badawi",
            "prof_id": 5573,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "January 11, 2012",
            "review_content": "\nGhada is one of the best teachers I have had at Columbia. Her lessons are always clear and straightforward, and she always makes sure to emphasize the important points as necessary. She prepared us very well for all the quizzes/ exams, and we did a lot of great work on our writing skills. I definitely felt that everyone improved a ton over the course of the semester. \nI also loved the way she would break down long reading assignments into smaller pieces for us, to make it less intimidating and more manageable when we went over them. Her teaching methods were great and very user friendly.  She would also provide frequent study guides (very well organized) which were great for reviewing both recent and older material, which kept us from forgetting things we had learned previously. \nFinally, Ghada is simply the sweetest person. She is incredibly patient and understanding, and really cares about the students. She also recognizes effort, and will work with the students to make sure that everyone is able to succeed. Class with her was a pleasure. Highly recommended!! \nWorkload:\nHomework every day, as in any Arabic class, though on occasion she would cancel homework and tell us to just review the material from that day so that we could work on it some more the next day. She definitely keeps it manageable. Everything is on a check/ check plus/ check minus scale. \nDepartment standardized quizzes and final. Comprehensize but fair. \n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "January 03, 2010",
            "review_content": "\nGhada is a very nice teacher. She is friendly and tries to make the class enjoyable by making the class work in groups and trying different exercises with the class. The main problem I found with her teaching however is that it seemed at times she didn't understand student's questions (slight language barrier) so she wouldn't answer the question at hand.\nFor the workload, it's pretty heavy like most of the intro arabic classes. It's especially heaviest the first few week, perhaps to scare off people when the arabic classes are way overfilled. I was already familiar with arabic letters (but nothing else about arabic) before the class so I could imagine the first month of class being extremely tough for people wholly unfamiliar with arabic. She does give the full syllabus with all the homeworks at the beginning so you could work ahead.\nFor intro arabic I would definitely recommend her. This was one of the best classes I took at Columbia. The workload is unavoidable for learning arabic so given that, she is a great choice if you are set on taking arabic.\nWorkload:\n4 days/wk, daily hw, biweekly quizzes, in class presentation, final\n"
        }
    ]
}