{
    "prof_info": [
        {
            "prof_name": "Gil Eyal",
            "prof_id": 1647,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "The Social World",
            "review_date": "January 09, 2017",
            "review_content": "\nGil was passionate and the course material was interesting. Gil did a really incredible job of opening the lecture up to discussion in a room with 100+ students. I would definitely suggest taking the class. My only complaint was that his lecture slides seemed seriously disorganized to me. Some of his slides were just massive blocks of text and quotes. Other slides were just a couple words and some random stock images that didn't seem to have any meaning. It was kind of funny, but also annoying when trying to go back and study from them. \nWorkload:\nAt least 200 pages of reading every week, but overall not an overwhelming workload. You should be able to tell which texts are important from the lectures and sections with the TA. We had a midterm, final, and one research project. All were very fair assessments. The research project was a great way for anyone who hadn't done primary research before to try it out. \n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "September 06, 2014",
            "review_content": "\nThis was a wonderful class in so many ways. First, Eyal is a fantastic lecturer. Second, his lecture is pretty much all written in power point form, so it's easy to take notes and to know what is important. then again, everything is important, so you should take very detailed notes. \nI loved the course material. we studied Durkheim, Weber, Marx. Very manageable reading that you don't really have to do. When i say manageable, i mean hardly anything.\n3 take-home exams that we could work on with peers and use the books etc. straightforward questions but hard to get completely right because the concepts can be challenging. \nIt is very important that you attend lecture because the concepts make so much sense when Eyal is lecturing, yet is difficult to grasp by reading the texts alone. So i highly recommend that you attend class if anything.\nalthough everything is very simple, it is not easy to get an A. I consistently got in the A- and B+ range on the exams, without doing much reading but always going to lecture.\nOverall I highly recommend this class. In my opinion, it is essential for any humanities major!\nWorkload:\nlight reading. 3 take-home exams. very straightforward, doable.\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "May 18, 2012",
            "review_content": "\nI enjoyed Gil's section of Social World. He was a terrific lecturer and possibly one of the most approachable and nicest professors I've encountered at Columbia. Despite the size of the class (>100), Gil still managed to turn his lecture into a discussion. I have never seen a professor teaching a class of such size to be so open to questions and to be so eager to facilitate discussion among members of the class. I think, with the exception of maybe one or two times, I have never seen Gil turn down a single question or not call on someone who has raised their hand in the middle of lecture. Some of the questions and things said by people in the class were downright inane, and it really testifies to Gil's dedication and character when he seems to take every question seriously and provides the person asking the question (and the whole class) with a really in-depth answer. \nGil has a remarkable understanding of social theory, which he tends to ground his lectures in, and you should keep in mind that Gil's version of Social World is more social theory-oriented than that of other sociology faculty members teaching the same class; you may want to keep that in mind before you sign up for the class. (If you're not into this stuff, you may find it boring. So know what you're getting yourself into.) Gil's class exposes you to the work of a lot of big names in the field (e.g., Mead, Mills, Bourdieu, Goffman, Becker), and if you pay close attention in class and do your reading, you come to really appreciate the applicability of what you learn in the class. A lot of the concepts, theories, and ideas that you go over in class are enormously profound, and Gil has a knack at taking complicated ideas and breaking them down so that they are understandable and appreciable by students who do not have much of a background in sociology. With a heavy emphasis on social theory and some philosophy, the class (or the topics that Gil lectured about, at least) reminded me somewhat of Contemporary Civilization (there was definitely a little bit of overlap), except Gil was much more adept at explaining things clearly than my CC professor was. \nAll grading is done by a TA who you are assigned to. Mine was generous, and I guess if you get a shark of a grader, you could have a very different Social World experience compared to my Social World experience. But just in terms of the administration of the class, Gil's Social World section, relative to that of Shamus Khan (for which I sat in on for a few lectures during the spring 2011 semester), is a low-stress class. You don't have to deal with the plethora of weekly quizzes and an onslaught of papers that Shamus gives out, and consequently, I found the workload (and grade-induced stress) to much lighter with Gil. His midterm and final were easy, and they basically came entirely out of his lectures. As the semester progresses, you get a very good idea as to what ideas and theories Gil is very interested in (i.e., he loves talking about Marx and class conflict), and the topics that appear in his exams are, more or less, predictable. Especially since I feel that many of the people who did very well in the class didn't necessarily show up to lecture, do all the readings, or pay close attention in class, to improve the administration of the class in itself, I think Gil may want to make the class and its tests harder. I feel that some people may have walked away from the class thinking that it's a \"joke\" because they may have gotten away with a good grade without putting in adequate effort and doing all of the reading, and I don't think this is fair to a course that is otherwise a really terrific one for those who are very interested in the subject matter. \nI do have to say that some people seemed to take advantage of the low-stress nature of Gil's class by spending lecture checking FB, surfing the web aimlessly, replying to emails, and reading Bwog (and of course, a lot of people never seemed to show up to lecture). Out of a sea of laptops in the lecture hall, I found it amazing (and also kind of disturbing) how many people were on FB during a given class period. In order for you to truly understand and appreciate the social theory and philosophical ideas that Gil discusses (beautifully), you need to pay close attention to what Gil is saying, and while Gil has a bit of an accent and is somewhat soft-spoken (since he does not use a microphone in 309 Havemeyer), if you are not paying attention in class, it's (understandably) easy to lose him. Needless to say, I occasionally heard people complaining that they were bored by GIl's lectures or that what he's saying makes no sense. Odds are they probably weren't paying attention to begin with...their loss.\n\nWorkload:\nGrading is dependent on your TA. 2 papers (15% each). Totally manageable in-class midterm and final (30% each). Class participation (10%). \n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "June 30, 2010",
            "review_content": "\nProfessor Eyal is a wonderful lecturer and the most helpful professor.  Even if you don't care much about the material, you'll find his lectures interesting.  If you care about learning the material, you'll be heartbroken when the class is done.  The course is well structured, class discussions dynamic, and lectures phenomenal.  This is crucial because Marx/Durkheim/Weber texts have a lot more than meets the eye.  \nReadings are necessary but you can fall behind and still understand the lectures.  It's not a lot in quantity, but you'll get so much more out of the lectures if you read in advance and come with questions.  He will answer them.\nNot only is he a good lecturer, he is also a good listener.  I went to the office hours several times for advising.  He was straight forward with the facts and honest with his opinions, without sugarcoating but also not condescending.  \nWorkload:\nReading:  light in quantity, dense in content.\n3 take-home exams:  10 questions, each answer 1/2 page.\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "April 10, 2010",
            "review_content": "\nProfessor Eyal is an extremely smart and comical professor, and he really makes the class interesting. The topics are pretty boring for a non-sociology major, but Professor Eyal does a good job with presenting the material in very basic terms and trying to explain the main concepts thoroughly. The TAs in the class play a big role in the grading of the exams, and they are not very easy graders. I did not do very well on the first take-home exam, but then again, I didn't do all the reading. It's not completely necessary to do all of the reading; you just have to be succinct and specific in your exam questions. The TAs are always available for questions, along with the professor. I wouldn't recommend this class to someone who is not interested in sociology, because it can get pretty dry.\nWorkload:\nReading, 3 Take-Home exams (short essay format)\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "June 04, 2006",
            "review_content": "\nGil is a nice person and an great professor.  First of all, he knows his shit. He knows Marx, Weber and Durkheim like its his job (oh wait I guess it is his job).  He and his T.A. were always available for help and they always reponded to e-mails.  I especially like the fact that class attendence was critical.  I have taken too many classes at Columbia where unappreciative undergrads  blow off going to class but still manage to get decent grades.  Go ahead and try that with this class and I think you'll get a big fat F.  The formula for success is simple. Go to every lecture, take extensive notes and you will find the take home exams easy.  I did that and I got an A.  \nWorkload:\nThree take home exams.  Short readings for every class.  (towards the end of the semester the readings got a little longer)\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "January 06, 2005",
            "review_content": "\nGil Eyal is an excellent person. He is of course a very talented professor as well, and gave the best lectures on Marx I've ever had. He's brilliant but very humble; he's gentle, but keeps control of the class; he answers every single question, but immediately puts the discussion back on track. I've never seen such an objective presentation of Marx, Durkheim, or Weber, and this is most helpful when he asks you to distinguish between any two or all three of the authors. !!!TAKE GOOD NOTES!!! I made an A+ in this class because I went to every lecture and took detailed notes. I didn't even do all the reading, but Gil breaks the readings down and makes them SO CLEAR that I could come up with really solid answers for the take-home tests, just looking at my notes. And I wasn't regurgitating what he had said; I actually knew what I was talking about. So yeah, your lecture notes are the most important thing.\nAnd like I said, great professor, even better person. He is so charming and clever, and not an arrogant arse like so many Columbia professors. He tells really funny, subtle jokes, and he always has time for questions. He's also really shy and adorable. I heart him.  \nWorkload:\nsmall readings due every one or two classes, midterm and final (both take-home, both consist of 5 two-page essays, and you have choices for each question)\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "January 02, 2005",
            "review_content": "\nI took this class to fulfill the requirement for the Sociology major.  Overall, I liked the class.  I had been exposed to most of the material in Lit Hum and introductory sociology courses before, which helped.  The focus was on Marx, Durkheim, and Weber, with some other authors thrown in.  A lot of this stuff can be a bit dry if you're not really into it, but Prof. Eyal's lectures were always enjoyable.  I think some other reviews complained about his accent, but there is absolutely no problem understanding him honesly.  The accent actually makes the class more interesting.  He is a dynamic and enthusiastic lecturer and really knows his stuff.  He is careful to be objective and gives a presentatin of the material and a solid critique of each theorist. \nThe workload was very manageable.  Readings were suprisingly short, usually around 25 pages per class I would say.  Longer assignments are given for the Weber.   There is a take-home midterm and a take-home final.  I wish I had done more of the readings as it would have made writing the 5 two-page essays easier.  The take-homes were very challenging, for me at least.  The grading accurately rewards the amount of work done.  I ended up getting a B+.   \nWorkload:\nShort readings for each class. Take-home midterm and final.  5 two-page essays for each exam.\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "December 08, 2004",
            "review_content": "\nSo I read over the other reviews, and I have to say that I have no idea what the others are talking about, but then maybe it's because the class is different.  In CST, Prof. Eyal was thought provoking and fun.  His accent shouldn't present a problem if you've done the reading.  Every lecture was interesting, the readings only seemed to supplement his lectures, he made jokes that were actually funny, he answered questions fully and always made a point to go back to you if you raised your hand while he was on a roll, and the list goes on.  I say that if it's between reading the book and going to lecture, go to lecture.  His exams really require your having been in class.  It's hard to make Durkheim interesting without watering him down.  Prof. Eyal manages to do it, with an outlined lecture and never goes over class time.\nWorkload:\nMedium to small reading assignments for HW.  Your grades are just the midterm and final, both take-homes and both fairly comprehensive.\n"
        },
        {
            "course_name": "social change",
            "review_date": "January 15, 2004",
            "review_content": "\nI really really enjoyed this class. I thought that he was very knowledgable and really tried to express the immense debate surrounding the subject while also letting us speculate on what he believed to be true. The course was very interesting in that sense and I enjoyed going to the lectures. However, the grading was done completely by the TAs and was very arbitrary. You can come to every class and get a B while someone who never showed up or did the reading gets an A for no particular reason\nWorkload:\nvery very light. the reading was a very manageable amount of pages. 1 midterm about 10 pages long (take home), and 1 final research paper. both took time to write, but it was all you had to do all semester so it was fair.\n"
        },
        {
            "course_name": "social change",
            "review_date": "January 10, 2004",
            "review_content": "\ndo yourself a favor and do not take a course with this professor.  his thick accent makes understanding him extremely difficult and makes his already extremely boring lectures even worse.  although theory is his thing - its terrible.  even if you like theory, the class is torture.  he is neither charming or engaging as the last reviewer wrote.  most of the class never showed up and those who did ususally left after the first 10 minutes.  don't expect to learn much\nWorkload:\na take-home midterm and final research paper..you don't even need to do any of the readings on the extensive syllabus\n"
        },
        {
            "course_name": "social change",
            "review_date": "October 16, 2003",
            "review_content": "\nThe below review is off base and ridiculous. Prof. Eyal is an amazing professor: he knows the field like the back of his hand and he always makes the class exciting. His accent is actually really, really charming, and he has a great sense of humor. He is a great prof to have and anyone who likes theory will like Gil Eyal.\nWorkload:\nNot so bad, and his comments are actually quite helpful.\n"
        },
        {
            "course_name": "social change",
            "review_date": "May 21, 2003",
            "review_content": "\nincomprehensible accent. easy A. doesn't believe in formal exams, he gave a take home midterm and a final paper. you don't need to go to class, and you don't need to learn anything for the A. so if you want to learn something and be motivated to do so, don't take a class with gil because he simply isn't interested in being interested. he stands in front of the class and spews out his views in his thick accent and no one knows what he is talking about, ever.\nWorkload:\ntake home midterm, final paper\n"
        }
    ]
}