{
    "prof_info": [
        {
            "prof_name": "Joel Gersten",
            "prof_id": 1277,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Summer Physics II ",
            "review_date": "August 24, 2012",
            "review_content": "\nI found Prof. Gersten's summer class quite enjoyable. I loved the material (it is much more interesting than physics I) and Gersten's knowledge and passion for the subject was inspiring. He is extremely fair and really wants to help his students grasp physics. Although the class was rushed (as all summer classes are), I gained a deep understanding of and appreciation for the material. Gersten's tests are challenging but totally doable. His exams are a fair reflection his class, and they are curved which helps. I am glad I got physics over with in a short time period, and you can actually learn something by taking Gersten.\nWorkload:\ntwo midterms (25%) and one final (50%); ungraded homework\n"
        },
        {
            "course_name": "Summer Physics II ",
            "review_date": "August 26, 2006",
            "review_content": "\nGersten is a generally nice guy and seems to really like the subject.  That said, he is not an effective teacher.  Classes are spent endlessly deriving equations that are largely irrelevant and there is really no reason to attend class.  Grades are based entirely off of two midterms and a final, homework isn't even graded.\nJust churn through the homework problems repeatedly and things are no problem.\nWorkload:\ntwo midterms and a final.  Homework assigned, but not graded\n"
        },
        {
            "course_name": "Physics II",
            "review_date": "August 31, 2005",
            "review_content": "\nGet a tutor/read the book because this man does not know how to teach. Tests aren't easy but definitely easier than Tuts.\nWorkload:\n2midterms, 1 final, homeworks(optional)\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "March 30, 2005",
            "review_content": "\nI appreciated Dr. Gersten and his TA, Jeremy very much. They are a bit of a one two punch!  Dr. Gersten is redundant to the book, which is very helpful to understanding and solidifying the basis of the material.  He also is clear and it is obvious based on how he answers questions that he has a thorough knowledge of the material.  Jeremy, the TA is obviously brilliant.  He seems to have trouble keeping things simple as he seems to see the world of physics as all interconnected with one thing leading to another.  It can get overwhleming as we are usuallyjsut starting to learn abotu this larger world of physics.  However, this approach coupled with Dr. Gersten allows your mind to both be solid and stretched.  I loved it - but some think I'm sick!\nBasically, if you do all the practice problems and old exams your aok.\nWorkload:\ntwo midterms and a final with homework that counts only with borderline grades\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "July 17, 2004",
            "review_content": "\nI didn't have the negative experience with Gersten mentioned by most of the reviewers below.  Yes, the class is quite boring but I think the key is in reviewing the material and working on the homework problems prior to the lecture (all the HW and chapter assignments are detailed on the syllabus).  That way you get your money's worth out of the lecture.  Gersten really does have a sense of humor so if you can manage to stay awake during the evening class (and have reviewed the material), you should find it more or less enjoyable.  To make your life more pleasant, I would highly recommend a textbook other than the Sears, Zemansky, and Young.  The text is drier than the Sahara desert.  I consulted Cutnell and Johnson in conjunction with the Sears study guide and then went back to the Sears text to do the assigned problems.  Wouldn't have learned a thing otherwise.  As far as Gersten's attitude towards students, I found him to be extremely kind; he seemed to sincerely want to help students pass his class.  I also got help from Blaer who also, in my experience, was very keen on helping students interested in physics.  I actually borrowed his Cutnell and Johnson text.  \nWorkload:\nWeekly HW sets.  2 midterms. 1 final.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "May 17, 2004",
            "review_content": "\nProfessor Gersten is a good guy but he only has two 30-minute office hours per week, so you've got to get there early if you want to see him.  It is not necessary to attend the class to do well.  Read the book.  Work the problems.  Work the problems again.  This is a self-taught course.  Exams are variants of problems out of the book.  Prof Gersten varies the exams from year-to-year, so review old exams, but do the HW over and over!  HW problem sets turned in supposedly will help your grade in \"borderline cases.\"\nWorkload:\nWeekly HW problem sets.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "April 20, 2004",
            "review_content": "\nThe reviews about Prof Gersten are pretty harsh, perhaps a bit too harsh.  I don't think the class is nearly as bad as people make it out to be.  Definitely one of the better physics profs out there.  He knows his stuff and explains it well.\nYes, the textbook is just damn awful.  But this class does use the classic Sears, Zermansky and Young text which is in its 11th edition so someone must like the book.  Prof Gersten suggests alternative textbooks in the class syllabus - do yourself a favor and get one of them.\nProf Gersten tries to make the class interesting (material is somewhat boring).  Lectures are coherent and well organized.  He spends a bit too much time deriving formulas, but at least there are no proofs / derivations on the exams.  He cracks jokes and presents a good lecture the old fashioned way (blackboard) and doesn't use powerpoint or overheads.  Class is usually half empty because it is in the evening.  I have found him helpful in office hours.  The TA's for this class are also pretty good.  If you need an off sequence class this is about as good as it gets.  Exam questions are of practical nature and not theorectical ball busters that you usually get in a physics class.\nWorkload:\n3 exams (2 mid-terms and final).  Homeworks are graded and may help in borderline cases  - I don't think so, but we'll see.  Exams are ok.  Not too hard.. average is around a 70-75 or so which is kind of high for physics.\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "June 09, 2003",
            "review_content": "\nMIght as well just memorize the assigned text chapters.  He doesn't seem to have a whole lot of interest in teaching the class.  Professor Tuts is hard, but he at least shows interest in teaching the subject matter and in the individual student.\nWorkload:\nHomework turned in and may help in borderline grade cases - yeah right.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "May 10, 2003",
            "review_content": "\nGodawful.  The class material is quite simple, but the way Gersten drones in class and derives formulas he doesn't apply to problems makes every aspect of physics tedious, and you'll end up staring at his shiny bald head half covered with a combover and half with a yamaka.  Expect to teach yourself --you'll save time and tedium.\nWorkload:\nTwo midterms, final, optional homeworks.  Plan on cramming.\n"
        },
        {
            "course_name": "mechanics and e&m;",
            "review_date": "November 19, 2002",
            "review_content": "\nProfessor Gersten has singlehandedly killed physics for me. I like science. I love chemistry. But physics will forever be my nemesis due to Prof. Gersten. \nHave you ever heard of a professor who has 15 minutes of office hours, twice a week? Yes, that's right. 15 minutes. Why? Because he doesn't care about his students. I took this class because I needed an off sequence class. His class runs at night, with mechanics in the spring and e&m; in the fall. The class is an evil evil group of individuals who spend all of their time in the library studying physics. (This is all my opinion--not fact). This leaves regular undergraduate students (such as me),  at a severe disadvantage. But the main problem is the awful teaching. Gersten drones in a boring monotone, teaching straight out of the book, with no additional insights. He does take questions, and, of course, the annoying post-bacs have many many to ask. \nHow you do in the class is, of course, dependent on the curve, which is a problem.  The textbook is also poorly written, which is a problem if you need to teach the material to yourself (you will). Overall, the classes sucks. Take it at Barnard. Or take it at Columbia and take Tuts. But whatever you do, do not take this class.\nWorkload:\nHomework due one week after the chapter is taught. The point in doing the homework is to assist you when you teach yourself the material. Even though the homework is collected and graded, it does not count in computing your grade in the course. The real work is getting up the motivation to teach yourself the material.\n"
        }
    ]
}