{
    "prof_info": [
        {
            "prof_name": "Robert Neel",
            "prof_id": 2658,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Probability Theory",
            "review_date": "July 13, 2009",
            "review_content": "\nGood class, good professor.  Doesn't have the best blackboard style and isn't the best at giving broad or deep mathematical views but explains concepts clearly and thoroughly.  I wouldn't praise Neel as enthusiastically as some other reviewers.  I've taken several 4000 level math courses and as a teacher Neel is probably about average, a good instructor but nothing out of the ordinary.  He's also a nice, approachable guy with a dry sense of humor.  \nIf you're at all interested in analysis or probability this is a worthwhile class to take.  There is some overlap with Stat 4105, with the difference that the course emphasizes the theoretical apparatus behind probability instead of modeling and problem solving.  You'll probably have a slightly easier time if you're comfortable with basic probability concepts, but that's not required and you could take the class without even knowing what a probability distribution is.  It is important though that you've already finished the first semester of Real Analysis since the textbook assumes familiarity with basic topological notions, sequences/series, continuity etc.  I guess you could get by without that knowledge but you would be confused by a lot of the material and probably wouldn't do well.  Lastly, if you're thinking about trying the graduate analysis/probability sequence this class covers some of the same material at a much lower level, so it would make decent preparation.      \nWorkload:\nA problem set every week, as usual start it early.  Challenging midterm and final that were graded generously.  Neel is good at finding instructional hw problems and designed parts of the midterm to be similar to the hw, so if you can do all of the hw on your own you're set.\n"
        },
        {
            "course_name": "Probability Theory",
            "review_date": "April 05, 2009",
            "review_content": "\nNeel is an excellent professor who loves explaining the enigmatic features of probability theory to anyone willing to listen.  His one downside is that he talks very fast during lecture, so it is the class's responsibility to ask questions to clarify the material on the board.  Otherwise, I could not imagine a better instructor for this heavily theoretical, upper-level applied mathematics course.  \nWorkload:\nWeekly homework (30%), Midterm (30%), Final (40%).  To do well in this class, you must read and take notes on the sections assigned, and start homework at least a few days before the due date.  Go to office hours.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 22, 2008",
            "review_content": "\nI had heard good things about Prof. Neel and I wasn't dissapointed when I took Calc IV with him. His teaching style is clear, effective and engaging. I think he is one of the few teachers at Columbia that genuinely cares about his students. Being a clear speaker of the Englsh language definately adds to his appeal as a more than decent Math professor. Outside class he is extremely nice and acts concerned and wont make you feel embarrased for asking the most basic questions. \nHis teaching style is pretty amusing, throughout the lecture his somewhat self deprecating humor + his own brand of mathy jokes will keep you awake or will atleast make you take a break from texting or staring out the window. \nWorkload:\nWeekly home works which range anywhere from easy to challenging although not so time consuming.\n2 midterms (fair), 1 Final (easy)\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 18, 2008",
            "review_content": "\nCalculus 4 with Professor Neel was great. He's very clear and lectures quite lucidly. His notes are great, too. If you ever have to go to office hours, he's quite helpful there too. I'm a math major so I already think this stuff is cool, but Neel was definitely the best math professor I've had yet. Take if you can!\nWorkload:\nNormal for math classes -- 1 problem set a week of 8~10 problems. Not too difficult, but there are some interesting problems thrown in once in a while too. Two midterms (easy, then hard-ish) and a final.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 23, 2007",
            "review_content": "\nThe man is clear with his lectures and fair with his grading. The only downer is that his class starts at 9:00am.\nWorkload:\nWeekly homeworks, lowest two droppedTwo midterms, both reasonableOne final, easy in comparison to the midterms\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 21, 2006",
            "review_content": "\nProfessor Neel is the best math prof. I have ever had -- and could ever imagine having.  His lectures are clear and organize -- your notes will be great if you follow along.  He uses great examples, and is always open for questions.  He has a fantastically dry and mathematical sense of humor, so if you open yourself up to it, he is entertaining too.  He cares that you get the material.  The homeworks are fair, and VERY doable if you go to class and do the reading.  I am going to take another math class, just for the hell of it, because Professor Neel allowed me to love math that much.  I think he's an amazing teacher and would have no hesistation in recommending him to any type of math student.  You should really avail yourself of his AWESOME teaching.  He made Calc III fun!!\nWorkload:\n10 problem sets over the semester (10 problems each or so), 2 midterms (very fair), 1 final (haven't taken it yet, but I am sure it will be fair.)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 17, 2006",
            "review_content": "\nProfessor Neel is excellent.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 05, 2006",
            "review_content": "\nProfessor Neel is a great professor.  His lectures are very concise and not confusing.  He doesn't confuse his students by making concepts harder than they actually are.  The material in this class isn't that difficult to grasp either.\nHis lectures come straight from the book basically.  I found myself not going to some of his lectures because of it.  But there are a few things he goes over that isn't found in the book directly so it's good to go to class.  The only downside I would say is that he doesn't give as many examples as I would like.  He also makes a couple mistakes here and there, but nothing that confuses you completely.  A student usually corrects him anyway.\nOther than that, he's a very nice guy, very approachable, and he speaks perfect English so there are no problems understanding what he's saying.  I would definitely recommend this teacher for any Calculus course.\n\nWorkload:\nProblem set every week, 2 fair midterms, 1 final.. not bad at all\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 17, 2006",
            "review_content": "\nProfessor Neel is by far the best mathematics professor I've experienced here at Columbia. His lectures are consise and straightforward, and he makes it clear what you need to know. He doesn't do anything that is above and beyond what is asked, but the routine he sets makes for a very well structured course. An occasional joke helps digest the math with a smile on your face. \nThe problem sets have a range of difficulty, starting with easier problems, working up to what is conceptually difficult. If you fully understand the problem sets, the tests just help reinforce what you know. There are no surprises. He emphasizes the concepts and strays away from tedious algebra as much as he possibly can. \nHe is always available in office hours and expresses a desire to help should you seek it out. Overall, this was just a very enjoyable course. \nIf Neel is an option for you, I would seek him out at all costs. \nWorkload:\nWeekly Problem Sets, 2 Midterms, Final Exam. All of which are fair. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 17, 2005",
            "review_content": "\nThe first thing you should know is that this guy speaks totally understandable English.  Good times.  Anyway, he's your basic solid math teacher.  He clearly knows what he's talking about, and when people (like me, sadly) asked strangely worded questions he knew how to respond.  He did make some basic mistakes, but people would correct him and he would keep rolling.  The tests are pretty fair; nothing comes at you out of the blue.  In short, I'd say you wouldn't have any regrets about this guy.\nWorkload:\n2 midterms and a final, weekly problem sets, no webworks!\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 07, 2005",
            "review_content": "\nI'm pretty sure this was Neel's first year teaching and it kinda showed.  He made plenty of careless errors while working out problems on the blackboard, but students always corrected him.  You'll have to go to the textbook after a lot of the lectures to get a better grasp on the concepts taught.  The weekly problem sets are not so bad, especially with the help of the help room in milbank.\nthere are two midterms- not too bad if you review problem sets and examples from class.\nhes a very nice guy, a bit odd but easy to talk to and helps you out if you have a conflict with midterms.\nespecially if youve taken calc in high school, this should be at least an A- \nWorkload:\nweekly problem set2 midtermsfinal\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 04, 2005",
            "review_content": "\nProfessor Neel is an excellent teacher of mathematics.\nHis lectures are systematic: he defines terms, proves theorems, and then provides examples very similar to those on his problem sets. The problems are well chosen and instructive. The difficult problems are conceptually challenging, with very few tedious algebra or arithmetic problems (with the exception of matrix multiplication problems, which are unavoidable in linear algebra). His midterms are comprehensive and fair (I have not taken his final yet). His quirks and odd turns of phrase will make you smile, and add needed humor to the 9:00 am lecture slot.\nHe's not a startlingly innovative teacher, but if you show up to class and do the problem sets you will learn the math, and you might even enjoy it. I have.\nWorkload:\nWeekly problem sets, about 2 hours each. Two midterms, one final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 30, 2005",
            "review_content": "\nProfessor Neel has definitely been one of the best math professors IÂ’ve had.  ItÂ’s odd because there is nothing particularly GREAT about him; heÂ’s just an excellent teacher.  HeÂ’s a little quirky, but it makes the lectures that much more fun.  In fact, IÂ’ve like him so much that IÂ’m willing to go to his 9am (!) lecture next semester for Calculus III even though there are open spots in later lectures.  So yeah, I have yet to take his final, but all of his tests and homework have been incredibly fair and I feel like IÂ’ve learned a tremendous amount in his class.\nWorkload:\nA problem set due once a week, two tests and a final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 16, 2005",
            "review_content": "\nLet me start by saying I hate math and have been a B/B+ Math student my entire life.\nProfessor Neel, like most math teachers, has his own unique set of quirky mannerisms that just make you smile. Example: Neel periodically checks his watch during lecture and blows on it. \nAnyway, that aside, he's a very nice teacher and does his best to explain the material. He tends to adhere to the book, making relatively simple concepts complicated (since the book does a miserable job if you're just taking calc for a requirement). He also rarely checks the difficulty of the homework problems he's assigned and thus finds us whining during his office hours and flooding the calc help room. To his credit, his midterms are relatively easy and straightforward; he even gives hints on most problems. He's very approachable (although his office hours could definately be better), he provides us with practice midterms and best of all he holds out-of-class review sessions before the tests. \nI think there's hardly a reason to do poorly in Neel's class. If you get the material, or are atleast commited to seeing him, you should do absolutely fine, whether you're a math person or not.\nWorkload:\n5-10 problems due at the beginning of the first lecture each week. The homework can be tough (unintentional on Neel's part of course). 2 midterms, 1 final. The midterms were relatively easy.\n"
        }
    ]
}