{
    "prof_info": [
        {
            "prof_name": "Jay Devore",
            "prof_id": 9930,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "July 02, 2012",
            "review_content": "\nDevore is a visiting professor emeritus from CalPoly. He's been teaching stats for a long time, chaired the department there, and has written ~8 textbooks. That includes the standard textbook for 1211. He's taught at Columbia the past few summers.\nHe's a very solid, safe lecturer. He teaches pretty clearly and knows exactly what he wants to do, and how he wants to do it. He won't necessarily communicate some of the fun, real world impact of the material, but he does a decent job of getting the information across.\nHe requires everyone buy a course booklet, ~250 pages of examples, formulas, etc. The result is that he writes on the board less, and talks more. Particularly with Stats this felt like a great solution. It also makes taking notes much easier, a lot of the time.\nThe homework is lengthy. It tends to be about a dozen problems (most with several subparts). By my estimate they take somewhere between 6 and 12 hours, centered ~8 hrs. \nThe tests (2 midterms + final) are tough but not tricky. If you paid attention in class and did the homework, you know the sorts of problems he's going to ask. He lets you bring a sheet of notes & formulas into the exam (1 for the first midterm, an additional for the second, and 2 more for the final. So you have 4 sheets of notes in the final exam). You can put anything you want on those notes, aside from fully worked out examples. This is key, so you don't have to remember all the formulas. You'll also want to use a calculator; he lets you take anything, so that trusty TI-83 can be put into use again. Very, very worthwhile to spend some time getting quick with the stats stuff in the calculator. Can be super helpful to double check your math in the exam.\nThe two midterms (but not the final) also have take home questions. These are lengthier than the ones he does in class, but they're close to free points since you have hours to work them out.\nDevore loves talking to students in office hours. Go on days when homework isn't due and he'll happily talk to you for a while. I don't think he particularly plays favorites with grading, but he'll definitely warm up to you if you take the time to introduce yourself and chat with him.\nIf you want to take Stats 1211 you'd be lucky to have Devore.\nWorkload:\n9 problem sets (20%). All quite lengthy, 8+ hours each, I would estimate. From the book. Some are quite tedious (drawing scatter plots, etc). Graded by the TA. He drops 2 lowest. \n2 Midterms (22% each). Not easy, but not tricky. They have a take home component too. They're things you should know well, and be able to do quickly (you only have ~50 minutes). If you've prepared well, you'll do well. Devore grades these himself. You can prepare notes, and use any calculator you want.\nFinal (36%). Like the midterms. It's longer (2 hours). It focuses on the material post-2nd midterm, but includes some earlier stuff.\n"
        }
    ]
}