{
    "prof_info": [
        {
            "prof_name": "Wijnie de Groot",
            "prof_id": 1439,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Dutch II",
            "review_date": "May 17, 2010",
            "review_content": "\n\nWijnie de Groot is one of Columbia’s hidden gems. She is an absolutely fantastic language teacher because she goes above and beyond the call of duty in order to give her students the best possible experience. Her carefully crafted lessons go beyond the Dutch language and touch on Dutch culture and literature. After leaving her class, I feel as though I have a solid grounding in all aspects of Dutch life.\nWijnie is the entirety of Columbia’s Dutch department. Her lessons are all self-made, which means she is able to customize her classes based upon her students' interests. She works extremely hard to ensure that each of her students stays interested in engaged with her material. This keeps her classes fresh and interesting, as they are constantly updated and revamped. If anything interesting happens in the Netherlands, she'll come to class armed with news clips and articles. She organizes a number of activities outside of class hours, like Dutch dinners or theatre. She also takes a deep interest in her students, acting as both a friend and a mentor. By the time class ends, you’ll have learnt more Dutch than you ever thought possible.\nI cannot recommend her highly enough. If you have any interest in the Dutch language — any at all — I'm sure that there is no better teacher than Wijnie in all of New York.\n\n\nWorkload:\nCustomizable. Wijnie gives her students more material than is necessary to follow along with her classes. If you want to skim the week's articles, you will still pass, but you’ll acquire less new vocabulary and grammar than reading everything she offers. \n\n"
        },
        {
            "course_name": "Advanced Dutch II",
            "review_date": "May 17, 2010",
            "review_content": "\n\nWijnie de Groot is one of Columbia’s hidden gems. She is an absolutely fantastic language teacher because she goes above and beyond the call of duty in order to give her students the best possible experience. Her carefully crafted lessons go beyond the Dutch language and touch on Dutch culture and literature. After leaving her class, I feel as though I have a solid grounding in all aspects of Dutch life.\nWijnie is the entirety of Columbia’s Dutch department. Her lessons are all self-made, which means she is able to customize her classes based upon her students' interests. She works extremely hard to ensure that each of her students stays interested in engaged with her material. This keeps her classes fresh and interesting, as they are constantly updated and revamped. If anything interesting happens in the Netherlands, she'll come to class armed with news clips and articles. She organizes a number of activities outside of class hours, like Dutch dinners or theatre. She also takes a deep interest in her students, acting as both a friend and a mentor. By the time class ends, you’ll have learnt more Dutch than you ever thought possible.\nI cannot recommend her highly enough. If you have any interest in the Dutch language — any at all — I'm sure that there is no better teacher than Wijnie in all of New York.\n\n\nWorkload:\nCustomizable. Wijnie gives her students more material than is necessary to follow along with her classes. If you want to skim the week's articles, you will still pass, but you’ll acquire less new vocabulary and grammar than reading everything she offers. \n\n"
        },
        {
            "course_name": "Elementary Dutch",
            "review_date": "December 16, 2006",
            "review_content": "\n\nOw! The secret to this course, before you take it, is that 90 to 100% of the people that take it already know Dutch to some degree (like, they've been speaking it at home for ten years but can't spell so great). So if you know nothing, you're going to get brutalized. And there isn't a lower-level course.\nThat said, I do like Professor de Groot and can't blame her for the way the class works, since she's just working with what they give her. The class is extremely structured and straightforward with a good approach to the material -- you come out knowing a bit more than you usually would in one semester of a language course. She's flexible with assignments and deadlines, and generally easy to get along with, and the class never gets too intense. Grading is pretty forgiving.\n\n\nWorkload:\nOne homework every class (usually a cakewalk with a short writing assignment), pretty frequent quizzes which aren't too tough either.\n\n"
        },
        {
            "course_name": "Dutch III",
            "review_date": "December 11, 2006",
            "review_content": "\n\nDutch is a language with unique ties to English. If you have ever had the opportunity to live in or travel extensively to Belgium, the Netherlands, or even Indonesia or Suriname, you will appreciate this course. It will certainly benefit the art student of the Old Masters, as her course draws students from the New School and N.Y.U. Art Departments too.\nWijnie de Groot is a talented professor who utilizes subtle techniques in teaching her course. I have followed through with Wijnie from Dutch I through Dutch III over the past three years, and she has set out a relaxed learning environment which allows students to appreciate Dutch culture, history and interaction with other cultures as well such as the Muslims in the Netherlands. \nDe Groot's classes are enjoyable. When the clock ticks onto the minute class is scheduled to begin, Wijnie holds the class entirely in Dutch. She will be happy to explain any confusions you may have, and she is altogether an excellent teacher.\nOverall, Wijnie de Groot is a sensitive professor whose learning techniques will help you with your Dutch, while learning in a casual environment as you would expect in everyday life in the Netherlands or in Belgium. The course will challenge you academically, but will not stress you out in ways other classes do. The point is to learn a language and appreciate a culture that has weened down from a political, economic and artistic powerhouse to an historical, cultural, artistic and business respect in light of a modern XXIst century educational approach.\n\n\nWorkload:\nThe course workload is entirely up to you. You will be required to learn vocabulary for each lesson and read one paper per class on which an essay is often expected. Wijnie is flexible but not a pushover. If you keep abreast of your work, you will likely receive an A or an A- in this class. One semester, I even received an A+. With assiduous class participation and a focused effort, you will easily do well in Wijnie's classes.\n\n"
        },
        {
            "course_name": "Dutch 1101",
            "review_date": "January 17, 2003",
            "review_content": "\n\nProfessor de Groot is an excellent teacher in that she is very open to class discussion and questions. She obviously wanted everyone to understand Dutch and improve their speaking abilities; she answered dozens of personal questions right in class. We did lots of drills and speaking exercises. The professor has a nice sense of humor and often invited us to Dutch themed events on and off campus. I enjoyed learning Dutch with her. However, due to the small class size and funding, the course felt unstructured at times, and she gave us a lot of extraneous material which she would inform us \"we wouldn't have to know.\" This was a waste of time to me; why should we look over two dozen words on kitchen appliances if we don't need to know them? But the class was easy and enjoyable overall.\n\n\nWorkload:\nI think this class was easy for most people, because she gave us short, easy homework assignments. We had a chapter quiz/test about every other week. Everything was manageable and enjoyable.\n\n"
        }
    ]
}