{
    "prof_info": [
        {
            "prof_name": "Anand Deopurkar",
            "prof_id": 11932,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Analysis and Optimization",
            "review_date": "May 23, 2016",
            "review_content": "\nDeopurkar is a very good teacher. It’s a pretty standard math class. Weekly problem sets, some were easy and some were hard. The 2 midterms were pretty straightforward, with problems that were similar to the homeworks and practice problems. The final was pretty hard for me- it seems like he made the problems more tricky than the midterms, and some of the calculations just didn’t work out for me. \nDeopurkar’s class notes are very good. You can definitely learn the material just from his lectures and notes. He has an accent but he is perfectly understandable. He is a good lecturer and knows how to explains things. No complaints!\nWorkload:\nWeekly problems sets (15%)- usually had mostly straightforward problems, then 1 or 2 more difficult problems.\n2 midterms (20% and 25%)- no surprises, pretty straightforward\n1 final (40%)- was more difficult. No surprises in that I recognized the problems and the process for solving them, but the work was more tricky\n\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "May 06, 2015",
            "review_content": "\nDr. Deopurkar is the best professor I have had at Columbia (1 year). Dr. Deopurkar has the uncommon ability to take a seemingly abstract and/or complex idea and break it down into steps that are understandable. The pace of the class is slow so if you are passingly familiar with calculus you will do fine. \nMost importantly, there is a high correlation between what is taught in the class and what is on the exams. There are no curveballs. He will definitely ask you the most challenging version of a concept SOMETIMES (IE, a more difficult limit vs. an easier one) but it is all stuff that was either on the homework or covered in class. By the time that the test comes, if you can do the homework and get them all correct without having to get help, then you can get a 100% on the exam. Quite doable. Other professors in other departments don't have as high of a correlation between material on the exam and material covered in class. Just want to stress again that he didn't have any curveballs; this alone makes his class worth taking because you know what to expect. He puts out multiple practice midterms and finals for each test so there is no shortage of material to practice with. \nOn a downside, he seems fairly busy and doesn't seem to make a whole lot of time for students, as far as I can tell. I never really sought out his help but I know that other students have had a hard time getting a hold of him. However, the math help room can answer any questions you need answered so honestly I don't think this is that big of a deal, unless you're just trying to get face time with him or something.\nThe average for midterm 1 was 68% +/- 18% and the second midterm was very similar, I think 70% +/- 18%. Don't know about the final yet. \nI would take him for any class I needed. I am sure that his teaching and class administration style carry over from subject to subject. \n\nWorkload:\nOne problem set per week (3-7 hours of work, 20% of your grade, drop the lowest 2), 2 midterms (20% of your grade each) and one final (40% of your grade). \n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "December 26, 2013",
            "review_content": "\nAnand deserves a gold nugget!!! He is the best professor I have had a Columbia. Modern Algebra is an awesome class, and Anand made it thoroughly enjoyable. This guy is a fantastic teacher, and seems to do his best to ensure that every student understands what's going on at any given point during the lecture before he moves on. Plus he manages to do it all without notes, which is incredible. He is very approachable, and I encourage anyone who takes a class with him to go to office hours all the time. I was always amazed by his ability during office hours to clearly present one way to prove something, and then find some other beautiful way to prove it that made it even more clear. But the best thing about Anand is how openly he loves the material, and I found his enthusiasm to be contagious. Overall, I totally encourage anyone to take this class, and I feel bad for anyone who doesn't get the chance to take it with Anand!\nWorkload:\nThe weekly homework and 3 exams were somewhat challenging but definitely doable, and office hours were really helpful for the homework. I think the averages for the exams were normally about 35/50. The homework was also very worthwhile (except the last one where we had to classify almost all groups up to order 30, which I thought was kind of tedious).\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "September 20, 2013",
            "review_content": "\nDeopurkar is genuinely a kind person. He is approachable during office hours. But contrary to the over exaggerated reviews on culpa, his teaching style is if anything, average.  I think people are just blinded by his adorable personality. Another reason why people are raving about him might be because the math department in Columbia is pretty sad when it comes to teaching undergrads. Yes, do take classes with Deopurkar, because you can do a lot worse. But don't expect him to be the best math teacher either, like some of these reviewers are claiming. \nI studied both calculus II and III with Deopurkar. Somehow I found his calc II class more difficult than Calc III. I'm not sure why this happened because a lot of people find calc III more challenging. Also, expect exam questions that require you to think outside the box. He gives some difficult exam questions, which in the long run, is good for you if you are planning on majoring in the sciences/engineering/math. However, if you're a premed student who cares a lot about your grades, I suggest that you consider carefully before signing up with him. Definitely not a guaranteed or easy A even if put in a lot of hours studying. \n\nWorkload:\nweekly problem sets\nmidterms were many times more difficult than the final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "September 03, 2013",
            "review_content": "\nExcellent teacher. Anand is incredibly friendly and extremely helpful. His lectures involve a combination of notes, which he often writes on the board, and going over homework/test problems. One of my favorite teachers at Columbia. Read the textbook, and use the lectures to clarify anything that might not be clear to you. He is very knowledgeable, provides clear notes and really makes the class more enjoyable. The tests are extremely easy/straightforward if you do the homework sets and practice exams. Also, make sure to use the Math Help Room if you don't understand the HW problem, because getting 100% on the HW can really boost your grade. The grade breakdown is: 20% HW, 15% worse midterm, 25% better midterm, 40% final. He tries his best to make sure everyone gets at least a decent grade. An A is definitely doable, and even an A+ if you are good at Calc and put in the time and effort. I HIGHLY RECOMMEND THIS CLASS!\nWorkload:\nWeekly problem sets, two midterms, and a final. All straightforward and easy if you do the numerous practice midterms/finals he provides.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "July 08, 2013",
            "review_content": "\nYes, yes, yes.  This is what I'm talking about.  Harvard didn't raise no fool.  This guy is too good to be true.  Crystal clear, insightful, with some focus on why things the way they are, very very friendly and appreciates ANY question, I repeat ANY question.  I mean there were stupid questions and he would try to answer and reapparoach from different angles.  This is the art of teaching mathematics.  While calc is some prereq that everyone has to take, so your not going to have an outer body experience, but he really impressed me.  Don't get me wrong, this is not an easy A.  You will learn though, and learn the right way.  The exams are so well written, creative but not rediculously hard.  Good amount of homework, but right outa the book.  He is very approachable during office hours and is very very funny.  We need more Anand's in this world... And on top of all this, this master is so modest that when our class ended and people just had to applaud him because they have had their fill of ivy league crooks, Anand was so shocked and appreciative, he didn't realize how brilliant he was... haha.\nWorkload:\nHW was weekly, TA's are rough graders.  3 exams and a comprehensive final, they were NOT easy, just warning you.  I mean I'm good at math and busted my rear, and barely, barely got an A.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 18, 2013",
            "review_content": "\nAnand is easily one of the most cheerful and energetic professors I have ever come across. He is genuinely excited to teach his students, accommodates students' queries and concerns and genuinely cares about them. He even devotes the class before each midterm (and the last class of the semester before the final) to a review of the material that will be tested on the upcoming exam. His explanations are clear and logical - he goes through what he's writing on the board slowly and carefully, even when deriving formulas that students are only expected to apply and not derive on tests. I would definitely recommend taking Calculus III with him.\nWorkload:\nWeekly problem sets that take about 2 hours each to complete\nTwo midterms (the better one counts more)\nOne final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 07, 2013",
            "review_content": "\nAnand may be the best teacher I have ever had. There was not one day that he didn't walk into class with a big grin on his face. The fact that he bring so much energy to the classroom, genuinely excited to present the material, gives me hope that there are actually professors out there, like him, who care. Better yet, he regards his students as peers, not just faces. He listens to what they want, asking them what he needs to do to prepare them for a test, asking them when they want him to be in his office for office hours (he's having them two hours every day for the entirety of readings week), etc. The class itself is pleasant and the material is enjoyable to learn. Two midterm exams (the one you score better on counts for more) and the final (40%). Homework counts for 20% and is by no means difficult. \nTake this class with Anand. Best class I took this year with the best professor I've had. \nWorkload:\nJust one homework set per week. If you go to lecture, it should take you no more than 90 minutes to finish.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 18, 2013",
            "review_content": "\nANAND IS MY BOOOOO!!!! But actually though he is probably my favorite professor at Columbia so far. Such an adorable, likable character. He is so enthusiastic about the subject matter he teaches and breaks down even the most complicated of subjects making them very easy to understand. Even if by the end of the lecture you are still struggling, he is more than happy to help at his office hours. I took both Calculus II and III with Anand and could really tell that he wasn't just regurgitating information from a textbook or lecture presentation. He really wants his students to be able to understand the concepts and ideas behind the formulas. \nBasically if you're taking a math class and have the choice to take it with Anand. DO ITTTT. You will not regret it in the slightest and will come out with a clear knowledge of the underlying concepts of the subject matter. \nDid I mention Anand is adorable?? \nAlso first week of spring semester he was stuck in India cuz the goofball lost his passport and visa LOL! \n <3 Anand!\n\nWorkload:\nVery light. 1 problem set each week due the first class of the next week. 2 midterms, the one you did better one counts slightly more, and 1 final. For the exams he makes it crystal clear what he expects you to know and the practice exams are verrry similar to the actual exam. TAKE THIS CLASS.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 03, 2013",
            "review_content": "\nBasically, Anand Deopurkar is one of the best calculus professors on campus. He gives very clear and concise lectures, which I find key in any calculus course. His problem sets and exams are very simple and straight forward. He gives a few practice exams to prepare for both midterms. It is a very easy class and requires minimal effort/work. As a math major, I found it to be an easy A. Looking forward to taking future classes with this prof!\nWorkload:\nWeekly problem sets, 2 midterms (the midterm with the better grade is weighted more), and 1 final. \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 19, 2012",
            "review_content": "\nAmazing, amazing, amazing educator. did I mention that he's amazing? after not taking math for my entire freshman year, I decided to take calc 2 because I thought I wanted to be a math major (not anymore; I'm not as passionate about it as I thought). I'm so grateful that I got into Anand's class - his explanations are concise and well-thought out. He is available whenever you need to ask questions, and he also usually replies to emails within the hour. The first half of the semester was a little bit of a struggle for me personally because I was getting back into the groove of quantitative thinking. But after the first mid-term, things cleared up. If I can do well in class, anyone can. You just have to put your best effort in, and Anand will meet you more than halfway. I went to his office often, almost weekly, to ask questions on homework and practice tests - he is the least judgmental person. I've asked my share of stupid questions, but he wasn't condescending at all - instead he would try to explain the problem in a new, different way that made more sense to the way I was thinking. \nI wish I could take calc 3 with him next semester, but I already took it this semester with another professor who was terrible...\nIn short: Anand really cares about his students and about them ACTUALLY learning; he's fair and super helpful; he's amazing. \n\nWorkload:\nWeekly problem sets; 2 midterms; 1 final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 15, 2012",
            "review_content": "\nAnand is a fantastic teacher. He is very enthusiastic about teaching and clearly cares that his students understand the material well. He is a good lecturer and is able to effectively write problems on the board. He is exceedingly fair on tests and is true to his word that he will never put something on a test that we haven't already done in class/home work. If you study and do the problem sets, the midterms are very reasonable. Calc II is definitely a harder class than Calc I, but Anand makes it easy to learn and (perhaps) enjoyable. \nWorkload:\n2 Midterms, 1 Final, Weekly Problem Set\n"
        }
    ]
}