{
    "prof_info": [
        {
            "prof_name": "Maria Luisa Gozzi",
            "prof_id": 106,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Intensive Elementary Italian",
            "review_date": "May 18, 2009",
            "review_content": "\nGreat teacher! She makes class really interactive and fun. She uses Youtube and Pop Culture a lot which makes class really easy to get through despite the massive amount of work you do. I felt like I learned more Italian in one semester than all the foreign language I took through high school. \nWorkload:\n A LOT. A chapter test every week. Daily homework assignments that take at least 2 hours to do. But it's not hard work, just time-consuming. You can do it while listening to music though.\n"
        },
        {
            "course_name": "Intensive Elementary Italian I",
            "review_date": "December 12, 2008",
            "review_content": "\nThis was a great class. Gozzi is entertaining and hilarious and always keeps the class interested. I feel that I have truly learned a lot of Italian, and although there is a TON of material to go through, I never felt too rushed. I would definitely recommend this course, even though it is a big time commitment. Gozzi creates a nice class atmosphere and everyone gets to know each other, which is nice. Intensive elementary  is well worth the workload, and is a good investment of your time. \nWorkload:\nNot too bad for a 6 credit course. workbook assignments, weekly quizzes, an oral presentation, and some compositions\n"
        },
        {
            "course_name": "Intensive Intermediate Italian (I and II) ",
            "review_date": "September 12, 2007",
            "review_content": "\nThis woman glows confidence.  She does not simply walk into a room: she bestows her presence upon the room and graciously allows the rest of us to remain.\nI immensely enjoyed this course and intend to take additional courses with this instructor if I can manage it.  Language is so much more than grammar, and especially with Italian, which represents such a multifaceted people, it is essential to consider what lies beneath the surface.  This instructor understands that perfectly and has gone far above the call of duty with the level of cultural information she integrates into her teaching.  It is obvious that the course is constantly evolving, as well--for example, she incorporated YouTube videos into our content when YouTube was still a babe in swaddling clothes.  Yes, there is a mountain of homework, but there is not an ounce of waste in that mountain.\nThe other reviews here provide an accurate enough picture of this instructor's disarming personality, but do not mention the substance beneath the charm.  It is this depth, and not her entertainment value, that makes me respect her as a human being as well as a teacher.  She clearly lives life fully and considers her students integral parts of that life rather than obstacles to its progress.  She cares about her students not in the convenient, temporary way that many instructors do, but with honesty, wisdom and respect.  \nIn short: I am happy to have taken this class and honored to know Maria Luisa Gozzi.\n\nWorkload:\nA mountain worth climbing.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 08, 2007",
            "review_content": "\nVery good teacher.  I was amazed at how well she controlled the class and kept us interested and entertained, especially for the first half of the semester. \nIt seemed as though the second half, when class motivation was lacking, she was unable to lift everyone's spirits all the time.  However, for those that wanted to be there, she was always extremely helpful and made the material clear. \nYou can't go wrong with Maria Luisa, people.  You won't regret having chosen her. \nWorkload:\nnormal for Italian department, 4 quizzes where she dropped the lowest, midterm, final, compositions.  A lot of the busy work is not collected unless you want it corrected, so it didn't always have to be done. \n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 18, 2004",
            "review_content": "\nProf. Gozzi is the best! Her classes fly by because they are actually fun and the work load is not at all painful. She explains each topic very clearly and as long as you pay attention, minimal studying is necessary.\nWorkload:\nquiz every other week, italian compositions every week, and some basic italian dept. busy work\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "December 31, 2003",
            "review_content": "\nProf. Gozzi is a good instructor. She is pretty organized, and has a nice personality. I thought that her best quality was that she dedicated a significant amount of class time to explaining the topics covered in the textbook. Course content was basically a repeat of Beginning II, but went more in depth. \nWorkload:\nStandard Italian Dept. assigned work. Easy midterm, rather challenging final. No book excersizes, weekly compositions. \n"
        },
        {
            "course_name": "Advanced Italian",
            "review_date": "December 16, 2003",
            "review_content": "\nProfessor Gozzi's vagueness (perhaps characteristically Italian) can be a bit annoying: she's not always clear about what particular assignments are, when things are do, and so forth.  This became a particularly problematic issue at the end of the semester.  The class on the whole is rather loosely structured, which makes it relatively low-stress, but perhaps not the most intensive way to learn a language.  These drawbacks aside, the class was always enjoyable and entertaining, although it often felt more like a casual conversation and reading course than a high-level language course.\nWorkload:\nNot bad.  Usually one short composition a week, as well as small amounts of reading for each class, and occasional grammar exercises.  No midterm, and an easy final.\n"
        },
        {
            "course_name": "Intensive Elementary Italian I",
            "review_date": "July 23, 2003",
            "review_content": "\nI adore Professoressa Gozzi!  I would highly recommend both her and this class to anyone interested in taking Italian.  She moves quickly through the material but never leaves you feeling rushed or left behind.  By the end of one semester of Italian, I was astonished at how much IÂ’d learned.  Bottom line: Gozzi is amazing.  IÂ’m even contemplating taking her rapid reading and translation class (which, honestly, IÂ’ve no use for) just so that I can be in her class again.  \nWorkload:\nThe workload was what IÂ’d expect from a 6 credit class Â– a decent amount but totally do-able.  \n"
        },
        {
            "course_name": "Rapid Reading & Translation",
            "review_date": "January 28, 2003",
            "review_content": "\nWith all seriousness, Maria Luisa Gozzi is perhaps the living, breathing antithesis of competent instruction. For instance, on the first day of class, she wrote EVERY VERB TENSE on the board in completely illegible handwriting (consuming 2 hours) -- not the best way to introduce students with LITTLE TO NO KNOWLEDGE OF ITALIAN to the language (or her handwriting--which did not improve).\nClass assignments and discussions seem to be as random as the number of meatballs in the Jay Hall cafeteria's unpalatable spagetti. Not to mention as PAINFUL.\nWorkload:\nIf you are still considering this class, then you can't read English. Should you take the class, you will continue to be unable to read Italian.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 24, 2002",
            "review_content": "\nThe bottom line: Maria Luisa Gozzi is the best professor I've had at Columbia in my two years here. This elegant, calm, witty Italian will leave you impressed. However, she expects her students to work as hard at making class interesting as she does. Class is a lot of conversation, rather than the usual lets-study-more-rote-grammar-exercises; this is where Gozzi really shines. Conversation with Gozzi is uplifiting, intelligent, and remarkably witty. In her well dressed Italian style, I almost think she should be a fancy socialite on the upper west side. If nothing else, Gozzi will charm you and leave you in love with Italian.\nWorkload:\nNot a slacker when it comes to assigning work, Gozzi will give you enough homework to keep you busy for a little while, but not enough to bore you to tears.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 24, 2002",
            "review_content": "\nThe bottom line: Maria Luisa Gozzi is the best professor I've had at Columbia in my two years here. This elegant, calm, witty Italian will leave you impressed. However, she expects her students to work as hard at making class interesting as she does. Class is a lot of conversation, rather than the usual lets-study-more-rote-grammar-exercises; this is where Gozzi really shines. Conversation with Gozzi is uplifiting, intelligent, and remarkably witty. In her well dressed Italian style, I almost think she should be a fancy socialite on the upper west side. If nothing else, Gozzi will charm you and leave you in love with Italian.\nWorkload:\nNot a slacker when it comes to assigning work, Gozzi will give you enough homework to keep you busy for a little while, but not enough to bore you to tears.\n"
        },
        {
            "course_name": "Rapid Reading & Translation",
            "review_date": "December 31, 1999",
            "review_content": "\nI'm happy to write a few words about Professor Gozzi because I took her course in Italian translation and it was one of the best classes I've had at Columbia. Professor Gozzi has a real flair for language; she enjoys working with the nuances and other expressive qualities of Italian and English, and she's gifted with a light mocking wit that makes the time spent in her classroom an enjoyable experience. The workload was moderate, and she appreciated the time and the effort put into getting it done. She conducted class in a relaxed and friendly but purposeful manner; we laughed a lot, but we also got a lot of work done. This is the kind of class that you can't take too often at Columbia. We enjoyed it so much that we went all went out to dinner together one time and then threw ourselves a party at the end of the semester. I think she's among the best Columbia has to offer. She has a way of bringing out the best in you; you come out of her class feeling more intelligent than perhaps you really are, but this gives you great confidence anyway. It's a question of knowing how to motivate her students; if for no other reason, you want to do well in her class because it's fun to engage with her very intelligent and cultivated and clever mind. She says things that catch up with you later and you realize how funny they are. She was easily approachable outside the classroom, and seems to genuinely enjoy the contact she has with the students. Her frankness keeps you on your toes, however, you can't play the fool with her. She lets you know that she expects the best from you, and if you at least try your effort won't go unnoticed. You'll want to do a lot more, though. She's sympathetic, intelligent, clever, elegant (not a typical feature of professors), witty and demanding--you can't do much better than this. You'll come out of her class a better person than when you went in.\nWorkload:\nWeekly translations of articles drawn from a diverse range of Italian periodicals; occasional quizzes; background work on grammar and structure; a mid-term, a final.\n"
        }
    ]
}