{
    "prof_info": [
        {
            "prof_name": "Logan Brenner",
            "prof_id": 12922,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "August 24, 2014",
            "review_content": "\nTERRRIBLE COURSE. I completely agree with the comment below. it was misleading and Goran taught nothing. Hes cute and old and sweet but trust me under that endearing accent is a man with no clue how to successfully and properly assign homework, write a test or run a course. \nEvery single student of his was disappointed with his actions and misleading behavior and every single student in Logan Brenners TA class was automatically given a disadvantage because she was the HARD TA and unjustly took off points. Best part is she had no idea what the hell she was doing and looked cometplely confused and lost the entire course and the entire time she was teaching. I felt like I taught myself for a full semester, they did absolutely nothing to help or teach any student. \nThis class was a mess, AVOID EKSTROM AND ESPECIALLY AVOID LOGAN BRENNER AT ALL COSTS!!!!!!!!!!!! \nWorkload:\ndoesnt matter, youll get two grades below what you deserve anyway. \n"
        },
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "May 18, 2014",
            "review_content": "\nIf you get Logan as your TA run as fast as you can. Not only is she a terrible person and TA, she genuinely has no idea what she's talking about. It's not a matter of the class she teaches being hard or challenging, it's a matter of Logan not understand the material and having absolutely NO consistent grading rubric. She just takes off points wherever and whenever the hell she feels like with no explanation and no justification and 100% of the time are taken off for CORRECT answers. When I came in to see the professor and talk about this problem\nIn the class (environmental risks and disasters) not only were both the professor and TA completely clueless as the WHY the points were taken off because they shouldn't have been, in order to cover up their mistakes and inconsistencies they ended up going back and taking off other points on a completely unrelated section of the homework I was asking about. This particular TA is so ridiculously  bad and this class is even worse. The class is based probably over 70% on OPTIONAL discussion sections and they never tell you this. In fact when someone asked how much math would be required for the course, the professor ( Goran ekstrom) himself said there would be NO calculator and only third grade math. Not only did I come out of this having to learn statistics, economics, trigonometry and calculus, a calculator was REQUIRED for every single homework and every single exam. All in all do NOT take this course and AVOID  Logan at all coats. Both professor Ekstrrom and Logan need to go back to college to learn how to teach and how to have standardized grading. I couldn't have HATED this course more and I truly feel every person I know in the class feels the same. The homework was unnecessary and took hours every week and had nothing to do with anything and  the exams were graded by people who don't know the material at all. AVOID AVOID AVOID. Have never had so bad an experience in any course. The class was completely unorganized and hypocritical. \nWorkload:\nA lot of unnecessary math on homework that took hours and was NEVER explained in lecture. Not as if it was just briefly mentioned, it was NEVER gone over and we were expected to learn everything on our own. The tests and homework were unfairly graded every single time so no matter what/how hard you study you'll never do well. Sorry but just don't take this class. \n"
        }
    ]
}