{
    "prof_info": [
        {
            "prof_name": "David Scott",
            "prof_id": 2077,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Anticolonialism",
            "review_date": "January 02, 2010",
            "review_content": "\nI cannot begin to describe how awesome this professor and this class are (but I'll do my best). The class involves reading 5 different anticolonial texts (Black Jacobins, Hind Swaraj, Discourse on Colonialism, The Colonizer and the Colonized, The Wretched of the Earth) and discusses them at length in class. The reading load and workload are fairly light--Prof Scott's goal is that his students engage with the material and really gain an in-depth knowledge of the works. The discussions integrated philosophy, history, anthropology, and current events, and each student brought a different angle to the table. Discussions were really fascinating and Professor Scott really pressed us on our points; he doesn't let you get away with BS. He does sometimes slip into anthropological jargon but really he's intelligent, friendly, and an all-around awesome teacher. If you have any interest in 20th century history, colonialism, or Caribbean studies, I would highly recommend this class. \nThe only downside to Professor Scott is he's kind of disorganized and hard to get in touch with. But it's honestly a very small minus. And once you do meet with him, he is really involved and interested. He cares deeply about his students and about the material--you will want to do the work. TAKE THIS CLASS! \nWorkload:\nlight reading load (80-120 pgs/wk) but you have to know the material well. Participation in discussions is expected and each student leads one discussion during the semester.  Take-home midterm (6 pgs) and final 15-pg research paper (on any topic related to anticolonialism). He's a generous grader as long as you are engaged and put in the work. \n"
        },
        {
            "course_name": "Ideas and Society in the Caribbean",
            "review_date": "May 07, 2009",
            "review_content": "\nI have heard Professor Scott referred to as a \"cuddly teddy bear\" more than a few times, which really makes me a bit upset. It's not quite the way to address any intellectual, and in doing so you are perpetuating an image of this professor as a non-serious intellectual, which is not in any sense of the word, true. (not to mention, possibly continuing the stereotype of the Caribbean as a non-serious place?) \nProf. Scott has interviewed some of the most prominent Caribbean scholars of our age, and certainly thinks critically about every issue that arises from the texts. Unlike other professors who rush by concepts unchallenged, he speaks and converses with you in the seminar, and allows himself to be challenged by the input you give to the discussion, which is (unlike what another reviewer said) the total opposite of egomaniacal. If you consider Prof. Scott egomaniacal, you have clearly not taken many classes in the anthropology department. \nThe Caribbean is currently underscored in the anthropological tradition, and is remembered by the white intellectuals that discussed the problem of the Caribbean (Mintz) and not the Caribbean intellectuals who discussed the problem themselves. (Why?) This is certainly a shame, and this is an excellent class for those who would like to get an applied understanding of the issues that arose from the anthropological crisis that emerged from the postcolonial movement. instead of talking about what might theoretically be done, it has a lot to do with the practical issues of how intellectuals from within the a recently post-emancipation state theorized and responded to the changes in society. \nWorkload:\nnot a ton of reading, which is perfect for in-depth analysis\ntake home midterm; final essay \n"
        },
        {
            "course_name": "Ideas and Society in the Caribbean",
            "review_date": "January 29, 2008",
            "review_content": "\na silver nugget! that's a horrendous assessment of this professor who may look like a cuddly teddy bear but is in fact a raging egomaniac, so intoxicated with the sound of his voice and in awe of his pedantic discourse that he barely notices that his students are dying of boredom.\nThis class is some existentialist, theoretical, superfluous bullshit and if you want to learn anything practical and real about Caribbean society, this is not the place. However if you want to learn about post-modernist intellectual theories of discussing the Caribbean without the use of a western language or its derivatives, you're in the right place.\nSadly, I see no practical value in this class, but if you enjoy philosophy, go for it. \nWorkload:\nNo need to participate in class discussion, he'll do all the talking for you. A take- home mid-term 30% of your final grade and ten page final paper.\n"
        },
        {
            "course_name": "Anticolonialism",
            "review_date": "April 22, 2006",
            "review_content": "\nThis seminar was one of the best I have taken at Columbia.  Scott chose 4 canonical texts that examined the ideology of post-colonial struggle and anticolonial thought.  His calm and calculated way of speaking is never egotistical. He speaks slowly, carefully and  thoughtfully, and is a consumate expert on post-colonial intellectuals (takes one to know one I guess).  He challenged students to go further with his common utterance of \"let me press you on that...\". While most of the anthro seminars I have taken suffer from an excess of reading that can never be covered in 2 hours a week, this class was truly about close reading.  One of the books we covered, 'the Wretched of the Earth', is also a CC staple.  However, in many CC classes it is briefly covered at the end of the 2nd semester. This class really did Fanon, James, Cesaire and Memmi justice. I was exposed to a tradtion that I had no real connection to before.  Anticolonialism is a great combination to CC because it highlighted oft ignored intellectuals of the African Diaspora. If you have any interest in post-colonial studies or prefer amazing professor who constantly challenge you to think, David Scott is your man. \nWorkload:\nNot a lot of of reading, but the expectation is that all reading is done with careful attention. Four 5 page papers (one per book). Final 15 page paper using text and examining an aspect of anticolonialsm. Average for a seminar...\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 26, 2005",
            "review_content": "\nYeah, he's a cuddly teddy-bear. Such a sweetie! He lectures rather than promotes discussion, but his lectures are really interesting. You will get an A (definitely) and you'll even learn something as a bonus.\nWorkload:\ntwo papers generously graded, midterm and final for which he gives the questions in advance\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 11, 2004",
            "review_content": "\nHe is a cuddly teddy-bear. He wasn't the most organized CC teacher ever, but it was his first time. He is of course incredibly smart and I learned a lot about the books, but he didn't quite get the class discussion rolling every time, although that was in part the fault of the students. He is a very generous grader and \"doesn't believe in surprises\", meaning he tells you what to expect on the midterm and final. I hope he gets to teach CC again because he could get really good at it. If you get him, keep him.\nWorkload:\ntwo papers (only 3 to 4 pages), midterm, final (4 or 5 short essays, NO ids!)\n"
        }
    ]
}