{
    "prof_info": [
        {
            "prof_name": "Nancy Worman",
            "prof_id": 882,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "Tragic Bodies",
            "review_date": "April 09, 2015",
            "review_content": "\nNancy Worman is one of the best professors I have ever had. As another reviewer put it, she is staggeringly intellectual without forgetting to be realistic, empathetic, and even sassy. She never sacrifices intellectual content in order to make it \"easy\" for students, but at the same time, she understands that not all students share the same background (I was a non-Classics major taking the course with a few very well-read Classics majors) and is completely willing to pause and explain a tricky theoretical concept. \nMost importantly, although she is indeed \"intimidating\" - as some other reviewers put it - in the sense that she's basically incredible, she will never talk down to students. And she is completely uninterested, unlike some brilliant professors, in having students fangirl over how perfect she is. (Although we do.)\nI took Tragic Bodies to fulfill my visual arts requirement while staying as close to literature as possible, so that's my bias. But I think it was the most consistently interesting course I have ever taken. The syllabus begins with Greek drama and moves as the semester progresses to Shakespeare, Tennessee Williams, and movies like Paris is Burning, Her, and Peter Greenaway's creepy artsy films. Another feature I appreciated in the course is that it incorporates canonical and non-canonical works and theories seamlessly. You will read Greek drama and Kristeva, but you will also read Fugard, Hrotswitha, Bataille, etc. Anyways, I feel like I'm getting a little nitty-gritty here. The point is that this course is the best. \nWorkload:\nA pretty fast-paced amount of reading. And she will know if you do not do it.\n"
        },
        {
            "course_name": "Elementary Greek I",
            "review_date": "May 17, 2013",
            "review_content": "\nAs one would expect, this class was focused on the fundamentals of Greek: basic vocab, grammar and syntax were the rule. A year in, you should have a really serious foundation. Professor Worman made this class worthwhile and surivavable. She's first-rate teacher, and this is a class that requires four hours of serious in-class teaching every week. On top of that, she was extremely approachable and was always willing to help. That she takes her students' learning very seriously was evident throughout, which is reflected in her grading (see below) and I am so glad that I took this course with her and not with a grad student. She seems to have a great deal of background in the linguistic history of Greek, and always had an interesting exegesis of the passages we read in the second semester. Finally, it helps that she's genuinely lovely and interesting person, as the material is somewhat grueling. \nProfessor Worman, at least, assigned written homework every other class or so. It averaged 2-3 hours, and at one point in the first semester ballooned to 5-6, but she cut it down when we told her. There were also readings in the second semester which averaged about an hour of work. We normally had a quiz every two or three weeks and two tests over the course of the semester, although there are supposed to be three. There is also a final. Professor Worman is a very light grader, as she cares about learning the language, not about tanking your GPA. The class, however, should not be taken lightly. The language is truly difficult and the class is not one that can ever really be blown off. \nWorkload:\nAbout 4 hours of homework per week, 4 or 5 quizzes over a semester, 2 or 3 tests, and a final. \n"
        },
        {
            "course_name": "Introduction to Comparative Literature",
            "review_date": "February 15, 2011",
            "review_content": "\nProfessor Worman is phenomenal. She is, to put it simply, the best teacher I've had at Barnard or Columbia. Professor Worman understands that by assigning less reading and by choosing it very carefully, it is possible to get much more out of each assignment. Her careful examinations of each reading gave me a deeper and more focused understanding of the subject matter than is usually gained in classes where hundreds of pages are assigned each week. Worman's lectures are smart, detailed, and avoid generalizations; she's not afraid to struggle through nuances to gives her students a more precise understanding. She also has an awesome dry sense of humor; for some reason, some students find this scary or off-putting, but I have no idea why. She is also friendly and approachable and something about being in her presence makes you smarter. \nAs a reviewer a few years ago put it: My new goal is to be Nancy Worman.\nWorkload:\nNot too bad. Often just 20 pages per lecture - just make sure you read it all. \nAlso, a short translation project, a midterm, and final.\n"
        },
        {
            "course_name": "Intro to Comparative Literature",
            "review_date": "January 23, 2011",
            "review_content": "\nI never review professors. But after reading through the reviews below, I felt it absolutely necessary. Firstly, I read these reviews before taking her class. And I remember, at about halfway through the semester, wondering what in the world these people were talking about. \nI don't have enough words of PRAISE for Professor Worman. This is a woman who is a true intellectual, yet she serves up that intellect with a bit of sass and personality. This is someone who seems to strike a divine balance between being a professor and being a very approachable and amiable person. Professor Worman knows her stuff and welcomes students to bring their own knowledge to the table. This past semester she was chair of the department and she always seemed to have enough time for every single student that walked through her door for office hours.\nPlease. Take a class with Worman. This woman is a gem. \nWorkload:\nVery manageable. Because she assigns less homework, everyone comes to class prepared and ready to discuss things in depth. \n"
        },
        {
            "course_name": "Intro to Comparative Literature",
            "review_date": "December 23, 2010",
            "review_content": "\nProf. Worman is funny, charismatic and good at facilitating discussions, however lacks the ability to explain some simple concepts concisely. A lecture on semiotics that should have taken at most half a class turned into a recurring (for maybe 4 weeks!) 15-minute lesson in which she drew more confusing diagrams than were in the source text (which she also did not assign). Great at describing the intellectual history, and of course, elements of classical literature behind each text. She was also super stoked on everything we talked about in class.\nWorkload:\nShort translation exercise, final paper, midterm final. Two articles or a short book a week. Not a lot of work.\n"
        },
        {
            "course_name": "Introduction to Comparative Literature",
            "review_date": "February 13, 2010",
            "review_content": "\nA complicated woman...I had her for intro. to comp. lit, which is a fairly easy course at best (just do the readings, go to class, and talk to her about your essay topics) and an incredibly flawed course at worst (readings all over the map without a coherent theme running through all of them), but her blatantly false congeniality and the unnerving feeling that she was going to snap at us at any moment made it a hell of a lot more interesting.  If you stay on her good side, you have nothing to worry about.  But don't argue with her, interrupt her, or question her methodology because you will be sorry.  Her teaching style is her kind of having a stream of consciousness about the books, explaining simple concepts in convoluted terms, and ocassionally saying something brilliant.  In fact, you kind of know she's brilliant, but that doesn't make her the best teacher, or one with the best intentions for her students in mind.\nWorkload:\nNormal amount of reading for a lit. course (which is to say, heavy at times), and she does give midterms and finals with I.D.s, so do do most of the reading or review well.  Class discussions important, as are papers, though she wasn't the harshest grader.\n"
        },
        {
            "course_name": "Major Seminar",
            "review_date": "January 07, 2010",
            "review_content": "\nI am not really sure how to feel about or describe Professor Worman. While I was reading through the previous reviews, I thought \"Mmm, maybe\" or \"Ok, I guess...If you say so\" but then I got to the one about her fake smile and something clicked.  I can't say this is the worst experience that I have had at CU, but certainly not the best. She does sit there with this smile, this expression that you can't penetrate or truly identify. Her lips say smile, her eyes say something else. Oh and sometimes she does the swallow or take a deep breath and smile like she is just so annoyed with someone and she doesn't really want to say what is on her mind. I just didn't know how to read her and that can be frustrating. Worman is demanding. At first I thought this was a \"tough love\" style of teaching, but sometimes she simply seemed spiteful; she is the professor that you can never please. Did she really care? Is she trying to push me for my own good? Or is she just mean? I still don't know.  \nI think she likes being intimidating. However, there is another side to her in which she is the cool, laid back professor that you can talk to w/out being afraid. She is witty, honest and intelligent. When she wasn't swallowing back her resentment or whatever it was, I enjoyed her frankness with the class. She is definitely more approachable than some professors, but be ware: in office hours she can be kind of scary and harsh. I know a couple of people who said that she seemed rude or angry outside of class. Also, she has a impressive lexicon. \nThis review is more about the professor than the course. However, since I saw no one has written about this class, let me throw in a few words. The course is in a transitional phase so it may not be the same in a year or two. This was the first time where each seminar was led by a different professor in the department who discussed his/her specialty or current interest.  Before, the course had a different thematic focus each year. Some of the guest professors were great, some were horrible. Some just had difficult or uninteresting topics.  Professor Worman was in charge of organizing the guest lecturers, grading our work and consulting us on final papers. \nBecause the seminars varied from week-to-week, I can't say I loved or hated the class, but I really did appreciate it. The class was a great opportunity to see the many possible areas of study in classics and to meet and learn from some of the bright scholars in the department. With that said, there is a lot of reading to do, most of which you will have to print from courseworks. Also, the grading in this course is so subjective, which made me uncomfortable. Professor Worman reads the response papers and gives you a score on her check-, check or check (+) system. So you don't know how much that is worth or the final paper or participation. And if you get on her bad side, I wouldn't be surprised if she grades more harshly. Although there were some kinks in this new format, in some ways, I think it is better than learning from one professor all semester about the same thing. You already have to do that in your other classes.  \nWorkload:\nWeekly 1-2pg response papers around 10 in total based on weekly readings that vary in length. A final paper due at the end of the semester, which could be a short draft of your thesis, 10-12pgs.  \n"
        },
        {
            "course_name": "Selections Greek Lit: Rhetoric",
            "review_date": "May 24, 2009",
            "review_content": "\nProfessor Worman is such an asset to the Classics department.  Not only is she so knowledgeable about Greek rhetoric but she also brings such enthusiastic energy that you can't help but being inspired to love seemingly difficult Socratic dialogue as well!  In class we translated the Greek and she led us in discussion about the imagery and the bigger picture stuff but also encouraged us to ask questions and to tie in secondary literature to the text.  I thought the reading (about 1.5-2 Stephanus pages/class) was fairly reasonable and most of the time people would volunteer to translate in class, so if you're prepared, speak up.  Prof Worman is a really fair grader.  This class was a stretch for me in terms of the Greek, but I did all the reading and I went to her office hours and I spoke up in class and I ended up doing very well in the class.  Greek is hard enough as it is but there were never really any surprises on the quizzes or tests in terms of what she picked to test.  She is obsessed with grammar, like reviews have said before, so know your Hansen and Quinn.  Overall, Prof Worman is amazing and I intend to take everything she teaches before I graduate.\nWorkload:\nWeekly readings of 1.5-2 Stephanus pgs., 2 papers (1st was 4-5, 2nd was 6-8) 3 quizzes, midterm, final.\n"
        },
        {
            "course_name": "Intermediate Greek: Prose",
            "review_date": "April 13, 2009",
            "review_content": "\nA good professor who will discuss Plato in interesting but not mind-blowing ways. She's glad to digress, very helpful while you're translating, and you get major points for translating the Greek literally. She is obsessed with Greek grammar. Know your conditionals, indirect question, indirect statement, objective/subjective genitive. If writing an essay, realize that she cares more about your translating and interpretation of the Greek than anything else. Absorb the main concepts from the secondary literature, but don't waste too much time on them. The Greek is what she cares about. \nWorkload:\nKeep up with the reading because she'll call randomly on you. Be able to parse and explain every word on the quizzes and tests. Quizzes, midterm, and final. According to my transcript about 40% of the class got in the A range. \n"
        },
        {
            "course_name": "Intermediate Greek: Prose",
            "review_date": "December 22, 2008",
            "review_content": "\nThis is an intimidating course at first, especially if you haven't read a continuous text in Greek before, but Prof. Worman is superb.  She is very much a stickler for grammatical details, but I assure you that it pays off in the long run.  The material consists mostly of Plato, with some poetry and a couple of scholarly articles thrown in for variety.  Classes are a mix of translation and discussion, which is definitely a boon; Plato throws around some pretty hefty ideas, and it's nice to have the chance to unpack them and make sure that you understand them.  Friday class is conducted by the TA and normally involves some grammatical review, although we found ourselves often using the Friday session as catch-up time.  Prof. Worman is also quite accessible outside of class; she really wants to make sure that all of her students understand the material.  Highly recommended.\nWorkload:\nApproximately 1-2 Stephanus pages of reading per week with oral translation in class.  There are several quizzes which are announced ahead of time but graded quite harshly; be sure to brush up on grammar and syntax.  There is a midterm and a comprehensive final, both of which will be easy if you've been keeping up and impossible if you haven't.\n"
        },
        {
            "course_name": "Intro to Comparative Literature",
            "review_date": "April 17, 2007",
            "review_content": "\nThe worst experience I've had at Columbia. It is not an intro course by any means, Professor Worman seems to think everyone has a comp lit background. Make sure you memorize as much as you can for her midterm, even though she says not to, do not do extra work, because it will not be considered towards your final grade i.e presentations. She goes on tangents all the time, most of the time you walk out of class frustrated with her fake smile. But more importantly, be aware that if you approach her, her dark side might come out! Useless trying to email her. Stay away from her classes it's a lottery with her and a waste of time and money. \nWorkload:\nAverage reading for a lit class, not a hard midterm if you memorize as much as possible, and an 8 to 10 page paper which is better than a final.\n"
        },
        {
            "course_name": "Introduction to Comparative Literature and Society",
            "review_date": "April 13, 2006",
            "review_content": "\nAmazing.  If any professor is worthy of a cult following, it is Nancy Worman.  Being her is my new career goal.  She managed to make even the discussion of pretentious comp lit topics and difficult literary theory accessible and interesting.  The class solidified my desire to major in Comp Lit and made me even more excited about the field.\nWorkload:\nVERY manageable reading, midterm, final paper.\n"
        },
        {
            "course_name": "Introduction to Comp Lit",
            "review_date": "December 27, 2005",
            "review_content": "\nThis was probably one of the worst classes I've taken at college so far. Not only is it not an intro course, but Professor Worman seems to think that you know comp lit prior to entering her class (which, as I experienced, most of her students did not.) She gives tedious readings that compare no form of literature except for once in a while, and just goes off on tangents with the few comp lit majors in the class. She makes up a ton of words that are completely over everyone's head, and at no time do I think I learned comp lit. I just ended up cramming passages and info from my tiny amount of notes into my head before the midterm. \nWorkload:\nrelatively easy--just reading, a midterm, term paper\n"
        },
        {
            "course_name": "Intermediate Greek: Prose",
            "review_date": "November 15, 2004",
            "review_content": "\nProfessor Worman is a good teacher.  Bright, likeable, but definately not someone to mess with.  We spend the semester translating Plato's Ion which is interesting if you like Socratic dialogue.  I found the homework assignments tedious at times.  My major complaint about the class was the schedule.  We would have friday morning classes with the TA and there would usually be homework due or a quiz.  Having essentially two teachers equals a lot of work.  Both were fair graders with reasonable expectations.  Basically this class just requires a lot of time to do well in.  Grammer points are discussed at length during class but you really need to just open Hansen and Quin yourself. Prepare yourself to spend Thursday night in your room studying, and if you do that you will do well in the class.\nWorkload:\nTranslation for each class, bi-weekly quizes, a midterm and a final.\n"
        },
        {
            "course_name": "The Classical Tradition",
            "review_date": "June 03, 2004",
            "review_content": "\nNancy Worman is one of the most dynamic lectures I have ever had. Her lecture style is enthusiatic and upbeat and she is brillant. It is rare that you find a professor who can truly offer you a new reading of a text and change the way you look at it. Some of the texts can be boring, but her lectures make them interesting. Take notes - they will help greatly on the midterm (and final if she gives one). I definitly recommend you take her class if you like Greek and Roman literature, you will not regret it!\nWorkload:\nUsually she gives a midterm, paper and final, but if your class does well on the midterm she will cancel the final in favor of the paper.\n"
        },
        {
            "course_name": "Intermediate Ancient Greek",
            "review_date": "September 12, 2003",
            "review_content": "\nProfessor Worman is one of the best professors(if not the very best) that I've ever had.   In general I hate greek...it's hard and dense, and latin is so much easier... But during the semester that I took Worman's class I actually considered changing my focus from latin to greek...that's how much I liked it.  The course was certainly very challenging, but it was not impossible and it was fairly graded.  Worman expects a lot but if you try hard, she rewards you, and you actually  learn a lot.  There's no other way to get through a dialogue of Plato in one semester at this level.  Plus, she was always willing to give extra help for those who needed it.  The classes themselves were usually laidback... Worman helps a lot when you translate out loud in class and is totally willing to go on a few tangents if they are either interesting or funny.   I don't know why some of the reviews have been so poor... I think the class was great!  Definitely recommended\nWorkload:\na fair bit of translation for every class, a few quizzes, a midterm, a final, and three short papers(two were 2-3 pages, and one was 3-4\n"
        },
        {
            "course_name": "Intermediate Ancient Greek",
            "review_date": "January 15, 2003",
            "review_content": "\nI  have to agree with the previous reviewer who said this class was extremely frustrating.  While I enjoy challenging classes, there is a difference between challenging and inapropriately difficult.  At times I felt that banging my head against a wall would be less of an exercise in futility than attempting to translate the assignments or write a coherent paper based on those absolutely incomprehensible articles.  Professor Worman's flaw lay in the fact that she had no understanding of our level of competence.  Ancient Greek is a very hard language, and the members of the class had either one or two semesters of the language.  Some students had never seriously translated anything before.  Therefore, many students had severe problems translating Plato, whos prose is, to put it mildly, really dense in english, not to mention ancient greek.  Then she actually expected us to translate poetry in another dialect of greek after a ten minute crash course.  Professor Worman also spent a huge amount of time on syntax and was really anal and picky about grading it.  Did you know its possible to get 50 half points taken off on a quiz taking up less than a page?  Its true.  That said, I really enjoyed the discussions on content, which were engaging and thorough.  However, i would have liked them more had i not been so worried about my inability to simply do the translation.  Professor Worman is also very, very knowledgeable.  She would do very well with an advanced greek class.  Unfortunately, I cant in all honestly say she is a good teacher, as she cannot understand and work with a class at an intermediate level.\nWorkload:\n1 dialogue of Plato, selections from the Republic, Euripides and Sappho, 3 papers based on three articles, regular quizzes, midterm and final.  Do this only if you have to.\n"
        },
        {
            "course_name": "Intermediate Ancient Greek",
            "review_date": "January 06, 2003",
            "review_content": "\nThis was one of the most frustrating experiences I have had in the classroom. \nWorman seemed to have virtually no interest in teaching a class at this level. \n1200 level courses are intermediate. You begin to translate texts but are not expected to know the language perfectly. \nThe course helps to cement your knowledge of grammar but reviewing as certain types of syntax arise in the course. \nBut Worman just wanted to talk about the larger themes of the texts we read. Her grammar instruction was totally inadequate for all but perhaps 2 students in the class. When I took the equivalent class in Latin I finished that course much more sequre in my knowldge, but I feel I know just as little Greek as I did going in to Worman's class. It was a total waste. I learned a few (literally, I mean 3-5) vocabulary words and was reminded of a few syntactic uses but am no more comfortable with the language. I feel I was done a serious disservice and feel cheated. I was shocked to hear Worman say she took this no grammar approach intentionally and with full knowledge. She said that the department loses a great deal of its students at the 1200 level and she hoped to retain more by discussing content more. Well I have news for her, 1200 is designed as it is for a reason and if another semester of this damn language weren't required for my major I would never take it again thanks to her. \nSome of her lectures were somewhat interesting, but the vast majority I found pretentious and jargon-filled and lacked grounding with any specfics or examples. \nShe assigned 3 articles for us to read and write responses to. Two were incomprehensible and one was simply wrong in its conclusion. Are there really so few classical scholars out there that she was unable to find three really good, well-argued, understandable articles for us to read? This was another of her faults: she just didn't understand the difficulty of her assignments. She seemed to get that we thought they were hard, but thought we were overreacting or something. Greek is hard, I understand that, but there is no reason a teacher has to make it harder by assigning unreasonably long translations and passages to be learned for quizzes. \nWorman seems to be well liked by her students in lecture classes and I can see why. She can be nice and is not unwilling to follow the discussion on a tangent or tell a funny story and some people are not bothered by pretention. But if you want to learn anything about grammar, stay away, Find yourself a competent grad student; in my experience they do a much better job in this area.\nWorkload:\nquite a lot, and more than she said it would be: 1-1.5 Stephanus pages per class, 3 written responses to articles, several quizzes, hard midterm and final\n"
        },
        {
            "course_name": "Figures of Resistance (Frosh seminar)",
            "review_date": "October 03, 2002",
            "review_content": "\nAnyone who gives her a bad review is probably someone who didn't do the reading (which was NOT dense or hard, but actually interesting) or was never taught basic grammar rules - something she brought up once in class. She's a good professor, talks a lot, but encourages discussion, and I think she was rightly discouraged by the periodic lapses of silence when she asked questions about the Aeneid and no one responded. She was also annoyed at the fact that some people couldn't grasp basic rules of writing - but that is a valid complaint; you should KNOW how to write a coherant essay even if you're still polishing your writing skills. In summary, an engaging lecturer - like most seminar professors, she likes you if you try to say intelligent things and work hard on the papers.\nWorkload:\nAlmost nothing to complain about! A few papers, a text a week or every two weeks.\n"
        },
        {
            "course_name": "The Classical Tradition",
            "review_date": "October 01, 2002",
            "review_content": "\nThis class was amazing. Professor Worman can make even Thucydides' History of the Peloponnesian War a page turner. I looked forward to her lectures/discussions, and she was so enthusiastic about the material that she would talk to us long after class. Though criticized for dominating most of the discussion, Worman has such intelligent and humorous commentary that you won't mind. She is a queen of classic texts and loves genre. Take this class.\nWorkload:\nfair reading, a 10 page paper, and a straight forward midterm and final (take-home)\n"
        },
        {
            "course_name": "Figures of Resistance (Frosh seminar)",
            "review_date": "September 04, 2002",
            "review_content": "\nIn response to the person who wrote the positive review for this class, you seriously have to be kidding. I agree that the readings were reasonable, the lectures interesting and the teacher very knowledgable. However, she is very unreliable to contact, she never responded to questions a few fellow classmates emailed her, or returned the final papers. She gave no justifications for the grades and when she was approached by a student at the beginning of the next semester about it, she seemed annoyed by the student's questions and gave no reason as to why she did not answer the student's earlier emails except to apologize. I thought she was great until I realized she barely read through the final papers and counted the first paper when she said in class she would not. I would stay far away from this freshman course and from this teacher in general. She is a wolf in sheep's clothing.\nWorkload:\nThe workload was reasonable- 3 papers in total and a presentation.\n"
        },
        {
            "course_name": "Figures of Resistance (Frosh seminar)",
            "review_date": "April 23, 2002",
            "review_content": "\nI loved her. I get the sense that some people in the class were frustrated by her high standards when it comes to paying attention, doing the assigned reading, and spending time on papers, but I found everything she asked reasonable. She's funny, incredibly knowledgeable, and leads good discussions. She has a lot to help you with if you let her.\nWorkload:\nTwo papers and a final presentation and paper... reading is reasonable.\n"
        },
        {
            "course_name": "The Classical Tradition",
            "review_date": "January 06, 2002",
            "review_content": "\nShe's great. Knowledgeable, young, hip, well-read, funny, and with the unique ability to make a ruckus with Catullus. She could loosen up her style and allow a little more discussion, most of which borders on legitimate because the reading is great and she's a competent lecturer. She prepares well and is wonderfully understanding. Visit her office hours, too.\nWorkload:\nOne large paper on one of her topics or one of your choosing. Midterm and final, graded very leniently. If you can write with a scrap of coherence and attend class, you're set. Pay attention to her commentary on genre.\n"
        }
    ]
}