{
    "prof_info": [
        {
            "prof_name": "Jonathan Eskew",
            "prof_id": 4862,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French II",
            "review_date": "June 27, 2010",
            "review_content": "\nThough I agree with the previous reviewer that Monsieur Eskew probably shouldn't be a teacher, I think that's caused more by his personality than by anything else. He did take forever to get our tests and compositions back to us, but he otherwise seemed like he put a lot of work into preparing for every class. He's just *painfully* shy and awkward and seemed unable to make people pay attention if they didn't want to. It probably didn't help that the class was much larger than the other French courses I've taken.\nOn the plus side, he's willing to meet students outside of class and was pretty good at leading discussions on the days we worked on literature instead of grammar. He just shouldn't have a career where he has to interact with large groups of people.\n\nWorkload:\nFour tests, four compositions, and a couple of presentations. The homework was light enough if you could figure out what it was. Sometimes it was on CourseWorks, sometimes it would be on the board, and sometimes he would tell us after everybody was already on their way out the door.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "June 03, 2010",
            "review_content": "\nThis guy should not be a teacher.  His only job was to essentially assign homework and give tests.  The rest of his time was pretty much useless.  \nTo say he is unprepared is an understatement.  I feel like he would just walk into class, drop his book, and that's what we would do for that day.  Vocab lists came out the night before the test,  Paper topics were given on Thursday and due Saturday at 5.  Why?  Who knows, because we sure as hell didn't see it back for 2 weeks.  \nI feel like a unlearned things in this class.\nWorkload:\nBusy work\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "January 13, 2009",
            "review_content": "\nJonathan is a very kind ta.  The class lectures were sometimes a little confusing but he was willing to meet a student at other times if needed.  Last semester was his first time teaching so there were a few kinks in the class but overall he is a good teacher.\nWorkload:\na weekly composition and quiz.  Tests on every four chapters,a vocal midterm and written final.  As long as you review the book and listen to the accompanying cds you'll do well.  \n"
        }
    ]
}