{
    "prof_info": [
        {
            "prof_name": "Thibault Courtois",
            "prof_id": 11421,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary French I",
            "review_date": "January 25, 2013",
            "review_content": "\nAmazing professor who will definitely make your love for French overflow! He is from France, so he speaks perfectly with the best Parisien accent that is music to the ears. He is always very kind, gentle, humorous, and it feels more like having a big friend teach you because he is so easy to talk to. His classes are also really organized and he makes sure you grasp all the major knowledge no matter how long it takes. Very patient and thorough in explanations, and you will feel free to ask any questions in class.\nHe usually starts every class with \"rechauffement\" which is a warming up exercise that gives everybody the chance to speak. The emphasis on oral practice makes a huge difference in comparison to some other professor I had, and your ability in expressing yourself in French will improve if you speak out in class as often as possible, which he highly encourages even if what you say doesn't make a lot of sense :) \nVery generous in grading and he wants you to receive a wonderful, fun learning experience without much hard work. Just do your homework consistently and talk to him in French. He is always smiling and encouraging so you won't be intimidated at all.\nThis course is my stress reliever, and I always look forward to it every day. Class always seems very short because it's so enjoyable. One of the best classes I've taken in Columbia.\nHighly, highly recommended. I would give a gold nugget to him if I can.\nWorkload:\nVery moderate. Daily homework, listening exercises. Several pop quizzes in class that are very easy if you go to class and understand what's going on. And it's fun to do French homework!\n"
        },
        {
            "course_name": "French 1201 and 1202",
            "review_date": "November 12, 2012",
            "review_content": "\nThis guys is amazing. I have taken beginner and intermediate French with him and I feel like I have progressed to the point where I can already have a pretty good conversation with a Frenchman. Anyways, like any other classes, attendance is mandatory but he is lenient about accommodating students that need to have some days off. He structures his class to have several exercises in order to practice orally and he won't let you speak English. He is a very dynamic proffesr, he likes to joke a lot, and he is a very likable person. He is the professor you will for sure make friends with. He is very good at grading; he is not out to get you but he truly wants you to learn the language. \n\nWorkload:\nModerate but easy if you put in the time. Exercises every day to check if you are doing the reading. 5-6 'pop' quizzes that he tells you to prepare for. 5 essay and 5 tests which he grades very fairly. \nI highly recommend this professor to anyone wanting to start learning French.\n"
        }
    ]
}