{
    "prof_info": [
        {
            "prof_name": "Luis Avila",
            "prof_id": 1489,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "C2407-C2507 Intensive General Chemistry",
            "review_date": "September 11, 2014",
            "review_content": "\nIf you are looking for a class that will make you feel prepared to work in a real laboratory environment in the near future, look no further. In this course you will carry out many lab procedures used in research such as IR Spectroscopy, HPLC, Flame Ionization and other instruments. This is nothing like regular Gen Chem Lab.\nProfessor Avila is amazing. He is genuinely has the best intentions for his students and hopes they learn to not only properly use common lab procedures but to leave his course feeling more confident in their ability to work in a lab environment. Rather than having everything set up for you like in many other classes, you will be expected to set up your experiment from beginning to end and truly understand the procedure you are intended to carry out before arriving to class. \nTA can be a hit or miss. Many students dropped the class the first week after receiving feedback on the first lab from our TA. The fact of the matter is that you need to be prepared to write a long, organized, Data and Analysis heavy Lab reports. There is a reason they use the adjective Intensive in the name.\nOverall if you plan on majoring in a science or plan to work in a Lab, I highly recommended you take this course. You won't regret it.\nWorkload:\nIntensive...but reasonable\n"
        },
        {
            "course_name": "Intensive G. Chem Lab",
            "review_date": "June 29, 2011",
            "review_content": "\nAvila's class was decent at best, but a lot of times it just seemed to lag on endlessly with a plethora of annoying and senseless protocols. Moreover the manual is terribly vague and cryptic, and though during mentoring sessions you and your partners can try to distribute the work evenly and try to obtain a grasp of the lab so that you are not unprepared, once in the lab you will be left to deal with unclear instructions and complicated and antiquated equipment and will oftentimes be frustrated and in submission to spent 6+ hours in the lab. Also, a lot of the equipment is faulty and in unison with the vague and horrid procedures in the manual you can end up seriously getting flawed results. \nAlthough Avila is kind and truly caring of his students, the organization and grading associated with this class is truly a hodgepodge of chaos. You will only get back about 15% of what you completed graded, and be left with no idea as to where your grade is headed. Also, the TAs who graded are way too harsh. They essentially gave everyone poor grades because they grade on completely ridiculous terms. Lab reports can end up being in the 70s and low 80s because of random points taken off for not appropriately numbering graphs and tables, for you data analysis or procedure going here instead of there (pure arbitrary organization parameters never mentioned) and for not mentioning percent error on an abstract (it was never clearly explained what goes into the abstract!). Furthermore, papers and plans of actions got lost, and yeah, it was not good.\nThe worst part of the class however was one of the TAs. I would first like to mention the presence of two TAs, one defined and TA 1 and the other as TA 2. TA 1 was nice, kind, and although obviously very unknowledgeable, he did in fact try to help in whatever way he could and helped expedite any struggling students. Even if he partook in the harsh grading, his kindness and support was something refreshing in the hell that is Havermeyer. Now, on to Mr. Joshua Hyde, or shall I say, TA 2. This person was the most lazy, condescending, narcissistic, diminishing, hypocritical and horrid person that I in my life had ever met. Not only was he rarely present to help the students at all, but at any chance he got he would step out of the room and be on the phone for hours and hours. Also, when anyone would ask a completely logical and good question, this horrid individual would try to make you feel stupid and never truly answer your questions. It was evident that he himself did not know the answer to a question, but instead of saying that he was not aware of the question, he would answer something totally vague and laugh and you and try to make you feel like you were a moron. Also, a lot of the times when people were unsure about something and would ask him for help, he would merely yell at them and them and tell them that they did not read the manual or that he was not going to answer the question. Also, when actually assigned by Avila to help out a group, he would just spend time on the phone and get frustrated when you would ask for help, and furthermore when you told him that you were ready for him to operate the machinery, he would always find some stupid way of saying that you forgot to do something to delay the progress of the experiment. And every single time he would coldly tell you that you forgot to do something totally unnecessary. I also once saw him rudely tell a student to not talk back to him. He also yelled at someone for trying to run a machine without his supervision (a poor soul trying to move on with the experiment when he was nowhere in sight) He was a nightmare. But here's the best part: when Avila would come, the phone would go away and he would become the most well-mannered individual, completely halting his condescending rant to a student for trying to use the machinery (Hyde thought he was the only one who knew anything about the machine) and only saying to Avila (as Avila tried to work the machine) \"I was waiting for you, because I wanted to make sure everything goes perfect, and that I did not mess anything up.\" His hipocrisy made me almost regurgitate my Passion Iced Tea Lemonade from Starbucks. I was glad to leave him,\nAll in all, my grade in the class was far below what I expected, but then again, I had no solid foundations as to what my expectations were. I had to take this class because I was in organic chemistry, and I would have never taken it otherwise.\nWorkload:\nA endless amount of 30 page papers (which are never returned), plus a reiteration of the protocol known as a \"Plan of Action\" just to make your hand sore as there is a rule about having the manual with you in class. One long and annoying in-lab assignment, many question sheets. No life on the weekends.\n"
        },
        {
            "course_name": "Intensive G. Chem Lab",
            "review_date": "May 29, 2011",
            "review_content": "\nDr. Avila, the TA's, and the labs themselves are great.  They're very instructive, and the labs teach you how to use equipment and methods that are mentioned in class and used in research.\nHowever, 5 hours of lab can be tiring, and the Plans of Action are a hassle, and lab reports suck.  It's also easy to make a costly mistake (in terms of time) if you don't know what you're doing or weren't paying attention.  My group ended on time most days, but the same cannot be said for some of my classmates.\nThis class is definitely worth the effort and time though, and I recommend taking it if you have any prior lab experience or interest in chemistry.\nWorkload:\nPlans of Action and Lab Reports are tedious. No quizzes, no exams, just a Science Fair-esque presentation at the end.\n"
        },
        {
            "course_name": "Intensive G. Chem Lab",
            "review_date": "May 25, 2011",
            "review_content": "\nIf you are taking Intensive General Chemistry or Freshmen Organic Chemistry, I strongly recommend you take this course. Professor Avila is one of those rare teachers in the Chemistry department who genuinely cares about his students and what they learn. At the beginning of the semester, I was debating whether I should take Gen Chem Lab or this class. I  am so glad I took this class! To some extent, Gen Chem Lab is like a giant puppy mill for pre-meds who aren't science majors and engineers who despise chemistry. By taking this class, you avoid all of it!\nI was in Avila's Friday Lab. Although I often spent 6+ hrs in the lab and had no life on Fridays, it was well worth it (Monday lab class tends not to run over). The lab class is only 18 students max, and the experiments are really interesting to do and really applicable to chemistry (especially organic chemistry). \nThe workload is really manageable though tedious. If you have a laptop, I highly recommend you watch a movie while filling out your Flow Charts and Plans of Actions. The lab reports tend to also be really long, but the deadlines for these are extremely flexible. My group turned in one report 2 weeks late, and we were not penalized.\nAlthough you may feel like you are drowning a bit in this class (especially at  the beginning), the class is curved so most students get either an A or A+. It is definitely well worth it!!!\nWorkload:\n- good amount of work, but pretty manageable if you are good at time management!\n- 10 Plan of Actions\n- 10 Flow Charts\n- 6 Lab Reports (3 Group, 3 Individual)\n- 1 Case Study \n- no weekly quizzes\n"
        },
        {
            "course_name": "Intensive G. Chem Lab",
            "review_date": "January 05, 2011",
            "review_content": "\nDr. Avila is great. That being said, only take this class if you are a chem major and really like chemistry or if you like inflicting pain upon yourself. Well, it's not that bad but after a few weeks the repetitive plan of actions and 5 hour labs, this class may not be your favorite. And because Mondays generally suck anyway, don't kill yourself and take the Friday section. There are better things to do in life than spend 5 hours of your Friday in lab. \nIf you're a pre-med you really have no reason to be in this class (unless you are in orgo and they 'required' you take this class, not sure how this is enforced though). \n\nWorkload:\na lot of repetitive stuff\n"
        },
        {
            "course_name": "Physical Chemistry Lab II",
            "review_date": "June 08, 2010",
            "review_content": "\nAs a student who has had Professor Avila for three semesters (intensive gen chem lab and two semesters of p chem lab), I can say that he is one of the best professors you can ever have.  The classes themselves can be incredibly frustrating, given the age of most of the equipment in the p chem lab and the amount of time and effort involved, but Avila's attitude totally makes up for it.  He's incredibly enthusiastic about the field and completely dedicated to the success of his students.  He wants everyone to get research experience, both on and off campus, and is always willing to write recommendations for any students need them.  He remembers his students over time, and tends to offer interested former students the chance to TA intensive gen chem in their junior and senior years.  He also cares about his students; he always checked to make sure we had eaten and gave us breaks to do so, if we needed it, and he always checked if someone didn't look well.  He also loves to take apart equipment to see how it works - one day we were out behind Havemeyer getting liquid nitrogen and he picked up a broken balance off the ground and dissected it just for fun.\nIn terms of P Chem Lab itself, it's hard work; it's two semesters long, and the reports can easily take more than 12 hours, so really, don't leave them til the last minute.  I know what it's like to be absolutely alone in a 23-hour room in Butler, because I was finishing a report for the class.  Avila sets up the reports in a variety of manners: first semester, we were assigned to write a paper, give an oral presentation, or present a poster for each report (much like you would doing research in the real world).  Second semester, all of the reports were presentations of some kind (complete with scenarios.  It's strange, but doable), except for the final project, which was submitted as both a journal article and an oral presentation.  Often, if he was dissatisfied with a presentation (and definitely with our journal article), he'd give feedback and give you the chance to redo it before he'd grade you on it.  I'm pretty sure he graded more on the effort you put into the class instead of the absolute correctness of all of your work.\nPretty much anyone who takes P Chem Lab is probably going to be a chemistry or chemical physics major, just given the intensity of the class.  I'm not one for physical chemistry usually, and even though this class was sometimes hellish, I look back on it fondly.  Added bonus: field trips!  Our first semester he rented a van and took the class to Brookhaven National Lab; the second semester, we were supposed to visit Exxon-Mobil, but they wouldn't accept a group of only four students.\nAlso: Avila really values student comments and feedback (so much so that he created a separate anonymous survey for p chem lab) and takes it to heart, so if you take any of his classes, actually let him know what you think was good and what needed improvement.\nWorkload:\nWeekly reports (some individual, some in groups), quizzes for the first experiment in a series, teaching the other group about the experiment for other experiments in a series.  Each semester has a final individual project: first semester is three weeks to design an experiment for future classes (p chem lab or intensive gen chem lab), second semester is six weeks to do a mini research project.\n"
        },
        {
            "course_name": "Intensive General Chemistry C2407",
            "review_date": "May 24, 2010",
            "review_content": "\nWow.  What a challenging and rewarding class.  The first day literally scares the crap out of you, but I'm glad I stuck around.  Very few freshman classes offer such extensive resources (this lab was 80% in the P-chem lab) with such a unique instructor and such intelligent peers.\nAvila himself is brilliant.  He really will stop at nothing for his students.  He comes early and stays late.  He'll spend 30 minutes showing you exactly how an FTIR works, taking it apart and putting it back together in front of you.  He'll even cannibalize the chemistry museum for educational purposes.\nThe group work portion of this class was much more challenging than I envisioned.  My group was made up of very smart, friendly, and reasonable people, but by the third week spending six hours together every Friday, even the best group can see a lot of underlying tension.  Resolving this tension is a valuable skill that will absolutely serve you well in whatever workplace you plan on graduating into.\nThe one notably bad part of this course was the pre-lab procedures.  They had to be blindly copied into the lab notebook, a process which took a solid and tedious hour every Wednesday night.  Actually lab conditions rarely mirrored this procedure, and we always ended up making up what we were doing as we went along.  This creative process was very educational, but made the TAs insistence on detailed plans of action seem overblown.  However, this is only a minor caveat.\nThe best way to go through this course is make sure you enjoy it.  Avila and the TAs are working overtime for you, and care about every single student.  You have a responsibility to reciprocate that commitment by sharing Avila's delight in the laboratory.  Take this class.  Tough it out.  You will thank yourself later.\nWorkload:\nA bunch, but its mostly reasonable.  Don't expect to get out early.  We stayed late all but a couple of times.  There are four (1 group 3 individual) real lab reports over the course of the semester, which generally ruined my Thursday nights.  The individual reports generally came in at about 2500 words, and that was about as short as I could possibly make them.  The final case study was fun, educational, and not particularly challenging if you think creatively and have some experience with poster presentation.\nThe students in this class are the best of the best, many of whom (unlike myself) are simultaneously taking orgo.  As such, chemistry knowledge will not radically differentiate you in this course.  Rather, effort, creativity, and group work skills will make or break you.  \nI have no idea how grading works in this class.  It's curved, but who knows by how much.  Don't try asking for your grade beyond \"you're doing well\" or the opposite.  That said, I felt like I always put in extra effort for this class, and ultimately my grade reflected that.  \n"
        },
        {
            "course_name": "Intensive G. Chem Lab",
            "review_date": "January 04, 2010",
            "review_content": "\nThis class was INCREDIBLY frustrating but in the end, very rewarding. \nYou basically never knew what was going on until you got to lab. And even then, you still spent 3 hours just trying to figure out what exactly you are supposed to do.\nThat being said, the group work in this class was a good experience. For the first part of the semester, half of my group did no work at all, forcing this class to be much more work than anticipated. In the end though, I think we all got it together and learned how to split up the work equally. Painful start, though.\nThe teacher and TA are great!!! They are both very interesting and want to help you learn, which was very refreshing! \nTHINK CAREFULLY BEFORE TAKING THIS COURSE. It is intensive, but you don't get any more points for it than taking regular chemistry lab. It is A LOT harder than regular chemistry laboratory, from what I've heard. \nOn the other hand, the experiments are very interesting and realistic. The course was very rewarding once it was over.\nAnd another thing to note--- It claims to be 5 hours long, which was hardly ever the case. Most weeks, I spent 6 to 7 hours in the lab.\nWorkload:\nLOTS of time in the lab, lab papers most weeks (took me like 10 hours to write a lab paper, but I think I'm slow), Pre-Labs\nfinal project (which was really cool) and poster presentation. \n"
        },
        {
            "course_name": "Intensive G. Chem Lab",
            "review_date": "December 12, 2009",
            "review_content": "\nThis class (c2507) was fantastic; however, only people who have to take it will end up taking it anyway (chem maj, premed, etc.). P. Avila is the nicest friendliest person ever (like a grandpa), and was always helping us to understand the material. Labs were interesting and thought provoking, with many different topic areas (lasers, synthesis, IR, solutions); however this isn't really a gen chem lab, more like a baby pchem lab (He teaches pchem lab also :)  2 more semesters!) I really feel comfortable in a lab now.\nIf he sounds too over your shoulder, he isn't because better than regular gen chem lab, this one is very independent and group based.\nThe labs are long--we stayed late most weeks, plus prep for the lab reports is a pain--a lot of work (~8-10 pages of report per week).\nOur TA was a pain at times, but helpful if harsh. Tough grader. \nWorkload:\nOne big report most weeks, a group poster project at the final two weeks on a much more independent case study project assigned by one of columbia's research groups.\nI always did the reports on sunday, and they took about 10 solid hours of work.\n"
        },
        {
            "course_name": "Preparation for College Chemistry",
            "review_date": "November 16, 2009",
            "review_content": "\nDespite Dr. Avila's nice personality, this class was a total waste of time and money. It started when I emailed the professor about the book months ahead of time. He never got back to me so I was forced to buy a brand new book in the CU book store. HW assignments were intensive but were not reinforced by lecture. Dr. Avila was more interested in the historical perspective rather than defining terms and concepts before expecting the student to apply them. Another downside is that Avila was difficult to understand (language barrier). \nThe TA was ok and brought us closer to understanding the concepts in the book but would sometimes get frustrated if you didn't get it.\nIn hindsight, I should have paid the $3000 to my girlfriend who has a Phd in Organic Chem to teach me. As a matter of fact, I took the course she teaches at home (sans lecture) in the summer before I entered Gen. Chem this semester and it's been of way greater help than Avila's course.\n\nWorkload:\nIntensive HW with little support to figure out, Midterm and Final based upon HW alone = SELF TEACH (Avila said this multiple times - a student should be able to teach themselves)\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "June 18, 2008",
            "review_content": "\nI was terrified of this class after reading other CULPA reviews, but it really turned out quite well. Avila isn't around most of the time, but when he is, he usually takes interest in what the students are doing. He likes asking questions that go beyond what's immediately required for the particular lab, and he doesn't mind if you don't know the answers. His explanations tend to be a bit long, but he's definitely enthusiastic about the material. He's picky about lab safety, though. \nThe labs are long, and it's not easy to leave early, but the write-ups really aren't bad at all. I got the feeling that the TAs stressed conciseness and format over quality. The class has a very generous curve. \nThe only annoying thing was that the lab manual was full of typos, grammar mistakes, and broken links that made the procedures hard to understand. \nThis class is worth your time.\nWorkload:\nFair. No midterm, 3 class period case study instead of final. Write-ups are tedious but generally don't take more than a couple of hours.\n"
        },
        {
            "course_name": "Prep for College Chem",
            "review_date": "May 09, 2005",
            "review_content": "\nI took this course with Luis last summer and as other reviewers have said he is definitely a great guy and a passionate teacher.  Having just finished the second semester of General Chem I wanted to add my two cents for those of you wondering whether this course is worth taking or if you should just tough it out in General Chem.  I definitely recommend taking this class!  Yes you have to pay for a no credit class, but if you're taking chemistry then you are probably considering a major that requires it and you probably want to get a good grade so you can go on to a good med/grad school.  Taking this class helps a lot.  I found the first semester of G Chem pretty easy.  About 30% felt like review, so I was able to really focus on the new stuff.  If you do take this class I recommend you try to do as well as you can despite the fact that it's pass/fail, because every single thing you go over will absolutey be useful when you get to G Chem.\n"
        },
        {
            "course_name": "Pre-Chemistry",
            "review_date": "April 26, 2005",
            "review_content": "\nProf. Avila is a great person, and will do whatever he can to help you when you ask for it. He wants you to participate and ask him questions. he wants you to stop him when you don't get something. He wants you to be engaged.\nRead the book and try to stay on top of the assignments - its easy to put it aside since the class is only pass/fail. But if you keep up with the reading and homework, the lectures are a lot easier to swallow. If you fall behind, they can seem a bit incomprehensible.  So do yourself a favor and keep up. Also, since the idea is to take this class to understand and be prepared for Chem I, look at other texts.  You may find that some book at Barnes and Noble clarifies something you didn't understand in your regular textbook. Grades are curved easier than they are in Chem I and II. But in the end, you aren't graded anyway. He provides a mock test before exams that you can take home and prepare with.\nThis teacher has a huge heart and truly wants to inspire excitement about chemistry. He moves quickly in lecture, so it may seem that you aren't expected to ask questions, but you are. He really cares about his students. But he doesn't move slowly---you have to stay alert and keep up.  Lectures are mostly on powerpoint. He offers demonstrations that are relevant to lecture, and are pretty neat. \nHe makes chemistry less intimidating to those of us who never took it before. \nWorkload:\nWeekly homework problems that serve to clarify concepts--so you do them really for yourself rather than for the TA, although they are expected to be handed in and are graded by the TA. Recitation 1x/week with your TA, not obligatory, but can be helpful if you have a question, or 'just don't get it'. 1 midterm, 1 final (only on material covered since midterm.) This is P/F so just try to learn it for yourself. If you show up and at least try, you will pass.\n"
        },
        {
            "course_name": "Intensive G. Chem Lab",
            "review_date": "August 25, 2004",
            "review_content": "\nThis course was really one of the best lab courses the university has to offer.  Professor Avila is bent on having the students discover science on their own.  TA's will only offer you ask them for it- the whole purpose is for the students to reach conclusions on their own.  Prof. Avila is almost always present during the course, and he is more than happy to teach the students.  You can tell he is very dedicated to his work.\nWorkload:\nThere's a lot of background reading for a lab-- though not required, it helps you to understand what you're doing. The write-ups themselves aren't too bad if you work well with your group.\n"
        },
        {
            "course_name": "Prep for College Chem",
            "review_date": "August 23, 2004",
            "review_content": "\nAvila is the kind of professor everyone wants... caring, approachable, human and interesting.  He actually cares about his subject AND being a good teacher.  An all too rare combination.   \nWorkload:\n2 tests.  The final is not cumulative.  You cannot fail the class unless you don't show up.\n"
        },
        {
            "course_name": "Intensive G. Chem Lab",
            "review_date": "July 01, 2004",
            "review_content": "\nThe class simply sucked.  The lab notebook has at least a thounsand mistakes, and worst of all, the instruction team doesn't even bother to follow the notebook.\nAnd then there's the problem of those TA's.  If you get one of those Chinese TA's, good luck.  At first we thought it was the language barrier, but after people communicated with them in Chinese, we realized that they're just idiots.  Some other TAs, however, were good.\nWorkload:\nLab reports are tedious.Final presentation took forever.  \n"
        },
        {
            "course_name": "IG Chem 2407",
            "review_date": "January 04, 2004",
            "review_content": "\nWhen I left Havemeyer after the first C2507 day, I wished I had a pistol to stick right down my throat. The lab will seem like a terror the first day, as Luis wants to put you right on pace with all the regulations and procedures that govern the class. You have a graded presentation on the first day Â– not anything academically hard, but when he says group work, organization, accuracy, and clarity, he means it! After that the lab becomes a bit more relaxed, and to varying degrees, depending on your TA (the vast majority suck). The hardest part about Intensive Chem Lab is the five hour sessions, and yes, they do take the whole time. This class is all about organization, and following format, and group work must be executed properly, so donÂ’t wait until the night before its due to start getting your materials together and hold midnight meetings. YouÂ’ll see that it goes rather quickly Â– on that note, the more you stay focused and consistently prepared, the more manageable the requirement will be. \nWorkload:\nEight labs: five of them as a group, 3 of them individual. At the end, a final presentation on a case study. \n"
        },
        {
            "course_name": "Preparation for College Chemistry",
            "review_date": "July 06, 2003",
            "review_content": "\nExcellent! This man is a very well meaning person who cares about his students. Although the material was presented quickly and his lectures seemed a bit rushed, he still made it a point to help all of the students understand the material. He is accesible and compassionate.\nAs mentioned before, he could benefit from a bit more organization, and a better TA, but that's not his fault. \nHe truly cares!\nWorkload:\nMidterm, Final, 3-4 Labs,  some outside reading.\n"
        },
        {
            "course_name": "C3085-6",
            "review_date": "January 24, 2003",
            "review_content": "\nLuis is a really great guy. Become friends with him- he will help you out a ton. That said, this class was much harder than any other class I have taken in terms of workload. Luis is always experiemting with new ways to structure the lab, so no-one is on the same page. If you are lucky, you will have a really competent TA who will help you. Otherwise, expect to be in the lab for the full five hours each week, if not much more. You will be rewarded, though- grading is generous.\nWorkload:\nUnbelievable. Every week either a write-up, poster, or presentation is due. These take SEVERAL hours to do each, and the data is fairly hard to understand untill you have read up on it a little bit. You will never look at classwork the same way.\n"
        },
        {
            "course_name": "Intensive G. Chem Lab",
            "review_date": "January 22, 2003",
            "review_content": "\nAvila is one of the most well-meaning profs i've had at columbia.  He really cares about the students and wants them to understand the material.  Very excited about chemistry and a great prof to get to know.  However, he is highly disorganized and gives A LOT of work.  The TA's for this course SUCK (at least when i took it) and usually confused me even more.  All lab write-ups are done in groups of 5, which gets really annoying especially when your in a group of slackers\nWorkload:\nWeekly group lab write-up, weekly quiz, weekly pre-lab, final project at end\n"
        }
    ]
}