{
    "prof_info": [
        {
            "prof_name": "Robert Stein",
            "prof_id": 1989,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "MEDIEVAL HISTORIOGRAPHY",
            "review_date": "October 26, 2005",
            "review_content": "\nPerhaps Professor Stein handles undergraduate classes in a very different way than he does graduate seminars, because I have studied with him, and it has not been the ecstatic experience that the other reviewers have described. Uneven in both design and execution, our seminar fumbled along toward the end of the semester largely because the instructor WAS interested in students being \"as bold in their claims as they want,\" that is, as long as those claims were the same as his. On the surface a supportive figure, Stein ruthlessly persecutes individuals who dare disgree with him, even in the public forum of the classroom. In the course of one semester, he humiliated three students in class by mocking their contributions and suggesting in the case of an Asian-\nAmerican student (native US-born) that he suffered from ESL problems. In short, this instructor might be good for classes in which the object is to sit around, fawn on his every utterance, and throw it back to him on exams and papers, but this does not make for an equitable environment for academic discovery. As someone who has also read Stein's work (or, rather, been required to read it for his class) I would conclude by saying that his alleged \"knowledge of ten languages\" and his \"encyclopedic\" understanding of literary criticism garishly inflate the intellectual qualifications of the man himself, which are fine but by no means extraordinary in his field. As far as his sitting around for hours helping students with papers, this also seems quite out of character, but perhaps it is easier and more pleasant for him to deal with undergraduate novices than it is with professionalizing graduate students whose relationship to him might stop somewhere short of idolatry. For graduate students who might like to succeed in his class, the formular is straightforward: demonstration of original insight=bad / uncritical acceptace of his god-like posture=the surest path to success. \n"
        },
        {
            "course_name": "History of Literary Criticism II",
            "review_date": "May 16, 2004",
            "review_content": "\nHow can one man know over ten languages (including medieval ones), Romantic theory, poststructuralism, anthropology, and art history equally?  Not to mention 10,000 other subjects.  Encyclopedic is an understatement.  He yearns for students to come to his office hours; he will work with you for hours on your paper.  In the words of the immortal Salt, what a man!\nWorkload:\nIf you deserve a B, you will get it.  Just because you can Aufhebung your way through Hegel, you will not get an A.  He sees through jargon like a naked midget in a glass house made of vocabulary words.  So don't be an AufheBunghole, or he will call you on it.  But if you aren't a whiny \"I need an A+ in every class\" schmeggegge, holler at Stein.  He's the one who brought a fucking spotlight into Plato's cave.\n"
        },
        {
            "course_name": "History of Literary Criticism II",
            "review_date": "May 06, 2004",
            "review_content": "\n   Amen.  It's pretty hard to adequately describe how much he rules.   To begin, his knowledge is encyclopedic, but more importantly, he is able to read deeper into every word than anyone I've ever seen, and he sees exactly how the works speak to each other.  He doesn't put things in dummy terms, but he is able to dissolve the barriers that many of these texts present.  That is, he elucidates things exceptionally without dumbing them down. \n   His manner in the class is bright, excited about both the texts and student comments.  His own comments are of such value, however, that  people in the class didn't generally make statements just to be heard, but  instead pushed themselves and spoke when it was valuable.   On the midterm Prof. Stein told us to be \"as bold as we wish\" in our assertions; he inspires students to use every bit of their capacity.\n   Always available and never at a loss for a worthwhile statement.  The best class I've taken at Columbia.\n"
        },
        {
            "course_name": "History of Literary Criticism II",
            "review_date": "April 18, 2004",
            "review_content": "\nSo true.  This dude is sick.  I mean perfect.  Flawless.  I'm not a sycophant, but this dude is insanely great.  If he ever teaches anything again, DO IT.\n"
        },
        {
            "course_name": "History of Literary Criticism II",
            "review_date": "February 02, 2004",
            "review_content": "\nHands down, most brilliant professor I've ever had at Columbia.  Never have i EVER seen anyone be able to so eloquently and articulately sample from philosophy, history, art theory, literary theory, literature, art, cultural studies, critical theory, and post-modern theory ilke this man does.  And he is an absolute genius on every forefront.  I don't know why he's only an adjunct prof or why he's not sitting on top of the English dept. or why there's no buzz about him on Culpa.  Phenomenal professor as well as genius.   \nWorkload:\na lot. whatever, hes amazing, its worth it ,and you will never leave his class confused but only enlightened.\n"
        }
    ]
}