{
    "prof_info": [
        {
            "prof_name": "Michael Cole",
            "prof_id": 10160,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Early Italian Art",
            "review_date": "January 14, 2012",
            "review_content": "\nProfessor Cole is not the most exciting lecturer, but I'd say this class is still worth taking if you're interested in the subject matter or art history in general. His lectures weren't especially thrilling, and he was often hard to here, but if you could stay awake and get a seat close enough to hear him well, you would here a pretty interesting lecture. I definitely learned a lot about the subject matter and learned to approach it in new ways. The lectures were often nearly identical to the textbook reading (he co-wrote the book). While some would find that annoying, I found it convenient because it effectively meant that I could choose between doing the reading or going to the lecture (I chose the lectures and only used the book for review and still got an A-). Basically it's a fairly easy and interesting class taught by an extremely smart and knowledgeable, albeit slightly boring, professor. \nWorkload:\nlight-medium amount of readings that were often, if not almost always, unnecessary. Two pretty short papers, a midterm, and a final. The exams did involve a lot of memorization.\n"
        },
        {
            "course_name": "Later Italian Art",
            "review_date": "May 05, 2011",
            "review_content": "\nDespite the slight stuttering mentioned in the previous review, I personally very much enjoyed the course.  Professor Cole really knows the material and sincerely cares about teaching.  His lectures are organized by decades, which are slightly difficult to follow at first if you are not too familiar with Renaissance art.  The format, however, is very easy to adjust to, and ultimately gives you a more wholesome view of not only Renaissance art but also the historical changes during the 16th century.  Even if you've never taken any art history courses, you won't feel too behind.  A large fraction of the course, especially after the midterm, consists of architectural works (which might be good or bad, depending on your personal preference).  Overall, I'd recommend this course.\nWorkload:\nmidterm and final (you do need to memorize artists, title, and date by the decade).  two 4-page papers. optional weekly readings\n"
        },
        {
            "course_name": "Italian Renaissance Painting II: 16th Century",
            "review_date": "April 30, 2011",
            "review_content": "\nProfessor Cole is a very knowledgeable and intelligent professor.  His lectures are fantastically fascinating, and so is his choice of material to cover.  There were many moments when I found myself staring at the projector screen in the darkness at a work I had seen countless times before, and suddenly become overwhelmed by its beauty.  All to Professor Cole's narration, of course.  He talks quickly and quietly, so it's important to get a seat close to the action, because you'll want to hear every word he says!  Sometimes I wish Professor Cole would use a microphone, but that would definitely take away from the intimacy of his lectures.\nWorkload:\nThe readings were especially interesting.  Two papers graded by the TA.  The midterm and final can be difficult, but not impossible.  I'm not an Art History major by any means, but with a little elbow grease everything turned out fine!\n"
        },
        {
            "course_name": "Early Italian Art",
            "review_date": "January 05, 2011",
            "review_content": "\n  I took Cole's Early Italian Art Art History course. Cole was new last semester from Penn, so I wasn't sure what to expect. He is an OK professor at best, though I think the class warmed up to him more and more as the semester went along. \n  Cole is quite hard to follow during lecture. He tends to trip over his words and struggles to put together coherent sentences. Despite that problem, his lectures are very methodical. He always gives a handout noting the important slides for each topic. His lectures tie in nicely together and while his teaching style isn't exciting, the works are always interesting.\n   Cole was a little unclear about grading and the weights of each assignment. Everything (2 papers, 1 midterm, and 1 final) ended up being 25%. Discussion sections meets sporadically and participation only counts if your grade is on a border. The end of the year trip to the MET was very helpful in reviewing for the final.\n  Overall, an average class. \nWorkload:\nWeekly online reading assignments (often irrelevant to lectures), 2 papers (short and easily graded), one difficult midterm, one easy final. While the final essays were in depth, he gave us the questions one week before the test. Awesome!!\n"
        }
    ]
}