{
    "prof_info": [
        {
            "prof_name": "Mary Sever",
            "prof_id": 10713,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Biochemistry",
            "review_date": "May 28, 2016",
            "review_content": "\n\nProfessor Sever is great. If you need her for anything, she'll definitely make time for you whether it's a small question on something from lecture or what's due or anything else. I had her for biochem lab. Her lab lectures were well put together and clear. She provided the material needed for quizzes and lab reports and was always puts students first.  \nWorkload:\nFor biochem lab, the workload remains the same no matter who teaches it which is pretty standard with lab reports and  pre- and post-lab quizzes.  \n"
        },
        {
            "course_name": "Biological Chemistry",
            "review_date": "April 30, 2015",
            "review_content": "\nSeems like a nice person (she always brings us candy on exam days) but is by far the worst and most incompetent lecturer I've had during my time here. Frequently cancels office hours/problem sessions and this makes her inaccessible, it's impossible to get some 1-on-1 time with her, and she once didn't even show up to a session because she \"totally forgot.\" During lecture she often forgets what she says, or backtracks and confuses the class (I'd actually prefer she read off the slide because then it'd be easier to follow). I also think it's pretty hypocritical of her to expect us to remember and regurgitate months' worth of information when she can't even get through a single lecture correctly WITH notes. She assigns problem sets due every two weeks that are a hassle to get through, and doesn't even grade them. I don't think she grades anything that gets handed to her in its entirety because I've definitely received exams where the grader's handwriting changes halfway. You'd think she would hand things back quicker if she had a bunch of Chem department drones doing her work for her.\nI don't recommend taking biochem with her. Take it at Columbia instead.\nWorkload:\n3 exams that she doesn't even entirely grade (I hear some poor Chem department TAs or graders get conscripted to do a lot of her dirty work); problem set every 2 weeks that is unnecessarily long and isn't even graded.\n"
        },
        {
            "course_name": "Biological Chemistry",
            "review_date": "April 12, 2015",
            "review_content": "\nProfessor Sever is probably the most incompetent professor I have ever encountered here at Barnard and Columbia.  First off, she is extremely unreliable in handing back assignments and tests.  I have to say, she was quite good with the first test, but we have not gotten back our second test and it has been over two weeks.  Furthermore, we haven't gotten back our problem sets from several weeks ago; she also is not timely in posting solutions to the problem sets on Courseworks.  Furthermore, the problem sets are difficult and students do put in effort into them, but she doesn't even to bother to check them; the few problem sets that we have gotten back have no markings on them whatsoever.  \nShe is also a very poor lecturer, simply reading off the slides that she posts.  She also frequently says wrong information in class, someone will point it out, and then she'll get confused and flustered and ultimately confuse the rest of the class.  She is not responsible; one time, she missed a recitation section and we all waited for her to show up for twenty minutes!  It's super disappointing to be in a challenging class and to not have a professor who is responsible and reliable.  Professor Sever has really confirmed the inadequacies of the Chemistry Department at Barnard.  \nWorkload:\nThree tests and a final; first test was difficult and rather long, second test not as long and not as difficult, but required a TON of writing, third test coming up soon.  Final is cumulative.  Problem sets every two weeks, not graded, just 'spot-checked' by Professor Sever. \n"
        },
        {
            "course_name": "Biological Chemistry",
            "review_date": "April 12, 2015",
            "review_content": "\nProfessor Sever is probably the most incompetent professor I have ever encountered here at Barnard and Columbia.  First off, she is extremely unreliable in handing back assignments and tests.  I have to say, she was quite good with the first test, but we have not gotten back our second test and it has been over two weeks.  Furthermore, we haven't gotten back our problem sets from several weeks ago; she also is not timely in posting solutions to the problem sets on Courseworks.  Furthermore, the problem sets are difficult and students do put in effort into them, but she doesn't even to bother to check them; the few problem sets that we have gotten back have no markings on them whatsoever.  \nShe is also a very poor lecturer, simply reading off the slides that she posts.  She also frequently says wrong information in class, someone will point it out, and then she'll get confused and flustered and ultimately confuse the rest of the class.  She is not responsible; one time, she missed a recitation section and we all waited for her to show up for twenty minutes!  It's super disappointing to be in a challenging class and to not have a professor who is responsible and reliable.  Professor Sever has really confirmed the inadequacies of the Chemistry Department at Barnard.  \nWorkload:\nThree tests and a final; first test was difficult and rather long, second test not as long and not as difficult, but required a TON of writing, third test coming up soon.  Final is cumulative.  Problem sets every two weeks, not graded, just 'spot-checked' by Professor Sever. \n"
        }
    ]
}