{
    "prof_info": [
        {
            "prof_name": "Erin Thompson",
            "prof_id": 2910,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 22, 2008",
            "review_content": "\nErin Thompson is one of the best teachers that I've had at Columbia.  She makes art interesting AND understands the pressures that we have at Columbia, such that it's a very enjoyable class that you actually want to go to.  I enjoyed her slides and how she made me think about art in a totally different perspective and I feel like a better person for it.  I wish that more of my teachers were like her.\nWorkload:\nMidterm (IDs, essay, pretty easy), Final (final essay, a little harder but still easily doable), Research paper (requires a lot of effort)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 22, 2008",
            "review_content": "\nErin Thompson is one of the best teachers that I've had at Columbia.  She makes art interesting AND understands the pressures that we have at Columbia, such that it's a very enjoyable class that you actually want to go to.  I enjoyed her slides and how she made me think about art in a totally different perspective and I feel like a better person for it.  I wish that more of my teachers were like her.\nWorkload:\nMidterm (IDs, essay, pretty easy), Final (final essay, a little harder but still easily doable), Research paper (requires a lot of effort)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 18, 2007",
            "review_content": "\nErin makes art interesting.  She encourages fascinating discussions which improved throughout the semester due to the increased knowledge of the students and the unintimidating atmosphere she promotes.  Less interested in requiring you to memorize tons of dates and bios, she encourages an appreciation of art that allows the student to discuss an unknown work in an inciteful way. I, now, go to art museums more often and regularly invite friends to come along. The final paper is wonderful.  Erin meets with each student to find a topic specific to the individual.  I was able to incorporate my major in my paper (and was suprised to find a lot of research on it).\nWorkload:\nMidterm and final.  About 3-4 small written assignments and a final research paper.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 02, 2007",
            "review_content": "\nErin was a great art hum teacher.  Lots of people complain about this class but it was really entertaining, interesting and informative.  Her teaching style was pretty laid back while still engaging the class with her questions and random amusing commentary or info on the works we looked at.  You really will thoroughly enjoy this class.\n\nWorkload:\nA few short writing assignments, very doable midterm and final, a interesting/choose your own artist/topic kind of final paper.  All readings recommended but by no means required as in if your interested, feel free to do them...\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 14, 2006",
            "review_content": "\nI took Erin's class last year and by now I have to say that she was the nicest teacher so far at CU. She is passionate about art, young and fun. She appreciates all opinions and is very fair about a student not liking a piece of art. She is also honest about her dislike of Pollock, etc. Her grading is very fair and I did learn so much. She made Art History such fun. If you have to take \"Masterpieces of Western Art\" I recommend Erin highly.\nWorkload:\nMT, Final and one research paper. A good amount of workload, but fair grading. If you do the work, she will acknowledge it.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 04, 2006",
            "review_content": "\nErin is simply one of my favorite teachers out all the ones I've had so far at Columbia. She's really cool and laid back, and she makes class interesting by giving funny miscellaneous tidbits on artists while she's lecturing. She doesn't stress all the formal elements of paintings (which I'am extremely grateful for because I'm sure the class would have bored me to death if she had) but highlights the most important ones. She also dislikes views that go like \"The twist of the woman's finger shows how tortured the artist's soul was\" and all that bs. The worst thing you can do is try to interpret an artwork without actual evidence to back it up. One more thing, she's picky about writing so make sure to check your papers before turning them in! None of the assignments she gave us was hard, nor did it take very long to do them. Overall, she's a great art hum teacher and you'll luck out if you get her.   \n"
        }
    ]
}