{
    "prof_info": [
        {
            "prof_name": "Damon Holzborn",
            "prof_id": 3372,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 11, 2009",
            "review_content": "\nIf you want an easy A, or even A+, take this course.  If you want to learn about Masterpieces of Western Music, definitely do not take this course.  Holzborn may know a fair amount about music, although this does not come through in his lectures where he seems completely disinterested.  Most lectures were bogged down by one or two students asking him a stream of mostly irrelevant questions which consumed the entire class period.  He is a very nice guy but doesn't seem to know much about teaching a class.  The two concert reports were extremely short and he only wanted you to discuss how you felt about the experience rather than the music itself.  He also allowed you to submit drafts which he went over with you before the final submission.  The midterm and final were both extremely easy exercises in rote memorization.  There weren't even that many pieces on either since so much class time was consumed as explained above.  There was a mandatory trip to an opera (which Holzborn himself did not even attend) which was cool to see but I didn't feel it added anything to the class.  The reading was mostly superfluous although useful to memorize bold terms for the exams.  Overall, a ridiculously easy class where I feel like I learned very little other than being able to recognize the first 10 seconds of 20 or so classical pieces.\nWorkload:\nMidterm, final, 2 very short papers, REALLY EASY\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 15, 2008",
            "review_content": "\nhes not the greatest lecturer, but he knows lots about music and has a structure to the course. \nWorkload:\nlight reading, a concert report, and a paper. \nfinal is decent.\n"
        }
    ]
}