{
    "prof_info": [
        {
            "prof_name": "James Uden",
            "prof_id": 3551,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2011",
            "review_content": "\nProfessor Uden was fantastic. He has an uncanny ability to remember everyone's contributions to the discussions, so he would keep drawing you back in when conversation was even somewhat relevant to what you had said minutes or even days earlier. He knew the texts really well, but still let us lead discussion and argue with him about the interpretations of the books. He handled being disagreed with very well, and encouraged us all to approach him for help studying or with our papers. Even the books he selected to add (Plato's Apology in the first semester, a collection of short essays for the second) were great additions and worked well with what we were already reading. All in all, a perfect LitHum experience!\nWorkload:\n3 papers, midterm and final each semester\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 02, 2011",
            "review_content": "\nJames Uden has to be one of the best educators I have had the pleasure of learning from throughout the course of my academic career.  His unbounded knowledge and deep connection to each text allows every one of his students to become engaged and active in discussion.  Despite this profound understanding, however, he is very humble and is always open to new ideas and interpretations.  It is Lit Hum, so there is plenty of reading assigned, but James makes everything manageable and never gives extraneous assignments.  He is a fair grader who always rewards effort and enthusiasm.  On a side note, he may have one of the best memories of anyone I've ever met, able to easily recall an argument you may have made from many weeks earlier (one you may have even forgotten).  All in all, he was able to make a two-hour class at 9 a.m. one of the most enjoyable of the year.\nWorkload:\nLit Hum reading, 3 papers (one 3-pager, two 5-6 pagers), Midterm (which he models after the final, you will thank him for it!), Final (which you will no doubt be prepared for).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 10, 2011",
            "review_content": "\nFantastic teacher! His knowledge about the classic elucidates meaning and makes reading the books fun. His charisma can be felt at all times and when Plato comes up, groups are created to discuss Socrates' rhetoric while he plays the role of Plato. He cares about the students and is available for help or discussion about any aspect of the course. I enjoyed first semester and cannot wait to start the second, knowing what a great teacher I have. \nHe seems to be a very fair grader; I noticed that the amount of effort put into papers translated into better grades.\nI recommend his class to people that enjoy having a teacher that has intelligent comments and a funny attitude. \nWorkload:\nNormal, 3 essays, Midterm, and Final. \n"
        },
        {
            "course_name": "Intensive Elementary Latin",
            "review_date": "December 16, 2008",
            "review_content": "\nJames Uden is a great teacher who makes the intensive workload of the class quite manageable. And though we cover two semesters of Latin in one semester (which can be daunting), James always makes classes fun and enjoyable. He really cares about his students, and wants each one to succeed. He is passionate about Latin which makes him always energetic and excited, which inspires the same feelings in his students. He is always available to go over issues on homeworks during office hours. He is a fair grader. This course is highly recommended for any student interested in Latin.  \nWorkload:\nFair. Homework due every class (30 minutes to an hour an assignment) and a quiz every other class. Two reasonable midterms. \n"
        }
    ]
}