{
    "prof_info": [
        {
            "prof_name": "Kelly Barry",
            "prof_id": 1460,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Senior Seminar",
            "review_date": "April 07, 2004",
            "review_content": "\nThis woman has the absolute best pedagogical method of any professor IÂ’ve had in my years at Columbia. She is measured and focused and will always come to class with a meticulously planned discussion which make the 2 hours of class fly by orÂ…at least, pass by tolarably (Incidentally, when spending 2 hours discussing Goethe death poems, it takes a pedagogical wizard a la Kelly Barry to make this happen). She expects students to do the work fully but itÂ’s completely understandable! This is one teacher who is actually conscious of the fact that students take more than one class. One reviewer said that initially she can come off as being a bit cold. I can see that. But watching her try to suppress the tiny fires of passion in her eyes when she is discussing a Goethe text make the class completely worth while. Also, if youÂ’re studying German as a major or concentration, she will show a vested interest in your success both professionally and academically. Kelly Barry ist prima! (Side note: I am currently working on a 3 page German essay on Goethe death poems for this woman and I wrote STILL this review. A testament to her virtues.) \nWorkload:\n5 short papers and a manageable amount of reading. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 25, 2004",
            "review_content": "\nYou have Kelly Barry? You are the luckiest Columbian alive. She has incredible insight into even the dullest book. Her papers topics are really interesting, though she has some strange requirements like starting the paper with a piece of the quote she offers as a topic.  She also forbids her students to \"psychologize,\" but don't worry because you will end up a better writer in the end. She srops the lowest paper first semester and grades generously on the midterm and final.  Basically, she is the best lit hum teacher this school has to offer.\nWorkload:\n3 papers (3-5 pages), midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 18, 2004",
            "review_content": "\nKelly Barry is one of the more interesting professors of Lit Hum. Listening to other students talk about their classes I came to really appreciate her uniqueness. Her lectures are engaging, organized, and effective. She lays out all her rules, which are very fair, at the beginning. Her essay styles are very different from the standard hamburger essay (i.e., no intro, body, conclusion), and extremely interesting to write. She'll apologize when she has to lecture and can't let us participate too much, and she'll also explain herself fully when she tells us we're not allowed to sidetrack too much. Overall, an excellent Lit Hum professor.\nWorkload:\nThree papers per semester, 4-5 pages. Fair grading. Midterm, Final. No extra books or packets.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 15, 2003",
            "review_content": "\nKB is amazing. Her lectures are thought provoking and well organized. She is very good at leading discussions (however, if your section is full of dullards, it may be slow going at times). Her essay questions were stimulating and allowed for a lot of creativity and independent thought, without being too vague. She is a little more on the formal side, but she's definately got a sense of humor. She wants to class to realize things on their own, but if you're really not getting it, she jumps in with her wisdom. Sometimes, she will leave issues unresolved if you can't figure them out yourself. Some people were frustrated by this, but that's how you LEARN, people. Grading is tough but fair on papers but merciful on exams. Most importantly, the woman is BRILLIANT. I got so much out of my Lit Hum experience thanks to her; she is truly an educator. She's a goddess. I had her last year, and I wish she could just follow me around to all my core classes.  \nWorkload:\nWhatever you want to put into it. Usual reading (but she adds what I thought were fantastic things like Kafka stories and some lyric poetry, plus Faust). 3 papers, you can make them as difficult as you want. Really nice midterms.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 11, 2003",
            "review_content": "\nI really like Professor Barry.  I was in her section last year, and after a semester of CC, I appreciate her even more.  She facilitates class discussion, but she'll also lecture when she thinks it's necessary or appropriate.  And she WON'T call on you if you're not raising your hand, so don't worry.  Unlike what another reviewer said, she's often in a good mood, and her sweet and melodious voice is very soothing.  The workload for the class isn't bad at all.  There are 3 papers each semester, but 1 of the 3 in the first semester gets dropped.  The papers are graded toughly but fairly, and KB will basically tell you what to write (or at least give you a good idea) if you go to her office hours.  Also, Prof. Barry tells the class that she doesn't believe in writing in-class essays, so expect easy grading on the midterm and final.  One more thing: participation counts for 35%, but don't be scared; she uses that as a fudge factor to help your grade.  All in all, KB is nice, fair, and a great choice for Lit Hum.  Enjoy it while you can, because CC looms not too far away....\nWorkload:\n3 Papers (4-6 Pages, 1 of 3 gets dropped in the 1st semester), 1 midterm, 1 final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2003",
            "review_content": "\nProf. Barry isn't extremely engaging at first, and runs the classroom a little coldly, but her results speak for themselves.  Class discussion was guided and focused but not restricted, and her lectures were very relevent, concise, and interesting.  She did not assign too much reading and in fact replaced one 800-page novel with a 50-page short story.  She understands that we all have a lot of work and don't need the added stress of many supplemental texts in Lit Hum.  Grading is very fair; if you write your paper the night before, she'll know and your grade will show it, but if you do a normal amount of work, she appreciates it and gives you a generous grade.  Compared to most of the Lit Hum experiences I've heard, Prof. Barry's class was great, and I'm glad I stayed in her class for the second semester.\nWorkload:\n3 5-page papers, midterm, final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 24, 2003",
            "review_content": "\nProfessor Barry leads discussions really well, finding a middle ground between lecturing and letting the class discover things on their own entirely.  Sometimes if we were running short on time she would just lecture, but that wasn't too bad at all and it also wasn't that often.  She's a pretty harsh grader on the papers, but not on the midterm and final.  She's not especially warm or enthusiastic but very smart and knowledgeable and occasionally in a sunny mood.  I'd reccommend her over most other Lit Hum professors I've heard of.\nWorkload:\n3 papers per semester (in the first semester, the lowest grade is dropped).  Standard midterm and final.\n"
        },
        {
            "course_name": "Intro to German Literature",
            "review_date": "January 20, 2003",
            "review_content": "\nThis class is an excellent transition to literature classes for students coming out of V1202 (2 years of German).  Prof. Barry chose to focus on the theme of sensory perception (Auge und Ohr im Text) in order to give some continuity to the readings, which range from ten-line poems to twenty-page stories, and from Goethe to Musil.  Prof. Barry was encouraging and supportive as she helped students both to analyze the literature and to develop the ability to express their thoughts about literature in German.\nWorkload:\nCLASS PARTICIPATION, three 2-3 page papers, a 4-5 page paper, an interview with the prof, and a class presentation.\n"
        }
    ]
}