{
    "prof_info": [
        {
            "prof_name": "Gabriel Bloomfield",
            "prof_id": 13617,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 26, 2020",
            "review_content": "\nGabriel is a great professor! His class and discussions are engaging and he's always excited to hear what everyone has to say. He is a bit of a tough grader, but he also provides amazing feedback to help you improve. He is also great to chat with during office hours and he's a funny and chill guy. Take his class if you can!\nWorkload:\n1 Short paper (3-5 pages), 1 longer paper (5-7), midterm, and final. His midterm is a great representation of the final. \n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "December 23, 2019",
            "review_content": "\nHe's a very passionate professor, and his classes are never boring. He leads great discussions and he is very approachable outside of class. His standard for writing is pretty high though, and it's hard to get an A for essays. But if you keep up the participation and did more than 90% of the reading, an A for the class is not hard. \nWorkload:\nSimilar workload to other lit hum classes. 2 shorter essays, one final essay, one midterm and one final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 18, 2019",
            "review_content": "\nwhatever you do TAKE GABE'S CLASS!!! gabe is one of my favorite profs and does a good job of keeping the 2 hours of class fun and makes the time go quickly. Participation is key in this class, not only because it's 1/4 of your grade but also because it contributes to the class. Also, if you participate more he's more likely to be more lenient towards you during grading. I def did not read all of the books but a quick look at sparknotes beforehand is just as good as reading lmao. Like the first review says, Gabe's a pretty hard grader but as long as you take his advice you should be solid on all your papers, and if you're still unsure, make sure to go to his office hours so he can look over your idea!! If you can't turn in your paper on time gabe is also really lenient on the date so just email him for an extension!\nWorkload:\n2 small papers + 1 long paper\n1 midterm (he baked cookies for after which was super nice of him)\n1 final which is made by the head of lit hum (his class def prepares you for the final compared to other profs)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 15, 2018",
            "review_content": "\nI was initially worried when I saw that he wasn't listed on CULPA but I am sooo glad I am in his class. Gabriel is honestly one of the best teachers I've had. He is a grad student but definitely knows what he's talking about. He references pop culture and other modern sources to keep the text relevant and engaging. Additionally, he is able to play off the class dynamics and create a fun yet intellectually stimulating environment. \nWorkload:\nReading is like any other lithum class and he also assigns 2 short paper (3 pages) and 1 long paper (5 Pages). He is a bit of a rigid grader but honestly just wants to see improvement. Midterm and Final are pretty standardized like other LitHum classes\n"
        }
    ]
}