{
    "prof_info": [
        {
            "prof_name": "Eliza Butler",
            "prof_id": 11258,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 21, 2015",
            "review_content": "\nIf you check your SSOL and Eliza's name comes up, congrats! You got into the good section. Exhale. Relax. Forget about switching around your schedule and pushing off Art Hum -- yet again -- because you've struck gold this time. Let me break it down for you...\nFirst, her teaching style... Eliza leads discussions really well. She lets class discussion flow naturally, but at the same time leads it along with her slides and keeps it moving. She was really good at getting everyone to participate (and as someone who participates often, it was not ever in an annoying or forced way that slows discussion down). She is excellent at taking what a student says and fleshing it out, making it more nuanced and informative.\nSecond, her personality... As you will realize from the moment you meet her, she is one of the top five nicest people in the world (maybe top three even). She is really chill about late assignments, and she would probably let you hand in an essay a week late if your pet turtle had the flu. She's very accessible and easy to talk to.\nLast, and what you've been waiting for, her grading... In my opinion, and I can't speak for everyone, Eliza grades pretty leniently. Like other Art Hum sections, you never need to do the readings (except when there's a response paper). However, if you put in a decent amount of time on the essays you should get an A on them, and if you spend 5 minutes studying for the exams you will be stellar -- just review your notes and memorize the dates/locations. Also, she grades so that even if you get a question wrong, if you justify it well you will get almost all the credit. At the end of the day, I had the feeling that if she knew you cared about the class and participated often in the discussions, you were guaranteed an A.\nOverall, there is every reason to take this class. It's a good time, you learn a lot, and if you devote a few hours to the essays you're bound to get a decent grade.\nWorkload:\n15% Participation (including response papers): There are 4 one-page response papers due throughout the semester. These are graded on a check-scale, so it's pretty chill and she doesn't care if you hand it in late.\n15% Paper I: Public Sculpture: 4-5 page paper comparing two sculptures on campus.\n20% Midterm exam\n20% Paper II: Exhibition review: 6-8 page paper written like a newspaper review. You had to go to an exhibit on your own.\n30% Final exam\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 12, 2011",
            "review_content": "\nI've never written a review on culpa before, but I had to because Eliza has been my favorite teacher at Columbia thus far. She kept the conversation interesting and worked really hard to involve everyone in the class. She especially worked hard to bring everyone's interpretations into agreement with the wider picture, thus making it impossible for anyone to give a \"wrong\" answer. She was incredibly personable and knew how to make the material fun and relevant to everyone, even those without an explicit interest in art. In meetings, she was understanding and easy to talk to. Most importantly I feel that her class was not about memorization, but about intellectual exercise. Talking to other people in the class, it sounds like most people shared my opinion on her. \nWorkload:\nReadings for every class (very interesting, but you could still do well in the class without doing them), 2 essays (which were fun to write), a presentation, a midterm, and a final. She has said that in the future she might change the presentation to some other form of a final project.\n"
        }
    ]
}