{
    "prof_info": [
        {
            "prof_name": "Ruth Lexton",
            "prof_id": 2927,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "First-year English: Legacy of Mediterranean I",
            "review_date": "April 28, 2011",
            "review_content": "\nwhy does this woman feel the need to paraphrase everyone's comments? if what i said wasn't clear, ask me to clarify instead of thinking im a babbling idiot who needs you to speak for me. discussion often lagged and we had hardly any debates or serious challenging of the text. felt a bit like high school at times although sitting in a circle around a table talking was nice.\nwhat also sort of sucks is the amount of books you have to buy and the stupid program or whatever it was that cost a fortune. the books were good but it's hard to cover virginia woolf in 2 classes. essays were okay. i don't understand why she grades the drafts.\nWorkload:\neh\n"
        },
        {
            "course_name": "First-year English: Legacy of Mediterranean I",
            "review_date": "December 26, 2010",
            "review_content": "\nAs I entered this class, I was very excited to read the classics since I've never read any of them before.  And to be frank, I did read them this semester and I enjoyed them.  However, the journey was a rather lengthy one, and it sometimes felt dragged along.  This is only because every class was the same.  Professor Lexton would give us a little sheet of history, she would then state what themes we would discuss in which chapters we read, and then the discussion was left up to the class with some guidance by her.  With this in mind, I did get a lot out of the class.  We learned a lot about analyzing material, delving into the hidden meaning behind the words, etc.  However, I wish it would have been a little bit more inspiring and a bit more energetic.  One thing I did appreciate was that she was never outspoken about how she felt about our contributions.  She would only speak up about it if she felt as if it was completely wrong or off-topic.  For the most part, she remained impartial and I greatly appreciated that.  One thing I will definitely say is that she is a very hard teacher.  If you don't write the essays in the way she wants it, it is hard to get a good grade.  However, once you master the skill of  \"close reading\" and you detail everything you want to say, you'll do okay.  Just try and do that at the beginning of the semester because your grade will suffer.  You don't necessarily need to do the reading for every class, but try and not get too far behind because she'll notice.\nWorkload:\nFair amount of reading for each class, two 4-6 page essays [each with a first draft and a final draft] and one final 8-10 page research essay [with a prospectus, first draft, and final draft]\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 11, 2009",
            "review_content": "\nWhat can I say? This is a required course. There is rarely a way around it. It is boring, it is busy work, it is time consuming. There are 4 major essays and several smaller writing exercises. It is not a particularly exciting class since it is largely focused on analyzing your basic writing skills. Lexton is a tough grader. However, like any writing class, once to find out how she wants you to write, and you do it, you will get A's on your papers. There is a good deal of reading and writing, as you would likely expect. From what I could ascertain, Lexton was a rather harsh instructor, assigning more than other instructors of the same course. She is not very tolerant of late arrivals or late assignments, so if you can't be there on time, your grade will surely suffer. \nWorkload:\nModerate to Heavy\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 06, 2008",
            "review_content": "\nRuth is responsive to student questions. She'll review your papers and give useful criticisms. Deadlines were not a problem and she offered to extend the deadline of our last paper.\nThe only problem is that she can be a harsh grader. Only 33% of students received an 'A' range grade. So beware.\nWorkload:\nThey typical reading and writing assignments. Nothing extra or less.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 19, 2006",
            "review_content": "\nSimply put, Ruth is great. She write lots of helpful comments on paper drafts and she provides useful feedback when you meet with her in person (she has everyone schedule a meeting with her outside of class). She is a fair grader, she responds promptly to questions sent via email, and she is generous in allowing enough time to get the essays done. She is responsive to the needs of the class (for example, if the whole class was struggling to meet a deadline, she would give everyone an extension). University Writing is not the most exciting class offered at Columbia, but Ruth makes the experience as pleasant as possible. If you can take her section, you're fortunate!\nWorkload:\nlens essay, conversation essay, CCP, group presentation, close reading analysis paper\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 13, 2006",
            "review_content": "\nRuth Lexton is an aweomse UW professor.  She doesn't take the course too seriously, which is important for a class like UW, which is just an annoying requirement for most people.  She is extremely nice --she doesn't want to overload you with work, and she's very lax about deadlines.  She didn't even make us write the retrospective (the last, and truly BS essay, where you talk about how much your writing has improved...), and just added another 10 percent to our highest grade.  Also, if you're the type of person who can't stand fluffy, pointless writing assignements (which UW is full of) then she's great, cause you can tell she can't stand them either --she's a history person, and expects your essays to have some substance.  And most awesome of all, she's Brittish!  Not only does this mean that her accent is awesome, but you get better readings because of it.  While other classes were reading some nonsense about 'citizens of the world' by Nausssbaum, we were reading stuff by Orwell. So yeah, Ruth Lexton is awesome! \nWorkload:\nstandard for UW: three big essays, one group presentation, and a reading/ response type of assignment for each classes.  \n"
        }
    ]
}