{
    "prof_info": [
        {
            "prof_name": "Michael Gerrard",
            "prof_id": 12574,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Energy Law",
            "review_date": "December 29, 2012",
            "review_content": "\nWhat an amazing course and amazing professor! This is definitely my favorite class at Columbia so far! This is Professor Gerrard's first year teaching Energy Law as a lecture that is open to undergraduates rather than as solely a Law School Seminar. Despite being THE most renowned environmental law and advocacy lawyer in the world, Gerrard is extremely friendly and approachable; he made an effort to memorize our names (and succeeded), and he never disregarded the opinions of the undergraduates even though we obviously did not have the same foundation in law as the other law school students taking the class. He is also an amazing lecturer, managing to turn what most would consider a dull subject into a very interesting and relevant topic (thanks to his well-placed dry humor).\nWe also had various guest speakers from very important positions ranging from District Judges to Utility CEOs, which really helped in making the material relevant rather than abstract (as would be the case in law). I also really enjoyed the dinner with Gerrard, a utility CEO, and three other law school students (I was the only undergraduate); I did not feel intimidated at all being with them. Take this course! Even if you're not majoring in Sustainable Development or are not planning on going into law, this class goes into extremely pertinent topics such as hydraulic fracturing, fossil fuel energy subsidies, the Keystone XL Pipeline and renewable energy. Leaving this course, I feel like I know all more about these topics than what most people think they know based on what the media says. I also got a better sense of the political climate and legal framework pertaining to these topics, and where the USA will be going in the future (e.g. State Department is most likely approving the Keystone Pipeline System). You won't regret taking this amazing course!\nWorkload:\nDespite the bad reputation of law school classes, the workload for this class was not bad at all. There was probably around 70-100 pages of reading a week, which could easily be skimmed since the focus was more on the main idea. Plus, Gerrard would discuss the main ideas of some of the readings in class. The class was also once a week (plus an informal but fun discussion session once a week), which gave us enough time to read. For those who fear rote memorization, don't worry! Despite being a law school course, only a few very important legislative acts and Supreme Court cases are mentioned, and they are mentioned enough that you'll have them memorized anyways. Get ready for the Energy Law alphabet soup! PURPA, NUG, FERC, RGGI.\nThe final grade is mostly based on the final, being a law school course; it involved three challenging essay questions that had us think critically and creatively and required that we utilize all that we learned in class. However, the undergraduates were also given two assignments similar to the final to prepare us for the final. Overall not a bad workload, though the final was pretty difficult despite being open book. Again, take this class!\n"
        }
    ]
}