{
    "prof_info": [
        {
            "prof_name": "Frederick Neuhouser",
            "prof_id": 2078,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Hegel",
            "review_date": "December 28, 2016",
            "review_content": "\nSeriously incredible professor. Like, the best professor you're likely to have at Columbia. He WILL make you want to be a Philosophy major. This class is no joke though, and neither is Hegel. It's more work than any other philosophy course I've taken, even though the reading is usually just a couple of pages. The material is difficult, and requires a lot of time to seriously digest. It is essential to go to every single class, and write down pretty much everything Neuhouser says. Only when you're writing your paper and go back to those notes do you realize how well he has deconstructed the text. \nGrading: he says on the syllabus that satisfactory work will receive a B, and only good work will receive an A. His grading is on the harsher side of fair, but still isnt too bad. If you put in the work, there's no reason not to receive at least an A-. Also, if you do better in the final than the midterm, the midterm isnt counted for your grade. If your second paper is better than your first, then it counts for double your first paper. The comments are constructive and helpful, and the midterm and final are seriously straightforward. \nThe main thing to remember, as others have noted, is not to pad your writing. Be AS clear and succinct as possible, and write to the point. For inspiration, use his own paper on the Structure of Hegel's Philosophy of Right. \nNeuhouser will change your life. He is the most caring, giving and motivating professor most of his students have ever had. I only wish I had taken his class sooner so that I could take his other ones before graduating too.\nWorkload:\n2 papers: one due mid-october, 6-8 pages and one due on the last day of classes, 8-10 pages. one take-home midterm and one final. Paper 1: 25%, Paper 2: 25%, Midterm: 17%, Final 33%.\n"
        },
        {
            "course_name": "European Social Philosophy",
            "review_date": "May 02, 2015",
            "review_content": "\nThis was definitely one of the more rewarding classes I took over my time at Columbia. To put it in succinct words, at the end of the last lecture prof. Neuhouser got a standing ovation, and he deserved it. \nIn terms of the class structure itself it was a really good mix of lecture and discussion. Neuhouser knows the material so well that he can really engage with students when they ask questions and often understands what the student is saying even when he/she doesnt fully know what they dont get. He is pretty smart in applying the concepts to thought experiments and real world scenarios, even ones that students come up with on the fly and this gives one a more intuitive sense of the material that can be pretty complex and abstract. He really is a great lecturer in this sense and going to class was always interesting and rewarding.  \nHowever, one criticism I have that it is difficult to disagree with him in class. He seems pretty convinced of his ideas and that Marx is right (he has a set of hammer and sickle cuff-links that he wears to class) about a lot of things and engaging him with other models of economic thought or bringing in ideas not classically within the realm of the material he covers usually meets with being quickly dismissed. The students in the class as well tend to be of the communist/activist variety and there is an unspoken agreement in the class that modern economic means of production and 21st century capitalism is evil. In this sense the class can be a little ideological, so if you're the type to get offended by that you should avoid it. As someone who generally disagrees with that line of ideology, myself I found that this class really helped me develop a more nuanced view of social issues through this lens and even led me to change some of my beliefs. So if you are thinking of taking it as a fun class or as an elective outside your major or have found yourself curious to delve into Marx and Hegels views on the world and social theory, this is a pretty great class. Its rigorous enough to be satisfying and accessible enough to allow you to participate effectively.\nIn terms of grading, I do not know why people are upset. As someone who had not read most of the stuff before and as an engineer I did pretty well in the class with the usual amount of effort. I didnt have to try super hard or struggle or anything. Doing the readings and spending maybe 10 hours on each paper is good enough to get you an A-. Although people well versed in philosophy were the ones that probably got A's.\nHe says he has a strict grading policy and gives average work a C, good work a B and excellent work an A. But if you write a paper that makes sense you will definitely get at least a B+.\nNeuhouser himself is a great guy, very approachable, and will always engage with you whether your question is basic or well-informed. \n \nWorkload:\n2 papers (1/2 grade) (2000 words each)\n1 midterm (1/6 grade) (takes about 2 hrs to do)\n1 final (1/3 grade) (in class 3 hrs)\n\n"
        },
        {
            "course_name": "History of Philosophy III: Hegel to Heidegger or Kant to Nietzsche",
            "review_date": "April 15, 2014",
            "review_content": "\nAlthough I have never taken philosophy before, I did not find this class impossibly challenging. Difficult, yes, but also very engaging - Neuhouser is a great professor and very considerate and welcoming to students, not condescending at all. \nGoing to lecture is essential to understanding the occasionally opaque and difficult material (especially Hegel). Neuhouser is amazing at making concepts easy to understand and clear. The reading isn't overwhelming, although at times I found it helpful to go to lecture first and do the reading later, as that was the only way it made any sense. \nAltogether this was the most interesting course I have taken at Columbia so far; I woke up at 8:40am for this class every week, which for me is usually impossible as I sleep around 4am, and I don't regret it at all. Take this class if you can. \nWorkload:\nWeekly reading, 3 papers, a midterm and a final. \n"
        },
        {
            "course_name": "19th Century Philosophy: Hegel to Nietzsche",
            "review_date": "December 21, 2010",
            "review_content": "\nThis was an overwhelming class. The course material is very difficult to understand and the readings were confusing [since it's Hegel]. The class period is spent with 75 minutes straight of detailed lecture and you really don't have time to look up and figure out what he is saying, you just have to scribble down as much as you can and then go back after and try and make sense of it. I was shocked at how many graduate students were in this course, and I think that's why it was at such a high level. Definitely not an easy course, and I'd stay away from it unless you are passionate about the subject and willing to put in a serious workload. Neuhouser is a great guy though, he learned everyone's name immediately and is friendly.\nWorkload:\ntake home midterm (gets dropped if you do better on the final, 8-10 page paper, in-class final;;a ton of reading \n"
        },
        {
            "course_name": "History of Philosophy III: Hegel to Heidegger or Kant to Nietzsche",
            "review_date": "June 12, 2009",
            "review_content": "\nKnows his stuff very well and is a very good lecturer. If you ask a question he'll say \"That's a good question,\" but I'm not too sure he really thinks that all the time. Is VERY Hegelian--avoid him if you're a Kant scholar, even though he's really informed about 19th century German philosophy. Nevertheless, he has a Kant gap there in his knowledge. He's sort of the poor man's Frederick Beiser.\nIs a semi-fair grader. Just give him what he wants.\nFew people get A's.\n\nWorkload:\nstudy the lectures and just repeat what he says in class for your essays.\n"
        },
        {
            "course_name": "History of Philosophy III: Hegel to Heidegger or Kant to Nietzsche",
            "review_date": "January 15, 2009",
            "review_content": "\nOk, this class calls for commenting. \nIt was at 9:10 AM: Ew.....\nProfessor Neuhouser is known to impart his knowledge quite well, and there is no doubt he does this. He is, unlike certain professors, the type who will lead to your writing notes just about every second in class. He's just that effective at saying things of importance which you want to keep. His lecturing is generally quite incredible. This comes partially, if not mostly, from the fact that the philosophers studied are quite fascinating.\nUnfortunately, I don't know what to tell you about taking the class. It went from Kant to Hegel to Feuerbach to Schopenhauer and to Nietzsche. Interestingly, a lot of important thinkers and issues are left out, but since the course is 2000-level, what can you expect? \nAnyway, Neuhouser was pretty effective with Kant and Hegel, and maybe with Feuerbach too...With Schopenhauer and Nietzsche he seemed to be a bit more improvisational, no doubt about it. He would recognize it, I think most notably, with Schopenhauer. His main thing, after all, is Hegel. (At the end of the class, though, he appeared to imply he sided with Nietzsche a lot more than with Kant and Hegel)\nHis relation to students is pretty special. He tried learning the names in a lecture class (pretty odd, right?) and was generally polite answering the barrage of questions he received in every class. He was also  somebody who you could contact outside of class and somebody who actually did a large part of the grading. \nSpeaking of grading, here I'd like to linger. There is probably no harsher grader than Neuhouser in the philosophy department and perhaps, who knows, in the college at large. I believe in the first assignment, a short Kant paper, only 1 of approx. 50 students got an A-. This was the first sign. \nI believe that, because of his excessive harshness in grading, taking Neuhouser only once in your college career (if you have already done it) is enough. Ok, he may be a \"great lecturer\" but if his standards of \"great student\" are far higher than you imagine, and it may make little to no sense to re-take him. Maybe if you take his class P/D/F it may make sense, but even then watch out for that D!\nSome people are fans of him, I know a few and I don't understand them--maybe they've learned how to write stuff Neuhouser likes...Who knows? Or maybe they don't care about grades and value \"learning\" so \nIn any case, if you are hubristic and think you know a lot of Kant or Hegel or Nietzsche so as to think you're pretty ready compared to your future peers\nwhen taking this course, let me tell you this: \n----------------------------------------------------------------------\nHIGHER GRADES are only possible if\nA) You agree with Neuhouser a lot and use your notes (i.e. his interpretations) for just about everything you write in your essays.\nB) You quote very little, and when you do, you explain that quote-- what it means in your own words. \nC) You write in a no-fluff way. Neuhouser hates fluff. Shave your papers and remove ANY unneccessary word/sentence.\nD) You don't write essays with a wide, semi-general scope. Keep it narrow. Narrow and meaty makes it good for the 'Houser. \nNOTE:\nYou might think that's what every teacher likes, maybe so...But I can almost 100% guarantee you that you'll get a really low grade if you deviate from that and maybe even if you do follow that. \n-----------------------------------------------------------------------\nSome may say that Neuhouser can covert you into a philosophy major...The lectures were certainly fascinating..But if anything, I think he can also hurt it. That's the truth. You have to watch out and believe what I am saying. I have taken many, many philosophy courses with tons of professors and Neuhouser is a very unique type in ways both good and bad. \nTo use some Nietzsche, his ability to teach material = GOOD, his grading = EVIL. Unfortunately, he does not go beyond this. \nWorkload:\nGenerally short readings, with a few exceptions (e.g. a Hegel book, a Nietzsche book). The readings, of course, are quite dense. Kant is hard, Hegel is hard, Feuerbach is not that hard, etc...\n1 In-class Midterm\n1 In-class Final\n1 optional really short paper (the infamous Kant paper)\n1 paper which I think had to be like 5 pages \n1 paper which I think had to be like 7 pages. \nSo it's readings + short paper + 2 papers + midterm + final....\nAll for a bad grade and a lot of things learned. Good luck! \n\n"
        },
        {
            "course_name": "Morality, Self, and Society",
            "review_date": "December 17, 2007",
            "review_content": "\nProfessor Neuhouser is an engaging lecturer who encourages interesting and useful classroom discussion.  He's also a very nice and friendly person.\nBUT:  He's a real jerk when it comes to grading.  He doesn't grade any of the papers himself, but he forces the TAs who do grade the papers to give really bad grades.\nThis was true for the later papers too.  You'd think that there would be improvement in the second and third papers (especially since this was an intro class) - and in fact my TA said that the second and third papers were much better.  But the overall grades improved only marginally from the first to the second, and not at all from the second to the third.\nMy advice:  Pass/Fail the class - but don't take it for grade credit.\n\nWorkload:\nThree papers, take-home midterm, in-class final.\n"
        },
        {
            "course_name": "European Social Philosophy",
            "review_date": "March 27, 2007",
            "review_content": "\nProfessor Neuhouser is the reason I became a philosophy major. His eloquent, straightforward, and fascinating lectures gave me an incredible amount of knowledge and appreciation for the subject matter. But what was more impressive, is that taking this class with Neuhouser and struggling (yes, they are a true struggle) over his assignments, really made me think in a more complex and articulate way. If you say something stupid, he'll call you on it. Trust me, I passed through that fire once and came out better because of it.\nLike I said, I credit Neuhouser with my decision to beome a philosophy major- a decision I will never regret. Unfortunately though, I haven't found another professor in the philosophy department that equals or surpasses his skill. Take this class if you want to leave college more intellectually refined than you came in. \nWorkload:\nReadings aren't that long, but they're dense and you want to stay on top of them. Grading is tough, but you can do well if you make sure to meet with him before every paper. \n"
        },
        {
            "course_name": "European Social Philosophy",
            "review_date": "April 08, 2006",
            "review_content": "\nProfessor Neuhouser has been the single best instructor that I've taken at Columbia.  The workload for his courses is HEAVY but very rewarding.  This is evidenced by the many graduate students attending lectures and countless undergraduates opting for pass-fail grading.\nThe class, at an ungodly 9am, was very stimulating.  Prof. Neuhouser was very adept at drawing the entire class into a detailed discussion of very complex readings (Hegel's Philosophy of Right is impossible to understand at first).  By carefully posing questions to the class he is able to skillfully allow students to arrive at the conclusions themselves.  Yeah, yeah, the Socratic Method.  Big deal, right?  Yet very few philosophy professors care to instruct using this method; fewer still are proficient.  Professor Neuhouser is exceptional.\nThe readings, drawn from Smith, Hegel, Marx, and Weber, vary from easy to impossible.  Nevertheless, Prof. Neuhouser's explanations made even the most convoluted writing (Hegel) accessible.  Yes, accessible -- not easy.  This is not a course for the faint-hearted.  The papers will require extensive research and revision, and the exam responses will require concise and detailed answers.  This takes time.  Coupled with the readings, which can require many re-readings (again, Hegel), this course will require a lot of effort.\nBut, if you are here at Columbia to learn, then this is a class for you.  I certainly walked away a very in-depth understanding of the progression from Smith to Marx, and would unhesitatingly take another course from Neuhouser.  Regardless of the subject.  If he offers it I'll be the first to enroll!\n\nWorkload:\nTwo 8-10 page papers, 1 midterm, 1 final.  Fair grading, impossible texts, and copious amounts of work.\n"
        },
        {
            "course_name": "European Social Philosophy",
            "review_date": "April 08, 2006",
            "review_content": "\nProfessor Neuhouser has been the single best instructor that I've taken at Columbia.  The workload for his courses is HEAVY but very rewarding.  This is evidenced by the many graduate students attending lectures and countless undergraduates opting for pass-fail grading.\nThe class, at an ungodly 9am, was very stimulating.  Prof. Neuhouser was very adept at drawing the entire class into a detailed discussion of very complex readings (Hegel's Philosophy of Right is impossible to understand at first).  By carefully posing questions to the class he is able to skillfully allow students to arrive at the conclusions themselves.  Yeah, yeah, the Socratic Method.  Big deal, right?  Yet very few philosophy professors care to instruct using this method; fewer still are proficient.  Professor Neuhouser is exceptional.\nThe readings, drawn from Smith, Hegel, Marx, and Weber, vary from easy to impossible.  Nevertheless, Prof. Neuhouser's explanations made even the most convoluted writing (Hegel) accessible.  Yes, accessible -- not easy.  This is not a course for the faint-hearted.  The papers will require extensive research and revision, and the exam responses will require concise and detailed answers.  This takes time.  Coupled with the readings, which can require many re-readings (again, Hegel), this course will require a lot of effort.\nBut, if you are here at Columbia to learn, then this is a class for you.  I certainly walked away a very in-depth understanding of the progression from Smith to Marx, and would unhesitatingly take another course from Neuhouser.  Regardless of the subject.  If he offers it I'll be the first to enroll!\n\nWorkload:\nTwo 8-10 page papers, 1 midterm, 1 final.  Fair grading, impossible texts, and copious amounts of work.\n"
        },
        {
            "course_name": "Hegel",
            "review_date": "May 22, 2005",
            "review_content": "\nNeuhouser is absolutely fantastic. Really, I can't say enough good things about him. He seems like a really good person, too - not just a good teacher.\nProbably the thing that really sets him apart from other professors is how much he genuinely cares about the ideas in the texts. How a person can attain freedom in the world is a really important question, and you can tell it matters to him to figure out what these writers (here, Hegel but he's also into Rousseau, Marx, Kant, Sartre and others) have to say about it. The excitement he brings to the course carries over to the students in the room. We all end up wanting to figure these texts out.\nThe other thing that sets him apart is how good of a teacher he is. I can't really put my finger on what makes him so exceptionally good, but he's really fantastic. Lots of graduate students sat in on this undergrad-level (not even 4000) course. That should tell you something about how good he is. Also, if you go to Amazon, you'll see that students of his from Cornell actually wrote positive reviews about his books without having read them. They took a course with the guy and were so impressed that they actually went to Amazon and praised him! Wow, right? Okay, maybe that's a bit freaky, but it shows that he's inspiring.\nAnd he's not such a hard grader. I've taken a few courses with him now and found him to be really very fair. Just don't B.S. on the papers and finals. That stuff doesn't work with him. If you attend all the lectures (he always teaches 9am classes - ugh) and do the readings you should do well. Really - either repeat what he says or back up you're own ideas well and you'll do fine. Random B.S. without backing it up will get you nowhere with him.\nWorkload:\nTake-home Midterm, in-class final. Two papers.\nNot very much reading, but it's Hegel so it's hard going. He explains it well. I would recommend re-reading the stuff after lecture. It's not so much, so you can actually do that.\nFor the final, he gives you the sections of the texts that will be covered beforehand (this was really nice of him), and he gives you three questions that are very similar to the three options you have to choose from for the second question on the final. That was unclear - for the second half of the final you have 3 questions to choose from. He gives you three similar questions beforehand, so if you prepare one of those you'll be in good shape to answer the similar question on the final.\n"
        },
        {
            "course_name": "Morality, Self, and Society",
            "review_date": "May 17, 2005",
            "review_content": "\nNeuhouser often reminded me of that Thinker statue during his lectures from the way he paced back and forth and rubbed his forehead and chin.  I personally found him to be an excellent lecturer, often making clear points in texts which otherwise would have gone unclear or undiscovered to the average student.  The class also seemed to fly by most of the time, with most of the people looking genuinely interested.  This is a lot to say for any class but especially one that was at the ridiculous 9 am slot.  The only negative is that he is a rather tough grader, but the reading, his lectures, and his tests are challenging, so I guess it makes sense that he doesn't give As freely.  On that note, don't try pulling any BS out on tests and papers.  Overall, I learned  A LOT, and left considering Neuhouser one of the friendliest (albeit challenging) professors I have had.\n"
        },
        {
            "course_name": "Morality, Self, and Society",
            "review_date": "December 30, 2004",
            "review_content": "\nGreat class. He is a great lecturer and at the same time is very good at facilitating discussion. I thought his grading was tough in comparison with other professors i've had however the class was definately worth it and i learnt a whole lot.\nWorkload:\n3 papers, one midterm, final\n"
        },
        {
            "course_name": "Morality, Self, and Society",
            "review_date": "December 30, 2004",
            "review_content": "\nGreat class. He is a great lecturer and at the same time is very good at facilitating discussion. I thought his grading was tough in comparison with other professors i've had however the class was definately worth it and i learnt a whole lot.\nWorkload:\n3 papers, one midterm, final\n"
        },
        {
            "course_name": "European Social Philosophy",
            "review_date": "September 15, 2004",
            "review_content": "\nHe is one of the most prepared lecturers you'll ever meet at Columbia.  In an hour of half of lecture, he hardly wastes any words.  He chooses them carefully and conveys his ideas precisely.   You'll appreciate this ability of his when you read impossible texts like Hegel's Philosophy of Right.  They start to make sense.\nWhat's also good about this class is that Neuhouser not only delves into the texts from Smith, Hegel, and Marx, but also contextualizes the main themes to the contemporary times.   His lectures are engaging but so too are the ensuing discussions.  \nBy no means, this is an easy class.  If you're thinking about winging a class, don't take this one.   But as the previous reviewers said, this class can really be tremendously rewarding if you're prepared to put some serious effort; you'll come out of this class heck of a lot smarter than before (really.)\nAbout his papers: start early, as you can't put subjective BS and expect to get away with it.   Consulting with the guy beforehand helps a lot. \nAbout his finals: there are no real surprises.   It consists of passage identification, a few short essays, and one long essay.  If you've been attending his class regularly, you really can't do badly. (btw: try not to miss a class, because you miss one, say on Hegel, you'll be completely lost afterwards.) \n"
        },
        {
            "course_name": "European Social Philosophy",
            "review_date": "May 30, 2004",
            "review_content": "\nsitting in neuhouser's class made me want to major in philosophy. \nwriting papers for neuhouser made me want to drop out of college. \nhe's a good prof and a good person, anal grader\n"
        },
        {
            "course_name": "European Social Philosophy",
            "review_date": "May 22, 2004",
            "review_content": "\nI agree with the last review: Neuhouser is a phenomenal lecturer and I learned more in the class than I have in almost any other. I can't recommend him highly enough. He and Taylor Carman are, hands down, the best professors in the philosophy department.\nI didn't think he was a very harsh grader at all, though. But I may have just gotten lucky and said what he wanted to hear.\nFor all you procrasinators: his policy on late papers is on the generous side of fair (no extensions, but less-than-harsh penalties).\nWorkload:\nMidterm (take-home, because we were running behind and couldn't give up a class period. It will probably be an in-class in the future), final, two essays. Not too much reading, but you've got to put a bit of work in. Definitely not an easy class, but exceedingly rewarding. \n"
        },
        {
            "course_name": "European Social Philosophy",
            "review_date": "May 11, 2004",
            "review_content": "\nI'm torn between my ultimate opinion on the class.  I learned more in this class than in any other at Columbia, much (if not all) of this is because of Professor Neuhouser.  His lectures were well organized, concise, and yet still offered incredibly developed perspective on social discussion.  Class discussion is encouraged, and he enjoys watching students figure out the material, though he has no problem telling you you're wrong (favorite moment in class: watch Neuhouser look at a student with this huge smile, shake his head, and say \"You couldn't be more wrong!\")  This atmosphere provides a great learning opportunity, but it can also become intimidating and stressful.  I did have a difficult time with the grading system.  I was less concerned with my grade than the fact that I couldn't improve.  I spent more than twice the time on my second paper (both by myself, and in consultation with him), and yet I did substantially better on the first.  More to the point, I could not figure out what I could do to improve, and I was even marked down for comments that we had discussed should be put in my paper.  If I had to decide whether to take this class again, I would sign up in a heartbeat.  In spite of difficulties with the written assignments, I learned more from this class than I ever thought possible.  Professor Neuhouser was a phenomenal and interested lecturer, and the work that goes into this class will pay off ten-fold.  If you are interested by Smith, Hegel, Marx, and Weber; take this class.  Don't take it as a requirement- the value of this class is found soley in personal enjoyment.\nWorkload:\nTwo papers, midterm, final\n"
        }
    ]
}