{
    "prof_info": [
        {
            "prof_name": "Jason Galie",
            "prof_id": 1877,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Russian 1201x",
            "review_date": "May 08, 2004",
            "review_content": "\nI really disagree with the last review.  I had Jason for two terms and he is a great teacher.  He doesn't put up with whiny crap, he (unlike many other grad students) really cares about whether or not you do your work, and he is very organized and put-together.  He is always available and willing to help after class.  He will make it so the work isn't overwhelming, and if you go to class, there is no way you will be unprepared for the tests.\nWorkload:\nPeriodic tests, which are not particularly hard. Comprehensive final. Homework every night that takes 1/2 hour to an hour. \n"
        },
        {
            "course_name": "Russian 1201x",
            "review_date": "April 21, 2004",
            "review_content": "\nVery mediocre teacher.  Sarcastic yes, but not in a funny or helpful way.  When students get things wrong, he asks them why they got it wrong - without explaining what is wrong about it.  Not good at explaining patterns in the language, or in figuring out what a student is misunderstanding and altering his explanations accordingly.  Basically, he doesn't listen.  The textbook also sucks, but that's not his fault.\n"
        },
        {
            "course_name": "Russian 1201x",
            "review_date": "December 16, 2003",
            "review_content": "\nYAY I love Jason! He's my favorite TA ever. He does give a lot of work, but our class was much better at Russian than the other sections by the end of the semester, but it was worth it. He's very understanding about homework if you talk to him 1-1. He's a cool guy and very funny (sarcastic type. No crybabies allowed). Basically, he's awesome. :D\nWorkload:\nMore than typical, but doable - 1-1.5 hours/night.\n"
        }
    ]
}