{
    "prof_info": [
        {
            "prof_name": "Fatima Mojaddedi",
            "prof_id": 11112,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "January 19, 2011",
            "review_content": "\nTAKE THIS CLASS!!! I can't express enough enthusiasm and excitement about this class. I have been gushing about it all semester long to all of my friends (both at Columbia and even outside Columbia). Honestly, I never write reviews, but felt compelled to finally write my first review for this class because it is worth it. Also, because I so strongly disagree with the last review. \nOut of all the classes I have taken at Columbia, this is the one class that I actually feel has altered me academically, but also personally as well. Professor Mamdani began the class by saying that this class will \"not change how you view Africa, but how you view the World from an African vantage point\". Since the class, I can truly say that I do see the world through a different lens now and ACTUALLY remember the things that I learned in the classes. (What a concept!)\nI do not know what the previous reviewer was saying about Professor Mamdani's lectures being unorganized. I found his lectures to be very organized. There was a very clear outline from the very beginning of what he would cover and then he proceeded to do so. Also, he only missed one lecture and it was due to sickness. \nThat being said, the lectures were also the best I had ever had at Columbia. I went to every single lecture because I wanted to hear every single word that he said. Usually he would say something that was so eye opening or mind blowing that I would actually type it in bold and then later read it out loud to all of my friends. (You know a class is good when you are actually talking about it outside of class..)\nOne thing I will agree on with the last reviewer is that the TA does matter a lot in regards to your grade. My TA was Fatima and she was fantastic. I could not have asked for a better TA to go with the course. She has a calm, quieter demeanor, but do not be fooled. When she speaks, each word is intelligent and she is able to tie in the readings, lectures, and present day situations seamlessly. She also has a very funny, sarcastic sense of humor that seeps into the discussions every now and then. Do not be intimidated though, because she is very eager to make sure you understand the material as well and is willing to meet with you as many times as necessary in regards to the reading or your paper. Also she returned out first paper to us with comments, she went through great efforts to comment on them thoroughly. Then, for our last paper she even offered to email us her comments. She is a very fair grader. She was a great component to the course because she really pushes you to think differently.\nOverall, I could not recommend this class enough. This is the class you came to Columbia for. Do not leave Columbia without having taken it! \nWorkload:\nWeekly readings (which you will WANT to do)  which are not that bad and weekly .5-1 page responses to go with them. \nTwo 8 page papers. You have to do the first paper, but the next two, you get to choose which one you want to write. From speaking to others, they are usually graded pretty fairly and most people do well. \nOne in-class presentation, which is super easy. You basically just are assigned an article for that week and have to present it. \nNo tests! \n"
        }
    ]
}