{
    "prof_info": [
        {
            "prof_name": "Weizhe Zheng",
            "prof_id": 3565,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "April 11, 2012",
            "review_content": "\njOh, Zheng... what an interesting class this has been. Half of this review will be academia centric and the other half will be Zheng centric. Let's start with Zheng first because it's funnier. \nZheng is a fabulous man, whether he means to be or not. He owns a total of two sweaters and cycles through them bi-weekly. He is always the last person in class and the first person out. It is an item on my bucket list to figure out exactly what it is he's doing after he sprints out-- literally sprints out after class ends. You blink and he's gone. His English is alright-- a bit of an accent and fumbles occasionally, but completely understandable when he speaks. However, in my experience, he seems to not understand English very well. I have asked him questions and class and when he answers it can seem as though he heard a completely different questions and gets irritated at the stupidity of it. It can be quite hard to clear up any concerns in the class due to this fault he has. It's happened multiple times to me. I will ask why we have three different variables and he might talk about the positive and negative signs. Completely different. Don't know where that came from.\nBut aside from his quirky personality, he is an ample teacher. He teaches mostly through examples, which is a teaching style that works very well for myself and most of my classmates. If you love math, you might not love this course. He is very matter of fact in teaching-- this is something you need to do and this is five examples of it and now let's move on. He doesn't really go into the intricacies, although he usually does prove it (but not in a very interesting, engaging way). It may not be the most fun way to teach the class, but it's a very solid technique to help students apply the material adequately on tests. He releases a practice midterm before each test, which is almost exactly the same thing as the actual midterm. All questions are at the same level, or easier, than the homework questions. There will not be any curve balls, unless he throws in an extra credit which will not hurt you if you can't get it. \nI honestly stopped going to class after the first midterm. I have a natural affinity for math, so I could easily learn out of the textbook. If you don't, going to class will help a lot. But it's completely doable to simply learn out of the textbook. Zheng is incredibly organized and straightforward with his homework assignments and midterms. It's refreshing, compared to other math teachers I've encountered. \nOverall, Zheng is a solid calculus teacher. You know exactly what you need to do to get a good grade, and it isn't ridiculously demanding. You will actually learn Calculus II.\n\nWorkload:\nOne problem set a week, generally consisting of ten problems due every Monday. Not that difficult-- generally took me around 5-6 hours each without super exerting myself. \nTwo midterms, but given review midterms before which are the spitting image of the actual midterms. If you do those and understand them, you will do well on the midterm.\nOne final, obviously. Haven't taken it yet, but assuming very similar to the midterm situation. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "February 17, 2012",
            "review_content": "\nReally don't listen to the other reviews on this teacher.  He is utterly reasonable.  He gives you weekly problem sets, most of which have answers in Teacher's Manuals in the library and you can do with your friends.  Also he gives you carbon copies of each midterm and final before you take them, so you know exactly what is going to be on them.  \nHe is, in fact, a terrible lecturer.  It's math, though, and the book will be the best way to learn the material anyway.  He is also willing to help when you have questions.\nWorkload:\nWeekly Problem Sets that are not hard--if you work hard they are grade boosters\n2 Midterms--just study, and you should be fine\n1 Final--no harder than the midterms\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 08, 2011",
            "review_content": "\nThis class was terrible. I don't want to put all the blame on Weizhe because I think I would've struggled through Calc III no matter who was teaching it, but he definitely didn't make it any better. He is boring and hard to follow. He seems to hate answering questions; when he does, he sounds like he thinks you're an idiot for asking. The workload is reasonable, though, and he provides review sheets for the midterms and final. \nWorkload:\nWeekly problem sets, 2 midterms, final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 13, 2010",
            "review_content": "\nI don't understand a lot of the negative reviews, he was an okay professor.  His lectures were a struggle but his exams were fairly straightforward and generously curved.  Homework wasn't too bad and he was always available for office hours.  Since Calculus 3 is relatively straightforward and definitely self-teachable I wouldn't shy away from taking Prof. Zheng based on the negative reviews here.  There is also a kind of humorous and endearing quality about him.\nWorkload:\nStandard Calculus class; weekly homework's (lowest dropped), 2 midterms, one very hard final (generously curved though)\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "August 06, 2009",
            "review_content": "\nThere is no doubt that Professor Zheng is a talented mathematician, but he clearly lacks basic teaching skills. You can barely hear him in class, and he faces the board most of the time, even when he is explaining things, which made it almost impossible to know what he is talking about. Also, his class was incredibly boring, so most students simply skipped his lectures and only attended class to take the exams. I went to class for the first month or so, but then I realized that I actually learned more from reading the textbook by myself and stopping by the Math Help Room when needed. The material from this class was not particularly difficult, so if you are willing to spend time reading the textbook and understanding the assigned homework problems, you should do fine. Now, that is not to say the class was easy. So do consider taking it with another professor if you can.\nWorkload:\n2 exams and a Hard final. weekly problem sets (the level of difficulty varies). \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 18, 2009",
            "review_content": "\nOverall average professor-- I'll try to break it down in to pros and cons.\nPROS:\n+Two exams (40%), homework (20%) and a final (40%) seems fair.\n+Homework is never too many problems.\n+Provides review sheets for the exams and final.\n+His lectures are quite skip-able. I used 99% textbook to study and got an A-.\n+He is pretty accessible and helpful in office hours, and will even make special appointments for you without much fuss.\n+Pretty strong curve (my final average was about 80% and I got an A-).\nCONS:\n-HIS ENGLISH IS QUITE POOR. NOTE: THIS IS A PRETTY SERIOUS ISSUE (at least for me it was).\n-Lectures are not very helpful.\n-Homework is graded very harshly by the TA (I don't know who it was, the TA was behind the scenes all the time).\n-Exams feature about 4 standard problems then usually 1 insanely difficult problem that is very unfamiliar to you.\n-Since lectures are not helpful, if you don't understand it completely from the book, you might need outside help\n-I spent a lot of time in the Barnard Math Help Room...\nSO THERE YOU GO. Judge it how you may, but that's the breakdown of this teacher.\nOverall not recommended.\nWorkload:\n2 Exams of around 5 problems.\n2 Short HW assignments per week. Not too long, but difficult.\n1 Final exam of around 10 questions.\n\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 20, 2008",
            "review_content": "\nWhile I understand that most Calc III professors are frustrating on some level, I would still tend to steer clear of Prof. Zheng.  His lectures are boring and confusing, consisting almost entirely of proofs.  While explaining these proofs, he tends to make large jumps between steps so that even if you bother to pay attention to what he's doing, his work doesn't make sense.\nWhat was nice about this class was that the textbook was great in terms of preparation for the tests.  Use it as your study guide because class notes are useless.  His midterms and final are harder than any other Calc III class, so be sure to understand the book's examples.  However, don't stress too much over this because the tests are tricky for everyone.\nI will admit I got an A in the class, but that was after what looked to be a massive curve on the final grades.  So, if you are a skilled calculus student who can manage difficult concepts without thorough explanation, take this class and don't bother going to class on regular days.  Otherwise, find another professor.\nWorkload:\nFairly manageable.  Reasonable bi-weekly problem sets consisting of 4 or 5 problems from the book.  Midterms and final are brutal, but generous curves are sure to follow.\n"
        }
    ]
}