{
    "prof_info": [
        {
            "prof_name": "Amit Prakash",
            "prof_id": 2907,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 17, 2011",
            "review_content": "\nA really terrific CC prof.  His questions focus on the argument and reasoning of the text, instead of reading it through a Marxist/feminist/deconstructive/whatever \"lens\".  This approach lets you get inside the author's thought, rather than warping it to conform to critical theory.  Discussions are very well-structured and pinpoint crucial concepts.  Also, Prof. Prakash really listens to students' ideas and shows how they shed light on aspects of the works.  He generally doesn't encourage personal anecdotes, which keeps classes focused on the readings instead of on somebody's experience at summer camp when they were twelve.  He's a great prof and runs a fantastic CC class.\nWorkload:\nI think it changes from first to second semester, but first semester was two 5-7 page papers (prompts given), a three-essay in-class midterm, and a take-home final that was semi-creative.  40% of your grade is participation, so definitely talk in class.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 20, 2010",
            "review_content": "\nHonestly the best cc teacher you could ask for. No discussions posts, first of all, which are unnecessary anyway because  he leads amazing class discussions that touch on everything. His papers are not 10-12 pages anymore, like the last review, but 5-7. He grades tough but very fair. Also, he is very reasonable if you have any issue.\n I really have no complaints. He is amazing. \nAlso forgot to mention, mid term and final are only worth 10% each. Participation is worth 40%. If you want to take this class you have to be able to be on point during class, not just outside of class.\nWorkload:\ntwo 5-7 page papers; a mid-term; a take home final\nmid term and final are only worth 10% each\n\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 12, 2009",
            "review_content": "\nAmit Prakash is definitely one of the better CC instructors at Columbia. The format he uses is fairly simple: he compiles a list of discussion questions that are both student-submitted and ones that he considers to be important for the texts and asks those questions to the whole class, providing his own answers and explanations if no one has an answer. This creates a structured discussion that tends to hit every important point in each text and reduces the pseudo-intellectual ramblings that tend to characterize other CC sections to practically zero. If you're not a huge fan of learning how your classmates' \"exciting\" personal anecdotes make them an authority on Nietzsche, Marx, and Freud, then Amit is the man for you. The 10-12 page papers are significantly longer than most CC sections and Amit has a low tolerance for filler, but he does assign them well in advance so use that to your advantage.\nWorkload:\nTwo 10-12 page papers and a 4-6 page take-home final where he will call you out if you have a lot of filler. Participation in some form is important, but if you're too shy to speak in class you can submit discussion questions via e-mail before each class.\n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "September 11, 2006",
            "review_content": "\nAmit is an excellent TA! He was extremely helpful in breaking down the extensive readings from a hard course, and was always willing to discuss the difficult readings or go over drafts of papers. He is also a really intelligent, organized, and nice guy. If you get a chance to have him as your TA, do not hesitate, go for him!\n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "May 01, 2006",
            "review_content": "\nAmit is excellent, one of the best TA's I've had.  Perhaps as a result of his years teaching high school, he actually teaches the material and he's always prepared and on time.  He takes a Socratic approach to the material, questioning the section and then explaining the answer himself if he doesn't elicit any responses.  He is a tough grader, but fair.  My one complaint is that he was obsessed with comparing the methods of history to the methods of other disciplines in order to show how history's were better.  Overall, though, I wouldn't hesitate before taking another section with him.\n"
        }
    ]
}