{
    "prof_info": [
        {
            "prof_name": "Mariana Colacelli",
            "prof_id": 2641,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Macroeconomic Theory",
            "review_date": "December 21, 2010",
            "review_content": "\nI really enjoyed this class. the prof is extremely nice! her office hrs are never crowded so go with questions because she goes over all of your issues without making you feel stupid! she teaches right out of the text book but i would recommend going to class because she explains everything very well. the ta sessions are also very helpful if the ta is good (thankfully the first one sucked but left so we got a much better one midway through the semester). the problem sets are hard but if you can do them and understand how to do them you will do fine on the test. the avg of the midterm was 70% and it was curved very generously. i would def recommend this course with prof colacelli because she is so nice and does not try present info we have no idea how to answer on the exams (the questions are challenging though). overall i have nothing to complain about!\nWorkload:\nweekly very hard problem sets, readings (optional but recommend them because they help with the homework), midterm, final \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 23, 2008",
            "review_content": "\nI personally enjoyed this class. Although Prof. Colacelli's lectures are dull at times, I learned a lot from this class. She is extremely nice and very helpful if you go to her office hours or ask her questions right after class. It is true that most of the things she goes over in class came straight out of the textbook, but she explains it really well, so go to class! Also, there is a TA session every week, which is extremely helpful too. I don't think I could've done so well in the class have I not gone to the TA sessions. Her exams are a little tricky, they are very different from the homework problems, so usually the mean is around 65%, but there is a curve, so you will probably end up with a decent grade. \nWorkload:\none midterm, one hard final (not so bad with the curve) weekly long problem sets\n"
        },
        {
            "course_name": "Intermediate Macroeconomic Theory",
            "review_date": "December 11, 2008",
            "review_content": "\nAlthough a very nice woman, Prof. Colacelli should not be teaching a 3000 level \"core\" economics class. This was her first semester teaching non-intro, and it showed. She literally lectures directly out of the text, never explains examples and is unable to answer questions on the problem sets. Your best bet is to become best friends with the TA and hope she curves tremendously. The material is not hard in lecture, and you will walk out thinking how easy macro is, and then will be lost within 10 minutes on the problem set. Overall, it is better to suffer through a harder class than to take this one and learn absolutely nothing. \nWorkload:\ntypical. 10 problem sets, short relevant articles posted, midterm, final\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "February 28, 2007",
            "review_content": "\nPeople seem to be a bit harsh on Colacelli here.  It is true that her teaching style leaves something to be desired, but she's not a seasoned veteran.  Colacelli got her Ph.D. quite recently, so she hasn't had the decade of teaching experience that other econ professors here have.  Give her some time, and I think she'll turn out to be one of the better ones.\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "January 15, 2007",
            "review_content": "\nThis class was generally really easy and Professor Colacelli is so sweet and really tries to help her students out.  She is also really great at explaining anything that you're unclear about.  It's not really necessary to come to class and most people don't but I think it really helps.  She just reads her slides which she takes directly out of the textbook during class but for the first few classes you don't really have to read the chapters if you come to class.  Her lectures tend to be kind of boring but again, she is really sweet and she definitely reconigzes the people that consistently come to class.\nWorkload:\nfair. there are weekly problem sets that can take a really long time but you have enough notice in advance to do them before hand so you actually spend like one night every other week or something doing a really long problem set.  the midterm was easy but there was nowhere near enough time to finish it but she curves it so its easy to pull off an A even if you don't finish.  the final is also easy.  she gives you practice tests for both that are very similar to the actual tests she gives.\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "January 14, 2007",
            "review_content": "\nThis class really frustrated me.  Every class was spent going over the text word for word.  Even the examples used in class were straight from the text, and the slides were straight from the textbook website (she also posts them on courseworks before each class).  Attending the class was pretty much a waste of time.  If you read the text, read the articles posted online, and did the problem sets, you were prepared for the exams.  The curves were generous.  The weekly problem sets were long, very long.  The assignments online were a breeze, but the weeks when written problem sets were due werenÂ’t fun.  There were several written sets, and they each took several hours to complete.  I personally felt that the problem sets could have been made shorter in exchange for actually solving some real example problems in class rather than going over the textbook verbatim (very, very few real examples were gone over in class).  The text only goes over VERY simple questions, so of course she only went over very simple examples in class.  The questions at the end of the chapters (those on the written problem sets) were very hard, which left you kind of stuck (neither the text or the professor went over any real examples). There were optional TA sessions offered weekly where (apparently) problem set problems were discussed.  Overall, the class wasn't hard, but Colacelli makes a bland topic even blander.\nWorkload:\nNot bad.  Weekly problem sets (the lowest 2 grades are dropped).  The online sets are easy, the written sets are very long long.  One midterm and one final.    \n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "May 03, 2006",
            "review_content": "\nThis class was fairly easy to do well in. I came to class 4 times the entire semester, and I still managed to get an A on the midterm. If you can teach yourself things out of a book then there is no use coming to class because all she does in class is go over the book word for word. But beware- the book is extremely slanted to the right and you might get upset when you read it. \nWorkload:\nNot bad. About 15 problemsets which take a few hours each, a midterm, and a final. \n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "March 10, 2006",
            "review_content": "\nThis is the worst class for first semester, but unfortunately you have to take it. If you are good at teaching yourself things out of the book/from the slides Colacelli posts online then you will be fine. In order to really do well, you need to find yourself a group of people who semi-understand economics already and make sure you do your problem sets with them (yes they are on Aplia, and yes, they are horrible... don't leave them until 2 pm on Friday). Her midterm/final is damn near impossible, considering the average for our midterm was in the 40s, she thought this was \"good for us\" ...right. Just study almost all the topics, don't stop writing, and do the questions that are worth the most points first, because you will not have enough time to do all of them. You can still get away with a b+/a- if you get a 40 on the midterm... so don't worry! if you can, avoid taking it with her, but you'll live if you have to take it with her.\nWorkload:\nWeekly aplia prob sets (sometimes more than one a week), one midterm (35%) and a final (45%). you don't reallly need to go to class since she posts everything online... so don't feel guilty if you skip.\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "December 12, 2005",
            "review_content": "\ni'm sure she's a great person but i think she should really drink a few cans of red bull before beginning her lecture...or perhaps she should be allowed to have a few glasses of wine before and during class.\nher monotonous argentine accent just makes her lectures even more boring.  sometimes i wished she would lecture in spanish just to make it more interesting.  I actually stopped attending this class for an entire month and when I finally returned to class after a month long absence i saw the 4 people sitting closest to me fall asleep.  a month ago i had never seen these people fall asleep.\nthe material for the course itself isn't that difficult to grasp.  i didn't think the midterm was as hard as many other people in the class thought it to be...it was just long.  in my experience, classes with lots of first year(?) barnard girls always have very generous curves.\nI would recommend this class because it is relatively easy...but i would also have to recommend avoiding this class simply because it is so boring.  this class is equivalent to a slightly more difficult class that is more engaging.  i'd take the slightly more difficult that was more engaging.  you'll end up with the same grade, but at least you weren't bored.  if you're a nerd or have an unusually high tolerance for extremely boring lectures then take this class and you'll do well without taking any losses.\nWorkload:\nyou'll get sick of all those problem sets.  the aplia problem sets can be as much work as the hand-in problem sets (she tends to give multiple sets simultaneously).  if you're a loner, make at least one friend in this class so that when it comes time to doing the problem sets you can split them with your friend 50/50. if you can, make 2 friends and do only 1/3 of the problem sets.  make 4 and you only do a quarter of the work.  damn, maybe i did learn some economics in this boring ass class\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "December 11, 2005",
            "review_content": "\nProf. Colacelli is a very nice, caring professor.  She is very willing to help you with anything that you are having trouble with and is very knowlegable.  She knows A LOT the current economic situation in almost every country.  She gives out slides for every chapter as well as supplementary readings.  These can be helpful to understand the reading.  Take notes right on the slides and you'll have no problesm on the midterm/final.  However, her lectures can be fairly boring since she reads directly from the slides.  I would still go to class though, because she gives great stories and is able to add life to the dull book.  Overall, this was a great class; I never thought I'd enjoy economics but I did and I learned a lot!  \nWorkload:\nnot too bad: weekly problem sets (can get tedious,)chapter readings, and supplementary readings.  One midterm and a final.  \n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "December 11, 2005",
            "review_content": "\nProf. Colacelli is a very nice, caring professor.  She is very willing to help you with anything that you are having trouble with and is very knowlegable.  She knows A LOT the current economic situation in almost every country.  She gives out slides for every chapter as well as supplementary readings.  These can be helpful to understand the reading.  Take notes right on the slides and you'll have no problesm on the midterm/final.  However, her lectures can be fairly boring since she reads directly from the slides.  I would still go to class though, because she gives great stories and is able to add life to the dull book.  Overall, this was a great class; I never thought I'd enjoy economics but I did and I learned a lot!  \nWorkload:\nnot too bad: weekly problem sets (can get tedious,)chapter readings, and supplementary readings.  One midterm and a final.  \n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "December 11, 2005",
            "review_content": "\nProf. Colacelli is a very nice, caring professor.  She is very willing to help you with anything that you are having trouble with and is very knowlegable.  She knows A LOT the current economic situation in almost every country.  She gives out slides for every chapter as well as supplementary readings.  These can be helpful to understand the reading.  Take notes right on the slides and you'll have no problesm on the midterm/final.  However, her lectures can be fairly boring since she reads directly from the slides.  I would still go to class though, because she gives great stories and is able to add life to the dull book.  Overall, this was a great class; I never thought I'd enjoy economics but I did and I learned a lot!  \nWorkload:\nnot too bad: weekly problem sets (can get tedious,)chapter readings, and supplementary readings.  One midterm and a final.  \n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "November 07, 2005",
            "review_content": "\nI'm sure she's very nice, but Professor Colacelli's sterling Harvard credentials still don't save her lectures from being tedious at best. Since day one, every single one of the lectures, no joke, was a powerpoint slide show of exactly what the book says - including the exact same diagrams and examples! She then proceeds to read off the slides for an hour and fifteen minutes (the entire class). Her idea of involving the class are random fill in the blank questions that no one responds to because they're all asleep. The problem sets given each week take time, but are easy. The midterm was awful, and ended up with a curve where 50% earned you an A-. At least she's prompt with emailed questions. Save yourself the time and skip the uninspired, pre-packaged lectures.\nWorkload:\nreading and problem sets only. normal to light workload.\n"
        }
    ]
}