{
    "prof_info": [
        {
            "prof_name": "Allan Blaer",
            "prof_id": 297,
            "total_reviews": 26
        }
    ],
    "reviews": [
        {
            "course_name": "Electromagnetic Theory",
            "review_date": "December 29, 2011",
            "review_content": "\nHaving taken a class by Prof. Blaer for the third time, I must say he can teach any course in physics! The material is very clear, concise, and informative. His organization makes reviewing your notebook so much easier and it ultimately helps with the exams. He extended this course by half-hour each lecture to make time for recitation, which allowed people to come on either day depending on their progress with the homework.\nThe exams are straightforward and fair. They are also very interesting because once you do them, you feel like you've learned something so deep! If you screw up the midterm, no worries, because depending on your performance on the final, he will omit the midterm as one of his ways he formulates the grades. \nAll in all, any class Prof. Blaer teaches will be a class on my schedule! Since I'm now a grad student, I may not have a chance to have him anymore... so I spread my word of advice - if you have the chance to - take any of his courses!!\nWorkload:\n 4-5 problems per week, one midterm (may be omitted from grade), one final\n"
        },
        {
            "course_name": "Mathematical Methods of Physics",
            "review_date": "February 20, 2011",
            "review_content": "\nCurrently taking Math Methods with him. He is a wonderful professor. I am a new grad student and previously went to a liberal arts college for my undergrad. I've come to realize that the highest praise I can give a professor is that they make me feel like I'm back with one of my undergrad professors, and he fits that description to a T. Both in class and in his office hours it feels like I'm sitting with my undergrad advisor or one of the many other excellent professors I had in undergrad.\nExcellent professor, very approachable (3 hours of office hours a week, split over two days, and is happy to sit and explain things to you), and he seems like he wants you to succeed and isn't just looking to jam everyone into a curve. His recitation sessions are also very useful and honestly unless you're easily knocking out the problems on your own, I think you're foolish not to stay for them.\nA+\nWorkload:\n1 problem set a week, 1 midterm, 1 final\nIf you bomb the midterm and then do well on the final he won't count the midterm.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "January 09, 2010",
            "review_content": "\nExcellent professor and great class. Blaer is one of the best physics professors I ever have had. He is one of the few lecturers who have mastered the fine art of being detailed and thorough while still being clear and concise.\nBlaer goes over every concept he holds you responsible for in his lectures. As other reviews have mentioned, he gives all his lectures from memory and does a much better job than most other professors who have their notes in front of them. His delivery is smooth and his pace is well measured. All his points are well connected and tend to reinforce each other. He presents a healthy mix of proofs and applications, so you not only understand the concepts but also know how to use them to solve problems.\nIn the first portion of the class, he covered all the basic classical mechanics topics from the Newtonian perspective i.e. projectile motion, momentum and angular momentum conservation, energy conservation and oscillations. In the second portion of the class, he introduced calculus of variations and langrangian mechanics, which is essentially an alternative to newtonian mechanics. He also spent a good amount of time on the two-body problem where he went over Kepler's orbits among other things. \nWorkload:\n10 problem sets or so every week, which were graded and handed back to us a week after we turned them in.\n1 midterm and 1 final, which were very fair. They tend to be application based problems, so if you review all the problems he did in class and assigned for hw, you should be fine. On top of all that, he curves to an A-!!\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 15, 2009",
            "review_content": "\nAllan Blaer is one of if not the single best teacher I've had yet at Columbia.  He genuinely cares about his students and puts in much more time and effort for this class than he is required to, by teaching two recitation sections and grading all of the midterms and finals himself.  On top of that, he seems to know everything there is to know about every detail of classical mechanics and how it relates to other areas of physics, is full of interesting anecdotes about the physicists after whom the theorems we use are named, and even goes as far as to discuss the philosophical implications of each of the approaches we cover, all of which make the class much more interesting than simply reading a textbook.  On top of all that, he's always in a good mood; jolly,if you will, like santa clause.  He'll make your heart melt with his gentle, soothing explanations of the Euler-Lagrange Equations while keeping you on your toes by yelling a few carefully chosen terms with tremendous fervor.  I suppose it's something you must experience for yourself  to really appreciate.\nWorkload:\nWeekly problem sets, but he'll typically cover (meaning give detailed solutions to) 3 of the 6 to 8 problems in the recitation sections.  If you were really lazy you could go to both of the recitations and ask him to cover different problems at each one.  Midterm is very fair, as I'm sure the final will be too.  He explains beforehand what topic(s) each problem on the exam will cover and encourages you not to memorize formulas because the ones you will need are provided.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 07, 2009",
            "review_content": "\nHe is a very good teacher. It's not anything spectacular or ground-breaking but he does a very decent job, I mean, very decent. The class is not like those verbose introductory physics, but combines essential intuition about physics and simple, neat mathematics needed to understand the physics. He explains every crucial points, and make you understand the material without trying so hard. Problem sets are usually demonstrative or classic problems of the subject, and not very long. He is reachable during his office hours (contrary to some physics instructors who aren't very much) and actually spends quite a lot of time in Pupin.\nWorkload:\nlight to medium. about ten problems each week. all graded.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "July 06, 2008",
            "review_content": "\nTake any class Prof. Blaer teaches! He makes mechanics really easy because you actually learn it when he teaches. As said by the other reviewer he lectures without notes and holds recitation himself. He's also very funny and sweet. The problem sets aren't bad and the exams are also straightforward. You should go to class because he's an excellent lecturer and it will make the class much easier for you. \nWorkload:\nweekly problem sets will take some time as a few problems on each will have some tricky subtlety or messy algebra so start them ahead of time. If you start the night before it's doable, just plan on an all-nighter. Exams are very fair, especially if you've been to class and did the psets\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "January 01, 2008",
            "review_content": "\nThis class was one of the most spectacular classes I've had in my undergraduate career! Professor Blaer is a wonderful professor that loves to teach and really loves his students. He also has an incredible passion for physics, and he teaches his lectures from memory! I would highly recommend this course to anyone wanting to take an upper level physics class.\nWorkload:\nWeekly problem sets straight from the book (not too hard, but can get lengthy), 1 reasonable midterm (the average is curved to a B+/A-), one harder final (same curve)\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 11, 2007",
            "review_content": "\nJust another positive review for Prof. Blaer, who is the most thorough professor I have ever had.  He will explain each and every detail in every step, so it's almost impossible to be lost in his lectures.  Although this has the side-effect of slowing down his pace (we sort of ran out of time at the end of the semester), his amiable disposition more than makes up for it.  Prof. Blaer can make any and everything clear to anyone.\nThe problem set problems are well chosen so that you don't have to spend hours trying to find your way through pages of algebra.  He runs recitation sections personally, which means that even the problems were thoroughly explained.\nWhat more can I say?  He cares about his students learning the material; he teaches without notes (an incredible feat, considering the messy algebra that he goes through); he can and does explain everything.  He's perfect.\nWorkload:\nA problem set per week (9 problems on average per set).  Midterm and Final.  Very, very fair grader on midterm.\n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "July 14, 2006",
            "review_content": "\nAlan Blaer is without question the greatest professor I have ever had in either my academic career, undergrad or postbacc.  He has a great sense of humor, and his lectures are absolutely crystal clear and fun.  Although there are numerous factors that I can't identify, I'd say that Professor Blaer does three things which make his teaching great:\n1.  He includes many of the rigorous concepts (unit vectors, the cross product and line integral -- though he never actually used the latter term in class) behind the material that other professors gloss over.  Other professors think that including such things will confuse students but don't realize that they are necessary for students' understanding.  Moreover, Professor Blaer has the talent to present such concepts so that they are absolutely clear to students.  The result is that every idea Professor Blaer presents is well-defined -- no ambiguity.\n2.  During the first few minutes of every class, Professor Blaer runs through (almost) all of the material we covered in the previous lecture, or at least everything that is a prerequisite to understand the current lecture.  He always begins this with his famous phrase \"You will recall . . .\"  The result is that many fewer students are lost due to missing or forgetting the material of the previous lecture.\n3.  He takes the different problems that are given in the book, classifies them into a handful of categories, and he shows you the method to solve each category of problem.  Therefore, for every problem that was thrown at us, we could identify its type and the method needed to solve it.  The result was that the process of problem-solving, which is often a crap shoot even in science classes, became systematic.\nThere were 2 midterms and a final.  All were certainly fair tests.  In the pre-exam review session, Professor Blaer does tell you the *type* of questions that will show up on the exam and the method of solving that type.  However, I'd say that the actual exam problems are significantly harder that the ones in the review session.  Therefore, substantial studying is still required, even with the review session.\nIf you have the opportunity to take *any* class with Professor Blaer, do not miss this opportunity.  Professor Blaer will make you love physics and love him, even if you have no initial interest in the subject.  Professor Blaer sets a very high standard for teaching that, unfortunately, other professors do not live up to.\nWorkload:\nProblem Sets (15%), 2 midterms (each 25%), Final (35%)\n"
        },
        {
            "course_name": "1202",
            "review_date": "March 04, 2006",
            "review_content": "\nblaer is a nice man and a good teacher but he lets some students run wild, asking stupid questions. his review sessions are key, but again they would only be 2 hours if he would just tell the postbaccs to shut up and ask what constant acceleration is during office hours. his tests are trickier than you might expect, given the problems he does in class, but not impossible by any means. just study the class notes and look over the homeworks and you will be fine. if you took high school physics there is no need to come to class, just go to the review session and hand in the homeworks. if you took ap physics (i did) do yourself a favor and just take 1400. theres a great curve and the material is at least more challenging. i feel ashamed that i dont know how to use anyt calc in physics.\nWorkload:\nproblem sets are long and a pain in the ass, but if you go to the recitation the ta will basically do your homework for you\n"
        },
        {
            "course_name": "1202",
            "review_date": "March 04, 2006",
            "review_content": "\nblaer is a nice man and a good teacher but he lets some students run wild, asking stupid questions. his review sessions are key, but again they would only be 2 hours if he would just tell the postbaccs to shut up and ask what constant acceleration is during office hours. his tests are trickier than you might expect, given the problems he does in class, but not impossible by any means. just study the class notes and look over the homeworks and you will be fine. if you took high school physics there is no need to come to class, just go to the review session and hand in the homeworks. if you took ap physics (i did) do yourself a favor and just take 1400. theres a great curve and the material is at least more challenging. i feel ashamed that i dont know how to use anyt calc in physics.\nWorkload:\nproblem sets are long and a pain in the ass, but if you go to the recitation the ta will basically do your homework for you\n"
        },
        {
            "course_name": "1202",
            "review_date": "March 04, 2006",
            "review_content": "\nblaer is a nice man and a good teacher but he lets some students run wild, asking stupid questions. his review sessions are key, but again they would only be 2 hours if he would just tell the postbaccs to shut up and ask what constant acceleration is during office hours. his tests are trickier than you might expect, given the problems he does in class, but not impossible by any means. just study the class notes and look over the homeworks and you will be fine. if you took high school physics there is no need to come to class, just go to the review session and hand in the homeworks. if you took ap physics (i did) do yourself a favor and just take 1400. theres a great curve and the material is at least more challenging. i feel ashamed that i dont know how to use anyt calc in physics.\nWorkload:\nproblem sets are long and a pain in the ass, but if you go to the recitation the ta will basically do your homework for you\n"
        },
        {
            "course_name": "Physics II",
            "review_date": "May 24, 2005",
            "review_content": "\nSome of you prima donna/stereotypical Ivy Leaguers who are complaining that Blaer insults your intelligence with his staightforward exams should probably snap out of it this instant. I'd like to see you take a higher level physics class taught by somebody other than Blaer and see how well you do. Sure enough, you'll come back repentant and wishing you had never acted like little physics prodigies. You're limited intelligence, furthermore, manifests itself in your inability to accurately and objectively assess a professor. You came here to learn, not to show other students what you've got. If you don't like Blaer because he wants to reinforce and resynthesize concepts for everybody in his class, and would instead prefer a professor that makes the top 5% shine without imparting any useful knowledge, then go somewhere else, because it's people like you that make Columbia a laughing stock around other schools. \n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "May 22, 2005",
            "review_content": "\nProfessor Blaer can translate concepts into plain words better than anyone I've had at Columbia.\nHe's good natured, organized, engaging, and smart.  Also goofy-funny.  Lectures from memory.  Very compulsive when it comes to Physics (likes to stay after class and look over the notes he has left on the board).  His compulsiveness can be mistaken for arrogance, but it's really dedication.  Links past and current topics very well.  Prefers variables to numbers (unless numbers make more sense, e.g. circuits), which helps because it works to avoid losing track of the physics in a series of calculations.  Answers questions well and completely.\nThat said, he takes his sweet time doing all these wonderful things.  For every one outstanding student at Columbia there are at least two or three who are not as gifted but try to make up for it through hard work.  A Blaer class helps the latter, but not to the detriment of the great student, who just gets bumped up to an A+.\nThe curve is very high, with the median representing the cut-off between a B+ and an A-.  Close to half the class gets some sort of an A letter grade, which is ridiculous.\nOverall, if you want to understand and even enjoy Physics, learn how to approach problems efficiently, and have the grade to match, then Blaer is your man.\nWorkload:\nWeekly problem sets (~3 hrs/wk), 2 Midterms, Final.  The problem sets, brief review of his weekly notes, and an occasional check with the text is enough (6 hrs/wk max).\n"
        },
        {
            "course_name": "Physics II",
            "review_date": "May 12, 2005",
            "review_content": "\n  Everyone only likes Blaer because he's ridiculously easy. The exams are a total joke!!! He tells you every problem on the exam the week before. This is cheating!!! Some one should report him to the Honor Council. Furthermore, his lectures are painfully slow for those in the class who are decent at physics. He treats his students like retards. \n  That being said, there is something to be said for the no calculators tests. Because there are no calculations, you tend to know the equations a lot better, rather than perfecting your math skills and I think you get a much better conceptual understanding of Physics, which is really what makes it hard to begin with (the math part isn't so bad). Plus, there are no calculators on the MCATs, so this seemed like a good idea to me. \nWorkload:\nTurning in problem sets everyweek is a pain in the butt. Tests are really easy and the means are really really high. Everyone in the class gets an A or an A+.\n"
        },
        {
            "course_name": "Physics I and II",
            "review_date": "April 19, 2005",
            "review_content": "\nI completely disagree with the previous reviews!  I find him to be VERY pretentious and arrogant.  His lectures are not awe-inspiring as other posters claim.  \nThe curve is insane and the grading is very confusing at best.  Beware of students being friends with the graders because it ruins it for the rest of us.  This is the classic case of a class that is full of bull***.  People rave about him, and I do NOT understand why.  I dread going to his lecture every day!  And his final is nothing like any of the midterms.  Take ANYONE else and save yourself the aggravation. \nWorkload:\nnot to bad BUT don't forget any negative signs because the means are so high that that will mean the difference between letter grades!  \n"
        },
        {
            "course_name": "general physics",
            "review_date": "April 17, 2005",
            "review_content": "\nProfessor Blaer is incredible.  Simply put, he is the best professor I've ever encountered.  Period.  \nI switched from Professor Budick's class to Professor Blaer's for the second semester of general physics and it was the best decision I've ever made.  Many people say that Blaer is easy--what they don't realize is that you really do learn the material inside and out.  I think many of us are suprised to get an A or a B+ on a physics exam because we've never had such an incredible professor before; we're used to going into an exam \"somewhat\" knowing the material and coming out with a \"so-so\" grade.  I find that when Prof. Blaer simply reviews a concept from first semester (\"Recall that. . . \")  I actully understand it!  When I was in professor Budick's class I had no idea what angular momentum was, but then Blaer mentions it to clarify a point about electric fields and I actually get it.  This makes me angry that I wasted my money with Budick while some students got to have two semesters of Blaer, but at least I got a semester.  When I go back and study E and M for the MCAT, I'll look over my Blaer notes and forget that awful textbook.  \nThe man is a genius; his lectures are absolutely flawless.  Take this class even if you're not a premed; take it just to learn about electricity and magnetism.  If you're in another class with someone else, do yourself a favor and go to Blaer's lectures once in a while, just to really learn the material.  \nFinally, Blaer just inspires his students.  You genuinely like physics during your time in his class--a class many students loathe.  If I was an undergrad taking this class, I think I would probably concentrate in physics, just because Blaer made it so interesting and engaging.  Note that I came out of first semester with Budick wanting to study anything but physics.  I think it's one thing to be wowed by a class, and it's another to be inspired by it.  \nWorkload:\nNot too bad.  You have a problem set every week (of very well chosen problems that Blaer appears to select because they really bring out important concepts) two midterms and a final.  Some professors seem to focus on making the problems on the exam the hardest you've ever seen; Blaer doesn't do this--the hardest problems are the ones in your homework that you have several hours to think about and learn from.  If only other professors would focus on teaching instead of forcing a bell curve, we'd all be better off for it.\n"
        },
        {
            "course_name": "general physics",
            "review_date": "April 17, 2005",
            "review_content": "\nProfessor Blaer is incredible.  Simply put, he is the best professor I've ever encountered.  Period.  \nI switched from Professor Budick's class to Professor Blaer's for the second semester of general physics and it was the best decision I've ever made.  Many people say that Blaer is easy--what they don't realize is that you really do learn the material inside and out.  I think many of us are suprised to get an A or a B+ on a physics exam because we've never had such an incredible professor before; we're used to going into an exam \"somewhat\" knowing the material and coming out with a \"so-so\" grade.  I find that when Prof. Blaer simply reviews a concept from first semester (\"Recall that. . . \")  I actully understand it!  When I was in professor Budick's class I had no idea what angular momentum was, but then Blaer mentions it to clarify a point about electric fields and I actually get it.  This makes me angry that I wasted my money with Budick while some students got to have two semesters of Blaer, but at least I got a semester.  When I go back and study E and M for the MCAT, I'll look over my Blaer notes and forget that awful textbook.  \nThe man is a genius; his lectures are absolutely flawless.  Take this class even if you're not a premed; take it just to learn about electricity and magnetism.  If you're in another class with someone else, do yourself a favor and go to Blaer's lectures once in a while, just to really learn the material.  \nFinally, Blaer just inspires his students.  You genuinely like physics during your time in his class--a class many students loathe.  If I was an undergrad taking this class, I think I would probably concentrate in physics, just because Blaer made it so interesting and engaging.  Note that I came out of first semester with Budick wanting to study anything but physics.  I think it's one thing to be wowed by a class, and it's another to be inspired by it.  \nWorkload:\nNot too bad.  You have a problem set every week (of very well chosen problems that Blaer appears to select because they really bring out important concepts) two midterms and a final.  Some professors seem to focus on making the problems on the exam the hardest you've ever seen; Blaer doesn't do this--the hardest problems are the ones in your homework that you have several hours to think about and learn from.  If only other professors would focus on teaching instead of forcing a bell curve, we'd all be better off for it.\n"
        },
        {
            "course_name": "general physics",
            "review_date": "April 17, 2005",
            "review_content": "\nProfessor Blaer is incredible.  Simply put, he is the best professor I've ever encountered.  Period.  \nI switched from Professor Budick's class to Professor Blaer's for the second semester of general physics and it was the best decision I've ever made.  Many people say that Blaer is easy--what they don't realize is that you really do learn the material inside and out.  I think many of us are suprised to get an A or a B+ on a physics exam because we've never had such an incredible professor before; we're used to going into an exam \"somewhat\" knowing the material and coming out with a \"so-so\" grade.  I find that when Prof. Blaer simply reviews a concept from first semester (\"Recall that. . . \")  I actully understand it!  When I was in professor Budick's class I had no idea what angular momentum was, but then Blaer mentions it to clarify a point about electric fields and I actually get it.  This makes me angry that I wasted my money with Budick while some students got to have two semesters of Blaer, but at least I got a semester.  When I go back and study E and M for the MCAT, I'll look over my Blaer notes and forget that awful textbook.  \nThe man is a genius; his lectures are absolutely flawless.  Take this class even if you're not a premed; take it just to learn about electricity and magnetism.  If you're in another class with someone else, do yourself a favor and go to Blaer's lectures once in a while, just to really learn the material.  \nFinally, Blaer just inspires his students.  You genuinely like physics during your time in his class--a class many students loathe.  If I was an undergrad taking this class, I think I would probably concentrate in physics, just because Blaer made it so interesting and engaging.  Note that I came out of first semester with Budick wanting to study anything but physics.  I think it's one thing to be wowed by a class, and it's another to be inspired by it.  \nWorkload:\nNot too bad.  You have a problem set every week (of very well chosen problems that Blaer appears to select because they really bring out important concepts) two midterms and a final.  Some professors seem to focus on making the problems on the exam the hardest you've ever seen; Blaer doesn't do this--the hardest problems are the ones in your homework that you have several hours to think about and learn from.  If only other professors would focus on teaching instead of forcing a bell curve, we'd all be better off for it.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 04, 2005",
            "review_content": "\nAn outstanding physicist and a gifted instructor are not two things which Columbia is great at making out of a single human brain. By the end of the course, you will realize that Blaer is a rare exception to this general premise. At first, the succession of blackboards spent on the rigors of a single part of one problem may bore the hell out of you, depending on your reason for being in the class, and on top of that, your notes may be next to useless. But then the exams roll around, and all the people you hear walking around saying how easy their classes are start crying about how they got totally raped on their exams. And you? You attended the review session the previous SundayÂ…studied the review notes with anything more than zero presence of mind, and got in the 90s. BlaerÂ’s problem-solving approach to the class really succeeds in tying everything presented together into a few basic concepts which you very likely understood years before you were accepted to Columbia. Highly recommended classÂ…but you must learn to trust his ingenious approach. \n\nWorkload:\n10-12 problem sets of about 15 problems each, so set aside some time, they could take some concentration. 2 midterms, and a final exam, DO NOT miss the review sessions. \n\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 22, 2004",
            "review_content": "\nSimply put, the man's amazing. He takes entire chapters worth of material and condenses them into one or two simple, easy-to-remember equations.  He defines all his terms clearly and backs up all of his explanations with helpful examples.   He's also extremely understanding of student concerns and easy to approach. The textbook is awful, but even he encourages you to ignore it sometimes.  If you're planning to take physics and see his name listed next to a course, do anything you can to get into it--you will love the decision forever.\nWorkload:\nModerate--11 weekly problem sets, 2 midterms, final.  Very fair grading.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 10, 2004",
            "review_content": "\nBlaer is the real deal.  Definitely take a class with him if you get the chance.\nWorkload:\nWeekly problem sets - easy.  Midterms - easy.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "November 19, 2004",
            "review_content": "\nProfessor Blaer is a god, but Satan must have created this awful, awful textbook that is used in the course. Although the problems Blaer chooses are exactly what he focuses on, the answer key is full of errors, the reading is useless, and most of  the problems are horribly tangential. So once again, amazing teacher, pitiful textbook.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "November 19, 2004",
            "review_content": "\nProfessor Blaer is a god, but Satan must have created this awful, awful textbook that is used in the course. Although the problems Blaer chooses are exactly what he focuses on, the answer key is full of errors, the reading is useless, and most of  the problems are horribly tangential. So once again, amazing teacher, pitiful textbook.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "November 19, 2004",
            "review_content": "\nProfessor Blaer is a god, but Satan must have created this awful, awful textbook that is used in the course. Although the problems Blaer chooses are exactly what he focuses on, the answer key is full of errors, the reading is useless, and most of  the problems are horribly tangential. So once again, amazing teacher, pitiful textbook.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "December 31, 1999",
            "review_content": "\nThe man is incredible. He does not use any notes and yet his lectures flow flawlessly. I do not remember him making any mistakes while working out even the messiest of examples. It's actually quite scary how organized he is without any notes. It's as if he memorizes the lecture before teaching it. His teaching style is incredible as well because you actually look forward to coming to class and sitting in it for 2 and a half hours (Although we did get 2 5 minute breaks). The notes you take in that class can substitute a textbook (That's why the textbook is just recommended). The homeworks are hard but he makes the material so interesting that you want to spend the 15 hours every two weeks trying to get all the problems. The tests are fairly easy and he is a lenient grader with the average being an A-/B+. Although, don't expect your tests back too soon. It usually takes him about a month or so to grade the midterms, and even longer to grade the finals. (We got ! our fall grades in the middle of February!) The bottom line is that he is the BEST professor I have ever had and his class was my favorite of all the classes I have ever taken (And I'm not even a physics major)\nWorkload:\nHe'll make you earn the 4.5 points but it's definitely worth it\n"
        }
    ]
}