{
    "prof_info": [
        {
            "prof_name": "Diana Romero",
            "prof_id": 2415,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "V1101-V1102 Elementary Spanish",
            "review_date": "April 29, 2015",
            "review_content": "\nI'm not sure why she has a silver nugget. She is very nice but her class is not. I'm not the best Spanish speaker but picked it up well enough to get an \"A\" in Spanish 1 but got a \"C\" in her class despite putting forth much more effort. She will post assignments sometimes hours before class and expect them to be completed. The projects she assigns are extremely confusing and of very little benefit. More often then not she replaces actually teaching the material with just having the class do exercises for an hour. \nIf you enjoy a lot of busy work, sub-par teaching and getting bad grades then this is the class for you. \nWorkload:\nToo much\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "April 15, 2015",
            "review_content": "\nWhy is Prof. Romero so highly rated?? Why?? She is a wonderful person, very kind and sweet, but her class is a mess. She will assign homework at 2 am and expect it done for class. She will change due dates, she will assign projects that make no sense. She is an incredibly harsh grader. Most students are failing this class, and I had to P/D/F it. DO NOT TAKE THIS CLASS\nWorkload:\nWeekly MSL, either easy or OVERWHELMINGLY HARD, homework assigned last minutes (ie: 2 am) for class the next day, midterm, final\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "March 31, 2014",
            "review_content": "\nI don't know who the person is being reviewed here, but my class, and friends in other classes taught by her, will attest that she is an awful teacher and one who has made our lives significantly worse. Putting positive reviews about her does a disservice to the Columbia community. \nThe workload is immense and her whim is arbitrary. She goes by the textbook and can sometimes make class interesting, but more often makes it needlessly complicated by introducing tasks that have nothing to do with actually learning Spanish. This goes double for homework, where she is inflexible and \nMuch of class is spent partnered into various groups of two or three with her yelling at us whenever we finished early because she was that anxious about us not slacking off. There was not a moment where we didn't feel judged, and judged poorly at that.\nAll in all, this class is something that neither I nor my classmates would wish on anyone. \nWorkload:\nYou will routinely be surprised with entire plays to be written and memorized within two days or interview news pieces of 500 words to be delivered within the week. Homework is posted late and has often come as a surprise to most of our class. \nMost people in this class agree that it takes up more time than any other class they have, often more than other classes combined. \n"
        },
        {
            "course_name": "Spanish for Spanish-Speaking Students",
            "review_date": "May 03, 2013",
            "review_content": "\nI grew up in a Spanish-speaking household, but had limited formal instruction in Spanish. If this sounds like your situation, and you want to learn to write and speak well in Spanish take this course.\nProf. Romero put a lot of effort into the course, partnering with the University of Arizona to create a Wiki where we spoke to penpals and uploaded our essays. Prof. Romero similarly demanded a lot of effort on the part of the students, asking us to research a Latino neighborhood in NYC, visit the neighborhood and interview residents, write informative and narrative essays, upload videos and photos onto the class Wiki, and make a presentation about our project. Although this seems like a lot of work, the tasks built on each other so that the research paper on the neighborhood helped you write the following essays. I enjoyed the opportunity to visit a neighborhood and speak to my classmates about their projects.\nUltimately, the course is what you make of it. I took the opportunity to speak in class and write and re-write drafts and now find that I am much more comfortable writing and speaking in Spanish. This course is much more than an intensive grammar review-- if you are looking purely for grammatical instruction, take another course. \nWorkload:\nFour essays, rough draft plus final draft uploaded to Wiki:\n-research paper on Latino neighborhood in NYC (3-4 pages)\n-first-person narrative about famous Latino resident of chosen neighborhood (2 pages)\n-narrative description of visit to neighborhood (2 pages)\n-newspaper article including video interviews with neighborhood residents (3-4 pages)\nGrammar homework, one class meeting per week devoted to grammar\nCorrespondence with penpal\n"
        },
        {
            "course_name": "Spanish for Spanish-Speaking Students",
            "review_date": "December 02, 2012",
            "review_content": "\nI took Spanish for Spanish Speakers because I speak Spanish at home but had never taken a course in any of my years at school. I had one semester to fulfill the requirement and I thought this would be a good way to learn the basics that I hadn't gotten through my casual speaking at home with family. To start off, I can't say I got what I wanted from this class. It was great conversationally because all the students were pretty much fluent so the conversations we had in class were good but we flew over the grammar and she expected us to take in all of it. Second, Diana is a nice woman and a good spanish teacher but she expects SO much from the students in her class. I think if I hadn't been taking the class just to fulfill the requirement I would have been more willing to put in the work, but it is not what I wanted as a simple Spanish class. We had homework due for every class and on top of that we were writing papers, writing in forums, writing to penpals, and preparing presentations. The work was just piled on top of other work which made it really unclear when certain assignments were due, and she's a bit of a stickler for due dates. She also graded pretty tough but wasn't clear in what she wanted. Her attendance policy was also kind of ridiculous and she took it way too seriously. You get three absences for the semester, however she counts 2 tardies as a missed class, which means being 5 minutes late to class can eventually really hurt your grade. I felt that was a bit harsh since it was an early class and it met on Fridays. Overall, there were some great parts of this class but I wouldn't say it was worth the energy that I put into it. \nWorkload:\nNightly homework, which coincided with bigger projects like papers and presentations and also smaller projects like writing to a penpal and discussions in forums. I thought the workload was really large and pretty time consuming. \n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "May 09, 2010",
            "review_content": "\nThis is probably the best and most rewarding Spanish class I have ever taken, hands down. Unlike most other graduate instructors I have ever encountered at Columbia, Diana actually puts effort, planning, creativity, and care into her class. She is incredibly organized and makes use of all kinds of technology--CU EdBlogs, Google Sites, MySpanishLab, in class audio/video, etc. Note: because she uses the online service MySpanishLab, DO NOT BUY THE BOOKS USED OR SEPERATELY, as only the new book SET includes access to this, and seperately the access is very expensive. Expect to learn a lot, but also expect to be a little confused in class and commit a good amount of time outside of class. The time commitment is NOT overwhelming, however, as it is spread throughout the semester evenly. Rarely will there be any sleepless nights caused by her assignments--they usually take no more than 20-40 minutes 3x a week, and she is reasonable and forgiving if you forget an activity or two. The only things that take longer are compositions, rare longer assignments, and one project (it was centered around hispanic/spanish art in NYC and was as fun and rewarding as any other project I've done here).\nWorkload:\nNightly activities from the workbook/MySpanishLab, a few compositions, a group/partner project (10 min presentation + lengthy paper + other time committment), and other small assignments\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "January 27, 2010",
            "review_content": "\nShe is a very good professor.  She gives daily homework, but as long as you stay on top of it there shouldn't ever be a problem.  She never picks the homework up.  Instead, she goes over it in class so if you don't do it then she will know when she calls on you.  She is very nice and really makes an effort to help everyone in the class succeed.  She responds back to e-mail fairly quickly.  She doesn't speak too fast and makes it easy to pick up on the language.  I always looked forward to this class.\nShe is very into group work.  I'm not sure if all Spanish classes are like this, but every class we had to work with a partner.  It was usually good when you had someone who was a decent Spanish speaker, but sometimes it sucked.  \nShe is pretty easy going.  If you forget to do your homework one night, she doesn't hold it against you for the entire semester.  \nWorkload:\n4 compositions (though it feels like 8 because you have to revise each composition and turn it in), a midterm (that is standard for all Spanish classes), and a standard final.  One presentation and an oral.  There was also homework nightly, but don't stress over it. \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 05, 2009",
            "review_content": "\nProfessor Romero is a really nice woman, but being in her class always made me feel a little nervous. She always called on students before they even had a chance to volunteer to answer a question. If you take her class, be sure to raise your hand before she has a chance to call any names that way you won't be caught off guard. Overall, her class wasn't too difficult. There is a decent amount of work, but she's a fair grader. She is extremely enthusiastic about teaching Spanish and doesn't waste a second of class. She's also really helpful outside of class and responds very quickly to e-mails. She moves pretty fast during class with her power-point presentations so make sure you pay attention. Also, make sure you participate a lot in class. She loves it when people in class start discussions and express their opinions about different topics. \nWorkload:\n4 compositions (sometimes assigned right after one another), weekly practice exercises in the workbooks, a couple oral presentations, 1 midterm, an oral final, and written final. \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 12, 2009",
            "review_content": "\nI think she is a great Spanish teacher.  She is very good at teaching grammar and makes class fun.  But she moves quickly, so pay attention.  She often shows interesting youtube videos.  She gives insane amounts of homework.  I spent way more time on Spanish than I anticipated.  But you can get away with not doing all of the work because half of it she doesn't check and she tells you what we will go over in class when she assigns it.  She's very organized and assigns work ahead of time.  Uses courseworks a lot.\nIf you are really interested in learning Spanish take her.  If you're just doing it for a requirement then you might want to pick an easier teacher.\n"
        },
        {
            "course_name": "Spanish for Spanish-Speaking Students",
            "review_date": "December 10, 2008",
            "review_content": "\nDon't take this class. Don't do it! Diana is a nice woman when you talk to her one-on-one, but she is not effective or easy to work with in the classroom. The level of homework she gives is simply out of control for a 3-point class, with endless grammatical exercises and weekly \"mesas redondas.\" She starts class early, ends it late, and sends endless emails. There are four formal compositions required, and you will do draft after draft for her just to get a halfway-decent score. Diana also expects you to have a lot of grammatical background, so if you don't have that you will have to work to catch up. You can gain a lot from this class, but you will make yourself quite unhappy in the process. Diana is such a stickler on even the smallest things (like whether you accent every word properly when you email her) that it really hinders the learning process. A class for speaking students is a great idea, but don't take it with her.\nWorkload:\nMassive amounts of grammar exercises, four compositions, two presentations (one individual, one group), midterm and final.\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "November 13, 2007",
            "review_content": "\nLet me break this down for you, I couldn't tell if i hated the class or if I hated how she taught the class because I was too busy doing all the freakin homework. \nShe is no joke about the homework. I spent so much of my time just trying to complete all the assignments that I honestly didn't learn much spanish, which is very sad. She has the ability to teach the class, I saw it a few times when I looked up from doing MORE homework! \nI am in intermediate spanish II now and I have about 1/3 the homework I had in D.Romero's elementary II course. \nWorkload:\nThe workload is HEAVY but not quite obscene. Note: I still can't tell if the workload was so heavy because of her or if it was a department requirement\n"
        },
        {
            "course_name": "W3200 Spanish Grammar and Composition",
            "review_date": "November 12, 2007",
            "review_content": "\nDon't do it to yourself. She gives ridiculous amounts of homework - which you won't finish in time if you have any other classes on your schedule. Then, to make matters worse, she calls on you when she just KNOWS you don't have that question done. I came in thinking that a 5 on the AP Spanish test meant I was well-equipped to take Romero's grammar and composition class. And well...I was wrong.\nWorkload:\nEXTREMELY HEAVY. Four in-class compositions which are graded harshly, about 4 pages of 20 questions on each page for homework each night. Ridiculous. \n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 21, 2006",
            "review_content": "\nDiana is the best language teacher I've ever had - period. She gives a lot of homework, but it's so helpful that when it comes time for the (somewhat challenging) biweekly quizzes, you realize that you don't really need to study as much. She'll spend a ton of time in class going over grammar, and, if you answer incorrectly when she calls on you, she'll spend time going over what you did wrong. Speaking of which, you better do your homework, because her way of going over the exercises is to randomly call on everyone in the class; she'll know when you're not keeping up with the work. Also, as far as vocabulary's concerned, you have to learn it on your own, because she doesn't really much time on it (they'll definitely show up on the quizzes).\nIf there are any negatives about Diana, it'd probably be her pace. She goes ridiculously fast, and as such, she has to assign the aforementioned piles of daily homework. This can be either a good or bad thing, depending on how well you learn languages. \nI'd highly, highly, highly recommend her for Elementary I -- you're going to learn A LOT. She's SO nice and friendly, has tons of patience, and seems to enjoy teaching our class. She's awesome.\nWorkload:\nBiweekly quizzes, 3 compositions, midterm, 1 oral presentation, oral final, and department-wide final. There's also online workbook assignments (and A LOT of them).\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 15, 2006",
            "review_content": "\nDiana is a very happy person and a great teacher- if you want to learn Spanish, this is the class for you. However, if you are thinking that Elem Span will be a breeze you're mistaken. She assigns homework every night and moves pretty quickly. The vocab you are resposible for learning on your own but the grammar she'll spend a lot of time in class on. Great class if taken seriously - you get out as much as you put in\nWorkload:\nDaily homework, tests every other week (oral and written), 3 compositions, cumulative written and oral final\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 10, 2006",
            "review_content": "\nIts hard to review Diana badly (she's a lovely person and very good teacher).  I've heard horror stories about mean or just plain incompetant professors in the department.  She is neither.  However.  Her class was very demanding.  A little too much.  The exercises she assigned only took an hour a night maybe a little more to do workbooks.  But there was so much material covered that I easily spent at least another hour a day doing flashcards and struggled.  She seems to test you on different skills without warning.  (No vocabulary for three quizzes in a row and endless structure variations.) Then, change without warning.  A test with only vocab.  Its hard to figure out how to do well.  At one point, I just wanted to cry during I test.  And I looked up and saw that my study partner was actually bright red and silently crying.  The frustrating part was that extra effort, extreme extra effort, didn't seem to help you do much better.  At one point, I just got frustrated and gave up trying to learn the extra and grade dropped on the quizzes only marginally.  That being said.  I learned a lot.  So much so I'm thinking of taking her again just because I don't want to risk wasting a semester with a bad prof and learning nothing.  However, as the semester is about to start, I am literally waking up in the middle of the night with panic attacks wondering how I'll handle her workload.  So, I may not...Very nice and available women though...so...maybe its just me?  FYI, she does seem to pick favorites in the first week of class, so sit up straight.  \nWorkload:\nLike the other reviewer said.  I put in on average 12 hours a week or more in studying.  And did so, so.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 05, 2006",
            "review_content": "\nDiana Romero is a great professor. She is young, fun, and sweet.  She is very hard-working and very patient if she knows that you are doing your best.  She does not like to waste time in class and I spent a considerable amount of time studying for this course but you will be rewarded for hard work.  Make sure to attend and participate and you will surely do well.  This was my first experience with Spanish and Professor Romero made it an absolute pleasure.  I've heard that there are easier teachers, but if you want to be prepared for the departmental final (which is not that easy), take this teacher.  \n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 26, 2005",
            "review_content": "\nYou'll learn a hell of a lot of Spanish in Diana's class... but that's just the problem--you learn too much! Diana's method of teaching involves heaping piles and piles of homework on her students. I expected about 15 minutes a day, but normally found myself doing at least 45 minutes worth of work (sometimes it took me 2 hours). On top of textbook work, there are hand outs, and in addition to those are the online workbook assignments, which are a pain in the ass to do (and you're never actually told how much they're worth, so you won't know whether or not to bother with them). By the end of the semester, we were already well into the imperfect tense to find that it wasn't even on the department final exam (probably because the other classes didn't even get to it by then).\nThat being said, Diana's a very kind lady who teaches very effectively. It's just that, with other classes to worry about, you might want to try an easier option\n\nWorkload:\nWorkload: already mentioned piles of homework, a quiz every 2 weeks (make sure you know the vocab for these), 3 compositions, 2 oral quizzes, 1 oral final, a midterm, and a final. \n"
        },
        {
            "course_name": "Comprehensive Beginning Spanish (Spanish 1120)",
            "review_date": "May 10, 2005",
            "review_content": "\nDiana Romero is an exceptional professor. She seems to possess the ideal demeanor for a teacher. She is even-tempered, good-humored, and utterly unflappable. She is always available for office hours,  patient and willing to help, both in class and out. I have spoken to several of my classmates from this past semester and they all said that they planned to give her rave reviews. Only Spanish is to be spoken in class. During class she will occasionally explain something in English, but only when absolutely necessary.\nWorkload:\nThis class was a bit overwhelming. It is comprised of Elem Spanish I and II crammed into a single semester. The workload is monumental-there is homework from the textbook as well as HOURS of online coursework required . There is an oral presentation and conversational exam as well. I think there were a total of 8 quizzes plus an oral exam plus the final.  In one memorable week, we covered conditional; future tense; subjunctive mood, AND \"por\" versus \"para\". One could easily spend a single week on any one of these subjects. I found the pace extremely demanding and simply too fast. Nonetheless I did well in the course and learned a great deal, in no small part due to the excellence of Prof Romero. One of my study partners really liked the pace so you need to be aware of your own tendencies. If you're Type A, you'll be in heaven. Make no mistake though, you will work like a dog in this course. \n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "April 24, 2005",
            "review_content": "\nA very good professor.  In addition to being genial and cheerful, is able to come up with a variety of assignments that both exploit our knowledge of Spanish well and ensure that the class never drags.  \nWorkload:\nStandard.  For my MWTRF class, a night'y assignment consisted of about 3 exercises.  Every second week a quiz, the day before which a bi-weekly web assignment (of many simple audio-assisted exercises) would be due.  Occasionally wrote little essays in class (using the dictionary and the text).  \n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "January 11, 2005",
            "review_content": "\nDiana is a great spanish professor. She has a lot of energy, and she makes classes interesting with a lot of her own activities and worksheets. She is also very genuine and will always answer questions. The class is not that hard, but be aware that she will always expect you to do your homework assigmnents (most of which take less than 10 minutes) and she will call on people during class. Participation is key here.\nWorkload:\nVery simple nightly homework. Three compositions. Five or six tests with the lowest score dropped.\n"
        }
    ]
}