{
    "prof_info": [
        {
            "prof_name": "Aftab Ahmad",
            "prof_id": 10941,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Urdu for Heritage Speakers",
            "review_date": "September 24, 2016",
            "review_content": "\nTruly and by far the best language instructor I have EVER had. I have taken classes in 9 different languages since I was a child and he truly is the most gifted, patient, and talented instructor I have ever had. \nWorkload:\nmedium...as expected\n"
        },
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "July 18, 2016",
            "review_content": "\nI took both 1 & 2 sessions of Hindi-Urdu in Summer with Aftab-ji, and I have to be very honest:\nHE IS THE BEST PERSON AT COLUMBIA!!!\nTake his class! You won't regret! He is super patient and nice and cares so much for his students. He is also passionate about Urdu poetry and shares many beautiful verses with his students. \nNothing is easy A at Columbia but Aftab is definitely the person who really wants to give you an A! Just do the homework and get some preparation before the test, he even gives you plenty of hints if you forget anything. What else could you ask? \n\nOverall, I've learnt so much not only about the beauty of the language but also the culture and literature etc. Just take this person's class and I promise you that it would be the best decision you make at Columbia!\n\nWorkload:\nvery light. It was a summer session so we finished things mostly in classroom. \n"
        },
        {
            "course_name": "Urdu for Heritage Speakers",
            "review_date": "May 28, 2016",
            "review_content": "\n\nProfessor Aftab is excellent! He structures the course well, reviewing the very basic at the beginning and picking up the pace as the semester progresses. Over time, he incorporated more reading such as news articles and longer/more difficult passages. The spring semester of UFHS was more work than the Fall semester but it was definitely more enjoyable as well. I picked up so much vocabulary and many grammar constructions. Taking it a yearlong instead of just the Fall definitely improved my speaking and listening skills because at the end of the Fall my reading and writing improved quickly but listening to news and having conversations or debates with good vocab was still difficult. After UFHS with Aftab, you'll be ready for the world! You don't just learn Urdu, the interesting topics covered in the class expose you to an array of different thoughts and give you a new angle to look at and understand life and many cultural issues central to South Asia. \nDo note that how much you learn in this course depends on how much effort you put in. Some people wrote a paragraph for daily homework for example that for analysis of a passage and some wrote 2 pages. If I liked a topic in particular I sometimes spent an hour or two writing my views on something because I would read up on it and look up urdu words etc. \nMake the most of it. Aftab is great and so is urdu literature. \nWorkload:\nclass held 4 days a week with daily homework assignments. Midterm. Final. journal/2 pages in urdu on any topic due weekly. quizzes  (almost) weekly.  \n"
        },
        {
            "course_name": "Elementary Hindi I, Elementary Hindi II, Intermediate Hindi I",
            "review_date": "April 22, 2016",
            "review_content": "\nGreat professor, more quiet than others, but he really is approachable and very nice to his students. \nWorkload:\nDaily homework\n"
        },
        {
            "course_name": "Urdu for Heritage Speakers",
            "review_date": "May 20, 2015",
            "review_content": "\nProf. Aftab is the best professor I've had at Columbia! Take the class if you're a heritage speaker, take Elementary Hindi-Urdu with him if you're not. You'll learn so much about the language, culture, life in general, philosophy, morals, ethics and Aftab himself. It's probably because this class meets four times a week that you get to know him and his thoughts so intimately (plus the fact that it's a yearlong), but this class is incredible. \nWorkload:\nReally up to you. Short homeworks daily, midterms and finals are very easy - he makes sure the class is more fun than pressure, but he expects you to put in effort regardless.\n"
        },
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "January 08, 2014",
            "review_content": "\nProfessor Aftab is the best professor I have had at Columbia. Take his class! He truly cares about teaching the language than the whole grading curve crap. His grades according to how much work you put in and how much you improve which is very nice of him because learning a language is different for everyone. If you attend his office hours, it shows him that you care which in return boosts your grade. Overall if you really want to learn urdu and care about the language/culture it is pretty easy to get a goof grade in his class.\nWorkload:\n1 midterm and 1 Final. homework everyday that he collects but is generally not too difficult. He looks for improvement in the hw so when he hands it back look at your mistake. \n"
        },
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "December 27, 2012",
            "review_content": "\nAftab ji is awesome! He's a good teacher, though in a fairly subtle, quiet way - I feel like he always wants to make you feel you've arrived at it yourself rather than being taught, which is lovely and takes some pressure off. He's got a good sense of humor and will fairly frequently mix it up with Hindi songs or poems or his own reading comprehensions, so classes are fun. He always grades on time and is extremely happy to explain anything in his own time if there's something you don't understand. He's also just a great person and I hope I can take another class with him again. \nWorkload:\nNot hard, especially considering that this is a 5-point class. Short homeworks - 20 minutes, probably - due every class. Usually grammar exercises but occasional compositions. A couple tests of grammar and vocab which aren't hard. You might occasionally need to take the initiative and re-teach a few things to yourself if you forget, but the materials make that easy.\n"
        }
    ]
}