{
    "prof_info": [
        {
            "prof_name": "Leah Zander",
            "prof_id": 13168,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "August 24, 2015",
            "review_content": "\nI came into my UW class with extremely low expectations (I mean, who ever raves about a mandatory writing class), but Ms Zander's class blew me away.\nMs. Zander was kind, fair, and smart - but above all, she was just a really good teacher with the rare ability to facilitate classes effectively. She frequently made time for \"focused free writes\" during classes (which helpfully trained us to be more reflective throughout the writing process), created a very inclusive and non-threatening class environment, and taught us the finer points of academic writing super effectively. And while her essay feedback was top-notch + incredibly helpful, she wasn't the sort to force her opinion down students' throats. Like if you choose not to incorporate her (usually on-point) suggestions into your next draft, it's okay, no one will die. Also, she fed us with cookies/donuts. So I can say with some certainty that Ms. Zander was an excellent instructor to have - and you're lucky if you get her! She's a grad student, though, so I don't know how long she'll be around for. \nMaybe the only con of this class for me would have been the readings. I didn't particularly enjoy most of them (I chose unthemed precisely because I didn't want to have to deal with gender twice a week; however, many of the readings ended up being related to gender issues anyway). But those were just my personal preferences I guess. And anyway the quality of teaching more than made up for the readings by far. \n\nWorkload:\nStandard UW workload. P1, P2, P3, P4 - it's like giving birth four times in one semester. But Ms. Zander's teaching + feedback + fair grading made me feel like I was actually getting something worthwhile out of all that effort. \n"
        }
    ]
}