{
    "prof_info": [
        {
            "prof_name": "Todd Tarantino",
            "prof_id": 2019,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Ear Training",
            "review_date": "July 25, 2014",
            "review_content": "\nPoor professor. I took his class cause of the silver star, but after looking at these reviews, none of them say he's a good teacher, including students who liked him. (I don't understand why CULPA did that.). His class is okay if you already know everything before taking it or want to learn on your own, but even for ear training, he doesn't really teach and just expects you to get it from unknown sources. We were tested on dictations before doing a single one in class and this was a recurrent theme: testing then teaching....or not teaching and testing then testing again. He also seems like a very busy guy and maybe should teach more advanced classes cause he doesn't have the patience for curious students looking to learn something new and has a marked dislike for people taking even Introductory Ear Training as an elective while coming from another department.\nWorkload:\nEverything. \n"
        },
        {
            "course_name": "Introduction to Ear Training",
            "review_date": "January 04, 2013",
            "review_content": "\nWhen I hear Professor Tarantino's name, I just want to laugh.  The first thing I learned about him is that he doesn't care about his students.  He was 5-10 minutes late to every 50 minute class and cancelled several others for personal convenience, all the while complaining there wasn't enough time.  One student also gave him a doctor's note for missing classes for bronchitis that turned into pneumonia (the cough sounded atrocious), stating that he should not go to a singing class at 9am when it hurt him to speak, and Tarantino said he reserved the right to have his absences still affect his grade.  To add icing to the cake, Tarantino offered no office hours for the class and no way to help any of us catch up, showing that he cared so little, he was fine with breaking university-wide rules.  \nStill, this wouldn't be so bad if he wasn't also a constant jerk in every other way, telling students that they didn't care about the course when they were clearly trying to satisfy his impossibly high standards.  Moreover, this was made particularly ironic because despite his insults and anger even when we laughed at OURSELVES for being off-pitch, he himself muddled pitches and could not even meet his own standards in any way.  For example, after giving us an exam on dictation skills without ever having us do a single dictation in class or teaching how to do so during our \"learning\" (one student explicitly asked him how, and he then turned the question on us as classmates though did not find any red flag in the thirty seconds of dead silence that followed),  he terribly screwed up dictations of only a bar or two of songs some student sang for the class, though they still took him twice as long as he gave us for eight bar dictations.  He also asked us to learn a few dozen piano exercises without ever teaching us anything about the piano or testing us on it, again breaking department rules and leaving us to essentially waste our own time without any help from our \"teacher\".  \nQuite simply, Professor Tarantino is not only unnecessarily arrogant and rude, but he is a master of inception.  Through offering no support to students and telling us we didn't care, we lost all interest in learning the subject from him.  Even when he made mistakes through emailing Barnard students at their Columbia email address which resulted in them attending cancelled classes, he only got angry.  Thus, He ultimately only inspired  fear in me, making me lose all memory of the pitches I was just singling and simply want to flee when he had me alone in the room for oral exams.  Thus, it really was quite upsetting seeing a room full of 12 excited students turn into an assemblage of 8 dejected students, only stablized through clinging to each other for support.  Thanks Professor Tarantino for giving us all these funny stories to laugh about!\nWorkload:\nSimultaneously nothing and everything.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "March 07, 2012",
            "review_content": "\nProfeasor Tarantino is truly a master at his craft & he is a very nice guy. However, it doesn't translate into his ability to teach; I truly wish it did.\nThe first couple of classes start slowly and pretty easily. However, once you get about a third way through class, it becomes insane how the class is paced. The only way I made it through his \"Fundamentals Of Western Music\" class was the piano background I had when I was a kid. He teaches the material rather quickly and he doesn't slow down one bit. When asking questions about topics you are confused on, he doesn't really answer you unless you phrase your question EXACTLY to his liking - if you are \"completely lost\" on a topic, and ask him to explain, your question will be answered with a series of questions...I understand it's to help you figure it out on your own, but sometimes that's not what one needs, especially if you understand incorrectly by the end of the conversation. \nAll the lessons are contingent on knowing the material from the previous lessons. If there is a concept you miss out on, it will haunt you especially with the last half of the semester! If you feel left behind, get a tutor or get a group of students together to study with.\nBe prepaired to dive into music theroy very heavily. Honestly, the class should be called \"Fundamentals of Weatern Music Writing and Composition\". It would describe the material you go over through the semester in a better way than the current description reflects.\nIn summary, I don't reccomend taking Professor Tarantino's class. His other music humanity class might be good, but this one is unnecessarily difficult due to his teaching style/ability.\nWorkload:\nWorkload depends on if you get the material right off the bat. Could be medium, but most likely will be heavy!\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 15, 2011",
            "review_content": "\nTarantino is quirky and very smart.  He explains the musical vocabulary very much in his own way, and he is visibly passionate about the material as he speeds through it, desperately trying to cover more than is possible.  Be ready to ask questions often because if you don't you will get left in the dust, so to speak.  Also, he knows a hell of a lot, so ask questions anyway just to tap into the storehouse that is his brain.\nHaving a musical background does not guarantee boredom, nor does it guarantee an easy A.  He has tweaked his class to appeal to both musical and non-musical, and he stimulates interesting, organic (not forced) discussion, simultaneously allowing those with things to say time to speak and making sure to include all of his students.\nThe midterm is a bit scary.  Study longer and harder than you think you should, particularly on the listening portions.  Seriously.\nPop quizzes occasionally.  Prepare by knowing the big picture (development of Western music) and the important names, and approximate dates.  He set up his personal website so that you don't have to buy the book, so return the favor by doing the reading.  You'll get more out of discussion with him that way.\nWorkload:\nLight reading, occasional pop quizzes, a long paper that you turn in twice**, and 2 challenging exams.\n**the 1st time is without a grade, and is returned with extensive comments on exactly how to get A.  ~10 pages.\n"
        },
        {
            "course_name": "Fundamentals of Western Music V1002",
            "review_date": "May 05, 2011",
            "review_content": "\nProfessor Tarantino is a decent lecturer and a nice guy. \nMy only complaint is that he occasionally hesitates to give us solid musical definitions or rules of thumb because he doesn't want to restrict his students' musical creativity. As a result, I felt the class on the whole didn't have a firm grasp on what he was actually doing with his examples. Of course, if this isn't your first music theory class, then this won't be a problem. \nI recommend Tarantino's class for people who have some experience in music theory. He's an easy grader. \nWorkload:\nWeekly assignments, which he synthesizes himself (he doesn't require that you buy the ridiculously expensive book). Three quizzes and a TINY take home final (because the music department forced him to have one). \n"
        },
        {
            "course_name": "Fund. of Western Music",
            "review_date": "April 25, 2011",
            "review_content": "\nProf. Tarantino is a kind of guy who always expects prepared students and therefore he never lingers in a specific topic and moves forward to the new thing just right before we can understand the previous topic. Sometimes I have a feeling that he is a genius that does sort of things (composing music LIVE--in the class) that I can't understand, but actually he can explain things really clear and easy if you talk to him after the class. Basically, he just loves to talk fast in class. If it were not professor Tarantino, I would have hated this way of teaching already. For some reason, having to catch up what he teaches becomes a very fun thing to do. Every time I come into his class I would expect myself to understand almost nothing, note down everything he puts on the board without much understanding, but then some self-study will combine with my flashbacks and everything will just 'click'. This way, I learn new things in this class really really quickly. From basic knowledge of music like intervals, chords, and key signatures to the complicated things like identifying roman numerals and harmonizing the whole song by myself, I learn them all in one class! It is not just like memorizing them for exams and forgetting them all afterward, but I feel like this is the real knowledge I will integrate it in my life. This is the first class I've taken in music, but I already feels like minoring in music! Great class. Great professor. Great inspiration.\nWorkload:\n- About 10 assignments in total. The last one is the final project where you will write your own song (which is cool) based on a given melody (you actually have 3 melodies to choose.) Each homework will not take much time if you have some music background. Your 'composition' will also be played, and then you will be like, crying for joy that finally you have become Bach or Beethoven.\n- Two midterms. The second one is hard.\n- One final in class.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 12, 2010",
            "review_content": "\nMusic Hum with Tarantino was enjoyable.  He is sometimes not the greatest lecturer but knows what he's talking about and is a talented musician.  If you say something dumb he will challenge it and make you elaborate.  He is, like other reviewers have said, not the most organized professor, but he did send us modified syllabi and recording lists and attempt to keep us updated on the class schedule.\nHe uses his own website on which he has detailed (though sometimes convoluted) analyses and descriptions of each composer and piece you need to learn.  You should at least skim these and the assigned readings as there will be questions about both on the exams.  The syllabus itself is interesting and will provoke a few good discussions if you get good classmates.  He also provides study guides for the midterm and final that are basically just lists of terms you should know--helpful but not life-saving.\nWorkload:\nOne paper that you can rewrite after receiving his generous comments on EXACTLY what he wants.  Very tough midterm and final (consisting of identifying songs, somewhat obscure multiple choice questions, characterizing songs you haven't heard before, short regurgitating information questions, and longer formal analysis questions based on readings and discussions), but he adds 10+ points depending on how poorly everyone does.  We were supposed to have pop quizzes throughout the semester but there was only one.  Can get away with skimming readings but you definitely need to take good notes during class and know all the pieces--listen to all the recordings!  He will not give you easy ones to identify on the exams (and you need to be able to name the piece, composer, period, theme it exemplifies, etc.).\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 21, 2008",
            "review_content": "\nTodd was truly a great person; unfortunately the Music Department stuck him with five classes to teach during the semester I took Music Hum with him, so he was a bit disorganized and frazzled.\nIf you take the class seriously, do the readings, and listen to the music before class, you will find the class enjoyable.  Todd brings in lots of fun factoids and stories to give the unit more context.  He has a great sense of humor and loves it when students have an opinion and participate in class--even if what you say is completely idiotic.  Many students in Music Hum are gunning for A's and complain constantly about how hard everything is.  Honestly, if you give an honest effort, Todd will recognize that and reward you accordingly. \nThe midterm will scare the daylights out of you.  It is very, very difficult.  However, it was curved dramatically (almost 20 points) it only gets easier after that.  The final was a joke, and you have two response papers (3-5 pages) to turn in. \nWorkload:\nfair: midterm, final, 2 papers.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 28, 2008",
            "review_content": "\nHe was often harried/rushed/seemed more and more out of it as the semester went on. Maybe something was going on in his personal life, so I don't want to criticize him, but it definitely detracted from the class experience. He's definitely very passionate about the subject and a talented musician, and I enjoyed the class overall.\nAssignments were appropriate, but the grading on the midterm was very harsh - the questions asked were overly difficult and obscure.\nThe music on the syllabus was great, and Tarantino was great at improvising on the piano to illustrate various concepts. I like that he made a class blog, but he soon stopped posting questions on it rather early in the semester.\nI definitely recommend taking Music Hum with him, but don't expect him to be organized.\nWorkload:\nmidterm, final, and two short (3-5 pg) papers.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 09, 2006",
            "review_content": "\nThe person who wrote the last review is obviously a little bitter and musically challenge. When I entered Todd's class, my only musical experience was my cd collection and did wonderfully. All you need to do well in this class is the ability to listen, both to Todd's instruction and the music. He explains well and even asked the TA to help explain things more simply when students didn't understand, so we often go additional information that way. Homework assignments are not graded but show your progress and effot, which he really takes into consideration for your grade. The papers are relatively easy if you put forth some effort and Todd is liberal with grading. He offers good criticism as well. The information is covered well. Exams were curved and reasonable if you tried at all and included music IDs, terms analysis, and music analysis.  I enjoyed music hum more than I thought I would and Todd was a nice guy. It's tough being all the way on the 7th floor.\nWorkload:\nThere is a midterm and final, as well as 3 pg concert report, an 8-10 pg music analysis paper, and 10 listening exercises to show your progress.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 09, 2006",
            "review_content": "\nThe person who wrote the last review is obviously a little bitter and musically challenge. When I entered Todd's class, my only musical experience was my cd collection and did wonderfully. All you need to do well in this class is the ability to listen, both to Todd's instruction and the music. He explains well and even asked the TA to help explain things more simply when students didn't understand, so we often go additional information that way. Homework assignments are not graded but show your progress and effot, which he really takes into consideration for your grade. The papers are relatively easy if you put forth some effort and Todd is liberal with grading. He offers good criticism as well. The information is covered well. Exams were curved and reasonable if you tried at all and included music IDs, terms analysis, and music analysis.  I enjoyed music hum more than I thought I would and Todd was a nice guy. It's tough being all the way on the 7th floor.\nWorkload:\nThere is a midterm and final, as well as 3 pg concert report, an 8-10 pg music analysis paper, and 10 listening exercises to show your progress.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 17, 2005",
            "review_content": "\nTodd's clearly passionate about his stuff, he's intelligent and thinking, and obviously cares to convey something of his own enthusiasm for the subject. Problem: while my class happened to include a few students with good knowledge of music, those of us who didn't felt like we were trailing far behind. Todd is definitely there for you, always approachable, and ready to help. Still, the tests are extremely difficult, and include unknown listening exercises that ask you who the probable composer is, etc. . He gives a lot of credit for class participation and effort, so that's good. He also curves the midterm. He offers extra credit in the form of attending a concert and submitting a one page review. . .All in all Todd is a great introduction to the history of western music, although at times it does feel like he is trying to have students absorb more than is reasonable. \nWorkload:\n1 midterm, 1 final, 2-3 pg concert report, 8-10 pg music analysis report, 10 listening exercises--just need to be turned in, not graded. . .\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 12, 2005",
            "review_content": "\nAfter the first class and viewing the syllabus, I entered this class with much trepidation and zero music experience.  As it turns out, though, my worrying was unnecessary.  Todd doesn't expect you to be a music genius, and he does a great job of explaining things and offering his own theories without having the pretention of other professors in thinking that his way is the only way. The workload seems crazy, but don't be intimidated by it b/c it's actually not that bad.  The listening exercises aren't for a grade, and they're actually a good way to learn.  He's a fairly easy grader on the papers if you can prove that you applied stuff you learned from class and also your own thoughts--even if he doesn't agree with them. I would definitely recommend this class if you're looking to learn and have a decent time. 9am is pretty early, but I managed to stay awake the whole semester, which is quite a feat for me. \nWorkload:\nListening exercises (10 for semester), midterm, final, opera report, concert report (4-5pg), final paper (8-10 pg, and you get to choose any piece of music/song that you want from any time)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 13, 2004",
            "review_content": "\nThis was a great class.  Although I had no background in music, Todd explained the material very well.  The class was heavily discussion-based, which made things much more interesting than if he had just been lecturing.  He also touched on more advanced material, instead of keeping the class to basic definitions.  Contrary to what some other reviews here say, he did make it clear what we were studying--he gave handouts of IDs and things to know for the exam, which made studying much easier.  And while there were a few theoretical questions on the midterm and the exam,  they were nowhere near impossible. \nWorkload:\nA lot of listening, a paper, and a final project, which can be another paper or an original piece of music (!).  Midterm and final are a mix of IDs and essay questions, some of which are pretty deep.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 08, 2004",
            "review_content": "\nHe's great.  9 AM Mondays 7th floor of Hamilton is a KILLER, but Todd was cheeful and full of bad jokes even at that hour.  He knows his stuff, and he wants everyone to love music.  His lectures are organized, and he always has lots to listen to.  A few problems: the midterm was so hard he added 15 points to everyone's score just to get most of us to pass.  So I guess his expectations aren't really clear...  He also had us read really hard and obsure post-modernist critiques of pieces and then expected us to glean little tiny details out of them for quizzes.  It was hard.  But he tries really hard, and he's super nice, so all around, a good Music Hum teacher, especially for a grad student.\nWorkload:\nVery little reading, (great website helps), short (2-3 page) concert review, 7-10 page research paper, midterm, final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 06, 2004",
            "review_content": "\nTodd for the most part is a nice guy. He tried to be funny and make the material somewhat interesting with random information and history on the music and artist being discussed. However the major problems with this class come in two forms. One Todd beign the typical artist don't like to put limitations or boundardies on anything, in other words, he doesn't have a straight answer for anything and likes to make his students figure it out for themselves. This means you're on you own for figuring out what to study for the midterm and final, you'll have no idea what the format is and you'll also be clueless as to what the hell the structure is supposed to be for your papers. The second problem with this class is because of the fact that is is rather technical. If you don't have any background in music, you'll have quite a bit of studying to do in order to get a good grade. Luckily, most people fail the midterm and final so the professor had to use a curve.\nWorkload:\nMuch reading, much listening, a concert report and a cultural music paper 10 pages\n"
        }
    ]
}