{
    "prof_info": [
        {
            "prof_name": "Suhail Shadoud",
            "prof_id": 2162,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Arabic I",
            "review_date": "October 18, 2005",
            "review_content": "\nIf you think that a language class should be comfortable learning environment, I would highly encourage people to stay away from this professor.  Although he clearly understands how to teach Arabic, his classroom demeaner is counter-productive.  He belittles students for their mistakes and seems to expect everyone to immediately grasp all of the concepts (occasionally even ones he hasn't taught yet).  By the end of the semester, I was terrified of having to speak in class.  I have taken four other languages at Columbia, and this class was by far the worst.  That said, Suhail can be very amusing, so if you're thick-skinned you might enjoy his antics.\nWorkload:\nIt's Arabic...obviously a lot.\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "January 01, 2005",
            "review_content": "\nSuhail is... well, he reminds me, frankly, of a child.  Certain days of the week, he is pleasant and personable, and others, he will be dark and raging, as if some kind of dark cloud had descended over him.  He can be hilarious and friendly, and suddenly be very cautious and slightly cruel.  An extremely odd character, and one against whom you simply must steel yourself and decide that you are dedicated to learning the language, despite the kind of day the professor has chosen to have. Maybe he'd be more pleasant in the afternoons, after he's had time for caffeine and a bagel? Hard to tell.\nWorkload:\nLots of homework. Tests. A final. Nothing more than I'd expect from an intro language, considering the others I've taken.\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "November 08, 2004",
            "review_content": "\nSuhail is a nutcase.  He's hilarious, sometimes scary, sweet, kind of sketchy--overall hilarious.  As a teacher he's alright.  He cares about his students and he's very personable--really wants to be friends with his students.  I dont think I'd have learned as much as I did had it not been for an amazing TA, but Suhail's not bad\nWorkload:\nBe ready to work--lots of busy work--but the kind that's necessary for an intro language course.  Homework every night.  Regular quizzes.  Exams.  \n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "September 07, 2004",
            "review_content": "\ni had suhail all year for first-year arabic. i had no prior exposure to the language, which can present major difficulties for a native english speaker. he was very understanding of this, as i'm sure he's seen more than his fair share of americans struggling through arabic. \nhe tried to adapt teaching methods to target everyone's weaknesses and make sure everyone was as close to the same level as possible, but he wasn't always successful. the workload is very intense and the class is very fast-paced so it's mostly up to you to make sure you're learning everything you should be, especially because he doesn't like to meet very often during office hours.\nthat said, he's very well-qualified, having taught arabic in his native syria and then at georgetown and the u.s. state department. \nWorkload:\nbe prepared to put 3 hours into arabic. daily. and don't expect to be anywhere near fluent after one year. but be patient and express an interest in arab language and culture and you should be ok.\n"
        }
    ]
}