{
    "prof_info": [
        {
            "prof_name": "Paul Piveteau",
            "prof_id": 12791,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Econometrics",
            "review_date": "January 06, 2014",
            "review_content": "\nX PRIME X INVERSE X PRIME Y\nAfter this class you will be reverently whispering this. In your sleep. Forever. You will rudely snap at wee passerby econ majors making snide remarks about econometrics. Never speak ill of econometrics. Perhaps only our fellow brethren of 4412 will understand the stunning beauty of GMM and time series.\nGreat class, probably the best economics class you'll take at Columbia. Serena starts at the basics of econometrics and derives most things out of the building blocks. Her class is definitely worth taking notes for, as her lectures beat both textbooks for the class. It is clearly more mathematical than intro, and I'd say a background in probability and statistics (i.e., not 1211) should be a pre requisite. One attraction is the close association of the material we learn in class to academic economic history and current research. We get to know, but are not required to learn, about econometricians and econometrica. In short, she gives Susan Elmes a run for her money.\nThe problem sets require MATLAB. So you'll learn MATLAB. Paul's problem sets help us practice what we learned in class. The experience of running basic simulations by itself is invaluable. Spend time on them. Savor them.\nA few things though. I hope Serena would consider posting her notes online. Her class lectures are clear, though there are a few organization issues when they go on the blackboard. Being econometrics from a linear algebra standpoint, no one can remember all the primes and inverses. Her rationale for not including them is that we are then encouraged to read the books. Greene is not stunning, and Stock and Watson are slightly better. The curve was also slightly harsh.\nWorkload:\nProblem sets can take a long time, but you never feel that time is wasted, as you are simultaneously practicing both MATLAB and reviewing class material. The tests are pretty hard. Make sure you study for those.\n"
        },
        {
            "course_name": "Advanced Econometrics",
            "review_date": "December 30, 2013",
            "review_content": "\ntl;dr version: If you're interested in serious economics, like statistics and don't have an allergy to linear algebra- you owe it to yourself to at least try this course. It may be one of the best you take at Columbia, and if it isn't for you, you'll know from the start. Prof. Serena Ng is also one of the most perfect professors I've had the privilege to learn from.\nOne of the best classes I've ever had at Columbia, due primarily to Prof. Ng's amazing teaching. And that's no trivial or predictable statement for a class titled \"Advanced Econometrics\".\nIf you liked Econometrics or Statistics (and even mores if you also like Linear Algebra), and are willing to put in some effort, this is the class for you. You'll know off the bat whether this is a class you want to take: the first few lectures are a very good sample of the rest of the course, and she'll give a tough tone to make clear to everyone that this is not a light course. However, once the drop date passes (and even before), she'll show more of her friendly, approachable side, and this is what really matters. If you ever go to office hours you'll find a friendly listener; after warning people in class that those who weren't serious shouldn't stay, I became a bit worried and asked her personally if I should stay during office hours. To my surprise, she actively encouraged me to stick with the class. \nI can't quite explain just why this class works so well. Every class involves nothing more or less than Prof. Ng writing more or less continuously on the blackboard, with explanations where required, and answering questions when asked. However, as someone who liked Econometrics as a subject (but not as a class) in Intro to Econometrics, and as someone with middling math/stats skills, I simply fell in love with the class.\nThe material is presented in an incredibly clear and precise way. There is zero \"hand-waving\" in this class; Ng will derive every formula, explain the intuition and give you the context. By the end of the class you'll find you can derive many of these formulae yourself. Whatever you don't understand you can ask Ng or the TA. Again, even though the class is \"Advanced Econometrics\", I actually enjoyed the lectures immensely and never once felt I was nodding off despite this being my fourth straight class from 8:40. \nThe tests are the absolute fairest I have ever encountered at Columbia, simply put. There are no \"gotcha\" questions; you will be tested on the things studied in class, and you'll have a good idea what the test will look like from the practice exams (and a bit from the problem sets). Your grade will be directly proportional to the amount you know and how hard you studied. The tests were so appropriate I actually enjoyed them a bit. The fact that there are three midterms, no final and none of the tests are cumulative helps a lot (one less final during final week).\nIt seems this semester we had fewer grad students and no Fed people, because the curve was not as unforgiving as others have mentioned. Alternatively, perhaps Ng has changed. Still, she said this was the best class she's ever had (grade-wise), and still I managed to get an A- with 3 and 10 points above the mean on the first two midterms (never got my grade for the third). \nThere was weekly homework but there isn't much point in commenting because the TA changes each time. \nA word, however, on Paul: he's fantastic, one of the best TAs I've ever had. He seems a little too timid at first, but don't let that fool you: he cares about the students, is incredibly helpful, and is brilliant. He would often have 4-5 hours a week of office hours and recitations before tests, including the day before the exam, in addition to email help which he was often open to. His office hours often consisted of him sitting down for two straight hours, answering difficult questions continuously until everyone understood everything that was unclear (he often stayed beyond the two hours). His problem sets were long and somewhat hard, but they were excellent at drilling in the material and he was always open to questions. Every single time, he had the problem sets graded the day after they were due. And through it all he was friendly and considerate. This is a top-notch TA, take advantage of that if you are lucky enough to be in a class in which he's the TA. \nOne last note: you'll need a minimal knowledge of Matlab to do this course, but nothing more than basic commands. If you do't know Matlab, just take some time during the beginning of the semester to get moderately comfortable with it, and you should be fine. \nWorkload:\nWeekly problem sets (mostly Matlab based with a sprinkling of theoretical questions), three midterms, no final. Fairest exams you could ask for, though by no means easy. \nGrading: 30% 1st midterm, 25% 2nd midterm, 20% 3rd midterm and 25% problem sets. \n"
        }
    ]
}