{
    "prof_info": [
        {
            "prof_name": "Marco  Scarsini",
            "prof_id": 11147,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Probability",
            "review_date": "May 15, 2011",
            "review_content": "\nFor those of you who are unaware, Probability 4105 is going to be a difficult class, regardless of whatever professor you have. \nOf all the professors in the stat department, Scarsini, in my opinion, is one of the most qualified and nicest teachers. His quite competent in his teaching ability and his lectures are straightforward and slow paced. During his lectures, he does a good job of balancing: introducing new concepts, proving those concepts, and doing practice problems for application. \nHe will always answer any questions people have in class before moving on to new material, and takes the initiative in making sure his students are understanding the material being taught. During his office hours he will do any problem you want him to, review concepts that you don't understand well, and even provide helpful hints on how to do problem sets.\nIf this is your first class in probability, I recommend you to NOT missing a single class. After week two, is when you start getting into \"real\" probability and attending class becomes highly important. His lecture notes were the only things I used to do the problem sets and study for the exams, with a few occasions of looking up a few things in the book. The book for the class is not that helpful and does a poor job of explaining the harder concepts. \n\nWorkload:\nHomework: 30% (book is on cramster, problems are of moderate difficulty but the theory problems can be very tricky)\nMidterm: 20% (6 questions, relatively easier than the final, questions are usually easier than questions on the homework)\nFinal: 50% (6 questions, harder than the midterm but you are given 2 hours instead of 75 minutes, questions are about the same difficulty on the homework and focused mainly on the 2nd half of the class)\nOn his exams there will always be a couple questions on problems that he goes over in lecture, so be sure to review problems done in class before the exams. You are allowed to use 2 sheets of paper (front and back) for a cheat sheet for both exams. \n"
        }
    ]
}