{
    "prof_info": [
        {
            "prof_name": "Kevin Ochsner",
            "prof_id": 2485,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "April 11, 2016",
            "review_content": "\nThe class was interesting and engaging. Professor Ochsner knows how to keep his student’s attention.  The topics covered in class (at least to me) are relevant and thoroughly explained.  There is not a ton of work that needs to be done for the class other than the group project and studying for the exams.  The group project is generally pretty easy, you design and experiment and run it on the class.  You are then graded on an individual 7-10 page paper written about it and a group oral presentation.  Warning though: you will have to study a lot for his tests to do well.  He tests you on aspects of individual experiments (although he does go through them very thoroughly in lecture), as well as giving you an unknown experiment and asking you to fix its issues, has you design your own experiment with some parameters.  The test is hard, but the experiment design question is extra credit and should boost your grade.   The tests and papers are graded by TA’s so expect to see some very nit-picky critiques but just do what they say and you’ll be fine in the end.  ALSO LISTEN TO THIS!!! If you take his class you have to go to lecture to understand what is happening. His slides are basically gibberish if you don’t hear what he has to say about them. It is worth it though because it’s only one day a week and a good class!\n\nWorkload:\ngroup experiment, 7-10 page paper, midterm, final, weekly readings\n"
        },
        {
            "course_name": "Experimental Psychology: Perception and Attention",
            "review_date": "April 17, 2015",
            "review_content": "\nOk lets get one thing clear, Ochsner is amazing at what he does and has accomplished many things. So, there are two people. One is the type of person that success does not affect them in any way shape or form. The other type is the one that inflates their ego. Unfortunately he tends to side with the second type of person. HOWEVER, this is Columbia University and the man knows his things! You're in an Ivy not in high school where \"everyone is important and must feel warm embraces every time they open their mouths.\" Yes he is a bit egotistical but he never made any students in the class I was in feel badly about themselves. With that said, if you are the typical young student who thinks they're the best thing since sliced bread and you raise your hand to not ask a question but to simply try to impress him like many young CC students do (I'm GS), then he will very quickly make sure his class isn’t interrupted by someone who is a showoff. This is amazing! It keeps the class going smoothly. He loves it when the class participates and will ask many questions throughout class. He expects students to participate. You will learn a lot. Please take into consideration the workload. He assigns many published articles of which he wrote many. You don’t have to read them all as they are impossible and even the TA's will tell you that but those that he or the TA's say to read, you must read. They will be covered in some detail in exams. You should however take his class if this is what you want to do as a career. Having his name and knowing him will help out. \nWorkload:\nIt is pretty heavy. You have to read a lot and work in a group to create and implement research. Not an easy grader and not an easy A class.\n"
        },
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "October 13, 2012",
            "review_content": "\nDude is a dick. I went to his office hours and he totally belittled me. People were coming in and out of his office and he commented, \"This is where the magic happens. I'm pretty much CEO here.\" Ugh. \nThe problem with research profs is they think they own their topic and all the people who work under it and supposedly want to learn about it. It's not so much the corporation model. It's more like indentured servitude. Ochsner's attitude is totally on part. \nWorkload:\nSimilar to a fortune 500 company. \n"
        },
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "October 16, 2009",
            "review_content": "\nI agree -- his lectures were, at first, interesting and engaging. But soon enough you start realizing that you're not really learning anything other than how to write a ridiculous document that isn't even used in the scientific world (the ever-present QuALMRI Dr. Ochsner and his students are so fond of). The TAs were the least helpful TAs I've ever had (my TA was Jamil, but I've heard similar feedback about other TAs as well). All around, a really disappointing experience. I would recommend taking this course with another instructor. \n"
        },
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "July 01, 2009",
            "review_content": "\nI completely agree with the May 18th person. Professor O seems like a really cool guy (and his wife had just had a baby, so that could explain his mood swings to transference...) but the class was pretty redundant and not very helpful. I was really looking forward to my project, but you end up being limited by your group and the post bacs have a tendency to try to take over everything with the group experiment, which you have to curb because you are also graded on team work.\nJamil is a great TA, and he really wants you to succeed and improve, but the class seems as though it is structured to screw you. The first midterm was literally the day we got back from Spring Break, which is lousy because that means you either blow it off and enjoy what is a very important, well deserved week to take a breather from Columbia, or you blow off your break to study for the midterm. The final exam schedule was even worse. They did not even give us reading week to study; our final exam was the last day of classes, which is really a detriment to everyone. We all have other classes that are wrapping up, as well as final papers and exams to study for, so having that final before the requisite week to study for it is a very rude slap in the face. Even more so because your final paper is due two days after that, and extensions are essentially out of the question.\nI agree, Oschner is a cool dude, but I would have preferred to take a seminar from him in his area of study, than an experimental psychology class. The lecture course veers away from discussions of statistics and their relevance to experiments whenever possible, which makes taking Stats for the major seem irrelevant to the discipline. I've heard that Lindemann's lab is way worse, so perhaps this class is a favorable option. At least Oschner has a quirky humor.\nWorkload:\nChallenging midterm, final exam, five written assignments (QuALMRIs) in Lab, group experiment, final (individual) project paper\n"
        },
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "May 18, 2009",
            "review_content": "\nThis course was AWFUL! Don't take it if you can help it. The lectures were random and unnecessary. Though Ochsner seems like a very cool guy, who is good at what he does...his lectures left me wondering \"why the hell do I like social psychology?\" The lab section was even worse. Perhaps, this was just the TA I had but in general I didn't hear any of my friends in other lab sections calling out the praises of the class. There is little to no communication of everything that is going on. Assignments are sent out VERY late and close to deadlines so unless you are pro-active you end up scrambling at the last second to get the work done. Basically this course was terrible, I hated every minute of it and am just glad its over. Some people breezed through this class and others struggled. The biggest predictor of how well you did was how well you could speak the professor and TAs language not how well you understood the material. \nWorkload:\nTons of reading, and attendance at lecture is mandatory if you want to understand his slides...however if you do ALL the reading I think you should be fine with skipping lectures. midterm and final were graded really toughly and didn't accurately reflect what you had or hadn't learned. A bunch of lab write-ups that are put in a STUPID format that leaves more people confused than is really helpful and causes most of the mistakes that end in failed grades. \n"
        },
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "January 01, 2007",
            "review_content": "\nProf. Ochsner is an interesting and entertaining lecturer, but overall I wouldn't recommend this class if you have a better choice.  the problem is with the class structure, the labs are boring and dull and tedious, the grading of the QUALMRIs (lab writeups) by the TA's was harsh, you have to learn psyscope and do some computer programming, not fun, and there is just a lot of stuff that could be on the midterm or final...much of it that was never discussed in class.  In all fairness it is an ok class, but I wouldn't sign up for it again knowing what I know now.  \nWorkload:\na lot of reading, a lot of work.  Have fun learning computer programming and by the time you are done w/ your experiment your lab partners will either be your best friends or you will never want to see them again. I felt like I did a LOT of work and I got a B.\n"
        },
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "June 20, 2006",
            "review_content": "\nI agree with the most current review of this class.  Kevin is a great lecturer and sitting theough his lectures was very interesting.  However, the rest of the course was a mess!\nThe TA's were responsible for a lab group that met once a week.  The homework assignments given out by the TA's - when they remembered to give them out - were really confusing.  When the TA's forgot to give out a homework assignment a \"clarification\" email would be sent to students, sometimes one day before the homework was due. \nKevin ran a review for the midterm about a week before the test, but on the morning of the midterm the TA's sent out an email telling the students that the midterm would not actually be on the material reviewed, but on a whole list of other things.  To add insult to injury, grading was extremely harsh. \nThis class would be pretty good if the Professor could find some TA's who didn't walk around with their heads up their asses.  \nWorkload:\nAverage reading, more than average writing, difficult exams.  \n"
        },
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "May 24, 2006",
            "review_content": "\nThe other reviews are very accurate that Kevin is a very good lecturer.  Its not difficult to stay awake during the two hour lecture.  However, the TA's are responsible for practically 100% of the grading.  Ochsner basically shows up to talk for two hours and the TA's are responsible for every other part of the course.  As one reviewer said, the requirements are fairly muddy and poorly executed.  It wasn't uncommon for my lab group to be unaware of what was due.      Instructions for projects are often VERY difficult to decipher, two pages of instructions are often used for something that could have been explained in a sentence or two.  The lack of professor involvement was a problem with the midterm.  Ochsner spent two hours of class time presenting different experiments, asking us to find the problems within them, in preparation for the midterm.  The class was under the impression, the midterm would be on applied principles, but 6 pm the evening before the test, a study guide was sent out by one of the TA's outlining a whole new set of information that was necessary to pass, some of it that was never mentioned in any lecture.  In total, the grading was lenient, but it was difficult to know what to expect and when to expect it.  Plus I have a personal issue with graduate students being responsible for such a large amount of the class in a four credit course.\nWorkload:\nNumerous lab write-ups, designing an experiment, oral presentation of results, midterm, and final.  All of it is totally doable, but very ambiguous.\n"
        },
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "April 24, 2005",
            "review_content": "\nOchsner is an awesome professor.  This class is probably the most painless way to get through the lab req of the psych major.  There isn't so much an emphasis on Social Cognition and Emotion theory, but this is methods class meant to teach you how to design and conduct research.    \nWorkload:\n2 midterms, weekly lab section, group design experiment (design, program, and run an experiment), oral group presentation on said experiment.  Grading is pretty fair and lenient.\n"
        },
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "April 22, 2005",
            "review_content": "\nIt's true, Prof. Ochsner is a good guy. He's got a good sense of humor, he's approachable, and tries to make his lectures as engaging as possible. However, despite the seemingly intriguing title of this class, the material is pretty damn dry. The labs were often monotonous to the point of painful. Ochsner does his best to make it interesting and he succeeds to some extent, and for that I give him a lot of credit. But unless you are fulfilling some kind of major requirement, don't take this class, but maybe try one of Ochsner's more advanced cognitive neuro classes.\nWorkload:\n2 Midterms and a Final. Midterms were surprisingly difficult considering the straightforward nature of the material. A decent amount of little assignments in lab and a final group presentation, but nothing is too straining.\n"
        },
        {
            "course_name": "Experimental Psych: Social Cognition and Emotion",
            "review_date": "April 11, 2005",
            "review_content": "\nA really cool guy. Kevin is both a fun guy, a funny lecturer, and part of the first wave of a bunch of young hot-shot psychology/neurobiology faculty that Columbia's hiring. If you want to take a class from someone at the forefront of his field (hot off the plane from Stanford) who's also going to joke around and really treat the class like a conversation, it's Kevin. He does get sidetracked into random anecdotes, and the fact that his lectures in this class have to be mostly How To rather than pure substance makes them kind of hard to follow sometimes (because he mixes the two so much you're never really sure whether you need to know something or whether he's just going off on an example of a larger point. Get to know this guy and his TAs, work in their labs. This is where mind and brain collide. I'm sure his more advanced classes are even better.\nWorkload:\nResponsible for a decent amount of the textbook assignments (a couple chapters a week) on some of the tests. 2 midterms and a final exam. Several practice lab-write ups and an experiment group project. Fairly muddy requirements (depends on how time goes, etc.). Fair grading.\n"
        }
    ]
}