{
    "prof_info": [
        {
            "prof_name": "David Shatz",
            "prof_id": 611,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Spanish II",
            "review_date": "May 16, 2005",
            "review_content": "\nThis class was relatively dissapointing. It's difficult to pintpint what was missing... I believe it was just a very average course and I was expecting a great course. We sat and Professor Shatz lectured to us about the readings. I found him difficult to understand...\nWorkload:\n1 5-10 page take home midterm, 1 2-10 page take home final.\n"
        },
        {
            "course_name": "THE THOUGHT OF MAIMONIDES",
            "review_date": "January 19, 2005",
            "review_content": "\nI really enjoyed the class.  Dr. Shatz makes the material interesting.  He's funny and is very responsive to questions.  Our class was small- about 15 - and was very interactive.  I gained a greater appreciation of the philosophy of Maimonides.  I have a strong Jewish background (yeshiva), and I think knowledge of Hebrew and Jewish concepts can help one get the most out of the class.  \nWorkload:\nReadings for every class which are helpful if you want to understand and participate, though not essential.  One final paper and a final exam.  This sounds great, however, you have no idea how you are doing until you get your grade in the class- and he doesn't give everyone A's.  \n"
        },
        {
            "course_name": "Jewish Ethics",
            "review_date": "January 19, 2003",
            "review_content": "\nI was the ONLY person in the class that wasn't Jewish but hey, it's Columbia, you have 30% of the Columbia students as a resource! Having such little background made the workload particularly heavy (rav who?), but it was entirely possible and worth it. I can say that I never felt like an outsider (but I did have to look to my neighbor for an occassional translation from his Hebrew and/or horrible handwriting). TAKE NOTES. Almost everything from the exams was straight from notebook to bluebook. Though Shatz lectures, the class is entirely what the students in that room make it, which made it such a unique experience for me. All and all, Shatz is very intellegent, interactive, and respectable. It is an intensive class (again, shiksa speaking) but worth your time and Columbia tuition. \nWorkload:\nHEAVY reading but in short articles that can be skipped around.\nCouple papers: must be thorough but non-yeshiva-ish language is stressed\n"
        },
        {
            "course_name": "V3338 Jewish Ethics",
            "review_date": "December 25, 2002",
            "review_content": "\nDr. Shatz is an intelligent and charismatic lecturer. This was a great class and I learned alot, but I must say that getting any version of an A is extremely difficult without any previous background on the material. Those who have studied at Yeshiva or JTS before hand certainly have an advantage. \nWorkload:\nOne 5-7 page paper, a midterm &  a final \n"
        },
        {
            "course_name": "V3338 Jewish Ethics",
            "review_date": "December 23, 2001",
            "review_content": "\nGreat professor and a great class!!!! I definitly recommend the class although I do agree with one of the above reviews that it is easier if you went to a yeshiva for high school. There isn't any Hebrew involved and you dont have to ever have looked at a page of Talmud but it probably helped. He was a great professor, very organized, very interesting and very funny. He really loved the material and made the class love it too.\nWorkload:\nNot bad- the majority of the class got 'A's on the midterm, and then there was one 7 page paper and a final that I just took, but it seemed pretty easy. He gave out review sheets before the tests and the questions came straight from there.\n"
        },
        {
            "course_name": "V3338 Jewish Ethics",
            "review_date": "December 16, 2001",
            "review_content": "\nHe's nice, funny, approachable. The class is very easy but it kind of goes downhill after the midterm.\nWorkload:\nSome readings which you don't need to do, a midterm (easy), paper and final\n"
        },
        {
            "course_name": "V3338 Jewish Ethics",
            "review_date": "November 14, 2001",
            "review_content": "\nDr. Shatz is a really good teacher, especially for a topic as sensitive as Morality and Religion b/c he really listens to students' questions about Judaism and doesn't just knock any controversial question down. He is a true intellectual- in pursuit of Truth.... On a lighter note, he's just really funny!!!!! I dont think Ive ever laughed so much in any class in my life. Overall, i learnt ALOT.\nWorkload:\nFair.\n"
        },
        {
            "course_name": "V3338 Jewish Ethics",
            "review_date": "November 08, 2001",
            "review_content": "\nThough I do like Prof. Shatz in principle (yes, class is somewhat enjoyable), unless you grew up in a Yeshiva, don't expect to get an A. It seems to me that most of the people in the class are JTS students looking for an easy class. People with no background in (Jewish) ethics will have a very hard time, even though there is no prerequisite to the class. Ultimately, I think the class fails to actually teach anyone anything.\nWorkload:\nMidterm, term paper, and final.\n"
        },
        {
            "course_name": "V3338 Jewish Ethics; V3804s49 The Thought of Maimonides",
            "review_date": "November 04, 2001",
            "review_content": "\nBy far, he is the best professor I've had at Columbia. Funny, fascinating, and modest, Dr. Shatz is a professor who clearly cares for his students. workload=average. do the light readings, and you'll be fine.\n"
        },
        {
            "course_name": "V3338 Jewish Ethics; V3804s49 The Thought of Maimonides",
            "review_date": "November 04, 2001",
            "review_content": "\nBy far, he is the best professor I've had at Columbia. Funny, fascinating, and modest, Dr. Shatz is a professor who clearly cares for his students. workload=average. do the light readings, and you'll be fine.\n"
        },
        {
            "course_name": "V3338 Jewish Ethics",
            "review_date": "April 21, 2001",
            "review_content": "\nI love prof shatz and I loved his jewish ethics course. He is really smart, very lively, interesting readings and he has good insight into them. I think everyone in the class was jewish but he does everything in english although I think it made the class much easier for me b/c I'm familiar w/ bible, talmud, and medieval commentaries. There is a midterm, a final, and one paper. All are graded very fairly, not a very hard class.\nWorkload:\nmidterm, final, one paper- all graded by TA, not graded harshly\n"
        }
    ]
}