{
    "prof_info": [
        {
            "prof_name": "Karen Lewis",
            "prof_id": 11981,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Logic",
            "review_date": "July 25, 2015",
            "review_content": "\nIf you can't afford a tutor, don't take Intro to Logic with Karen Lewis. Just don't. \n\nWorkload:\n3 Midterms- 85%, Homework-15%.  \n"
        },
        {
            "course_name": "Introduction to Logic",
            "review_date": "May 13, 2015",
            "review_content": "\nRead some mixed reviews of Prof. Lewis for her Intro to Philosophy course. Decided to take Intro to Logic with her. Huge mistake. This must have been her first time teaching Intro to Logic and it showed. She wasn't confident in the material at all. There were times when she froze up trying to answer questions in a way that had the whole class cringing. The material is easy at first so you're able to get through her poorly made and confusing lectures without any consequence but after the first test it gets significantly harder. She plodded through an ocean of confused faces and delivered her powerpoint presentations just the same. Don't take this class with her unless you are naturally gifted at understanding math. My gut feeling is that she won't be teaching it again anyway. \n\nWorkload:\nDecent. Weekly homework sets that start out easy and then get very difficult. 1-4 hours a week. \n"
        },
        {
            "course_name": "Introduction to Logic",
            "review_date": "May 03, 2015",
            "review_content": "\nNot a fan of Prof. Lewis.  She seems very uncomfortable teaching and usually resorts to reading word for word from her PowerPoint slides.  I have never seen so many confused faces in a class or so many people come to office hours before an exam.  She's an unforgiving grader and does not curve. (She did, however, provide a make up exam for the many who scored poorly on the midterm so they could bring their grades up to an 80-- which kind of says something about her teaching ability, IMHO).\nThere are plenty of sharp people who easily pick up this kind of QR material, but if you don't have a mind for it, take this class with another professor (or take another QR course if you're trying to fulfill the requirement). \nWorkload:\nWeekly homework sets, 2 Midterms, Final. Homework only counts for 15%, so make sure you know your stuff for the exams. \n"
        },
        {
            "course_name": "Introduction to Logic",
            "review_date": "May 03, 2015",
            "review_content": "\nNot a fan of Prof. Lewis.  She seems very uncomfortable teaching and usually resorts to reading word for word from her PowerPoint slides.  I have never seen so many confused faces in a class or so many people come to office hours before an exam.  She's an unforgiving grader and does not curve. (She did, however, provide a make up exam for the many who scored poorly on the midterm so they could bring their grades up to an 80-- which kind of says something about her teaching ability, IMHO).\nThere are plenty of sharp people who easily pick up this kind of QR material, but if you don't have a mind for it, take this class with another professor (or take another QR course if you're trying to fulfill the requirement). \nWorkload:\nWeekly homework sets, 2 Midterms, Final. Homework only counts for 15%, so make sure you know your stuff for the exams. \n"
        },
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "July 26, 2014",
            "review_content": "\nI personally loved this class. Professor Lewis is very approachable and is a great lecturer; some of the readings, albeit light, could be a bit difficult to understand (e.g. Aristotelian virtue ethics, Kant) and Professor Lewis explained them very well in class. She gave a lot of guidance and was a pretty fair grader. She has a very objective points-system, so the grading wasn't arbitrary at all. This is a great class for people who might be interested in philosophy and are willing to take it seriously. You get as much out of it as you put in -- I spent a lot of time on the readings and put a lot of effort into the essays/projects, and went to almost all the office hours of both the professor and her TAs, and did very very well in the class. Students who slept through lecture/went on Facebook (and there were a number of those) did not enjoy the class as much -- which is a shame, because it's really a great class/a great introduction to philosophy. \nWorkload:\n The work was completely manageable and the polls were totally fair if you just read the readings beforehand. The readings aren't really skimmable, but that's true of philosophy reading in general.\n"
        },
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "April 18, 2014",
            "review_content": "\nI enjoyed the class. It was pretty easy, and the topics were interesting. She's a nice professor but it was hard for me to stay awake during lectures sometimes. The polling system didn't bother me and the papers were fairly easy to write as long as you had done the reading and looked at her slides. The group project was kind of annoying though. I'd recommend the class if looking for an easy way to fulfill the EAV requirement at Barnard. It did spark an interest in philosophy for me.\nWorkload:\npretty light: 3 papers, group project, poll participation-no tests\n"
        },
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "January 09, 2014",
            "review_content": "\nCourse covered a lot of material like the last post says but was rushed. It would have been better to focus on one reading a class instead of two or three. The papers are manageable and you do not need to go to class or take notes to do well on them. They focus mainly on your opinion and an analysis of the reading. Some of the TAs were very picky graders. For example, my one paper he wrote that the organization did not work well and I received a B-; then on the next, which he also graded he wrote \"you did a good job\" and I received a B... That does not really make sense if he thought one was terrible and the other good. \nThe teaching was annoying. Prof. Lewis is nice enough but it wasn't particularly interesting and I had a hard time paying attention. I personally hated her voice, she constantly stresses almost every other syllable (you'll see what I mean if you have her). \nThe polling system was really frustrating too because it was finicky and asked very random questions from the reading. Even though I went to every class and mostly read all the readings, I only received half the points. I did end up doing well in the class so that's good but I will not be taking any more philosophy.\nWorkload:\n3 Papers, Polling System Questions/Participation, 1 Project, Optional Weekly Assignments\n"
        },
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "December 02, 2013",
            "review_content": "\nCourse seemed to try to shove too much information and topics into one semester. Professor Lewis never seemed to spend enough time on topics to fully divulge the meaning behind the theories. Class tended to be more of people just spitting out their own opinions than an actual entire lecture. Used a polling system for reading comprehension check each class. Manageable class if you learn three topics very well throughout the semester. Teaching wise, not the best. Let's just say I found myself skipping more classes than usual and still being able to write the papers.\nWorkload:\n3 term papers throughout the semester, 1 group project, optional weekly assignments\n"
        }
    ]
}