{
    "prof_info": [
        {
            "prof_name": "Christina  Iglesias",
            "prof_id": 12773,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "June 19, 2014",
            "review_content": "\nI can honestly say that Christina's UW class was one of the best classes of my freshman year!  (I am in no way an English major.)  Not only is Christina down to earth, but she is also very passionate about teaching.  Her course was more than just writing; it made students delve deep into philosophical problems and question elements of our daily lives.  \nThe readings she assigns are reasonable and interesting, unlike what I hear about other UW professors.  The exercise Christina assigns are also helpful and purposeful.  Moreover, she gives very helpful feedback after each draft of an essay and even gives you an idea of what grade the draft would have received had it been the final draft.  I feel that my writing significantly improved after her course.  Though her class is definitely not an \"easy A,\" it is definitely possible to do very well in the course.  For anyone looking for a UW professor, I would strongly recommend Christina!\nWorkload:\nVery reasonable.  She does not assign long, useless, mind-numbing material.  We had readings due for each class (but most were short and interesting, there were only two assignments that were longer than 20 pages)  Exercises due approximately every other class.  Not a breeze, but definitely lighter than other UW classes!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 29, 2014",
            "review_content": "\nChristina is a goddess. Having taken Frontiers of Science first semester and having hardly had the best instructor, I was more than a little apprehensive about the workload of UWriting. But Christina disarmed my assumptions from the very first class, simultaneously an imposing figure with a you're-going-to-do-your-bloody-work-and-we're-going-to-fix-your-bloody-writing-aren't-we attitude and a colloquial, approachable, friendly individual. \nHer reading selections are always very thought-provoking, and she participates in discussion as if she were a student herself, while somehow, ingeniously keeping track of what she wants to cover. She structures her classes around what she's noticed her students need help with. At the same time she's absolutely concerned with students' well-being and was able to empathize with us, understanding delays and granting leniency when necessary -- she's also able to enliven class discussions between college students at 8:40 in the morning, a herculean feat in its own right.\nOffice hours (at least one is mandatory for Progression 1) are insanely helpful. My first writing conference was probably the most productive 15 minutes of my life, and the rest didn't disappoint after that. Christina's written feedback is always thorough but clear and concise -- and if you follow her suggestions between exercises, formal draft, and final draft, your writing (and your grade) will improve dramatically. She pays a lot of attention to your work, and her end comments are incredibly useful.\nChristina is one of those grad students who want to become a professor because they want to teach, and she's really quite good at it. I highly recommend her if she's still teaching UWriting next year.\nWorkload:\nLike the previous reviewer noted, a fairly typical workload for UWriting. When there wasn't one of four formal drafts or four final drafts due, there was a long reading or two and either a writing exercise (a response to the reading) or a pre-draft exercise (Christina's umbrella term for exploratory writing, outlines, and annotated bibliographies). Grading is very fair, and only final drafts count.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 21, 2013",
            "review_content": "\nChristina is the best! She is energetic, intelligent, down to earth, and happy to help her students grow and succeed. She is a very fair grader and will help anyone improve upon the grade they received on the first draft during office hours or via e-mail. Christina creates lesson plans designed to help her students improve upon whatever she feels is weak in all of the papers or what her students ask for. She basically gets a lot done without being unfair/annoying. If you do your work and show effort, you will do well. \nWorkload:\nTypical UW workload. Long articles due per class for the first three progressions, four drafts and four final papers, 250-500 word responses due almost every class \n"
        }
    ]
}