{
    "prof_info": [
        {
            "prof_name": "Javier Perez-Zapatero",
            "prof_id": 6329,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 11, 2016",
            "review_content": "\nJavier is by far the best professor that I have had at Columbia so far. He genuinely cares about helping students learn the language, and gives very thorough feedback on all assignments. Despite the fact that my class used to meet at Friday's at 4, I thoroughly enjoyed it. If you're going to take Spanish, take it with Javier.\nWorkload:\nStandard for an intermediate language class \n"
        },
        {
            "course_name": "Advanced Language Through Content: Gay Culture in Contemporary Spain",
            "review_date": "September 04, 2013",
            "review_content": "\nI thought that the subject was very interesting, it was my first time learning about gay culture. Javier is such a great professor, he is so friendly, kind, and helpful! He is easy to approach and is willing to help students. I was nervous about this class the first day since it is upper level, but his voice is very calming and he doesn't make his students feel stupid if their Spanish isn't the best. This class made me want to minor in Spanish. You should really take a class with Javier, he is great!! \nWorkload:\nReadings every week (not that long, maybe 10-15 pages), one presentation, 2 projects, and like a journal about each class that you hand in at the end of the semester. Javier takes the time to grade all your work which is super helpful. There are no midterms or finals, which is great if you aren't a good test taker!! \n"
        },
        {
            "course_name": "Advanced Language Through Content: Gay Culture in Contemporary Spain",
            "review_date": "September 23, 2011",
            "review_content": "\nAmazing, amazing professor. Most of our classes were spent watching entertaining and informative videos about our current subject. The subject changed every week, and every week somebody had to hold a short presentation on it and afterwards facilitate a class discussion which was surprisingly easier than it sounds because everybody was willing to participate. Javier is the kindest guy ever and even if your Spanish is shabby like mine he will never make you feel stupid about it but listen with patience and still correct your mistakes when necessary and helping you. He writes relatively long comments on your weekly assignments which I found really helpful in getting better at Spanish. If you have a chance to take a class with this guy, do it now! You won't regret it. \nWorkload:\nWeekly reading (usually 10 pages, sometimes less, only once more) and graded responses to them, the presentation and 2 larger projects, one which was basically like a longer weekly question set about a movie, the other one about comparing different magazines. Both fun and not an extraordinary amount of work. All in all the workload is steady but moderate at most, there's no finals, midterms or quizzes so you'll never have to cram. \n"
        },
        {
            "course_name": "Advanced Language Through Content: Gay Culture in Contemporary Spain",
            "review_date": "May 14, 2011",
            "review_content": "\nThe Good: \n1. SUPER NICE. He is so so so calm and understanding and engaging. He makes he want to speak Spanish without actually forcing you to. He's one of the best teachers I've had at Columbia/Barnard for small classes.\n2. He edits all of your homework which is extremely helpful when you want to improve in Spanish. (It's also a lot of work for him, so take advantage of it!)\n3. You watch youtube videos of crazy Spanish bands. It's hilarious. \n4. Class is organized in a way that makes it feel natural and open. I never had a boring class. It was always interesting.\nThe Bad:\n1. The fact that I only got to spend one semester in this class. Honestly, if you are taking an advanced Spanish through culture class, take this one. \nWorkload:\nNo midterm, no final! Instead you have two projects that aren't that bad at all. They're much better than having exams.\nWeekly responses to questions and readings (appropriate-length)\nOne in-class presentation and facilitation of discussion (may sound scary, it really isn't)\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "May 21, 2010",
            "review_content": "\nOh my gosh, Javier is the kindest professor around. He is super patient, friendly, and the class never had that uptight, intimidating feeling of many language classes. Ideally, you speak Spanish the whole time, but Javier's not above explaining something in English if it's necessary. My speaking skills improved much more in this single semester class than in my three years of high school Spanish. Javier uses great PowerPoints (which he also posts online), language and speaking exercises, and his approach seemed to provide the basis for a really natural acquisition of the language. The class is light on written repetition, so unless you take the outside initiative it might be difficult to build up vocabulary and grammatical rules. Take this class!!\nWorkload:\nThree workbooks, two compositions and a few projects/presentations with corrections. It's not a breeze, but it's never overwhelming. Javier's not particularly organized about due dates or returning work, which can be confusing, but he's very understanding about deadlines and extensions and such. \n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "May 09, 2010",
            "review_content": "\nThis man is the best professor I have had so far at Barnard. If you are lucky enough to have the opportunity to take a Spanish class with him, I would highly encourage you to do so. He is extremely kind, caring and patient. Even when people in my class asked him repetitive questions and yelled out in English, he never lost his temper and remained extremely calm. His comments on all of my papers were extremely extensive and helpful and he is very available outside of the classroom. Because he is from Barcelona he really loves Spanish language and culture as well as sharing it with his students. Although the workload was a lot (we had to do all of the exercises for all the chapters we did in the red and blue gente workbooks as well as selected grammar exercises and compositions), I feel like I learned more Spanish with Javier in one semester than I did in my four years of Spanish before college. \n\nWorkload:\nAll exercises for the chapters we did in the red and blue gente workbooks, as well as selected exercises in the Grammar book and compositions. He checks the grammar exercises at the midterm and final and the gente workbook exercises at the final exam so there is no incentive to meet the deadlines. \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "September 08, 2009",
            "review_content": "\nJavier was such a pleasure to have as a teacher. he's so kind, earnest, and really cares about his students, and takes care in grading papers and assignments. my previous spanish professors weren't native speakers, so at times i had a hard time understanding his spanish accent (he's from spain). but still, such a gem. \nWorkload:\ntypical for the barnard spanish department. \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 03, 2009",
            "review_content": "\nProf. Perez-Zapatero is kind, thoughtful, and an incredibly fair and engaging teacher. His class was always fun, and he was always willing to help out his students if they needed clarification on material or extra help. He put care into grading every assignment, essay, and exam, giving every student a lot of helpful comments. This class was a pleasure. I would take Intermediate I with Prof. Perez-Zapatero if you can; I have never had a professor who cared more about his students.\nWorkload:\nSame as other Intermediate Spanish I courses at Barnard (assignments, essays, department exams), though Prof. Perez-Zapatero graded my class pretty easily (perhaps because we were his first Intermediate I class). His system of recording grades is pretty hard to understand, but most final grades were fairly high. He is definitely a fair grader.\n"
        }
    ]
}