{
    "prof_info": [
        {
            "prof_name": "Ivana Hughes",
            "prof_id": 9885,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "September 29, 2020",
            "review_content": "\nShe's chill. Frosci is a very easy class so I don't think the professor matters too much. Ivana was nice to talk to. She did make us pay attention for the entire 2 hour discussion section every week without a break, which would get old pretty fast.\nWorkload:\nweekly homework assignment (standard across fresco), easy midterm and easy final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 24, 2019",
            "review_content": "\nShe was the most passionate, caring, and enthusiastic teacher I've ever had in all of my years in school. She put her all into the class, set aside a significant of time to meet with the students in my class despite her other large responsibilities to her research and the frontiers of science program as a whole. Never been a naturally STEM inclined person myself, she made me interested and feel confident in the topics that we covered and gave me a newfound interest in scientific research. One of the kindest, most intelligent, and all around skilled educator I've ever encountered.\nWorkload:\nWorkload was the same as other frontiers of science classes - so pretty light - but to top this off Dr. Hughes offers a lot of extra credit opportunities and is generally not the toughest grader. An easy(ish) and definitely very enjoyable A!\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "April 29, 2018",
            "review_content": "\nWhat can be said about Dr. Hughes that hasn't already been said in previous reviews? I came into FroSci my freshman year as the most reluctant humanities major and dreaded the thought of having to take this course. To put it simply, Ivana Hughes made FroSci bearable and at times, enjoyable. Her passion for all things science and for FroSci itself is practically contagious and it's evident in every aspect of her teaching. She pores her enthusiasm into everything and dedicates her time and energy to ensuring that each of her students succeeds in her class. If you're lucky enough to get placed in her section, know that you're in capable hands and take advantage of all the resources she has to offer. Go to her office hours, reviews session, and yes - her legendary movie nights hosted in her apartment each semester.  \nWorkload:\nThe workload for her class is fairly intense at least in terms of the number of assignments each week: piazza posts, smart sparrows, and written homework assignments each week. However, she's fairly lenient when it comes to deadlines and if you utilize all the resources that she gives you shouldn't have much of a problem.  \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 18, 2018",
            "review_content": "\nShe is the best teacher ever. She is truly passionate about FoS and cares about individual student. She is very clear in her classes and generous with extra time because she understands what it's like to be university student. She invited the whole class over to her house for dessert multiple times and even watched Interstellar together. She gives plenty of extra credit opportunities and gives extremely good feedback on homeworks. The midterm and final are the same for all FoS students and I would say that she is a generous grader (although I believe each class has its own curve). I thought I did absolutely terrible on the midterm which was quite hard (she admitted this year's midterm was the most difficult) and I still ended up with an A. She went over the midterm with me one on one and by the way I saw how she graded, she definitely did not penalize me hard for any wrong answers. She tries to find opportunity award you points, not take them away. She also sat with me one on one multiple times to work on the term paper and answered all my emails quickly--even over Thanksgiving break. I give her 20/10 and is one of very few professors here who I wish to develop a lasting relationship with.\n\nWorkload:\nWeekly homework. Weekly Smart Sparrow. A midterm and final. One 400-650 word paper.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 18, 2017",
            "review_content": "\nQuite simply the nicest professor I have had so far. Besides being a brilliant and incredibly knowledgable person, she is so warm and welcoming that I felt more like an advisee than a student in her class. She welcomed us into her home, told us stories about her children, and made her self available for help or just to talk about how the semester was going.\nProfessor Hughes clearly wants all of her students to succeed. She gives many extra credit opportunities and meets with every student to go over the midterm.\nShe made the class very enjoyable, and I definitely recommend taking it with her if you can!\nWorkload:\nWeekly homework assignments, weekly readings, semi-weekly online Smart Sparrow lessons, a semester project, a midterm, and a final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 30, 2017",
            "review_content": "\nDr. Hughes is an absolutely amazing person! She is so enthusiastic about science, Frontiers of Science, and all of her students. Her passion makes Frontiers an engaging, interesting course. She is extremely knowledgeable and can answer almost any question you might have and always makes time to find out the answer if she doesn't know if off-hand. Over the course of the semester, she had several movie/dessert nights at her apartment! She is really nice, really smart, and really passionate. In short, if you have Dr. Hughes, do not switch out because she is amazing!  \nWorkload:\nThere is a weekly homework assignment, weekly Piazza posts, a few online modules, and tons of extra credit opportunities. One midterm and one final. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "November 16, 2016",
            "review_content": "\nWhile FroSci may not be the most interesting class, Dr. Hughes is the nicest lady. If you get her for FroSci, stay in the section. She grades homeworks on completion - so even if you get things wrong, you're not going to get points off as long as you've tried and have written something. She genuinely cares about her students and wants them to do well. She grades the midterms pretty seriously, though, but she reviews it with you and will give you points back (she said, \"wow I was a little mean with that one, here are a few points back\"). She gives extra credit if you go to the Science Spotlight lectures and just wants to see that her students are interested in science. She also invited our class over to her apartment a couple of times for dessert and a movie. If you get her, keep her! She's wonderful!\nWorkload:\nWeekly homework (they can get a little long but they're not too bad); Smart Sparrow Online module (I think about 9 in the entire semester); Weekly Piazza posts (can be either a question you have, response to someone else's post, or a short paragraph about something you looked up based on what was discussed in lecture); 1 midterm and 1 final. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 30, 2014",
            "review_content": "\nIf you have Dr. Hughes, DO YOUR BEST TO NOT SWITCH OUT. U R SO LUCKY. FOREAL.\nOk but actually, Dr. Hughes is so awesome and incredible intelligent and so cute and every time I see her I just wanna hug her for being so amazing.  She's an amazing teacher and teaches so well and explains the lectures really well.  Also, NO QUIZZES! YA!!!! So while all your friends are freakin' about those 15 point frosci quizzes you can be chillen like \"yo, Dr. Hughes doesn't give quizzes and I'm prob learning more than you!\" She's insanely smart and can answer LITERALLY any question you have.  AND at the end of the term she invites her classes to her apartment for dessert and term paper discussions (ok seriously how cute is she?) \nWorkload:\nIn-class projects and assignments, weekly homework's, end-of-semester term paper\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "June 12, 2014",
            "review_content": "\nThis review will really just be preaching to the choir, but Professor Hughes is so incredible that I'm going to write it anyway. Professor Hughes made FroSci from what could have been a boring waste of time to a fun, stimulating class that I enjoyed going to each week. Her enthusiasm is completely without bounds. She lives to teach this material and teaches even the most rote and boring pieces of it like they're jewels of wisdom and she manages to get you to believe that they are. Her most common phrase is probably \"Isn't that so cool!\" She loves each of her students like one of her kids (whom she shows off on her computer and uses in examples pretty frequently) and honestly wants each of us to stay in touch after the semester. She gives endless opportunities to get extra credit, grades homeworks only for completion (she corrects it and grades on a scale of \"good\" through \"amazing!\"), and gives up her own time to give lengthy review sessions before exams. Whether this attitude actually effects students' performance on exams is debatable (she shows the class data after the midterm during a private conference and it fell in a perfect bell curve), but it certainly makes it enjoyable. I've heard such terrible things about other section leaders that I'm convinced I hit the jackpot, and the gold nugget shows I'm not alone. My only regret is that she doesn't have a lab so I can't apply for a research job with her! Seriously, if you see an opening during a registration appointment for one of her sections (unlikely), jump on it, as it won't last long and if you miss it you will regret it.\nWorkload:\nWeekly Homework graded for completion, short easy 5-page paper at the end, midterm and final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 21, 2012",
            "review_content": "\nI feel so lucky to have been in Dr. Hughes' Frontiers of Science discussion section. I honestly expected to have a miserable experience in Frontiers of Science and that it would be the worst part of the Core Curriculum, but Dr. Hughes made Fro Sci SUCH a great experience. She was also incredibly helpful in our transition into our first semester of college (I know a lot of my classmates feel the same way). By the end of the semester, I had told a ton of people who had been in U Writing first semester to do everything they could to get into her section.\nWorkload:\nOverall, the same as other sections.\nShe made a draft for our term paper mandatory (which wasn't mandatory for some other sections), but her comments on this draft were very helpful, so I think most people were okay with this extra piece of work.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 08, 2012",
            "review_content": "\nIf you've been assigned to Ivana's section for FroSci seminar, congratulations. She is probably the best seminar leader in the course and is also one of the kindest people you will ever meet. She invited our class to her home THREE TIMES for dessert and discussion, and she literally cried at the end of our last seminar because she was sad to see us go. She can be fun and goofy but still is a very intelligent professor who will make sure you understand the material. \nWorkload:\nSame as all the FroSci sections. Actually a little less since she doesn't make you turn in answers to the week's \"key questions\" like some other sections do. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "September 04, 2012",
            "review_content": "\nIvana is a fro-sci angel. She was kind, very accommodating and tended to think the best of everyone. I really liked her. She grades problem sets for completion. Her grading on the midterm/final was a bit harsh though. She will happily meet with you if you want questions answered and son on. And don't think I am saying this because I did really well in her class, at best, I did about average. But that was more because I didn't really put much effort in/focus on fro-sci sets, come to class on time. Freshman stuff.\nWorkload:\nnegligible. She grades the problem sets for completion.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "February 26, 2012",
            "review_content": "\nBest professor ever. Even though Frontiers of Science is one of the most painful classes around, she is a delight to interact with and learn from. She manages to make perfect sense of the muddled lectures and is so excited that it's impossible to have a bad time in her class. She also invites you over for dessert and offers a lot of extra credit options. If you are lucky enough to nab this wonderful woman, you'd be a fool to leave.\nWorkload:\nsame as everyone else- WIA weekly and one weekly discussion question. One paper. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 01, 2011",
            "review_content": "\nI'm trying to figure out a good reason why Dr. Hughes doesn't have a gold star.  I just can't come up with one.\nShe makes Frontiers enjoyable.  Seriously, it's weird that she can accomplish such a seemingly-insurmountable task.  She is really really ridiculously passionate about Frontiers, which can be a little burdensome at times for the students, but she totally gets us into it.  \nShe has office hours in her apartment for goodness sakes, and you should absolutely go.  I went to office hours every other week or so, feigning a question about the WIA.  She would engage in conversation about my family, my future goals, and my time at Columbia.  She offered life advice, research opportunities, and letters of recommendation.  I have little doubt that she would do this for everyone else as well, she is that sort of person.  I think of her as my Columbia mother-figure here.\nShe just had a kid, so I don't know if she is going to be teaching Frontiers again anytime soon.  But if she is, I don't know if I could recommend a professor any higher.  \nWorkload:\nFrontiers is easy.  Do the work, skim the readings, and go to lecture.  The midterm and final are deceivingly difficult, but it is not too tough to logic your way through the problems.  You get a note sheet, and if you make the font small enough and play with the margins, you can condense the entire study guide into the limit of one page front and back.  \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 15, 2011",
            "review_content": "\nYou will be lucky to get Dr. Hughes as your Frontiers teacher.  Dr. Hughes is by far one of the nicest professors I have met at Columbia.  Additionally, she is ridiculously intelligent and always has interesting information tidbits to pass on to others.  She also is always interested in students' lives and seeing how they're doing and learning what they're learning about.  Dr. Hughes made Frontiers not only bearable, but I actually sort of looked forward to it.  Dr. Hughes understands that not everyone's a scientist, but that we are all intelligent human beings.  She wants us to do well.  Those who work hard and make an effort to do well (even if they don't get the best scores or understand all the lectures) are rewarded.  She has her office hours in her beautiful/awesome/I-wish-I-lived-here-instead-of-Hartley apartment.  GO TO OFFICE HOURS.  Dr. Hughes does care about Frontiers, and thinks that it is a good program.  And honestly, Frontiers is at its heart, a good idea.  It's just not perfectly executed.  Fortunately, if you have Dr. Hughes, Frontiers actually becomes kind of cool.  Plus, she is so adorable.\nWorkload:\nW.I.A. (weekly individual assignments) that all Frontiers students have to do.  Also, a term paper.  Midterm and final are very difficult (course-wide) - fortunately, your section leader grades it for you.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 10, 2010",
            "review_content": "\n1. She is really nice.\n2. She is scary intelligent, but don't let that intimidate you.\n3. She has this odd combination of feeling passionate about Frontiers (in a very childlike, dorky, and endearing way...) and feeling obligated to give us good grades. (Again, she is nice!!!)\n4. She is so freaking nice.\nYou've heard about dessert night and her equally enthusiastic and smart husband who works at CERN, so definitely try to get into her section. But don't do it to take advantage of her. She recognizes that none of us really liked or cared about Frontiers as much as she did and yet she curiously still loves teaching. People, we need to keep her from getting jaded. \nWorkload:\nWIAs due on Friday. Random quizzes, but she will basically give you an A for participation. She also curves more easily on the midterm and final than other section leaders, so feel lucky. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "March 09, 2010",
            "review_content": "\nIvana is a delightful and adorable woman - try to get her for your frontiers discussion section. She's very sweet and very reasonable; as long as you pay a reasonable amount of attention she won't mind what you do. Basically, it's okay to mess around in class and have fun as long as you learn something. She tries very hard to make discussion engaging and useful - she incorporates lots of hands-on activities and tries to get students to participate instead of just lecturing to you. Her quizzes are VERY easy and always based on something from that week's lecture. With Ivana, you don't really have to do any reading for this class. Also, she makes the weekly homework due on Friday each week instead of the day she holds discussion, unlike most discussion leaders. She even invites you over to her house for dessert with her husband and her. Wonderful lady!\nWorkload:\nSporadic quizzes at the beginning of class, one midterm and one final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 18, 2009",
            "review_content": "\nReally good professor. She cares about each of her students understanding the work. Quizzes are really easy and not always given on a regular basis. She's a lot more dedicated to her students than most professors, she met individually with all of us to go over our midterms. One fault may be not being able to make the class more interesting, but that may be more of the problem of Frontiers than Professor Hughes herself. She invited us over to her house one night for dessert and a seminar with her husband about the Large Hadron Collider. She's also a really generous grader.\nWorkload:\nAverage, weekly assignments, weekly quiz of two or three questions. Standard midterm and final. \n"
        }
    ]
}