{
    "prof_info": [
        {
            "prof_name": "Anthony Corsentino",
            "prof_id": 2655,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 23, 2007",
            "review_content": "\nGod. Tony sounds like a pompous jerk when he speaks. He's not, though. He's actually quite nice and very approachable both before and after class. His class, however, is a lecture. He \"encourages\" discussion after his 1 1/2 hours of talking about the background of the text. He usually allows for five minutes of break to use the bathroom or blow your brains out to get over the boredom. When class resumes, he begins speaking about the actual text. He asks random questions and uses examples in the text. When students ask a question and he systematically shuts them down, you begin to see that he already has an answer to his question and he's just waiting for somebody to say it. Most students add an interrogative intonation on everything that they say to make it seem as if they dont' know what they're talking about. My guess is that they're waiting for Tony to say \"well, you're wrong, but I now don't think you're stupid because you so clearly showed that you were just guessing.\" Everyone seems to become afraid of declarative sentences because Tony will make them feel stupid...OR, even better, he'll nod as if he's listening and then seem to have completely ignored the opinion of the student when they're done talking. Either way, I've been discouraged from speaking in class because it generally feels good to keep my dignity. Bravery is not awarded with anything except 2 points of class participation. Yes, he makes me bitter.\nWorkload:\nTwo reasonable essays, an easy midterm, an easy exam, and either online postings (for which you can miss eight) or presentations in class.\n"
        },
        {
            "course_name": "Philosophy of Science",
            "review_date": "September 04, 2006",
            "review_content": "\nCorsentino is overall a marginally good professor. \nNegatives:\n1. As an earlier review mentioned, Prof. Corsentino has an incredibly pretentious manner of speech that initially annoyed me a great deal. However, its not a reflection of his personality and he seems to be a genuinely nice person.\n2. He tends to over-explain concepts and leave little time for questions or discussion. Some days it seemed like we spent 30 minutes on a concept that could be explained in about 5. He usually ran out of time at the end of class and kept us afterwards for at least 5-10 minutes. I took this as a summer class so maybe he felt like he had to 'dumb down' the subject material but it didn't seem necessary to me. \n3. Would have like a little more freedom on the essay topics.\nPositives:\n1. Clearly, clearly knows what he's talking about and is well organized (but ponderous).\n2. The class was interesting and I would recommend it. \n3. Is a good guy and is willing to repeat concepts and makes a point to have extra office hours before essays are due, etc.\n4. Seems to have passion both for the subject and for students understanding the subject; I just wish he'd moved a little faster.\nWorkload:\nAltogether, not very much. For a summer class it was just two essays and a final. Nothing to worry about.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 17, 2006",
            "review_content": "\nAs all of the other reviews have stated, Tony is nice, yet seemingly pretentious. He does not ask follow up questions, but does ask general questions that are supposed to lead us in the right direction. When he does lecture, it is usually not as helpful as what students have to say. Other professors explain terms and theories much better, so look at your friends' notes or do external research for further help. The presentations were better handled second semester as he allowed students to talk more than himself.  \nWorkload:\n2 papers (Submit a draft!), midterm and final. He gives you a list of questions that will be on the exam a few weeks ahead of time so there is no surprise. ID's are easy. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 17, 2006",
            "review_content": "\nAs all of the other reviews have stated, Tony is nice, yet seemingly pretentious. He does not ask follow up questions, but does ask general questions that are supposed to lead us in the right direction. When he does lecture, it is usually not as helpful as what students have to say. Other professors explain terms and theories much better, so look at your friends' notes or do external research for further help. The presentations were better handled second semester as he allowed students to talk more than himself.  \nWorkload:\n2 papers (Submit a draft!), midterm and final. He gives you a list of questions that will be on the exam a few weeks ahead of time so there is no surprise. ID's are easy. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 02, 2006",
            "review_content": "\nI will say most other reviewer have been excessively hard on him. Yes, he could do better, but is not \"bad\" at any rate.\nTony is a philosophy grad and knows what he is talking about. He knows the authors, their works, and can relate each others works properly. If you have done the reading and have an opinion, you get ample opportunity to express them in class. Listen to the class discussion attentively since it will prepare you well for the exams which are quite easy for two major reasons: one, he will choose any confusing quote but will rather pick something you can't possibly make a mistake identifying, and two, he will give six essay question ahead four of which appears on exam and you answer two of them - so things could not get easier. The three papers are not the difficult since you can submit a draft, and Tony is approachable enough to be helpful. Though the paper grading is a bit harsh as he demands original work on the student's behalf, the exam is graded more generously since there he only wants to see if you have got the right idea of each author's view. If you have attended the classes and have decent grades in exam, the best of the grades will neutralise the others.\nOn the downside, he lectures a lot and does not actually allow student discussions though he says that he wants to. 80% of the time in class he will be lecturing mostly on the author in general and only a bit on the specific works. Rest of the times the students will speak in vein since he will just glide through student raised points. Also, while the core is supposed to let student have lively discussions on topics not otherwise discussed out of class, Tony will do his best to pour water on potentially heated and enjoyable debates in order to keep the weather calm and boring.\nOverall, this class will teach you the basics of modern philosophy in a dovish manner avoiding the sharp edges. You probably have nothing to loose taking this class, and better not try opting out of it into more-probably worse sections. Tony is ok, but given his background should do better justice to his capabilities.\nWorkload:\nStandard. Three challenging essays, rationally easy exams. Overall fair grading.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 2005",
            "review_content": "\nTony is a solid CC teacher; heÂ’s simply not a flashy one.  I hate to say it, but the apparent thoughtlessness and complacency of these reviews\nexplains nearly all the specific complaints.  IÂ’ll concede this: he barely reacts to studentsÂ’ comments in class, much less pushes them to examine their views.  This is the crucial thing he needs to work on.  But to conclude from this that heÂ’s uninterested is just plain wrong.  Simply paying attention in class yields enough evidence that Tony is a thoughtful, perceptive listener and a skilled guide of the direction of discussion; his lack of individualized reaction makes sense if viewed as a misguided element of his general, hands-off approach.  ItÂ’s obvious that he views CC as a forum for our personal interaction with the texts, and this is a valid approach given the history and intention of the course.  He facilitates an introduction to the works on our own terms by offering unfailingly articulate and concise explanations of philosophical concepts (something which has clearly been taken for granted).  Yes, he's a helluva nice guy.  HeÂ’s also encouraging and approachable, and this is key, writes great, challenging criticisms on papers.  There are obviously advantages to getting more charismatic interpretations of the works from a CC teacher, but that doesnÂ’t mean that the advantages of TonyÂ’s style should be disregarded.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 17, 2005",
            "review_content": "\nTony is a pretty tight dude.  He comes in straight from Harvard, and you think you've got the most pretentious dolt in the world, but then you realize that he just talks that way and is really a nice guy.  He obviously knows his shit really, really well, so don't worry about him not being a professor.  He leads discussion fairly well, if not spectacularly, so our talks varied mostly on whether the reading was interesting, and if anyone did any of it.  I'd say his only major downside is that he tends to ramble on and on about the biographies of the authors we read.  Also, I couldn't seem to break out of the B- B+ range, but you're probably smarter than I am, so don't worry about it.  He's a young guy, and can relate, so I would recommend him, though not with a whole lot of enthusiasm.\nWorkload:\n2 papers, midterm, final, and, obviously, hella reading.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 17, 2005",
            "review_content": "\nTony is a pretty tight dude.  He comes in straight from Harvard, and you think you've got the most pretentious dolt in the world, but then you realize that he just talks that way and is really a nice guy.  He obviously knows his shit really, really well, so don't worry about him not being a professor.  He leads discussion fairly well, if not spectacularly, so our talks varied mostly on whether the reading was interesting, and if anyone did any of it.  I'd say his only major downside is that he tends to ramble on and on about the biographies of the authors we read.  Also, I couldn't seem to break out of the B- B+ range, but you're probably smarter than I am, so don't worry about it.  He's a young guy, and can relate, so I would recommend him, though not with a whole lot of enthusiasm.\nWorkload:\n2 papers, midterm, final, and, obviously, hella reading.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 10, 2005",
            "review_content": "\nOverall, i'd have to agree that while Tony is a nice guy, i dont think he's that great of a teacher. He does not delve deeply into anything and whenever someone says any thing he just says \"alright good\" and then moves on to the next person with their hand up.\nAlso, the class presentations are a waste, half the time the presenter doesnt even say anything--it's basically just to see if you're reading.\nOver all, mediocre at best--could be worse but could also be a LOT better.\nWorkload:\n3 tough essays (but he lets you submit drafts which is really nice), TONS OF READING--if it's supplementary he'll make you read it (more than other CC classes), midterm, final, 2 presentations per semester\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 10, 2005",
            "review_content": "\nOverall, i'd have to agree that while Tony is a nice guy, i dont think he's that great of a teacher. He does not delve deeply into anything and whenever someone says any thing he just says \"alright good\" and then moves on to the next person with their hand up.\nAlso, the class presentations are a waste, half the time the presenter doesnt even say anything--it's basically just to see if you're reading.\nOver all, mediocre at best--could be worse but could also be a LOT better.\nWorkload:\n3 tough essays (but he lets you submit drafts which is really nice), TONS OF READING--if it's supplementary he'll make you read it (more than other CC classes), midterm, final, 2 presentations per semester\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 15, 2005",
            "review_content": "\nAlthough he's a nice guy, Tony is a boring and useless teacher.  You won't learn much of anything from him and he will kill any interest in philosophy because he is so boring.  He also has no idea how to conduct a class discussion.  He never prods anyone to look any further into the material with follow up questions on their in class comments, but rather just acts mechanically calling on people without ever delving deeper into their remarks.  He's also a fairly hard paper grader, though he looks at rough drafts for you. \nWorkload:\n3 papers each semester, lots of reading and 2 presentations per semester, a midterm and final each semester\n"
        }
    ]
}