{
    "prof_info": [
        {
            "prof_name": "Ricardo Reis",
            "prof_id": 3502,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 21, 2015",
            "review_content": "\nI took this class with Ricardo last term and wanted to give him some love since it seems like a lot of it is going to Xavier!  I learned a lot in this class without too much stress, and would highly recommend it to anyone looking for a more broad introduction to macroeconomics than what Xavier does.  \nRicardo organizes his lectures into weeks of different topics (13 weeks total) covering unemployment, inflation, growth theory, fiscal policy, monetary policy, and more, and the models behind each of them.  You don't need to know a lot of math for this class at all, though sometimes it helps in understanding the models.\nRicardo's lectures slides are very useful - definitely print them out and take notes on them in class (or do it on a computer).  Sometimes I didn't fully understand what he was saying during class, but when I did the problem sets and reviewed the notes everything cleared up.  At times he may seem like he's going too quickly (probably because he's just so brilliant) but I just wrote everything down and reviewed it one more time and it usually clicked.\nRecitations weren't super useful - I was planning on going to most of them but then ended up not going to many because of conflicts or sheer laziness, and found that Ricardo's notes are enough.  But when I did go, they cleared things up and I think it's a great way to catch up if you're behind in class (shoutout to the awesome TAs Savi, Oscar, Jiawen! All three of them were great).\nI learned quite a bit and in the end felt like I really grasped the basics of each of the topics he covered.  He likes to give real world examples of all the topics, which made me feel like I also learned a bit more about the economics of the world in general.  This is a great foundation class - plus Ricardo is really nice, flexible with scheduling office hours, and is very approachable despite being a genius!\nOh, and, he has a dazzling smile. Seriously. If given the option I would choose Ricardo again in a heartbeat.\nWorkload:\n20% problem sets: 10 problem sets total, weekly (with a couple exceptions like before midterms). I thought they were pretty straightforward and it didn't take me very long to complete them.  Working with others definitely helps, but make sure you understand the problems since his midterm and final questions are similar.\n30% Midterm (learn how to budget your limited time/do questions quickly)\n50% Final\nThere's the option of not taking the midterm so the final counts for 80% but you have to decide the morning of the midterm!\n\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 05, 2013",
            "review_content": "\nHaving hated my macroeconomics class in high school, I had some apprehensions about jumping into Reis' class my first fall semester. Reis completely invalidated my fears. He's engaging and doesn't kill his students with work. Some complain about the strong math focus, and he certainly does use a lot of calculus in his lessons, but I personally liked that perspective. I found that it made the material a lot easier to understand. Even if you left the course with a very abstract view of the unit, the homework clarified its application. The midterm came directly from the homework questions, so if you make sure you understand each assignment, you'll do well on the midterm.  \nThat being said, at times Reis' explanations weren't all that clear. The TA's were great at filling up the gaps in his lectures. Seriously I wouldn't have understood a lot of things if it weren't for them. Reis also provides math notes, lecture notes, external textbook readings and suggested articles. He gives you so many resources so it's really hard to not do well (in my opinion).\nI know people in Xavier's who liked him. I sat in on a lecture, and he's definitely a great lecturer, but from what I hear he only covers growth. Take Reis; he gives you a super comprehensive view of macro, which I personally valued more.\nWorkload:\nWeekly problem sets (never took more than 30 minutes a set, got full points on every one and you're allowed to collaborate and check work with other people)\n1 midterm (35%, problems are straight from the homework, only difficulty is budgeting your time but you face that with any test)\n1 final (50%, same thing)\n\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 23, 2013",
            "review_content": "\nReis is awesome! He's very fun, dynamic, and he's a great professor.\nHis slides are really great, and his lectures definitely add detail and specifics. Definitely go to his classes. He has a great sense of humor.\nMy only complaint is that sometimes, his slides had errors or were slightly confusing (the TAs confirmed this).\nTravis was a fantastic TA. Definitely go to his office hours. By the end of the semester there was a crew people who religiously went every week because he was so helpful.\nWorkload:\nWeekly assignments\nMidterm\nFinal\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 12, 2013",
            "review_content": "\nAll through last semester, I questioned whether I had made the right decision taking Ricardo's intermediate macro course over Xavier's, and I am still unsure whether I made the right decision. Given the chance to do it over, though, I'd most definitely choose Xavier's class over Ricardo's, and so I am hesitant to recommend Ricardo's class. To me, at least, that decision would depend on who else is teaching the course for that semester -- I chose Ricardo's class over Xavier's because I thought I would do better and learn more in a smaller class with a textbook and a more guided syllabus, but I should have heeded the reviews that Ricardo's class would be harder and more mathy. Ultimately, the class left me unfulfilled, and I think the amount of time and effort I put in (with less than anticipated return) could have been better spent elsewhere.\nRicardo is a brilliant person -- plus, he's charming and kind, and he's never made me feel patronized or stupid. The problem is, he's almost too brilliant. He was great at explaining concepts in lecture, but every time he started doing math on the board, deriving formulas, pulling variables out of nowhere, I was just lost. Even worse, he always seemed to be skipping steps in his powerpoints and in lectures. So, I felt like I got a lot out of the more conceptual parts of the class, such as unemployment, but I had a hard time with more math-based sections. Additionally, I felt that the different chapters were incohesive (I feel like I never really got how each chapter connected with the next) -- picture a punctuated equilibrium timeline for learning, where things seem to suddenly jump to other things. And of course, these terrible math-y things would appear on our exams, even though they were the parts that (I feel) he did the worst job explaining in class. On top of that, I couldn't attend any recitations (not mandatory, but I'm sure they would have helped, except they were all during my other classes), and the TAs, though helpful, were too busy or unwilling to set up meetings aside from office hours. Like I said, Ricardo is charming and sweet, and he was always willing to answer questions about lecture after class, but that isn't a substitute for a lecture that actually makes sense.\nThat said, this class is probably right for some people -- his teaching style seemed to work with a lot of my engineer friends (not generalizing, just making an observation), and a lot of people like him. Maybe I was one of just a few who were having so much trouble, but I don't think it's because I don't have a solid background in math or econ (I did well in Calc III and Principles with Gulati), so I don't know why I found this class ridiculously hard and at the end of the day, unrewarding. \nExams were long (the midterm more so than the final), not impossible but difficult. Problems looked like problems from the problem set (some very similar), but usually somewhat harder. You have to really know what you're doing to finish everything, I think. Final is comprehensive. \nSo, to recap: Ricardo is a really sweet guy, a genius in his field, and for a lot of people a great professor. But for me personally, his class wasn't worth the time, stress, or effort -- I feel like despite the fact that I went to every lecture and tried to take comprehensive notes (even while he whizzed through the math sections) and that I studied my ass off for exams, I still don't have a clear picture of macro, and I'm not sure if I feel prepared to take on a higher level macro course. This is disappointing because the main reason I chose Ricardo's class was because reviews said he prepared you better for future courses. I'm a person who is willing to take a grade hit for a better experience, but Ricardo's class wasn't one.\nWorkload:\n20% problem sets -- 10 a semester, 1 per week. graded out of 4, hard to get a 4 but not impossible\n30% midterm -- 1 class period\n50% final -- 3 hours\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 19, 2012",
            "review_content": "\nReis is the Gulati of Macroeconomics, and by that I mean that he is the harder option. He's a brilliant guy (omg his bio is ridiculous), but more like a 7/10 when it comes to teaching. Some issues I had that I felt a lot of people also had:\n--He takes all of his exam questions directly from his slides, but his slides (which he puts on courseworks) can be really difficult to understand. \n--He really emphasizes the math in macro, much more so than Xavier's class did I think. In class though he would rush through the mathematical concepts. That said, he does provide really good, extremely detailed math notes for everything. Actually they're shockingly good considering the lecture slides. Even with the notes though, it's pretty important to go to recitation to make sure you understand the math behind everything and how it could be applied in an exam question, for instance. \nSo those were my issues. Still, I'm glad I took his class. Reis is a lovable professor. He's just plain adorable. Every class without fail he would get a chalk line across without fail and, also without fail, would have no idea. Also, his TAs are AMAZING. Really really really great. I cannot emphasize that enough. I think the reviews below mine are about other TAs. He must've realized his previous TAs sucked because Travis, Hyun, and Nicolas were fantastic--really helpful in recitation, and would reply almost immediately to emails with questions. \nAlso, Reis makes macro super interesting. We had one guy in the class who would constantly ask questions about whether or not whatever we were covering applied to some news-y thing, and every time Ricardo would show just how knowledgable he was in the subject area. This guy really knows his stuff. \nOverall, this class is super interesting, but also quite difficult, and Reis is a great professor, though I wish he would be clearer sometimes. I would recommend it only if you think you can handle it. His midterm was fair but hard, as was the final. Problem sets become a pain in the ass eventually, but the exams are a lot like them. All problem set problems are previous exam questions. \nWorkload:\nProblem sets every week (try as you might, you'll get a 3.5/4)\nA fair midterm (but you'll only realize it was fair if you study your ass off)\nA final, also fair\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 06, 2010",
            "review_content": "\nReis is a fantastic professor. I've heard about the atrocities students have lived through with other professors who teach Intermediate Macro, and Reis is the light that shines in the dark. Â First of all he's a young, energetic, active researcher; a contrast to most of the old mummies who emerge from the crypt that we call the economics department. He seems to truly love teaching.. undergrads no less!\nIt should be said that it is very easy to get lost during the lectures as Reis covers a lot of material (we covered the whole book, save two chapters). Â But he did a great job connecting the Greek symbols to reality. His analogies were pure gold as he is really funny in a natural way. He is not a clown up there trying to make economics sound cool with nonsense like \"ok here's one you college students can relate to: what's the opportunity cost of smoking a bowl instead of doing your problem set tonight?\" No, Reis's analogies are genuinely creative and helpful.\nAs has been stated, the problem sets can be tricky and they take some thought, but they are short. Â I'd say of the 10 problem sets, maybe half were pretty easy to moderate and the other half were difficult. Â And although technically we were only supposed to have 5 days to turn them in, about half the time Reis gave us an extension for one reason or another.\nA lot of previous reviewers hated the TAs but I thought they did a pretty good job this semester. The grading could seem arbitrary sometimes, but that's somewhat expected in a class like macro, and everyone had to deal with it. Â Also the TAs were very cagey about answering any direct questions about the homework for fear of helping \"too much.\" Â But the recitations were run well.\nThe midterm was not as bad as most of us had expected, but we were tested on everything, so you really can't afford to bypass anything when preparing.  I thought the final was much more challenging than the midterm (with the exception of the essay portion which was very easy) but by that time I think most of the class was better prepared for it. Both exams were very fair: just challenging enough to make the cramming worthwhile, but not so much as to cause a nervous breakdown.\nOverall, this was a really good class and personally I feel very prepared to take on more advanced macro-based courses. Â It may be too soon to declare Reis the Susan Elmes of macro, but he's the closest we've had thus far.\nWorkload:\nWorkload is light as far as what you actually have to turn in, but moderate to semi-heavy if you include the preparation necessary to do really well on the exams.\n10 problem sets: a mix of questions from the book and problems that Reis cooks up.  The questions from the book tended to be more difficult since you had to read the chapter in order to answer them.  The problems Reis creates are only hard in trying to figure out how to get started, but after reviewing the slides and the math notes you can easily get the ball rolling.\n1 midterm: challenging, but not overly so.  There were three sections: multiple choice (15%), problem set style questions (55%), essay question (30%).  Average was 66, curve was fair.  \n1 final: Cumulative, exact same format as midterm but twice the size.  Multiple choice seemed much tricker than in the midterm, as did the problem set style section.  The two essay questions were really easy, but if someone had gotten by the whole semester only manipulating equations, that person might have been screwed as they were truly \"essay questions\" that did not call for any math (which was actually a nice way to slap down some of the human calculators in the class and throw a bone to those of us who think in words and not sigmas and lambdas.)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 03, 2010",
            "review_content": "\nProfessor Reis is an excellent professor. His class may not be as popular as Xavier's, but it was a fun class and I learned a lot. He is great at explaining things and also very funny. Ricardo's lectures always begin with interesting, challenging questions that will be answered within the lecture. He is very math-oriented and likes to use equations rather than graphs, so be sure to try and make sure you understand what he is doing either in class (which may be hard since he does things so quickly) or after class.\nThe weekly problem sets (20% of your grade) are usually pretty challenging, and the grading is a bit harsh on them (they are graded out of 4, and if you make one mistake, you're going to get a 3.5). However, the recitation section is usually a good resource to use if you're confused on the homework. \nThere is one midterm, which consists of 5 MC questions, 2 short-response, and 1 essay, which is worth 30% of your grade. The final is double the midterm and is worth 50% of  your grade. They are challenging (the average on my midterm was around 60/100), but fair. There are no surprises on his tests. In terms of preparing for exams, I would definitely say his lecture slides are better to study from than the textbook. But, the textbook can help clarify anything you're not clear about.\nI would definitely recommend Professor Reis's class to anybody interested in economics who's willing to put in the work.\nWorkload:\nChallenging weekly problem sets, a couple of questions each. One midterm and one final. Definitely doable.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 20, 2009",
            "review_content": "\nThe class was really interesting, and I learned a lot. Reis focuses not only on the generally theory, but supports his claims with evidence, and discussed the current economic crisis as well as the great depression.\nThe focus on the mathematics, however, can be quite disorienting. Often Reis will manipulate 5 or six expressions at once, and seemingly magically come up with the final equations. He blazes though his slides quickly, which makes gaining a deep understanding of the material tough, but doable if you look over his slides afterward.\nExams combine knowledge of the equations with understanding of the material, and are tough but reasonably curved.\nWorkload:\n1 problem set per week, only takes a few hours. Most of the time is going over the slides again.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 24, 2009",
            "review_content": "\nThis course was torture to sit through. Reis would go through a million powerpoint slides at lightning speed while only rarely stopping to explain the mathematics. Macro isn't particularly difficult if you learn from textbooks, but with Reis, everything is much harder than it should be.\nThat said, if you're a math whiz, type quickly, and fast on the uptake, you have a shot of doing pretty well. The curve on the midterm was okay but it was pretty bad on the final. His exams are model and formula intensive. Also, knowing anything on a basic level won't save you: you need to know the special cases well. \nHonestly, I'd never take a class with him again and regret taking this one. It was dull, I learned little (except from the very non-math intensive Mankiw book), found his slides confusing, and his problem sets difficult.  \nJust say no to Reis and go for whomever else is teaching that semester.\nWorkload:\n10 problem sets graded 1-4. Very difficult, although not particularly long (4-5 questions). Midterm and Final are a lot like the problem sets and also challenging. The key is knowing every formula well and being able to modify it easily. Solid grasp of Calculus, including Calc III, is essential. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 13, 2009",
            "review_content": "\nReis is a very fun and engaging professor. He definitely knows his stuff, but the way he explains the material has at many times left the class more than slightly confused, except for the few econ geniuses. It also doesn't help that the room was ridiculously hot and easy to fall asleep to. He has the tendency to talk very fast and go very in depth in the mathematical side of macro so make sure you know the material somewhat before going to his class. I would suggest that you go to his classes and write down every equation he puts on the board because sometimes those show up on problem sets (and midterm). He did write up all the math notes used in the class -- which was very helpful.\nHis lecture notes are not particularly clear and deviate a lot from the textbook, but it is still very important to read every chapter assigned in the text. As a result, if you skip lectures and just rely on the textbook, you will find that the problem set (which is divided 50/50 between textbook problems and obscure math heavy ones that are based more on his class lecture) are obscure and seemed to be jumping out of nowhere. \nOverall, class was good. A lot more math oriented than had expected for a macro class. His midterm was very fair as was his final (which was just midterm x 2 in length). The midterm had a mean (and curved) to B, probably the same for the final. \n\nWorkload:\nOne problem set to do over every weekend. Sometimes really easy, sometimes ridiculous due to the math needed. \nLots of cramming for midterm and final which were very fair but did cover just about everything mentioned in his lecture.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 11, 2009",
            "review_content": "\nMake no mistake about it. Professor Reis is a resourceful guy. If you do take his class, you'll end up with a solid understanding of Macroeconomics through extra-reading, mathematically intense problem sets, and lecture slides. Yet do be warned about his TAs; they went out of their way to become as unhelpful as possible. They never attend the classes when possible, resulting in their ignorance of the materials; they switch the time and location of recitations every single week, and one of the TAs is very misleading. For the several times I went to her recitation, her explanation was completely WRONG, and I had to correct her afterwards. Professor Reis is a nice guy, but if he cares about his students for a single bit, he should consider changing his TAs. \nWorkload:\n10 Problem Sets, sometimes easy, sometimes impossible.\nOne mid-term. Average is aroung 70-ish.\nOne final. Which is fair. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 10, 2009",
            "review_content": "\nReis is a solid professor. I came out of the class with a good macro-foundation. He is a responsible professor, who would post relevant readings, slides, and math notes. The only complaint I have, is the poor quality of his TAs. \nThey miss classes on a frequent base, resulting in their ignorance of what's going on. When it comes to recitations, they always change their locations and schedules randomly at their whim, and most alarmingly, they came under-prepared. They either ended up reading the text-book aloud, or get the materials wrong, which is very misleading for the class. \nIn a sum, you cannot get TAs who care less about the class and the students. They can get your final grades mis-matched with other people who share the same first name or surname, and it takes them forever (30 days plus) to correct it. I cannot express my frustration with the administration of the class, because of the poor quality of TAs. I strongly recommend Reis getting more responsible TAs, like those of Susan Elmes'. \nOther than the TAs, this class has been a relatively good experience. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 18, 2008",
            "review_content": "\nOkay, so Reis is a pretty good professor.\nHe is funny, and its worth going to class. The only problem, however, is that sometimes he gets really, really mathematical. He really seems to love numbers equations and calculus, and makes macro very intensive in that sense. Also, while his math notes are really good, his lecture slides are not.\nAlso, If your not very proficient with basic calculus and aren't a fan of long, long tedious algebra, then you're going to have a very hard time.\nPersonally, I'm inclined to think that he makes the course more difficult than it is.\nHowever, he is a good guy and teaches well for the most part. I can imagine a real econ whiz absolutely loving this class. I found it fun often, just didn't particularly like the overflow of math.\nIf you're up for attending every class, reading the material thoroughly beforehand and not falling back and also spending one night a week doing the problem set, then this will be great because he does make the subject interesting. If not, then your screwed come finals and screwed in the problem sets.\n\nWorkload:\n10 problem sets, some are really hard, others are about okay.\nReasonably normal midterm with fair grading\ncumulative final, LOTS of material + models\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 09, 2008",
            "review_content": "\nRicardo is a new professor at Columbia but has been around the economics game for a while. He seems to be very able to relate to the students and give great examples for some complex theories in \nHe uses lecture slides which are posted online and usually follows the book, but sometimes if he really likes a subject (like unemployment and aggregate supply) he goes more math intensive. His lectures are usually pretty entertaining and he's a funny guy. He tries to make sure you understand the material: he even wrote out math notes for everything he did in class which was VERY helpful.\nOverall I thoroughly enjoyed taking the class and though Reis was a great professor. Sometimes he goes a little to fast on the math, but if you read the math notes and go to recitation for the times that you were confused, you should do fine.\nHe isn't difficult but he isn't easy. In my opinion, his grading and difficulty were very fair.\nWorkload:\n10 problem sets worth 20% total, midterm of 30%, final of 50%\n"
        }
    ]
}