{
    "prof_info": [
        {
            "prof_name": "Christian Schindler",
            "prof_id": 5564,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Cellular and Molecular Immunology",
            "review_date": "January 10, 2017",
            "review_content": "\nPre-Requisites: A basic understanding of Biology is assumed so make sure you have taken Intro Bio.\nCourse Overview: The course begins by discussing the Adaptive Immune System. You learn how B and T cells develop, obtain their specificity, their activation, and how they target immunogenic organisms, cells, and substances. The course then moves on to discuss the Innate Immune System. Here you learn about the body's innate defenses and sentinel cells which are the first to respond. How they develop, what receptors they use, and the interconnectedness between the innate and adaptive immune systems (which aren't so distinct). Classical experiments, experimental techniques, and some key diseases are discussed throughout the course. \nLecture (Professor Mowshowitz): XY Mowsh really loves immunology, and you will too after the course! Throughout the lectures, Professor M. would discuss any relevant diseases associated with a cell/receptor/protein not functioning properly which gave you some real world implications about their importance. In addition, he would discuss the current state of the field and recent developments. The downside to all this fascinating material is that their is so much of it. The lectures at times felt sporadic, jumping from point to point, making it hard to take notes as you are unsure if it is a side comment or important information. Unfortunately, Professor M. prioritized getting through all the material on his slides as opposed to making clear certain concepts presented, resulting in very dense lectures. This is a class where I felt it was a necessity to re-listen to all the audio lectures even when I attended all the lectures. With that said, I do believe I got a lot out of the course as a whole, my note taking and studying skills improved, and I don't regret taking it. He thankfully does not necessarily test any obscure things mentioned and you could always earn partial points on exam questions. \nLecture (Professor Schindler): Oh, the horror! Dr. Schindler teaches most of the innate Immune system and micriobiome which is about 5 lectures. Although at first I appreciated his inclusion of bullet points in the powerpoint slides, it was even more overwhelming then XY Mowsh lectures because he includes so many diagrams in the slides which were all very complicated and not discussed in detail. This made it much harder than XY Mowsh lectures to discern what was testable and what was just cool stuff he wanted us to know. The greatest problem, however, was the disconnect between the two professors as XY Mowsh would frequently ask \"Did Christian teach you about...?, \"No?!\", \"Brother\" in subsequent lectures. Thankfully, XY Mowsh was understandable about how confusing Dr. Schindlers lectures could be and would accept alternative answers on his exam questions that made sense. \nOverall: With all that said, I do believe this class is worth taking in the end (although perhaps not during a heavy semester). The material is cool enough to make you look past the courses flaws and Professor Mowshowitz does a great job of keeping you engaged with his humor and fun anecdotes. He generously curved each exam to an average of 82, lets you drop your lowest exam grade, and the A cutoff was dropped to about a 260/300 (though it might have been lowered more after the final). \nYou just need to find what study method works for you (Outline/FlashCards/Concept Map/Illustrations/etc.) and maybe a good study partner early on to be successful. \nWorkload:\n3 (100pt) Non-Cumulative Exams (Drop 1)\n1 (100pt) Non-Cumulative Final Exam \n[8.5hr weekly] Between Lectures (2hr 30min), Re-listening to Audio Lectures at lower speed (3hr), Textbook Reading (supplement) (1hr), and making review materials (2 hr) this class was my heaviest workload this semester though I always found it entertaining. \nNo Articles, Study Problems, HW Questions, etc. you may find in other upper level Biology Courses\n"
        }
    ]
}