{
    "prof_info": [
        {
            "prof_name": "David Vallancourt",
            "prof_id": 2742,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "December 12, 2016",
            "review_content": "\nI have never done one of these Culpa reviews but I thought it was important to come on here and warn anyone considering this class. It has been my worst academic experience ever. I am an older student and I have struggled in classes before. I usually accept those struggles for what they are. But this was some other level stuff. His teaching approach is HORRIBLE. He does nothing to help non-engineering majors adjust to this class. I took it because I had an interest in digital information theory but this is just a flat out electrical engineering class. The class size fell by half and he had to cancel the homeworks and one quiz because everyone was struggling and complaining so much. This is not a bitter, mediocre student complaining. This is the reality of the situation. In quiz #2, the two long questions were worth the same 1 point as the 6 multiple choice questions. Simple things like that put a long term mark on one's transcript because of the teacher's poor judgment. And that was my experience this entire class, a teacher's poor judgment. \nDO. NOT. TAKE. THIS. CLASS.\nWorkload:\n5 Homeworks (because 3 were canceled due to panic)\n2 Quizzes (1 canceled as well)\n1 optional final\n2 Special projects.\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "May 19, 2016",
            "review_content": "\nVallancourt is one of the worst professors ever. I don´t know why people keep saying he is amazing. He is not amazing at all. All he does in class is talk about his cat, his life, or his past jobs. I think I only missed about 1 class, and the next class I didnt even know what he was talking about. It gets absurdly annoying that he doesnt use the book, so you cant really catch up because he doesnt even post notes online either. This is a very ineffective way of teaching. It makes me resent going to class. The quizzes were much harded than homework or class material. You usually find questions in the quizzes about material that was not taught during class. Do not take this course with Vallancourt if you easily dose off at a boring professor, because HE IS BORING. He can make jokes once in a while, but not everyone understands the jokes. Its not meant for everyone. Most of the time you would find about 5 people sleeping. Considering this class was at 4pm is a big concern. People shouldnt be dozing off at 4pm. I really did not enjoy my time during this class, and the labs are long and require much effort. They ran during the night, so you would be exhausted just getting there. \nHomeworks are fair. Quizzes get more difficult over time so try to do well on the first ones. Final was bomb.\nWorkload:\n3 Quizzes (only two of them counted)\n10 Labs, 1 Final Project\n8 Homeworks\nFinal Exam\n"
        },
        {
            "course_name": "The Digital Information Age",
            "review_date": "January 30, 2014",
            "review_content": "\nAs someone who struggled daily in this course, I can firmly say that Professor Vallancourt is a great teacher and a great person. His lectures tend to be very engaging, even if he does speed through content. While he was hard to follow sometimes, Professor Vallancourt's office hours were incredibly helpful. I was there nearly all the time and I never felt like he got sick of seeing me confused all the time. \nOne thing that I didn't like about this class was that there was a lab component that never was successful. The lab option was just a waste of time, but thankfully it doesn't go towards your grade. I also didn't like that I NEVER knew who the TA was. He was grading my work but I never met him, nor was he ever present in class for questions or office hours. \nWorkload:\nThe course is divided by three non-cumulative quizes. At the end of the semester you have the option of retaking any of the quizes you didn't do well on. There's one major project at the end of the semester and about 7 homework assignments. If you're good with science, physics, and circuits then you'll do fine and probably get an A\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "January 13, 2014",
            "review_content": "\nLECTURE: Professor Vallancourt always rocks lecture. He's always eager to answer questions and makes the subject matter pretty clear. However, I find it quite easy to get lost in lecture fast so make sure you get everything you go as there is a lot of material to cover in a short amount of time. \nEXAMS: They are dubbed quizzes and are supposedly 10% of your grade each. There are three and the worst is dropped. I find the quizzes are harder than the material covered in lecture and on par with the hard problems of the problem sets. Also grading is harsh with little to no partial credit so be careful. \nLAB: 3 hour lab sessions once a week. The labs are boring and long and often not well explained by the lab manual. The lab also feels as though we could use 5 more TA's as everyone is asking questions at once. If you can, try to switch into a lab section with less students so you can ask a lot of questions instead of sitting there looking at your thumbs. The lab reports are graded graciously (All lab grades add up to 20% of your grade) There is a final lab project which is worth 10% of your grade. \nHOMEWORK: There is a pset assigned every week. It can take a significant amount of time so plan wisely. Difficulty ranges from easy to very hard. Homework is 10% of your grade. \nFINAL: The final is cumulative and can get difficult. Study hard and study well. Multiple choice is tricky. It's worth 30%\nCURVE: At the end, Prof. Vallancourt takes into account the various scenarios and assigns you a grade the highest of the scenarios. For instance, if you did poorly on your final, he counts it a little less and counts something like the quizzes a little more. \nWorkload:\n1 pset a week\n3 exams\n1 final\n\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "January 13, 2014",
            "review_content": "\nThis is a superb course. Vallancourt has a talent with sparking people's interest in EE. Prior to this class, I had never fully understood how to construct a circuit on a breadboard, and I didn't have any idea what an op-amp actually was. This class changed has made me more competent in the language used by many computer engineers and electrical engineers alike. Material-wise, the course covers much of the same material covered in Intro to Electricity & Magnetism. However, it focuses on the practical applications of these concepts, and also introduces new ideas to the material from intro E&M.; Non E&M; concepts covered include the superposition principle, node analysis, op-amps, transformers, transfer functions, Boolean logic circuits, diodes, and transistors. Included with the class is the weekly 3-hour lab session. Each lab involves demonstrating or exploring concepts from lecture. You get used to building circuits on a breadboard very quickly, even if you have no prior experience. Labs range from taking current measurements that correspond to changes in voltage across a resistor to picking up an AC radio frequency and listening to it through a speaker. You complete labs and submit one lab report per week with your partner. The lab TAs are very helpful during labs and respond to email quickly. Labs are really interesting and useful because you demonstrate physically the theoretical concepts discussed in lecture. I would take this course again in a femtosecond.\nWorkload:\nThe workload is moderate. Vallancourt has a cool grading scheme that considers a series of scenarios for each student (for example, counting the final less, excluding homework, or not dropping any quizzes). This means there isn't one consistent grading scheme for each student, and is intended to give students the best possible grade.There are roughly 8 homework assignments, which are generally fairly short and straightforward if you take good notes in lecture or read the textbook. The textbook can be very helpful, especially when covering topics not in E&M;, such as op-amps and transistors. \nGrades are computed from the following:\n~8 homeworks\nweekly lab reports\n3 quizzes, 1 is dropped, the last one is take-home\na cumulative final exam\na final lab design project of your choice\n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "May 21, 2013",
            "review_content": "\nIf you're an engineer, you have to take this, so this review is pretty pointless. Vallancourt is awesome as always if you've taken him before.\nThe class requires about 6 hours of work a week.\n3 hours in the lab\n3 hours attending a seminar\n2 - 3 hours doing MATLAB assignment while you're in the seminar.\nThe MATLAB is a pain in the rear end. It's boring and unproductive.\nThe EE lab project was great. We sent a message from a laptop in Mudd to Low via laser signals. We spent a lot of time building circuits that didn't work though.\nThis is a low commitment course which can be an easy A+ if you do all the required work and the extra MATLAB credit.\nYou have to write 3 two page essays, one of which is a TED talk.\nWorkload:\n50% project report\nrest is MATLAB and 3 essays \n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "May 18, 2013",
            "review_content": "\nTake this class! This is one of my best classes at Columbia so far. Vallancourt is an amazing professor who will make you love EE. He isn't a researcher, only a lecturer, so clearly he does his job because he loves teaching and not because Columbia's forcing him to. He has over 15 years of industry experience and tells us about the real world applications of everything he teaches in class in his humorous anecdotes.\nHe's also great with grades. He has multiple grading schemes to maximize your final grade. He provides plenty of previous sample quizzes so you can prepare well for his tests. There are three quizzes instead of a midterm, which count for 10% each, so it's less stress.\nMy only gripe about this class was that the labs were for the most part boring and long. Some of the experiments Apart from the actual class, you have to spend 3 hours in the lab and spend about an hour writing a lab report every week. Make sure to get into a group with team mates of equal caliber so you can split the work. Lazy team mates who don't do any work make the labs time consuming. The final project was really fun though. If you're creative, you'll use this opportunity to make some really cool stuff.\nThis is hands down the best pre-professional course, so take it if you can. You will learn a lot and enjoy it.\nWorkload:\n3 Quizzes\n1 Final\n1 Final Lab Project\nWeekly problem set + lab report\n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "January 22, 2013",
            "review_content": "\nI absolutely love Vallancourt. He puts much effort into his lectures and truly wants the students to learn engineering. Attending lectures optional because his philosophy is \"if students don't want to attend my lectures, then I have to make them more interesting!!!\". And interesting they tend to be. On the first day he was demostrating how some cans are designed to be pressure vessels and how others at not suited for carbonated drinks. So he built a bicycle valve into the cap of a water bottle, attached it to the bicycle pump, put the water bottle underneath a plastic tub and pumped it up until the water bottle exploded! Unfortunately for Vallancourt, the explosion broke through the plastic tub, and a nice shard of plastic hit him in the face, making him bleed. He didn't whine about the cut but found it funny. So did we.\nHe tries to keep the math/physics pretty simple as his aim is too have students understand all the considerations that much go into the design process; from ethics to innovation, and patents to the truly unexpected (though most lectures involved some sort of audio technology, its no secret he likes electronics and music). You don't have to take notes in the lectures because none of the material is ever tested or quizzed. Though the lectures are optional, he does give extra credit for lecture attendance and requires students to attend the lectures with guest speakers (sorta). Without \"extra credit\" one cannot recieve an A. Some lectures were boring at times, especially one of the guest lectures, but if I had to do it over again I would attend every single one, you always come out learning something you would have never thought to learn on your own. Plus he is really creative with how he designs his lectures, go to them and you will recieve many pleasant surprises.\nMy favorite part about Vallancourt is that he would stay after class to answer any question, explain any point of the lecture in depth, take input on the class or the various things about Columbia, and show off some really cool gadgets. Many lectures would end with me carrying a conversation with him and a friend back to his office (which looks exactly how you would expect it to, torn apart electronics everywhere); coming from a high school where the students and teachers were very close, I loved how open and honest Vallancourt is with his students. He is very chill about grading, if you ever need an extension for a project, just make sure to tell him you are actively working on it and I'm sure he'll give you more time. I felt really bad when I slept in and missed his lectures because he is really one of the best professors at Columbia.\nAs for the project section of the course. I choose earth/environmental engineering and it was absolutely horrible. The professor in charge of that section only showed up for the first day, but didn't even speak or introduce himself. The TA was impossible to understand, gave an elementary school level presentation about the different kinds of renewable energy resources. Each day afterwards the \"lessons\" in the course were presentations that WE gave about a specific topic of renewable energy. I learned some stuff in the course but only because I had looked it up on my own, nothing from the TA or professor. I could have literally learned everything on wikipedia (which is what I did for the most part). The project itself had such potential; the idea was to model a \"smart grid\" throughout a state. We had to look at energy consumption throughout the year, and then subtract the energy production for every type of renewable energy, and figure how often fossil fuels would have to generate electricity, accounting for the start up and wind down times of coal plants. Problem? This information is REALLY hard to find, especially in the two week we had to do it (for comparison, last year's course had the whole semester, as I found out through a report which outlined ways to IMPROVE the course, of which none were implemented). Then they left it up to us if we wanted to use the maximium \"potential\" renewable energy that could be put in the state or the actual amount that is in the state (almost impossible to find!). So I came up with some bogus numbers involving a hypothetical scenario in which all the U.S. Military funding was devoted to renewable energy production.\nThere is a matlab section of the project course (1 hours matlab, 2 hour project) where they \"flipped\" the classroom. So you would watch videos (or read pdfs since its faster) that explain how to use matlab, and then do the homework during the 1st hour of the project course, with a TA there to assist you. I found matlab fun, though sometimes the methods to complete the homeworks were not explained in the videos. The homeworks generally took longer than the time you had in class, so the classroom wasn't truly flipped. Working with friends, asking TAs for help, and doing work ahead of time eases these frustrations.\nLong story short; I loved Vallancourt's portion of the class, hated my project course (don't be disallusioned by my project course experience, others had really good ones, especialy biomedical engineering).\nWorkload:\n Extremely variable depending on the project course. In general, everyone has a matlab assignment due by the next meeting of the project course, and a \"homefun\" due by the end of the next lecture. Sometimes we would be given a few weeks to turn in a homefun if it was a project that involved writing a paper. We only had 3 of those. The weekly homefuns didn't take more than 20 minutes; the project homefuns tooks hours and hours. Fortunately (or unfortunately if you did the work), all of the homefuns are optional, except for the very last one, which requires you to create a Ted Talk. Oddly enough, the final extra credit didn't even include all of the homefuns because some of them got lost. And I'm really not sure if the TED talk was taken into account for our grades because they weren't all graded. So really, no one knows how the grading system works, but the class is definitely a GPA booster. \nThe matlab assignments took from 1-4 hours and were actually pretty fun (provided that they actually teach you which function to use). The project course really varies. I had some friends who had something due every week. I had one ridiculous project at the end of the course that we were given two weeks to do and required over 10 hours from each of my three team mates. Aside from that, we had to give a presentation about renewable energy that took about 5 hours to put together.\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "January 07, 2013",
            "review_content": "\nVallancourt is definitely a very personable and friendly professor. He's easy to understand and you can tell that he loves to teach, making jokes he must have done for years with the same enthusiasm. Additionally, if you have any questions, he doesn't mind answering them. He even moves around exams and quizzes if it's inconvenient for other students. I would encourage buying the book, but it can be very difficult to understand at times. He writes most of his notes on the blackboard and doesn't put them online, so going to class is encouraged. I believe the labs were the most difficult part of this class because we had to build several types of circuits which weren't explained very well in the lab manual. However, the TAs are very helpful if you just ask them. The lab reports are also not graded harshly. \nWorkload:\nIf you're taking this for a professional-level course, I would suggest taking another course because the workload is quite heavy.\nWeekly problem sets (from the textbook)\n3 quizzes (1st one was in-class, 2nd was take-home, 3rd was online and all multiple-choice)\nFinal (cheat sheet allowed)\n3-hour lab each week (Brief lab report)\nFinal lab project( create your own)\n"
        },
        {
            "course_name": "Electronic Circuits",
            "review_date": "August 09, 2011",
            "review_content": "\nProf. Vallancourt teaches this class, need I say more? Hands down one of my favorite professors at CU! He is an absolutely incredible lecturer and is very friendly, funny and approachable. The material is mostly interesting. If it sometimes gets boring, make sure you keep paying attention because the class keeps building on itself and if you do not know the basics you will find yourself completely lost. That being said, if diodes and transistors do not somewhat interest you, you might want to reconsider your major. Do the homeworks with friends, make sure to take notes, and you should be totally fine.\nWorkload:\nWeekly homeworks - manageable. 2 midterms - 1st was in-class, not too bad, second was a take home design problem which I tried to complete on the last night so kinda bombed it. Final - fair\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "July 01, 2011",
            "review_content": "\nVallancourt gives fantastic demonstrations, such as encoding the audio signal from a student's ipod on a laser beam, shooting it across the room, reading it with a photoresistor, and using it to drive a speaker. He'll also dunk integrated circuits in a water bath and watch their transfer characteristics on an O-scope. He's super friendly and encourages questions at office hours, and he'll let you ask him things even if it's not \"official\" office hours. I can't say much about his board skills because I never really went to class. He speaks native English and gives reasonable practice quizzes/tests. The homework is out of the book and is pretty fair. The lab is a bit time consuming but is graded very, very softly, and if you get the dinnertime lab, you're allowed to bring food. \nWorkload:\nFairly light homeworks each week, a time-consuming lab, 3 tests and a final.\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "January 11, 2011",
            "review_content": "\nVallancourt is a a phenomenal professor, easily the best I've had so far at Columbia. His teaching style, and pro-student attitude make him popular among all his students. The material is interesting and relevant, but pay attention as it's easy to get lost if you miss a lecture or two. The workload isn't difficult, although there is a good bit of it. Homework assignments are manageable and to the point. There is a 3 hour lab session every week, but you can easily finish in half that time. The quizzes get harder as time goes on, but he does drop the lowest grade. I would recommend Professor Vallancourt to any engineer, even if you're not interested in the major, fulfill your pre-professional requirement with Intro to EE.\nWorkload:\nWeekly homework assignments, 3 \"quizzes\" (one is take home), final, weekly lab, and a project/report (created during last two lab sessions)\n"
        },
        {
            "course_name": "The Digital Information Age",
            "review_date": "April 15, 2009",
            "review_content": "\nAs a science class to fulfill the Core, this is great. Professor Vallancourt is a great lecturer and the class is pretty easy. Just as long as you can remember basic Algebra, you're set. The subject matter is pretty cool too, an overview of modern digital techonology, giving you a rather nice understanding of how the Computer you're sitting at right now works, without getting into specifics. And isn't that what the core is all about, being able to sound in conversation at cocktail parties?\nWorkload:\n-reading and homework assignment every week or so, which combined maybe take 3 hours max\n-three pretty moderate quizzes. for my semester, he made the first one in-class and the second two take-home\n-a final project. this can be in a variety of subjects from circuit design to computer programming to web programming. I spent maybe six hours total on mine.\n-a optional final that replaces your grade on any of the quizzes if you weren't satisfied with your first grade\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "December 29, 2008",
            "review_content": "\nVery good class and teacher.  Professor Vallancourt definitely knew his stuff when it came to EE, but he made it simple for the class to understand the basics.  At first the material was really easy, covering stuff like resistors which most people had already done in physics.  But beware, only the first two weeks are really easy; new material will eventually come and it is probably new to most students.  People didn't go to class after those first couple of weeks and suffered as a result on the first quiz.  Material is fine if you go to class, just phasors can be a kinda tough.  I found out there was a lab after I joined the class and sometimes it felt like a separate class cause it was 3 hrs. long and had its own homework through lab reports, so keep that in mind.  Grading seemed to be very fair; Vallancourt said he had like 4 different schemes/curve methods, where he would inflate either your quizzes, or final, or whatever you did best in. Final material felt maybe a little rushed.  And the last week ended up being so much work for some reason, the final lab, its report, a take-home quiz, and the previous lab report.  Overall, easy class, but it had its work.\nIn regards to the textbook used, Vallancourt gives homework from the book but gives numbers from all the editions, so get the cheapest edition you can find.\nWorkload:\nWeekly homework set, weekly lab report due, lab mini-project mid semester and final lab project at the end; 3 quizzes (essentially midterms, but worth less) which were fine if you looked at the practice ones, one final (kinda tough)\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "December 30, 2006",
            "review_content": "\nBest. Professor. Ever.\nMade the material interesting, valued student participation, was very funny, always helpful in lab sections and the like. Gave a great introduction to what EE was all about.\nI cannot find a single bad thing to say about his teaching. Anyways, I recommend taking this class because all engineers have to take one pre-professional class anyways, plus this class works its way into the requirements of other fields of engineering too. (BME has this as a req, as does MechE I think).\nWorkload:\nSeveral problem sets, about 3 quizzes, 1 final.\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "December 27, 2006",
            "review_content": "\nProfessor Vallancourt is perhaps the best professor I have had at Columbia.  Firstly, he really cares about teaching and his students.  As a professor who is here to teach--not to use the university's name for his own research interests--he is devoted to not only lecturing, but having his students actually understand the material.  Moreover, Professor Vallancourt brings real world ndustry experience with him, something that is valuable and refreshing in Columbia's almost entirely academic environment.  He is very friendly, understanding, and easy to approach.  He never belittles students or leaves a question unanswered.  Moreover, since students' experience with electrical engineering is widely varied, Professor Vallancourt lectures at an effective pace, and maintains a healthy balance between more difficult material and easier, introductory material.\nMost of all, the class is actually interesting.  In addition to a number of example problems, Professor Vallancourt uses real world examples and ties the coursewell to practical applications very well.\nThe tests were very fair, with a good mix of easier and more challenging questions.  The homework problem sets were very manageable as were the attached labs (some of which were actually fun).  Surprisingly, the lab reports were very painless, and all of the assignments reinforced the lectures very well.\nOverall this was a good choice for a pre-professional course with an outstanding professor.\nWorkload:\nThree tests and a final.Homework problem sets, spread out, probably averages to about one every two weeks.Weekly lab, 1-2 hours long plus a short write up.\noverall very manageable.\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "December 01, 2006",
            "review_content": "\nVallancourt is awesome. He is extremely responsive to the students. His lectures are clear and enjoyable. At times he moves a bit too quickly and has an annoying habit of simply erasing a small piece of the circuit design on the board to replace it with something else to demonstrate a particular concept, not realizing that the students need a second to re-draw the entire circuit. Also, the textbook is a somewhat awful, but Vallencourt makes up for this. Aside from this, this class was very enjoyable. \nWorkload:\nSomewhat heavy. Weekly homework assignments from the textbook. Three \"quizzes\" that are essentially midterms. One is dropped. A lab with required lab reports. A final. \n"
        },
        {
            "course_name": "Circuit Design Capstone Lab",
            "review_date": "May 09, 2006",
            "review_content": "\nIf you decide to brave the Circuit Design capstone lab... you might be lucky enough to have Professor Vallancourt. I have big problems with the instruction in the EE department, but thankfully Vallancourt was awesome.\nHe is super helpful and has a ton of theoretical and practical knowledge about electronic circuits. He makes an otherwise painful senior design class very bearable and gives you a glimpse of how an EE career might be. He tries to give you insight into the electronics industry and best of all, he's next year's point man on trying to fix up what we hate about the EE dept. SAVIOR!\nAlso, at the end of the year he takes everyone out for lunch! SUPER SWEET!\nWorkload:\nIt's at your own pace, but you have a design meeting every week so you better have something to show every week. \n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "May 05, 2006",
            "review_content": "\nEasily one of the most enjoyable classes so far in my experience at Columbia. David is an incredible instructor and amiable guy in a multitude of ways. As you might read in the other review(s), he has a LOT of experience in his field, and it definitely shows. He can answer practically any question thrown at him that is in any way related to electrical engineering, whether it's computers, iPODs, or even medicine. \nHe explains things very clearly, and has an uncanny knack for engaging with the class, using his wit and humor to keep everyone interested. He often goes off on tangents that seem almost irrelevant (he calculated the time it would take the whole to say each bit of an iPOD hard drive once, and that's just one of many @_@) but it only ADDS to how incredibly funny and interesting the class is. \nHe responds very quickly to emails, and tries his best to stay on very good terms with his students; he's highly flexible with his schedule, and he shows compassion for students who might be struggling and is always willing to help them out.\nI would definitely recommend this class to anyone, even if you aren't necessarily majoring in something E.E.-oriented. You'll learn ALOT about the way practically anything electronic works just through the fundamentals taught in this course.\nBear in mind that I'm writing this review two days before the final for the class (I should be cramming, shouldn't I?). I don't have a grade yet, and even if I were to score an excellent grade on the final, my grade wouldn't be particularly impressive (B-B+?). Just to show that there's no grade bias here. He really is an amazing guy. \nI might have forgotten to mention some things. I'm sure someone else will get to it in another review; I doubt anyone *truly* dislikes David.\nWorkload:\n1 relatively simple problem sets (4~8 questions) each week except weeks of quizzes of about 1-2 hours each. 3 quizzes, comprised of half very simple conceptual questions and half \"in-depth\" problems (which still aren't difficult if you know what you're doing). Samples posted for quizzes and finals, and recitation times galore before each quiz.\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "January 26, 2006",
            "review_content": "\nProf. Vallancourt is intelligent and funny (true, his engineer jokes are not lame at all!) with over 20 years of experience in Electrical Engineering field, as a professor at Columbia and an engineer for HP. I had him for Intro to EE (E1201) last semester, and this semester I am taking his E3331. \nIn E1201 he starts off slowly, going over stuff such as voltage, current, ohmÂ’s law. If you did AP Physics E & M you donÂ’t have to go to the first 5 lectures. But if you havenÂ’t, donÂ’t worry, guy explains stuff in detail and answers your questions crystal clearly. Later in the class, stuff gets a little complicated, but if you show up and pay attention every time there should be no problem. Or you can always go to the office hour, which really helps. \nHe also feels for his students. For example he provides us with 3 different lab sessions and 2 recitation sections trying to fit everyoneÂ’s schedule. And even if you still canÂ’t make it to the recitation, you can always send him emails about whatever questions you have, to which he replies by noon on the second day. Also on the quiz if you misunderstood a problem and did the problem as you understood it, heÂ’ll try look at the problem your way and see if you get it right. Therefore I still got full credit on the 2 problems I misunderstood in a quiz. \n\nWorkload:\n1 problem set every week, consisting of 3~5 problems, usually takes about an hour. \nA 3-hour lab every week. Everybody finishes in at most 2 hours. \n3 quizzes, on the third one he gave us 40 pts worth of bonus points. \n1 final\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "December 22, 2005",
            "review_content": "\nProf. Vallancourt not only knows his stuff (with many years of experience in the field, not just teaching), but he also has a very friendly and personal manner of presenting the material (incidentally, even his more \"technical\" jokes are actually funny). He is able to supplement (and sometimes even supersede) material from the textbook with industry \"tricks\" and real-life examples, which makes going to class fun and rewarding. Finally, Prof. Vallancourt is always willing to take the extra step when it comes to giving his students additional help: he is very approachable not only in office hours, but he will also go out of his way to help at other times if necessary; additionally, he always makes sure to schedule any supplementary events (i.e. review sessions or lab time) in such a way that EVERYONE can attend, even if that means that he ends up having to lead a lot more sessions than are typically held. Overall, I get the feeling that Vallancourt genuinely cares about his students learning the material, and is willing to go out of his way to make sure that it happens.\nWorkload:\nOne problem set a week, usually not too time consuming. Three midterms of varying difficulty, but with generous curves when required. Three hour lab session each week, with short lab reports for each. The final seemed very fair.\n"
        }
    ]
}