{
    "prof_info": [
        {
            "prof_name": "Arvind Narayanaswamy",
            "prof_id": 5521,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Heat Transfer",
            "review_date": "May 09, 2016",
            "review_content": "\nI should begin this review by saying that Arvind is clearly a brilliant researcher and very hard working man.\nHowever, I think there is a baseline level of organization and preparedness which is missing from Professor Narayanaswamy's class. The files and lecture slides he posts are very disorganized - they often repeat things, have material that was never covered in lectures or homework, and have file naming conventions that are very confusing. It makes it a struggle to even teach yourself the material after you're not able to follow the lectures.\nArvind clearly knows the material by heart, and is very excited about it, and even makes a sincere attempt to teach you the real-world applications. That's nice and all, but alltogether the lectures are often unclear on what you'll actually need to take away or write down.\nThe homeworks appear to be written by Arvind himself, which is a nice gesture, but it ends up causing a nightmare of corrections on problems that do not provide complete information or state what assumptions need to be made. On multiple occasions, corrections were made on the day before (once even the day) the assignment was due. You might learn to put it off until later in the week, like I did.\nThe tests are very similar to the homework. I didn't think they were terribly unfair, but they were still sometimes unclear and many problems did not provide pictures or diagrams to make clear what was going on. Some of them are very math-heavy, but others have been purely conceptual. The averages are very low and the standard deviations very high.\nYou probably won't have much choice in what Professor you have for this course, but you might consider trying to make an extra effort to keep your notes organized for this class, because by the end of each topic (and especially by the end of the semester) you will have a huge mess of scattered material, and only the homeworks will make clear what you actually need to take away.\nWorkload:\nWeekly problem sets (very time-consuming because of unclear lectures & problems)\n2 midterms (difficult)\n1 final (cumulative)\n"
        },
        {
            "course_name": "Heat Transfer",
            "review_date": "August 06, 2015",
            "review_content": "\nThis course is really really hard. It kills the meche class.\nThat being said, Arvind made the topic interesting and cared about the students. Many times I ran to his office hours and he would help through the topics, and give me the encouragement I needed. \nHe can be a bit of a hard ass, and sometimes doesn't realize he is a lot smarter than most of his students, but he is fair for the most part.\nWorkload:\n2 midterms, psets every week, and an impossible final\n"
        },
        {
            "course_name": "Heat Transfer",
            "review_date": "June 22, 2015",
            "review_content": "\nBest mechanical engineering professor in Columbia. Period. Cares about his students, and makes certain that no one is left behind in every lecture. He even told us one of the final exam's questions so we could work on it at home! \nIt doesn't happen very often when intellect meets clarity, but all will experience those qualities in every lecture Prof. Narayanaswamy has to offer. I highly recommend Arvind! It pains me that he doesn't teach more classes-take and prioritize every class he has to teach!!\nHis notes are also extremely well thought out. All of them are organized neatly and uploaded on Courseworks. Given his extraordinary organization and delivery, students have only themselves to blame if they do less than well in his class. \nI would not change a thing about him or his class. \nWorkload:\nManageable yet enlightening. Comprehensive but reasonable. 1 hw set every 1-2 weeks (except for breaks).\n"
        },
        {
            "course_name": "Advanced Heat Transfer",
            "review_date": "January 23, 2015",
            "review_content": "\nArvind is a cool professor. We can tell from the way he teaches, that he actually cares if the students understand the concepts or not. At the end of each concept, he tries to clear each and every doubt students have.\nIt is a very Math intensive course. Had 7 or 8 assignments, final project and a final exam. Most of the assignments need Python. Prior experience with python would definitely help a lot. Final exam was easy and straight-forward. Project was hard and required lot of coding. \nWorkload:\nIt is a 6-level course. So the workload is huge accordingly.\n"
        },
        {
            "course_name": "Heat Transfer",
            "review_date": "June 07, 2014",
            "review_content": "\nHeat Transfer stood out as one of the more interesting classes the semester compared to the other MechE class I had because of the clear real-world applications it has. While thermodynamics was often very abstract, Arvind (everyone calls him by his first name) eagerly seeks actual situations where Heat Transfer is used. Though the class notes can sometimes be difficult to follow, most of the material is in the book, and the professor is usually willing to answer good questions. This is one class that I was able to engage in and occassionally even searched for relevant material outside of the required coursework. Assuming this is a required class for you, it's actually pretty interesting.\nWorkload:\nThe class can be tough, especially a couple problem sets, but for the most part the book provides similar examples and most of the time you're just looking up specific equations to use. Tables are used for nearly every problem about 2/3 of the way through the semester, meaning that as long you have the right general approach to the problem you're over halfway there. 10 problem sets, 2 midterms, 1 final. Overall, not as difficult as I would have expected, but it can be challenging to fully comprehend at times.\n"
        },
        {
            "course_name": "Solar Thermal Engineering",
            "review_date": "January 27, 2014",
            "review_content": "\nThis course, as mentioned previously by another reviewer, is roughly divided into two parts. The first part is basically an introduction to his research area in thin films and radiative cooling. At the end of this section we were given a group project.The second part, is on thermal analysis of flat plate and parabolic rough collectors. Again, at the end, we were given a group project.\nArvind is always ready to answer doubts during and after classes, but he does expect students to know certain concepts. I would strongly advice to go over basic engineering math and heat transfer for this class. ALL ASSIGNMENTS AND PROJECTS INVOLVE CODING. He recently moved from MATLAB to Python. Get to know at least the basics of Python before starting this course and you'll be able to pick up the language easily as the course progresses. \nAll in all, I would recommend this course to anyone interested in solar thermal engineering and modeling of such systems\nWorkload:\nTwo group projects, two assignments. All using Python. Choose your group wisely.\n"
        },
        {
            "course_name": "Solar Thermal Engineering",
            "review_date": "January 23, 2013",
            "review_content": "\nThe course is roughly split into two sections, one being the beginning spherical geometry part, the other being that of heat transfer, which is after the midterm. The materials for the first half will be tested through a relatively easy midterm utilizing the understanding rather than the derivation of the materials that he requires understanding, and the second half of the course will be tested through a final project, which features MATLAB coding, and will be the sole interest for Arvind. No final exam.\nWhat's worth mentioning about the course is the lack of management of the materials. The professor seems to be more interested in making things reasonable to himself than the rest of the class. He definitely requires interaction with students, but on rather weird occasions. If you'd took the heat transfer course of his before, it could be much easier, though.\nP.S. There were only two sets of homework, both involves derivation and MATLAB/Mathematica coding and will be graded by the grader together with the midterm. As these only appear at the beginning of the semester, make sure to contact the grader/TA if you've got a problem, since Arvind himself doesn't really that much welcome conditions that you obviously have no idea what he was talking about.\nWorkload:\nVery large in the beginning month, after which basically nothing. The project is quite hard, though. Make sure you pair up with the right person.\n"
        },
        {
            "course_name": "Heat Transfer",
            "review_date": "July 01, 2011",
            "review_content": "\nNarayanaswamy is pretty good during class. His boards are fairly well laid out, he mostly stays out of your line-of-sight, and he requires a middling amount of audience participation (which passes the time). His handwriting's size and legibility are generally unimpeachable. For a non-native speaker of English, he is very intelligible. However, during office hours, he is extraordinarily hostile, and obviously wants you to leave him alone, ie. leaves his headphones in, doesn't make eye contact, and gives brief, grunt-like replies to questions. He is also quite a quick mathematical study, and has very little patience with those who need more explanation than he. The tests were pretty soft and were therefore graded with vast harshness in order to create a curve. A small math error would cost you 20% or more on a test. If you grade grub even a little, the TA's will give points back. In practice this means that the average floats upwards in the weeks after a test, which is very unpleasant. \nWorkload:\nIn the top 5 toughest classes of your undergrad MechE career\n"
        },
        {
            "course_name": "Heat Transfer",
            "review_date": "May 31, 2011",
            "review_content": "\nThis class starts out with some unfamiliar concepts, so it can seem a bit challenging at first. It is very important that you ask questions and make sure you understand everything for the first midterm, because this is the hardest part of the class. If you understand the new concepts from the first month of the class, the rest of the class will be a breeze.\nArvind is very organized and a very good lecturer. Go to class because if you don't, for every hour of class that you miss, you will spend 5 hours at home trying to make up for it, and because the material can be difficult and confusing, your efforts might be futile. He goes over things slowly and makes sure everyone understands everything before he moves on. Pay attention to the examples he does in class, because he assigns homework that if very similar to those examples, and can sometimes repeat class examples on exams. The first half of the class is the most dynamic, so he can come up with a variety of questions. However, the second half is so complicated that he sticks with a few examples, and doing the problems comes down to identifying the type of problem and then just following the protocol that he assigned in class. \nThe only problem I had with him was his arrogance. He insisted on going over specific concepts from calculus and diff. eqs. and if we did not remember them, he would be very condescending. Also, although he would encourage questions, if someone asked a \"stupid\" questions, he would make sure to let us know that it is a \"shame\" that we still do not understand the given topic. \nHis tests are fair. Again - if you do the homeworks and look over lecture notes, you should do fine (getting scores in the 90s is normal). If you put in minimum effort, you should be able to beat the mean, as it can get very low. I'm not sure why this is the case, but his tests seem to be either hit or miss, and it seems that a lot of people miss so the mean can get as low as the 50s. \nWorkload:\n10 very long and difficult problem sets worth 20% of the grade. I just wanted to high five myself every time I finished one. but, chances are if you can do them all no problem, then you are ready for his exams and don't need to study much.\n2 midterms 20% of the grade each. first one focused a lot on theory and was somewhat difficult. the second one was very easy (plug and chug). \none final 20% of the grade. very easy and covered the major topics that i expected it to cover\n"
        }
    ]
}