{
    "prof_info": [
        {
            "prof_name": "Adam Spry",
            "prof_id": 9586,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "April 13, 2011",
            "review_content": "\nAdam is a good UW professor. He's funny, clear, and definitely amusing. I enjoy having him, however, he is a bit of harder grader and seems to have high expectations of his students. He does let you rewrite your papers if you are not satisfied with the grade if you submit a one page paper with why you think it went wrong. Big plus. He's not always the most responsive to e-mails though. I haven't had any problems with him at all. Genuinely, he's a nice guy and I would suggest him to anyone. \nWorkload:\nAverage work, nothing really extra for UW. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 07, 2010",
            "review_content": "\nAdam is a great guy and awesome UW instructor.  He's really laid back, while also being extremely passionate about art, music, literature, and of course, writing.  In UWriting, you can pretty much write about anything you want - as long as you can relate it in some way to the seed text.  Because Adam seems to know a little bit about everything - and a LOT about some things (i.e. Native American art and literature) - he serves as an excellent resource throughout the writing process.  When he thinks your topic is too narrow, or too broad, he suggests books, movies, and articles that really help guide your research.  Moreover, throughout the revision process, Adam goes out of his way to structure his criticisms in a very positive light.  When workshopping in class, it's often hard provide constructive criticism to your peers, especially when you know someone's paper needs a LOT of editing.  Yet during conferences with Adam, he focuses on not only what needs to be fixed, but also on what he likes.  He gives really specific instructions with how to improve your paper, from nitty gritty citations to broader argumentative techniques.  Even those who don't think they need much writing help can still learn a few useful things from the course.  Some classes do drag on a bit, but that's less his fault than the it is the fault of the course itself.  If you have any control over who's your UW instructor, I would definitely recommend Adam.  He's chill, he's smart, and he'll totally make you a better writer.\nWorkload:\nJust as many papers as other UWriting classes, but from what I've heard, he gives more time for revisions and whatnot.  Two 5-7 page papers (each of which has at least one draft prior to the final one), one 10 page research paper, and a retrospective assignment, which just requires you to comment on an already written paper.  \n"
        }
    ]
}