{
    "prof_info": [
        {
            "prof_name": "Norman Christ",
            "prof_id": 853,
            "total_reviews": 32
        }
    ],
    "reviews": [
        {
            "course_name": "Accelerated Physics I",
            "review_date": "May 17, 2013",
            "review_content": "\nTHE GOOD:\nProf. Christ is an unbelievable mathematician and theoretical physicist. He is able to fill a 2 hour lecture slot entirely by deriving a variety of physics formulae from minimal notes. His personal conceptual understanding is likely unrivaled at Columbia. If you have a very very large background in math, I'd imagine talking with him may be inspiring. Another good thing (that may a point of contention to many) is the workload. Given the unbelievable amount of material covered by the class, the workload is \"fair.\" (Keep in mind that this may mean 20 hours devoted to a single problem set in a week). \nTHE BAD (oh boy is there a lot):\nWhile the workload is \"fair\", it is massively undervalued. There are 12 problem sets consisting of around 9 questions each worth ~50 points. These account for ~15-20% of the grade despite the fact that they take up about 90% of the time you will spend working on the course. The lectures are all but useless to prepare you for homework and tests. You learn a lot more by skipping them and devoting 4 hours a week to reading the textbooks (though you'll need to read it a lot more). As we got into more advanced concepts (general relativity, and quantum mechanics) Christ assumed an unbelievable background in mathematics. Realistically, Calc 3/4 and Linear algebra should be prerequisites for the class. While he briefly introduced the concepts, it was by no means a sufficient introduction for the material covered. \nOnto the tests. Both midterms were reasonable. During the first semester, the mechanics midterm was simply too easy. The mode was a 100. Second semester the midterm was fair though the grading was inconsistent at best. Appealing for points made little difference though. The Finals on the other hand were another story. The final first semester was atrocious. The mode was a 12. I went into the final with an A- and ended the course with a B. I don't know what I got on the final, but it certainly should not have counted. This is my opinion and the opinion of almost everyone I've talked to in the class. The final this past semester was certainly an improvement, but the final question (out of 3) was nothing short of impossible. \nOverall, I can't recommend this course. You will hardly learn more material, and you almost definitely won't learn it more thoroughly. While Christ is an intelligent person, he is an awful instructor.\nWorkload:\nUndervalued\n12 problem sets (7-10) questions (35-50 pts each) (take anywhere from 6-20 hours)\nA midterm (fair; average around a 60-70)\nA final (exceptionally hard and difficult to prepare for; average is not a useful metric but the median first semester was under 20)\n\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "January 06, 2013",
            "review_content": "\nThis is easily the most difficult introductory course in Columbia. It requires mathematics well beyond what is expected of an incoming freshman. This class should have Calc III, IV and Linear Algebra as prerequisites if you really want to gain a comprehensive understanding of the material. All the other reviews are quite accurate, expanding on Prof. Christ's incompetency as a teacher and the very difficult material.\nNorman Christ is an intelligent man, no doubt. However, he fails miserably as a teacher. He is very disorganized, moves way too fast and makes many mistakes on the board (which is infuriating because you spend half your time figuring out the mistake instead of following the derivation). To Christ's credit, he is willing to spend time with his students at office hours and explain things again. Though repeating the same poor explanation doesn't do you much good. Prof. Christ only teaches theory in class, and spends a lot of time on derivations. The worst part is that you don't even know what he's trying to derive till he's finished. There is little to no connection to the material taught in class and the the homework from Kleppner and Kolenkow. Christ only does a select few easy problems in class - very different from the difficult problems in the textbook. If Christ concentrated more on problem solving techniques, the class would be much better.\nThe exam questions are similar in difficulty to the problems from the textbook. This isn't a good thing since it takes a good two hours to solve some homework question after reading the chapter multiple times.\nI had an A till the final in this class, but ended up with an A- after the final because I didn't study anywhere as much as I should have (my fault, I know. I had too many honors courses on my plate). I only did well on the first half of class because I had learned that stuff in school. Once Christ started relativity and rotational dynamics (mainly precession), I was lost. I shot myself in the foot with this course and am not taking 2802 next semester.\nI love physics. Never in my life did I dream that I would one day write such a horrid review for a physics class. You will probably not listen to my review and will take Accelerated Physics (just as I didn't listen to the other reviews when I joined this class). Fortunately, it's a good experience. You will meet some amazingly smart people; you will be challenged. But know that this comes at the cost of a lot of time and strain.\nIf you do take this course, my advice to you is this:\n1. Read the textbook ahead of class. Kleppner and Kolenkow is a very dense book. So you might need to read a chapter multiple times and look up stuff online.\n2. Solve the problems without discussing with friends, even if it takes you 20 hours.\nIf you have the time to put into this class, take it. You will have to self study almost all of it since Christ is hopeless. I wouldn't recommend this class unless you are a physics major. Just know that 2800 will be the focus of your semester if you want to do well.\nWorkload:\nExtremely difficult\n12 Assignments (each takes 10-15 hours + reading textbook chapters)\n1 Midterm (easy - medium difficulty)\n1 Final (excruciatingly difficult - I just sat there staring at the paper for 3 hours)\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "April 23, 2012",
            "review_content": "\nExplanations for basic content are excessively basic, explanations of difficult content are almost entirely intelligible. Information is often provided not in terms of general cases (which would actually be useful), but in terms of specific scenarios that likely are of little use when solving other problems on similar subject areas. Generalized terms are presented far too generally, concepts and usefulness getting lost in mathematical jargon and excessive notation.\nAssignments are excessively difficult, often requiring much knowledge or intuition beyond that which is presented either in the textbook or presented in class. For quantum mechanics, the skills required to solve problems extended far beyond the knowledge of even the more advanced students. \nHow the course could be improved:\nFocus less on simply covering material and more on explaining content. Provide conceptual context for content by explaining the significance of a finding or equation. Give equations in general terms, and show how one can actually utilize these equations to solve problems. \nPerks:\nGenerous grading curve, generous extension-granting policy regarding problem sets\nOverall:\nAn extremely difficult course requiring extreme amounts of independent learning, which overall did little to stimulate my interest in physics, or contribute to my ability to solve physics-related problems. \nWorkload:\nWeekly problem sets (6-12 hours each), 1 Midterm, 1 Final (both exams curved, average ~50-60%)\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "March 06, 2012",
            "review_content": "\nThere is nothing quite like the agony of Christ's Accelerated Physics class, esp if you are not extremely fluent in calculus. Lectures consist almost entirely of mathematical derivations and proof, rather than conceptualization or applications. As a result, if you do not come into this class with a solid conceptual knowledge of the material (including E&M; and quantum), you will likely encounter a great deal of difficulty learning the physics that you are expected to. Furthermore, the problems he uses in lectures and for homework are largely based on various insights and assumptions you are expected to be able to make, rendering the equations that are presented in class albeit useless (not to mention the fact that they are presented in the form of broad abstractions, whose applicable forms are deeply shrouded in mystery to begin with). Homework from the textbooks is largely disconnected from the material presented in class, and requires significant independent relearning of the same material. Class is mainly an exercise in theory, rendering most students confused in terms of the applications of the material. Final conclusion: be prepared to spend countless hours teaching yourself from the textbook. \nWorkload:\nWeekly problem sets of 8-10 problems (~10 hours per problem set), 1 midterm, 1 final. Curved generously, but expect a low score.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "December 05, 2011",
            "review_content": "\nImportant point about this course: it doesn't get hard until about November. Until then, you'll feel like you're doing slightly more difficult versions of problems you already knew how to do, and it will be manageable. Then you'll get into damped oscillators and relativity, and you will have to actually learn new things and read the book/sometimes watch videos online. The first two months, you will laugh at all the CULPA reviews of this class--just be warned that it only gets tough towards the end.\nWays to improve the course:\nRather than going into so much detail explaining how different physical results are mathematically derived, it would have been helpful to learn some techniques for solving some of the problems that were completely new material, such as with damped oscillators and relativity, and even momentum with calculus.\nBest aspects of the course:\nIt allowed students who already had a strong background in basic mechanics to learn more advanced topics. I would consider basic mechanics to include kinematics, forces, momentum, energy, and basic rotational motion. The advanced topics in 2801 that I enjoyed were damped oscillators and relativity on the physics side, and incorporating more advanced math such as linear algebra, complex numbers, multivariable calculus, and programming.\nComments about necessary background for this course:\nThe description of the kind of preparation needed of the course is severely understated. A 4 on BC Calc will NOT get you through this course comfortably. I felt comfortable with this course having taken a semester of linear algebra and the equivalent of two semesters of multivariable calculus prior to taking 2801 (at my high school we took Calc III and IV in one semester). I also had several years of programming experience, which made the MATLAB questions doable. I can't imagine taking the course without a strong background in at least two of these (linear algebra, multivariable calculus, programming experience).\nThe Good about MATLAB in this course:\nI thought it was good for physics students to get some experience using programming/software to demonstrate physical concepts, and the idea of numerical analysis rather than direct integration also provided insight as to the accuracy of results in the real professional/academic world of physics. I don't feel it's strictly necessary for a physics course, and can be extremely challenging and frustrating for students with zero prior programming experience, particularly non-engineering students. If MATLAB is to be included, there needs to be WAY. more instruction on how to use it.\nThe Bad about MATLAB in this course:\nHonestly, I think if computational material is to be used in this class, there should be a prior or co-requirement that some kind of programming class be at least highly recommended. There isn't enough time to fit a proper and useful introduction to MATLAB in this course, and even if the professor could manage it, it would be unfair to add that to this course because students signing up for it would be basically taking the equivalent of an additional class, which they probably didn't expect, ESPECIALLY if they weren't warned about it.\n\nWorkload:\nOne tough problem set every week, 8-10 problems (10 over breaks, 8 during normal weeks). It's not hard to finish on time, but starting early in the week is really helpful, since often it takes time for the material to sink into your brain. It's due every Thursday and basically assigned every Thursday, although the new set is released on the Tuesday before the current one is due. I've never started later than Monday. IT IS ESSENTIAL TO WORK IN A GROUP. Find a group FAST in the beginning of the semester, even if the material doesn't seem too difficult then.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "May 29, 2011",
            "review_content": "\nProfessor Christ is a very nice man who is also very knowledgeable about physics and math. He is willing to explain concepts as many times as you ask him to (not necessarily in class), but he is not the most gifted expositor.  \nHis lectures revolve around proofs and the proofs are done using a LOT of math (see previous reviews), which you the student are assumed to know.  If you don't know the math, the derivations he demonstrates on the board can be tough to follow. Some days you'll get lucky and he will have a cheesy demonstration for all of you to watch. He'll even let you play with some of the demonstration after lecture, which can be quite fun.\nThe problem sets are probably the most challenging part of the course.  Depending on how many people you work with, and whether or not there are geniuses amongst you, they can take anywhere from 3 hours (a really good week) to longer than you've slept the past week.  They're 8-10 problems and there are 24 of them over the course of the year.  For mechanics and E&M;, the lectures don't really assist with doing the psets, but for QM, he writes his own problems, so the lectures helped a lot more. All the problems were 5 points each, graded for correctness.  It doesn't matter how long each problem is, it's still worth 5 points.  Note: the problems he writes on his own are usually proofs that he showed you in class or very similar to something he showed.\nThe midterms and finals were easier than the psets, but it is hard to anticipate how hard they're going to be.  He give you a practice midterm/final and a review session (very useful) the week beforehand, which is good practice, but isn't useful for gauging the difficulty of the actual exam.  \nAnd as various other reviewers have noted, the curve is very generous.  For the first semester (when the class was 40+), he used the full spectrum of grades for the midterm (and presumably the final), but for the second semester (when the class was ~20), a 19/100 on the midterm was a B.\nOverall, you'll learn quite a bit, and be frustrated a decent amount, but don't expect it to be an easy way to get a physics requirement done.  Office hours are useful, problem sessions aren't, pre-exam review sessions are, and classes can be.\nWorkload:\n24 psets, once a week, totaling 191 problems this year; a midterm a semester; and finals\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "May 01, 2011",
            "review_content": "\nBest class of the year! Tough, but fun if you like hardcore physics with math! Lots of advanced math (but math majors might find the math not rigorous enough but this is by no means easy) with honors math B/calc4 stuff thrown at you in 1st month of class in c2801. there will be QM in c2802. Christ's treatment of QM is almost entirely mathematical (which is fun but sometimes i just don't know what physical thing is going on). Read the book to understand the physics of it. \nChrist is knowledgeable and humorous :D\nWorkload:\nmechanics and em psets are crazily fun (difficult). QM pset is ok and short. 8-10 problems every 9 days (24 psets in total for c2801-c2802)\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "April 13, 2011",
            "review_content": "\nThis review generally addresses the points made in other reviews and provides some advice for those planning on taking the class.\nChrist often makes minor mistakes at the chalkboard. However, they are largely inconsequential (such as forgetting to bring a factor over when re-writing an equation) and are quickly fixed.\nThe demonstrations were indeed lame, but they were welcome and sometimes humorous diversions from actual presentation of material.\nContrasting the ridiculously easy entrance exam and the math actually involved in lecture, you will feel very misled as to the difficulty of the class. However, the math involved seems harder than it really is. You shouldn't get bogged down in trying to understand it all formally, but rather focus on how it is used.\nUseful math concepts (in roughly chronological order):\n1st semester: vectors, differentiation/integration, polar coordinates (and relevant calculus), tensors, four-vectors.\n2nd semester: gradient, divergence, curl, Dirac delta function, Levi-Civita symbol, basics of complex numbers/vectors (conjugate, magnitude, ...), linear algebra of complex spaces (Hilbert spaces, operators, orthonormality of bases...)\nFinding a group to work with on homework is key to success in the class. Homework is graded on accuracy, not completion, and every single problem is graded. Yes, you can get a zero after hours of work on a problem if you did it completely wrong. I completely disagree with the review that said you can get near-full credit by ignoring problems. You will get no credit that way.\nThere is quite a lot of required reading. I didn't do any of it. You should. If you pick random equations through the textbook for your homework you'll get confused, since everything within a chapter (in both Purcell and Kleppner) is largely the same thing over and over again in greater and greater detail.\nVery important: Read the first chapter of Kleppner. Christ skips it. Read it. It contains important mathematical preliminaries which give very useful information on polar coordinates and differentiation in particular.\nThe midterm and final exams for both classes are easier than the homework problems. The curve is extremely generous. He will use the full spectrum of grades for the first semester's exams, but he will not go below a C+ on the second semester (unless you manage to fail spectacularly in a hitherto unseen manner).\nAP Physics will get you a long way here. Rotations and relativity were the only new concepts first semester (though other concepts were covered in greater detail). Almost everything second semester had a completely new feel due to the vector calculus involved.\nSem1: Mechanics, relativity\nSem2: Electricity and magnetism (first half), quantum mechanics (second half).\nTry not to miss lectures, but don't panic if you do. I missed about half of them each semester and still pulled off an A-.\nThe problem session is largely useless. It consists of a TA redoing the homework problems you ask by following the solutions that are published to every problem set. You could just as well look at those solutions for yourself.\nIn short: you could easily do well in this class if you actually do the readings along with his suggested schedule and start the homeworks early, and go to classes. But as far as I know, none of us in the class honestly did that. And you could easily do well without doing any of the above because none of us did that.\nRandom note: studying many hours for exams in this class is nearly useless (though the first few hours can be very valuable). I have never felt like I could have gotten a better result on an exam had I studied an additional hour. (But definitely do the practice exams at least, those pay off, and some concepts are almost exactly the same on the actual tests.)\nAlso, I do somewhat regret taking this class. I don't feel like I learned much, and it was irrelevant to my intended course of studies to begin with. If you're taking this course as an ego trip because you \"always took the hardest classes\", stop and realize that that is not what college is about and reconsider, or you will most likely regret your choice later.\nWorkload:\nReadings: heavy, ignore at your own peril.\nHomework: find a group or else.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "January 22, 2011",
            "review_content": "\n I came to Columbia with grand hopes to become a physics professor. Math and science had always been my best subjects and I was truly enthusiastic to find where the Ivy League would take my passions. However... Norman Christ singlehandedly shattered all of my aspirations and dreams. He has the charisma of a wet noodle and the teaching ability of a dead giraffe. Please believe me, this review is not a joke. It is the sad sad truth. \nOn the first day of class, Christ extravagantly states that he loves to be and will be CRYSTAL CLEAR. This is a LIE, meant to draw in naive prospectives. Trust your instincts. If you find his first lecture to be confusing, drop at the first opportunity. Seriously, it's not worth damaging your foundation. Trust me, your IQ WILL DROP at least 50 points after the first week. You will emerge dumber, less critical, and most importantly less confident of yourself after this course. Even if you don't believe me, why risk it MAN? \nA 1st year physics major reading Kleppner and Kolenkow, Christ's preferred textbook for the class, is comparable to a blind hobo trying to read a half Sanskrit half French dissertation in a dark tunnel. Naturally, Christ told us several times that he loves this book and demanded it be republished. \nHis physics demonstrations are lame, awkward, and will never get girls- much like Christ himself. It is made worse by his unrelenting grins and sense of self-satisfaction even when he fails miserably.  \nIf you ever dare to ask him to be clearer in his lectures, he will give you a thousand reasons that runs the frame of 15 minutes telling you how it is better to stay the way he already is. He will logically disrepute your request for clarity.....\nGood luck to the skeptics who will still take this course because of peer/parental pressures or of Freudian phallic insecurities. \n\nWorkload:\n10-11 Problem sets ranging from 10 to 12 hours of work load, on top of desperate group work and conferencing until 2-3 in the morning before it is due. \nMidterm: Easy first question, tricky second or third question, answers based on Christ's own physics assumptions you can never reasonably pick out\nFinal: Almost everybody fails, so don't worry. You will not fail as a result. \n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "April 08, 2010",
            "review_content": "\nI'll start by saying the other reviews of this professor, and in particular this class, are very accurate.  I took 2801-2802 as a freshman more than five years ago and like a lot of other people this class,especially the second half, remains one of the most frustrating experiences of my life.  There are however still a few points worth adding.  \nThe main problem is that Christ expects a significant level of preparation beyond the AP curriculum.  If you're mathematical training doesn't extend beyond BC Calculus do yourself a favor and take the 1600 sequence.  If you don't, you will add a lot of stress to your life but you won't learn much physics.  I managed to pull an A in 2801 and an A- in 2802 by relying on Physics C knowledge and understanding maybe 25% of Christ's lectures, which is less impressive than it sounds since both classes were curved to an A- and I routinely received near full credit on problem sets by ignoring the problems I couldn't solve.  At the end of the year I had learned almost nothing.\nFrom a pedagogic point of view, I would only recommend this class if you have already learned all of calculus, the core material of linear algebra, and have experience doing rigorous proofs.  Extra knowledge of geometry and elementary asymptotics would also help.  You could probably get by taking Calc III/Honors Math concurrently with 2801 and then Calc IV and Linear Algebra with 2802 but think hard about whether you want to.\nAs others have said Christ is an enthusiastic and super-nice if awkward man who seems to have good intentions.  The summer before freshman year he mailed a letter to those of us with the prerequisite AP scores welcoming us to Columbia.  This did nothing to ameliorate his teaching.  This man is a legitimate genius and he impressed me many times with the depth of his understanding of physics but his decision to teach introductory physics as if we were grad students meant that most of the time most people had no idea what he was talking about.  I've since had an easier time taking graduate math courses that covered much harder material at a faster pace.  The difference was that I was actually prepared for them.\nThat said, this would be an excellent course for someone who does have the appropriate math background.  If you're a sophomore/junior math major or you learned real analysis at math camp then by all means go for it.  I would love to take this class again with the training I have now. \nWorkload:\nLike everyone else says.  A lot.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "February 16, 2010",
            "review_content": "\nThis class is basically AP Physics C all over again.  Which is a blessing, since Christ's lectures are utterly unintelligible.  He makes things needlessly complicated, and it doesn't help when he makes mistakes and has to backtrack.  The lectures are pretty much worthless; my only impetus to go was the vain hope that I might learn something.  Theoretically, I did learn relativity, but only after I read the chapter and had my father, who teaches physics at USC, explain everything to me twice.  \nChrist is a nervous, kind of mousy guy who failed completely at gaining any respect from the class due to his ability (or lack there of) as a professor and unconfident air, underscored by his mistakes.\nI'd recommend taking this class because it's not terribly taxing as a rehash of AP Physics C: you won't actually have to learn anything (except relativity).  I wouldn't recommend taking it for the same reason, i.e. don't if you're hoping to learn something.\nWorkload:\nReasonable: Weekly problem sets of 6 that don't take more than an hour or two, 2 midterms, a final.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 12, 2010",
            "review_content": "\nNorman Christ is, indeed, a very knowledgeable professor, and a very capable physicist. Substantiation? check out his Wikipedia page. He is also cute in a \"what a smart guy/yoda\" sort of way.\nBut to make your decision about the class you need to know these:\nDo not be fooled by how easy the first two lectures are. Delusions of grandeur for many people.\nHis lectures can often be inscrutable. You will be able to follow the math, but you'll need the book to fully grasp the concept.\nI did not go to problem sessions. Make friends, preferably those who do go. And live on your floor. Physics brings your floor, (the 2 engineers and 2 physics majors), closer.\nI still don't know how to study for this class. Good luck with that.\nPractice midterms are never really like the actual midterm. But do them anyways. Can make you feel better about yourself before the midterms.\nBeware of the Norman's third problem on every midterm. Although Norman is a saint, they are like the Third Reich, even if you aren't Jewish.\nYou are pretty much guaranteed a 67 because the first two problems are usually easy. And you are smart enough to correctly spell your name on your test.\nKnow your math.\nReality: A decent grade is possible if you work for it. \nWorkload:\n6 problems a week\n2 midterms (one third reich each). \n1 final, hard, but actually doable.\n\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 01, 2010",
            "review_content": "\nChrist seems like an extraordinarily knowledgeable professor with a passion for his subject, but his lectures didn't manage to convey that knowledge to the class. Lectures were often very difficult to follow and there always seemed to be topics or concepts we didn't cover--we spent all our time on solving problems or proving equations, and not building any conceptual framework for what we were learning. I ended up teaching myself the first eight chapters over fall break, which is the only reason I passed the second midterm. (On the other hand, Christ's almost-daily physics jokes were adorable.)\nThe TA running the problem sessions was not particularly helpful--he would often solve problems with math none of the students had seen (post-calc), if he solved the problems at all. The course would have been much more manageable (and effective, given that I learned very little from the instructors) if we had had decent problem sessions.\nThe text was the best part of the course. I'm not taking the second semester of the class in favor of teaching myself out of the book, which is basically all I did this semester.\nWorkload:\nSix problems a week of varying difficulty (some weeks are impossible, others are a breeze). Midterms and final are simple enough, if you can do the homework problems...\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 12, 2009",
            "review_content": "\nThe lectures are really dry, except for demo days. Mostly, he proves and derives all the formulae which is cool if you actually like physics, but the engineers found it very boring. Most of what you learn from this class is due to the hwk. No one goes to the lecture. I was lucky in that my whole floor is engineers and science ppl, so we did the homeworks together, wednesday nights it was a few hours (10-1:30). Usually, the homewokrs are on something from the book, rather than from class, and may be something that he is going to teach, but hasn't yet. Relativity section was awesome. If you want more calculus, take 1400 physics, as this class mostly avoids it in the problems (1400 uses a better book too). If you took physics B or C in high school this class is a breeze, but i have been warned that second semester is much more challenging and actually physics.\nWorth it? Yes, do the crossword during lecture, you might see a cool proof or demo, then go to lunch with friends and do the problems.\nWorkload:\n6 problems a week, 2 midterms, 1 final.\nthe homework is quite involved, and usually requires a good insight into the problem's catch. do it in a group. have one person go to lecture to hand them in.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "November 19, 2009",
            "review_content": "\nOnly take this class if you absolutely have to.\nIf you aren't a physics major or don't have a strong background in physics, this class is going to be extremely difficult. Norman Christ is undoubtedly a charming and kindly professor, and I will never forget his daily dry physics jokes. But his lectures are entirely incomprehensible. I found it absolutely impossible to pay attention during a single class period. \nI'll put it this way: everyone who did well in this class did so because they ALREADY knew physics. Don't expect to actually LEARN a single thing.\nThe class is also heavily math-oriented (more so than most physics classes), so beware if you are a lover of conceptual learning.\nLuckily, you can skip most of the lectures and just learn everything out of the book if you want. You'll do fine if you take this approach; but if you're not a textbook person, you're screwed.\nWorkload:\nPretty fair, actually. One problem set per week, 6 questions per problem set. The problems can be extremely difficult, so make sure you have friends taking the class as well. Two midterms which actually weren't that difficult. I have yet to take the final.\n"
        },
        {
            "course_name": "Quantum Mechanics I",
            "review_date": "February 23, 2009",
            "review_content": "\nProf. Christ is a very good and EXTREMELY knowledgeable professor. Though I must agree with the other reviewer that not all his proofs are very rigurous, this is not a proof-based math class either. Just like Physics research, it is problem - solving oriented; Quantum Mechanics is a closed field for research, the purpose of this class is to help us get more insight into the physics and the phenomena - and phenomena don't need proofs, they happen. In his class he tries hard to squeeze in as many phenomena as possible - during the first semester, with a more advanced version of the mathematical apparatus in undergrad QM, during the second one with completely new stuff that could never be solved with the undergrad knowledge.\nThe problems prof. Christ had us solve every week were not always hard, nor always easy - they would alternate. However, each time they actually hid a real physical problem or some new insight (about which you could find out more during his office hours) -to put it this way, I loved all of them. \nThough it is true his midterm had some calculations in it that could confuse many, they could be solved in a few lines with some very simple tricks that he did in class. Getting more than 70 however was pretty hard as the last 30 points were the insightful, truly difficult part. \nHonestly, I feel his class and his office hours were a great help to me in my global understanding of Physics, and I'm happily taking the second semester of his class.\nWorkload:\nweekly beautiful problem set\neasy midterm with a pretty difficult ending - that was out of the curve anyway\npretty long final, not excessively tough.\neverything can be solved with some insight, unapproachable without.\n"
        },
        {
            "course_name": "Quantum Mechanics I",
            "review_date": "December 17, 2008",
            "review_content": "\nProfessor Christ is a very nice person, always willing to help and take extra time to answer questions, etc. When I went to office hours, he was also very encouraging and smiled a lot, and he would stay late after problem sessions to answer questions. The only problem is that I feel Prof. Christ has some trouble conveying his knowledge to students. Also, the problem sets for this class fluctuated between very easy and quite tricky (I think I stayed up very late trying to figure out how to do a problem on hyperfine structure for the last one) as if he has no sense of the correct difficulty level. I guess I also didn't quite like the system of having homework due on Fridays, with the recitation immediately after (so you realize your mistakes - or get convinced you made one even if you really didn't, although I guess that ingrains it into your memory). Spending Thursday evenings entirely on quantum mechanics ruined my piano lessons for the semester.\nAs for the lectures, I was a little disappointed about the hand-waviness of the mathematics. I guess I viewed quantum mechanics at the graduate level as a chance to combine math with physics - to view things in terms of symmetries, and use the language of group theory etc. to provide a language with which to do this. In this class, the math just seemed sloppily added to the physics without great motivation; I guess I have a taste for more rigor in math.\nThe midterm had a low average (35-40%) just because Prof. Christ asked some conceptually straightforward but computational questions (like WKB with five connections). The final seemed a lot easier, so the average was probably higher on that.\nFinally, a note on taking graduate classes as an undergraduate: I'm not sure whether to recommend it or advise against it. Certainly the undergraduate quantum mechanics class here is solid (was when I took it with Prof. Kim) so you shouldn't feel pressured to continue immediately with the graduate one (which basically repeats material with a few extra things on representations of the rotation group, etc.). I guess I took it because I like theoretical math as well and was curious what it would be like to take a class combining math and physics - I don't think I really got this in the end.\nWorkload:\nWeekly problem set due on Fridays (average of 5 hours of work but fluctuates), midterm, final. \n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "May 13, 2006",
            "review_content": "\nDO NOT TAKE THIS CLASS WITHOUT CONSULTING SURVIVORS FIRST!\nARGUABLY THE MOST DEMANDING CLASS IN COLUMBIA:\nOh, how I have longed for this pay-back time to Christ, after sleeping for not more than five or six Wednesday nights this past year when problem sets are due Thursday morning.  Exams for which any level of preparation is inadequate, and lectures which are less productive for the exams than watching the Price is Right at the same time.\nWhy you want to take this class: You hate yourself, you want to make physics the focal point of your dorky academic and personal life, condense three introductory physics courses into two, a genius of a professor, a chance to finish 8000 level Quantum Physics (which he also teaches) in your freshman year, and a chance to demonstrate that you have testicles of steel (my apologies to the few girls who lasted till the bitter end) to not only humanities BS (fecal sense) majors, but BS (in a Bachelors of Science) engineers as well.\nHow to leave this inferno with most limbs intact: First, do the problem sets in study groups: this is a must.  It will motivate you and leave you with some sleep to spare before ThursdayÂ’s lecture (which is when problem sets are due).  Second, strong math background: Expect to know some Linear Algebra from the beginning, and expect to know ALL OF IT for Quantum Mechanics in second semester.  It goes without saying that Taylor series, multivariable calculus, line integrals, div, grad, curl are absolutely necessary for this class.  Teach yourself these concepts as early as possible: he will not help you with them, in class or in office hours.  Third, get good supplemental textbooks. K & K, Purcell, and French & Taylor are generally as helpful as your First-Year advisor who told you to take this class in the first place.  For Special Relativity, I highly recommend Â“Spacetime Physics.Â”  For Quantum, I recommend Â“Quantum Mechanics Demystified.Â”  Also, you may find some help in general textbooks, Wikipedia, and by googling the numbers of questions online, as MIT and UC-Berkeley put some answers to these problem sets online.\nRecitation was helpful at times, yet not well-attended.  Lectures were highly theoretical and did not explain how to do the homework or exam problems.  1st semester: Midterm was fair, yet final was very difficult (special relativity included).  2nd semester: Midterm fair, final very difficult (50% Quantum).  The homework steadily became less possible as we treaded farther into Quantum Mechanics.\nHe held office hours, which I found unhelpful.  Supposedly, he curves the class around a 3.5 or A-, but some people did much worse than me (B-).  Class began with about 75 students, had about 55 mid-year, and we finished with 36.  Go figure.  DonÂ’t try this if you are pre-med or want an easy A, or B for that matter.  If I were the registrar, this would be 8.5 credits!\n\nWorkload:\n8-10 problems each week, taking anywhere between 6-10 hours to complete.  1 midterm, 1 final each semester.  Lots of stress and aggravation.  If you are reading this over the summer, start the homework and Linear Algebra now!\n"
        },
        {
            "course_name": "Accelerated Physics II",
            "review_date": "May 08, 2006",
            "review_content": "\nChrist is absolutely out of touch with reality. He assumes that we understand what he's teaching, even when we visit him in office hours every single week, or ask questions that he considers obvious. He doesn't get the signals that we're confused. Even if I get a decent grade in the class, I know that I've barely learned anything.\nThe time spent on quantum mechanics was an absolute waste. Nobody will deny that Christ is brilliant. However, he has no ability to transfer his knowledge. It has been so longer since he has learned the material and it has become so engrained in his person that he cannot connect share his complete understanding with people who have no basic knowledge.\nThe TA, Michael Cheng, is great. 3 hours with Cheng was more informational than an entire semester with Christ. Cheng produced a study guide for the class in an attempt to help us understand what Christ might give us. It went above and beyond what we had done in class or in homework, which seemed like a good idea. However, on the final, it seems like Christ used the study guide to design his problems. He assumed that we knew stuff that we were only barely familiar with. \nFirst semester was alright (C2801). However, it all changes second semester. Once you leave the territory that you're familiar with (AP Physics, high school stuff), you will not be able to figure out what Christ is doing. His teaching only works when you already have some base knowledge. If you really enjoy physics, take C2801. It's challenging and you'll definitely learn new ways to approach problems. Do not take C2802 unless you are going to put in a lot more effort. You need to find outside sources of information, and you will be struggling to keep up.\nWorkload:\nWeekly problem sets (take most people 6-8 hours), one midterm, final.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "November 10, 2003",
            "review_content": "\nThis is by far the hardest freshman-oriented science class. (I know, I took/am taking intensive orgo, honors math, this, honors comp sci, and bio.) There was not a single person in the class who understood all the concepts completely. Don't expect to sleep Wednesday nights. Don't expect to \"get it.\" You do learn a lot though, in great detail.\nProfessor Christ is awesome. He teaches as if you're graduate students, but understands how hard it is, and makes efforts to help. He largely teaches the theoretical material, leaving the application (which is what the homework and tests are on) to you to discover on your own, from the book, your classmates and the TA. He does, however, goes out of his way to provide time to review before the tests, and stays as long as people have questions. I suppose it would have been feasible to not go to his classes, but you should! He's a very enthusiastic teacher, and rather engaging in general. The classes made me believe and understand relativity, and put me on the same path for quantum mechanics. \nWorkload:\nCrazy-hard problem sets due every Thursday. A midterm and a final (both very appropriately graded).\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "August 19, 2003",
            "review_content": "\n2801 was a great class. christ or no christ, i think i would feel the same way. he was just there, while i was there. however, i did like how his physics teaching style was so mathematically driven, so i did end up going to about half the lectures.\ni did 90% of the prob sets on my own. they took 5 to 10 hours to finish. there are always two or three problems that are straight forward on each prob set and a few that take about an hour or two to figure out. midterm was decent, and the final was more difficult. the textbook is okay.\ni dropped to 1402 second semester, and i seriously regret not taking 2802. physics sequences below 2800 are jokes and should not be offered to engineers. you have to feel the pain of 2801 to truly gauge your physics abilities.\nWorkload:\nsee above\n"
        },
        {
            "course_name": "Accelerated Physics II",
            "review_date": "August 12, 2003",
            "review_content": "\nAfter taking a tough beating in the first semester of this course, I decided to dive into the second half, C2802 Electricity and Magnetism .  I only did this because the completed sequence would mean not having to take another physics class in my undergraduate career.  Also I figured that I've probably seen the worst of it.  Boy was I utterly wrong and completely beaten down even further.  The second semester started fairly general with a discussion of what charge was and a general rambling on the history of progression in electricity and magnetism.  However, things soon accelerated into a complete incoherent mess of inconceivable transformations and matrices.  It was only further complicated and alienated by the usage of CGS units which capacitance was no longer a Farad but a Centimeter.  It was completely horiffying and outright snuffed many more of the students that were interested in physics.  Our only brief moment of relief was when Professor Christ had to leave for Washington to get more grant money for his supercomputer research.  Professor Allan Blaer was the substitute and he was absolutely amazing.   Although Allan Blaer and Norman Christ were both classmates in physics and went to Columbia back in the days, they wouldn't have been more different.  While Christ had a timid and often high pitched voice, Blaer was vibrant and full of life.  His lesson was invigorating and gave us a glimpse of the joys of physics.  However, good things seem ephemeral and we that was teh only lesson we had with Blaer.  Later Christ returned with his grant money but that was about all that had chnaged.  When things finally seemed like they were going to end, we get slapped with Quantum Mechanics during the last week of classes.  There was no way we could learn Quantum Mechanics in one week but that didn't stop Christ from making one of the four questions on teh final a quantum mechanics question.  Basically, this semester was full fledged punishment for continuing on without heeding the cautions in the first semester.  In short, we all realized that Christ is in fact a genius and it would be great researching with him.  However, as a physics professor, he lacks the ability to attend to the needs of the class and make the material more accessible.  It is a pity, since many potential physics students turn to chemistry and biology for salvation.\nWorkload:\nWeekly Problem sets of 10 excrutiating problems.  A hard midterm of 3-4 questions on E&M; and an impossible final of 3-4 questions on E&M; and Quantum Mechanics.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "June 03, 2003",
            "review_content": "\nThis class is absolutely a NIGHTMARE. Look forward to watching the sunrise on Thursday morning as you come to the end of your problem set due at 10:35. The texts used for this class are old, boring, and out-dated. Don't bother attending class because the lectures are useless. However, for those of you who love going to class, look forward to long-winded mathematical proofs and hour-long tangents on such interesting topics as matrices (which you should know if you are taking this class), differential equations, and OH YES complex numbers and Taylor Series Expansions. Don't get me wrong, Christ is a nice, approachable professor, but he simply does not prepare the students for the rectal workout that is homework. Speaking of rectal workout, the exams are absolutely disastrous and no amount of studying can prepare you for them. Once you get past the difficult material, you have to worry about the PhD-level mathematical manipulations you have to perform to get the correct answer. I would advise taking 1601-1602 if you want to learn physics, but if you have an ego and want to test yourself, this impossible class is for you. \nWorkload:\n1 Problem set per week, 8-10 Questions -> IMPOSSIBLE (must do in groups). 1 Miderm (very hard), and then this hell is culminated with a final that leaves you feeling like you just left Cell Block 8 (yea its hard). The only decent part is that he curves around an A-, so you would have to be a moron to get lower than a B-. \n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "January 30, 2003",
            "review_content": "\nHe's a genius, no doubt about that. But he also teaches as if were the same. Most of his classes involve rigorous proofs of formulas, in which you only need the end result. His lecture's don't really correspond with the book, and the homework has absolutely nothing to with his lectures. Most of the time you have to teach yourself the material so that you can do the homework. Same goes for the exams, they have little to do with his lectures. I come out of every class feeling like I've learnt nothing, in fact most people leave the class early. I only came to class for the fear that today might be the day that he actually taught something and that I might miss it. I took him because I had no choice; his is the only section.\nWorkload:\nA problem set of about 8 questions per week. 1 midterm, 1 final.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "January 26, 2003",
            "review_content": "\nThe material is great. The professor however is not so great. Christ is one of the smartest people in the physics department and has an incredibly insightful understanding of the material. Unfortunately he is as blind as a bat when it comes to teaching. Actually, that wasnt fair...The lectures were generally standard. He wasnt teaching, he was reciting. The problem is. material as theory heavy and at times as abstract as that of phys 2801 requires a thorough explanation of the theory and ALOT of application to problems to be mastered. Christ did a great job on the theoretical stuff (you better brush up on Linear ALgebra and multivariabel calc to get most of it), but when it came time to apply the theory, he left alot to be desired. You will find yourself sitting in class, taking intense, impressive looking notes, then doing the HW problems the same way you did them last year in Physics C. Christ just doesnt emphasize problem solving enough. \nWorkload:\nweekly psets..about 10 problems...most people use study groups..but dont rely on your group, if you cant do the problems and end up just copying your gonna get screwed on the midterm and final...his grading on the tests is not too good, no partial credit on certain problems..but aboout half the class gets an A-.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "January 16, 2003",
            "review_content": "\nMixed feelings towards Christ. Although he has a somewhat intriguing sense of humor and is insanely smart, I would definitely not rush to take this class over again with him at the reigns.\nHe IS the stereotypical, egotistical prof. who is intent in getting like 90% of his class to drop out. He believes in students learning from homework problems or so it seems. One can do totally fine in his class by not going to a single lecture.\nReason being, he is in love with math and spend all of his time deriving the textbook in class. Yet, although his lectures are highly theory-based, hw, and both of the finals are problem solving oriented.\nDon't try taking this class unless you know alot of math and physics. He says all you need are a 5 on BC Calculus, and 5s on the Mechanics and E/M sections of the Physics AP exams. From my experience, it is helpful if you've seen some multivariate-calculus, and even better if you've seen some diff. eq. especially during the oscillations chapter. Furthermore, unlike high school physics, in this class you actually USE calculus to solve problems.\nAll in all, the class could have been much better with a different teacher. I know I definitely learned a lot of physics in this class through sheer hardwork, which is probably the only way one can learn this stuff.\nHowever, it was definitely not a fun proccess by any means, plus the textbook was horrible. Have an open mind when walking into this class. You'll be able to see if its worth the work after you get back the second hw assignment. Good luck.\n\nWorkload:\nHomework wise expect a list anywhere from 7-9 problems on average. Grading is kinda sketchy. I HIGHLY reccommend doing these problems in groups, unless you have a great, insurmountable urge to defeat each of these problems yourself. Allot around 6-8 hours a week for problems. One midterm, one final. Spend time on the homework however. Look foward to a nice curve at the end of this rollercoaster. (hw 20%, midterm 30%, final 50%).\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "January 09, 2003",
            "review_content": "\nGoing into Professor Christ's class, I was relatively confident with my ability to do well. Christ advertizes the class for students who have a 4 or 5 on the Calc BC or Physics B/C AP exams.. and I had a 5 on BC, and both parts of Physics C. However, the amount of mathematical preparation for the class far exceeds that covered in your standard BC class. Plan on having a complete understanding of differential equations and linear algebra if you wish to understand the derivations he spends virtually all of class time performing. I was particularly disappointed in the book, Intro to Mechanics, which as another poster stated, assumed that one knew all of the fundamentals of mechanics to begin with (why call the book Introduction... I feel really sorry for any student who has this as their first physics text.). In addition to the problems with the math and book, I often felt intimidated to ask Professor Christ for help on a problem. His most common answer to virtually all who asked a question seemed to be  'maybe you should consider 1601' regardless of the question. Having gone to *all* of the lectures (although I sometimes wondered why I did), I felt that Professor Christ didn't adequately prepare students for the homework assignments or tests... he developed the theory behind the problems, but didn't give the tools necessary to solve them. I could tell you all about four vectors, rigid body motion, etc, but ask me to solve a problem on his tests, and I, along with many other students, would probably have a real tough time doing it for you. I found the class to be very frustrating, but it sure helped me decide to major in Chemistry instead of Physics.\nWorkload:\nProblem sets of 8-10 problems weekly; expect to devote at least a good 8 hours to doing them. Unfairly graded yet relatively easy midterm, challenging final.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "November 26, 2002",
            "review_content": "\nNorman Christ is a decent professor who does his job at presenting complex physical concepts. However, as a student who has taken BC Calculus (5) and AP Physics B (5), this course is the most mind warping experience ever. The level of mathematical and physical concepts is way beyond what I had imagined. This is worsen by the fact that the text book, Kleppner and Kolenkow's An introduction to Mechanics, is too advanced as well. The book assumes that you know sophisticated mathematical and physical concepts and therefore skips fundamentals. In addition, the examples given in the text does little or nothing in aiding the homework questions. As a result, the homework was extremely painstaking and often required literally hours of torture. A decent study group alleviated but didn't eliminate the intensity of the homework, which left many of us in a stupor while the stronger person in the group forged on. In short, I recommend all those who are considering whether or not to take this course to really evaluate their mathematical and physical abilities as well as the sacrifice they are willing to make in the interest of physics. Unless you have a mathematical backing beyond Linear Algrebra and Calculus as well as an intense love for physics, do not take this course. It will not only be useless, but will leave you with an intense dislike for physics as a whole. Hint: 4.5 (They make it worth every point of it.)\nWorkload:\nOne problem set of approximately 10 problems per 9 days. Time required: 8-10 hrs for an average person (less for a genius) , 5-7 hrs for a study group with at least one competent person in the group. One midterm and a final.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "May 14, 2002",
            "review_content": "\nWhat else can I say other than \"this man is a genius.\" A fountain of knowledge and a very approachable and flexible person. His class was immensely fun (if you like physics). All the other reviews are dead-on accurate. The class itself is quite intensive (be ready to earn those 4.5 points) and the math involved is quite advanced.\nWorkload:\nProblem sets due every week (long, difficult, intense), one midterm (very difficult), one final (same) - don't worry though, because everyone is pretty much in the same boat and the curve is around an A-.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "April 25, 2002",
            "review_content": "\nThis course, nay, this professor, singlehandedly turned me into a physics major. It's very hard and the lectures can be overwhelming at first, but he even said himself that this would probably be the hardest physics course we'd end up taking. Professor Christ radiates genius like mad and has the best sense of humor. He's my hero. Definitely take this course if you have any interest in math or physics, it'll totally be worth it, and if Christ can't make you love physics nobody can -- just don't plan to do any other work (or sleep too much) the night before assignments are due. This course will really show you what physics is all about, not just solving rope and pulley problems.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "April 23, 2002",
            "review_content": "\nThis guy is insanely intelligent and immensely gifted. Seldom would u find a professor with such a thorough grasp of the theory of physics. Be ready to do some higly advanced math (IIIS/IVA and beyond) in this class. The physics might be very familiar to you but the way its taught is (most probably) radically different from what you have seen upto now. A very demanding class, with tough exams(for an intro class), but one, which is, definitely worth its weight in gold if one is capable enough to do it. The books used in this class, old as they may be, are absolutely great.\nWorkload:\nThis class has a high workload which, if handled well, helps a lot towards the final exam.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "December 20, 2001",
            "review_content": "\nThis guy is brilliant. His brain is so advanced that it works faster than his mouth can output the information. Be ready for a whopping 4.5 point course, where you earn every penny. I learned a lot, and got your butt kicked on exams. I can't wait 'til the second half. One more thing, try to take Calc IIIS/IVA while you take C2801, because the math of C2801 is somewhat advanced (I took IIS, and I felt the pain).\n"
        }
    ]
}