{
    "prof_info": [
        {
            "prof_name": "Damon Chaky",
            "prof_id": 2205,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 08, 2006",
            "review_content": "\nIf you get Damon as you're seminar leader, consider yourself VERY lucky. He's so helpful, and eager to teach, but he's also very \"chill\" and understanding.\nGo to his office hours, talk to him, he's a nice, intelligent guy, and makes FoS worth while\nWorkload:\nOne Discussion question online post a week. One problem set a week. Lecture question too at the end of each Monday lecture. Very manageable\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "September 20, 2005",
            "review_content": "\nDr. Chaky is a cool guy. He loves this class, and he puts as much effort as possible into making it interesting and fun for everybody. Damon always answers our questions and makes himself easily accessible in case we need help. So, if you get put in his seminar, you lucked out.\nWorkload:\nDiscussion questions based on a lot of reading (articles, mostly) and pretty easy assignment questions. The work isn't too bad -- it's just annoying.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 17, 2005",
            "review_content": "\nDamon is awesome. The Frontiers of Science lectures were occasionally interesting and usually boring, but Damon's seminar was always fun. Some reviews here have said it was easy, and it was - but mainly because it's easier to do work when your professor is awesome. Which he was. Take this class.\nWorkload:\nweekly discussion questions, problem sets every 3 weeks - no extra work assigned, unlike some seminars\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 17, 2005",
            "review_content": "\nYeah, Damon is really nice and a fair grader.  But let's be honest-- Frontiers discussions are a joke.  You'll dread going to the Pupin dungeon every week to waste your time and get treated like a high school kid again.  You'll trivialize some interesting scientific work and waste countless hours of time with \"field experiments\".  At least Damon is on your side.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 03, 2005",
            "review_content": "\n Fronteirs is a joke of a class and a waste of your time. However, Damon made the class somewhat bearable and always seemed ready to help. Compared to what I have heard about other section leaders, Damon is probably one of the best.\nWorkload:\nSame as every other section. Four problem sets, and weekly homework. The homework doesn't really matter though, and as long as you hand it in, you can pretty much write whatever you want.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 03, 2005",
            "review_content": "\nYes, this man is very nice and quite easy. However, the discussions sometimes get a tad boring...it has yet to be shown that any Frontiers discussion can be interesting, though...\nWorkload:\nThe same as all professors: weekly discussion questions, 4 problem sets per course\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 21, 2004",
            "review_content": "\nDamon is just an all-around nice guy who genuinely loves science and loves to share his love of science with his students.  He can't help that Frontiers is a worthless class; he would often introduce things into our discussions that added an extra angle to what had been said in the lectures.  He would always answer every single question that anybody had, and do so quickly and happily.  Damon made the evil monster that is Frontiers of Science bearable.  I'd take another class with him in a heartbeat. \nWorkload:\nWeekly Frontiers readings and questions associated with readings.  4 problem sets common to all of Frontiers.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 20, 2004",
            "review_content": "\nDamon was an awesome TA. There isn't any more than you can ask for; he's really approachable, intelligent, and grades very fairly. He's good at explaining  and clarifying really obscure scientific concepts (great for \"non-science\" people like me), and he facilitates discussion really well. Damon's full of energy--he reminds me of a hyperactive squirrel sometimes. He's in motion constantly--lots of big hand gestures and walking around the room--and you can tell that he totally loves discussing science with students, even though the topics might not be related to his personal field (environmental science). Definitely consider yourself lucky if you're placed into his section; he made Frontiers my favorite class this semester. \nWorkload:\nSame as all other sections; Discussion Questions every week, readings, then Problem Sets for each unit (4 total) and Final at the end\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "November 13, 2004",
            "review_content": "\nThis guy is the nicest, friendliest, easiest teacher ever.  It's so nice just being in his class, so I just had to put a good word in for him.  \n"
        }
    ]
}