{
    "prof_info": [
        {
            "prof_name": "Victoria Collis-Butheizi",
            "prof_id": 7821,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 01, 2011",
            "review_content": "\nYou won't know your U.Writing professor until you get to class.  That being said, if you go into class and Victoria is teaching it, get out.\nVictoria is clearly an intelligent person who is probably a great academic.  I'm sure that her thesis papers are fascinating.  But her teaching skills are lacking.  If we (the class as one body) do not understand something and ask for clarification, Victoria repeats what she said the first time...but slower.  That's not clarification.  Additionally, assignments were not clear.  How can I be criticized on not fulfilling assignment requirements if I don't know what the assignment is?  No one wanted to participate in class, either.  Questions were met with frustrating answers.  One example: we are doing peer edits/workshops.  A student is absent and consequently, there is an odd number of students in class.  Obviously, three students will have to work together instead of working in pairs.  Victoria is frustrated and starts getting upset that people didn't print more versions of their paper.  One student tries to explain the concept of three way passing ie student A passes her paper to student B who passes his paper to student C who passes his paper to student A.  Everyone reads a paper and can critique someone else's work while still getting feedback for themselves.  Victoria could not understand this concept at all, despite the fact that several students tried to chime in.  Frustrated, she left the room to go print more versions of the students' essays (which were, of course, not needed or used).  I'm trying to make the point that Victoria is a nice, caring person but who just doesn't understand some real-life concepts.  She has a hard time connecting with students.  She definitely raises interesting intellectual questions, but she never answers emails, doesn't send out assignment sheets consistently, and changes due dates frequently.  This is an incredibly frustrating experience.  Additionally, there have been several class periods in which Victoria will hand out sixty page packets to everyone and ask that we read them in fifteen minutes.  There are several problems here: 1) we physically can't read that many pages in fifteen minutes so she can't get frustrated with us for not reading that many, 2) why didn't she send it out for homework if she wanted us to read the packet? and 3) we are wasting the short hour and fifteen minutes of class by watching other people read.\nI honestly did not enjoy University Writing with my professor at all.  The best part was that we read a few articles by Andre Aciman which were absolutely fascinating, and I was exposed to a LOT of African diaspora literature.  When I say \"a lot,\" I mean that most of the pieces we read were African diaspora and were almost always by Jamaica Kincaid. It was great to read different literature than what I usually read, but within the course readings, there was little diversity.  As for the course itself, I don't think I gained anything as a writer.  The only thing that I learned that resonated with me was the \"moment of epiphany\" idea when analyzing reading.  Other than that, there was nothing.  I wish I could've passed out of this class.  \nI asked one student if he knew if we had homework or not.  He replied (summarizing the class's feelings pretty accurately), \"No, but we'll be fine and just spend an hour wishing that a plane will overshoot LaGuardia and crash into the building to save us from our misery.\"\nWorkload:\nResponse papers every week + the four ridiculous \"progressions.\"  Reading, chosen by professor, consists of almost entirely African diaspora literature.  \n"
        }
    ]
}