{
    "prof_info": [
        {
            "prof_name": "Gary Tubb",
            "prof_id": 194,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Sanskrit I",
            "review_date": "November 30, 2004",
            "review_content": "\nTrue, Sanskrit's extremely difficult. In fact, I'm increasingly convinced that every Sanskrit writer was a sort of proto-James Joyce, what with the language's abundant punnery and obscurantist prose. Nevertheless, Guru Tubb is as good as it gets. He's obviously devoted to the language and to his students, and he's a genuinely interesting human being without any evident aversion to digression. But really, Sanskrit is harder than Greek. Think twice before you take it. \nWorkload:\nTypical of a language class. Homework, midterm, final, a quiz or several along the way. \n"
        },
        {
            "course_name": "SANSKRIT",
            "review_date": "May 07, 2003",
            "review_content": "\nProfessor Tubb is, perhaps, the most brilliant man I have ever encountered. Because Sanskrit itself is unbearably hard, I found it hard to actually enjoy this class, but Professor Tubb's periodic discourses on anything he happens to be interested in (religion, linguistics, South Asian cultures, etc.) relieved much of my pain.  Not a good class for the language requirement, but definitely something to consider as an elective.\n"
        },
        {
            "course_name": "SANSKRIT",
            "review_date": "April 12, 2003",
            "review_content": "\nGary is one of the best teachers I've ever had, sanskrit, while impossibly hard and ingerently tedious, was made fun and enjoyable, and I got a pretty good grade for my troubles... Great man, incredibly knowledgable, very approchable...\n\nWorkload:\npretty decent\n"
        },
        {
            "course_name": "Nonduality in Indian and Tibetan Thought",
            "review_date": "January 22, 2003",
            "review_content": "\nI can only speak from the experience of my own section (I've heard from people who took the class in previous semesters that it was much better), but this is among the worst classes I've taken, ever. This course is full of shortcomings that could be easily corrected if the profs just took the time to do so. The material covered oscillates wildly between the phenomenally dense and the absurdly simplistic, with virtually no middle ground. The syllabus and outline of the course are so vague and the readings are presented so totally out of context that it took me the better part of the semester to get even the most rudimentary sense of what exactly we were studying (for future reference, it is the history of Madhyamaka as seen through the eyes of the Tibetan philosopher Tsong Khapa, with Vedanta thrown in every other week just to make things extra confusing). This seems to be a general characteristic of nonduality scholarship; at first I though the class readings were impenetrable because the subject matter was so difficult, but in time it became clear that, while this is true, it doesn't help that virtually no one among the assigned authors can write their way out of a paper bag. Tubb is extremely nice and knows his Vedanta, but somehow his lectures manage to be simultaneously very well-organized and totally impossible to follow. Thurman is fascinating when he gets going in \"Buddhist Sunday school\" mode, but this is largely predicated on his ability to show up on a semi-regular basis, which is hardly a given. My section suffered immensely from a couple of graduate students who liked to hear themselves talk, to no discernable benefit for anyone else. If anyone in your section has studied extensively in Tibet but hasn't managed to pick up any monklike humility in the process, I suggest that you abandon the class immediately. Finally, although prior knowledge of Tibetan and Sanskrit is not a prerequisite, you're basically wasting your time here if you don't know at least one of them. Tubb (who also teaches Sanskrit) loves to go into the philosophical intricacies of Sanskrit grammar, and one of the underpinning theses of the course is that nonduality doesn't come across in translation to any meaningful degree.\nWorkload:\nInfernal weekly postings based on the readings, which will be unconstructively torn apart in short order by your more educated and less mature peers (who, thanks to Courseworks, can take a crack at anything and everything you submit). A 25 page research paper that I suspect no one actually reads.\n"
        },
        {
            "course_name": "Nonduality in Indian and Tibetan Thought",
            "review_date": "January 22, 2003",
            "review_content": "\nI can only speak from the experience of my own section (I've heard from people who took the class in previous semesters that it was much better), but this is among the worst classes I've taken, ever. This course is full of shortcomings that could be easily corrected if the profs just took the time to do so. The material covered oscillates wildly between the phenomenally dense and the absurdly simplistic, with virtually no middle ground. The syllabus and outline of the course are so vague and the readings are presented so totally out of context that it took me the better part of the semester to get even the most rudimentary sense of what exactly we were studying (for future reference, it is the history of Madhyamaka as seen through the eyes of the Tibetan philosopher Tsong Khapa, with Vedanta thrown in every other week just to make things extra confusing). This seems to be a general characteristic of nonduality scholarship; at first I though the class readings were impenetrable because the subject matter was so difficult, but in time it became clear that, while this is true, it doesn't help that virtually no one among the assigned authors can write their way out of a paper bag. Tubb is extremely nice and knows his Vedanta, but somehow his lectures manage to be simultaneously very well-organized and totally impossible to follow. Thurman is fascinating when he gets going in \"Buddhist Sunday school\" mode, but this is largely predicated on his ability to show up on a semi-regular basis, which is hardly a given. My section suffered immensely from a couple of graduate students who liked to hear themselves talk, to no discernable benefit for anyone else. If anyone in your section has studied extensively in Tibet but hasn't managed to pick up any monklike humility in the process, I suggest that you abandon the class immediately. Finally, although prior knowledge of Tibetan and Sanskrit is not a prerequisite, you're basically wasting your time here if you don't know at least one of them. Tubb (who also teaches Sanskrit) loves to go into the philosophical intricacies of Sanskrit grammar, and one of the underpinning theses of the course is that nonduality doesn't come across in translation to any meaningful degree.\nWorkload:\nInfernal weekly postings based on the readings, which will be unconstructively torn apart in short order by your more educated and less mature peers (who, thanks to Courseworks, can take a crack at anything and everything you submit). A 25 page research paper that I suspect no one actually reads.\n"
        }
    ]
}