{
    "prof_info": [
        {
            "prof_name": "Courtney Bender",
            "prof_id": 195,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 28, 2011",
            "review_content": "\nI mean, she's not the worst CC professor out there, but she's certainly not mind-blowing. It's clear that she's studied and closely read the material on the CC syllabus, but she's certainly not an inspirational professor.\nIn discussion, she intersperses her own little comments and banter; her voice is not completely authoritative in that she never offers a final word, but at least she doesn't force her opinions on you. She doesn't really inspire intellectual curiosity. I would say that it's an easy enough class if you're comfortable with the readings. You have a response almost every week so you end up participating a lot anyway because you've actually had to do a response. \nI wouldn't recommend her because she's not at all easy going and writes down/remembers everything.\nWorkload:\nTons of responses, but no midterm. Two 6-8 page papers. Open-ended question final.\n"
        },
        {
            "course_name": "Religion in the City",
            "review_date": "December 22, 2010",
            "review_content": "\nProfessor Bender is the perfect teacher for this class. She specializes in American religion, particularly in pluralist and cosmopolitan settings such as New York City. No one else on the religion faculty here (to my knowledge) is more knowledgeable than she is in this field. \nThe course is just what it sounds like: religion's presence and position in cities, particularly this one, since the founding of the United States. Lectures generally follow the contents of whatever book (or parts of books, or articles) were assigned for that week, and while doing the reading really helps, you can get by without it if need be. The readings concentrated mostly on Christianity in the city, with some Judaism and some Islam in there, but nothing of Asian religions, or at least barely anything. \nAt heart, this class is about ethnography. Each student chooses a religious site or group within Manhattan to study over the course of the semester. Each student writes four papers: the first is a \"precis,\" an overview of the site/community, how it relates to its immediate surroundings, how it advertises itself, etc. The second is a history of the site/group. The third is a field study, an argument students make on the basis of observational field notes they write after visiting the site on several occasions. Finally, the fourth essay uses another students' research in comparison with your own to make some larger argument and come to a larger conclusion. Choose a good and interesting site (one you aren't already familiar with, those seem to always go wrong) and you learn a lot about research and observation as well as directly about that community. \nNot an easy class, but not really hard, and highly recommended. \nWorkload:\nFour papers (see above), one 6-8 pages, two 8-10, one 10-15. No midterm or final. About one book per week, or two small ones, or three or four articles. \n"
        },
        {
            "course_name": "Junior's Colloquium",
            "review_date": "December 17, 2009",
            "review_content": "\nI very much enjoyed this class.  No, Professor Bender never knocked my socks off in amazement, but the class really isn't structured for that kind of thing, anyway.  It's a one-weekly seminar in which you discuss an important work of religious study and the theory behind it (later in the semester, you switch from an emphasis on theory to one on method).  Sometimes the reading (often a whole book) took quite a while, but if you spaced it over a few days then it's not a problem.  Discussions were very engaging, and I always felt like I had learned both a lot about the book itself and about the theory and method of religious study.  There was one 6-8 page midterm paper (for which we were given topic questions) and the option to either write a take-home final paper or to research and write your thesis proposal (a great opportunity for majors to kill two birds with one stone).  \nProfessor Bender was engaging, she was very familiar with the subject matter, and she was both nice and welcoming.  I went to office hours a few times and walked away feeling like it was time well spent, my questions answered.  One thing to be aware of: Bender does not like to give paper extensions, so work to get it done on time!\nWorkload:\n150-300 pages of reading/week (depends on the book, and the harder ones you'll only have to read sections of).  1 weekly \"memo,\" or response/write-up (1-2 pages single-spaced).  1 midterm paper (6-8 pages), either a take-home final paper or a thesis proposal.  \n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "November 20, 2006",
            "review_content": "\nVanilla Ice cream.  For better and for worse. Dependable and gives good explanations, but will never blow you away like chubby hubby or anything. Still, having gone through most people in the religion dept, especially the ones teaching more theory, i'd take vanilla ice cream and run \nWorkload:\nAnnoying 1-page weekly response papers single-spaced.  Two papers of respectable length.  Final or thesis proposal\n"
        },
        {
            "course_name": "Theory and Method in Religion I",
            "review_date": "April 08, 2006",
            "review_content": "\nProf. Bender made what could have been sheer drudgery into a highly engaging, helpful, and enjoyable class. She prepares extremely carefully for class and works harder than any prof I've had in my two years at CU; this I would warn, though, translates into high demands upon you, the student. She managed to facilitate what were typically very lively discussions, and, remarkably, sustain them for three hours. She somehow found time to actually read and write thoughtful comments on our weekly reading responses -- and this despite their being 2-3 pp single space, and the class numbering over 20 students. Bender brings a cultural sensitivity to the material that some others in the field might lack; and she does not speak in the god awful theory-speak that some others do who traffic in this material, thankfully. I might have wanted a slightly different reading list, one more chronologically arranged and that moved through the history of the discipline and along more narrow lines (as opposed to more episodic, eclectic readings more or less in the sociology & anthropology of religion, but this was not the course's orientation). On its own terms, it was decidedly a success. I continue to draw upon much that I learned in the course in my grad work.\nWorkload:\nBrace yourself. Weekly response papers of 2-3 pages, single space, which she reads carefully. Three written assignments (2pp each) meant to familiarize you with the profession. A research paper of 15-20 pp or so. Some of the hardest 3 credits you will ever earn.\n"
        },
        {
            "course_name": "Sociology of Religion",
            "review_date": "January 17, 2006",
            "review_content": "\nThis class was \"obvious\" as she would always say. I would say \"waste of time.\"\nWorkload:\nRegular.\n"
        },
        {
            "course_name": "Sociology of Religion",
            "review_date": "January 20, 2004",
            "review_content": "\nThis was an awesome course!  Bender is honest, nice, helpful, funny, prompt when answering email, and encourages students to think critically about the texts rather than take them at face value - a really important thing I wish more sociology professors did.  Class discussions were usually interesting and she's good at not getting too derailed.  The course is a 4000-level course but it didn't seem any more difficult than 3000-level sociology courses, so go figure.\nWorkload:\nWeekly 1-page response papers and a final research paper.  No midterm or final - you don't even really need to take notes, since you won't be tested on in-class material.  She does take attendance and grade your participation.\n"
        },
        {
            "course_name": "Junior's Colloquium",
            "review_date": "May 17, 2002",
            "review_content": "\nThis course was a good experience. The readings were, for the most part, pretty interesting and a useful introduction to the study of religion. Discussions were usually lively, and the class has a good \"vibe\" -- lots of joking around. Prof. Bender is very nice and a good discussion leader, as was the TA. But not giving us a break in a two-hour long discussion class is pretty rough.\nWorkload:\nThree 4-6 pp. papers, written on the topic of your choice but relating to the readings done in that \"section\" of the syllabus (figuring out a topic was by far the hardest part); take-home final consisting of three short essays (500-700 words) and one longer essay (about four pages). Readings are heavy but skimmable.\n"
        },
        {
            "course_name": "W3270 Sociology of Mass Media and Pop Culture",
            "review_date": "December 31, 1999",
            "review_content": "\nShe has her ups and downs, but for the most part its easy to stay awake during her class. Bender is young and can connect well with the students, bringing in her own personal experiences and outside case studies to liven up material. One of the better lectures I've taken. Workload: easy - the readings are interesting (some are even taken out of popular magazines), though sometimes dated. weekly memo, one paper and midterm/final required.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nProf Bender's CC section leaves a lot to be desired. She has students do presentations for each class while she sits back and nods. When she does participate in class discussion she can be unintentionally obnoxious and downright insulting. She never gives breaks in the middle of class and towards the end of class nearly everyone is snoozing. The odd look on her face leads many to believe she is perpetually stoned.\nWorkload:\nShe grades somewhat harshly, but she allows students to do rewrites on the last paper. She grades the class on a curve so you will most likely get a decent grade. She assigns 8 one page memos which are very annoying. The midterm and the final aren't that bad. 3 papers, 8 memos, midterm, final.\n"
        }
    ]
}