{
    "prof_info": [
        {
            "prof_name": "Terryanne Maenza-Gmelch",
            "prof_id": 2870,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "December 08, 2016",
            "review_content": "\nIf you're thinking about taking Environmental Science lecture and lab keep in mind that Peter Bower no longer teaches the first semester!! Terryanne teaches it and she is AMAZING. Very passionate and accomplished and easy to approach. The class is incredibly interesting, well-rounded, and grounded in current events. I worked at a park over the summer and I was able to apply so much of what I learned to the job - fish identification, river currents, and bird identification.\nWorkload:\nThree in class exams, a few lab reports, and many smaller quizzes. All very manageable if you go to class and keep up with work!\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "December 08, 2016",
            "review_content": "\nGood way to fulfill your science requirement without too much work. Professor Maneza-Gmelch realizes this and is very accommodating for those of us who were just taking the class for this reason. I had her for lab as well and her genuine enthusiasm and passion for the subject shines through at all times. \nWorkload:\nModerate - if you want to pass the tests, definitely do the homework. It is not difficult but occasionally time-consuming. \n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "December 08, 2016",
            "review_content": "\nGreat way to fulfill science requirement with minimal stress and workload! I had Terryanne for lab and lecture and she is very pragmatic and concise. She wants every student to succeed and tries to make it as easy as possible to do so. She emphasizes exactly which concepts you need to know for exams, and always uploads all lecture material to courseworks for easy access. She's got an adorably dry sense of humor and is a total delight, always. \nWas never annoyed about anything she did. Great professor great person great course!!\nWorkload:\nThree exams (mostly multiple choice, fill in the blank, and very short short-answers) and a (VERY easy, all multiple choice) final. Super simple labs each week, one on a boat and one in the park to bird-watch!! \n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "December 08, 2016",
            "review_content": "\nGreat way to fulfill science requirement with minimal stress and workload! I had Terryanne for lab and lecture and she is very pragmatic and concise. She wants every student to succeed and tries to make it as easy as possible to do so. She emphasizes exactly which concepts you need to know for exams, and always uploads all lecture material to courseworks for easy access. She's got an adorably dry sense of humor and is a total delight, always. \nWas never annoyed about anything she did. Great professor great person great course!!\nWorkload:\nThree exams (mostly multiple choice, fill in the blank, and very short short-answers) and a (VERY easy, all multiple choice) final. Super simple labs each week, one on a boat and one in the park to bird-watch!! \n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "December 08, 2016",
            "review_content": "\nGreat way to fulfill science requirement with minimal stress and workload! I had Terryanne for lab and lecture and she is very pragmatic and concise. She wants every student to succeed and tries to make it as easy as possible to do so. She emphasizes exactly which concepts you need to know for exams, and always uploads all lecture material to courseworks for easy access. She's got an adorably dry sense of humor and is a total delight, always. \nWas never annoyed about anything she did. Great professor great person great course!!\nWorkload:\nThree exams (mostly multiple choice, fill in the blank, and very short short-answers) and a (VERY easy, all multiple choice) final. Super simple labs each week, one on a boat and one in the park to bird-watch!! \n"
        },
        {
            "course_name": "Environmental Science 1",
            "review_date": "January 26, 2012",
            "review_content": "\nOh my god, I am obsessed with Terryanne. She was my lab instructor for Environmental Science 1, and she is amazing. She is so chill, funny, and cares about the lab work just enough- to the point where she'll be reading some instructions and then say \"Oh that's stupid, let's not do that\". She is very approachable and always lets you out of the lab at least an hour early. I have her again this semester for part 2 of the course and I am very excited!\nWorkload:\nLab reports each week, other small lab assignments. Ask for help!\n"
        },
        {
            "course_name": "Environmental Science 1",
            "review_date": "December 20, 2006",
            "review_content": "\nBEST TA! Definitely helpful, understanding, fun, nice, not a scary lab TA. Go with her lab days, switch into them, whatever yu have to do. She makes this painful lab soooo much better, and you get out early, and she always is completely understanding with work/lateness/confusion. \nGET HER!!\n"
        },
        {
            "course_name": "forests and environmental change",
            "review_date": "March 29, 2006",
            "review_content": "\nthis class is so much fun. well, sometimes its a drag meeting one time a week for so long, and sometimes it got a little quiet with just 10 people, especially when 2 or 3 didnt show up, but Terry-A is a funny person and loves dendroecology like no other woman. she is very chill and doesnt make you work hard although the harder you work, the more touched she is. this class was enjoyable and the workload was pretty light. a couple lab write-ups, a final project, and short reading quizzes that i dont think she actually counts.\n"
        }
    ]
}