{
    "prof_info": [
        {
            "prof_name": "Mike Neuss",
            "prof_id": 10032,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Ancient Greek History, 800-146 BC",
            "review_date": "December 22, 2009",
            "review_content": "\nAfter taking this course, I'm firmly convinced that Billows received his education in the Spartan \"agoge\" and eats lunch with his \"syssitia\" every day. This guy loves everything Ancient Greece, and he certainly loves to discuss every detail of a \"hoplon\" shield and the tactical formations of a Macedonian phalanx, and how the Macedonians kept Persian cavalry charges at bay with their \"sarissa\" long pike.\nAs you can imagine, this class is mindnumbingly boring, especially at 10:30 in the morning. Basically class is structured around Billows writing 20 terms on the blackboard, and then he gives a lecture where he goes over all the terms, and underlines each and every one as he covers it. It's basically a long stream of dates and people, and its just gets to be pretty unbearable after awhile. \nClass goes over by at least 15 minutes every day, which really got on my nerves.\nThe thing is...despite the fact that the class is boring, it's SO EASY TO DO WELL. I mean, the pragmatic person (Pericles was the archetypal pragmatist, Billows emphasizes) would suffer in the short term to benefit in the long run. When it comes to the midterm and final, Billows gives you a list of like 120 terms, which is basically miserable to go through each and every term, but if you want to do well, just suffer and go through them all and write up some notecards.\nDespite suffering, it's not hard to get an A in the class. Mike was an excellent TA, probably because he didn't know anything about Ancient Greece. We talked more about historiography and how to read ancient texts and what information we can glean from texts like Herodotus and Thucydides.\nHere's some tips: go to section, don't go to lecture all the time, meet with your TA about the paper, READ FREEMAN'S Greek Achievement, read the LitHum sections of Herodotus, read the Melian Dialogue from Thucydides, read Robert Kagan's Peloponnesian War (quick read), don't even buy Plutarch or Polybius. \nYou can do it. Trust me. \n\nWorkload:\nMidterm, finals, term sheets for midterm and final, and do the tips I said above.\n"
        }
    ]
}