{
    "prof_info": [
        {
            "prof_name": "Christopher Harwood",
            "prof_id": 1826,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Czech I",
            "review_date": "December 23, 2010",
            "review_content": "\nGreat class, great professor. I came into the class not knowing any Czech, and left with a remarkable understanding of grammar, culture, and composition. I recommend this class to anyone remotely interested in learning the language. Harwood describes the material with engaging class exercises and assigns challenging assignments. Very demanding workload, not to be taken lightly, but pays off big time. Harwood knows all there is to know about grammar and can answer any question that comes up in and out of class. In addition, he encourages attending Czech conversation hour, where discussion is practiced in live situations. \nWorkload:\nDemanding hands down but very fair and worth wile. No busy work. Class runs in a pattern of two weeks. Week one: Composition A and exercises in the workbook. Week two: Composition B and studying for the chapter test. Very challenging chapter tests every two weeks that come faster than desired. Compositions are short paragraphs, applying the grammar learned in class. \n"
        },
        {
            "course_name": "the writers of prague",
            "review_date": "June 03, 2009",
            "review_content": "\nHarwood is BRILLIANT. He really knows his stuff and makes a rather boring topic quite interesting! YOU'LL BE A BETTER PERSON AFTER TAKING A CLASS WITH HIM. He is an absolute genius when it comes to Czech literature. He can be somewhat boring at times, but is quirky and interesting for the most part.\nWorkload:\nlots of reading, but you don't actually have to do all of it. in class midterm and 15 minute presentation on a topic of your choice. and then you can choose between an in-class final or writing a 15 page paper... i'd opt for the in-class final. the midterm and in-class final weren't challenging at all. the questions had all been discussed previously in class. oh, and you REALLY should attend his lectures. they are totally worth it!\n"
        },
        {
            "course_name": "Postwar Czech Literature",
            "review_date": "April 23, 2009",
            "review_content": "\nHe's an excellent language professor and his literature classes are very engaging. You can tell he knows what he's talking about. In fact, you get the feeling he knows way more than you ever will. A real Renaissance man. Harwood's very approachable though formal, so don't try any monkey business haha. But, you know, I respect professionalism; makes me think for a second that this here fine establishment is actually an Ivy League school. I mean, it is, but well, I think you get what I'm saying. Lectures/ discussions are really enjoyable and he makes plenty of references to outside works, philosophy, history, art, film etc so you'll come away knowing some interesting bonus facts. Which isn't to say he digresses. He's really organized and speaks clearly. Anyway, take his classes! \nWorkload:\nReally reasonable, just read the books and come to class to discuss their amazingness! (I liked all the works on the syllabus). A mid-term and a final exam(which is replaceable by a paper, at least in the class I've taken). \n"
        },
        {
            "course_name": "First-Year Russian I",
            "review_date": "January 20, 2008",
            "review_content": "\nEven though he usually teaches Czech, he is a superb Russian teacher. He really knows what he's talking about, and can be really funny and engaging. He's very accommodating if you need to meet with him outside of class. That being said, he's a pretty harsh grader, and I never did find out what his policy on grading homework was...\nWorkload:\nThe same as all intro to russian classes: a few workbook exercises daily, a test every other week. An extensive oral and written final.\n"
        }
    ]
}