{
    "prof_info": [
        {
            "prof_name": "David Adamcyk",
            "prof_id": 13137,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 13, 2015",
            "review_content": "\nI thoroughly enjoyed my time in David Adamcyk's section of Music Hum, despite the fact that it was an 8:40 am class. I think he gave a solid overview of music from the Western tradition at a good pace, while managing to cover many contemporary music concepts. \nHe has a separate website for his Music Hum class, which is super helpful and contains the lesson plan for each day, links to supplementary listening/concert venues/terms, and information about papers and exams. Each day, one student is assigned to pick any kind of music to present during the first five minutes of class; this is fun because it relaxes the atmosphere and you learn a bit more about your classmates. The class explicitly follows this schedule and we covered everything from Medieval music (Hildegaard von Bingen, Palestrina) to Minimalism (Reich, Cage, Glass) and Jazz. Of course, the most famous classical music composers such as Haydn, Brahms, Mozart, and Bach, are covered. He was very patient in going over key terms and material, and even as a student who has had extensive training in classical music, I found the course very illuminating when we learned about technology's role in music (think Moog synthesizers, multi-track recording process).\nAt first, I was intimidated to take this section of Music Hum when I learned he was a composer. I suppose I had some warped perception that composers would be harsher in terms of hearing students' opinions about music, but (at least in this case) I was wrong. David was very receptive to student opinions and will kindly give you his feedback on your ideas without being intimidating. \nThe concert reports were graded leniently and the midterm and final were straight out of class notes. I wouldn't bother buying the recommended book; there's an online version of it out there, anyway, and if you take good notes, you won't need it. \nI highly recommend this section. I regret not meeting with him one-on-one, which was due in part to the fact that he only has office hours by appointment, but I think many of my classmates found talking to him about their concert reports super helpful. Once I got to know David a little better at the end of semester, I found him pretty hilarious and charmingly quirky. \nWorkload:\n2 concert reports (first is 15%, second is 25%)\n1 midterm (listening, multiple choice)\n1 final (listening, multiple choice essay)\nReally light workload and you learn a lot. How a Core class should be.\n"
        }
    ]
}