{
    "prof_info": [
        {
            "prof_name": "Sonja Drimmer",
            "prof_id": 3357,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 16, 2012",
            "review_content": "\nDrimmer is awesome. Incredibly nice, enthusiastic and clearly an expert in her field. She works very hard to make sure class lectures/discussions are enjoyable and clear. One of my favorite professors at Columbia. It is clear she genuinely cares about all of her students and enjoys teaching. I came in expecting to just tough it through art hum, as I had no genuine interest in taking the class, but came out feeling very appreciative. If she taught another art class, I would take it.\nOnly quasi-complaint is that the lecture slides are very bare - essentially just pictures of the artwork. This makes note taking during class very important in order to be prepared for exams.\nAlso as an added bonus, she is really good looking.\nHighly, highly recommended - she should be a gold  nugget without a doubt.\nWorkload:\nLight (not necessary) readings, two 5-7 page papers, take-home midterm, in class final. All very doable and fairly graded.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 08, 2008",
            "review_content": "\nProfessor Drimmer makes this required course worth taking.  The class was nowhere near as boring and irrelevant as I thought it would be, but she is also not a push-over.  Professor Drimmer is funny, engaging, and informative during class.  She also encourages participation, and starts from the basics so that nothing and no one is lost.  I actually enjoyed this class, which was completely unexpected.  If you take the papers and exams seriously, pay attention, and participate in class, you can definately achieve an A/A-.\nWorkload:\nreadings for class, almost all of which are short, 2 papers, midterm, final\n"
        }
    ]
}