{
    "prof_info": [
        {
            "prof_name": "Jeffrey Holmes",
            "prof_id": 1732,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Ethics for Biomedical Engineers",
            "review_date": "January 11, 2006",
            "review_content": "\nDespite the negative things said about Professor Holmes, while some may be true, I actually find that I get the most out of his classes.  Ethics was great.  He encourages different thoughts, opinions and viewpoints, and the discussions are engaging.  Just be sure you eat and nap before the class, so that you're attentative and awake during the long hours.  Holmes definitely knows everyone's names in the class, and he actually takes attendance while he's up there...so don't skip the class.  I pass him in the hall the day after I skipped one class, and he asked me if I was able to get good notes from a classmate because the topic discussed that night pertained to my final paper! He's got a really good memory, so don't fall asleep or skip the class.\nWorkload:\nNot bad, just participate in discussions and do the short papers. \n"
        },
        {
            "course_name": "Fluid Biomechanics",
            "review_date": "May 22, 2005",
            "review_content": "\nProfessor Holmes struck me as pretty bipolar on his perception of us as a class. While rumors circulated about how weak and stupid he thought we were, he smiled, held lecture, and even bought us pizza during finals.\nThe class, however and his expectations, are ridiculous. Besides going to class, he holds an unofficial discussion section which is more or less mandatory since test questions come out of it. Moreover, he will not discuss tests and HW during class, making his various office hours mandatory as well. On top of this, he has little to no curve, so every point you lose--is lost. He wears his MD/PHD like a sheriff badge, and thinks everyone whould have one.\nA difficult class, with difficult hw and difficult tests. Good luck.\nWorkload:\n5 psets. Each will take years.\n"
        },
        {
            "course_name": "Ethics for Biomedical Engineers",
            "review_date": "January 02, 2005",
            "review_content": "\nContrary to most ethics courses, Prof. Holmes managed to keep a class of burnt-out BME students (plus some grad and med students) awake on a Thursday evening. He likes to play devil's advocate on various issues and likes it when people argue with him in class. This is a discussion type class. The material is pretty interesting and the issues discussed could be used as \"ammo\" for medical school interviews. \nThe key to getting a good grade in this class, especially if you're not very comfortable talking in class of 60 is to sign up for the debates. There aren't many so make sure you sign up early. Oh, and don't sleep in class, Holmes knows, trust me! The grading is based on attendance (10 sessions), participation (3 points max), and the written assignments (3 points max). You are allowed to miss one class. If you sign up for a debate, you'll get one point for participation, while others need to speak-up in class several times before getting a point. \nWorkload:\nA couple (I think 3/4) of 1-page written assignments and a final 5-page assignment based on the topics disscussed during the semester. Oh, he assigns some pre-class readings sometimes, nothing difficult. No midterm, no final. \n"
        },
        {
            "course_name": "Ethics for Biomedical Engineers",
            "review_date": "December 10, 2004",
            "review_content": "\nDon't be decieved by Holme's engaging lectures. He is NOT a nice person. Granted, the class is really interesting, but Holmes' emphasis on the importance of participation lulls unsuspecting students into the mistake of actually participating. Those who participated on a regular basis actually got LOWER grades than those who said nothing, I'm guessing because he only noticed when the opinionated people had a quiet day. \nOn the other hand, I loved this class up until the arbitrary grades showed up (and you get NO feedback until grades are posted).  So if you want to, or have to, take this class, put extra effort into the writing assignments and be careful not to speak while attending every class: there are no excused absences (holmes won't tell you this up front). \nWorkload:\nisn't bad, but only if you can read minds and figure out what he wants you to do. \n"
        },
        {
            "course_name": "Fluid Biomechanics",
            "review_date": "September 22, 2003",
            "review_content": "\nThis is probably the hardest class in the BME curriculum, but the one where you learn the most.    Sherlock puts a lot of effort into the class, and expects an equal amount of effort in return.  If he feels slighted he takes it out on your grades.  The problem sets are all time intensive, but do-able if you put the work in.  Everyone usually fails the first hw, but then the grades even out as people learn they have to work harder, or just get the answers from the TA's.  So even though homeworks are 50% of the grade, they end up being a wash in terms of the curve.  Just do them and do them well.\nThere are three quizes that are open notes. The quizzes test more for how you approach a problem instead of specific material based questions.  There tends to be one or two easy material based questions, then two  qualitative questions to set the curve.  The easy questions come right out of the notes, and if you can read and write you should get them.   the qualitative questions make you think and are his way of testing your problem solving methodology and seeing if you \"think like an engineer.\"  Some of the questions don't even have real answers, so don't feel confined by reality if he is asking for possible solutions to a biomedical related problem.\nI found him approachable, even outside of office hours.  He hated my class, due to some prolific cheaters(some eventually receiving national pub) and he only gave one A from what I heard.  He liked the class before mine though, and gave 11 A's.  So either your grade heavily relies on his perception of you and your class, or my class was full of retards(take your pick).  He hates pre-meds and people who grub for grades, but is extremely helpful if you are actually interested in the material and work hard.\nWorkload:\n5 homeworks for 50%.  3 quizzes for 30%.  Final 20%\n"
        }
    ]
}