{
    "prof_info": [
        {
            "prof_name": "Martin Stute",
            "prof_id": 564,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Science Senior Seminar",
            "review_date": "August 27, 2011",
            "review_content": "\nI was reading some of the reviews on culpa, and decided I need to clarify. Martin is very approachable, and yes, his explanations are lacking, but that doesn't mean he doesn't try. I think he takes on way too much, which works to alienate his students. He's extremely busy between his 4999 carbon sequestration projects and 999 administrative positions. It's hard to find him, since he has no stable office hours, and sometimes he \"overlooks\" student emails. (I've had to track him down on several occasions because he didn't see my emails.) But then again, that's basically how the Barnard environmental science department works. With the exception of Peter Bower, who replies his students within 5 minutes on his blackberry with 3 word answers, the envsci department consists of talented, intelligent, yet awkward and hardly personable faculty. Even though he was my adviser, things were still very technical, and talks about aspirations are pretty much stifled. \nHowever, that being said, I do appreciate having been able to work with him during my undergraduate career. I have learned a lot and I think Martin really only wants to help. \nIf you are the type of person who needs moral support throughout this thesis process, Martin may not be your best bet. But he's someone that can refer you to renowned persons and he has some major connections at Lamont (...lol word).  \n\nWorkload:\nDepends on your thesis. \n"
        },
        {
            "course_name": "Environmental Data Analysis",
            "review_date": "December 16, 2008",
            "review_content": "\nMartin is very nice and clearly wants to help students. He definitely knows what he's talking about, but often his explanations are lacking. At the beginning of the course, it all seems simple and easy-going but as the semester goes on (at least in martin's half) many of the labs/homeworks and exams cover things that I personally didn't feel comfortable with. It is also IMPOSSIBLE to reach Martin by email so don't bank on that when you're struggling over the assignments.\nWorkload:\nHomeworks and labs, 2 exams\n"
        },
        {
            "course_name": "Environmental Data Analysis",
            "review_date": "April 06, 2004",
            "review_content": "\nHe is a very straight-forward fellow.  If you're an unreasonable person with unreasonable expectations, then you'll find him an unreasonable beast.  If you behave like an adult and are honest with him, he is quite reasonable and even accomodating.  The course doesn't go over very much material as far as the average classes here go, so there's a lot of time for questions and actually understanding the material.\nWorkload:\npractical problem sets, a couple of labs to give you practice writing up lab reports, a midterm and then a GIS segment (he doesn't teach this part)\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "March 07, 2004",
            "review_content": "\nCome on people -- the man is an coldhearted unapproacheable s.o.b.  I felt like I was going to my execution everytime I went to his office hours (he was my senior advisor).  He offers no support to seniors that are not writing hard science theses, making people who are trying to write innovative works about the integration of environmental science into the real world (not dissecting frogs for the sake of research) feel sorry they ever took the high road.  The sad part is that if you are a env. sci senior, you cant avoid him.\nWorkload:\nIt's your thesis, not the end of the world.\n"
        },
        {
            "course_name": "Environmental Science Senior Seminar",
            "review_date": "December 21, 2003",
            "review_content": "\nHere is one case where you can judge by appearances. Martin looks like a teddy bear, and acts that way too. He's a brilliant hydrologist, but also a truly kind human being. He's sympathetic, understanding, occaisonally funny, a fair grader, and an excellent teacher who really cares whether or not you understand what he is saying.\nWorkload:\nThis is a thesis class. 'Nuff said.\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "March 31, 2001",
            "review_content": "\nHe is always willing to help with the data analysis and for someone who is involved with so many research projects you wish he would speak more otfen. Unfortunately he splits time between here and lamont so sometimes he is unavailable but he tries to make room for everyone. E-mail is the best way to reach him.\nWorkload:\nits the thesis class - expect hell for the most part and bliss at the end\n"
        }
    ]
}