{
    "prof_info": [
        {
            "prof_name": "Will Glovinsky",
            "prof_id": 13262,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Lithum",
            "review_date": "April 13, 2020",
            "review_content": "\nWill is the best! He is super understanding when it comes to extensions, not being able to read everything in time for class, and when you're dealing with any real world issues. Although I was rarely able to complete the reading for each class (procrastination/I'm a slow reader), I always had opportunities to participate and still had something to say when we did small group discussions. Unlike some people in the class, I'd never read any texts on the syllabus, but Will managed to instruct in a way that I did not feel left out or behind in discussion. Our class was pretty laid back mainly because of the tone he set. For our second semester, he added discussion posts to our syllabus (only 6 throughout the semester). But since he's young and flexible, he allowed any posts ranging from creating a meme relative to the text, writing about a Netflix show/song, etc. \nHe also taught the class in an amazing way and made sure we got a full gist of important themes/ideas that would be covered on the midterm and final. He acknowledged things that other teachers might avoid (rape/sexual assault, violence, misogyny). He allows flexibility in interpretations of different texts, whereas many of my high school teachers would assume their interpretation was the right interpretation. Overall, just the kindest, most reasonably challenging, and helpful teacher from my freshman year. \nWorkload:\n- pretty standard lithum workload \n- break halfway through class\n- grades very generously on midterm/final (doesn't seem to take more than 3 points off for passage IDs you don't know), but grades more harshly on papers (allows a rewrite for the first paper if you're not happy with your grade)\n- midterm only had quotes we had gone over in class \n"
        }
    ]
}