{
    "prof_info": [
        {
            "prof_name": "Emily Thibodeaux",
            "prof_id": 12252,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Beginning Fiction Writing",
            "review_date": "May 22, 2012",
            "review_content": "\nRun away as fast as you can if you want to save your GPA! Emily hides exercises in order to lower your grade in case she doesn't like you. Don't worry, you don't need to make much of an effort to rub her the wrong way: it can happen right off the bat, in the first class. For no apparent reason. \nHere's what she did to me: she lied, lowering my grade saying I didn't turn in 4 of the exercises. I turned in all the exercises except one, meaning: she could only take points off of one exercise, not of four. She lied to the head of the Creative Writing department when I complained about it.\nEmily doesn't teach you, nor does she explain you anything you have doubts about. You can stay after class, or email her - nothing works. She won't explain it to you, but let you know you fell short of her mysterious criteria only on finals week, when you can't possibly do anything about it. It doesn't matter that you spent the WHOLE semester asking her. She WON'T answer you if she doesn't like you, or your face doesn't please her. \nShe emailed the class the guidelines for the final portfolio only on finals week - only 4 days before the portfolios were due. The guideline for your final portfolio is something other professors hand out to you AT LEAST 2 weeks prior to the due date, and especially not on finals week.\nThe whole class complained about her disorganization. More than one person didn't bring their workshop pieces on time because there wasn't a spreadsheet or a list with the names of the workshoppers and when they were workshopping. Students complained they got confused, too, and that it would have been much easier if she had distributed a list, or if she was a little more organized.\nHer critiques to your work are superficial, and don't add much to the quality of the revision. I had to revise using a peer's critiques as my guideline for revision because Emily's critiques were empty. \nShe arrived late for class in the final 3 weeks of classes, but she would take away points from you if YOU arrived late. Obviously she operates using double-standards.\nShe WILL lower your GPA based on her liking or disliking of you. She is the worst teacher I've had at Columbia so far. I had never in my life had a teacher that would go to the lengths of lying about a student's exercises only because she didn't like the student.\nHORRIBLE TEACHER. \nWorkload:\nA lot of reading per week, critiques of peer's works every week, written exercises every week, and 3 workshops. The portfolio guidelines only come to you on finals week, just 4 days prior to due date. Keep an electronic track of your exercises, so she can't do to you what she did to me: lie about you turning in your work, just because she doesn't like you. \nShe takes points from you if you arrive late, even if it's 3 minutes late. \n"
        }
    ]
}