{
    "prof_info": [
        {
            "prof_name": "Edmund Phelps",
            "prof_id": 70,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Macroeconomics Seminar",
            "review_date": "November 06, 2006",
            "review_content": "\nhe is brilliant, but i couldnt understand him. he mumbles and rambles on to himself. he said you didnt need to know calculus, but it looked like there were derivatives or something on his exams. i managed to pass his class without learning or understanding anything. \n"
        },
        {
            "course_name": "World Economic Problems",
            "review_date": "December 29, 2004",
            "review_content": "\n Phelps' class is not for quasi-intellectuals.  Classes are only uneventful to those who are too dumb or too narrow to understand Phelps' jokes.  He is a classy intellectual who does not restrict himself to traditional economic examples to make his point.  \n"
        },
        {
            "course_name": "World Economic Problems",
            "review_date": "November 10, 2003",
            "review_content": "\nHe is by far the worst lecturer I've had at Columbia.  He briefly touches on the topics in his syllabus and then proceeds to ramble on about any musing he may have.  It is VERY hard to stay awake in this class, due to his uneventful lectures.  The midterm and final are very easy if you've done the reading and attended a few of the lectures.  He's partial to one and two page midterms and finals respectively, favoring matching and fill-in-the-blank questions.  If you don't like to read, don't take this class.\nWorkload:\nLots of reading (the reading list was over a dozen pages by itself), Midterm, Final.  \n"
        },
        {
            "course_name": "World Economic Problems",
            "review_date": "December 31, 2002",
            "review_content": "\nAn ingaging and inspirational professor, who has lived through quite a bit (he's in his 70's), but is apt to tangent and have lectures that seem to have no point and go no where.  There is not homework for the class, but the reading list is daunting, and most students just gave up and read nothing. Not the way to go if you want to do well on the midterm and final, where a third of the exam is matching authors with their tenants.  It's a good class if you want a basic understanding of where economics came from (like moral philosophers like Adam Smith, or  Hayek, and today's philosphers like John Rawls), and where it's headed, which is pretty necessary if you want to do graduate work in economics. \n\nWorkload:\nAbout 100-150 pages of dense reading per week. One matching/short answer midterm, and one matching/short answer/essay final. \n"
        },
        {
            "course_name": "Macroeconomics Seminar",
            "review_date": "December 31, 1999",
            "review_content": "\nVanilla lecturer who inspires more students to skip his classes than to attend. Readings are voluminous and may bankrupt you if you try to xerox them all, but they are the keys to exams. Past midterms have completely eschewed conceptual knowledge in favor of the \"Who said this...?\" genre you saw in Lit Hum. One to avoid, but then again, he is famous.\nWorkload:\nWorld Econ:Midterm & final exams.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 31, 1999",
            "review_content": "\nMiserable, miserable lecturer who digresses, mumbles, drones, and clears his throat a million times to make one point per class--and then complains that attendance is low! My semester, he got angry that no one was coming and lowered the mean to a B-. Fortunately (?), the tests are easy. That just means, however, given the bad curve, that the lucky (not necessarily the smart) make off like bandits. The mean is high, the standard deviation is low and because you lost partial credit on one question you go from A- to B. With the advent of Heenan, the TA, you don't need to go to class *at all*. Just go to recitation and read the book and you're set.\nWorkload:\nmidterm, final, and two 8 pg papers (recently added).\n"
        },
        {
            "course_name": "World Economic Problems",
            "review_date": "December 31, 1999",
            "review_content": "\nThough Phelps is notoriously boring, if you can stay awake, you'll learn lots. He is very knowledgable with lots of first-hand experience - going to all kinds of international economic advisory conferences, etc. The information covered (the recent economic and political history of various countries) will make you much more informed about current events and politics. At least he's more liberal than most the econ professors.\nWorkload:\n2 easy midterms (more like quizzes) and a final (like a long quiz)\n"
        }
    ]
}