{
    "prof_info": [
        {
            "prof_name": "Sinisa Vukelic",
            "prof_id": 12947,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Machining",
            "review_date": "May 12, 2016",
            "review_content": "\nHate the ivory tower? Fancy a career focused on manual labor? Well...there's a class for you! The two scariest people in Mechanical Engineering, Sinisa Vukelic and Mohamed Haroun have teamed together to teach you how to cut metal!\nJokes aside, this class is a lot of work. It's also potentially dangerous. Like you could die if you're not careful. Perhaps the only other class where this is possible is PE scuba. Look up \"industrial lathe accidents\". Anyways...\nI took the class pass/fail during an experimental phase, so I don't know what direction Prof. Vukelic plans on taking it in (I'm not even sure you'll get to choose whether or not to take this class). I do, however, know that it will likely still involve machining 4 parts, writing G-code (machine assembly language), attending lectures and taking a few brief 10-minute quizzes.\nThe parts take time to machine accurately, probably averaging 8+ hours each. Also, you're going to constantly be asking the lab-tech for help-- if they're not around, you're stuck. The machines are in high demand. You end up pointlessly having to walk to Mudd only to discover the lab-tech isn't around/the machines are all booked.  \nWorkload:\nmachine 4 parts (1 manual mill, 2 CNC mill, 1 lathe), MasterCAM a part, write G-Code to simulate cutting a raised letter\n"
        },
        {
            "course_name": "Computer Graphics and Design",
            "review_date": "June 07, 2014",
            "review_content": "\nIn short, this class wasn't quite what I expected and apparently was different from previous years. Hopefully this new professor will find his groove and change the layout of the course. The course is split in two, with one day in the computer lab and the other day in the classroom. The lab day consists of an assignment, where you try to get as much done in class and the remainder is your homework. The classroom day is focused on not falling asleep, if you even show up, and you might catch some tips on sketching, dimensioning, or tolerances. The main assignments are all from one book, which does have some good tutorials but includes some obnoxious questions that the TAs weren't sure on. If you get anything out of this course, it should be CADing parts effortlessly, dimensioning and tolerancing drawings, and understanding basic design intent. Some non-ME students took this class simply because 3-D modeling is very useful, and while PTC Creo is by all measures not the best program out there, you are much further along in figuring out other CAD packages as a result of this class.\nWorkload:\n11 assignments, 6 \"drawing\" homeworks, with a long midterm project (CADing a toy car) that is very similar to the final project (CADing a desk lamp). It appears that the grades students got were significantly lower in the Spring 2014 with this new professor than previous years. This class used to be a grade booster, so hope that it is when you take it.\n"
        }
    ]
}