{
    "prof_info": [
        {
            "prof_name": "Yuanjia Wang",
            "prof_id": 1527,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "August 03, 2005",
            "review_content": "\nI hate to say it, but this is really the worst worst course I've ever taken, and Wang is the worst teacher I've ever seen. Her teaching is so plain and boring. She just repeat the content from the textbook, but not as clear as the book. Reading books is much better than listening to her strong accent bad English. Very few extra examples and little explanation, no slides and study materials online. The worst thing is that she shows no heart in teaching, and just wants to finish a class as soon as possible and leave. She even seems has no passion for statistics!\nWorkload:\nAs about the homework, you probably think it's easy and feel good, but that's only because the homework is really too easy! Basically you can learn very little from this course if it's from wang. I strongly suggest not to take it.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "April 27, 2005",
            "review_content": "\nI totally agree with the previous two reviews. I should have come this website earlier if I knew it when I took the class. I really don't understand why the statistics department can allow such a bad teacher to teach. I lost all my interest in statistics after this class. All I learned is how to put the data into a formula. Wang is not friendly and bad at explaining concepts, and her broken English make it worse. In a  word, I will never never take her class again.\n"
        },
        {
            "course_name": "Intro to Statistics",
            "review_date": "July 08, 2003",
            "review_content": "\nWhat the previous reviewer said is true.  I did not end up attending class because it was just impossible to understand anything.  And in answering questions, her responses didn't always address what was asked.  Very disappointed with the class overall because all I learned was to plug numbers into formulas found in the book.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "March 27, 2003",
            "review_content": "\nSave yourselves!! I get the impression that every stats professor sucks, and Wang is no exception. She conducts the class like a nervous middle schooler, and her thick accent made me think that she was making up words (she actually isn't half the time). In the beginning of class she dumps a huge stack of homework in the front and then the class badgers her about grades and assignments.\nYou won't understand the lectures, and most people didn't even go (including me).\nWorkload:\nThe tests were open book and notebook, and the questions were deceptively easy - because they WERE easy, I second guessed myself 1000 times and redid each problem 1000 times as well. Weekly homeworks no one understands because no one goes to class, but you can still get an A on every one if it looks thorough.\n"
        }
    ]
}