{
    "prof_info": [
        {
            "prof_name": "Matthew Connelly",
            "prof_id": 1717,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "International and Global History Since WWII",
            "review_date": "January 03, 2013",
            "review_content": "\nJerk just about sums it up for this man.  There is no way you can take a course with Matt Connelly without having to swallow his condescension.  It's unbelievable and incredibly disempowering.  He is also very lazy which will make you feel like your thousands of dollars of debt are going down the drain.  He is the typical researcher who is socially awkward and should not be teaching.  He is everything that is wrong with Columbia...professors who don't give a damn about their students.  He is passionate about history, very smart and can put together a great syllabus, but he is just not supportive in any capacity.  If you know what's good for you, don't take a class with him, TRUST ME.\nWorkload:\nHeavy \n"
        },
        {
            "course_name": "International and Global History Since WWII",
            "review_date": "April 16, 2010",
            "review_content": "\nEven though I've taken other history courses in the same time period, this class made me realize I only knew the bare outlines. The workload is intense but you can get used to it- many long articles and a \"reading response\" that's more like a short essay, due every single week. Personally, I found you actually have to do at least most of the readings to at all figure out what's going on in class and in the discussion section, but I think some people seemed to slide by with only skimming.\nThe class is focused on International history, with some classes dealing with the Cold War US-USSR dynamic, and other classes on alternative angles of viewing the era, like the rise of third world nationalism. I disagree with the other reviewers who said Connelly only focuses on America, he does talk about it often but not at all exclusively. He's also really knowledgeable about history in general and the Algerian anti-French revolution (one of the other readings we did actually quoted him on it, not in a big-deal kind of way, but it was cool) and on nuclear weapons and proliferation.\nConnelly stays pretty balanced on controversial issues and really gets into questions about what caused different events and what motivated the different players to act as they did. He makes a point of pausing in class to ask if anyone has questions, and even if your question doesn't get answered then, there's always the discussion section. The lecture is almost always interesting and is a great, thought-provoking overview of all the material the course covers.\nSome of more interesting readings were the primary source documents on private conversations between JFK, RFK, McNamara, etc or Brezhnev, Kissinger and others. Nothing beats reading a stack of documents that say \"Top Secret: The White House\" on the subway, especially if you hold them so that the \"declassified\" stamp and the 1973 date aren't visible to the people sitting next to you.\nThe ten page midterm now is given over five days (it used to be less time but Connelly decided that he wants students to actually have time to think over their ideas/sleep/have a life) which was pretty doable though challenging. I haven't taken the final yet but I think it's going to be similar.\nOverall, I'd reccommend this class to anyone really interested in understanding the international/global perspective on the world of the past 50 years, how it got to be the way it is now, and willing to invest some time in finding out how it all works.\nWorkload:\nEvery week there are textbook readings, 3-5 longer articles from other historians plus several more short ones, and a reading response to post on Courseworks based on all the readings, due before the discussion section every week. Take home midterm and final each given over a few days.\n"
        },
        {
            "course_name": "International and Global History Since WWII",
            "review_date": "July 18, 2006",
            "review_content": "\nI have very mixed feelings about this class. International and Global History is sort of a mis-statement given that most of the material is focused on American History since World War 2, or at the very least the US' involvement in world events. Nevertheless, this class is great for those interested in that type of history. I also feel mixed about the class style. The lectures were interesting, and it was okay to skip a few here and there and not get behind. However, the midterm/final situation was horrible. You had to write two 6 page essays basically in 48 hours based on a packet of filled with many very long and boring articles. The very small time requirement was very strange to me, and I don't think allows people to write very good essays, but that could just be my opinion. Also, Prof. Connelly is not the warmest professor.\nWorkload:\neasy except for the heinous midterm and final\n"
        },
        {
            "course_name": "Europe and the End of Empire",
            "review_date": "January 01, 2006",
            "review_content": "\nWriting a CULPA review for Matthew Connelly is extraordinarily difficult, because I have not yet decided if he's truly an asshole, or just incredibly awkward.\nHe comes accross as very arrogant and at times condescending - but I don't think maybe he just lacks people skills. He seems not to have mastered (or simply doesn't care about) the way you should address or speak to another human being. Any communication with him often makes you incredibly angry, and he can be very curt, and often shows no concern for you as a person or a student (he's not a mentor type).\n As a teacher, I would best describe him as a lazy hard-ass. Other than selecting a syllabus (which I'll admit, was pretty good), he seems to put very little effort into the class (in fact, he admitted that his research, and not his teaching, was his main priority), but he expects a lot from you as a student. This sucks, because when you have a professor who expects a lot, but is not inspiring, comes accross as an arrogant jerk and doesn't seem to be putting a lot of effort into the class, other than for your own personal gain, you feel no desire to put any effort into the class. \nThe workload was strange. The readings were often interesting, but sometimes needlessly long (a 300-page assignment in the course packet would be discussed for all of 10 minutes in class). The novels he selected are interesting now that I'm reading them over Winter Break, but I simply just didn't have time to get into them during the semester, and my classmates on the last day said the same thing. The other readings varied from interesting to totally unreadable. The discussions also varied depending on how much everyone had to say, and how good a job the presenter(s) did of leading them.\nAs someone said earlier, Connelly loves historiography. I hate it. I suppose the historiographical debate is important in a class about decolonization, but that certainly wasn't what I thought I was signing up for. It surfaces again for the final 20-page assignment (other than the weekly readings and in-class presentation, your only assignment for the class), where you have the option between producing an \"original contribution\" via a research paper (by locating or uncovering new documents - i.e., totally impossible when you're a full-time Columbia student), or you can write it about the historiography of a certail event about decolonization. In theory there's an option there, but the reality is very different. \nSince receiving my grade, I've decided that most of my hard feelings towards Connelly resulted from the fact that I felt that I could never achieve the standards he was expecting. The final grade I received - about three grades higher than I was expecting - softened these feelings, but I decided they didn't quite erase how miserable I felt for the whole semester. The class's material is fun - you explore everything about decolonization starting around World War I and going all the way through (Egypt, Interwar, India, Indochina, World War II, Post-War Africa, Soviet Union) and finally end with three classes on \"Is America an Empire,\" which we all enjoyed a lot. Connelly occasionally destroys this, and can be kind of a jerk, and in the end, its really hard for me to say whether or not how interesting the class's material was makes up for how unpleasant and awkward it is to sit in a classroom with Connelly for two hours every week. \nWorkload:\nWeekly readings ranging from 40-300 pages a week (usually around 100-120), leading of one class discussion, 20-page paper. \n"
        },
        {
            "course_name": "International and Global History Since WWII",
            "review_date": "October 18, 2005",
            "review_content": "\nI agree with the positive reviews.  I thought this was a very interesting class; the lectures were very interesting, people were really animated and had real debates in discussion, and I liked Professor Connelly's lecture style.  The readings were really very interesting; I think any history person should like reading the transcripts of JFK and RFK arguing about what to do about the Cuban missile crisis.  Also, I definitely thought it was organized, and you could see how there were a few different intertwining and continuing strands.  To those who complain that it is too specific to certain subjects and perspectives: maybe you should have considered that a course with such a broad topic will have to concentrate on particular parts of that topic.  And, yeah, the tests were a huuuuuge pain, but I really did learn a lot from them; more than I would have with another format.\nWorkload:\nA take home final and take home midterm.  Both are 2 essay questions, and each test is about 3500 words total (ie each essay is about 1750 words).  You'll have 48-72 hours, which will be the worst of your waking life.\n"
        },
        {
            "course_name": "International and Global History Since WWII",
            "review_date": "June 01, 2005",
            "review_content": "\nProfessor Connelly is a friendly-looking, black turtleneck wearing, sorta nice guy type of person. He's also pretty smart, all-ivy resume, however, he's rather disorganized and has the amazing ability of turning the most exciting sections of history into the most dry and boring 75min lecture ever. Almost all his lectures are powerpoint slides (he also likes to use a lot of animation, so pictures and words are flying into the slide from left and right). There were a couple of non-powerpoint lectures, but that was because his computer crashed, which happens quite frequently. \nI agree with the previous reviewers that Connelly takes a poli-sci plus American foreign policy approach to this course and therefore is different to what I thought I signed up for. He also takes his lectures from the reading material, so if you kept up with the heavy readings by chance one week, you'll realize that he summarizes the main points or takes the author's arguments and pastes them into his lectures. \nThe main problem I have with his class is the format of the midterm and the final. His questions are incredibly broad and for the midterm you had 52hrs (Wednesday 12:15pm till Friday 5pm) to write two essay questions with a 3500 word limit (12pages double-spaced). In other words, if you have class on Wednesdays and Thursdays, you're tight for time. He gave us 2 extra days for the final, however, it was due on the Friday of reading week and therefore that cuts into your studying time for other classes. \nWorkload:\nHeavy readings for each week to discuss in section (20%). Map Quiz (10%). \nMidterm (30%). Final (40%).\nThere are two coursepacks for this class, $45 and $52, both incredibly heavy and expensive...and the content is certain not worth $97 of your food and drink money. \n"
        },
        {
            "course_name": "International and Global History Since WWII",
            "review_date": "May 24, 2005",
            "review_content": "\nProfessor Connelly is a good guy. He's smart, approachable, and down-to-earth. \nWhat I think the previous reviewers are getting at is that the class is not what they expected. For History majors, the class is more like \"History-Lite\" and instead of focusing on well, strict history, it focuses more on foreign policy, especially economic policy and political economies in a way that is frustrating to many a history major. And, alas, the class does not provide much of an international perspective but mostly an American viewpoint--something that is very much Professor Connelly's fault.\nThat being said, I found the class interesting, varied, and a challenge. Connelly lectures with a lucid, \"I don't take myself too seriously\" manner that helps make the material more understandable than it might otherwise be. Of course, I was looking for a class about political economies and stuff, so it fit the bill perfectly.\nWorkload:\nLots of reading, some of which is very dense (history of post-war economic policy--ugh!). Occasional map quizes that yes, are very junior high, but are helpful nonetheless. A take-home final and midterm that consists of 2 essays totalling 3,500 words. And yes, they are very hard.\n"
        },
        {
            "course_name": "International and Global History Since WWII",
            "review_date": "April 28, 2005",
            "review_content": "\nWow, these other reviews are HARSH...Professor Connelly is a very nice professor and he does know what he is talking about, contrary to what these other reviews say.   I think this course's problems come entirely from its organization and the subjects Prof. Connelly chooses to focus on.  It is true that everything we study is from an American point of view, and it is like a repeat of Anders Stephanson's Foreign Policy class.  So I blame Prof. Connelly for not organizing the course better or presenting different perspectives on the subjects we studied.  But he is not an idiot.  The way the course was organized was the main problem.\nWorkload:\nWeekly sections w/ Courseworks questions; midterm; final (both 12 pages approximately.)  Not bad at all.\n"
        },
        {
            "course_name": "International and Global History Since WWII",
            "review_date": "April 26, 2005",
            "review_content": "\nin my opinion, this man is an embarassment to Columbia and to the history department.  His lectures are disorganized, superficial, and sometimes factually wrong.\nAt the end of the semester, I'm still not sure what the point was. I signed up for a history class, but this course is neither international, nor global, nor history. In fact, the only part of the title that is true to the course is \"since WWII.\" This is really a warmed-over U.S. foreign policy class, but if that's what you're looking for, don't waste your time and money here and take Anders Stephanson's infinitely better class.\nSomeone, please do something about this! In the meatime, avoid this bad joke of a course.\nWorkload:\nImpossibly hard take-home midterm, final, no paper. Required weekly section. A LOT of reading, much of which doesn't make sense and is political science, not history. TAs are great but there's only so much they can do with this  mess.\n"
        },
        {
            "course_name": "International and Global History Since WWII",
            "review_date": "March 17, 2005",
            "review_content": "\nI cannot agree more with the previous reviewer.  HOW DOES COLUMBIA LET THIS GUY TEACH HERE? To be fair, I dropped the class the last day I could, so maybe it got better, but it was awful.\nWorkload:\nI have but one thing to say: MAP QUIZZES. We are officially back in Junior High.\n"
        },
        {
            "course_name": "International and Global History Since WWII",
            "review_date": "March 04, 2005",
            "review_content": "\nIs this guy for real? I couldn't really figure out a reason he was there. You know how regurgitating the textbook is supposed to be bad? Well, that's all he got! There is no substance to what he says, nothing. I can't believe he is allowed to teach anything. Oh and he's really disorganized--he couldn't come up with a syllabus for the longest time and kept saying \"I don't know much about that, I haven't made up my mind.\" Yeah? NO ONE FORCED YOU TO TEACH A CLASS YOU WEREN'T READY FOR!!!! Unbelievable. I don't know if we have rights like getting people who are obviously below par kicked out but man, this guys is just the dumbest I've ever seen. \nOk. So I am a history major and I've taken other professors who knew their material and were able to convey a perspective (or many). And maybe it's just because he's new at this and he's too awkward. But I really don't believe that's the issue because you can't make up the stuff the outrageous stuff he says.\nWorkload:\nThe class is so dumb and disorganized, make sure you know what your TA wants.\n"
        },
        {
            "course_name": "Europe and the End of Empire",
            "review_date": "January 10, 2005",
            "review_content": "\nFriendly and approachable professor.  The course covers a wide area (geographically and historically) of material which can make it a bit intimidating.  However, Connelly spends most of the time talking about his own work and when there is class discussion, it tends to be dominated by a few opinionated people.  Overall, an okay course, although the quality of the discussion varied greatly on who was presenting, and usually left much to be desired.\nWorkload:\n1 20 pg paper, 1 presentation (written and oral).  A fair bit of reading, but it is not necessary to do it all.  Connelly incorporates some novels and which are undoubtedly the best part of the syllabus.\n"
        },
        {
            "course_name": "Europe and the End of Empire",
            "review_date": "September 01, 2003",
            "review_content": "\nQuirky and adorable professor.  Obsessed with historiography.  This was a seminar, but he actually talked quite a bit which was helpful if you hadn't read or annoying if you wanted to discuss.  Very knowledgeable and doesn't make you read his own book (surprising behavior for a CU professor).  Very willing to help out his students and overall nice and informative professor\nWorkload:\nOne presentation and one 20 page paper.  Not bad for a seminar.  Does not give you any grades however, until your final paper, which might make you a bit anxious\n"
        }
    ]
}