{
    "prof_info": [
        {
            "prof_name": "Natalia Mosina",
            "prof_id": 3112,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "July 07, 2009",
            "review_content": "\nI thought she was fairly clear in explaining concepts, though poor at understanding what students were asking her or saying to her.  She was condescending and acused the class of not studying, when I'm sure that at least a few studied and could not answer the questions she asked.  Her grading was fair, and she did seem to put some effort into her lectures.  The workload was perfectly managable.  I thought she was an okay professor.\nWorkload:\nSummer session, one homework per week, about 30 problems each, two midterms and a final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "March 20, 2008",
            "review_content": "\nIf you're looking for a professor who will explain Calculus step-by-step, steer clear of this one. The previous reviews are rather nice to Prof. Mosina, but after taking Calc I  with her, I don't see why. Maybe if you already took Calc in high school, then she would be an ideal professor, but if Calc is brand-new for you, Mosina is bad news. Her workload was not anything killer (just don't do it the night before), but she can't teach. She's the type of professor who talks to the board, asks people for questions and and answers them in a condescending tone. She does not answer questions she deems as too easy. Also her grading seemed a bit unfair. The problem sets were all hand-written (she does not like courseworks), and she would pick 5 of the 10-24 problems to grade. She does not curve. After the first midterm she accused one of my friends of cheating, and another of not having studied. I do not know how she came to those conclusions, but she refused to go over the problems individually with them. She rushes through the material from start to end, rarely referencing the book, so it's hard to keep up.\nIf you have Calc experience, be my guest and take Calc I with Mosina, but if you've only had up to pre-calc, find another professor.\nWorkload:\n2 midterms 25% each1 Final 40%Weekly written homework 10% (10-24 problems per week)\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 28, 2006",
            "review_content": "\nThe way she teaches the class is rather nice. She will teach you a method or a theorem let's say, and then she will give sample questions using those rules. However, at first, you may find her to be a bit overwhelming. It feels like the pace she works at is tremendously fast, but once you become used to it, it's really not bad. Her class is certainly not impossible and though it may not be easy compared to some of the other classes, it is fine, reasonable, and capable. Her grading is extremely fair and she gives extra-credit which is a great chance to make up on anything you would like to. But remember, no calculators in this class no matter what. Lastly, if there is something you do not understand in class, make sure you look it up in the textbook and you should be perfectly ok. It is a fair class.\nWorkload:\nA written assignment is given out every week, around 20 questions approximately. Sometimes instead of this written assignment she will give a quiz. The way the written assignments are graded: she randomly picks 3 questions and only grades those 3 out of the many you have done. 2 midterms and 1 cumulative final. There is always extra-credit and this time, there happened to be no webworks which was pleasant of course.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 04, 2006",
            "review_content": "\nProf Mosina is absolutely wonderful! I hate calc, and I feel like she made it as painless as it could possibly be. For the mathematically challenged like me, she goes a little quick and you often grasp concepts only after the lesson is over, but better late than never. She is an extremely fair grader and the work load is relatively light. Two midterms, a final, and maybe 6 or 7 written assignments which you have ample time to do. I strongly suggest you do all the recommended hw problems because she'll give you extra credit if you hand them in at the end of the semester and its good practice for the exams. \nWorkload:\nModerate, weekly written assignments from the testbook, anywhere between 15 - 30 problems. NO WEBWORKS! 2 midterms, and one cumulative final.\n"
        }
    ]
}