{
    "prof_info": [
        {
            "prof_name": "Xi Chen",
            "prof_id": 12932,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Computational Complexity",
            "review_date": "August 17, 2016",
            "review_content": "\nI don't have too much to add to Xi's previous reviews, but I did want to emphasize that this course really is very tough. Xi is a pretty good lecturer, and a very nice guy, but do be prepared to spend a ton of time on the problem sets.\nWe had 4 or 5 problem sets throughout the semester. All of them very heavy proof-based. They easily took me 20+ hours each. There were some really smart people taking this class so maybe it took them less time, but the problem sets are no joke.\nThe midterm was pretty easy compared to the problem sets. The final was not; it was basically like the problem sets except you couldn't spend a whole week on it and going to OHs.\nOverall a solid class, but don't think this is CS Theory part 2. It's more like CS Theory on steroids.\n\nWorkload:\nHeavy. Problem sets extremely hard. Midterm was ok. Final was brutal.\n"
        },
        {
            "course_name": "Introduction to Computational Complexity",
            "review_date": "March 25, 2016",
            "review_content": "\nThis was the most rewarding class I have yet to take in CS. Extremely interesting material and very good teacher.\nThe first half of the course is more foundational: some basic proofs about Turing machines, time and space hierarchy theorems, NP completeness, non-uniform complexity, and randomized complexity classes. This is all neccessary knowledge for anyone interested in theory of computer science. But after that, we dove into some more recent results: interactive proofs, circuit lower bounds, and probabilistically checkable proofs. These topics were exciting and provide a more in-depth look into complexity theory.\nThis class is all proofs. So clearly do not take the class if you are not ready to do rigorous proofs in class, on the problem sets, and on the exams. \nBut if you have the mathematical maturity to face them, don't let the proofs scare you off! Each class focused on proving a different result from complexity, and each proof was interesting and rigorous. Professor Chen is very good; he always presents clean and rigorous proofs. He doesn't dwell on trivialities, but if someone asks, he will always clarify details, both in class and office hours. He is a very clear and helpful teacher.\n\nWorkload:\n5 very hard problem sets\n2 exams are slightly easier, both open note\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "May 23, 2014",
            "review_content": "\nXi is a pretty decent teacher. Going into this class, there were no previous CULPA reviews on him and the only thing I heard about him was that he was \"not bad\". I would say Xi's a bit better than \"not bad\".\nTypically, classes like Algorithms go really fast, leaving most students lost and confused. Xi is good in this sense because he teaches at a slower pace so it's easier to understand the long proofs and sometimes dense material. The drawback of his speed is that we didn't finish the syllabus. We missed 2 classes because of snow days and another 3 classes because Xi was overly ambitious to cover so much material at his teaching pace. He also posts excellent slides online so you don't have to worry if you missed something in class.\nThe class itself is pretty hard. The book CLRS, while excellent, is quite dense and detailed. Homework was almost completely assigned from the exercises in the book, which are nearly impossible the solve. The HW averages were pretty high (around 55/60). This is because solutions to problems from CLRS are available online if you search carefully enough. I highly recommend you don't do this since you will get screwed come exam time. Xi is super helpful in Office Hours and you should go to him if you get stuck on HW (because you will, trust me). He will walk you through any problem and give you an outline of the solution. Sometimes, the problems are so hard, that Xi himself can't solve them on the spot (not knocking on Xi; he's really smart. I'm just saying the problems are that difficult). \nThe midterm was much easier than the problem sets, but still far from easy. One question on perfect hashing which worth 20 points could be solved only if you remembered a proof from his lecture slides. Most people didn't get it, so remember to read his slides thoroughly. Grading was fair, maybe a bit strict.\nFinal was similar to the midterm in difficulty and was a bit longer, but you had 3 hours which was plenty of time. I thought the final was easier, but I ended up getting a lower score on it than the midterm, so I don't know what to make of it.\nThe class had roughly 8 undergrads out of a 100 students, so be prepared to be lonely. There are PhD students in this class, so don't expect to ace it, though getting an A shouldn't be a problem if you put the effort into this class. I'm not sure if he curves undergrads separately.\nOverall, it's a good class. You will learn a lot and become much better at constructing solid proofs and thinking algorithmically. I think Xi is just as good as Stein, so feel free to take this class with him.\nWorkload:\n7 Homeworks (40%) : incredibly hard, take 20+ hrs each\n1 Midterm (30%) : medium-difficult, average was roughly 66 I think\n1 Final (30%) : similar to midterm\n"
        }
    ]
}