{
    "prof_info": [
        {
            "prof_name": "Eleni Drinea",
            "prof_id": 13070,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "February 06, 2021",
            "review_content": "\nI am an Eleni Drinea stan!!! I took Analysis of Algorithms with her in Spring 2020 and absolutely loved it! Eleni is a very engaging and clear lecturer and I never felt bored during class. I think algorithms tend to get a bad reputation but this class really made me fall in love with the subject. I cannot recommend this class any higher. Not only was it fun, but it was also worthwhile, as many interview questions are about algorithms and you will feel very comfortable with the material after taking the course.\nWorkload:\nProblem sets that were a bit time consuming, but manageable because I went to office hours and found some friends to study with. Midterm was hard but curved. No final due to COVID.\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "August 01, 2020",
            "review_content": "\nI had an excellent experience with Prof. Drinea, which perhaps is not consistent with some of the earlier reviews. I found her to be an amazing lecturer who was capable of commanding the class's attention despite a biweekly 3 hour-long class over Zoom (Summer 2020), and I can genuinely say that I did not once feel lost in class, despite her rather rigorous treatment of the material. The homeworks are difficult (they remind me most of a challenging mathematics PSet, there is rarely any programming, and if there is, it's treated as extra credit), and the hardest problems come from the TAs, but I found them to really enhance my understanding of the material and be incredibly rewarding to complete. I am worried that organized cheating was rampant, since the averages were incredibly high despite the immense difficulty, but she will reassure you that if you really understand the homeworks, you will do well on the exam, which I found to be true in my case. Grading on individual assignments can be harsh, but is always very clear. The average on the final was around a 45%, but because I had taken the time to do each of the homeworks honestly, I easily did much better. I have no complaints regarding final grading, either. Lastly, Prof. Drinea is incredibly kind and caring despite the difficulty of the class, and I believe that she is ultimately very fair. I would absolutely recommend this class, and although Prof. Stein literally wrote the textbook, you cannot go wrong with Prof. Drinea.\nWorkload:\nHeavy. PSets are difficult (think 10-20 hours each), but they really enhance your understanding of the material. Exam is easy if you've done all of the homeworks completely, so make sure you put in full effort. All in all, a super rewarding class, but like everything worthwile, it does not come easy.\n"
        },
        {
            "course_name": "Analysis fo Algorithms I",
            "review_date": "July 02, 2020",
            "review_content": "\nEleni is a rare breed of professors that is both incredibly polite and incredibly ruthless. She says she will curve the class but, as many reviewers have stated, a bunch of students WILL get Cs. Her teaching style is clear but the problem arises with the homework and exams. I'll just go ahead and give you a hint that will save you a lot of frustration in her course if you end up with her. If you want to write a greedy algorithm, what you really want to do is write a dynamic programming algorithm. Greedy algorithms, although intuitive, are rarely correct. This applies to any algorithms course but especially to Eleni because of the harsh grading. Now, what you really want to do is smash that drop button on SSOL and save algorithms for a professor like Christos or Stein. You will learn so much more and not have to worry about extremely harsh grading – they understand grades are secondary to learning. \nWorkload:\nlol, just take with Christos/Stein if you can.\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "July 14, 2019",
            "review_content": "\nExperience was consistent with earlier reviews:  Eleni is a decent lecturer and even throws in real world examples of how particular algorithms can be applied to problem solving.  Unfortunately, her homework problems do not align with the material taught, she provides no review for the exams, allows no note sheet on the exams, and throws several questions in there which had nothing to do with what she recommended to study. \nIronically, for all her rhetoric on every homework about using only the book and lecture material (i.e. no outside research), if you Google her problems you can find she herself has plagiarized them from other sources, which explains why they don't sync up with her lectures well.  In all, I thought the lectures were interesting, but this could have been a far better course as her methods were ingenuous and designed to set students up for failure.  She does curve, but expect a C if you're not strong in theory and proofs.  \nWorkload:\nHomeworks impossibly difficult if you were trying to solve them honestly.  \n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "May 27, 2017",
            "review_content": "\nThe worst Analysis of Algorithms class you can take. She grades really bad, and even \ngives F to some people.\nShe teaches easy concepts in the class, and makes HWs really hard. Mid-term and final are way harder than the HWs.\nGrading--\nShe will tell initially, she will grade on a curve and everyone will be fine. But in the end, she will mess you over. She grades absolute. I know a \"lot\" of people who got a C in her class. She grades the mean as B-.\nWorkload:\nA lot. The HWs and exams include a lot of concepts not covered by her in the class.\n\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "May 22, 2015",
            "review_content": "\nProfessor Drinea is a solid pick for Algorithms I and she has taught for the past two spring semesters. Here is what you are in for:\nLecture--\nProfessor Drinea is an okay lecturer. I had some trouble understanding her sometimes because of her accent and the fact that she is somewhat soft spoken. This was exacerbated by the horrible acoustics of the classroom (Mudd 833). That being said, she is quite good at explaining things, though you will need to review some content afterwards (as well as do some reading prior to lecture) to learn the maximum amount. All slides are posted on the course wiki.\nContent--\nWe covered a ton of content this semester (and according to my roommate, more than most Algorithms I classes cover). This included increased coverage in Linear Programming, P/NP Reductions, and a bit of Approximations. There was also a hackathon early in the semester that went over applications of various algorithms for those of you who are more programming focused.\nHomeworks--\n6 assignments that ranged from really easy (graph algorithm pset) to crazily difficult (dynamic programming pset). They are due every two weeks.\nExams--\nClosed book midterm and final. Midterm was incredibly long and difficult. Final was more reasonable length, but still pretty difficult. Averages were pretty low.\nOffice Hours--\nTA office hours are a mixed bag. Sometimes TAs don't know the answer to questions or have trouble explaining it. Being able to speak Chinese with them is actually a huge plus. Professor Drinea is very helpful in her office hours, so definitely go to her. On the whole, these are very important for succeeding in the class (unless you are absolutely brilliant).\nGrading--\nVery reasonable. I slacked the first half of class and finally picked up my game in the latter half (went to OHs and lecture). After all was said and done, my scores were a tick below the mean and I ended up with a B, so the curve appears to be the standard B/B+ for mean. \nWorkload:\n6 Homeworks - 40%\nMidterm - 30%\nFinal - 30%\n"
        },
        {
            "course_name": "Algorithms for Data Science",
            "review_date": "February 10, 2015",
            "review_content": "\nEleni is such a nice prof and great lecturer. She teaches very clearly and has very well written slides. She will often use the blackboard to go over a proof or concept more carefully. There were also two guest lectures from researchers at Google and Facebook on Ad bidding and MapReduce, which were nice treats and quite interesting. This material is not tested.\nThe only thing is that this class was the \"Data Science\" version of the normal Analysis of Algorithms class. This meant there were a lot of IDSE students, who didn't have much CS background. This really, really slowed down the pace of the class, with all the questions that were asked. If you come from a CS background, you would be better off taking the normal Algos class.\nHomework was a combination of theory and programming, however, which is nice. Any language is ok, although Python is preferred, especially for the linear programming. TAs took a long time to grade the homeworks and offered little feedback.\nExams were comprehensive, and essentially tested understanding of the main results that were showed as well as algorithm design/analysis. Averages were very low, but I think that's normal for any algos class. Final is easier as long as you understand NP-completeness and reductions.\nWorkload:\n40% Homework - theory and programming, manageable\n30% Midterm - difficult\n30% Final - not as difficult as the midterm, but still difficult\n"
        },
        {
            "course_name": "Algorithms for Data Science",
            "review_date": "January 07, 2015",
            "review_content": "\nEleni is such a nice prof and great lecturer. She teaches very clearly and has very well written slides. She will often use the blackboard to go over a proof or concept more carefully. There were also two guest lectures from researchers at Google and Facebook on Ad bidding and MapReduce, which were nice treats and quite interesting. This material is not tested.\nThe only thing is that this class was the \"Data Science\" version of the normal Analysis of Algorithms class. This meant there were a lot of IDSE students, who didn't have much CS background. This really, really slowed down the pace of the class, with all the questions that were asked. If you come from a CS background, you would be better off taking the normal Algos class.\nHomework was a combination of theory and programming, however, which is nice. Any language is ok, although Python is preferred, especially for the linear programming. TAs took a long time to grade the homeworks and offered little feedback.\nExams were comprehensive, and essentially tested understanding of the main results that were showed as well as algorithm design/analysis. Averages were very low, but I think that's normal for any algos class. Final is easier as long as you understand NP-completeness and reductions.\nWorkload:\n40% Homework - theory and programming, manageable\n30% Midterm - difficult\n30% Final - not as difficult as the midterm, but still difficult\n"
        }
    ]
}