{
    "prof_info": [
        {
            "prof_name": "Janaki Bakhle",
            "prof_id": 1022,
            "total_reviews": 50
        }
    ],
    "reviews": [
        {
            "course_name": "Gandhi's India",
            "review_date": "December 06, 2011",
            "review_content": "\nIf you have the slightest interest in History, South Asian, or Political History, Gandhi's India with Professor Bakhle is the course to take.  This is the most invigorating course I've taken at Columbia so far, and Professor Baklhle spurs student interest like a pro.  Every lecture is fast paced and packed with material, so it's not an easy challenge, but is still overall worthwhile.  Professor Bakhle is relentless in delivering the extremely complicated history of the formation of modern India; there's never a dull moment in class.  Be warned, the class is all the way at 120th and Broadway, and you can't afford to come in late, lest you lose important information.  Professor Bakhle is strict as well about cell phone and computer use as well, but you wouldn't want those distractions compared the amazing experience you'll have in class.\nWorkload:\n3 5-8 page papers (30%)\nMidterm Exam with multiple choice and a couple of short essays (20%)\nFinal Exam (30%)\nSection attendance (20%)\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "December 27, 2010",
            "review_content": "\nI took this course with only slight pause due to old CULPA reviews, and I don't regret it at all. Professor Bakhle is a fantastic lecturer with a thorough insight into her subject. Moreover, she did an excellent job of contextualizing an extremely broad overview of South Asian history. While we covered a lot of material, I found that it was generally manageable to grasp what was going on and understand the narrative as it was presented. \nProfessor Bakhle also made a tremendous effort to expand the course beyond Gandhi. We read numerous different opinions, and were presented with a class that put Gandhi in conversation with his contemporaries-- and allowed us to understand him within that context. Given that we had such a short amount of time in class and a large amount of material to cover, we actually read about a remarkable variety of the movements and disagreements that dotted Indian history from pre-colonial and briefly, post-colonial times. \nClass had two TA's. I had Divya, who was great at dissecting and making sometimes dense readings understandable. \n\nWorkload:\nHeavy reading, though some weeks are better than others. 2 7-10 page papers, discussion section. \n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "December 24, 2010",
            "review_content": "\nWhat a great class this was! There's a lot of information, a ton of reading every week, and the exams aren't easy. But Professor Bakhle is a terrific lecturer. I don't understand why people think she's a \"bitch on wheels\" as one reviewer said below. She commands the classroom but not in a bitchy way at all. \nThe TA's are very intelligent, approachable, and professional. Mine was Omar Sarwar. He started out somewhat lacking in confidence but a few weeks into the semester he had us engaged and the fifty minutes of discussion section seemed to fly by. He's also hot. Just thought I'd add that! I highly recommend this class to anyone interested in the history of South Asia.\nWorkload:\n200 to 300 pages of reading a week, 2 paper assignments, midterm exam, and final exam. Weekly discussion posts on Courseworks. It's a lot of work so only take the class if you know you can handle the workload. It's all worth it in the end.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "April 09, 2010",
            "review_content": "\nI think the problem with this class is that Prof. Bakhle packs in a lot, and I mean a lot of information into one course.  Sometimes, I just wanted her to slow down, perhaps engage with the students more and ask our input.  Actually, the course was supposed to run for the full year and I was sorely upset when she changed it last minute and condensed it into one semester.  \nShe knows her stuff and that's the best part of the class.  She may come off intimidating, but she is really nice.  Just don't come to class late or expect to type notes on your laptops.  I came in knowing very little about Indian history, and by the end of the class you will for sure have a very different view on Gandhi himself.  \nOh, there is a lot of reading.  I think it would've made sense to stick with just a few books and follow their development throughout the course, as opposed to a whole bunch that at times felt detached from the course.  However, you can get away without doing all the reading.  \nI was upset about the timing of the papers. One was due in about a week and the last one was due a couple of days before the final:((   The exams are cumulative which can kill you with ID's.  I agree with the previous reviewer about the grades and the TA's. I did fine, but Divya and Merve were not the best in my opinion-trust me on this since I was able to sit in on both discussion sections and ask fellow students their opinions.  I had great TA's until I came to this class, and am still baffled by it.  \nI suggest sitting in for the first 2wks if you are unsure whether or not to take her class.  I enjoyed the information I was learning and her opinions on Gandhi.  \nWorkload:\n3  5-7pg papers.  One midterm/final.  Loads of ID's  Reading: 200-300/wk\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "December 19, 2009",
            "review_content": "\nProf. Bakhle is one of the best lecturers I have experienced in my time at Columbia. Unlike other history lecturers, her lecture is clear and fast paced. For the sake of clarity,she provides an outline of the lecture in the first five minutes. Her lectures have the perfect balance of fact, context, and synthesis. People seem to call her out for being arrogant but I think the more appropriate word is confident. Bakhle is undeniably knowledgeable on the topic and does not shy away from developing interesting ideas. I went into the class knowing nothing about India and can know have an intelligent conversation about it. Other reviews have shared anecdotes to prove that she is a bitch-  but this is not the case. She made an effort to learn the names of at least a quarter of the students, which is nice in a big lecture, and bought starbucks for a student she \"yelled at\" the day before. \nI am expecting a grade that is likely going to be less than I would prefer, but thats because of my TA, not Prof. Bakhle.\nFinal verdict- Take this class. Dont think twice. I was skeptical of her, having read scary culpa reviews, and kept waiting for the other shoe to drop. It never did.\nWorkload:\nA ton of reading but  I managed without doing most of it. It is interesting though. Three fairly easy and interesting papers, an easy midterm and a final that is a more challenging version of the midterm\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "December 13, 2009",
            "review_content": "\nI completely agree with the review below. I would just like to emphasize a couple points about Bakhle's class that are extremely irksome. She assigns (no exaggeration) 200-300 pages of reading every week. Most of this reading is only partially relevant to the class. Most of this reading is incredibly boring. Most of the reading Bakhle assigns in primary sources, or chapters out of a history book. So, most of the relevant information is sparse and far between. I would suggest, if you take the class, to only skim a couple pages of each reading. It certainly won't help you on the tests or papers. \nBakhle acts like she is the god of the universe. If anyone comes to class late she will act like they were late because they were lighting up a crack pipe out front of class. If people who are lost and they push open the door to see what's inside, she will freak out on them. One time she gave a freshman about a five minute lecture about, \" the rudeness inherent in disturbing my class.\" She just has no respect for students. One day a person came to class, because her lectures are pretty good, to sit in. She called him out in the middle of a sentence and said, \"my classroom is not a cafeteria, you need to leave.\" Needless to say, that dude probably felt like crap for the next couple hours, and nobody probably even noticed him before she made a big deal about it. The worst part of her power trip is that she routinely held us 10-15 minutes late every class. \nOne good side of the class is that she is one of the best lecturers I have had at Columbia. I probably only missed one or two lectures because I actually felt like I learned a lot listening to her. She certainly brings energy to the table.\nIt appears that I am going to be a B+/A- in the class, which is about my average at Columbia. But I would say that it is not worth it to take this class unless you are very interested in learning. This class is probably great for overachievers, or those really interested in India. But for the average person just trying to get a good grade, this might be the worst possible class you could take at Columbia. \nWorkload:\n3 papers, somehow not relevant at all to your readings. They are assigned six nights before they are due, which would be more frustrating if the topics weren't so simple. i.e. \"defend Gandhi's position on Caste.\" One ridiculously easy mid-term, because you got options in every section, so if you knew 50% of the information you would get a 100. I suspect that the final will be significantly harder, mostly because the TAs sent out an e-mail saying, \"Needless to say, you will need to study your mid-term review sheets because the final is cumulative.\" \n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "December 11, 2009",
            "review_content": "\nI would like to preface this review by saying that I did pretty well in this class, so the following comments are not motivated by bitterness about an unsatisfactory grade.  That said, avoid Gandhi's India with Professor Bakhle at all costs.  Many of the other reviews have stated that this class has very little to do with Gandhi and is more about the 18th and 19th century in colonial India.  This is accurate.  At one point we were talking about Gandhi in World War II, and Professor Bakhle said something along the lines of \"I don't know anything about the twentieth century.  We can talk about the 18th century and I'll tell you everything there is to know.\"  Then why are you teaching a class called Gandhi's India, where the most relevant years are from around 1914 to 1948?  The course should really be called something like \"Colonial India and the Development of Indian Nationalism\" or something like that.  The structure of the class was scattered, there was no coherence, she flip flopped between seeming to organize the lectures chronologically but also thematically, and she didn't provide readings that helped tie together the material.  Professor Bakhle speaks very fast, only stopping to tell TA's to write random terms and names on the chalkboard (by the time they do this you can't even figure out to what they refer because she gone onto other things miles ahead of what she said before), and you are not allowed to bring laptops. \nShe decided to change out whole reading list after she realized the books on the list were out of print.  However, she changed this way beyond the return dates at Bookculture so most of us had bought about half the books already.  She decided to change the course so that it was based on primary sources--which meant making the TAs track down 18th century manuscripts, of which there are about 8 in the world, and scan these 300-page documents from microfilm to put them on courseworks.  No one is able to print 300 pages from courseworks in a week, and reading 200-year old documents on your computer screen never really works.  Needless to say, the reading was difficult but not because there was a lot of it or it was written in complicated prose, but only because she chose to do this in the most ridiculous way.  Also, because she chose a bunch of random primary sources, and didn't really provide enough context in lectures, the class had no narrative and no coherence.  The midterm and final were not very hard, and she gives you a study guide for the midterm with ID's and essay questions, some of which will be on the test.  She gave us a study guide for the final as well, but it didn't have as much information.  I used wikipedia more than my notes for the midterm and final because the ID's were things she never mentioned in class or said one sentence about, and of course there was no context from readings.  The 6 3-page papers were fine, just annoying that you never knew when they were and you only got a week to do them.\nProfessor Bakhle rules with an iron fist.  She kicks people out of class if they are late, or punishes them in other ways.  She made one kid give an introduction to the next lecture when he was late for class once.  She treats her students and the TA's like they are 5-years-old.  I am not against Professors who are strict about discipline.  I actually think most professors let their students walk all over them too much.  But Professor Bakhle doesn't deserve to do this because she does not teach you enough to warrant her students dealing with being ruled by a tyrant.  It would be one thing if she taught the best class at Columbia and the price you paid for it was no being able to take notes on your laptop, or  go to the bathroom during class, or come to class a few minutes late once or twice.  But her class is far from the best at Columbia.  As a history major, I think it's one of the weakest I've ever taken.  I learned much more about India from Professor Tiersten's Colonial Encounters class and Professor Gluck's World War II seminar where we discussed India for 1 week in each than I did in this whole semester about \"Gandhi's India\".  She constantly complained about how it was impossible to address the entire subject (about 200 years and 1 country) in a semester.  This is BS as most other professors teach much broader subjects in terms of time and geography and do infinitely better than she does.  She told our class to write CULPA reviews and say she's really mean and hard to scare people off so that only serious students would take her class.  If you are a serious student, particularly a history major, avoid this class at all costs because you won't learn anything and there are much better classes you could be taking.  If you are not a serious student and are not interested in history, PLEASE take her class pass/fail just to make her frustrated.\nWorkload:\n6 3-page papers that are assigned a week in advance of their due date, so you can't work on them earlier than when you get the question a week before. Midterm and final, where she gives you long list of possible IDs and, for the midterm, possible essay questions from which she picks 3 and you have to write about 2.  The final essay questions were about the first half of the course.  Weekly readings and section.  Don't go to class late if you are not a glutton for cruel and unusual punishment.  Grading is not easy, but not unreasonable.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 13, 2007",
            "review_content": "\nThe main problem with Professor Bakhle is that she has not yet figured out how to structure her class so that the material comes across clearly.  She struggled from the very beginning to find an effective way to teach the class.  First she tried to have students run each class discussion, then slowly did away with that and by the end of the semester, was simply lecturing from her notes for the majority of the class time.  She did somehow get across the main points of each text, I believe, but it was done so in a very convaluted, roundabout, and incomplete manner.  If she had a personal intrest in one aspect of a particular piece, she would focus solely on it and neglect to discuss other major aspects of the work.  Overall, her teaching style is not conducive to a class such as CC.  With such a broad and in-depth study of philosophy, clarity is key and Professor Bakhle rarely accepted this.  To top it off, she refused to give the class any idea about the format or content of the final exam and then proceeded to include challenging quote identifications, key terms that were barely mentioned in class, and broad, complex essay prompts to which the response could not exceed one page. \nTo sum it up: I would keep searching.....\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "July 18, 2007",
            "review_content": "\nI found this class incredibly painful. I totally agree with the reviews before me that call her a diva. She is smart, but what does that matter when her arrogance inhibits her ability to adequately communicate her intelligence? \nI could not stand her, the class, or the work. Avoid this woman at all costs. She's overrated and the fact that she has any admirers makes me convinced she's writing the reviews. \nDon't believe me? I don't care. Take the class and find yourself in my position months later when you regret having every signed up. \nWorkload:\nRidiculous for a lecture and not fun. \n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "March 05, 2007",
            "review_content": "\nI'm actually surprised to see so many rave reviews of this woman since I find her appalling.  The lectures are not too bad--assuming you have a laptop to types pages of notes or are very fast at writing by hand--but Bakhle herself is not likeable.  Yes, she's smart and knows the subject...but that's her job as a professor.  She keeps you ten minutes after the class ends every class.  She assigns ridiculous amounts of reading that no one can finish.  Not to mention that if you don't actually know the history of the subjects discussed in the readings you're probably going to be lost, since for the most part she assigns the intro chapters of various books; the readings are more about theories than historical accounts.  \nSomeone earlier mentioned she makes the class more complicated than it needs to be, and I completely agree.  She'd be better off assigning a few substantial readings than overloading her students reading that in the end doesn't need to be done.  The two coursepacks (yes, two) you have to buy for the class are a complete waste of money.\nTests:  She assigns a ludicrous number of IDs for each midterm and final (about 120 terms for the final), and then has the audacity to put IDs on the test that were never on the ID sheet.  Also, for the upcoming midterm, she gave a list of 53 IDs to know, then added what she called a \"handful more\" a week later.  She acts like hers is the only class we have midterms/papers for and therefore she can pile on as much work as she wants, and whenever she wants.  And speaking of IDs, I have to point out that many of them are merely mentioned in class, and you have to be quick at hand to write them down.  Usually she mention someone without saying anything salient about them except that they were at such and such conference, and then expect you to write about them on the test.  I wouldn't mind her assigning so many IDs if I didn't have to wikipedia MOST of them when I get the ID sheets, because I cannot find anything about them in the 5 pages of class notes I write every day.\nAside from the the lectures, which are usually interesting, I wouldn't recommend this class.  But decide for yourself whether or not the lectures are worth her self-entitlement and self-importance.  \nWorkload:\nLots of reading, most of which can be skipped; TONS of IDs for the midterm and final.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "February 07, 2007",
            "review_content": "\nI normally read CULPA; however, after two and a half years of reading, I have never felt so compelled to write a review on a professor as I am after taking Professor Janaki BakhleÂ’s \"GandhiÂ’s India.\"\nLet me preface this review with the acknowledgement that Professor Bakhle is incredibly intelligent and engagingÂ—her lectures are ridiculously fast-paced (bring a laptop if you have any sense) and you will undoubtedly learn a hell-of-a-lot of information. She knows everything and you will not fall asleep in her class, if not solely out of fear sheÂ’ll call you out.  I enjoyed her lectures for the most part.  \nThat said...\nThe class name: now when I took GandhiÂ’s India, I thought Gandhi would play a pretty prominent role in the class.  Not so, my friend.  The first half of the course covered the history of British colonialismÂ—not just in India, in Africa as well.  DonÂ’t get me wrong, I understand why this history is important, but Bakhle seriously thinks Indian history is so complex that the entire first half of the class cannot even delve into Gandhi until the role of the colonizer is established.  While I agree for the most part, general colonialist theory is not the class I signed up for and, in addition, it definitely does not require eight weeks.\nHer lecture style: BakhleÂ’s lectures are incredibly fast-paced because she finds every minute detail in Indian history so important that she just has to cover it.  This just leads to an inundation of facts which are never actually situated within a theme. She probably thinks she does this with a random platitude she unleashes out of nowhere, but she does not do this sufficiently.  She never slows down to clearly define positions or present anything schematically because Indian history is just too Â“complex.Â”  In the end, youÂ’re just left with a ton of information with no solid thematic context.\nHer readings: Confusion in lecture is compounded by the readings she assigns. Not only is it a laughable amount that is straight-up unreadable in both length and content, the readings are assigned BEFORE her lecture.  WeÂ’re not talking a textbook here, people.  This is 100 pages of reading (for one class, not for one week) that is extremely theoretical.  Why am I reading about the Â“debatesÂ” on sati before I even know what sati is? However, for Bakhle, no such debate can ever be that clear. Instead, we must read a dense introduction (yes, the TWO huge coursepacks are made up of introductions primarily to authorÂ’s books) that presents an argument on how colonialism shapes the differing opinions on sati. Because we're reading introductions, there is little evidence, and, instead, we're left with an unproven idea on a topic I have been given no background on. Awesome. \nHer class dictatorship: Now I totally respect the fact that the woman has issues with cell phones and people falling asleep in her class, but her Â“bitch on wheelsÂ” act gets old fast.  ItÂ’s one thing to yell at someone for dozing off in class on the first day to set a standard, but itÂ’s frustrating to the students who arrive on time and want to take a lecture to have that lecture immediately stop, because Bakhle can't focus with someone in the back row who did not get enough sleep the night before. Professor Bakhle sees it as her duty to embarrass that student. Apparently I guess I donÂ’t derive as much satisfaction as previous reviewers at the expense of other students, but this Â“calling outÂ” ended up being a huge waste of time, because students inevitable doze off, but she can't seem to focus or understand why ANYONE wouldn't want to hear her speak.  \nWhich leds me to my biggest complaint about Bakhle: the woman is so self-entitled and self-righteous. It is actually ridiculous. She works with a ton of assumptions about how ignorant Americans are.  For example, once she felt the need to digress for ten minutes to tell us how our study of Â“slaveryÂ” is wrong in that it states that the Africans Â“leftÂ” for the New World. Fortunately, Professor Bakhle was there to enlighten me to the fact that slavery was not a humane practice and that the conditions on slave ships were not ideal. I don't know what this had to do with Gandhi, but Bakhle felt the need to express her dissatisfaction that I now know her opinions on the Iraq War, prescription medicine, education, health care, divestment, etc.\nHer papers: I hope you enjoy writing really frustrating papers that are not hard, but poorly-written (1st assigned essay) or extremely general with no direction (2nd assigned essay). Not only that, but she gives you a week to write a paper on the premise that Â“students buy papers and itÂ’s an issue.Â” I mean, I feel like I was more tempted to buy a paper with this new rule. It's one thing to give us a week, but one week included Thanksgiving and another week included Yom Kippur. That aside, Bakhle would NEVER adhere to promises she made to the class. She was late on both paper topics and switched the deadline for the paper constantly.  \nHer final: Apparently, studying 123 IDs is not adequate, because the final will have 20 of those terms, but 20 other terms that were not on the ID sheet.  WhatÂ’s the point of passing out a review sheet with a bunch of random names/facts that were never mentioned in class (leaving wikipedia to teach me) only to test the class on minor figures she mentioned in passing on some random day in the semester?  At least donÂ’t tell us everything is on the Â“study guideÂ”Â—just give us a test.  \nI expected this to be my favorite class and it ended up being a pain.  She is a good lecturer but this is not the AMAZING class CULPA makes it out to be.  I actually legit felt duped.  I feel like Bakhle would be an amazing CC teacher because itÂ’s a smaller class and she's pretty smart. But there are way better history classes out there. Only take this course if you're incredibly fascinated with IndiaÂ’s history and care to deal with all the noted issues above.  \nThis pertains to the first half of GandhiÂ’s India, though. I feel like the second half would be better, because, well, it actually deals with Gandhi, as advertised. \nWorkload:\nMidterm/final, 2 papers, 2 in-class quizzes (she cancelled one), and participation in section.  The class is not nearly as hard as everyone makes it out to seem. \n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "January 20, 2007",
            "review_content": "\nYea, it is definitely overrated. I expected some sort of God because of these culpa reviews. I forgot about those Columbia students that seem to always be waiting for their lives to be changed by some professor who enjoys being worshipped by them. The class is good; the reading is interesting though there is a LOT of it. I don't think that there are many schools that offer a full year course on India, so this class is a rare opportunity and a really good one at that. But, contrary to other reviews, I'm not sure how much of this has to do with Professor Bakhle's lectures. Lectures are not \"incredible;\" actually, they are somewhat staged. She is a bit hysterical at times. But she is really smart and seems to know everything about everything, and she is sort of sweet in person. But I think too much is said here about her brilliance and humor and 'dynamic flair.' Overall good class.\nWorkload:\na lot of reading, TAs are very fair graders and very nice people\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "January 08, 2007",
            "review_content": "\nFabulous lecturer. There's a copious amount of reading, but you don't really have to do it (despite Bakhle's claims that you do). The TAs let you know what to focus on in the readings, and the papers are only based on 1-3 of the readings each, which you can do once the paper is assigned. Great class, gives you a really thorough understanding of colonial India and you come out of it with a good amount of knowledge. Plus her lectures are just inspiring.\nWorkload:\nLots of reading (most of it can be skimmed), 2 papers, midterm and cumulative final\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "January 02, 2007",
            "review_content": "\nTotally overrated.  I'm actually sort of mad at CULPA for making me take the class because her reviews were so amazing.  She's smart but it's just like reading a completely disoriented textbook.  \nThere's something really self-righteous and self-entitled about her that bugged me a lot throughout the semester.  \nThe class isn't half-bad, but definitely don't take it if you're just looking for a fun history class.  It's way too intensely factual and not interesting or engaging enough.  She's definitely smart though if that's what you're looking for.  She's not really nice at all so don't go to her class if you don't like mean teachers. \nCome to think of it, this was my worst class all semester and I normally really like my classes. \nWorkload:\nThe readings are not doable.  No one did them all. It's impossible and annoying because it's just so much reading.  The tests and papers were just annoying and nothing was made to really test knowledge as much as it was made to just make us spend a lot of time completing. I feel like all her work was targeted at making us think the class was challenging when it really didn't need to be all that complex--she just made it that way.  \n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "December 20, 2006",
            "review_content": "\nProfessor Bakhle is definitely a dynamic lecturer and very knowledgeable about her subject. But she's also totally intimidating (I think she actually wants to maintain a reputation for this) and therefore not easy to approach. Her lectures are well-spoken and informative, but rapid-fast. I'd definitely recommend taking a laptop to her class to type notes because your hand won't be able to keep up with her mouth! I ended up taking about 6 pages of notes each class. The material is usually interesting (except when Bakhle herself admits that it will be boring--although she made Gandhi's \"Autobiography\" out to be worse than it was... she said it would be dry, but I actually found it quite fascinating). She demands a lot from her students--the papers were not easy and there were so many IDs for the final exam. Overall it was a good experience as far as the lecture goes, but I will not be sticking around for the second semester. (Gandhi's India is now a two-semester course.) The TAs as a whole were mostly worthless. The review session before the final was a waste of time because they wouldn't answer pertinent questions--they kept telling us to just go look up the answers for ourselves. They eventually posted some decent lecture notes but occasionally they wrote misinformation. My particular TA, Sheetal Chhabria, was intelligent and responsive but politically biased... and I think my grades on papers suffered because of this. (Supposedly she didn't grade us based on our opinions, but I still felt attacked for having differing political views.) In her favor, however, she definitely devoted a lot of time to helping the students and she always answered emails promptly. I think she genuinely cared about the class and I appreciated her hard work.\nWorkload:\na lot of reading, two papers, midterm, map quiz, final\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "November 29, 2006",
            "review_content": "\nShe is a very engaging speaker and really knows her Indian history. Great oratorical flair and lots of engaging and worthwhile reading. One word of caution I was surprised to not see in any of her other reviews here: she is not good at answering questions during class and usually waits until the end when everyone is leaving and youÂ’ve likely forgotten what to ask. When she does answer questions, IÂ’m afraid to say, I think IÂ’ve seen slightly more willingness to answer the questions of male students.\nWorkload:\nLots of reading, but managable. \n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "November 15, 2006",
            "review_content": "\nThe course was okay, but definitely did not live up to my expectations. There was an inumerable amount of historic background of India in the 18th century, which is cool and all, however, i expected to hear about Gandhi (as the course is entitled) at least before the mid-term... The professor is pretty good, the TA's are okay, but there was just something missing for me, she definitely did not make me fall in love with her as others have previously stated, and it is hard ot understand what's going on at time because the prof. \nmumbles over important figures names in hindu, so you can't derive who she is talking about at times.\nWorkload:\n2 papers (hard essay topics), 1 quiz, mid-term, final, INSANE weekly readings.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "November 15, 2006",
            "review_content": "\ni love this class...i haven't missed one yet. but she's intense...take heed...SHE HATES CELL PHONES-she said today that we should write that in our reviews...anyway, great class...no previous knowledge of indian history required. she's terrific and soo smart. and it's a great class. and basically the readings suck...they are long but you don't always have to do them...but you should so that you don't get screwed later on..the TAs are cool. and don't fall asleep, or talk, or pass notes because she will get really mad. basically this class is the best one i have taken so far...and you all should take it. BUT TURN OFF YOUR CELL PHONES!!!!!!\nWorkload:\nusually 2 ID quizzes (we only had 1), 2 5-7 pg papers, midterm...as long as you pay attention in class you'll do fine on the quizzes/midterm...need to read for the papers! GO TO DISCUSSION. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 25, 2005",
            "review_content": "\nProfessor Bakhle is by far the most engaging professor I have ever experienced. She is simply the best out there. Take any class she offers when she comes back in the fall of 2006!\nWorkload:\nLOTS OF READING (but you realize you don't have to do it all)\n"
        },
        {
            "course_name": "CC, Topics in ME/S.Asia, Gandhi's India, Problems in Indian National Historiography",
            "review_date": "June 11, 2005",
            "review_content": "\nan inspiring scholar, teacher and human being. I've taken all the classes she teaches except her graduate indian aesthetics class and even tahts only because she would'nt let me. I begged and cried. also, she;s the best in office hours, she's inspired me to go to grad school. i'd call her my guru except she's too nice, too willing to take out her classes for dinner and regale us with legends and stories about ed said, too willing to talk about controversial stuff in class and give examples from her personal life.\nif you're prepared to do fair amounts of reading and come to class on time and stay up, you'll love her classes. if not, she'll bark at you but in her own words, she's a softy at heart and won't ever bite (at your grades). \nWorkload:\nthe others have been covered: the seminar, which might be taught again, involved 300-400 pages of reading a week, but everyone (all undergrads) were always prepared and bursting to discuss the issues. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 04, 2005",
            "review_content": "\nIt just does not get any better than Janaki Bakhle.  After three years of taking nearly all lit and philosophy classes, she is the best lecturer I have had, and frankly its not even close (ok, Mark Taylor is pretty close).  I'm not making this up: The first time she ever paused or said \"um\" when she was speaking was probably six weeks into the class.   If I ever become phenomenally wealthy, I may attempt to pay Janaki Bakhle a ridiculous sum of money to just come and lecture to me all the time (about anything she wants).  She is without a doubt the most academically sexy professor at Columbia, but she's not just all bluster and gusto, throwing these \"sexy\" terms around haphazardly.  Its obvious that her lectures (they're works of art, really), are well thought-out, and they fit together perfectly.  Yet she can lecture that way on more or less any topic.  She just thinks faster, more logically, and with a wider scope than you ever thought possible.\nAnd although Bakhle can be a little intimidating, she's actually a very sweet woman who cares about her students.  Its obvious that she really cares about her students, not because she coddles them, although she can be really nice and funny, baking cookies and talking about her kid's Barney cake; but rather because she really challenges them;  I came into this class with a decent philosophy background, so sometimes I would get bored and not really think my comments through as clearly as I should have.  She totally got on my ass about this, and I really appreciated the fact that she cared enough to want me to do better.  After a freshman Lit Hum and philosophy fiasco, Janaki Bakhle made me care about learning and philosophy again, and gave me the confidence that I could actually do both.  \nThey're just aren't enough superlatives to describe Janaki Bakhle: invigorating, brilliant, ball-busting.  People throw around the term goddess all the time here.  As an embodiment of academic power and glory, Bakhle truly deserves the honor.  It is an absolutely traveshamockery that CULPA hasn't made Bakhle a gold-star.  Hell, a gold-star would be insulting to Bakhle because it would imply that there are that many other professors are even in her league.  She deserves her own rating, like, say, platinum, or mother-of-pearl or something.  I think I will probably suffer the indignity of becoming a Life-long Learner wherever she ends up getting tenure.  The MEALAC department is absolutely insane if they don't give it to her, along with the reins to the whole department, like, tomorrow.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 21, 2005",
            "review_content": "\nI'm the kind of student who hates the reading, writing, and discussion that CC and Lit Hum are based on, but Professor Bakhle made it totally bareable!  She did add a lot of extra readings to the syllabus, but is open to trimming the syllabus as the semester progresses if the reading is just too much.  You will have to talk in her class, but even if you're not very articulate or can't really think of something intelligent to say, just spit something out - she'll turn what you say into something that sounds remarkably insightful and intelligent, so you'll at least appear smart.  She says that she's a tough grader, but I really didn't think so.  Everyone did reasonably well on both papers, the midterm and the final.  Her paper topics were a little odd, though, as they didn't really have much to do with the readings.  For example, for the first paper we were asked to write on the war in Iraq and for the second paper we were asked to write about academic freedom in light of the MEALAC scandal.  I did appreciate the breadth of the topics, though.  One thing you must watch out for is her quirky rule about cell phones.  She is vehemently against them and not only thinks they are disruptive to classrooms, but also that they are a menace to society.  She threatens that she'll ask you to leave if your cell phone rings, but, while a few cell phones did go off during the semester, she never kicked anyone out of class for it.  She did, though, ask someone to leave for falling asleep in class.  Other than her impatience for cell phones, she was really an excellent instructor and I would definitely recommend her!\nWorkload:\nAn incredible amount of reading - more so than most CC classes.  Two easy papers and easy easy easy midterm and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 06, 2005",
            "review_content": "\nWhy hasn't CULPA declared this woman a gold nugget yet?  She's absolutely brilliant and inspiring.  The commentary she brings on every text is mind-bogglingly mesmerizing and she truly cares about bringing the best out of her students.  Also, by bringing in untraditional texts, including Lenin, Fanon, CÃ©saire and not the like, into a class surveying \"Western\" thought is a breath of fresh air into the core curriculum.   Who cares if this class never has a break and always goes late?  You wanna be in there and no CULPA review can do justice to how great of a professor she really is.  Take a class with her when she comes back in 06-07.\nWorkload:\ntons of reading, more so than most CC classes both in the form of massive chunks off the required syllabus and in texts she chooses herself.  again, you really would wanna do these readings.  2 5-7 page papers that are extremely open-ended and \"Contemporary.\"  Midterm and a final, both on which you have the ability to take on some crazy questions.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 01, 2005",
            "review_content": "\nTake any class with this professor!  Unfortunately she will be on sabaticle for the 2005-2006 school year, but you better believe that her classes will fill up as soon as she is back -because a year without Janaki Bakhle is a sad year at Columbia.  So, when it comes to your registration time and her class is not full, you are a fool if you don't sign up for it.  \nWorkload:\nLots of reading, but it is totally doable, she will inspire you to do the work, and you will end up doing it well and learning so much more than you even anticipated.\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "January 13, 2005",
            "review_content": "\nProfessor Bakhle is the most engaging speaker I have ever encountered, and that includes years of experience in competitive oratorical and debate competitions. She is naturally an amazing speaker. Her lectures are fierce and brilliant. You simply do not take your eyes off of her when she is speaking. Granted, she is a bit theatrical--she struts across the stage before making an important statement--but that only makes things more interesting. \nEvery single lecture in the Topics course was packed with information. You were inundated with insanely interesting facts, theories, themes, etc etc. I absolutely loved it. I couldn't get enough of watching Bakhle. I learned so much about Indian history in half a semester that I probably know more than all of my Indian friends. I don't think this course will be offered again, but you would be foolish not to at least sit in on a lecture by Prof Bakhle. \n"
        },
        {
            "course_name": "Topics in Asian Civilization: Middle East & India ",
            "review_date": "December 22, 2004",
            "review_content": "\nProf. Bakhle is amazing.  She is an incredibly enthusiastic and engaging lecturer, genuine person, and critical in her approach to the course and its material.  This course is not a history course, per se; rather, the course focuses on several themes (nationalism, modernization, religion, revolution, gender issues, etc) and then puts each theme into critical discourse.  You really cannot ask for more from a List A major cultures.  Bakhle only teaches half of the course and then Prof. Massad takes over.  Bakhle's lectures were always packed, while Massad's were half empty.  You've probably heard that Bakhle is a hardass.  This is true; however, all she asks is that you show up on time to lecture and not fall asleep or have Jay Z's \"Big Pimpin'\" ringtone blast throughout the lecture hall.  But if her lectures themselves aren't enough to keep you up, you shouldn't be there in the first place.  This course is a must-take.\nWorkload:\nGrading is done by TAs in section (which meets once a week for an hour).  The course is divided into two halves (one though by prof Bakhle and one taught by prof Massad).  The work in both halves is identical.  1 5-6 page paper, 1 test (call it a midterm or final or whatever you want), 1 map quiz.  The test and the paper are worth 20% each, participation 5%.  Second half has the same grading scheme.\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "November 08, 2004",
            "review_content": "\nProfessor Bakhle is, to say the least, a formidable woman. Her lecture style is impeccable, delivering enormous amounts of information in a fashion easy to assimilate and remember. True, she's a bit of a hard-ass, and clearly takes herself pretty seriously (make sure your cell phone/computer is off before class starts, don't let yourself fall asleep, and don't be late). But she more than makes up with it with her engaging method of speaking and laser-like focus on her subject. That said, I felt there was a fair degree of bias on her part against what she labelled as \"Hindu nationalist histories\" (a concept that was never actually explained) or \"imperialist\" histories, and in favor of Muslims and the Mughal Empire in general. However, compared to the other professors in the department, she's a shining beacon of objectivity. Overall, an excellent professor.\nWorkload:\nLots of reading that you can easily skip or skim and still do well. One relatively easy paper graded by the TA, one easy midterm. Overall not a back-breaker.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "August 13, 2004",
            "review_content": "\nThis class was absolutely amazing. Professor Bakhle packs so much into every lecture you think your arm will fall of from writing but its definitely worth it. There was a lot of reading but you didnt really have to read any of it for class and the TAs were so worthless that you didnt need it for section either. Unfortunately she'll probably be making the reading more mandatory after the fiasco of this past semester but it would still be worth taking this class...she's great.\nWorkload:\n2 papers--very straightforward with the option to be creative so basically all b.s. midterm hard but curved which helped a lot\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "May 15, 2004",
            "review_content": "\nHer course, Gandhi's India, was hard as hell.  Constant reading, furiously paced lectures, and mind numbing sections.  The section/discussion groups are worse than awful, unless you happen to get a cool TA, a rare prospect at best.  The reason for this is that after her stupendous lectures, a twentysomething TA trying to talk about Indian politics while peeling the label off of her Diet Snapple just doesn't cut it.  The class, in other words, is uneven at best: amazing teacher, horrid sections, worth it as hell.\nWorkload:\nPrepare to read and not comprehend more material than you ever dreamed possible.  Janaki Bakhle: the toughest teacher you'll ever love.\n"
        },
        {
            "course_name": "Topics in Asian Civ, Gandhi's India",
            "review_date": "May 12, 2004",
            "review_content": "\nFirst, you do NOT need an extensive background in anything to take Prof. Bakhle's classes, especially if you take both topics and gandhi's india in sequence. I actually do have an above-average knowledge of south asian history simply by having taking courses in high school and I was sometimes frustrated by the fact that she gives us great readings (for example, key texts in subaltern studies, a very interesting school of s.asian historiography (which will be of immense importance to you if you have problems with nationalist and imperialist  historiography) of which Partha Chatterjee, who teaches here, is a big member) but doesnt talk about them as much as facts and dates. Still, she is very willing to talk in office hours and speak to your specific level of knowledge. \nSecond, I too will warn you that she really is  a bitch on wheels if your cellphone goes off or if you come late. The origin of this idiosyncrasy is interesting in its own right: As on of Edward Said's students she has absorbed his classroom style which I hear was very no bullshit.\nLast, she tries hard to be a teacher (more than just a lecturer) even in a big class and this really comes through in office hours if you care to go. \nCoda: Take this class if your historical interest is strong enough so that you dont mind hearing the conventional narrative of South Asian history with minor twists here and there in lecture, and then read the alternative new narratives and engage with her, the ta and of course your classmates about it.  \nWorkload:\n2 papers, a map quiz, and a final which she did not administer this year because of a failure of memory almost admirable in a history professor. All in all, not bad at all. \n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "May 07, 2004",
            "review_content": "\nYes another glowing review for this amazing prof. Wow she's one person who actually lives up to the hype. An absolutlely phenominal lecturer and a really nice person - I am a graduating senior and this was the only class I felt like doing the work for. Though I  must admit that it definitely is a lot of work and lots of reading - which yeah you don't have to do, but it's always better if you do it. One complaint  about the class was that the T/A session was an absolute waste of time and only complicated what Prof. Bakhle said. I was actually ecstatic when the T/A's went on strike cause that gave Bakhle a chance to take over the recitations. Probably the best class I have ever taken in this school!\nWorkload:\nmid-term - easy, map quizzes - easy, 2 challenging papers, final - lets see!\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "May 02, 2004",
            "review_content": "\nLet me preface this class with a warning. Be prepared for readings, and a lot of them. Coming into this class you should either have a substantial background in South Asian studies or the determination to teach a shitload of background information to yourself. There are ALOT of names and dates, and they come at lightning speed. Don't take this class if your interested in having a good professor, take this class if your REALLY interested in South Asia. I had no background in Indian History and I felt completely overwhelmed the entire semester. Even if I end up coming away with a good grade, it was not worth the mental anguish of being constantly lost. \nA special note: If you are in the Joint Program DO NOT take this course. You simply do not have time for it. \nThis class is what you make of it, and unless you have a lot of time to devote to Gandhi's India, find another history class.\n\nWorkload:\nALOT of dense of reading, not all of which is entirely relevent to the lectures. A relatively easy midterm, our final is all IDs, but we have a TA strike. Good luck.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "April 29, 2004",
            "review_content": "\nAs a senior, I can say that this was one of the best classes I've taken at Columbia. Prof Bakhle is an amazing lecturer and is really passionate about what she teaches. She's clear and articulate and she takes an honest interest in her students. \nWorkload:\n2 papers, midterm and final\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "February 11, 2004",
            "review_content": "\n      As a current student of Professor Bakhle and an admitted devotee, I have the utmost admiration for an individual who can pour so much passion into whatever she does. It is not every semester you come across a professor who infuses their scholarship and teaching with such vigor and excitement. \n   As an aside, Professor B has asked that the following be advertised on CULPA (although she is not a user): When it comes to sleeping in class or having your cell phone ring, she can be (in her words) \"A real bitch on wheels.\" Just ask any of her victims.     As only she could opine, \"Put that in your pipe and smoke it.\" \nWorkload:\n    \"There is a shitload of reading in this class. That's right, freshmen, I said shit.\" -JB     But you will enjoy every minute of it. \n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "November 12, 2003",
            "review_content": "\nJanaki is superb. My favorite professor at columbia. She is a very eloquent speaker and her lectures are extremely engaging, every minute of it. She is SUPER SMART. I never got bored, and i enjoyed everything i learned. Moreover, she is very approachable and always watches out for her students. \nWorkload:\nA lot of reading, be prepared to be commited to the class, otherwise you will fall behind\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "September 16, 2003",
            "review_content": "\nThe most prevalent word on this page describing this woman is \"engaging,\" and it is no lie.  Her lectures are FIERCELY engaging- I don't take my eyes off her when she speaks.  She is by far one of the most incredible professors here.  Take anything this woman offers.  I personally am going to take \"Gandhi's India\" this spring, just to expose myself to this woman's genius again.\nWorkload:\ni'll be honest.  it's immense.  basically all reading, but it's definitely worth it.  if you're interested in the subject, the combination of the reading and her lectures will give you a bulletproof knowledge of indian history.\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "August 27, 2003",
            "review_content": "\nI want to have JANAKI BAKHLE'S children (except she's already married).  She is so UNBELIEVABLY BRILLIANT and ENGAGING, you can't help but have a crush on her.  Her lectures are informative, funny, and she never goes off on tangents.  She is probably the best professor I will have had at Columbia by the time I graduate - certainly the best to date.  She's also a nice person who bothers to get to know her students by name - in fact, one day I sat in a seat away from where I usually sat, and I raised my hand for a question and she said \"ah, Michael, I thought maybe you hadn't come today, you're not where you usually sit.\"  And I hadn't gone to talk to her privately yet or anything, just one email question - I have no idea how she knew my name and where I sat.  Finally, she is just plain NICE!\nWorkload:\nLots of reading - no more than any other major culture class.  Plus, Bakhle definitely makes clear which material is important and going to be on the test.  She also makes outlines for the tests.  Very fair grader.  If you do what she tells you, you'll do well.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "May 27, 2003",
            "review_content": "\nProf Bakhle is really great!  She's a really engaging lecturer and her class is one of the few I've had in college that I actually looked forward to attending.  She moves pretty fast and sometimes things seem a bit disorganized, but you always come out of class feeling like you've learned a lot.  It's clear that she really loves the subject matter and this makes her a great teacher.  Really wonderful class, I'd recommend it to anyone.  \nWorkload:\nTons of reading, but nothing in the course pack is ever discussed and you aren't tested on it either.  The autobiography is important and the different texts are helpful too, especially the Metcalf.  I didn't realize how helpful it was until the end of the semester and I wish I had earlier.  1 map quiz, 2 papers (5-7 pages), an insanely easy midterm and a fair final.  All you really need to do for an A is attend class (which is a pleasure anyway) and learn the key terms, names and dates (which are all given out on sheets) for the tests.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 27, 2003",
            "review_content": "\nI hate reading. A lot. I got through all of Lit Hum and the fall semester of CC having read MAYBE 2 of the books, and then not even in full. I'm the kid who sits in the back of the class and doesn't say anything and falls asleep. But Prof. Bakhle is REALLY amazing, she keeps you on your toes the entire time, she's really interesting and talks about everything from making babies to indian food to what is wrong with English royalty, and makes even Hegel understandable. You better have something to say in every class cos she picks on people, but it's worth it because I've actually come away from CC this semester knowing more than the names of the authors. It takes a lot for me to like a class with such heavy reading, but Prof. Bakhle did it! She's got a nice heart too, IDs for the midterm were easy peasy lemon squeezy, and the final wasn't cumulative.\nWorkload:\nLike every other CC class, way too much reading, 2 short-ish fun to write papers,  midterm, final, with REALLY kind grading. I know someone who got an A+ for this class.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "May 24, 2003",
            "review_content": "\nBest course I have taken so far in college. Prof Bahkle cares so much it moves you. She is an amazing teacher, though she can be a little overconclusive and not as free thinking as she imagines herself to be. Granted, she is wonderful. Absolutely wonderful.\nIts a lot of reading, which you should do for pleasure but will not be tested on or asked to discuss, and a lot of names and dates, some of which are not important. overall though, youll appreciate the rigiour and her caring whether or not you learn.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "May 24, 2003",
            "review_content": "\nThe class is GREAT and she is AMAZING.  By far the best teacher I have had at Columbia.  She actually cares about her students.  Her classes are really interesting, and she can make the most boring topic (the intricacies of the colonial economy) seem interesting.  She has a true passion for her subject, and is always very enthusiastic.  Her lectures are dynamic, and her teaching style great.  Her beauty is merely an added bonus!  The TA's in the class were very helpful, and the progression of the class in terms of chronology is ordered well.  Very interesting class, GREAT professor.  She is very accessible, which makes a big difference as some of hte material may get confusing at times.  OVERALL, GREAT CLASS, and if you take notes, you'll do well.\nWorkload:\nTwo map quizzes (really easy), two papers (5-7 pages), an easy midterm and an ID and short answer based final.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 20, 2003",
            "review_content": "\nJust take her. Trust me. Janaki Bakhle is my favorite teacher at Columbia, and I was very excited to take CC with her. She didn't dissapoint. I believe Bakhle will run MEALAC one day (who knows, maybe the entire University), and she will run it well, just like she does with all of her classes. I've taken classes with her in the MEALAC department, and she was great in a lecture setting, but I was not sure what to expect for CC, both in terms of subject and class size. However, Bakhle knows her stuff, she infuses the class with energy and witty comments, and I loved CC with her (I had a different teacher first semester and hated the course). The additions she made to the syllabus (\"Midnight's Children\", \"Beloved\", Hegel, Fanon, and Tayeb Salih's \"Season of Migration to the North\") were fantastic. Although some students claim to find her overwhelming or intimidating, it's really just that they're wimps. I found her very approachable, and always ready to help. One thing to know: do your reading, she opens every class by volunteering students to answer pointed questions about the readings. \nWorkload:\nSubstantial: HEAVY doses of reading, two 5-7 page papers, midterm and final (not bad, reasonably graded)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 20, 2003",
            "review_content": "\nJust take her. Trust me. Janaki Bakhle is my favorite teacher at Columbia, and I was very excited to take CC with her. She didn't dissapoint. I believe Bakhle will run MEALAC one day (who knows, maybe the entire University), and she will run it well, just like she does with all of her classes. I've taken classes with her in the MEALAC department, and she was great in a lecture setting, but I was not sure what to expect for CC, both in terms of subject and class size. However, Bakhle knows her stuff, she infuses the class with energy and witty comments, and I loved CC with her (I had a different teacher first semester and hated the course). The additions she made to the syllabus (\"Midnight's Children\", \"Beloved\", Hegel, Fanon, and Tayeb Salih's \"Season of Migration to the North\") were fantastic. Although some students claim to find her overwhelming or intimidating, it's really just that they're wimps. I found her very approachable, and always ready to help. One thing to know: do your reading, she opens every class by volunteering students to answer pointed questions about the readings. \nWorkload:\nSubstantial: HEAVY doses of reading, two 5-7 page papers, midterm and final (not bad, reasonably graded)\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "January 26, 2003",
            "review_content": "\nProf. Bakhle is one of the best lecturers I've had at Columbia. She is a compelling and capable speaker (and not so hard to look at, either) and her dynamic stage presence makes it hard to fall asleep in her lectures--that, and the fact that she will immediately notice you and reprimand you for doing so, no matter how large the class. Our class did have the difficulty that she often assumed we understood more of the fundmentals of South Asian history than many of us did (think about an American citizen trying to pick up the story of American history for a classroom of foreigners with the Civil War) but as the semester went on her lectures became more organized and will quite likely be better overall the next time she teaches the course.\nWorkload:\nLots and lots of reading, most of which is interesting enough that it won't be a chore to at least skim it thoroughly. One paper, graded by T.A.'s whose approaches ranged from easy A's for all to failing grades for competent papers, a midterm and a final, both of which were ID-style with the IDs coming off from a pre-distributed study guide. Exams graded fairly leniently; if you use your study guide as the extremely useful tool it is you'll be fine.\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "December 29, 2002",
            "review_content": "\nScary as hell during add/drop week. Then nicens up plenty. She is evidently brilliant but the class is a beeyatch. Reading, reading and more reading. Also she is a historian while the professor who teaches the class with her (Elizabeth Kassab) is a philsopher, and the two styles clash like a mutha. It was also a bit disturbing how no one had any idea what their grades were until they got them. Midterms were out of 20 and the Final was out of 50. No one knows about curves, etc. At least it fulfilled the Major Cultures requirement. \nWorkload:\nTons of reading. One paper (6-7 pages), One midterm and one final. Grading is a mystery though so who knows. \n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "December 19, 2002",
            "review_content": "\nProfessor Bakhle is an amazing professor. She is worth taking th class even if one isnt interested in asian civ! her style of teaching is involving the students in discussions and make them think on their own. she is  an authority and knows who is sleeping in the lecture...i really enjoyed her class!\nWorkload:\ndecent; shit load to read but only one paper and VERY easy exams (multiple choice)\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "September 09, 2002",
            "review_content": "\nAbsolutely fantastic lecturer. Honestly, she's amazing. Brilliant, engaging, and incidentally, gorgeous. Take whatever classes she offers -- you won't regret it.\nWorkload:\nReally, really light. Gandhi's autobiography can be a pain to get through, except for the fact that she gives us 3 WEEKS to do it.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "May 18, 2002",
            "review_content": "\nProf. Bakhle is wonderful-she welcomes questions from students and her lectures make South Asian history even more interesting. Even though she uses dates to begin her lecture, she does a good job of using other materials to engage the class. I really loved her class-she makes the effort to know her students. I encourage anyone to take this class-she is an understanding professor and a terrific speaker. The TAs were very helpful as well.\nWorkload:\n2 map quizzes, 2 papers, 1 midterm, 1 final. She tended to grade harder toward the end of the semester, but she is a generous and fair grader. You should do well if you complete the work.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "April 24, 2002",
            "review_content": "\nProfessor Bakhle is my new hero. I LOVE her class!! She knows what she's talking about, she's funny, she's righteous, and she's a great speaker. I completely recommend any class with her. Her lectures are pretty well organized, and she is willing to go over things right away if you missed something. \nWorkload:\nDon't expect not to work, though. There's alot of reading. There were two 5-7 page papers, but her grading is generous. The midterm was not too bad. The final was harder, but not ridiculous. \n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "April 17, 2002",
            "review_content": "\nBrilliant professor and brilliant TAs (Ravi and Poornima). The three of them complement each other perfectly and all contribute to the class in each lecture. Bakhle is not afraid to ask them when she doesn't know something, lots of respect and comradeship between the three of them. Bakhle is quite intimidating, a strong independent woman with a sassy and confident attitude. But she's very well-read and very knowledgeable, makes the class fascinating every time. You can get away with missing lectures, but you won't want to. Weekly recitations are lots of fun, the TAs are very helpful. The class is incredibly fast-paced, but she more than makes up for it on tests/papers/quizzes.\nWorkload:\nMidterm, final, 2 quizzes, 2 papers, all ridiculously easy. A good amount of reading, but it's always wonderful. \n"
        }
    ]
}