{
    "prof_info": [
        {
            "prof_name": "Adam Berlin",
            "prof_id": 1575,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style II",
            "review_date": "December 13, 2006",
            "review_content": "\nAdam is a really great writing teacher. He can see what work you need to put in where, but won't tell you how to do it. He's very encouraging and sometimes seems to know where a piece is going before the writer does. On the first day of class, I was very skeptical of him because he gave a little speech about how he likes character-driven work and \"heart pieces\" not \"head pieces.\" I later learned that I actually agree with him, because he means he doesn't want you to write a science fiction novel or a crazy, experimental story. This is good because you probably cannot write those things well anyway, since this is structure and style 2 and you have to learn to crawl before you can walk. He also respects his students enough that he doesn't assign trite writing exercises. If you want to take this class you should know how to get going on your own without someone forcing you to keep a weekly journal or whatever. He doesn't give a lot of guidelines in general, which is nice.\nAdam is always available and clearly cares about his students. He held an extra class so we could have enough time to workshop everyone's work thoroughly. He also writes up page-long reviews of your work for everything you turn in, which is really helpful for revisions. Yes, he wants you to revise your work, but you also need to revise your work because you are not a genius. \nAlso, someone in an earlier review insinuated that he only likes guys' writing. That's completely false. \nAnyone interested in writing could learn a lot from Adam. \nWorkload:\n2 poems, a short story, 2 scenes from a play/a 2 scene play\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "December 13, 2006",
            "review_content": "\nAdam is a really great writing teacher. He can see what work you need to put in where, but won't tell you how to do it. He's very encouraging and sometimes seems to know where a piece is going before the writer does. On the first day of class, I was very skeptical of him because he gave a little speech about how he likes character-driven work and \"heart pieces\" not \"head pieces.\" I later learned that I actually agree with him, because he means he doesn't want you to write a science fiction novel or a crazy, experimental story. This is good because you probably cannot write those things well anyway, since this is structure and style 2 and you have to learn to crawl before you can walk. He also respects his students enough that he doesn't assign trite writing exercises. If you want to take this class you should know how to get going on your own without someone forcing you to keep a weekly journal or whatever. He doesn't give a lot of guidelines in general, which is nice.\nAdam is always available and clearly cares about his students. He held an extra class so we could have enough time to workshop everyone's work thoroughly. He also writes up page-long reviews of your work for everything you turn in, which is really helpful for revisions. Yes, he wants you to revise your work, but you also need to revise your work because you are not a genius. \nAlso, someone in an earlier review insinuated that he only likes guys' writing. That's completely false. \nAnyone interested in writing could learn a lot from Adam. \nWorkload:\n2 poems, a short story, 2 scenes from a play/a 2 scene play\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "May 09, 2005",
            "review_content": "\nAdam is a good writing teacher. He requires everyone to legitimately workshop everyone else's pieces, and he always gives you a very detailed written critique of your work. He seems big on revisions. He mentioned them rather frequently throughout the semester, but the vibe from the class was that most people did them right before they were due. So it goes.\nPeople have said this before, but it's quite true so I shall restate: Adam loves writing \"from the heart.\" \"Head pieces\" are not his thing, and he will frequently say that. Being clever and funny (and entertaining) is always well received during the actual workshop, even by Mr. Adam Berlin, himself. However, if you are \"GPA-type\" with a great sense of humor and wit, Adam will like you, but he won't give you an \"A\". Ouch! That's ok though, stop obsessing about your grades. You should have given that up in high school. Enjoy your better than a B+, not quite an A or whatever he chooses to give you.\nIt's probably best to extend yourself outside of your comfort zone in writing for this class. You only write 2 poems, a short story, and part of a play (2 scenes) ...It's really not much to prove yourself and show development (if you choose to have any.) If you just can't help being funny... run with that on the short story, but when it comes time for your play... write it about a canoe builder or carpenter or something like that... write about how his craft is his art. Working with his hands etc etc. Have him be soft-spoken, yet profound. Adam likes John Updike a lot... throw in some of that too. You will have a total winner. I guess you could do the reverse and have the short story be dramatic and \"low to the ground\" ... your call. As far as poetry goes... if you think you are good at poetry, you probably aren't. That's all I have to say about that.\nYou see, even my CULPA review is a \"head piece.\" So it goes. Anyway, Adam is a good guy and you will learn stuff from his comments and the rest of the class, even if you don't write in the preferred form. Also, who wouldn't want to take a class from someone named Adam Berlin. It's probably the greatest name in the Columbia Writing Program.... although, Loren-Paul Caplin provides some fierce competition... and who could forget Aaron Hambuger, who gets an honorable mention.\nWorkload:\n2 poems, a short story, 2 scenes from a play.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "December 28, 2004",
            "review_content": "\nAs others have said, the student who reviewed professor Berlin in April 2003 could not have been more wrong.  Adam is a good teacher and a respected writer.  His comments are always spot on and he can point you to the exact problem of every scene, but he waits for the class to talk it out and brainstorm it first before offering his suggestions.  As to the accusation of him being \"offensively manly\" and that \"gender is everything\" in his class.... forget it.  Everyone is treated equally.  If you want to talk, he lets you talk.  If he disagrees with you, he says \"fair enough\" and lets it lie.  There is no favoritism at all.   This is a good class.  You'll be a better writer at the end because he honestly cares about you and wants you to do better.  So please, take this class \nWorkload:\n2 poems, 1 story, 2 scenes + class participation and attendance.  (Honestly, I would have liked to have turned in a few more revisions to really fine tune our work, but I really like hard work.... that's just me.)\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "December 14, 2004",
            "review_content": "\nAfter reading the April 2003 review, I was terrified when I was switched into Adam Berlin's class from another section of S&S2.;  Now that the semester is almost over, it has been my favorite class and he's the best instructor I've had at Columbia.  By contrast, the ONE full professor I've had at Columbia has been far less accessible, timewise and intellectually.  \nIt seems to me that the April 2003 reviewer wasn't familiar with the concept of a workshop, they aren't meant to give you exercises to get the juices flowing.  At this level, you're expected to do that yourself and come to class prepared.  A first draft needn't be perfect, but there's no hand-holding, either.  We worked hard, we  carefully read and critiqued one another's work and I think everyone got a lot out  of it.  Adam led the discussion in a way that was respectful and encouraged participation.  And it was fun!\nTechnically, he's conservative -- he cares about good, old-fashioned, character-\ndriven (e.g. characters the reader can care about, rather than crazy plot twists) prose with a beginning, middle and an end.  Compared to another class I had here, which was full of nonsensical, metafiction where I felt like I was underwater while reading, this is the real deal.\nAlthough he's clearly a fiction guy, he was patient enough to read several extra poems and revisions, as well as give me extensive feedback on them.  He consistently went above and beyond the call of duty.  I was especially impressed that he wrote about 700 words of feedback for each assignment, and was available before and after class, as well as by email.  That's more than I can say for a lot of my Columbia instructors.  Bottom line:  Adam Berlin has made me a better writer.\nThey really should hire him full time or at least for a fiction workshop, which he'd obviously excel in.  I can't recommend Adam Berlin's class highly enough.\nWorkload:\nVery reasonable -- 2 poems (\"somewhere between a haiku and an epic,\" he said, seems to prefer prose poems and no picture poetry), 1 short story, 2 scenes from a play -- he wants to see REAL revision, not just a couple of line changes.  Thanks to the department policy, I am not sure what my grade will be.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "November 15, 2004",
            "review_content": "\nWhoever wrote the April 2003 review must not have taken the same class that I did.  Adam Berlin takes the time, after every piece of work you turn in, to write a page or more of typed commentary on your work and ways to improve.  Something I have never seen any professor at Columbia do.  He is always around before or after class and his comments are always insightful and quite helpful. He has published 2 books and many short stories but still finds time to help any student who asks. He isn't a flashy post modernist or anything like that, but instead a proponent of the conservative story with a sound plot, something all beginning writing students should master. I recommend this class to all writing students, it is one that I have enjoyed.  And I don't see how that reviewer could find any problems with this teacher.\nWorkload:\n2 poems, short story, 2 scenes \n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "November 15, 2004",
            "review_content": "\nTake his class!  Yes, he's a conservative writer but for a semi-intro writing class I think this is a good thing.  By conservative, I mean that in short stories he wants a beginning, middle and end, a theme and a resolution of sorts.  Everyone in the class is not yet a published novelist, so I think it's important to learn the structure of a story in this class.  \nBerlin's comments are always great, and he really knows how to help you out.  He makes himself accessible an hour before & after class, and moderates the workshopping well.  While the level of excitement in the class depends on the students (and their writing), Berlin is always interesting and makes great observations.\nI've really learned a lot from his class and I think I've improved a lot since S&S; I.  In the meantime, read his novel, Belmondo Style (which you can borrow from the writing center) and you'll understand his comments and writing style better.  \nIn a word, he likes your writing to be REAL.  He wants you to struggle with the words, and even put yourself into your work so that it feels closer for the reader.  Take his class.  You'll love it.\nWorkload:\nNot bad.  2 poems (any length aside from haikus), 1 short story (~8page min, though he sets no official minimum), 2 consecutive scenes from a play (4-6pg total).  Portfolio of the \"heavily revised\" work is due at the end of the semester.  No idea on how he grades, but I think he wants a large change between original draft and conclusion.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "November 15, 2004",
            "review_content": "\nGreat professor.  He writes a full page of comments about anything you write and is very accessible during office hours (an hour before & after class).  He is no-nonsense - don't come late, hand in work ontime, etc. - but this is a good thing.  I've personally got a lot out of his comments.  His short stories are really good and his novel Belmondo Style is awesome.  (he's also written another novel, Headlock, and teaches full-time at John Jay College in addition to teaching @ Columbia) In addition, he is accessible via e-mail and is willing to help you a lot if you put in the effort.  I've heard nightmare stories about other S&S2; professors - Berlin is a great professor and I wish he taught more classes in the writing program.  Take him! \nWorkload:\n2 poems, one short story, 2 scenes.  Revise works during the semester.  Hand in portfolio at the end of the semester.  Attendance and lateness affect grade, so come and be on time!\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "April 22, 2003",
            "review_content": "\nUMMMM... a manly man to begin with, and a self-professed \"conservative writer.\"  we did no exercises or anything to get creative juice flowing, besides reccommended but obviously taken as a joke practices like -\"Hey write a two page dialogue like this hemingway piece\" (and he loooves hemingway, of course) or \"write every day for an hour\" ... yeah right. unfortunately, im not a disciplined writer, so i got nothing out of this, esp. not from him.  the class is just a workshop, was only good because i had a talented class, and his comments are always \"i think that _______ element of the story will really open it up-- reexamine that part and try to make that the point where you crack it all open\" or \"where you earn the tears at the end\". and for some reason these \"places where we should open up\" are always the wrong places at the end of our work. just plain bad advice. and offensively manly, genders EVERYTHING and divides the class\nWorkload:\nnothing- poem, fiction piece, scene. revise it after, turn it in for an A plus. you won't get anything out of it...\n"
        }
    ]
}