{
    "prof_info": [
        {
            "prof_name": "Michael Aufrichtig",
            "prof_id": 11270,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "PE Fencing",
            "review_date": "December 25, 2012",
            "review_content": "\nThe review before this captures the class perfectly. The only difference is that during my year we didn't have to follow international fencing scores and I managed to convince Michael to make our final take home. Best class ever. He would meet up before class with students who wanted extra practice and even gave a few make up lessons before/after class to students who missed class. Electric fencing is mad fun. One day he had his students teach the class because he was absent, I found this super fun as we mostly did fitness exercise that the varsity fencing team does. I wouldn't say my whole class enjoyed that aspect though hehe. One of my most enjoyable experiences was when he invited us to attend the yearly home match of the Columbia Fencing team. Since we already had an experience with electric fencing, we truly appreciated the talent the varsity fencers have. Those people are freakin ninjas!!! and truly entertaining. \nTAKE THIS CLASS YOU WON'T REGRET IT!!!\nWorkload:\nShow up, google a random fact, google stuff to complete a take home final (aka, middle school worksheet!)\n"
        },
        {
            "course_name": "PE Fencing",
            "review_date": "December 26, 2011",
            "review_content": "\nA really entertaining way to satisfy the PE requirement. The man's just so damn enthusiastic about what he does, it's hard not to get excited about going to class every day. We worked on epee (I believe the other class was saber), but didn't actually pick up swords until about halfway through the course; I was really frustrated by this but all the time spent on footwork pays off in the end. By the last few weeks we were regularly getting hooked up to the electric equipment and fencing real bouts.\nI think the best testament to how enjoyable this class was is that everyone was begging him to add an intermediate fencing PE so we could keep going.\nWorkload:\nShow up.\n"
        },
        {
            "course_name": "PE Fencing",
            "review_date": "December 18, 2011",
            "review_content": "\nTake this course if you are lucky enough to get into it and definitely with Michael! Michael is the new head coach for Columbia Fencing and he is the best physical education professor I have ever encountered in my life. He is definitely knowledgeable on the area he teaches, and encourages students to develop an interest on fencing as a Olympic sport in general.\nThe most distinct feature of this course if that you will get to learn not only how to fence (in Epee) and its rules and the history of Columbia Fencing. We have tiny google search assignments every week on the names of Columbia Olympians and NCAA champions, which can be done on the way to the gym. We were also asked to follow the results of international competitions, to keep ourselves on the top of the news. Originally I didn't understand the purpose of these assignments, but later I realized that he was trying to make fencing part of our worlds. Not everyone can become professional fencers after taking PE classes on it, but by taking this course you get a chance to acquire a new (livelong) interest, which will not only enrich your personal experience, but also help with future networking. Columbia fencing has a very long history and great traditions. By taking a glimpse of it I feel prouder to be a Columbian, and hopefully you will feel the same after learning fencing with Michael.\nMichael took this course so seriously that at the beginning of this semester he did a survey on what we expect to get out of it. At the end of the semester we even had a class picture taken, which was sent to each student along with a video featuring our class. Who will ask more from a PE class?\nWorkload:\nAttendance and memorizing basic facts and rules of fencing as we have a written \"final\". The final was really easy though; he gives you the questions several weeks before.\n"
        }
    ]
}