{
    "prof_info": [
        {
            "prof_name": "Ying Liu",
            "prof_id": 11195,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 18, 2011",
            "review_content": "\nBasically what the previous reviewer said. The lecture's are boring and you will be hard pressed to stay awake, if you decide to show up that is. It should also be emphasized how little the midterm and final have to do with the homework question; both of them are highly theoretical. Our final didn't have a single calculation problem (which is what 80% of the Homeworks consist of). They are all incredibly theoretical. That said, if you're in this class, pay great attention to the practice exams and go to lecture on the day he explains them, because they are very similar to the real exams. It's a lot of theorem-based stuff. However, I wouldn't recommend taking this section of the class. \nWorkload:\nWeekly Homework problem sets (10 questions out of the book, pretty standard)\n2 Quizzes (Multiple Choice and one other question)\nReally weird (though not necessarily incredibly difficult) midterm and final. Both open book and open note, so make use of that. Bring the practice exams with their solutions.\nOne voluntary course project which is...also weird? It requires you to use the program R which is never used in class except for Homework problems (for which you pretty much have to teach it yourself). I submitted something for this using the help of tons of online resources for R, but I feel like I can't speak on the difficulty of it until I get my grade. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "November 03, 2011",
            "review_content": "\nWorst professor that anyone at Columbia could ever have. He has no idea what he is doing. He comes to class with slides that copy material directly from the textbook. The slides consist mainly of the formulas in the text with no concrete or useful examples to help you understand the application of the material. He is very laid back and calm,... while he flies through very dense and complicated calculus and material that other classes never see. The homework are composed of problems from the textbook while the midterm has questions that can not be found anywhere in the textbook? Do not take this class even if you have a statistics background because you will be doing a lot of textbook reading and learning on your own. There are WAY better teachers for this class!\nWorkload:\nOne problem set a week. Not incredibly hard but harder than the problem sets in other classes.\n"
        }
    ]
}