{
    "prof_info": [
        {
            "prof_name": "Wojciech Kopczuk",
            "prof_id": 4465,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Public Economics",
            "review_date": "January 19, 2013",
            "review_content": "\nI have a slightly different perspective from the past reviewer. I think this course is a sleeper easy A; I think some people are put off by the \"math\" required and don't realize just how straightforward this class is. Ultimately it's not a very good lecture or class, but I did very well with minimal effort. Here's how.\nLectures & Recitation:\nWent to maybe 2 lectures, if that, and slept through them. Seemed bad. Didn't attend a single recitation, but TAs were helpful via e-mail if needed and the review sessions for exams were also helpful. TL;DR: Don't attend unless your morals make you.\nProblem Sets:\nProblem sets are based relatively exclusively on the lectures; however, the lecture notes themselves are not very good and occasionally the book was a required tool in coming up with the answers.\nThe PSets are the heart of the course. I was able to ace the tests because I took the time to understand how to solve the Psets. If you copy the Psets & don't understand your answer, you'll probably have a much more difficult time during the test.\nThe Psets have two types of problems: Concepts & Mathematics. Concept Problems are very straightforward; they either make you copy a definition from the lecture notes or make you come up with examples of concepts that are defined in the lecture notes. They are generally not important for the tests but the finals had a couple.\nDon't get scared by \"Mathematics,\" the Econ problems for this course are the relatively easy problems you did in Intermediate Microeconomics. Basically, you're dealing with Demand, Supply, MC...and that's pretty much it. You're shifting these lines to create DWL, PS, and CS and calculating those. That is the easy stuff in micro and it's a big part of this class.\nFurther on the Mathematics Problems - Each problem set will highlight 2-3 types of \"Mathematics Problems.\" For example, finding the amount of labor a person should spend given a certain utility curve; etc. etc. Work through these and understand how to solve them, and you'll be able to solve all of the other types of this problem, kind of like learning a language where once you're fluent, it's easy.\nExams:\nExams draw heavily from the problem sets. Thus, if you understand the Psets you should have a really good time, though there may be one or two twists and tricks you should keep an eye out for. The most important thing to do for Exams is to make sure you can solve all of the practice problems you're given in addition to Pset problems Just keep doing them over until you can solve them. If you do this, and then take the time to go over the lecture notes and memorize some of the key concepts (which are not many), you won't face many surprises on the test.\nFinal Note:\nI strongly recommend getting a group together to work with when you're doing problem sets for this course. It not only helps pass the time, but also helps when studying for finals to have others with whom you can compare solutions to practice problems since the solutions are not given.\nTL;DR: Poor lecturer but straightforward class. Quite possible to get an A, though some don't because of inadequate understanding of the problem sets or practice problems. \nWorkload:\n5-6 Problem Sets that can be solved in 1 night; say in 6 hours when working with a group. 1 Midterm & 1 Final which require a decent amount of studying as you have to master the practice problems. Still overall I'd say a decently light workload as the material is not very challenging.\n"
        },
        {
            "course_name": "Public Economics",
            "review_date": "December 17, 2012",
            "review_content": "\nThis class is not a great experience.\nFor one, the TA's teach all the math. Kopczuk tries to go over it in class, but it's impossible to follow him. For one, he uses slides, so the steps of the math aren't explained thoroughly (in lecture or just on the slides). For another, he spends so much time in class talking about how the US tax system or welfare system or government is set up that he doesn't ever have time to cover the math. \nDon't go to lecture... \nSo, if you take this class, plan your schedule around BOTH recitations, too. Because he sets up recitations on two different days, every two weeks. This way, every week you have a recitation, but the material in each different TA's recitation is supposed to be identical. (Does that make sense? So one TA will teach a recitation in Week 1 on Tuesday. Then the other TA will teach a recitation in Week 2 on Wednesday. Week 1 and Week 2's recitations are supposed to be identical). The thing is that, for one, sometimes weeks were skipped for recitations, so if you planned on going on Wednesday, you were screwed. For another, sometimes problem sets were one week apart, so these recitations were not identical.\nThe TAs for this class (Ferran and David) were great, though! Ferran is really soft-spoken, but he helped a lot and was always able to understand and answer questions. David's sarcastic, witty, and really energetic. I, frankly, would have rather asked Ferran a question than David, but I would have rather been lectured by David.\nThis class is Microeconomics 2.0, so if you didn't get Micro in Intermediate, don't bother taking this as an elective.\nFrankly, I think that unless you're a policy sci major or you really are interested in the material, there's better electives out there for you to take in the Econ department.\nI would not take this class if I had the option.\nWorkload:\n6 problem sets (math is taught in recitations)\n1 midterm and 1 final, equally weighted, both with tricky questions \n"
        },
        {
            "course_name": "Public Economics",
            "review_date": "December 13, 2010",
            "review_content": "\nProfessor Kopczuk is a great guy and will go through great length to explain everything in an easy to understand way. It was my feeling that he has a broad knowledge of empirical research, and is often expressing opinion about the quality of such research and theories which is good, as opposed to simply dropping it on the class. He's fair and the problem sets and exams aren't tricky.\nI think he made a mistake during the first week or two of class, though, by going over basic economics stuff that people who are taking electives should be familiar with. I believe this, together with practically no class discussion (at least at the beginning) made a lot of the students skip class, which was a shame, since this sort of material is really helpful, especially when combined with data from actual research, to anyone who's interested in a career in public offices or policymaking.\nOverall it was a good class, he's a funny guy and very nice person, and I recommend this class as an economics elective. If not for the material, then simply because the majority of electives stink.\n\nWorkload:\nNot too hard. 6 problem sets, relatively easy (only a small portion is math, which is simple); midterm; non-cumulative final.\n"
        }
    ]
}