{
    "prof_info": [
        {
            "prof_name": "Helena Uthas",
            "prof_id": 12098,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "June 05, 2012",
            "review_content": "\nHelena was a lovely section leader. She began each seminar with an interesting article or video related to the material presented in Monday's FoS lecture, continued with a recap of this material, and ended with group activities. This I think was pretty standard across the sections, but Helena made the experience enjoyable and pleasant and (insert more positive adjectives here.) She was both kind and approachable as well as knowledgeable. It was clear that she really cared that we understood the material and wanted us to do well. She even took each of us aside towards the beginning of the semester to discuss how we were doing on the WIA's up until that point. Class in general was always laid back and the quizzes more than fair if one looked over the material (she gave study questions ahead of time, which was great.) Her review sessions before the midterm and final were also very helpful, so make sure you go to those (but you should also make sure to study on your own.) My advice from personal experience is to get started on the WIA's early in the week so that you can ask questions (she doesn't discuss the WIA questions or give any hints in class before the due date.) Also, submit a draft of the term paper and revise it before the due date so that you can score full points on that.\nIn summary, consider yourself lucky if you get Helena as a section leader. Come to class, do the WIA's (enough missed classes or WIA's can make a significant difference in your final grade,) show some enthusiasm, and you'll be \"really great!\" :) \nWorkload:\nStandard FoS: \n-12-15 WIA's (1 WIA each week): These range from easy to moderate and often have one or two tricky \"back of the envelope\" calculations.\n-3-4 Quizzes: Like I wrote above, more than fair if one studied.\n-Midterm and Final: Both tests got mixed reviews, but in my opinion both were challenging but doable. \n-Term Paper: Fairly simple.\n-Required trip to the American Museum of Natural History: Fun! :)\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 12, 2012",
            "review_content": "\nHelena is a great seminar leader! She is so caring, patient, and approachable. The class was hard to wake up for at 9 am, but she made it pretty fun with cool videos and occasional anecdotes. \nHelena also cares a lot about her students, and she'll make sure to talk to you if she thinks you're struggling. Definitely go to her office hours if you have any questions about the material (or just to say hi). She also offers fantastic reviews for the midterm and final.\nWorkload:\nstandard for FoS seminars: 1 WIA/week, midterm, final, term paper\n"
        }
    ]
}