{
    "prof_info": [
        {
            "prof_name": "Sherally Munshi",
            "prof_id": 4560,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 06, 2010",
            "review_content": "\nSherally is a great professor. I felt privileged have her. The readings were engaging and interesting, her grading system holistic and fair. She facilitated great discussions. Although she was relaxed and casual she had an impressive grasp of intellectual texts and theory. She was able to cite a sources on a broad range of topics with authority. Her essay topics were interesting and her process of paper writing was conducive to achieving a favorable product. Plus she is really cool. Everyone in the class liked her and she was very intellectual but in a relatable approachable way. Highly recommended, especially given what I have heard about some of the other instructors.\nWorkload:\nWe had a bunch of shorter papers. Overall the workload was very appropriate and reasonable. She had drafts and gave back great comments, allowing you to actually improve your paper.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 23, 2009",
            "review_content": "\nSherally is one of the best professors I've ever been privileged enough to have. She's incredibly open-minded, relaxed, and a very down-to-earth person. The paper requirements were flexible based on the amount of experience each student had, and was very understanding about other circumstances. That being said, she expects a certain level of professionalism and preparedness for class, which are rewarded with fabulous discussions when class time comes. She has a young, vibrant personality that shines through during class and on her insightful comments on all work handed in to her. She does take a regrettable amount of time in returning work to the class, but it's well worth the wait.\nWorkload:\nSome heavier reading at the beginning of the semester, but easier after that.\n"
        }
    ]
}