{
    "prof_info": [
        {
            "prof_name": "Claire Ullman",
            "prof_id": 5227,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "comparative politics of gender inequality",
            "review_date": "December 08, 2016",
            "review_content": "\nProf. Ullman is so unbelievably smart! The class is very reading heavy, and focuses on class discussions about the reading. It's super interesting, and really great if you want a more thorough background on gender inequality in politics, as well as in labor markets and relationships. The class focuses on theory AND data/studies, so you feel really knowledgable (and prepped for any fight about political inequality). It's a heavy workload, but necessary for the class because most of class is discussion. I would recommend this class to anyone who's looking for a more substantial understanding of how gender is treated internationally, wants to have numbers & studies to them up in an argument (make your sexist fam scared of you because you are so informed!!!), or is interested in the way gender is treated in politics. \nWorkload:\n5 discussion papers, participation! and a 15 pg research paper\n"
        },
        {
            "course_name": "comparative politics of gender inequality",
            "review_date": "December 08, 2016",
            "review_content": "\nProf. Ullman is so unbelievably smart! The class is very reading heavy, and focuses on class discussions about the reading. It's super interesting, and really great if you want a more thorough background on gender inequality in politics, as well as in labor markets and relationships. The class focuses on theory AND data/studies, so you feel really knowledgable (and prepped for any fight about political inequality). It's a heavy workload, but necessary for the class because most of class is discussion. I would recommend this class to anyone who's looking for a more substantial understanding of how gender is treated internationally, wants to have numbers & studies to them up in an argument (make your sexist fam scared of you because you are so informed!!!), or is interested in the way gender is treated in politics. \nWorkload:\n5 discussion papers, participation! and a 15 pg research paper\n"
        },
        {
            "course_name": "Equality Between the Sexes",
            "review_date": "April 19, 2013",
            "review_content": "\nAn extremely interesting class for those interested in gender studies, however, the workload is not necessarily what you might be looking for in a first year seminar. Professor Ullman is clearly quite knowledgable on the topic and is good at keeping discussions going, she is interested and engaging -- however, the success of her discussions evidently depend on how much the class has read or understood the reading. Definitely a class worth taking if you are interested in the subject and willing to do the reading for it -- you will get out of it as much as you put in it, but keep in mind that participation is 15% of the grade, so it will be difficult to get the A you want if you don't plan to read and participate. Professor Ullman also gives weekly quizzes on the reading, often on the same day that papers are due (there is reading due simultaneously with your essays). Essentially, a good first-year seminar if you are interested in the topic and want to put in the time -- if you are looking for an easier A, or just an easier first-year seminar experience, I suggest looking elsewhere.\nWorkload:\n30-90 pages of reading a week, 3 essays spaced throughout the semester (submit drafts for each), weekly reading quizzes and 1 final presentation based on the third essay.\n"
        }
    ]
}