{
    "prof_info": [
        {
            "prof_name": "Brandon County",
            "prof_id": 3146,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Africana Studies: Past, Present and Future",
            "review_date": "November 06, 2011",
            "review_content": "\nThis guy isn't even a professor - and yet he is teaching my Africana studies course: past, present, and future. This is by far the worst class I have ever taken, in every way. Not only is this \"professor\" an air head who rambles on about nothing and really makes no sense even when you try to follow him, he also created the worst possible syllabus. This was suppose to be my interesting course, I was even considering minoring in Africana studies before this class, but it turned out to be the biggest disappointment. Not once during his \"lectures/discussions\" did I feel inspired or moved in any way, something I was fully expecting to feel due to the subject matter. This course is very heavily based on the \"abstract idea of Africa,\" how can we \"talk\" and \"approach\" what Africa is today without being too general. We read a whole bunch of scholars', historians', and anthropologists' writings who argue the concept of Africa and the word Tribe and why it is all politically incorrect today. Not only was the subject matter dull and had no real flow or focus, but the work load was ridiculous as well, ESPECIALLY for an introductory course. This professor really has no idea what he is talking about and it showed as my originally 20 person class started dwindling every week, and continued to dwindle in attendance past the drop date. There is only so much I can say about this class and how thoroughly disappointed I was to have wasted my time in it - I sadly don't feel like I gained anything\nWorkload:\ntwo classes per week, with about 100 pages of readings (all articles and essays) per class, along with a non graded post about the readings responding to his convoluted question before each class. \nA 1,000 word midterm paper with an in class midterm as well (which had no connection to class material, though he gave us the midterm before hand as our study guide), and a final 5-6 page research paper with a take home final. \n"
        },
        {
            "course_name": "Main Currents in African History",
            "review_date": "January 09, 2007",
            "review_content": "\nBrandon was a great TA.  I always found his section really useful and even entertaining.  He assigned each week's discussion/reading to one or two students but typically ended up leading the class himself.  I'm not sure how others felt about this (after having prepared for leading discussion) but I welcomed it both as a presenter and a student.  He was really well-versed in his area of expertise (mainly Mali/Senegal I think) but also very knowledgeable about the course content and African history in general.  I would recommend his section highly.\nWorkload:\nyou're responsible for one week's readings (includes really knowing the material and posting a framing question on courseworks) and a weekly courseworks post of about a paragraph that anyone could bullshit in 20 minutes if necessary... not bad at all and helps make sure you're keeping up with the work\n"
        }
    ]
}