{
    "prof_info": [
        {
            "prof_name": "Paul Olsen",
            "prof_id": 574,
            "total_reviews": 22
        }
    ],
    "reviews": [
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "July 01, 2015",
            "review_content": "\nI had a completely different experience from the person below me....\nIf you're looking for an easy class or expect to spend your time sitting around talking about 'Land Before Time' then this class is NOT for you. I know a lot of my classmates took this class expecting an easy A, but this is not a \"rocks for jocks\" class.\nProfessor Olsen is EXTREMELY knowledgable about all things dinosaur related, but he also incorporates general principles of evolution and climate change into his lectures. His lectures did tend to be a bit \"dense\" and 80% of the material he discusses in class was not on the final or useful in writing the term paper. However, he ALWAYS tells you what is going to be on the final and even discusses what aspects of each lecture might make a good term paper topic. With that in mind I completely disagree with the reviewer below me. If you can't think of a topic for a term paper in this class then you're just not paying attention or weren't showing up to his lectures. I got an A+ on my term paper and didn't have to do rewrites...'Professor Olsen also gives you a giant list of possible topics. If you can't thin of one just choose one (there's literally over 30 given to you).\nI chose to take this class along with the lab and I highly suggest to do the same. The labs are run by the TA's and correlate with the lectures. I learned more in depth information from the labs than I did from the lectures. Also make sure to go to office hours! The TA's offer them on various days and they are beyond helpful! I was one of the few students who weekly went to the office hours (mainly for help on my labs) and there were rarely more than four students there. (note: none of the kids just taking the lecture went to office hours... which is why a lot of them did so poorly)\nIn terms of the final... it was tough to study for. Professor Olsen expects you to memorize a ton of information. However, he gives you a list of the dinosaurs you need to know and the cladograms. It's a lot of cramming that happens the week before the final, but it's totally doable! He also gives you a practice exam and 90% of the questions from the there are on the final. I got an A on the final and I couldn't tell you any of the information that I studied. It left my brain immediately following the exam, but just cram and you will be fine.\nI got an A in the class and I really do NOT feel like it was that difficult of a grade to achieve. I got an A+ (Yes a 100%) on my term paper, which I spent time researching and chose a topic that actually interested me. You get to choose whatever you want for the topic and I think the freedom in that was wonderful. If you have issues choosing the topic then Professor Olsen was always available after class to ask and the TA's were always AVAILABLE at office hours. The person below me clearly didn't utilize the resources available to them.\nBottom line- Your grade represents the work you put in. If you're looking for an \"easy\" A then I suggest taking another class. But if you're willing to put in the work then getting an A isn't that difficult. This is Columbia you should be capable of doing work outside of each lecture and not just expecting to coast until the final sneaks up on you.\nWorkload:\nALOT if you do the lab, but the labs are extremely easy to get A's on. You get to do rewrites of each lab and resubmit for a new grade (it's averaged with your first attempt)\nLectures: GO TO THEM! He gives random iclicker tests that account for your participation grade\nHomework: is vague and definitely ask the TA's for help. Also there's only 3 assignments so... actually put some effort into it\nTerm paper: so easy. Seriously you could write about how 'Jurassic Park' inaccurately depicts dinosaurs and get an A if it's written well\nFinal: Take good notes in lecture and cram the week before. It's tough but doable\nNote: I did NONE of the readings (didn't even use them to study) and got an A...\n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "June 16, 2015",
            "review_content": "\nIf you're taking this to fulfill your science req: DON'T. This class has taken off so many years of my life.\ntl;dr: Olsen seems like a good guy, but the class is absolutely awful due to the irrational grading. I was bored all the time and only went to class because of the pop quizzes. Only take this class if you actually like dinosaurs and have stellar cramming skills because the amount of information you're expected to know is fucking ridiculous. \nClass: He has iClicker quizzes most classes. Thankfully, he grades for attendance, not correctness. Even if your answer is wrong, you'll still get full points for just being there. He'll put up his slides online before each class. You can usually tell if there'll be a quiz that day if there's a slide in the powerpoint that's completely blank (he leaves the slide blank, rather than deleting it from the powerpoint). Take notes - once you finally start learning about dinosaurs, the slides are all pictures, no info or text. He likes to show dino movie clips a lot and talk about how they're inaccurate, so if you're into that good for you I guess. He also has lecture notes up from the early 2000s somewhere online, and they haven't changed much since. They're very useful if you can't be bothered to pay attention.\nHomework: These were truly, truly awful. The instructions for each would be terribly vague and unclear; you would have no idea of how you were to go about it, what to do, and what the TAs wanted. I lost so many points because I didn't do something that the TAs were looking for, but that would never be mentioned in the instructions or class. Thankfully, there were only 3 and they ultimately don't count for much, but it was still super frustrating to see so many points docked for such trite things.\nResearch paper: Oh god. This motherfucking paper was a nightmare for so many people. Again, there was the issue of an incredibly vague topic, unclear examples, so once again, no one knew exactly what they should be delivering. They give you a long list of possible topics, but that doesn't mean you're safe. Originally, we got a rewrite that would account for half of the final paper grade, but so many people got fucked over by the shitty instructions and shitty grading and complained to Olsen that he decided to have the rewrite completely replace the first draft grade (after sending a condescending email on how to write a hypothesis, which was stupid because that was hardly the problem. The problem was the incredibly unclear instructions). One of the TAs was useless, the other was helpful & basically told me what to rewrite (probably because she was tired of dealing with unhappy students). However, if they were just clearer from the beginning (providing a partial sample paper, even) about what they were expecting, none of this would have been such a problem in the first place.\nFinal: This is a whole 'nother beast. You have to know so much fucking information, it's 99.9999% impossible. You have to know a list of 30-40 important dinosaurs/other ancient creatures, the time period they lived, where they were discovered, why they were important. You had to know several cladograms, be able to label a dinosaur skeleton, around 20 famous dig sites, and other misc. info on geology, genetics, dinosaur anatomy, and on and on and on. Thankfully the practice final was pretty close to the real final, but it still sucked.\nJust don't take this class. Save yourself. Don't do it.\n\nWorkload:\nNote: percentages don't add up b/c I don't remember exact breakdown\nFinal (30-40%)\n1 8-10 research paper. Rewrite option that either is worth half of final paper grade or completely replaces first draft. (40%?)\nPop quizzes (20-25%)\nOccasional HW (5%)\n\n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "May 13, 2014",
            "review_content": "\nNote: This review is from Spring 2013 course. \nOne of the more interesting professors at Columbia. Professor Olsen is a great lecturer and goes over quite a bit of material in each lecture. He's passionate about what he teaches and it's always good when a professor enjoys the material that he's teaching. \nFortunately, I had an interest in dinosaurs from childhood which made class more interesting. However, Class will get boring especially for those just using this as a science requirement. No matter which way you slice it, fossils will be fossils and if you don't have the interest in it in the first place, it'll be tough to pay attention in class. If you choose to give your iclicker (used once every class for participation) to a friend and skip all the lectures, you'll have your work cut out for you during your final. It's certainly doable, but you'll need to cram like hell. The cladograms, bone anatomies, and fossil theories seem endless but it is certainly possible to cram for, especially since Olsen provides a practice exam. Pay attention to this, as many questions are repeated on the final. \nOutside of the final (no midterm), there is a research paper that needs to be done on your topic of choice. Generally this is pretty flexible, as long as it relates to dinosaurs in some way. The paper was graded twice, with the second grading being the final grade. The first drafts were graded exceptionally harshly, but if your final grade was higher than it would replace the first draft grade. It's not something you attempt the night before, so keep that in mind. \nBottom line, if you have an interest in dinosaurs, by all means take this class. Olsen is very receptive to fielding questions during lecture. If you're just taking this a science req, that's fine, you'll probably have to cram like crazy for the final memorizing a bunch of dinosaurs and cladograms that you'll probably forget after the exam. But as long as you'll study, you'll do well. Just remember those iclickers...\nWorkload:\nOne 10ish page research paper and 1 final. Final was very much like the practice exam distributed in class: T/F, Multiple Choice, Short Answer, etc. \n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "June 06, 2013",
            "review_content": "\nSo I'm a grumpy humanities student who generally has no fucks to give about the science requirement, and I'm glad I took this class. There is almost no work required of you throughout the semester, so you can pretty much let the class drop off your radar until the term paper and final come along.\n(At which point you will have to cram months' worth of dino facts into your head at a ridiculous rate, but whatever. It's agonizing but doable.)\nYou have to turn in a term paper draft mid-semester. It's annoying, but you will be very, very glad when finals roll around that you already have an almost completed paper to work with rather than having to start from scratch. Olsen gives you a huge list of possible topics to choose from, a few of which aren't at all technical or even very scientific. (I wrote mine about historical linguistics.)\nIf you're looking for an easy way to fulfill your science requirement and have a decent capacity for cramming at the last minute, this could be the course.\nAlso, dinosaurs are pretty cool. Who doesn't like dinosaurs?\nWorkload:\nAlmost none. There was one short homework assignment at the beginning of the semester, a term paper draft due shortly after spring break, the final draft of the same due at the end of the semester, and then a final exam. Attendance alone is apparently worth 20% of your final grade. The paper draft is mandatory, but the grade you get will be entirely thrown out and replaced with the grade for the revised version. The final is fairly obnoxious, but manageable if you use all the study materials Olsen gives you.\n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "May 16, 2011",
            "review_content": "\nFirst, I think I would like to start out by saying that I learned a lot from this class.  After taking this class, I could probably qualify as a tour guide for the Hall of Dinosaurs at the Natural History Museum.  That being said, I can't say that I'm happy about it.  Like many others, I took this class to fulfill my science requirement and was utterly unprepared for what was required of me in this class.  Although you have very little day-to-day work in this class (apart from reading which I never did), the term paper and final alone are unbearable.  You may think that you can handle writing a ten page term paper on dinosaurs now, but by the time you actually have to write it, I guarantee you that you will have neither the time nor the patience.  I would guess that the vast majority of the class cranked out their term papers within three days of the due date.  In addition to the paper, you have a final which forces you to know an absolutely ridiculous number of facts about anatomy, cladistics, climate, stratigraphy, geology, and miscellaneous dinosaur information.  You also have two or three random pop quizzes (one of which I missed), which are allegedly twenty percent of your grade.  All things considered, this class was extremely frustrating.  However, on the upside, I ended up getting an A, so it is possible.  Also, Professor Olsen can be a very good lecturer, even though many of his lecture topics are dreadfully boring.  \nWorkload:\n2-3 Pop quizzes, which I'm pretty sure were graded pass/fail\n1 short homework assignment, also probably pass/fail\n1 10-page paper (if you put in a lot of work you will probably get a decent grade)\n1 Final (many of the questions were from the practice final)\n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "January 15, 2011",
            "review_content": "\nProfessor Olsen is an amazing lecturer. He should be studied as a model for powerpoint presentations--lots of pictures, little text, and lots of talking. I somewhat agree with one of the reviews below that the class was immensely fascinating at first then got a bit dry with all the names and cladistics and anatomy. It would start to seem difficult and you would feel like giving up on reading. And I did. When I was \"cramming\" a whole semester of materials during the finals week, I realized, however, it was my fault. Had I kept up with the pace of the class, the materials were actually really really fascinating just like the relative easier lectures int he beginning. To study for the final I basically used the lecture notes on the course website (enter through the department page). And it was indeed a lot of memorization that was completely thrown into the trash the second after the exam. I wish, however, I had been more conscientious and took more time studying the materials during the semester--it would have been a lot more rewarding. \nThe class, overall, was painfully easy. I don't even think they expect much out of us. As long as you study (it's going to take some effort), the final will be a piece of cake. If anyone has written papers for science research in the past, he or she would know that the term paper is just like that except a lot easier. For the non-science students, Professor Olsen is right in saying that this will be a great opportunity for them to know how scientific writing is done. \nThe lab portion of the course was terribly boring and annoying. Fortunately the TAs didn't expect much out of us either. It was basically \"you'll-be-fine-as-long-as-you-try-for-the-duration-of-the-lab.\"  I think that was pretty reasonable considering the ridiculous amount of tedious work some labs required you to do. \nConclusion? I loved it and although it killed a part of me inside during the final reviews week I still have no regrets.\nWorkload:\na 10 page term paper on basically anything you want to write about dinosaurs (easy)\ntwo show-up-and-you-get-an-A pop quizzes\nOne final that's easy beyond belief if you spend A LOT of time studying like I did and insanely hard if you don't take it seriously--then you might as well PDF the class.\n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "January 15, 2011",
            "review_content": "\nI had to take a class to fulfill some of my science req's, and I'm not any kind of science pro (ie no chem or bio lab for me).  And besides, like most children, I have always loved dinosaurs.  This class seemed like a naturally easy option.  Unfortunately, it's not as awesome as it sounds.  There's two lectures a week (and a lab section that you can take if you need a lab; one of my Barnard friends had to take it with the lab and she says that part is pretty unhelpful).  Olsen, while a nice and quirky guy, is not easy to follow when he lectures.  He often gets side tracked about very specific things such as the quality of mud at the Yixian Formation in this part of China.  There is no midterm, so it's hard to gauge where you are until you get the practice final test and you realize that you know nothing.  The book isn't very helpful - it's outdated, and Olsen never references it.  For good reason, too.  The book jumps around.  Your only grades are a ten page term paper (your choice on the subject) and the final.  I went to all of the lectures, but I either fell asleep or was confused for most of them.  I ended up getting an A on the term paper, but that didn't help with the final. The final is based entirely on stuff that Olsen covered in lecture.  A lot of people stopped coming to lecture, but I talked to some of those people after, and they had a harder time without notes.  This class isn't great, but if you don't leave the paper to the last minute and you study really hard during reading week, you can pass with a decent grade.   **Also, Olsen takes this class very seriously.  It's not a throw away class.  It's a hard core intro to paleontology and earth history.\nWorkload:\nThere are weekly book assignments, but don't have to read them.  One term paper and one final.  \n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "December 22, 2010",
            "review_content": "\nAVOID AVOID AVOID like the plague. I entered this class expecting a fairly straightforward and only moderately difficult science course (since I'm not a science person). It is neither. Professor Olsen is certainly a knowledgable professor, but his lectures can be difficult to follow and too much time is spent on extremely scientific details, thus preventing a real understanding of the broader concepts and themes of the course. I learned very little about dinosaurs overall, despite being one of a select few people to actually attend almost every lecture. Olsen's unexplainable arrogance aside, the TA's (Steve and Rui) were pretty much useless. Steve is cocky and condescending, while Rui doesn't speak a lick of English. Let me repeat: DO NOT TAKE THIS CLASS, even if you are a science person.\nWorkload:\nOne difficult cladistics homework assignment. 2 in class pop-quizzes, on which you receive full credit if you are in class that day to turn it in. A 10-page research paper where you turn in a rough draft halfway through the semester and get a preliminary grade (the average for the first draft was a C-). My advice: write on a simple concept and keep the paper straightforward. \nThe final exam was the most difficult I've ever taken at Columbia. It consists of a time scale, true/false, multiple choice, short answer, essay, a cladogram, and a bone chart (yea, pretty much every form of test combined into one disastrous exam). I prepared for 3 days and still didnt know a fair amount of the questions. The cladogram section, while only worth 15% of the test, requires memorizing up to 6 huge charts. However, the chart on the exam has many species/characters NOT on any of the material distributed in class. Study the practice exam, many questions appear verbatim on the final.\n\n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "December 20, 2010",
            "review_content": "\nDo not believe the reviews below!! This class seems fascinating at first. The first few weeks deal with the history of geology, evolution, and the early Earth. Then, you get to the actual talk about dinosaurs. There are so many names that you could not even hope to spell in your wildest dreams. After about a week, you give up trying to take notes. You basically sit there listening to him speak in what seems like a foreign language and watch video clips from various TV programs about dinosaurs. \nWriting the term paper is actually quite interesting, because you're actually forced to confront a topic and research it. \nThere are no meaningful evaluations of your understanding of the material until the final. Therefore, you basically end up cramming an immense amount of useless information in preparation for the final (which, undoubtedly, you will summarily forget upon leaving the exam). \nWorkload:\nOne term paper (you hand in a rough draft first that doesn't count)\nOne homework\nFinal (beware) \nNOTHING ELSE\n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "November 08, 2010",
            "review_content": "\nLiterally the most amazing class I have ever taken. Even as a Classics major, this class was understandable and an amazing amount of fun! I originally decided to take this to help fulfill my laboratory science requirement simply because it seemed more unusual than any of the general sciences (biology, chemistry, etc.) and I loved it. While there is very little personal interaction with Professor Olsen unless you initiate it, he still knows how to present a lecture and keep class interesting. I suggest taking this class and the lab, just because the lab helps clarify and expand upon a lot of the info presented during lecture. Also, we do fun things like play with legos and and dissect pigeons in lab. Absolutely recommended for anyone not science-oriented, and I'm sure it is just as interesting for those who are.\n.\nWorkload:\nMinimal\nVery few homework assignments, no mid-term exam, one really long and really difficult final exam, and one 10 page paper on the topic of your choice- first draft due at midterm and second draft due on the last day of class.\n"
        },
        {
            "course_name": "EESC 2300 Earth Systems: Life, and ENV 2200 Environmental Biology II",
            "review_date": "November 03, 2010",
            "review_content": "\nThe second semester of Enviro Bio was so so so different from the first, they should hardly be considered part of the same sequence. I, too, enjoyed this semester more, but mostly because the I preferred the material and the laid-back character of the professors. \nMatt Palmer is awesome (too bad he's married now, though!) and he does a really great job breaking material down so that students can understand both the details and the big picture. He very intelligent, and therefore can move through material very quickly, but slows down for in-class questions.\nPaul Olsen is very old. I found his lectures incredibly random and disorganized. I would often look up from 15 minutes of gchatting to see a massive purple and pink \"dinosaur recreation\" on the screen, listened for a few minutes to see if what he was talking about was at all related to the image, discovered it wasn't and then returned to my online dalliances. This said, I understand that Olsen knows his stuff about dinos and rocks, but the technology (ie PowerPoint and iClickers) really seemed to get the better of him.\nKevin Griffin is also a very smart dude. He tends to do more \"big picture\" stuff and assumes that his students can get the details elsewhere. His research is pretty interesting and his kids are really cute (they make it into about every other lecture). \nShaena is the shit. Again, super smart but also cool and very helpful in lab because most of the assignments appeared to be designed for precocious 6th-graders (read: making phylogenies of LEGOS and counting beans for genetics). She made coming in for 3 hours to do the silly \"labs\" okay, because she tolerated extensive Tim and Eric Awesome Show breaks.\nOverall, this is a good class, and if you have the discipline to stay offline in class, you can learn a lot. Hopefully the organization of the whole thing will get better, and the labs will get more college-level. \nWorkload:\nFairly light. Some textbook and article reading, which is super redundant if you took Enviro Bio I. Just skim the stuff before the midterms.\n3-hour weekly \"labs\" in which you get a head start on the \"Lab reports\" and then forget about them until the night before they are due.\n3 field trips, of questionable educational value.\n3 midterms (one after each section). Fairly easy, but study with others because the answers will come from notes, so try to fill in the gaps with classmates.\n"
        },
        {
            "course_name": "EESC 2300 Earth Systems: Life, and ENV 2200 Environmental Biology II",
            "review_date": "May 15, 2010",
            "review_content": "\nI enjoyed this second half of environmental biology far more than the first half.  I guess I just don't really like the grueling rote memorization of DNA replication processes and of central body systems.  This class was actually quite fun, though, and I liked all three professors we had.  \nThe first section (photosynthesis and respiration) was the most difficult, both in terms of exams and labs, but nothing was particularly difficult.  I have never met anyone so excited about photosynthesis and respiration as Kevin Griffin, and it makes lectures much more enjoyable.  He teaches the first section of Life Systems/Environmental Biology II in great detail and relies heavily on the Raven et al textbook.  Read the textbook!  \nThe second section was a paleontological look at life systems on Earth.  This includes a brief (two lecture) history of the universe, a similar history of the earth, and looks at dinosaurs, etc. It's fun, and some of it fits in nicely with the Climate Systems course, and it would be helpful to have taken Solid Earth Systems before this or at the same time (I haven't yet taken it).  Of the three professors, Olsen had the least clear lectures, though most of the time I could follow along.  His discussion of the greater carbon cycle (including through rocks, etc.) I couldn't at all follow, but it didn't show up much on the exam.  Olsen did not follow the textbook much, so pay attention to and study the lectures, and you'll do fine. \nThe third and final section (evolution) was taught by the much loved Matt Palmer.  Seriously, this guy is great.  He's young, engaging, hilarious, and generally a really fun professor.  This section is the easiest, and the labs are easy and short.  You've learned a lot of it before if you took the first half of environmental biology.  \nLabs were generally terribly written.  There were field trips at the end of each section (though it had to be cancelled for Palmer's section), with longer lab reports due for these, requiring some outside research through the literature.  Normally, however, the lab reports just required you to fill out the answer sheet instead of writing a full lab.  \nWorkload:\nWeekly lab (usually with an answer sheet), 3 (we only had 2) full lab reports.  Three midterms, one for each section.  No cumulative final.  \n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "January 16, 2007",
            "review_content": "\nThis was one of the most exciting classes I have had in my life. Prof Olsen not only knows his stuff well but also helps students understand the material. The material is fascinating for anyone who thinks that evolution and dinosaurs are interesting. The work load might seem difficult to non- science majors, with all the names of epochs, dinosaurs etc. But its worth taking if you want to get a diet version of the history of life. A plus to Prof Olsen and A plus to the course.\nWorkload:\nif one reviews the material regularly and does not leave it to the last minute, it is not as difficult as it may seem. One term paper and one final- both do-able when not left for the last minute.\n"
        },
        {
            "course_name": "EESC 2300 Earth Systems: Life",
            "review_date": "October 16, 2004",
            "review_content": "\nPaul Olsen is the first of three professors, each teaching for one month.  Professional is a fitting description.  His presentations run like PBS documentaries.  He is an excellent speaker, and he easily combines perspectives of life from paleontology, geology and the solar system, giving a unique outlook on the Life systems of Earth.  So, not only does he know the material extremely well, he presents it with variety and style, and with video presentations.  That is a lot of work to prepare for a class, and I really appreciated that he tried to make it real and interesting.  The room used for the class is also very comfortable and cave-like, so it can be an enjoyable experience, a little like a trip through time and life.  It is a really great introduction to the subject and the other professors.  Some notes and a syllabus have been available on the Earth Institute's course website year round, so you can review them to see how you feel about it.  However, they are no substitute for the classes, obviously.  The professor is straightforward about the tasks and exams, and available for questions, so you should have no problem if you keep up with the lectures and studies.  See workload for the lab situation.  In the end I felt it was a very wothwhile class, and a privilege to be taught by a top scientist whose knowledge base has a maturity of years of research, and he conveys the richness of his understanding that if you want to learn about the Earth, I highly recommend you experience. \nWorkload:\nLecture notes, best to review and learn immediately, since to some extent, a lot of the information builds upon the other.  But not very burdensome, and if you are inclined, you can even review these and the readings before the class begins since the information is available on their class website year-round.  Note cards for the facts work.  The big challenge for this section is getting to the museums and doing the drawings and finding out the information for the labs.  It is a fascinating adventure if you want to see it that way, and can be a lot of fun, as I had.  But it takes time to do properly, and effort, so be prepared for that, and maybe more than one visit, since it is tiring to go through a museum for more than a few hours at a time.  Fortunately, the American Museum of Natural History is free for students.  Find out how to do scientific drawings from the prof. or the TA, and find out what they want to see labelled, and you shouldn't have much problem.  They are looking for scientific observations, not fine art.  Some people took digital cameras with them and then filled out some of the details of their sketches later.  So that cut down on time spent standing or sitting around the exhibits.  Some are hard to sit by.  Altogether, very demanding assignments but very rewarding also and complementary to the lectures.  I think that in this instance, I don't think they are being overly demanding of us students.  They know why and how they are pushing the students, so that it does become a good educational experience, and I felt confident about that.  \n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "October 12, 2004",
            "review_content": "\nQuite possibly the best class I have ever taken. Paul Olsen is an amazing professor and the material is fascinating. I wish I could take the class again it was that good. If you have time and any interest in dinosaurs, then take this class!\nWorkload:\neasy, you dont really have to do the readings. there is no midterm, a 10 page paper, 2-3 easy homework assignments, and a final that wasn't bad at all.\n"
        },
        {
            "course_name": "EESC 2300 Life system",
            "review_date": "May 09, 2004",
            "review_content": "\nProf. Olsen tries very hard, but has a way of wording exam questions and labs that make them difficult to the point of making them entirely unenjoyable. He manages to ruin a very good subject by going off on irrelevant tangents about dinosaurs, and his labs are SO LONG, while managing to be somehow very uneducational. His lecture style is not so engaging, although his visuals are quite good. He also did not return an email sent, asking to meet for extra help.\n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "April 30, 2004",
            "review_content": "\nIt is my intention that this message may give solace to those in this same situation:  It's 39 hours until the term paper is due and I haven't finished my introductory paragraph.  I have spent upwards of 30 hours already preparing for this and the pursuing of primary sources has led me to numerous dead-ends.  It is nearly impossible!  I love the lectures.  Professor Olsen and Dan the TA are extrememly knowledgeable and interesting, but the work is just unbareable.  At this point I can't see myself passing, but then again there are probably others like myself giving shit's creek a solid curve.  It is really a shame that it is so difficult, because the content is really interesting.\nWorkload:\nA few easy homeworks, A 10 page term paper with every idea traced back to a primary source (nearly impossible), a final that I don't look forward to.\n"
        },
        {
            "course_name": "Life System",
            "review_date": "April 04, 2004",
            "review_content": "\nVery organized lectures, but glossy and short on actual material. Most of his exam is a straight-up memorization of the geologic timescale.  Olsen's labs are particularly tortuous as they involve many-hours-long individual fieldtrips to places like the aquarium and AMNH to draw numerous fish, and dino bones, (and ALL the flowers, trees, and plants at the botanical gardens)\nWorkload:\nlabs are ridiculous, exam is not too bad\n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "February 16, 2004",
            "review_content": "\nPaul Olsen is an excellent lecturer and is one of the best in  his field. However, I was told this class would help the fulfill the science requirement for non-science majors. And it will, if by some miracle I am able to pass. Olsen requires his students to have the kind of knowledge that only a science major would have. Biology, Chemistry, Earth Sciences, etc. I'm an English major and it's all going over my head. This class is the hardest I've ever taken. Olsen dropped the mid-term for this semester, suggesting it would make the workload lighter. Not. It means the final is cumulative. And the homework is ridiculously difficult for someone who has been unable, despite many hours of studying, to understand the material.\nWorkload:\nmore like a serious of impossible tasks.\n"
        },
        {
            "course_name": "Dinosaurs and the History of Life",
            "review_date": "September 04, 2003",
            "review_content": "\nProfessor Olsen is a genuinely amusing and intelligent instructor who definitely knows how to take advantage of a field (dinosaurs) which is automatically more interesting than 99% of subjects.  You'll see plenty of clips from Jurassic Park and sci-fi movies in his lectures, and he'll explain why they are wrong and miscalculated.  The midterm and final are made much easier due to the practice questions and answers that he posts on the website.  Even he admits that a good deal of the website practice questions actually WILL be on the exam.  The term paper is not hard at all.  It merely requires gathering research and sources that are not outdated.  All you have to do is list and categorize the evidence and paraphrase.  He even encourages you to paraphrase it!  This was an enjoyable class and loads better than all those Human evolution and anthropology classes.\nWorkload:\nMinimal.  The homework assignments are few and easy.  The term paper requires some advanced preparation in research (like going to the Geology libraries or the Museum of Natural History).\n"
        },
        {
            "course_name": "V1001 Dinosaurs",
            "review_date": "November 11, 2001",
            "review_content": "\nSo you attend the first class. You meet Prof. Olsen, who is a nice guy and a great lecturer. Then you tell a friend that you are in his class. The friend warns you that you are in for hell. But you can't believe it is true. Well, it is. This class is so insanely hard it isn't funny. It is great right up until the midterm. Then you discover that things Olsen has told you won't be on the midterm actually are. And then there is the essay, which actually asked for the history of life. And it wasnt a joke. The final was no better, but the real kicker was the museum project. I spent an entire weekend drawing dinosaur bones only to do poorly because I am not an artist. If you are going to be a paleontologist, devote your life to this class because Olsen is one of the best in the field. Do not take this class to fufil the science requirement, it is not worth it.\nWorkload:\nA few easy hw's, a few multiple choice quizzes (also retardedly easy), a midterm (AAAAAGH), a ten page paper, a museum project (bring an art major), and a final (it was bad).\n"
        },
        {
            "course_name": "V1001 Dinosaurs",
            "review_date": "April 05, 2001",
            "review_content": "\nDo you know patrick durkan? i swear this is his father. A little wacky and offbeat, he takes the topic too seriously. \"Yes, a hummingbird is the smallest dinosaur.\" Just remember that birds are dinosaurs, and you'll be fine...\nWorkload:\nSo much work. Oh so much. Someone please tell him this is dinosaurs!\n"
        }
    ]
}