{
    "prof_info": [
        {
            "prof_name": "Elia Gurna",
            "prof_id": 2546,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate German I",
            "review_date": "May 03, 2006",
            "review_content": "\nElia Gurna is one of my favorite professors at this school.  She is friendly and really wants you to learn German, no matter what it takes.  Her class was not as easy as most language classes, but it really helped me improve my German.  She is leads discussions really well, and I was never bored in her class because I was always involved.  She is a fair but tough grader; however, if you don't get a grade you like on a test or paper, you can correct everything and turn it in multiple times and earn a few extra points.  She is really a fabulous teacher!\nWorkload:\nfairly heavy for a language class, but well worth it because you learn so much\n"
        },
        {
            "course_name": "German 1202",
            "review_date": "January 04, 2006",
            "review_content": "\nConsider yourself blessed from the heavens if you are fortunate enough to land in one of Elia's classes.  She is everything a teacher should be (plus, she's cute).  Best language class I've had anywhere, ever.\nWorkload:\nNormal.\n"
        },
        {
            "course_name": "Intermediate Conversation German II",
            "review_date": "December 26, 2005",
            "review_content": "\nElia ist just wonderful. She sincerely wants to  help students learn German. I remember once I just asked her about \"Deutsche Plus\". The next class she just remembered and brought me the copies of the video. Her assignments are also much fun. Being an aristist, she has unique taste of making things nice. After learning German proverbs, we ironed our favorite proverbs with an appropriate picture onto T-shirts. She also made professional pamphlets of our Fragenbogen.\nOn the whole, such a cheerful and kind teacher!\nWorkload:\nTagebuch, Midterm Presentation, and some interesting projects.\n"
        },
        {
            "course_name": "German 1202",
            "review_date": "December 25, 2005",
            "review_content": "\nI'll make this short and sweet- if you have a chance to take Elia Gurna for ANY German class, consider yourself blessed.  I mean blessed.  This woman personifies why the German department is the best language department at Columbia- indeed kicks ass over all the others- she's caring, excited, helpful, fun, hard (but in a good way- in an \"I want you to learn German way,\"), cool, and any other positive adjective I've left out.  You'll look forward to going to class.  \nWorkload:\nNot easy, in that she does give out work- but they all do.  Difference is, with her, you'll WANT to do it.\n"
        },
        {
            "course_name": "Intro German 1101",
            "review_date": "July 09, 2005",
            "review_content": "\nElia is an outstanding teacher; she is fun and interesting, but also keeps you on your toes, so you learn a LOT of German.  After one semester in Elia's class, I placed into the Advanced 2 level of a German summer class.  All the other people have studied German for several years, and it is a tribute to Elia that I have can speak German with some sort of fluency after just one semester.  I recommend her highly, and if you have the luck of finding yourself in her class, just make sure to take advantage of the opportunity.  \nWorkload:\nConsistently assigned exercises online and in workbooks; chapter tests about every other week.  Not difficult if you keep up on the day-to-day work.  No midterm; written and oral final.  \n"
        },
        {
            "course_name": "Elementary German",
            "review_date": "May 17, 2005",
            "review_content": "\nElia is a fantastic teacher, one of the best I've ever had. She is Austrian so a native speaker, which helps when you have complicated questions or want to know how to say something colloquially. She is personanably, understanding, and relates well to students. Her class is very fun as she often incorporates singing and other games to help you learn everything from vocab to sentence structure. I never had a problem with not wanting to come to class, even on thursday nights. Elia knows how to teach well, as her class this semester scored the best overall on the final.  If you're looking for a fun way to learn German, then this class if for you. That said, expect to do all your work. She is nice but also has high expectations for class so slackers beware.  Trust me its worth it though. \nWorkload:\nHomework everynight (1-2hrs) randomly collected, online work for every chapter, test for every chapter and a final. No offical midterm.\n"
        }
    ]
}