{
    "prof_info": [
        {
            "prof_name": "Jeffrey Snyder",
            "prof_id": 2769,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "August 26, 2007",
            "review_content": "\nI couldn't have asked for more from Music Hum than what Professor Jeff gave.  He's a passionate, good-natured and engaging lecturer.  Yup, he devote more time to recent music than some teachers - to his credit, in my opinion (although the first reviewer got it wrong, it's not all about noise/minimalism).  He also has a soft spot for Bach, yet manages to get to all of the curriculum thoroughly.  Go chat with him in his office hours about his own work, and you'll appreciate what a talented music geek he is.  \nWorkload:\nThe standard issue concert reports, midterm and final.  Fairly graded.   \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "March 17, 2007",
            "review_content": "\nI think that Music Hum is generally a really difficult class to teach and than Jeff did a very good job.  He obviously tried to find a way to make the class interesting and accessible to everyone, and I think any difficulties he had had more to do with the structure of the course than with him.  It is true that Jeff spent a decent amount of time on 20th century music, which I think was actually really wonderful for the half of the class who had already had some musical background.  Even if the course is probably not the most exciting one you'll ever take, regardless of the instructor, Jeff is passionate about his work and extremely helpful and generous during his office hours.  \nWorkload:\npractically nothing\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 30, 2005",
            "review_content": "\nThis was the first class Jeff ever taught and man, it shows. To be fair, Jeff is a very cool and laid-back guy who is clearly excited about his passions. Unfortunately, his passions are the uber avant-garde kind of music that totally alienates normal music listeners. He got way too hung up on the basics of pitch/rhythm toward the beginning of the class, devoted half a class to the Romantics and four classes on the Noise Movement/minimalism. It could've been interesting if he'd been able to control class time better, but by the end of the semester we felt like we'd learned nothing from his mumbling delivery and haphazard lesson plans. \nWorkload:\nfour concert reports, minimal reading (NOT from the Kerman listening book though) and reading responses, midterm and final \n"
        }
    ]
}