{
    "prof_info": [
        {
            "prof_name": "Linda Doerrer",
            "prof_id": 1681,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Chem 1002: Molecules and Matter",
            "review_date": "May 15, 2005",
            "review_content": "\nSo I took this class because the pre-med advisor said it would help me with Gchem this fall - This class was really hard for me. Prof. D. really cares about making her students learn, however, the class was not structured so well. She writes out all of her notes on the board (making it pointless to go to class if you have a nice friend who will let you copy notes) and all of the homework was impossible to do unless you went to her office hours where she went over every problem with every student and gave you a basic idea of what to do. I still didn't do well on the problem sets though. The textbook (Pauling) was impossible to understand and after reading 5 chapters, I stopped reading the book. The other book (Ball) was really stupid and you only need to read this to write the essay for the final (I only read chaps. 5 and 6, which seemed the most relative). However, Prof. D. is dedicated to her students and is really nice and approachable.\nWorkload:\nWeekly problem sets (impossible without going to office hours!), 2 midterms and a final (involving an essay on the properties of water). You don't really have to go to class if you can get someone to take notes (she writes all her notes on the board and you just copy them anyway).\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Doerrer knows everybody's name and she is very prompt with returning material andresponding to emails.  She is a great professor and made a difficult class enjoyable.  Labs were easy, the lab book spoon fed everything to you as if you were a little baby.  The class is demanding, but with hard work it is possible!  The lab instructors were great and the labs are fun, especially the quantitative chemistry portion.\nWorkload:\na mid-term, a final, a problem set a week, and PHGA (every weekday, an internet assignment)  It's a lot!\n"
        },
        {
            "course_name": "Gchem I",
            "review_date": "December 29, 2004",
            "review_content": "\nProf. Doerrer is the sweetest women ever.  She teaches classes fairly well and comes to learn everyone in her class by their first name (impressive).  She is also very helpful in office hours for extra help.  However sometimes material is not covered very well in class and the tests can be unreasonable. \nWorkload:\nReading, weekly problem sets (worth a total of 8%), and tri weekly online problem sets (only worth 2%),  two midterms (15% each), and a final woth 30%, the other 30 % comes for the lab portion of the course :)\n"
        },
        {
            "course_name": "G Chem 1601",
            "review_date": "January 19, 2004",
            "review_content": "\nI'd like to give another perspective on this class, being that it is possible to have a life, AND pass this course with a pretty good grade. I assure you, I did it.  However, by no means am I implying that this course is easy or that there isn't a lot of work.  After all, this is chemistry, and they like to make you work your butt off to preserve the high standards and reputation of the science department here.  I actually heard that professors at other colleges were utterly baffled at our midterms.  That said, you don't have to do every single problem in the book, or every practice problem she assigns for the midterm.  The homework she assigns is excellent practice for the exams so dont kill yourself reading every little word and doing every problem in the book.  The woman knows what she is doing, so if you have questions, dont memorize the book, go talk to her.\nAbout Prof Doerrer, she is absolutely the most wonderful professor teaching one of the the most painful semesters you will have if you are lucky enough to be pre-med.  She is understandable, extremely helpful, FUNNY, and soooo nice.  SHE KNEW EVERYONE'S NAME IN A 160 PERSON CLASS.  You can talk to her and she will tell you some of the coolest things about chemistry...or assure you that you are not stupid and you will be ok.  She completely made me regrett not majoring in chem.  Anyway she is also a very capable teacher.  As hard as the material is, she does an excellent job of teaching it, using jokes, analogies, whatever, and keeping you up, making you laugh, and getting you not to hate her after you just got a 50 on your second midterm.  and all of this at 9 AM, not an easy feat.\nI honestly could not imagine a better person teaching me Chem than Prof. Doerrer.   The material is baffling at first, but then it makes sense (sort of) and you feel like you are Einstein.\nThe lab portion is really hard too, but once again, its possible to do well without giving yourself ulcers.  And the lab staff is WONDERFUL.  Overall I guess Barnard understands how hard and brutal chemistry is so I'm glad they've given us the best, funniest, and nicest professors to help us get through it.\nWorkload:\nIts Doable, and you dont have to stay up til 2 am every morning to finish it. Once a week should be enough. i guess im kind of kidding, however you need to DO IT, it will save your ass.  Every problem she gives is excellent practice for the exams.  Stay on top of things I urge you, otherwise you will get confused.  Put effort into the problems, and make sure you understand them, it will pay off.  If you dont get it, go see her, she has office hours dedicated to the problem sets. get into the habit of doing it from the beginning, its for your own good, you either see her or cry when you have to figure it out on your own.  Also go to the review sessions for the exams, going in i felt like i had no clue about anything yet came out an hour and a half later feeling pretty confident.  The book is really good too, it helps fill in the holes and clears up loads of confusion, plus its simple, concise, kind of interesting, and pretty humorous at times.  Lab is hell, I won't lie to you.  apparently it helps lift most people's grade up.  god knows how, but it does.  the first 6 are pretty horrible, so go get help for them, trust me about 15-30 minutes will bring you from a c to an a.  im not lying, ive done it myself.  Do the experiments correctly, they are totally into accuracy, as my D+ will attest to.  you dont have to memorize the manual, just get an idea of what on earth you are doing, youll get out of lab quicker for it.  and as for the lab manual, god i hated that thing.  the lenghts they go to to make you figure out the most insanely difficult concepts only to tell you how to do it 3 pages later.  if youre confused check the part about caclulating the % error, it will expain how to do the problems...but why they chose to tell you once you've already labored for 5 hours to figure it out is beyond me.   anyway once the quantitative labs are over, lab actually becomes fun, and boy does your grade improve.  you now get to play with pretty colors, do some cool investigative experiments, figure out the contents of mysterious substances.  I know im making this sound overly exciting, but after 6 weeks of calculating .0001 accuracy, you will too.\nSo all in all, follow the manual, word for word, they like their lab reports the way they like them, and the more you follow the manual, the better your grade will be. if you go to get help, they will teach you how to better follow the manual so you get an a.  learn from the notes they make on your reports, a got a few A+'s doing so when my average grades were nowhere near that.    and remember, it's 30% of your grade, so dont slack off.\nThe exams are pretty hard too.  If you took ap chem youll get an a on the first one and spend the rest of the semester just as confused as everyone else.  but if you do the homework you'll be less confused.  DONT IGNORE THE ONLINE HOMEWORK, i know it's only 2% of your grade but you'll get brownie points for effort and i swear if i hadnt done them i probably would have gotten a c inthe class.  Everything in this class is extremely calculated by CHEMISTS, people who know how to be very calculated.  nothing that is required is superflous.  it is actually beneficial and essential.  if you dont do the homework you'll be skrewed, its as simple as that.  one little problem set a week will carry you through, you really need to learn and practice all along, there is absolutely no way to cram, even if you get the answers afterwords and practice the homework youve missed, its not the same.   Im not a science nerd nor did i get an A+ in this class, but i am telling you if you learn early on to the the work, you will get through this class and enjoy it.  Prof D. is an absolutely wonderful woman, the lab staff is too.  The material is often very interesting, and incredibly rewarding, you will probably never get such a sense accomplishment as you will after this course, and you will be eternally grateful to Prof D. for teaching you things that everyone should know about, like the fact that one cfc atom will stay in the ozone layer forever, continually destroying ozone molecules...so don't pollute.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "November 12, 2003",
            "review_content": "\nShe is a very smart women, however sometimes I would get very lost during the lectures, but she was always very helpful and clear in her office hours.  Overall, I did learn a lot, and she is very nice, but you do have to do a lot of figuring things out on your own.\nWorkload:\nweekly problem set, ungraded nightly problems, 2 midterms, and a final\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "November 06, 2003",
            "review_content": "\nDr. D is great!  She is clear and enthusiastic.  This class is not easy, but if you like chemistry, it actually ends up being lots of fun (some folks might disagree with me...).  If you want to do well, you're going to have to work hard.  The work load is doable, but it will take up lots of time, as you may have assumed from the 5-points of credit youÂ’ll get.  One problem set is due each week, along with a significant (but reasonable) amount of reading in the textbook.  The textbook is great!  It is clear, and covers the material in depth, but not in gory detail.  Do the reading!  I find it really useful to also do the problems within each chapter.  The first exam is relatively easy.  The second exam is a lot more difficult and really pushes you to think.  This is a good thing!  In general, scores tend to drop quite a bit on the second exam, but it is to be expected considering that the material really does get a lot more difficult conceptually.  I have yet to take the final.  I find Dr. D's problem solving sessions really helpful!  She is dedicated to teaching, and she makes you feel lucky to be at Barnard where teaching is held in such high esteem.  The lab element of this course is also difficult, but I find it really rewarding.  The first six labs are concerned with accuracy and precision.  We're talking about 0.01% relative uncertainty here.  Make sure to read the Lab Manual thoroughly before each lab.  It is their bible, and it will become yours.  If you work quickly, carefully, and know what you're doing before hand you should be able to do well.  Office hours for lab are great!  Lab weeks 7-11 are fun qualitative analysis.  This class is hard.  I think it's a lot of fun!  It'll take up a lot of your time, and although youÂ’ll be told on day one that it is not a \"weed out course,\" I feel like it is at times.  Doerrer is great!  I haven't met anyone who doesn't like her.  Makes you feel good, eh?  In any case, if you want to duck out of the science requirement maybe this course is not for you, but if you think you would have fun learning all sorts of cool things and spending a lot of time making sure you understand chemistry, go for it.  It's rewarding and Doerrer makes it good.  Thumbs up!\nWorkload:\nweekly problem sets (go to the problem solving sessions!), online homeworks (2% of your grade, no big deal, but they are very useful!), two midterms (first relatively easy, second quite difficult) and a final\n"
        },
        {
            "course_name": "G-Chem Lab Recitation",
            "review_date": "August 29, 2003",
            "review_content": "\nI'm also submitting this only b/c students are requesting info.  I also only had her for recitation, not lecture.  But, Dr. Doerrer was very clear, informative, engaging, and exteremely approachable.  She's wanted to teach G-chem for a long time, and I'm sure she'll do an awesome job.\n"
        },
        {
            "course_name": "Lab Recitation for General Chemistry",
            "review_date": "July 04, 2003",
            "review_content": "\nOnly submitting this because many students have requested info on her... I had her two years ago, but only for lab recitation.  She was definitely an interesting, informative, and amusing lecturer...The chemistry majors that I know love her and if I had to recommend G-Chem with her as a professor, I would.  Then again, I only had her for 50 minutes a week two years ago... \nWorkload:\nIt seems that most of the Chem profs at Barnard use problem sets and exams similar to those of the professor they are replacing...  If this is the case, expect a weekly problem set (and do not hand them in late!!! not even by 5 minutes!!!) and probably 3 difficult, but not impossible exams...well, they might be impossible to a degree... See Sally Chapman's G-Chem workload\n"
        }
    ]
}