{
    "prof_info": [
        {
            "prof_name": "Jared Lister",
            "prof_id": 9557,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "September 03, 2014",
            "review_content": "\nGlad to see Jared now has a silver nugget, as he deserves. I had him for University Writing in an American Studies section last year during the first semester, but am only now getting around to writing about him. Jared was super personable and very dedicated to trying to get students to care about the material. He taught UW as more of a seminar based class revolving around the readings, which were all very interesting and he offered a lot of insight into, rather than the \"how to write\" portions. Class discussion was encouraged, but he was by no means pushy - I remember a specific occasion when one classmate commented on a girl who never talked in a somewhat rude way and Jared defended her, which stuck out as a class act to me.\nAside from that, he's genuinely interested in his students' lives and in just talking to them about what they're doing. He encouraged us to write about things important or engaging to us and tie our writing to the modern, even when reading old texts. He's also very accommodating with deadlines and happy, even excited, to talk to students about their stuff outside of class. \nHis grading seemed fair to me - he's enthusiastic in pointing out what he likes about your writing and not afraid to give comments where he sees a need of improvement, which were by and large very helpful.\nHe's also a funny guy and loves to talk about rap and other music. He also had a long conversation with us at one point in which he tried to puzzle out exactly what the phenomenon of Pokemon was to our generation. \nWorkload:\nReasonable amount of reading, very few pop quizzes that don't count towards your grade, only serve as a wakeup call. 3 progressions and a final essay that for us was an editorial that took no time at all. He asks the class if they need extensions and makes them if they do, and also is pretty open to just giving you an extension should you ask far enough in advance.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 21, 2014",
            "review_content": "\nJared Lister was one of the best teachers I have ever had. The American studies concentrated University Writing class is one of my favorite classes I have taken at Columbia. Jared assigned really interesting material, and guided the discussion in the perfect way, such that if felt like we as a class were getting into deep questions and answers about the texts. He's funny, relaxed, and very approachable. I'm disappointed to see the less than enthusiastic comments below, I think it's one of those classes you get more out of when you put more into and do the reading. \nWorkload:\nCompletely reasonable, not really more or less than any other university writing class. He was lax about deadlines and always happy to help out and give reasonable extensions. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 28, 2010",
            "review_content": "\nHe can be erratic and moody but he can also be brilliant. Stay on his good side and I promise you will end up a better writer than you expected. \nBasically some of the readings were boring but his formal edits on my paper were really helpful. It could be much worse. I recommend Jared's class if you can take it in the afternoon, but I took it at 9:10 which was not fun at all.\nWorkload:\n3 progressions with lots of revisions + 1 easy retrospective essay\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 14, 2010",
            "review_content": "\nJared was a decent enough University Writing teacher and human being. The class was a 9.10 a.m. class, and so it always felt a little dead in the room, despite his best efforts to liven us up. He brought us coffee once in an effort to wake us up. If you know how to write, he generally leaves you alone. Just get the work done on time. He grew fed up with the University Writing curriculum and made some small adjustments, mostly to the last paper (which he promised an \"A\" for an hour's worth of work). Jared did have an affinity for picking topics I felt were dry, but you suffer in a group setting, so at least other people share your misery.\nWorkload:\nTypical four papers, lots of drafts. If you did the assignments as they came, they were relatively well paced.\n"
        }
    ]
}