{
    "prof_info": [
        {
            "prof_name": "Teena Purohit",
            "prof_id": 2747,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "December 27, 2005",
            "review_content": "\nShe clearly knows her stuff, and will provide historical context and outside information when necessary, but makes it clear that the discussion rests primarily on what we consider important. Though she appears a bit formal at times (she requests that emails must start with \"Dear Teena\" as opposed to \"Hey\" or \"Hi\"), she is very approachable both inside and outside of class. (Especially concerning papers and presentations.) Everyone comes away with good grades at the end, so the focus of the class is on grasping each individual text so you can connect it to the previous and later ones covered in the class.  \nWorkload:\nQuite a bit, but still manageable. Read one large text, or two smaller ones, for each session. Lead the discussion on a particular text (takes either half or the entire class time). Two five page papers on topics of your choosing. Oral examination (also on a topic of your choice).\n"
        },
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "December 22, 2005",
            "review_content": "\nMs. Purohit is a young graduate student who is quite intelligent.  The class met only once a week for 2 hours, was 4 credits worth, and satisfied a Major Cultures requirement for the College Core - yea it was a good deal. You really don't need to read all the texts in this class to do well, but you need to be able to sound like you know what you're talking about in discussion (i.e: same as every other humanities class), since if you don't participate it's glaringly obvious you didn't even open the book. There are a lot of books to read, something like one text due each week, so try to get to Butler soon and borrow them all at the beginning of the semester or get them off a friend who took the class in the past. Logistically, there were 2 papers and an oral final, and she graded fairly leniently on the papers, with the oral final being a breeze if you just focus on one theme throughout the works for the whole 5-10 mins.  So it's not a hard class (although some of your classmates with be grade-A weirdos), the texts are actually pretty awesome, and she's not all bad either. \nWorkload:\n2 Papers and an Oral. Make sure you find at least one good point in the readings to bring up in discussion and you're fine. \n"
        }
    ]
}