{
    "prof_info": [
        {
            "prof_name": "Carol Rovane",
            "prof_id": 968,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 20, 2014",
            "review_content": "\nCarol Rovane’s section was almost interminable and I always found myself looking at the clock to see how much longer I had to sit in class. Although I read every book for the class and took copious notes while reading, when I got to class, I would without fail be lost in her lecture by 10 minutes in.\nRovane’s idea of “discussion” meant literally zero discussion among us at all. Basically, the class structure was this: Rovane gave a long lecture on the topics discussed in the book at hand, then she (kind of) opened the floor for questions from us. What frustrated me the most is that every time someone asked a question or explained some reasoning they had about a subject, she would proceed to shoot it down and trump it with her own apparently higher reasoning abilities. There was really no interaction or passing of ideas between students at all.\nRovane is a very kind lady, but she was not all that helpful when I went to her for help. She also took an unbelievably long time to return our papers to us (I think her record was 6 weeks), which tended to be a problem when we wanted to gauge how we were doing in the class before, say, the midterm or the final.\nThe only great thing about Rovane’s section is that she cut down the readings A LOT, which helped us both to focus in on the important topics and to maintain our sanity in the class.\nWorkload:\nUsually no more than 50-100 pages of reading per week\nTwo 1000-word (2-3-page) essays\nMidterm\nTake-home final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 04, 2012",
            "review_content": "\nI think the one review below might have overstated Professor Rovane's excellence as a teacher. But I certainly disagree with those reviews saying she is an incompetent teacher. She is a senior professor of philosophy and BRILLIANT! Keep this in mind, because this will explain everything from a lot less reading to general silence in class. She has taught this class for many years, and she knows them so well that she deliberately takes away those parts of the text which are not as important or she found too absurd. That way, she can make sure that she covers all the material with equal attention. For those who think this class is meant for discussion, wrong. Well, the real issue is not that she disallows class discussion. It is quite perplexing. Professor Rovane actually makes an effort to stir up the class discussion while still keeping this class a very serious philosophical journey. The only problem is that we students are not exactly up to her standard. She runs this class very seriously. I believe her treatment to the texts are always delivered to us after she has thought about them extensively. She deserves at least a silver nugget if it is solely based on class content. (For some weird reason, being nice or not shy of glorifying students seems to be a more important criterion for getting a silver nugget.) She keeps every text to the simplest level she can accept. But still, all the stuff is within the domain of philosophy, so nothing is really easy. That's why her effort to urge students to speak up only turns into frustration. I admit that she is a little intimidating and distant from the students. She is a serious person so she will not give out praises like \"This is excellent!\" or even \"That's good!\" like they are free. But she does take every student's question seriously and tries to explain them, although often would lead to a lot deeper philosophical concepts. And she has a sense of humor, though could be not so easy to appreciate. She can never run class like Philip Kitcher or joke around like John Collins, but she is by no means an unqualified teacher. I advise only two types of students to take her class: 1. Those who are interested in philosophy and do not mind reserving your immature thoughts to yourself. 2. Those who want an easy CC class and do not mind taking notes like a machine. (Her midterm and finals are literally on what she \"talked about\" in class)\nWorkload:\nA lot less than usual CC reading, as little as 30-40 pages per class; three 1000 word paper. She takes polished draft only, but she revises it very thoroughly and actually gets your grade elevated a lot afterwards; in-class midterm and take-home final (!), not hard as long as you revise class notes, very fairly graded. NO ID, btw.\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "January 09, 2012",
            "review_content": "\nBest professor I've had at Columbia. Wise, exceptionally interesting, willing to engage with students until their needs are met. The brilliance is intimidating, but the person is very warm. It makes for a rather odd combination of deference and comfort when speaking with her, the likes of which is always a positive and rewarding experience.\nI wouldn't recommend taking a senior seminar with Rovane unless one is decently invested in philosophy. She works on very deep material, and shares her nuanced thoughts at a rigorous pace. Without doing the assigned reading (of which there is quite a fair amount) and making solid effort to be engaged in class, it's not difficult to get lost; and given that the grade for the course is entirely determined by a single term paper on a topic of one's choice, grades won't be providing much motivation to do said reading or to maintain said engagement. This is one of those courses in which the amount you put in will be very much proportional to the amount you get out, and there's little besides personal interest in the course to keep you from slacking. That said, keeping up is incredibly rewarding. You'll certainly have a number of \"mind-blown\" moments.\nI have little basis to say what sort of grader Rovane is. From what I know, I would say that she's very fair. I would also say that she is fully cognizant of the significance of one's entire grade being based on one paper, and expects that paper to be quite substantial in turn. She is more than willing to help with the paper in office hours, but don't expect her to narrow your topic for you and direct you along a specific path; expect instead to receive a variety of very interesting thoughts in response to your ideas, and a plethora of potential avenues for you to pursue independently. \nThis seminar experience was ideal for me personally, and will be for most any who are invested in philosophy. I imagine that the independence and the depth of the material studied may have made it less than ideal for others who were looking for a more thoroughly-structured look at the various discussions surrounding freedom and autonomy, or who were hoping to study metaphysics in the style of, e.g., Varzi and Collins (that style being more traditionally analytical, very grounded in logic, quasi-mathematical, etc.).\nWorkload:\nOne term paper. I believe her words were, \"I have received 10 page papers that were sufficient, and 40 page papers that were insufficient.\"\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 20, 2009",
            "review_content": "\nI completely agree with the below review. I planned to buy my CC books as the semester went along, but I ended up buying only the first one and finding the three texts assigned for papers on line. This is because when I did attempt to prepare comments and questions from the reading in the first few weeks, Professor Rovane forced the class into a very tangential direction, and almost never used the text in class as a reference herself. On the day we discussed the Qur'an for example, she spent two hours arguing her perspective on evangelicalism and conversion, which was both irrelevant to the reading assignment and much too influenced by her personal beliefs for what should have been a discussion-based class. When students did attempt to participate, she often took an aggressive philosophical stance against them, which while perhaps appropriate in an upper-level philosophy course, alienated and discouraged most students in CC. Although I believe she is a good philosopher, she lacks much as a teacher, and ultimately made the class (and subject matter) painful.\nWorkload:\nCC readings, none of which need to actually be read, 3 papers on VERY specific prompts but of unassigned length, pretty easy midterm/final if you regurgitate what she said in class.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 20, 2008",
            "review_content": "\nProfessor Rovane is a smart woman who cogently covers the salient philosophical arguments of a wide range of philosophers. However, she is less skilled in provoking discussion among students. Most classes were two hour lectures, far from the appropriate lecture/discussion balance that characterizes the better core classes (let's face it, we don't want to hear our peers opine on Aristotle for two hours without some professor intervention either). She encouraged questions more in the second half of the term, but the first few classes set low expectations for student participation, a sentiment hard to turn around in ensuing weeks. When she did stop to ask questions of the class, they bore down on students with their heavy philosophical weight, leaving most wary of responding for fear--with good reason--of erring. As a result, at the end of the semester I knew few of my classmates' names. I did learn the major philosophical arguments of the semester. \nWorkload:\nThree papers that are not easy but manageable--very specific topics but no length guidelines. No class when a paper is due. The syllabus was vague and confusing so I sometimes incorrectly interpreted the reading assigment, but you don't need to read much unless you have to write a paper, so long as you attend class and listen. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 15, 2006",
            "review_content": "\nProfessor Rovane was switched to our CC section for the spring. I love being in her class; this experience is (almost) everything CC is supposed to be: engaging, thought-provoking, and challenging to commonly-held values.\nThe course isn't over as of this review, but I figured I'd post one before registration.\nProfessor Rovane is an excellent lecturer. She's the head of the graduate philosophy department and really knows her stuff. \nAs for independent thought, she seems pretty tolerant of people who disagree with her, though she will let it be known if she disagrees with someone. She admits that she is one of the few philosophers who believes in group consciousness, for example, so she's not too offended with her if you differ from her on that issue.\nAt the beginning of the semester she came off sounding like a radical socialist. As the course progressed, it was evident that she's much more moderate (she also admits economics aren't one of her strong points). I don't get the impression that she thinks believing in God is stupid, which one review indicated. \nProfessor Rovane does like to tell stories, but they always have a point. We learn things best from our experiences and relating to others'. Her selected tales usually get her message across rather effectively.\nMy only major complaint is that we didn't stick so closely to the texts. She often used class to introduce philosophical concepts in modern terms rather than those used by the philosophers we were reading. Sometimes the assigned texts weren't referred to at all. A few times she assigned a text several hundred pages long and only told us exactly what to read the night before. Some of the stuff you have to read; some you don't. You'll get a feel for it.\n\nWorkload:\nThe syllabus had three papers and a midterm and final. We only ended up having two papers, an open-book midterm, and a take-home final instead. No other written assignments.\nGrading seems pretty lenient as of now. A's on papers and essays are not hard to come by.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 07, 2006",
            "review_content": "\nClasses are boring and long. Most students agree she just likes to hear her own voice....She lectured on rousseau for two hours and then the next week informed us that she had made up everything she had said and none of it was true, merely to see if we were paying attention. also, no direction for the papers.... no page length or any indication of what a good paper is....not very helpful at all. lecturing style does not help when trying to write papers\nWorkload:\npapers are tedious and time consuming because she has made the course one of philosophy rather than one meant to review the books and material\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "January 17, 2006",
            "review_content": "\nOverall, I was pretty satisfied after having taken Prof. RovaneÂ’s course. She lectures well, and covers all of the most significant aspects of our readings in class. It did annoy me that she answered a few too many questions from a couple of students whoÂ’d have their hands raised every few minutes throughout the whole semester, and who rarely had anything very relevant or interesting to ask about. She would occasionally answer peopleÂ’s questions very briefly, but I donÂ’t think the way she did it was too harsh, and it was never called for that she go any more in depth as to why the personÂ’s question was misguided. Indeed, she did it to me once, and after her brief (but complete) response, I realized that my question actually was a pretty dumb one.\nOn the whole, I really enjoyed the readings, which I thought were well selected (by her, to my understanding). The class was based off of DescartesÂ’ first four meditations, after the reading of each of which we would go on to some more modern philosophersÂ’ takes on similar topics: various aspects of philosophy of mind (identity, etc.), free will, and some moral philosophy. In the papers we basically had to show that we understood well the topics which we read and were lectured on, and that we knew how to make a philosophical argumentÂ—if you could do this, you were fine.\nI went to her office hours once to meet with her, and waited for about a half an hour as one student spoke with her; however since I wouldnÂ’t have been able to stay long enough to have my questions answered because I had to be elsewhere, she very kindly scheduled time to meet with me the next day. In speaking with me for quite a while then, she helped me to understand completely the topics on which I was a bit confused, and showed me that she really knows her stuff (well, I think this should be a given), as well as that sheÂ’s actually dedicated to teachingÂ—she was really willing to help me understand anything I did not already. And she did it completely on her own time, too.\nAll said and done, I would certainly take another course from Rovane.\nWorkload:\nfor 75% of classes, youÂ’ll have a reading of 45 minutes to 3 hours (if you're a slow reader like me) assigned, and throughout the semester four papers she calls Â“short.Â” Mine ranged between 5 and 11 pages. No midterm or final.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "November 21, 2005",
            "review_content": "\nmy feelings on rovane are slightly mixed. she knows how to lecture--there are no problems understanding her speech, and her lectures are fairly organized. she does get pelted with dumb questions, which, if she's in the mood, she will entertain ad nauseaum. \nthe assignened readings are mostly very good--sometimes dry, but almost always right on mark with relevant content. they are of course only partially necessary. her answers to emails stink--very brusk and rudeish, dont let them intimidate you. oh and another thing--she is apt to shut you down if you ask a question that a)irritates her, b)goes against her beliefs, c)doesnt allow her to show off, d)she hasnt prepackaged an answer to etc etc etc. it can be embarassing because she has the gift of being able to effortlessly make you feel/look dumb. all that said, i might take another class with her if the other options were sparse or shoddy\nWorkload:\n4 'short' papers, she alternates grading with TA (mine was a self-righteous twit) and she is meagerly fair about grades. the papers are not really 'short'. they take forever, especially if you didnt read in advance, and the essay topics are fairly advanced for a 1000 level course\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 11, 2002",
            "review_content": "\n I think the previous review is overly harsh. It should be said that Professor Rovane is a nice person who actually cares that students are people, and she's also a really intelligent philosopher who's passionate about her work. That said, she is pretty self-absorbed in her teaching. Despite her constant pleas for participation (which I think are genuine), she runs the class like a lecture and rarely breaks long enough for student comments. Her lectures can be interesting, but she has a tendency to repeat herself so that by the end of the semester you may feel like you're hearing the same lecture over and over again. Her big things are people's moral responsibility for their actions and the stupidity of believing in God, and while those are interesting to hear about the first few times, it definitely gets old, especially since there's very little conversation between her and the class. She's sure she's right, and while she's smart enough that she may actually be right most of the time, the whole \"no, that's wrong, I'm still right\" approach doesn't do much for encouraging discussion. This section isn't bad, but if you want a section that you're really going to get a lot out of, I'd recommend another. \nWorkload:\nI think it would be hard to find a section involving less work. I did the readings for a while, but it actually made class more difficult because I had questions I didn't get to ask. Her midterms and finals do basically ask you to spit back what she said, so if you were awake in class you can get an A without having opened a book. She gives two papers, which are graded on the generous side of fair. There are probably many sections you'll get more out of, but very few that you could put less into and still come out with a decent understanding of the material and a good grade. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 09, 2002",
            "review_content": "\nA year with this woman was definitely a year too much. CC looked boring enough to begin with, but never fear Carol Rovane is here! Here to butcher the texts beyond belief with her whacked out notions and bizarre philosophies. She doesnt so much teach as indoctrinate, passing judgement gleefully on each author...\"Aquinas was not a top notch thinker...Machievelli? i couldnt fill a whole class on him...Psychoanalysis is rather silly\". Class was entertaining at times, what with her stories about her daughter and husband and various  her friends. But be warned. \nIndependent thought need not apply. Think as she thinks and you're set for life...or at least the rest of the semester\nWorkload:\n2 papers semester, dumb midterm and stupid final. Midterm and final puking back at her what she puked at you in lecture. \n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "February 02, 2002",
            "review_content": "\nProf. Rovane assigned one and only one book for her seminar: her own book on Personal Identity. Although I liked her very much from the beginning, I quickly became very frustrated in the class. Working with just one book was stifling, especially as Rovane brooked absolutely no dissent. If you disagreed, you were wrong, and if she had to yell and refuse to listen in order to show that you were wrong, well...that's what she would do. More than a few of my fellow students had problems with her book, but we learned not to voice our objections in class. That was a bit of a problem, as there was not much to say in class other than to summarize the book. I was amazed that Rovane managed to structure the entire course so that she had to do no more work than to show up for class and read papers at the end. We spent most of the time listening to her go on for hours about child psychology. Any substantive issues that students raised in class were most surely not treated with any degree of seriousness, and most often they were just ignored or passed over. If she teaches this class again, and you're in it, my advice is to detach yourself from the class discussion, do a lot of outside reading on personal identity, write a paper that interestes YOU, and try not to get too frustrated with the direction of the class. \nWorkload:\nReading: one book. Class presentation. Final paper. \n"
        }
    ]
}