{
    "prof_info": [
        {
            "prof_name": "Christopher Washburne",
            "prof_id": 395,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "Popular Musics of the Caribbean: Salsa, Soca, and Reggae",
            "review_date": "January 13, 2014",
            "review_content": "\nProfessor Washburne is probably the coolest person on the planet. He previously played trombone with a lot of the salsa greats in NYC and on South American tours. He's now head of the jazz studies department, and he still plays with different salsa groups, other Columbia profs, and his own band, S.Y.O.T.O.S. (See You on the Other Side). Be thankful if you are lucky enough to take this class from him. The course is fun and the material is engaging. Whatever you do, don't come to class and sit on Facebook or watch Youtube videos. Listen to what the man is saying. His stories are intense and personal, and what's more is his passion for relaying his interests and experiences to his students. It helps to have an appreciation for Caribbean musics, I admit I probably wouldn't listen to every genre explored in this class recreationally. But the point is that to understand modern hip-hop, reggaeton, and reggae, you need to have the background of the earlier colonial music styles. Each lecture consists of the hypnotic voice of Washburne, paired with musical examples from each genre explored. The course covers musics of Puerto Rico, Cuba, the Dominican Republic, Haiti, Jamaica, and Trinidad and Tobago. \nWorkload:\nThe workload is pretty light. There are typically readings for each class, drawing from Washburne's book and Caribbean Currents by Peter Manuel. Along with other studies by leading ethnomusicologists, there can often be around 50 pages of reading for each class. You should do all of the readings to get the most out of the course, but relatively few quiz questions are on the readings, and you can get by with skimming most of them. You also have 3 different concert reports, which are supposed to be on concerts from different Caribbean musical genres. However, because 90% of the live Caribbean music in the city is salsa, he will generally allow you to see more than one salsa group perform. The concert reports are graded by TAs. In the reports, you are supposed to include the names of the songs, explain what characteristics of the band's playing define the music as whatever kind of music it is (for example, a salsa band having timbales and a trumpet section, or playing songs that have extended montunos), and comment on your personal experience (atmosphere, food, interactions with band members). Aside from the concert reports, there are 2 quizzes. When I took this course, the first quiz ended up not counting because there was a grading discrepancy that gave a disproportionate amount of people low grades. Anyway, the 2nd quiz was entirely multiple choice and featured around 12 listening questions and 38 non-listening questions. It was straightforward if you paid attention in class and reviewed your notes for an hour or two the night before the quiz. The final project is a 10 page paper you collaborate on in groups of 4 on a subject of your choice related to Caribbean music. It's due on the last day of class. The TAs are helpful if you have any questions related to the final project. If you do all the readings, take good notes, and listen to the musical examples online before quizzes, an A is easily achievable.\nWorkload breakdown:\n-weekly readings (can be very long) \n-3 concert reports (40% of grade)\n-2 quizzes (20% of grade) (10% for each quiz) \n-final project (40% of grade) \n"
        },
        {
            "course_name": "Popular Musics of the Caribbean: Salsa, Soca, and Reggae",
            "review_date": "November 16, 2013",
            "review_content": "\nMore than 350 people were already registered for this class when I was picking my fall classes; of course it seemed like a bad choice! \"What can I learn when there are this many people in a classroom?\", I thought to myself. But I went with it at my adviser's recommendation and because it was the only one that fit my schedule.\nHoly shit, what a class.\nChristopher Washburne is a hell of an entertaining instructor. When he starts telling his stories all 350 students are dead-silent; and this is probably the most important part of being an lecturer. If you can't be entertaining, you simply won't get your message across. Prof. Washburne knows how to get his message across. He's extremely passionate about Caribbean music and Salsa in particular, and this makes for delightful lectures.\nThe class follows a format that approximately covers one caribbean country a week. Cuba, Puerto Rico and Jamaica are the big ones and might take longer to go through, but there are many others too. You not only learn about the music per se but all aspects that revolve around it: social, political, economical, etc. Essentially, this allows you to appreciate not only *how* the music sounds but *why* it sounds the way it does.\nWith 3/4 of the semester in, I can honestly say that this is one of my favorite classes ever. Even if you, like me, aren't interested in Caribbean music at all, I highly recommend you take it.\nWorkload:\n2 easy quizes.\n3 concert reports (3 pages each).\n1 short reading a week.\n1 final group project.\n"
        },
        {
            "course_name": "Jazz",
            "review_date": "January 10, 2012",
            "review_content": "\nWashburne is one of the best professors that I have had while in college. He is excited about the material that he is teaching and it clearly shows during his lectures.The class lectures are extremely diverse and he covers many different musicians from the earliest origins in blues and ragtime to modern day jazz musicians. He is extremely accessible during class and tries to learn all of his students' names. Additionally, he is very lax in terms of grading and gives plenty of extra credit opportunities! I highly recommend taking this class music major or not. He makes the class easily understandable to those who do not have musical background.\nWorkload:\nMidterm, Final (this semester it was take-home) and 3 concert reviews + tons of extra credit opportunities\n"
        },
        {
            "course_name": "Jazz",
            "review_date": "December 21, 2011",
            "review_content": "\nProfessor Washburne is the man. Such a cool dude. Least stressful class I've taken so far. So relaxing to listen to music for homework. If you are interested in Jazz at all, take it. Professor Washburne has very interesting stories about his life as a professional musician and his travels and also teaches the standard jazz narrative well. Very doable for nonmusicians. Copious amounts of extra credit. If you do the extra credit and make an effort on the concert reports, it's an easy A.\nWorkload:\n3 three-page concert reports, a midterm and a final (final was take home for our class, 3 three-page essays).\nWeekly required readings (only needed to reference on essays in midterm and final) and required listening selections.\nVery light. Low stress class.\n"
        },
        {
            "course_name": "V2016 Jazz",
            "review_date": "January 04, 2009",
            "review_content": "\nBe warned that Washburne has a pretty big ego and likes to go off on tangents and  talk about his encounters with famous people...a lot. That said, this is a good class, and Washburne is a very good lecturer (although theatrical at times). With Washburne you get the additional benefit of the perspective of a working jazz musician. I came out of the class knowing a lot more than I did going in, and who can complain about listening to great jazz for homework? The readings are very interesting as well, though not entirely necessary. Exams weren't too brutal, but because of the size of the class grading is firm. If you're a musician (especially a jazz musician), this class is an absolute breeze - unless you take Washburne up on his offer of doing a final project instead of the three concert reports the rest of the class has to do (you still have to go to the concerts, but only need to hand in one page). Stick with the concert reports.  \nWorkload:\nThree concert reports, midterm, final. Reading and listening, which will definitely help you out.\n"
        },
        {
            "course_name": "Jazz",
            "review_date": "July 24, 2005",
            "review_content": "\nFar be it from me to disparage this man.  He's an exciting lecturer, who cares deeply about the music.  Being in a class with him is a joy, as he is a showman when it comes to lecturing.  He is able to present the information, but he has fun with it as everyone in the class does too.\nAll the previous reviews say this.  I feel it's true, so moving on...\nThe warning I will give is this: the man does not care at all about the students.  He really does not care about you at all.  If you go to his office hours, he will answer emails while you are talking to him.  In person, he is as cold as he is warm in his lectures.  Not mean, not nasty.  Just cold.\nDoes this mean he's a bad person, or that you should not take his classes?  ABSOLUTELY NOT.  The classes remain some of the best classes at Columbia.  However, I just need to add this little warning for anyone going into class, that there is a distinction to be made between him in class and him in person.\nWorkload:\nEasy tests, just show up to class and do the listenings\n"
        },
        {
            "course_name": "Intro to Jazz",
            "review_date": "June 06, 2005",
            "review_content": "\nby far the best class I have taken!! I am NOT a music major and I really enjoyed this class. Washburne is an engaging professor and really inspiring. Class is great- he always has interesting stories to tell about celebrities and jazz musicians. Studying for the midterm and final takes longer than you expect but its not hard and its fair. He practically tells you the essay questions beforehand. Also, if you dont know any music, like i didnt, study in advance- listen to the music a few days before the midterm/final to get acclimated. TAKE THIS CLASS TAKE THIS CLASS TAKE THIS CLASS- best to take it with friend because studying will be easier and going to jazz performances will be more fun. \nWorkload:\nmidterm, final and three concert reports ( no more than 3 pgs!)- the jazz reports depend on your TA- so after your first report speak to your TA to see where you can improve they love that!! he wants everyone to do well- so if you think you lost points go to Professor Washburne and talk to him and he will prob give you points back- SHOW THEM YOU CARE!!! \n"
        },
        {
            "course_name": "Jazz",
            "review_date": "May 22, 2005",
            "review_content": "\nI don't hate Washburne, but feel that all these raves are a bit misleading.  I took the class because it sounded interesting.  It had its moments, but I found that if you don't have a deep passion for jazz, you might find  yourself annoyed with Washburne's somewhat arrogant enthusiasm.  He's  one of those professors that has developed a cult following, which, if you're not part of it, gets to you after a while.  If you like the guy, I guess, you can get past his habit of repeating everything about 4 times and the way he self promotes his band in class.  I ended up sneaking out of lectures half the time, and paying for it on the exams.  Others seemed to have a better experience than I did, but I'd recommend sitting in a few lectures before registering, because he's not for everyone.  \n"
        },
        {
            "course_name": "Jazz",
            "review_date": "May 14, 2005",
            "review_content": "\nIf you want to remember your academic experience fondly, then all you need to do is take a class with Professor Washburne. He is the kind of teacher who normally exists only in fantasy. He is brilliant, sweet, hilarious, passionate, and, maybe best of all, extremely interested in his students. Whether you are a jazz fanatic or novice, you will leave his class with both a strong interest in and understanding of the music.  \nWorkload:\n3 concert reports (which are a pleasure to prepare for and write about!), a midterm, and a final\n"
        },
        {
            "course_name": "Jazz",
            "review_date": "May 18, 2004",
            "review_content": "\nI was expecting this course to be a purely musicological course on jazz but I was very happy to learn some social history as well.  As everyone else has said, Washburne is really funny and thorough at the same time.  He brings in a variety of different perspectives on jazz and is very responsive to students' input (remarkable in a lecture of 200 people!)  You get to listen to examples of what he's talking about in class, and he stops the music frequently to explain the importance of what you just heard.  You do not need a musical background to do well in this class, and you certainly don't need to be a music major, although it helps to have taken Music Hum.  I would recommend this class highly.\nWorkload:\nEasy!  3 concert reports, but who doesn't like going to jazz concerts?  And easy midterm and final.  There are assigned readings and listening examples, but I didn't do a single one of them and I still did fine.\n"
        },
        {
            "course_name": "Popular Musics of the Caribbean: Salsa, Soca, and Reggae",
            "review_date": "May 14, 2004",
            "review_content": "\nI would encourage anyone to take this class. I loved it. I would list it as one of my top five best classes at the university; as a major, it was definitely the best one in the music department. Yes, it is an elective, and non-majors can take it, so it doesn't cater to hardcore music theorists or historical musicologists. However, the music is fun and fabulous, and Washburne delivers interesting and funny lectures. Furthermore, the most important thing I took away from this class was a newfound appreciation for Caribbean cultures. I even learned to salsa dance!\nWorkload:\nThree one-page concert reports, one 5-6 page field study, midterm, and final. The tests are actually kind of fun to prepare for, because all you really have to do is sit there and listen to the music, which is great. Washburne's a very fair grader.\n"
        },
        {
            "course_name": "Jazz",
            "review_date": "May 11, 2004",
            "review_content": "\nThus far, the best class I have taken at Columbia/Barnard. Everyone should take this class. Prof Washburne is funny, laid back, sincere, an extremely talented, rare professor. I think what I liked most about him was how sincere he was to us, and how much he loved the material. The class was 150+, but he made it feel like we were just all hanging out. His lecture style was never aloof or boring, but as though he was sharing what he loved with a few friends. He is an extremely talented musician, as well (has his own band, used to play for Tito Puente). Even if you don't like music, or jazz (or don't think you do), take it anyway. \nWorkload:\nFair and fun: readings are interesting, 1 midterm and final, very fair, and 3 concert reports in which you have to go out and see a jazz concert and report on it using what we learn in class.\n"
        },
        {
            "course_name": "Popular Musics of the Caribbean",
            "review_date": "January 09, 2004",
            "review_content": "\nWashburne is highly overrated.  While it's amusing to have a professor throw \"cool\" words into his lectures, his simplisitic understanding of the history of the Caribbean is painful.  Washburne makes highly generalized statements without any accurate historical information to back them up.  Granted, he is passionate about music (go hear him at Smoke- he's wonderful)  but passion can only keep a student interested for so long.  Unlike other classes at Columbia, which sometimes have an overly academic feel to them, there is no scholarly element to this class at all. I learned close to nothing and was also bored. Washburne should keep his evening job as a musician.\nWorkload:\nPretty easy. 3 simple concert reports (the most difficult part is actually finding concerts to go to), a midterm, a final, and final group project.\n"
        },
        {
            "course_name": "Jazz",
            "review_date": "April 26, 2003",
            "review_content": "\nWashburne is an engaging and entertaining lecturer.  If you know nothing about jazz, this class will introduce and educate you about its history, its major figures, and its evolution.  If you know something about jazz, this class will be an enormously easy 'A' and you will learn things here and there that you didn't know.  The listening material is fantastic and the grading is done by competent and intelligent TAs.  I highly recommend this course.\nWorkload:\nNot bad at all.  Three 3-page concert reports, each of a different style of jazz.  Midterm, Final.  \n"
        },
        {
            "course_name": "Jazz",
            "review_date": "April 22, 2003",
            "review_content": "\nNot like he needs any more praise, and naturally anything described as great is bound to build expectations and disappoint, I nevertheless feel the need to shower praise where it's due.\nThis course is amazing.  I have been heartbreakingly disappointed with nearly every one of my classes at Columbia over the past 3 years, even to the point where I left school.  This class makes me glad I came back.  The professor is engaging and passionate and provocative and the subject matter is really genuinely interesting.  But I can still imagine a professor making jazz boring.  Prof. Washburne excites students about jazz and music in general, and even incorporates larger issues such as art/music's role in society, racism, social/political context, and gender issues beautifully.  He is truly a fabulous professor.  Not to mention the TA's, who are accessible, funny, informative, and fair.  This course is wholly fulfilling - the subject matter, the professor/TA's, the books, the concerts, everything.  Kids aren't skipping his late-afternoon springtime classes - doesn't that say something?  Can Columbia please hire profs based on their teaching ability as *well* as their accomplishments outside of the classroom?  Instead of just the latter?  Prof. Washburne does both; he is a figure in the jazz scene in the city as well.  He is truly a great asset to Columbia.  Don't miss this class!\nWorkload:\n3 concert reports (3 pgs each - easy)\nmoderately difficult midterm and final\nnot an easy A, but certainly an attainable one.  Pay attention to details in class as exams are almost entirely lecture-based.  May not go in depth enough for music majors or those with a decent music theory background, but take it for the social context he places the music in anyway.  \n"
        },
        {
            "course_name": "Music in the United States",
            "review_date": "January 13, 2003",
            "review_content": "\nPhenomenal teacher!!!! Extraordinary. His enthusiasm and the great music make it worthwhile 9am class. I strongly recommend this class to anyone, irregardless of your interest in music. He really is a Columbia gem. Attending lecture is a must, since exams are based on material taught in class (but if you pay attention then the exams are easy). Theres no need to do the reading except that the book is very clear and fun to read-I ended up doing all the readings on the syllabus. \nWorkload:\nmidterm, final and paper. lot of leeway on paper topic.\n"
        },
        {
            "course_name": "Jazz",
            "review_date": "November 25, 2002",
            "review_content": "\nThis review is intended for advanced music majors, so I don't mean to offend everyone else who loves Washburne. He is one of the most popular professors at Columbia, and he has a sort of cult following among music majors who don't know much about jazz but do realize that it's some of the best music out there. And he's okay as far as teaching a basic introductory survey of jazz to people who know nothing about it. But for someone who already knows a lot about music, his classes (I've taken several) are very elementary. If you've even heard of Eric Dolphy, then V2016 will be WAY too easy for you and you'll get frustrated with Washburne's factual errors. If you're a music major who just wants an easy A, then this is fine if you can sit through it.\nWorkload:\nVery manageable even for a non-music major. Ridiculously easy for anyone who's taken a music history and is used to writing concert reports. But if you do take the class, you need to show up; his tests are based entirely on lecture and you need to get used to his agenda in order to do well.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 08, 2002",
            "review_content": "\nAll of the other reviews seem extremely exaggerated. Washburne is good in that he is a fairly enthusiastic lecturer. Also, he knows a fair amount about music itself; he was good at explaining basic musical concepts. However, there were several downsides to his class. He presented a simplistic view of history; he often just repeated truisms to explain historical periods. He told several stories, that while amusing, simply weren't true. For instance, his description of how Berlioz came to compose the Symphony Fantastique was just totally wrong. What's more, the correct version is in the textbook. Another example is he presented a theory of the origins of Beethoven's deafness as fact; nobody is actually sure why Beethoven went deaf. This led me to wonder whether other implausible sounding stories he told both about his personal experience and about the lives of composers were also untrue. Also, he really didn't challenge the class very much, it could have been taught at a much higher level. While I did learn a fair amount about music, I felt like I could have learned a lot more. Far too often, Washburne seemed willing to simplify things rather than deal with a more complex, but more accurate version of reality. On the whole, a decent, but not terrific professor.\nWorkload:\nMidterm, take home final, three concert reports. All very easy.\n"
        },
        {
            "course_name": "Jazz",
            "review_date": "May 02, 2002",
            "review_content": "\nIf you don't take this class before you graduate they should strip away your ivy. Washburne is unbelievable. His lecturing is so engaging that i would often find myself checking the time and wishing i had double period washburne. Additionally, the music that we listened to was amazing (some might say orgasmic). I never loved jazz before this class, but I am now addictted to the genre (i just bought 5 jazz CDs and can't tear myself away from the jazz pieces that are posted for the class). You will leave this course with a comprehensive understanding of the musical and cultural progression of jazz from its inception through today. TAKE THIS CLASS!! TAKE THIS CLASS!! TAKE THIS CLASS!! a funny and passionate teacher, great material, a ticket to explore the city and its music scene-this class has got it all. Put it this way, everyone that I spoke to was neary depressed when the last class ended. If you can't fit it into your schedule then stay another semester.\nWorkload:\nnot bad at all, 3 concert reports a midterm and a final. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 21, 2002",
            "review_content": "\nProfessor Washburne is one of the best professors I've ever had at Columbia. He's humorous, approachable, and interesting. He's obviously knowledgeable, and I learned more in that class than I have in most classes at Columbia. His lectures are interesting and informative--when he lectures, he tells a story; I never fall asleep in that class. I know much more than just music history; I know now the personal lives of the musicians, the politics behind the music, and so on. He's an excellent teacher.\nWorkload:\nDecent.\n"
        },
        {
            "course_name": "V2020 Salsa, Soca, Reggae: Popular Music of the Caribbean",
            "review_date": "December 13, 2001",
            "review_content": "\nThis guy is probably one of the better professors that you'll ever have. His knowledge and background with the music that is studied (He's played with Tito Puente, Mark Anthony, Whitney Houston, etc etc), is extensive and his feel for the music is great. Although the course is lecture based and can be a little boring at times, his humor and stories about his experiences lighten things up. Of course, you get to listen to music of the Caribbean styles, and get to see how they influence the music we all listen to today. He really wants you to learn and appreciate the music rather than just cram for tests and go to concerts just for the assignment.\nWorkload:\nWorkload for this semester was substantially lower than the previous courses he has taught: lecture and listening based midterm, 3 concert reports, 7 page research paper (could overlap with 1 concert report), and a 6 page take home final. A nice change from the regular CC or SEAS curriculum.\n"
        },
        {
            "course_name": "V2016 Jazz",
            "review_date": "August 13, 2001",
            "review_content": "\nCoolest professor at Columbia. Maybe even in the Ivy League. Maybe even in the world. Jazz was a really fun class and Latin music's his specialty, so take both jazz and salsa, socca and reggae with him. You will not regret it. However, a lot of people take the class because they see it as an effortless A. But you need to go to class, because (as every other reviewer has said), the tests are entirely based on lectures. Don't even bother to buy the textbooks.\nWorkload:\nThree concert reports, midterm and final. Fairly lenient grader.\n"
        },
        {
            "course_name": "V2016 Jazz",
            "review_date": "August 06, 2001",
            "review_content": "\nI would take organic chemistry if Professor Washburne were teaching it. The class is a lot of fun and you learn a lot. He makes you understand jazz both from a musical perspective and from a historical and sociological point of view. Textbooks are completely useless-- his lectures make up the midterm and final. Know the stuff and you'll get an A. But let me reiterate: Washburne is FANTASTIC. Take anything he offers.\nWorkload:\nThree short concert reports, midterm, final. Not a tough grader, but you really need to know the music.\n"
        },
        {
            "course_name": "V2016 Jazz",
            "review_date": "May 10, 2001",
            "review_content": "\nWOW. The greatest professor I've ever had...knows everything there is to know about jazz, has fascinating stories from years in the business, hilarious, brilliant, passionate, engaging, etc., etc., etc. Take this class now. Take any class this man offers. (And he's a hell of a trombonist to boot!)\nWorkload:\n3 concert reports (3 pp. each), midterm and final (very reasonable if you've gone to class, impossible if you haven't).\n"
        },
        {
            "course_name": "V2016 Jazz",
            "review_date": "April 28, 2001",
            "review_content": "\nIf there is one professor who you have to take a class with, it's Professor Washburne. His involvement in the jazz music world brings a level of enjoyment that can't be matched. He loves what he does, and he loves what he teaches... and he makes you love it, too. Make sure you go to class, though... the textbooks are close to worthless, as the midterm and final are based entirely on lecture material.\nWorkload:\n3 5-page concert reports, midterm, final (lecture based)\n"
        },
        {
            "course_name": "V2020 Salsa, Soca, Reggae: Popular Music of the Caribbean",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Washburne is an amazing professor (and i have the biggest crush on him). He has such a wealth of knowledge in his field (specifically, jazz and salsa) and so he brings a lot to the class. Students enjoy his candid, yet cynical, personality and his sense of humor. The work takes time, but you really get out of it everything you put in. This class is appropriate even if you are not a music major (i'm not) but Music Hum is a prereq. There isn't any regular homework, but I would recommend attending class often (tests are based a lot on lectures).\nWorkload:\n3 one page concert reports, one 3 page book report, and a 7 page fieldwork project midterm and final are just like Music Hum tests, but with caribbean music(listening comp and short answer).\n"
        },
        {
            "course_name": "V2020 Salsa, Soca, Reggae: Popular Music of the Caribbean",
            "review_date": "December 31, 1999",
            "review_content": "\nWashburne is a fun professor despite his cynicism. The tests are mostly lecture based, meaning you need to go to class if you want a decent grade. This is not a problem when covering 20th c. Cuban and Puerto Rican music, or the various other aspects of Caribbean music which Washburne happens to really enjoy and be personally involved in (he's a performing musician). He'll spice it up with stories from his extensive experience working with the movers and shakers in the modern Latin music scene. At other times, however, he lectures straight from the textbook, and it can be painful. The workload is fairly substantial, at least for an intro level course.\nWorkload:\n3 required concert attendances (after which a 1 pg report is due), one 3-5 pg book report, 1 longer research paper, midterm and final.\n"
        }
    ]
}