{
    "prof_info": [
        {
            "prof_name": "Padma Desai",
            "prof_id": 383,
            "total_reviews": 30
        }
    ],
    "reviews": [
        {
            "course_name": "Transition Issues in East-Central Europe, Post-Soviet States, and Reforming Asian Economies",
            "review_date": "January 04, 2014",
            "review_content": "\nI dont understand the bad reviews. Padma is a very nice lady, always willing to explain anything and absolutely helpful. This class is very interesting, this is not the typical Econ class at Columbia, this class is based on historical facts and no math needed. You will have the opportunity to learn major financial crisis like Russia 98 - which is the reason LTCM failed if any of you know what this is. You will also be covering the breakup of the USSR and the main reasons for it - she actually lived in the USSR for a while. Another great topic we covered was East Asian financial crisis, Brazil and Argentina which has the title for the largest sovereign default on its debt in 2001 aprox 95bn. \nIf you want to work in Wall Street or get an internship there, this is an absolutely interesting and helpful class, I remember talking about this class during my internship at a major BB bank. \nWorkload:\nNo Homework\nOnly 1 Midterm and 1 Final, very easy as long as you understand the material. The midterm does not count if you do better on the final. The format are mini essay format. \nShe will assign some books she wrote, which are pretty good but you dont have to read them. \nAnd you will have to buy a pack full of WSJ articles - which was my favorite part of the class because you will be able to understand the WSJ next time you read it and interpret it. \n\n"
        },
        {
            "course_name": "Transition Issues in East-Central Europe, Post-Soviet States, and Reforming Asian Economies",
            "review_date": "May 11, 2012",
            "review_content": "\nI wouldn't recommend this class to anyone. Yes, the material is interesting but the way the class is structured and run is a complete joke. She gave us a midterm, gave us grades and then told us those grades were completely irrelevant toward the finals grade. Final grade = final exam grade, even though it wasn't cumulative and only covered the second half of the semester. Why bother going to class the first half, or even grade midterms? After class, I went to speak with her about the midterm grades and she assured me that they weren't completely irrelevant and was simply for students who didn't do well. Not true. I also thought that they would be 50/50 averaged, nope. Totally ridiculous logic on grading. Material wasn't difficult and I didn't do badly, just feel like a bait and switch was pulled and think it's unfair. \nIt's a joke and I'm humiliated on behalf of Columbia for a professor like this to be recognized here. No one is more disappointed than I am about it. I looked up to her writing and her experience. The class is run like an afterthought. Her lectures are a bit dull, but the material is interesting. Take a different professor, don't waste your money. It's not an easy A, so there's no point. \nWorkload:\nMedium, coursepack and some books to read. \n"
        },
        {
            "course_name": "Transition Issues in East-Central Europe, Post-Soviet States, and Reforming Asian Economies",
            "review_date": "May 05, 2011",
            "review_content": "\nThe professor's lectures were very disorganized. She would jump around from point to point and if you stopped listening for one second you would be lost. While it's evident she knows a lot, she does not know how to communicate this knowledge to students. DO NOT TAKE THIS CLASS. It's not worth it as you'll leave without learning much and somehow have to cram for exams which is hard to due when she expects memorization of everything she ever said and wrote.\nWorkload:\n1 midterm and 1 final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 02, 2011",
            "review_content": "\nThere was this one time I stayed awake for an entire lecture. That was also the one time I chugged 2 cups of coffee beforehand. Every other time, I dozed off within the first 20 minutes and never regained consciousness until class was over. I tried to tackle this problem by bringing my DS. Didn't work. Still fell asleep.\nThat, in a nutshell, is how exciting Desai's class was. Padma is a very brilliant economist. Her accomplishments speak for themselves, and I'd be a fool to question her knowledge. However, she's very dry and painfully by the book. She tries to remedy this by telling some 5 minute funny story every class. But at the end of the day, Principles of Economics is just a very, very boring class.\nThe saving grace of this course is that it's not very hard. The concepts themselves are pretty straightforward. The homeworks are a breeze, the midterm was a total joke, and the final, although harder than the midterm, was not a problem. I ended up getting an A just by keeping up with the reading. Speaking of the reading, we used Hubbard and O'Brien textbook, which I much prefer over Mankiw, which has a tendency to oversimplify many concepts.\nWorkload:\nExtremely light.\n3 homework sets for the entire semester. They were a joke.\n75 minute midterm. It was a joke.\n2 hour final. It was not a joke, but still manageable.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 24, 2010",
            "review_content": "\nWhere do I even begin?\nHow could a course that seemingly started off so well finish so disastrously for everyone involved?\nLet the data speak for itself. \nIn a class of 233 people, the mean score on the final exam was a 67/100. That is an  atrocious statistic. \nThe final exam for the course was an absolutely convoluted nightmare. It was by itself a hard test and it was obviously very harshly graded by the TAs.\nProfessor Desai even sounded disappointed in her valedictory e-mail to the class: \"The mean on the exam was much lower than for the midterm [which was 82/100]--approximately 67/100.\"\nThis course is not a \"Principles\" of Economics course. It is a \"Minutia\" of Economics course. You have to know thousands of definitions from the Hubbard/O'Brien textbook, and only four of them will appear on the exam. \nEconomics Professors, if you are reading this, let me offer some advice as to how you could improve this course.\n1) Do not assign as many chapters for the students to read. I could think of at least ten chapters that you could cut, and go into more detail into the fewer chapters that you assign.\n2) Completely re-work the teaching assistant sections. Obviously if the mean score on the final exam was a 67/100, these sections were worthless and did nothing.\n3) Don't use Hubbard/O'Brien as a textbook. It's far too detailed for an introductory economics course. Use Mankiw's \"Principles of Economics.\"\nBeware, beware, beware of this course. It is difficult. Very, very difficult. \n\nWorkload:\nRead Hubbard/O'Brien as much as you can.\nBriefly skim the Wall Street Journal, Economist, and Financial Times as often as possible in order to be literate in current economic debates.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 17, 2010",
            "review_content": "\nThis review is for Professor Desai's \"Principles of Economics.\" \nProfessor Desai is an extremely nice person with some interesting and funny stories, and obviously brilliant. Her class, however, tended to be pretty dry (with the exception of the stories) and her style of teaching is essentially copying examples from the textbook onto the chalkboard. She doesn't explain things any differently than the book does, so if you didn't understand it in the book you probably won't grasp it in class either. \nOverall she seems like a nice person and there's no question that she is incredibly smart and accomplished, but I'm not sure I would take the course again. \nWorkload:\n3 or 4 graded problem sets. At first we had in-class pop quizzes, but she stopped those after the first one. Midterm, final. Two or three chapters to read each week from the textbook. If you don't do the reading, you will be lost, so do the reading.\n"
        },
        {
            "course_name": "Transition Issues in East-Central Europe, Post-Soviet States, and Reforming Asian Economies",
            "review_date": "January 22, 2009",
            "review_content": "\nPlease stay away from this professor !!! I was so exited to take this class (Transition Economies) but already during the first two classes got a bad feeling about this professor. Why didn't I drop it?? Don't ask... The most boring class I've ever taken and the worse professor I've ever had!! Sorry... Most of the students did not bother to attend the lectures and showed up for the in-class mid-term and the final. After speaking to about 10 students I was reassured that I was not alone ... most of the students hated it!!!! \nWorkload:\nmidterm + final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 13, 2007",
            "review_content": "\nGood professor. The first half of the class (intro. to micro) was easy, while the second half (macro.) was more involved. Her pacing of the class throughout was pretty much perfect, though.\nHer presentation of the material was generally good - especially the fact that she writes everything down on the board rather than using powerpoint slides. \nThe only possible complaint is that she wasn't very approachable. I guess that's what TAs are for, but it would have been nice to be able to email her with questions and the like.\nWorkload:\n5 problem sets, ~4 pop quizes, midterm and final. No problems as long as you do the reading and the problem sets.\n"
        },
        {
            "course_name": "Seminar: Topics On Problems of Emerging Market Economies",
            "review_date": "September 04, 2005",
            "review_content": "\nI thought she was a great prof that was extremely approachable.  The class wasn't always that interesting because as it is \"Problems of Emerging Markets,\" she had to cover all the major events, and not all were that interesting.  But the paper that you had to write for the class was why the class was good.  It gave you an opportunity to research a topic that was fascinating to you and she was pretty lenient on what you could research on, so I liked the class.\nWorkload:\nNot bad at all, but I definitely wouldn't say this was a piece of cake\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "August 21, 2005",
            "review_content": "\nI took the Principles of Economics course with Professor Desai in Spring 2005. I did well in the course and attended all the lectures and read the specified readings. I figure most people didn't attend all the lectures, but I found it helpful to aid in a more complete understanding of the topics. The book by Mankiw I thought was really well written. Mankiw gives many examples, and those can be quite helpful for visual learners.\nI think that some of the older reviews of this class say that it is an easy A. Perhaps Desai read those reviews and tightened up her class, because we weren't getting great grades at the beginning. But I think enough of us whined hard enough to get her to lighten up and take it easier on us, which I think she did.\nIn the end I think this class is like many others. If you enjoy economics and put the time in, you should get a good grade easily. But if you naturally don't get it and/or are not interested, you may find yourself skipping classes and not getting a good grade. If you read the book alone, you may not be focusing on the key points highlighted in the course.\nWorkload:\nWeekly assignment. Midterm and final -- the final is not cumulative. The first half of the semester was focused on macroeconomics, and the second half on microeconomics.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 16, 2005",
            "review_content": "\nLectures were boring, and basically everything was in the book, verbatim. Sometimes she would attempt to involve participation, which would end up being some kind of degrading arithmetic question or the like... you can just read the textbook and save yourself some time. She doesn't post grades online, which was annoying for the less frequent attendees. The exams were not very difficult, and the grading is fair.\nWorkload:\n8 weekly problem sets (not very long, 10%), midterm (45%), and final (only 1 hour! not cumulative, 45%)\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "June 13, 2004",
            "review_content": "\nProfessor Desai is a very good professor.  She covers all the basic economics material in a very methodical manner, making it quite easy to understand.  Furthermore, she always sticks to the syllabus, and goes out of her way to provide extra problems for students to practice on.   The biggest complaint that I have were that her lectures could be boring.   So long as you attend every class and recitation section, do all the reading and problems, Professor Desai's class is great for those who wish to/must take Principles of Economics.\nWorkload:\n8 Problem Sets (Graded on a check/check plus/check minus scale), a midterm, a final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 27, 2004",
            "review_content": "\nThis course gives a very basic introduction to economics, which makes it pretty easy for anyone with a solid grasp of the way the marketplace functions in the first place. If you understand Paul Krugman's column in the Times, or ever find yourself watching CNBC and knowing what they're talking about, you'll have no trouble with this course. If you don't understand why it's not a good idea to carry balances on your credit card, you'll have trouble with this course.\nThe problem is that Desai teaches down to the level of the people who have no hope of understanding the material. She teaches almost straight from the book, even using exactly the same examples contained in the book. She then spends about every third lecture doing an in-class problem set, more or less identical in form to the homework problem sets, which felt like a bit of a waste, since that's what the recitations should be for. Instead, the recitations were a total waste, with the TAs spending all of their time helping out the people who had no hope of understanding the material.\nTo give an idea of how ill-suited some of the students were for the course, high school algebra is required. During the final exam, after complaints that people didn't know how to handle the math, the head TA gave a quick lesson in how to divide one simple fraction by another. That Columbia students taking a course that requires high school math were upset at having to do elementary school level math is amazing. The course was set up to cater to those people, who by all rights should have chosen a different course.\nBecause the curve has to take the hopeless people into account, someone who understands the basic concepts can get a B without any effort, and without necessarily doing the homework. A higher grade isn't difficult with work. If you don't remember how to graph a simple line, don't bother with this course.\nWorkload:\n8 problem sets 10%, midterm & final 45% each. The first 5 problem sets took under 30 minutes each, and the final only includes material from after the midterm.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 08, 2004",
            "review_content": "\nI took this class because I thought it would be interesting and helpful. It's not. It's the biggest waste of time you can imagine -- lectures are messy and useless, problem sets aren't applicable to anything you've been taught, and you'll have to teach yourself everything. A waste of time effort and you sanity. Desai manages to suck the learnability and clarity out of everything you have to know. \nWorkload:\nA problem set a week, and a midterm and final that are curved. Not a lot until you realize the week before your test that you've learned nothing...\n"
        },
        {
            "course_name": "Seminar: Topics On Problems of Emerging Market Economies",
            "review_date": "April 29, 2004",
            "review_content": "\nThe class is pretty straight forward - the first half is based on the two books that are assigned for the class and are lecture/discussions. The second half is presentations of papers by all students. Although the second half can be at times boring, it's a pretty light course for a seminar.  Prof. Desai is very approachable and willing to help you on the paper. \nWorkload:\nMidterm & final paper. Fair grader.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 25, 2003",
            "review_content": "\n[culpa censor].....Padma is a decent teacher, even funny at times I think. She lectures well and does not give too much work. There's really nothing radically different about her, so I feel unable to review her further. The material itself is so general and easy that you can really learn from the book. Not to mention that basic economics is very often commonsensical ideas expressed in graphs (and sometimes formulae). The class provides you with a technical perspective on and a precise vocabulary to talk about very obvious things, and to a lesser extent the ability to identify ridiculous statements on newspapers. But if you're not really interested in pursuing economics further, it's rather pointless.\nWorkload:\nAverage\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 24, 2003",
            "review_content": "\nSo Padma doesn't teach the most complicated version of economics out there.  Prof. Desai is great for an overview and general understanding of this class.  She goes through the material slow and deliberately although sometimes she may jump around in theb book, but what professor doesn't?  Even if you struggle with this class she curves the class extremely high to make up for it.\nWorkload:\nEasy problem sets biweekly, 1 midterm\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 22, 2003",
            "review_content": "\nI went into this class believing she would be a good professor based on CULPA reviews. And admittedly, she was, for maybe 2 classes. She is quite frankly a really boring lecturer and is really disorganized. Her goal is to teach macro and micro but there is absolutely no coherent order in what she lectures on or what she writes on the board. Tests aren't especially hard, might as well stay home and read the book (lectures and examples are exactly the same).\nWorkload:\nWeekly problem set (easy), midterm and final. neither which are especially hard.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 17, 2003",
            "review_content": "\nYou can ignore the review from April by the writer who thinks that a good text makes for a good professor.  I should note that when she needed to cover remedial calculus about the slope of a line, it was SEAS students who left class early and the CC kids who had to stay.\nProfessor Desai is as old as the hills, having started teaching in 1957! (you do the math)  She has a slightly tangential lecture style, trying to spice things up with an occasional story or two, but although she has a sense of humor the class comes across as fairly dry.  She tests on material barely mentioned in the book but emphasized in class, so unless you took the Econ AP exams, forcing yourself to go to class really pays off.\nIn person she has the usual entitlement expected of a University professor.  It was nearly impossible to get some of her time to answer questions in the week before the midterm, and once I had finished asking her questions there was no handshake or \"goodbye\" or addendum, she just got up, went back to her desk, and got back on the computer while I packed my things up and left her office.  Don't expect much help from her - as the other reviewers have said, find a good TA.\nWorkload:\n8 problem sets, somewhat weekly (Easy).  Midterm was challenging, final less so.  Do the practice exams, some questions are repeated.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 11, 2003",
            "review_content": "\nClasses are boaring as hell so don't even bother going.  The textbook is the best textbook I've ever read, you can totally teach yourself during your free time.  My TA was pretty bad, and I don't think anyone ever went.  But if you want an easy A, take this class as long as you have the self-discipline to teach yourself the material.\nWorkload:\n8 problem sets, I midterm, I final\n(nothing was hard or unexpected, ALL STRAIGHT FROM THE BOOK!\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "April 30, 2003",
            "review_content": "\nIf you can avoid taking Principles with Padma, do.  Lectures are incredibly dry and lazily taught.  Desai doesn't answer questions of clarification and graphs are utterly confusing.  She'd rather go into more complex concepts and raise the curve than have you understand the \"intro\" concepts and do well on your own.  The amount of people who either don't attend lecture/ leave early out of disgust is incredible.  Wish I knew before hand what a waste of time this class is.  Language barrier is also an issue with Desai as well as TA's.\nWorkload:\nWeekly problem sets, midterm, final.\n"
        },
        {
            "course_name": "Transition Issues in East-Central Europe, Post-Soviet States, and Reforming Asian Economies",
            "review_date": "April 20, 2003",
            "review_content": "\nIn my opinion this class should be renamed: Russia according to Padma Desai. God forbid that woman to offer you someone else's perspective on the issues at hand. the thing is--she knows a lot about Russia and its politics/economy, but the way she presents it is slow, real slow, and often flat-out boring. If you already have some background in the region, AND have taken basic macroeconomics, choose some other class. \nWorkload:\nall you need is to read her course pack, learn it by heart, and copy it on the midterm and the final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "April 17, 2003",
            "review_content": "\nThis class is very easy (and this statement is coming from a \"sheepish SEAS student\" as one idiotic fellow classmate of mine has termed the engineering students). I'm glad you can assume my (and hundreds of others') motives for attending Columbia (though, making assumptions about motivation is far over my head and yours too, I suspect). In any event, if you're looking for an easy A, then take this class. The problem sets are incredibly easy, and the midterm is also simple (provided you go to class and take notes because she doesn't always agree with Gregory Mankiw). She has an amazing presence and a charming personality (you're just a horrible person if you don't come to her class). \nWorkload:\n8 simple problem sets (she throws in a trick or two), 1 midterm (simple), and 1 final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "March 31, 2003",
            "review_content": "\nYou can ignore all of the dopey complaints of various SEAS students regarding this class.  They're just upset because they weren't talented enough or are too sheepish for MIT. This class is exceptionally taught and has an excellent text to boot. If you need one,you may want to surf through the TA's untill you find one to your liking. \nWorkload:\n8 problem sets, one midterm,one final\n"
        },
        {
            "course_name": "Transition Issues in East-Central Europe, Post-Soviet States, and Reforming Asian Economies",
            "review_date": "July 14, 2002",
            "review_content": "\nThis class was one of the most interesting (and easy) econ classes I've taken at Columbia. Desai is good at using simple economic concepts to explain complex situations. She is also full of great stories about collosal decisions that led to foreign economic collapses. The reading is somewhat repetitive and explains only Desai's perspective, but on the whole, the course is a thrill to attend and is very little work. \nWorkload:\nLong term reading, midterm, final (both exams taken straight from lectures)\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 31, 2002",
            "review_content": "\nProf. Desai's Principles is insultingly easy. The class is taught under the assumption that CC students (\"who aren't very good in math\" as opposed to SEAS students) have to really review their simultaneous equations not to drastically fall behind. She is supposed to be brilliant in internaional politics, as some of her articles in the Financial Times reveal, but don't expect any of that to come across in this particular class. Students get a kick out of Padma, and she seems to be aware of it, digressing every so often to insert some personal story (as every favorite professor should do, right?). Take this class as a GPA padder and expect to be disappointed and bored if you've ever taken econ before and expect anything mildly challenging.\nWorkload:\nRidiculously minimal. A five-minute problem set a week, a midterm and a final. The text is rather well-written and entertaining to read\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 21, 2002",
            "review_content": "\nProfessor Desai was not bad at all. Occasionally she cracked jokes that were actually funny. Lectures were well organized and followed materials in the textbook. She also handed out in-class problem sets with answer keys for practice purpose. Students must register for recitation, but attendance wasn't required. I only went twice because the TA was terrible. He even disagreed with what the professor taught in class. Problem sets due every week. I don't know how the TAs grade them, because you either get a 2/2 or 1/2. Midterm and final have multi-choice, IDs, true/false, and normal word problems. Class is recommended.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 17, 2002",
            "review_content": "\nNot bad; not great either. The class was typically big (200+, five TAs), and her lectures weren't the most interesting. On the other hand, she seemed to have a good grasp of the material, and her lectures were well-organized. The textbook is also very clear and well-written. On the whole, if you are interested in econ, this isn't a bad way to start. One note: there is a weekly discussion section which all students must register for; I found it to be virtually useless, and there isn't an attendance requirement.\nWorkload:\nWeekly problem sets, midterm, final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 20, 2001",
            "review_content": "\nShe's a pretty good professor with some good stories to tell between the different parts of her lecture. She's a little bit weak on teaching the \"micro\" part of the course, though. The textbook is quite good. This having been an intro course, I'm glad to know that econ courses can only get better.\nWorkload:\nWeekly problems sets (graded. you get 0, 1 or 2). Midterm. Final.\n"
        },
        {
            "course_name": "Seminar: Topics On Problems of Emerging Market Economies",
            "review_date": "December 31, 1999",
            "review_content": "\nThough the class was a seminar, it was more like a lecture with 10 people (mostly sipa students). She is incredibly knowledgeable about international politics and has refreshing views on world trade (non-myopic, unlike most economists). We studied 14 countries' recent economic and political reforms in the last 15 years and the troubles they faced going from socialist/planned economies to capitalist/open economies. The last few weeks were spent doing individual presentations to the class describing our final research papers (ex. looking at Brazil's monetary policy) rather than her lectures. The reading was engaging and useful to prepare for the midterm.\nWorkload:\nessay midterm and final research paper\n"
        }
    ]
}