{
    "prof_info": [
        {
            "prof_name": "Rachel Kennedy-Smith",
            "prof_id": 13112,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "July 01, 2015",
            "review_content": "\nYou already know this lady is going to be the highlight of your FroSci life when on the first day, you see a happy woman with pink hair streaks. And then she assures your impressions by telling you all about her life and enthusiastically asking about yours. \nI love Dr. Smith. She made it an effort to make The Archive, which is like a free science bank that you and your seminar gets to share. Sure, it's extra work but it's really not that much. If you already love science, just tell the class about your research. If you are more on the humanities side, just pick anything you like that is remotely science-related. Without The Archive, I'd dread staying for a whole hour and 50 minutes in FroSci because of the content, but this archive helped relieve boredom. \nShe may be a little hard to hear, especially when you have her towards the afternoon, and all you want to do is go to JohnJay or Ferris to eat. Grading kinda sucks when too lenient (but a plus if you have heavy workload) but having an extremely lenient grader takes away motivation to do well on hw and encourages you to just do \"you.\"\nEvery midterm and final has a jeopardy which you should totally go to even if you can have it online. It'll help pick which ideas to emphasize on cheat sheet and all. \nDefinitely go to her office hours. ABSOLUTELY GO. Even for once, she will remember everything you tell her.\nWorkload:\nFro Sci can't be easier, don't worry about this. Attendance is THE must\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "April 23, 2015",
            "review_content": "\nIncredible! I'm not a science person really and she made the class so approachable. She grades easily, simply the check/check plus/check minus system and I don't know anyone who has gotten a check minus. She has both a liberal arts and science background, so she understands the array of interests and understandings of science you'll all have. She's kinda strict about attendance but just make sure to communicate with her. Overall, so lucky to have been assigned her.\nWorkload:\nWeekly summaries of lecture (easy).\nMidterm and final (lenient grading).\nFinal projects for each theme, super easy.\n"
        }
    ]
}