{
    "prof_info": [
        {
            "prof_name": "Steven Olley",
            "prof_id": 11409,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 08, 2014",
            "review_content": "\nI can see why some of the reviews have been negative, and, while I don't think the class is that great, I don't think it's that bad either. Plain mediocre.\nLet's start with the negatives - Olley doesn't seem very enthusiastic about teaching, and his powerpoints are almost completely based off of the book, so you don't really get anything out of going to class, unless you really can't understand something when you read the book (at which point it would actually be better to just go directly to his office hours or TA for help). Also, the fact that he takes SO FUCKING LONG to grade the exams. Literally, I got my final grade for the class today, 18 days after I took the final, and it also took him about that long to grade the first 2 midterms. The TA's are also clueless, I don't think I have ever seen TAs this clueless in any of the other classes I ever took at Columbia. 2/3 of them didn't know how to do easy homework problems, and they also take forever to grade your homework.\nPositives - Very manageable class. Stay on top of your problem sets, which aren't hard and can be done if you just spend time mating with the textbook. MIdterms and finals are straightforward, but there was a curve ball problem in our first midterm and on the final. Also, the fact that he doesn't go beyond textbook in his lectures can be a positive thing - if you're like me, and you feel like textbook learning is not bad and when a teacher goes off a textbook, that usually means the teacher is easy because you could just master the textbook and you're set, no taking notes in class bullshit lol. Also, some of the jokes he cracks in class are stupid, but I find them hilarious just because they're so stupid while everyone else complains. Hey, lighten up and find the good in things sometimes ya'll.\nOverall, if I had to take micro again, I probably would just stick with Olley.\nWorkload:\nHomework assignments once a week, could take between 2 - 4 hours to complete, not bad. 2 midterms, a final.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 25, 2013",
            "review_content": "\nThe reviews below, while understandable, do not fully reflect my experience of the class - so I thought I should offer my own impressions of Olley. In so doing I will violate the trend of all reviews being on the extremes, as I felt that Olley's teaching is neither exceptional, nor horrifically bad. He does an okay job; maybe verging on mediocre, but generally fairly average I would say. \nHe succeeds in explaining concepts in a relatively straightforward, clear way for the most part. While he does, as others have said, stick pretty closely to the slides that are provided as a complement to the textbook, and I'm sure one could skip most lectures and still do fine, his explanations are sometimes helpful. The lectures are not particularly inspirational, but they generally get through the material in an acceptable fashion. My biggest criticism would be that he does not seem to care very much about presenting the material in an interesting way; he has a somewhat tired and unenthused demeanor about him. As a result, I found myself rarely excited about this class, and also losing some interest in economics as a whole. But, nonetheless, it is a class that manages to get across the limited range of concepts that one expects to learn in micro. And, as the workload is not too bad (weekly problem sets that rarely take more than 2-3 hours) and he is fairly laid back, the class can be considered less stressful than others. The exams were a bit on the difficult side (averages of around 32/50 for both midterms), but the curve is decent. So overall mixed feelings for me. \nWorkload:\nNot bad. \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "November 28, 2012",
            "review_content": "\nThe single worst professor I have ever came across at Columbia, Musatti was a paragon of economic beauty compared to this man. This man, jesus, is the Canadian equivalent of Salanie, but worse. His lessons are basically him reading the slides he got from the textbook chapters from the textbook maker's website and are absolutely useless to attend. He is very passive-agressive, and shows agitation at the fact that 60% of the class does not attend lecture. The problem sets are short but stupid, and his TAs are absolutely useless. He is the worst. Never take his class. Elmes is almost worth taking despite her insane problem sets. Run. run. run.\nWorkload:\n2 midterms, weekly problem sets, final. All stupid and unclear. Lectures are useless, TAs are useless, he sucks.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "November 24, 2012",
            "review_content": "\nI read the previous review and I can't disagree more. It's not that the person was wrong, it's the fact that my experience was different. \nFirst, Olley makes it obvious that he doesn't want to teach. He is too busy complaining about his low salary and how Columbia is taking advantage or something. Sure, that might be true, but I am paying a lot to have to sit there and listen to his nonsense!!!! I can do better things with my money!\nSecond, he reads the power points and that's it. I don't see a reason to even go to his class. Plus, his midterm reviews are a joke. He doesn't go over the important material so, you are never prepared for the test. He will tell us to study a theorem very hard and then you won't see it on the exam. What's the point of confusing us?\nThird, he grades the midterms and I have to tell you--he is harsh. He takes point for anything and everything. Most of the class does really bad on the midterms.\nForth, his homework is a challenge. He doesn't teach anything so, you have to figure out how to do the homework on your own. Most of us worked in groups and had to find extra help. We went to all the recitations, but he gives his TAs problems that were mostly different from the homework. \nThe man is arrogant and intimidating!!!!! He doesn't want to teach at Columbia and the students are paying for that.\nIf you are great at figuring things out on your own--take his class; however, if you are student that needs more help and clear explanations--stay away from him!!\nHonestly, I have seen worse professors, but Micro is a difficult class and he makes it painful!!!!\n\nWorkload:\nHomework almost every week (total 15%), 2 midterms (25%) and a final (35%). Don't expect to get all the points on the homework.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "April 02, 2012",
            "review_content": "\nLet me start by saying that I did not want to take Elmes, not because she is a bad professor, but because i wanted to focus on my other classes as well. Steven used to teach 10 or 15 years ago, and he just came back. Olley covers exactly what the book says, he goes over the slides from the book, but in a good way, he doesn't just reads them, he actually explain them. In any case you get lost just read the book. Int. micro is a hard class, but Olley make it seem not to bad, giving real examples and always using cobb-douglas or doable utility functions. \nI am very glad I am taking him. Before i forget the exams are very fair. \nSoooo if you want a challenging class and learn micro like your own hand take Elmes, buuut if you want to learn micro in a fun way and also have some time for your other classes, then Olley is the guy.\nWorkload:\namazing, a weekly problem set, and very doable. ta's are very helpful and always go over problems related to the problem set. \n"
        }
    ]
}