{
    "prof_info": [
        {
            "prof_name": "Bidyut Goswami",
            "prof_id": 2669,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Squash",
            "review_date": "May 21, 2014",
            "review_content": "\nFor those who will understand what this means- squash is the precise opposite of fencing. \nYou will start playing pretty much on day 1, and with Bid (whom we had for the first half or so of the semester) you will do little else than play, which is great, though your play will be limited by less actual instruction. Ken does more actual training, but still you mostly play games, which is fun. \nThe drills, when they do take place, are okay, but you often won't do enough of them to really impact your play. So this is much more about having fun than improving your game. \nYou will always get a great workout. You're running and hitting balls hard for the full 50 minutes. \nBid is so relaxed about absences, he will very often count you as present when you're not there. Don't expect this with Ken though. \nAll in all, highly recommended, especially as a complement to fencing (very cool and lots of fun, but you hardly move for most of the semester and don't actually bout much). \nWorkload:\nShow up, don't accumulate more than six registered absences, like every PE class. \n"
        },
        {
            "course_name": "tennis",
            "review_date": "January 29, 2006",
            "review_content": "\nI LOVE HIM!!! that said, don't think that this will be a completely biased review. He shows up to class late often, usually he's about 5 mins late. He's an excellent teacher, he coaches the mens tennis team. he's a wonderful guy; really cool. if you do his class in the fall you switch half-way during the semester into squash. I HATE squash but Bid understood that and let me & my friend play raquetball instead. As time went on when we were in the squash courts (and we all had an idea of what we were doing) bid wouldn't show up until the last 15 mins of class (of course he'd put all the rackets and stuff out for you before class, but he'd only return towards the middle or the end) bid is so chill, but don't think you won't learn b/c of that. I'd never picked up a tennis racket before his class and now I can serve accurately almost consistently. Spots in his class go fast b/c of how great he is\nWorkload:\nnone. it's gym. bid = awesome and i *heart* him\n"
        },
        {
            "course_name": "tennis",
            "review_date": "November 29, 2005",
            "review_content": "\nthe coolest man alive. take this class, he's the man. \nseriously. you won't be sorry. you just learn how to play tennis, most patient and sweetest guy. \nWorkload:\nnone, like i said, he's the man.\n"
        }
    ]
}