{
    "prof_info": [
        {
            "prof_name": "Alison Williams",
            "prof_id": 4149,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate General Chemistry BC3232",
            "review_date": "June 18, 2011",
            "review_content": "\nProfessor William is a wonderful, sweet person. However she's an embarrassment to the chem department. She does not know how to articulate information or inspire confidence in her students that she even has a remote idea what she's talking about. Her incompetence as a professor is particularly frustrating because ultimately you need to teach yourself and the material is difficult. It's pointless to ask her questions, ask another professor instead. That said, she's a very nice person and considering her grades seem somewhat arbitrary it can't hurt to form a personal relationship with her. If you are premed, do NOT take intermediate gen chem with her. Take thermo and kinetics with Buzzeo or an equivalent class at Columbia.\nWorkload:\nNot too bad considering some answers are in the notes or straight out of the book for homework, but it's frustrating that you need to teach it to yourself.\n"
        },
        {
            "course_name": "Intermediate General Chemistry BC3232",
            "review_date": "May 28, 2010",
            "review_content": "\nThis class was pretty bad. Williams may be teaching chemistry, but her lectures certainly aren't credible -- she doesn't seem to be able to answer in-class questions and will prefer to look up answers after class and tell us the answer in our next lecture. She spends a good majority deriving equations to give us a complicated formula that is most likely never used again in the final or problem sets. Beware though, because although she gives many of these seemingly useless (or at least poorly explained) formulas, she sometimes has a question on one of the equations. There are so many that she gave us that it's hard to even guess which it will be. \nThe lectures and PowerPoint, as mentioned, are disorganized; some slides are just skipped and most of the fundamentals of chemistry are just glossed over with little emphasis to make time for more equations. \nEven though Williams attests you can finish the exams before the allotted time, most of us do not. The reason is that rather than testing us on finding a relevant value, she will likely test us on the theory behind a formula --- which is perfectly fine, but the problem sets were almost exclusively calculations and no theory and when students ask her for the reasoning behind a theory, she crumbles under the pressure and lectures on something that contradicts what she said 10 minutes earlier. \nProblem sets are quite hard if you do them yourself. I have worked on them myself and scored no higher than a 70. Going to the help room is practically mandatory and you will likely learn more consistent information. \nI felt cheated into taking this class. If you are in the pre-med sequence at Barnard, this course is mandatory (or at least I was told) and if I end up learning nothing, I don't understand why I have to be coerced into taking this class.  \nWorkload:\nLong problem sets that are difficult to complete yourself. 2 midterms and 1 Final, curved generously. \n"
        },
        {
            "course_name": "Intermediate General Chemistry BC3232",
            "review_date": "May 20, 2010",
            "review_content": "\nI just want to clarify that yes, all the below posts are true, with one small exception. Those reviews were written BEFORE grades were released, so the fact that we had all expected a high curve were purely speculation from Prof. Williams' words. I can say now that my grade is out that she barely curves. Despite the fact that her teaching is HORRENDOUS, she still pushes the responsibility of the bad grades on us. My point is, the curve isn't all that generous, so don't rely on it! Just avoid her or be prepared to learn on your own!\nWorkload:\n11 psets that were the bane of my existence. SUPER LONG. most times you take one look and you could have NO CLUE as to how to even interpret the problem, let alone understand it and solve it! \n2 midterms that were NOTHING like ANYTHING else we do in class. They were fairly simple, but we DID NOT know to prepare for an exam of that context when we had no prior experience with it (not from hw, or in class examples!). \nThe final was okay, but she might put up a RANDOM biochem question that's NEVER appeared before in class. \n"
        },
        {
            "course_name": "Intermediate General Chemistry BC3232",
            "review_date": "May 15, 2010",
            "review_content": "\nAgree with all previous reviews. She is awful. In addition to not teaching the material, being entirely unfamiliar with many topics covered in the course, and grading inconsistently, she has NO RESPECT for anyone else's time or schedules. She showed up to class 5-15 minutes late almost every single time (for a 50-minute class), and was even half an hour late to the FINAL. She also CANNOT stick to a schedule, and rescheduled BOTH midterms on a fairly last-minute basis (because some students just had too much other work to do that week -- deal with it! it's college!). I have also never attended a class in which the professor brought her daughter in so frequently. Sure, she's cute, but she was distracting and made Williams' lectures even more fragmented and frustrating.\nWhile I'd recommend you fulfill this part of the chem sequence elsewhere, I realize that's hard and probably wouldn't suggest foregoing the rest of the Barnard chem sequence for this one dud professor (because really, everyone else is stellar). If Williams is still teaching this class in the future, just be warned that you will be better off teaching all the material to yourself.\nWorkload:\n11 weekly problem sets (go to the workshops, they give you ALL the answers), two of which are dropped; 2 midterms (she'll test you on theory when NO ONE ELSE IN THE CHEM DEPARTMENT DOES, so be aware); and a final. She includes stupid bonus current events questions on her exams, so you may want to read the newspaper.\n"
        },
        {
            "course_name": "Intermediate General Chemistry BC3232",
            "review_date": "May 03, 2010",
            "review_content": "\nProfessor Williams is not a competent professor. My class was struggling to understand the material; the only reason there aren't more negatives reviews here is probably because she is new, and she curves generously. However, I can attest that most of us have walked away from the class knowing next to nothing about this subject, so if you are hoping to take MCATs... you're better off fulfilling this req elsewhere. \nFor awhile there, Professor Williams was confessing that she prepared her morning lectures on the train ride over from Jersey. After enough complaints were filed to the Dept head, she supposedly changed this, however I really couldn't tell. The issue is her lectures are clearly not her own slides. Unlike the other amazing chem professors at Barnard, she doesn't rehearse any of her lessons before she comes to class... but rather, she prefers to wing it. I'd be cool with this were it not for the fact that she is not good at chemistry. By that, I mean she would start problems on the board, get very lost midway through, then tell the class to make a big star in their notes to try to do the problem on their own at home. \nShe also posted the answers to our practice final at 8pm the night before. Not only that, but she kept having to re-post corrections, and in the end, she had posted the same question twice and was still missing a problem (there were 4 questions total). \nI could offer thousands of anecdotes on just how bad of a professor this is, but I'll try to limit myself. On one of the tests, I had a friend who worked out a problem, showed all her work, then made a stupid calculation error at the end (something like 10*3=3). She was given no credit, and upon appealing the grade, Prof. Williams refused to give her partial credit simply because \"It's the wrong answer!\". I personally have no respect for a professor who uses tests as a way to judge students, not a way to assess learning capability. In this case, I'm not even sure why \"It's wrong\" was a sufficient explanation behind what Prof Williams was thinking when she was giving so much partial credit for other reasons. \nAvoid taking this course. I'm not sure why Prof Williams still has a job. \n\nWorkload:\n2 midterms, final. Weekly Psets which count for very little, are quite time-consuming, and do not reflect what is on the test (probably because they're from a much more competent Barnard chem professor)\n"
        },
        {
            "course_name": "Intermediate General Chemistry BC3232",
            "review_date": "April 28, 2010",
            "review_content": "\nProfessor Williams is not a general chemist, and it shows in her lectures. She does not deal with the material that she teaches on a daily basis in her research, so she does not really care much about it. When she brings biochem into her lectures (which she does more often that I had expected), she knows exactly what she's talking about, because that's the area she researches. \nHer lectures are incredibly unorganized. She brings piles of papers into class every day, spreads them out over the lecture bench, yet somehow can never find the paper that she is looking for. She becomes flustered when questions are asked, and spends too long clarifying the wrong things.\nShe really means well, but she simply should not be teaching this area of chemistry.\nWorkload:\nWeekly problem sets that she give the answers to in office hours and in help room, 2 midterms (which are only slightly related to the problem sets), and a final. She drops the two lowest problem set grades.\n"
        },
        {
            "course_name": "Intermediate General Chemistry BC3232",
            "review_date": "April 21, 2010",
            "review_content": "\nThis is one of the worst classes I've ever taken at Barnard, and I blame that largely on the quality of Williams' teaching skills.  Her lectures are completely convoluted, impossible to follow, and no help at all on either homework problems or exams.  She is poor at answering questions during class, gives the impression of not knowing the material, and does not adequately give any examples of anything she teaches with almost no exceptions.  During office hours, I don't think she could give any help at all if she didn't have the answer key in front of her.. it's embarrassing.  \nWe're using something like 6 textbooks right now which she uploads to courseworks, none of them can help with the problem sets because none of them tell us how to answer what she's asking for.  I'm in office hours literally three times a week for this class alone, it's absurd how much extra work I need to put in to make up for her lack of clarity and organization. \nShe's in over her head, completely out of tune with teaching, unclear, unhelpful, unorganized, and I hope that she never teaches this class again.  I like Professor Williams a lot as a person, but I wouldn't wish this class on anybody, especially a group of premeds who need these skills to do well on the mcats.  \nIf you can avoid taking this course with Williams, do it at all costs.\nWorkload:\nThree exams (which she curves well at least, to make up for everything else), 11ish problem sets which are extremely difficult. \n"
        }
    ]
}