{
    "prof_info": [
        {
            "prof_name": "Alessandra Casella",
            "prof_id": 3211,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Political Economy",
            "review_date": "December 30, 2014",
            "review_content": "\nCasella clearly cares about the topic and does a decent job making you care about it as well, which is impressive given that this class seems to be given the shittiest room and the shittiest time slot (Mine was in 7th Floor of Hamilton at 8:40am). However, I have a huge problem with the way you are tested on the material. \nI guess to describe it, we are rushing to cover the material in class, during which we explore the issues at an intensity level of say, 2 or 3 on  scale of 10. In the end we ended up covering only 3 out of the 4 major units. \nThen, for the problem sets, we are expected to solve problems that are at a level 6 or a 7, and in order to do these, you will have to go to office hours and recitations and spend quite a long time figuring out stuff on your own since there isn't a textbook and you're going by pretty much just lectures, which once again, are rushed. If you're unlucky like me, you will only be able to make one recitation, which occurs after both classes, so you can't get much help. Luckily, despite being frustrating, these are worth only 10% of your grade. \nThen, for the exams, she suddenly decides to kick your ass and test you at level 9 or 10, except this time you don't have hours and office hours to figure it out, but 75 minutes or 3 hours for the final. You have no way to prep for the difficulty because what you are tested on is different from previous years because of the pace at which the class was covered and so that at least half of the material on practice tests are irrelevant. This is extremely frustrating because while there is a lot of conceptual stuff, there's also a lot of algebra that needs to be done, so you need to be very good at jumping between the math and the conceptual stuff. \nI really liked the material itself, but the way that the class was run and we were tested made me feel extremely inadequate. Her explanation is that everyone gets screwed, but I feel like there has to be a better balance between challenging us and making it too easy. \nWorkload:\n9 problem sets for the semester counting for 10% (although she said she would only give 8 on her syllabus which annoyed people), 2 Midterms at 25% each and 1 Final for 40%. This class will most likely kick your ass, sorry. I have a 3.9 as an Econ-Poli Sci major, went to every single recitation, tried my fucking hardest and got a B+. Or maybe I'm just dumb...  \n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "June 13, 2011",
            "review_content": "\nProfessor Casella was given the challenge of motivating a class of econ and polisci majors to trudge up to the seventh floor of Hamilton on Monday and Wednesday mornings at 9 to attend lectures involving mathematical proofs.  The inherent difficult of this challenge should not be underestimated.  As previous reviewers have noted, Casella displays an immense enthusiasm and sense of wonder for many of the topics discussed, and her excitement motivates you to pay attention and try to understand.  Not the easiest class in the world, and it would have been helpful to have had better textbooks, but try to keep up with her assigned journal articles (it would help if she posted the electronic resource links to courseworks).  The articles tend to be interesting and helpful.\nWorkload:\nOne midterm and one final.  Devilish problem sets that over-prepare you for the final.\n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "May 24, 2011",
            "review_content": "\nThis is an Ivy League class. The material is very interesting (well, except for the silly firm/fishery stuff at the beginning) and is a great example of how economic theories can explain, or rather reflect, real life situations.\nThere's a lot of math, more in class than in the problem sets and exams, that often makes following a tough job. The problem sets are optional, but if you do them and try really hard you get this great feeling of achievement. Professor Casella will often ask you to appreciate how wonderful something is: even if you don't do so expressively, there is a lot of stuff to appreciate in this class and I can recommend it, but only if you are truly interested in the material and aren't afraid of challenges.\nAs for teaching itself, Professor Casella is generally helpful in class although her handwriting can be a pain in the ass to decipher and you will often find yourself asking her or your neighbor what something means. Also, she does a great job of explaining theoretical concepts and their math proofs side by side which is very helpful.\nWorkload:\nProblem sets (8) were optional and used for marginal grading, midterm, final.\n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "May 12, 2010",
            "review_content": "\nCasella seems like a real person you'd like to know, a super-cheerful person with a family and personality quirks and beloved hobbies (which may or may not involve Nash bargaining games to a disturbing degree). I loved her class; I was sad when we had to miss 15 minutes for a fire drill.  You can't help but get excited about the material because she, clearly, loves it just as much as when she first encountered it 25 years ago.\nThe class is hard, and her tests are more like IQ tests than the usual Columbia prompts for you to regurgitate what you've learned from problem sets.  But she curves generously.  Another issue is that political economy is basically collectivism 101, and this European-born professor is really into centralized power.  But you'll forgive her for that, too, because she is just so spirited and fun. \nTA recitations and office hours are essential.  That's where the math starts to make sense.\nWorkload:\nSignificant, but the TAs are very available to you, and the recitations & problem sets are good practice.  It was helpful to have solutions posted throughout the semester so you could learn from them.  I'd say this work is more qualitatively than quantitatively challenging.  The midterm is harder than the final, since the 2nd half of the course is conceptually easier.\n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "May 22, 2009",
            "review_content": "\nProf. Casella is definitely knowledgeable and enthusiastic about what she teaches. It was at times almost embarrassing to see her getting so excited and worked up at 9:10 am, when most of the class was still asleep (intellectually and sometimes even literally). \nPolitical economy is slightly boring, and Prof. Casella teaches it at a very high level -- expect the exams to kick your ass! -- which is good if you are as interested in PE as much as she is, but it is often annoying if all you want to do is to get this requirement out of the way (for Econ-PoliSci majors). \nOverall, I can't say that I enjoyed the class, but this was mostly because I did not like PE and did not agree with many of the things PE is about. Yet I liked Prof. Casella: she's a good lecturer, she is very organized, enthusiastic, accessible, and, given the proper class, I am sure she would have had me sitting on the edge of my seat.  \nWorkload:\nMidterm and final (kickass, both). Optional problem sets every week (1-2 hours of work; they count for borderline grades)\n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "March 25, 2007",
            "review_content": "\nA wonderful professor. Prof Casella is extremely interested in the topics she teaches and clearly shows her excitement in class -- which is commendable if only because we were a 9am and could use the upbeat attitude. She can get a little behind in covering all the material, but what she does cover, she does very very well. She comes into class knowing what she is going to teach and the format in which she's going to teach it. \nThat said, Casella doesn't have the best handwriting and shorthand. Her p's and q's are switched so the shorthand of \"public good\" becomes \"gp\". Ask her to clarify things though and she'll be happy to do so. \nAlso, take advantage of her TAs; mine was an amazing amazing supplement to Casella's lectures and helped a lot in understanding tricky material.\nWorkload:\nproblem sets every two weeks (not hard if you go to class and ask the TAs for clarification on particulars), in class midterm and final (study for these!)\n"
        }
    ]
}