{
    "prof_info": [
        {
            "prof_name": "Brendan O'Flaherty",
            "prof_id": 572,
            "total_reviews": 59
        }
    ],
    "reviews": [
        {
            "course_name": "Principles of Economics",
            "review_date": "July 26, 2016",
            "review_content": "\nWorst professor ever. Do yourself a favour and just don't him. Just don't. He's a rambling piece of mess AND also has a shitty curve. The class is curved to a B-, so the majority of people I know, despite working their asses off, ended up with a B (which pulled down their GPA). So not only do you not learn anything but also end up with a bad grade. Don't take him. \nWorkload:\nLight, but harsh grading and EXTREMELY weird problem sets. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 15, 2015",
            "review_content": "\nThe negative reviews on Professor O'Flaherty are a bit exaggerated. It's true that he talks about the children aka the cats a lot and words the problem sets/exams in vague ways that can require online searching because we did not cover it class. He uses Piazza to clear up wording, but doesn't always actually bridge the gap and requires you to go to TA's office hours to make sure you ace the problem sets. I scored on the average for the first midterm mostly because I couldn't understand what was being asked of the question. Luckily the second midterm and final were made into take home exams and actually helped me in learning a lot trying to answer them because it become a research project about interesting Economic topics like the Water-Diamond Paradox. Just another thing that was not covered in class but I was fortunate enough to stumble upon online. On the positive he send the class weekly email blasts about what will be covered in class, recitation, and weekly times articles that are on current events regarding the upcoming lesson plans. He brings a good sense of humor to class and if you sit up front you can get some good dialogue with him to clear up things. This kid Salim sat up front and wouldn't stop raising his hand to asks questions. Although sometimes annoying he did ask some good questions and make some of the more boring lectures a bit less of a snore fest. Overall, the class was enjoyable and didn't hurt my GPA like I heard Gulatti would, nor was it hard to understand because of a thick accent like other Econ professors.\nWorkload:\nSee TA's from Problem sets that are about one every 1-2 wks and you will ACE\n1st midterm is harder than the take home midterm and Final but possible to Ace if you devote 8-12 hours on each. He gave us 47 hours to complete each take home.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "April 15, 2015",
            "review_content": "\nI have never once given CULPA reviews the benefit of the doubt until I took Brendan O'Flaherty's class. If I could turn back the clock and take a different professor, I would do so. I have never met a more inarticulate, Harvard Ph.D in my entire life. His lectures can be interesting and occasionally humorous, but he will put you to sleep.\nMy biggest concern: His problem sets. He is absolutely horrible at phrasing questions and letting you know what he wants you to include in your answer. He lets you use Piazza to ask questions, but his advanced age is evident in his use of the website. His internet grammar makes the average YouTube troll look like an articulate, well-informed member of society. And the way he answers questions on Piazza is cryptic and makes just as much \"sense\" as the question he asked in the first place.\nPro: Because his problem sets are absolute bullshit, they're easy to knock out in a few hours if you use Google, but good luck getting the same results on the test. He will justify any grading mistakes he makes in the most ridiculous way possible.\nHe doesn't shut up about his cats.\nWorkload:\nNot that much work, but the problem sets can be frustratingly stupid.\nOne regular midterm \nOne take-home midterm\nOne final\n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "December 24, 2012",
            "review_content": "\nThis was the only interesting class I was taking this semester. I would love going to class, Brendan is a funny professor and  very laid back. Urban economics, is a very interesting topic, and the class is very doable compared to other Columbia College classes out there! btw you will def. \nDefinitely take this class if you are taking other core classes like Econometrics or int. micro those are though classes. this class is fun and easy. \nThe only problem with the class, is that sometimes you will feel lost trying to do the problem sets which are pretty weird, but if you take into consideration that the p.sets are every 2 weeks, kind of short and you can do them  in teams is not bad trust me....\nWorkload:\n4 problem sets, 1 take home midterm and 1 very easy final (I wrote the 15 page essay)\n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "December 27, 2011",
            "review_content": "\nThis is a poor excuse for a course. O'Flaherty is an extremely boring lecturer, he speaks really quietly, and he is a bad teacher. This is reflected by the fact that the classroom was always pretty empty. The material could be interesting, but his dry, long-winded lectures made it torturous. His textbook is definitely clearer than his lectures, but it is also unnecessarily long. O'Flaherty is surely well-intentioned; he really cares about the course and its material. However, this does not make up for the fact that he is incompetent at teaching. He has a tendency to gloss over important concepts very quickly, but he will spend far more time talking about a table that hardly matters at all. This is a very easy econ elective, but I would highly recommend staying away. It is easily the worst class I've taken at Columbia.\nWorkload:\n5 problem sets, take home midterm, choice between 15 page paper and easy final or no paper and hard final\n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "December 13, 2011",
            "review_content": "\nThis is a great class if you are looking for a relatively easy upper-level econ elective that is analytical and interesting. Dan can be dry sometimes, but at his best he is enthusiastic and incredibly witty (although the class tends to miss his dry humor). Topics covered include mass transit, housing, land, drugs, and all sorts of other fun stuff. You'll get an overview of these issues in class and from the textbook, but real in-depth understanding will have to come from your own work (if you want to). If you are an econ major, you'd be stupid to not take this class, given that you live and study in New York.\nWorkload:\nWorkload is very reasonable. 4 long problem sets, but you can work in groups. Takehome midterm. Option of paper and easy final or hard final without paper.\n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "December 21, 2010",
            "review_content": "\nVery interesting class, funny professor.\nWe were a small group this year compared to the usual 70-100 students who register for the course every semester. \nProfessor O'Flaherty narrates the class. He reads from his notes but they are all written in a very \"oral\" way (and he posts them on Courseworks so the jokes are included in your class notes when you print them out!). \nCovers very current topics in housing, police, congestion, land, education, prisons, homelessness,.. all related to urban centers in the US. \nVery minimal maths. \nOverall great Econ elective. \n\nWorkload:\n- 4 or 5 problem sets\n- Midterm\n- Final\n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "January 12, 2010",
            "review_content": "\nO'Flaherty is a weird dude. He basically prides himself on being an intellectual iconoclast, so much of the course focuses on disambiguating students of their previous \"common sense\" beliefs. Unfortunately, he goes about this in a very confusing manner. Generally, he will make some sort outrageously counterintuitive statement, causing students to miss his subsequent explanation because they are too busy checking with their neighbor to make sure they actually heard him correctly. His class promises much, and by the end it does start to deliver, but not without a great deal of frustration in the beginning of the semester. \nIn terms of grading, the strangeness only continues. Basically, your grade in his class has close to zero correlation with the amount of work you put in. I, for example, put basically no effort into his class, other than showing up for ~70% of the lectures. I walked into the exam with no knowledge of vast sections of the material, but he put a question on the test that involved using a uniform probability distribution (this was never covered in any material prior to the exam, and the question itself required no knowledge of the course material, just the ability to understand how to use uniform probability distributions). Since the rest of the exam (and the class) was so easy, this one question basically became the curve, so I got an A while many other students who put more effort in than me likely got lower grades. \nBasically, take this class if you are smart and confident in your ability to handle unexpected situations. Everyone takes it, so the main advantage in my mind is that you will have lots of friends with whom to work on problem sets. \nWorkload:\n4 problem sets (at least two of them involve copious and unnecessary amounts of math), midterm (easy), choice of a paper and easy final, or no paper and hard final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 27, 2009",
            "review_content": "\nUnfortunately, the best word to describe this class is awful.  First of all, there is very little economics actually taught and you will probably not be as prepared for higher levels of economics as those who had other Principles professors.  Instead of focusing on basic economics, Professor O'Flaherty would much rather espouse his views on healthcare, oil, or a variety of other issues.  While this could be interesting to provide examples of economic principles or as a sidenote, those random thoughts of Professor O'Flaherty are the main focus.  Also, O'Flaherty does not use the textbook at all.  Instead, he provides 7 problems sets which are some of the most bizzare assignments I have ever been given as a student.  The problems are exceedingly strange (as Professor O'Flaherty's examples tend to be) and it is very hard to determine what he is looking for on each one.  Additionally, they are seemingly arbitrarily graded by the TA's and really don't matter at all in determining your final grade.  The exams are almost as bizzare as the problem sets, filled with made up planets, jokes about his cats, and other truly strange situations and questions.  Again, the tests were seemingly arbitrarily graded by TA's, and for the midterm, Professor O'Flaherty initially refused to explain what the raw score correlated to in terms of grade, and would only tell us the mean and median score.\nSection is slightly better, as the TA's attempt to get some economics into the course.  Mine, however, was pretty unknowledgable and did not deal with questions about the material well.  Also, they are not terribly useful in attempting to navigate the course, as they find Professor O'Flaherty's teaching style and the course overall as strange and erratic as the students do.  \nOverall, the course is terrible.  O'Flaherty's teaching style is bizzare and pretty uninformative with regards to the Principles of Economics.  If you have to take Principles as a requirement and can't get another professor, take it Pass/Fail, which you can as your first course if you are an Economics major.  That way you hedge against how erratic and unpredictable the course is and can always uncover the grade if you do well.\nWorkload:\n*7 problem sets\n*Midterm\n*Final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 18, 2009",
            "review_content": "\nWhen I was reading the culpa comments for O'Flaherty a couple of months back, I was expecting a horrible class. And it seems like it is for some people. \nYes, he is probably not the most charismatic professor at Columbia, and sometimes, he can mix stuff up. But mostly, his lectures, with exceptions, are interesting and filled with very dry, subtle humor. And if he makes mistakes, he always follows up by e-mail.  \nYes, he talks about penguins and pet food a lot. But maybe it's because this is a PRINCIPLES of economics course. He uses very abstract examples so that you actually have to think about the concepts and mechanisms at work there. If you spend some time thinking about the problem sets, you shouldn't have any problems. And if you do, you can always ask the TAs or O'Flaherty directly. The sets are graded check, check plus anyway so it's not even such a big deal.\nIf you think about majoring in econ, this class will definitely help you a lot if you're willing to think abstractly about stuff. The lectures are very close to current events (that's why the book doesn't get used much), so go to lecture. I had a good time and I will definitely major in econ.   \nWorkload:\n7 Problem sets, graded check, check plus\nMidterm and Final, the better one gets valued higher for the final grade\n all in all, very manageable\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 14, 2009",
            "review_content": "\ni wrote the following on my course evaluation for this class:\n--\nin this class i had to come to terms with disorganized lectures (aka errant scribbles on the board), massive deviations from the book (he doesn't always explain which chapter or sections we can read from the book), and unclear explanations of material and what's covered on the exams. he's definitely a smart guy, i'll concede that much, but really needs to overhaul his teaching style (or drop out of the PROFESSion entirely--see what i did there?)\n--\nthe review written on 11/19/09 is all you need to read. i wanted to drop the class and take it again next semester with a different professor but i couldn't afford to have a wasted class for a semester. try to hold out for a better professor if at all possible\ni'll reiterate\nTAKE THIS CLASS AS A LAST RESORT ONLY\n\nWorkload:\nweekly psets (always ambiguous and contain irrelevant material), one midterm, one final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "November 19, 2009",
            "review_content": "\nHonestly, if you have to choose between taking econ with O'Flaherty as your professor and not taking the class at all, choose the latter. His lectures will either go off topic or focus on something that isn't all that important in real life economics. I think I learned more about his cats than I did anything. He rambles on at lectures, so good luck trying to take helpful notes. And if you do check his notes online, it's pretty much like he's right there talking to you, very colloquial and not helpful. Most kids in class would fall asleep or play on their computers. There were those few kids that actually did pay attention, so kudos to them. I can't speak for all TAs, but mine (Ozge Akinci) was actually pretty helpful during the required discussion class. She usually went over the mathematical aspect of things, which O'Flaherty did not do. Nonetheless: when considering principles of econ, either take Gulati (good luck with getting in his class), Musatti, or just not at all. \nWorkload:\nA problem set every week that DOES NOT make sense. He talks about the most absurd situations and then expects you to come up with a genius formula that will solve all problems. One midterm, which was just as crappy as the homeworks, and one final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 12, 2009",
            "review_content": "\nI agree that the class was dreadful. All the lectures except for the last one on the Great Depression were dry. Many of them went off topic. He used the weirdest examples in order to explain. The problem sets (and especially his lecture notes) didn't make any sense. I ended up having to do a lot of work outside of class in order to learn everything. And by the way, the TAs were useless.\nWorkload:\nWeekly problem sets, midterm, and final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 28, 2008",
            "review_content": "\nAbsolutely dreadful class. Professor O'Flaherty thinks he's really cool and interesting but he's incredibly boring and really random. Most of the few people that come to lecture seem to be asleep all the time. The TAs are pretty bad as well in the weekly recitation sections. They don't seem to care at all about the class and seem to find it as silly as everyone else. His midterm and final have nothing to do with anything, especially nothing to do with the reading (which is worthless, don't do it). Though the grading seems very generous in the end, whatever you do, DON'T TAKE THIS CLASS. It will drive you crazy.\nWorkload:\nA few informally graded problem sets, midterm, final, not too bad in terms of the amount, but frustrating nonetheless\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 10, 2008",
            "review_content": "\nProfessor O'Flaherty is an excellent lecturer, very insightful, funny, and interesting. He always takes time to answer any questions anyone might have. I enjoyed his lectures immensely, but the classwork was somewhat hard to follow. The book was a good read but had nothing to do with the homework. The tests were not very similar to the problem sets, and I think more than a few people were rather lost when it came to actually take the midterm and the final. I recommend taking the class p/d/f.\nWorkload:\n7 problem sets, one per week. Only a couple of hours of work required for each. \nAn hour long class per week required with a TA to do more quantitative stuff. \n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "August 10, 2007",
            "review_content": "\nThis class touches on some really cool topics -- the economic advantages of cities, congestion pricing, location theory, mass transit, crime, education, drugs -- and, on the whole, O'Flaherty teaches it well.  Anyone interested in policy will get a lot out of this class, as will anyone who likes to apply economics to different facets of daily life.\nThat said, you either like O'Flaherty or hate him (I like him).  Lectures convey a lot of information but are sometimes disorganized or jumbled, and it can be hard to figure out exactly what he's talking about.  The textbook (by O'Flaherty) is good but, like its author, rather long winded.\nWorkload:\nFour problem sets (20% total), midterm and final.  Light overall, grading seems fair.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 16, 2006",
            "review_content": "\nAARRRGH!\nOkay, so when I got schedule-conflicted out of Gulati, I came and read the very reviews that you are reading now. \"Oh,\" I thought, naively, \"O'Flaherty doesn't sound so bad, according to these.\" But how wrong I was!\nStart off with twenty-five minutes or so of bad jokes, followed by an hour of STUDENTS making idiotic jokes, which O'Flaherty engages rather than, I don't know, teaching economics--then a mandatory recitation section where a TA who can't speak more than a half-dozen words of English lectures me on basic math!\nRinse and repeat thirty times.\nIn my opinion, the man can't teach. He can't lecture, he can't run a classroom, and he can't write tests. The class is an hour of straight-up agony while some jackass in the back of the room asks \"can chickens fly\" and rather than shutting him up, O'Flaherty chats with him about it for hours at a time. Yeah, it's cute to get your students to like you, but some of us would like to cover the material without feeling compelled to tear out our eardrums.\nWhat's really strange is that his notes on the website are actually coherent and intelligent -- but you will never hear ANYTHING like that in class. I'm assuming somebody else wrote them.\nI hate to be this harsh. But take Gulati. Don't compromise.\nWorkload:\nWeekly problem sets, not particularly hard, that force you to attend recitation -- short but poorly graded midterm and finals, plus an appeals process...\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 16, 2006",
            "review_content": "\nWhere should I start on Dan O'Flaherty? Reading past reviews, I definitely agree with most of the comments. He has a strange sense of humor and tries to relate unnecessary things to Economics (I recall examples using penguins). The lectures are dry unless he brings up obscure examples which, although they are funny, don't help you learn the material. Aside from problem sets, the textbook isn't really used because he focuses on his lectures for the midterm and final. Therefore, going to the lectures is the only real way to do well on the tests, and I would strongly recommend going to recitations too, even though my TA wasn't the least bit helpful.\nWorkload:\n8 Problem Sets (anywhere from 5-8 questions), midterm, and final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "March 26, 2006",
            "review_content": "\nSimply put, he's not the best professors I've ever had at Columbia. But he's not the worst either. \nIndeed, he was pretty bad for the first two weeks,(I seriously considered dropping the class) but then I began to appreciate his insights, somewhat oddball comments, and his efforts to translate his apparent genius in Economics to decency in teaching Economics. Now that the midterm is over, I actually enjoy going to class (though I always bring my textbook and read it when the lecture isn't too interesting), and I like his promptness and attentiveness. \nHe's actually a nice guy in person. I feel bad that he's hated by so many people (read the reviews below), and that his teaching and efforts are under-appreciated. \nAnd about Gulati: I wanted to take his class but couldn't due to the schedule conflict, and I believe most of my classmates chose O'flaherty for the same reason. However, it's not that O'flaherty is too bad but that Gulati's too good, and I guess O'flaherty happens to lie in the shade of a star professor like Gulati. \nMy closing comment similar to the one far below: take Gulati if you can, but you'll be just fine with O'flaherty. I actually decide to major in Econ after taking O'flaherty's class. \nWorkload:\nWeekly problem sets (maybe I am weird, but I've been enjoying them very much except in the first two weeks), A decent midterm, I haven't taken the final so I don't know.  \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 25, 2005",
            "review_content": "\nO'Flaherty is the worst type of economist. He is a stale thinker and exceedingly dull professor. His jokes are failed attempts to convince the class of his humanity. \nO'Flaherty resorts to gross simplifications when explaining most theories. For simplification's sake, O'Flaherty invented something called the \"Short Run Inflation Adjustment Curve\", an inadequate proxy for Aggregate Supply. He also rejects mainstream ideas, simply because it makes him appear smart.  As a result, this class is useless. You WILL have to re-learn the basic theories as an economics major.\nHis tests consist of inane questions, \"True or False: Poor people in WVA will be better off if more jobs are available and the area is more proseperous\". \nNot difficult, not even economics (just hearsay). Take Gulati if you don't want a headache.\nWorkload:\nWeekly Problem Sets (not graded, just check/checkplus), Midterm and Final\n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "December 24, 2005",
            "review_content": "\nI loved the class.  Urban economics, at its best, is engaging, clear, useful, interesting, insightful.  The subject matter of this class fit the bill--taking about the economics of crime, race, housing, etc.\nUnfortunately, O'Flaherty is simply not a good lecturer.  He'd say very interesting things, but he would say it in such a way that no one would be interested.  He'd mumble toward the end of every sentence and you couldn't catch what he was saying.  I recommend sitting in the front row, although very few people did.  He'd make jokes, but few people would laugh, although they would be very funny if he had a decent delivery.\nThe textbook was good--O'Flaherty wrote it himself, and it's pretty much what you hear in lecture.  I'd say you could do one of the two: read the book, or strain to listen to what he's saying and take copious notes.  What wasn't good was the questions in the book for the problem sets--they usually had no real answer and/or didn't relate very well to the corresponding chapter.  For example, there would be questions at the end of the chapter involving math formulas, when no formulas were given and no math was discussed in the chapter.\nThe T.A. was a character in himself--trying to steal the show, but he often didn't know what he was talking about.  But since he did the grading, it was very useful to have him know your name, and in a positive way.\nAs for me, for what it's worth, I went to class & listened, didn't read much of the book, didn't do the optional 15-page paper, but still got an A.  The grading may be convulted but don't worry.  A key was probably constant communication; have an email dialogue going with a professor and you'll likely get the A.  Enjoy the class, and good luck.\nWorkload:\nonly 4 problem sets, and u can do them in a group (go to the TA sessions for most of the answers); midterm consisting of an essay take-home & and in-class multiple choice test; optional paper; & same format final (take-home + in-class).\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 21, 2005",
            "review_content": "\nI really don't think Dan is that bad. I found him a bit dry, but some of his lectures were very interesting--espcially on contemporary issues like Chinese currency and the Bush tax cuts. While you'll be more interested in economics if you take Gulati's class, you will survive if you have Dan. After all, our class even started a facebook group in his appreciation.\nWorkload:\nproblem sets, midterm, final\n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "December 17, 2005",
            "review_content": "\nDan is great. He tackles difficult real world economic problems and doesn't shy away from exposing the contradictions inherent in the material. He is a great lecturer, and knows his stuff cold.  The text for the course, which he wrote, is extrememly helpful and funny at times.  Chapter 16 begins, \"No one has even been raped by a tree, assaulted by a mushroom or robbed by a sheep.\" You'll leave this class enlightened about important issues like crime, education and the housing market.  Definitely a    must take in the otherwise boring Economics department at Columbia.\nWorkload:\nFour problem sets graded on a check, check plus, check minus scale.  One midterm and either a final paper or a final exam.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "November 27, 2005",
            "review_content": "\nI know that O'Flaherty annoys the heck out of some people, but I actually find him quite endearing. He moves a little too slowly sometimes, uses some unnecessarily ridiculous examples, but it works if you're not already an ace at econ. I personally like how he focuses on the humanitarian and environmental aspects of economics, with a whole lecture on homelessness. He views the study of economics as a mechanism to make the world better, not just as a way to make money, and offers real economically sound ways to do so. \nWorkload:\nOne moderately hard problem set per week, one midterm and final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "November 16, 2005",
            "review_content": "\nFlaherty cannot teach to save his life. The lectures were totally scattered and irrelevant to what we were actually supposed to be learning about. Moreover, he's SO boring that even if he was making sense,you wont be awake to see it happen. Most of my class stopped coming to lecture by the second week. If you really like econ, do yourself a favor and stay away from this class so as to not kill your interest in it. Go for Gulati! The midterm was irrelevant, and the problem sets are annoying since you have to figure them out yourself. You will have to read the book if you want to learn anything. Moral of the story- STAY AWAY!\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "November 15, 2005",
            "review_content": "\nAlthough this may be a problematic course in and of itself, O'Flaherty is an incompetant and unhelpful professor.  At best, he is a footnote to the textbook, which you will need to read to learn anything in this class.  He's also one of the most boring professsors I've had at Columbia.  One thing that was particularly frustrating was how the midterm did not cover class material, nor book material, nor anything we had ever really seen before.  I highly recommend avoiding O'Flaherty as a professor.  \nWorkload:\nweekly problem set and reading, one midterm and a final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "November 07, 2005",
            "review_content": "\nI thought this class was horrible.  With only a small amount of experience in economics I took this my first semester as a SEAS student.  I immediately started falling asleep in class or wondering what paper clips and his new windows had to do with econ.  (Trust me, he never made a relationship.)  I was wondering why he was even teaching until I invited a student from Gulatti's class to visit a lecture and he said the same thing.  In the end I skipped most of the classes and got an A.\nWorkload:\nps sets, midterm & final...the final left me really afraid as I had never seen some of the topics, but everyone else felt the same way and I still got an A.  (I think he just made a really bad final.)\n"
        },
        {
            "course_name": "Economics of Race in the U.S.",
            "review_date": "September 22, 2005",
            "review_content": "\nQuirky guy but a great class. Having also worked as an econ research assistant, I can tell you that these are issues economists really look at. I found the lectures great (minus the few brown nosers who always asked questions in an attempt to sound smart--but this is typical for columbia). If you are interested in the way that race plays a role is SO many aspects of American society, take this course. \nWorkload:\nLIGHT--midterm (with take home essay and in class exam). take home based on doing a few of the readings--just chooes your topic then read what is appropriate, and in class exam based only on lectures. final was your choice, 15-20 page paper on topic of your choice, or exam in similar format to midterm. no reading other than for mid-term/final (there was a reader, but no need to read as long as you make note of who said what in class)\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "September 11, 2005",
            "review_content": "\nI'm not going to blame O'Flaherty for the content of this course. He's a bit of an oddball, but I don't think that it really makes his lectures any less effective. The lectures are interesting in that they demonstrate how an economist (namely O'Flaherty himself) might think about issues.    What's really important is that you have a good TA, because it is in the recitations where you really learn the quant heavy stuff. \nUltimately I have a problem with the course itself. Why is this a requirement for Economics majors anyway? It's way too basic to really prepare you for anything and the Intermediate Macro and Micro classes do an adequate job of teaching these same concepts in depth from first principles. Therefore, I propose that the requirement be cut altogether, anybody with a passing interest in the subject already knows this stuff anyway.\nWorkload:\nProblems sets are too long. This course makes up for the thin content by making you run endless scenarios with the stuff that is covered. Midterm and final are very tricky. I found the tests heavily skewed towards a few concepts. How are these tests fair for a survey/introduction course?\n"
        },
        {
            "course_name": "Economics of Race in the U.S.",
            "review_date": "August 07, 2005",
            "review_content": "\nWhen I took Principles with O'Flaherty, he dedicated an entire lecture to the study of traffic flow of New York and presented various models designed to reduce commute time.  Take that as a hypo-test.  If it sounds boring to you, than no subject matter is going to make a clas with this teacher worthwhile.  If, on the other hand, using economics in this capacity piques your interest, then it is worth trying out a class with O'Flaherty.  I have several friends who have took Principles with me, and our opinions of Dan seem to split exactly on this example.\nEconomics of Race is taught less like a standard college course and more like a British university class.  Extensive literature is made available (far more than could be read during the semeser, approximately 5-6 big course packets).  Professor O'Flaherty lectures on the most important studies in various fields, but gives the students free play on what they choose to study.  The midterm is short and extremely objective, consiting largely of multiple choice and short answer questions.  I disagree with earlier reveiw that said the test was obtruse; I could find verbatim answers to each of the questions listed somewhere in my notes.  The final is the same format.  There is also an optional paper; those that choose the paper are given a shorter, simpler final (basically, to make sure you still come to class).  The whole point of a class taught in this format is personal research, so it seems kind of a waste to enroll and not right a paper.  Still, if you're one of those people that hates O'Flaherty and are still stuck in his class, just camp in the back and take detailed notes- they'll pay off for the final.\nWorkload:\nMidterm, final/final paper, a few short homework assignments, extensive optional reading assignments\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 20, 2005",
            "review_content": "\nO'Flaherty almost killed my interest in economics, His lectures are boring, tangential, and useless. His exams do not reflect his lectures nor the book reading at all. Do not take this class with OFlaherty. \nWorkload:\nsporadic problem sets, midterm and final.\n"
        },
        {
            "course_name": "Economics of Race in the U.S.",
            "review_date": "January 03, 2005",
            "review_content": "\nThis class had the potential to be very good, but instead was disappointing and excruciatingly torturous. Time stopped every Tuesday & Thursday from 1:10-2:25 when the professor droned on in a monotonous voice about the \"relevant\" and \"most important\" studies. Professor O'Flaherty was very good at quoting studies and statistics, however he usually couldn't answer questions about them. I would have liked to hear some of his opinions on the studies, although every time he veered away from the studies he seemed to get confusedÂ…or offensive. Which I guess isn't too hard to do in a class like Economics of Race, and his comments were cool as long as they were kept in contextÂ…but I'm sure some people missed the context when they were just waking up from their naps. While we had about a million readings, almost half of which were required, many topics did not offer opposing views. It would have been nice to look at both sides of the story or studies with conflicting conclusions. Also, it would have been nice if there were more discussion. \nWorkload:\nWorkload wasn't too bad: 3 problem sets, midterm (half of which was a take-home essay), and a final (you get an easier final if you write an optional paper). And like I said, there were about a million readings. All readings were in an expensive coursepack, but not really worth the money since over half of the articles were unnecessary. Many readings were available online.\n"
        },
        {
            "course_name": "Economics of Race in the U.S.",
            "review_date": "December 21, 2004",
            "review_content": "\nInteresting course.  O'Flaherty is a funny guy and knows his stuff well.  However, don't expect the final exam to have anything even remotely to do with lectures, readings, or TA review sessions.  It will be completely random stuff that you will have never seen before.\nWorkload:\nRelatively easy. Midterm and Final, with an easy final if you do the paper.  3 easy problem sets.\n"
        },
        {
            "course_name": "Economics of Race in the U.S.",
            "review_date": "December 20, 2004",
            "review_content": "\nThis is a ridiculous class taught by a man who is clearly a brilliant economist but a poor professor. He has a good manner and is very nice, but he just can't seem to teach well. It's a shame too because the material itself is utterly captivating. But he has no ability to condense anything and has no desire it seems to teach as opposed to talk in front of us. The class is, for lack of a better term, everywhere. There's no textbook. But there are 3 coursepacks which are expensive and rarely utilized. Lectures are critical. His exams are annoying too. They involve a take-home and an in-class part. He grades arbitrarily it seems. Avoid unless you really love the material.\nWorkload:\n3 Problem sets (longish,graded on the check/plus/minus system), Midterm, Final. Midterm and Final have both take-home and in-class sections. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 11, 2004",
            "review_content": "\nhe is a nice enough guy, he tries and if you have nothing better to do you could show up to class and listen. i tried going to classes but i found them pointless as did 90% of the class. if you want a class to which you don't have to come to, take this class. i'm ok at economics and all i did was read the book and i did fine on everything. he uses weird examples that are way out there but do make sense. if you don't mind the sillyness, go to class and learn. \nWorkload:\none midterm one final and 6 problem sets\nnot much studying needed if you are half decent at econ\n"
        },
        {
            "course_name": "Economics of Race in the U.S.",
            "review_date": "December 06, 2004",
            "review_content": "\nI'm suprised at the polar opposite views expressed about \"Dan.\"  I was under the impression that the majority of students held the same kind of apathy that Dan himself seems to exude.  I guess I'm more confused by him than anything else.  Yes, he gets distracted easily, and the \"know-it-all\" students ask questions that eat up class time seemingly for the sole reason to discredit him and make him say, \"I'm just a dumb guy.\"  Which he says quite often.  Yes, his lectures are incredibly boring, and while he does use examples as another reviewer mentioned, in the class that I took they mostly concerned squirrels, his cat, or the homeless on the subways.  He has a bizzarre sense of \"humor\"-- I don't think of it as humor as much as maybe a social disorder.  It is entertaining, in a kind of disturbing way.\nI will say that the lectures got increasingly better as the semester went on.  It seems that he just takes awhile to get going, spins his wheels for the first couple of weeks.  He really knows his stuff, and does seem to be a genuinely caring educator-- but his ability to teach seems hindered by his quirky social ineptitude.  \nWorkload:\n3 problem sets graded by check-minus, check or check-plus.  Problems sets are easy, but also really, really confusing.  Semi-hard midterm, all the information is given in lectures, it's just that his lectures are so discombobulated the only way to find the information is after the midterm to go back through your notes, (if you happened to write down every single thing he said.)   8-10 page paper (optional) if you write a paper there is a ridiculous final (basically just so you'll show up to lectures post mid-term) and if you don't write a paper, there is a final akin to the midterm.  Dan's response to student's questions about grading?  There is a long and complicated log in the syllabus, or as he puts it, \"What you do really good on will be counted positively toward your grade, and what you do bad on, not so much...don't worry it's standard econ-elective distribution...\"  Ummm, yah.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "November 17, 2004",
            "review_content": "\nHe seems like a nice guy. He tries to make jokes in the class (most of which are about how everyone falls asleep in his class)... however, he can't teach. I had to take his class because one of the classes I had was overlapping with Mr. Gulati's.\nIf the same applies to you, then simply do not take this class this semester.\nWorkload:\nMedium. Problem sets every week, and about 7 problems each set. 1 midterm and final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "October 21, 2004",
            "review_content": "\nCome on, everyone knows Econ dept in Columbia is the worst and hardest and don't even mention the department administrators and the MAJOR REQUIREMENT!!!!\nDan is the  only fun person in the department (I  have rights to say so coz I am a senior Econ major, don't ask how much I have been though....) anyway, take his classes as many as you can, coz if you want to major in econ you already got loads of dump work to do, only smart pleasant teacher is this guy after all. ( Yes, there are famous guys nobel prize winners in the dept., but as an undergrad, you will NEVER get a chance to experience their classes, they only teach like business school seminars with 20 people limits, what the ****.) So, at senior year as a econ major, I tell you the truth, if you have to take any econ electives, take with Dan, because, others are worse, much much WORSE...believe or not, you try them all yourself...\nWorkload:\nMuch less works than others in Econ dept.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "September 17, 2004",
            "review_content": "\nO'Flaherty was awesome, but he's not for everyone.  His lectures are really interesting and uses real life examples and statistics to make the class more interesting.  But listen up all you screwballs who think you can go to class and not read the book (or vice versa), you cannot do that in this class becuase the lectures go above and beyond the book and you will not be able to follow the lecture as well if you havn't read the book.  If you're not that into economics or if you're a SEAS kid just trying to satisfy your principles requirement, don't take this class.\nOh, and if you don't go to class, read the book, do the problem sets, or go to the discussion section, don't be surprised when you get a bad grade.\nWorkload:\nNot too bad, easy (but long) problems sets, midterm and final (both a little tricky)\n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "May 04, 2004",
            "review_content": "\nI'm SO surprised that a bunch of  'economics' majors didn't enjoy Flaherty's class.  If all you're interested in is working for Goldman, don't read this review.\nFor those of you that actually are interested in economics, this class is interesting but with faults.  Urban economics is a discipline that's very different from most economic fields; it focuses on the economics of personal incentives, and attempts to build small scale models about interactions inside a city, such as traffic ongestion, land prices, crime, etc.  It's an intersting approach to a lot of topics that you will not find anywhere else, and a break from highly developed models in other courses, like macro.  \nFlaherty himself is entertaining, but can often descend into trivialities that make lectures semi-painful.  The textbook is horribly unconcise, written by Flaherty himself, and he needs to learn how to consolidate his thoughts. But his openness creates genuine class discussion even in a lecture, and at no point does he attempt to declare orthodoxy or force truths onto you.\nIf you have even a mild amount of intellectual curiosity, you will enjoy this and it's not a difficult course. \nWorkload:\n4 problem sets, fairly easy(grade with a check).  Midterm and final; optional paper gives you a reallly easy final.  \n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "May 02, 2004",
            "review_content": "\nIf you're looking for anything related to economics (or anything containing logic, or thought) then this class is the BIGGEST WASTE OF YOUR TIME.  a dash of polisci, a bit of psych, a crapload of unimportant data... and if you try to escape from the deathly boring lectures, there's a surpirse in store: the text is o'flaherty's own ridiculous unfinished work, which is as bumbling and ignorant as lecture.  and what kind of class allows you to \"make up\" any answer to the homework?  what is this, second grade? spare me.\nWorkload:\n4 problem sets (go to the TA sessions, theyll give you the answers); midterm unrelated to anything (take home + in-class); optional paper; final (take-home + in-class)\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "April 29, 2004",
            "review_content": "\nThe O'Flaherty bashing has gotten ridiculous. All the complaining done by the past reviewers seems effected by the notion that the intro Econ course should be easy. I hear kids who didn't do the problem sets, didn't go to lecture, and didn't go to recitation complain that O'Flaherty did a crappy job. That's just bullshit. The book and recitations taught the course. O'Flaherty offered his own interesting insights and real-life examples on the current topics taught in the weekly reading. Of course, he assumed that kids had actually done the reading and thus didn't teach the fundamentals the book went over. Indeed, if you hadn't done the reading you didn't have a clue what was going on in lecture. In other words, if you keep up with the work you will do fine in the class and get a decent introductory understanding of economics.\nWorkload:\nProblem Set every week, Midterm, Final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "April 19, 2004",
            "review_content": "\nWow, this was far and away one of the worst classes I have ever taken in my life.  O'Flaherty is not only bumbling and disorganized in every sense of the word, he is also obscenely boring.  His has an unbelievably dry sense of humor that matches his unbelievably dry teaching methodology.  He does not prepare you at all for the midterm or final -- he does not highlight any particular area of the textbook, and therefore you simply end up guessing at what to study.  The multiple choice questions on the midterm and final end up being sheer luck.  You will not know what grade you have at any point during the term - he will keep you in the dark and then spring a random grade on you faster than you can say JP Morgan Chase.\nWorkload:\nLots of reading if you choose to do it.  One midterm, one final.  \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 21, 2003",
            "review_content": "\nHoly John Nash, this has to be the worst course at Columbia.  O'Flaherty is a nightmare, and not just a nightmare, but a really bad one.  The one where you wake up in a cold sweat and it bothers you for a good week, recurring night after night, plaguing your life.  He and his sorry excuse for a class ruined my semester and view of econ.  His lectures are irrelevant and confusing.  I had taken econ in high school and he successfully confused me on stuff that I aced on the AP.  The T.A. I got was a mess too.  He could barely speak english and was obviously very smart, but lacked any and all ability to teach.  If you want to go into econ, DO NOT take principles with O'Flaherty.  It'll be the worst mistake you've ever made.\nWorkload:\n8 problem sets (two optional), midterm on micro, final on macro.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 19, 2003",
            "review_content": "\nThe Econ dept. at Columbia isn't as good as some of the other dept.s here, and Dan makes this pretty clear.  His lectures were pretty bad, and although he tried to make funny jokes and explain things from a logical perspective, he often ended up saying next to nothing in lectures.  Sections were VERY helpful, I didn't read most of the book and still got an A in the class bcs my TA was so helpful and organized.  Not that it really matters who you have for Principles, but Columbia people will be disappointed by Dan.  He let's too many people ask questions in class, which are mostly stupid and designed only to outsmart him, and ends up wasting time dealing with these stupid questions.  I'm sure he's a nice guy and very smart, but I'm honestly not very interested in Econ after taking his class. Thumbs down.\nWorkload:\n7 easy problem sets, midterm, pretty-hard final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 16, 2003",
            "review_content": "\nI was considering being an econ minor before this class.  I don't understand why Columbia continues to allow this man to destroy economics for eager students.  Flaherty seems like a nice guy, and I'm sure he does an excellent job teaching the higher level courses ('cause he really does know the material) but I mean please people, Principles should not be taught this way.  Flaherty took a whole (boring) class period to explain why the demand curve slopes downward, but then glossed over important issues like monetary policy.  His strange sense of humor popped up on the tests, but the questions tended to be rather tricky and not at all straightforward.  So both learning and getting a good grade are a gamble with this guy.  Stay away!  He seems nice, though.\nWorkload:\nVery reasonable.  One problem set per week, midterm and final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 04, 2003",
            "review_content": "\nI liked the material in principles, but O'Flaherty was a major disappointment.  His lectures always took one of two bad paths, the second worst than the first.  In the former case, he would lecture on situations to which the material in the textbook could be applied without mentioning the textbook material directly.  These lectures were informative, but became hopelessly stalled by frivolous questions from people who couldn't understand the lecture because they didn't do the reading from the textbook.  O'Flaherty would sometimes spend 20 minutes repeating the same point when answering questions from these people.  In the latter case, he would simply repeat the material in the textbook and still repeat himself several times in response to frivolous questions from non-readers.  These lectures were a waste of time, pure and simple.  If you're going to take Principles and are serious, avoid this guy because the lectures never turn out very well.\nWorkload:\n7 problem sets, midterm, final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 01, 2003",
            "review_content": "\nWhen I say that Dan O'Flaherty is the worst teacher I have ever seen, you will probably think that I am exaggerating, or that he hates me for some reason, and I am just trying to get back at him.  Neither of these are the case.  I'll provide a couple of examples for you all, so that you don't make the same mistake I did.  In one class (on exchange rates, I believe) Dan was drawing graphs on the board to demonstrate a point, then, realizing he was wrong, looked back at what he had drawn.  He then tried for at least a couple of minutes to sort out his mistake, but could not.  He ended up asking the TAs for help.  Also, Dan has a theory about how to structure toll systems so that there will be no waiting time.  Basically the amount of the tax would be in a pyramid: lower and lower as you get further from the peak of rush hour in either direction (which is somehow economics........)  This theory of Dan's, which had little bearing on the rest of the class, took up an entire lecture, an entire problem set, and half of the long answer questions on the midterm.  The only good thing about this class was the size.  Because the class was gimongous, I could walk out at any time and Dan would still never know who I was.\nWorkload:\nThe workload is not incredible, but the problem sets are quite difficult and there is one every week.  There is a lot of reading as well...though most is common sense.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "September 01, 2003",
            "review_content": "\nAbsolutely the worst professor in the department. He is a very monotonous and boring lecturer, his jokes are lame, and he constantly will talk to the class about his cat.  It is not surprising no one shows up for class, and don't forget that his final will contain questions on his cat's birthday!\nWorkload:\nWeekly graded problems sets, strange midterm, strange final\n"
        },
        {
            "course_name": "Economics of Race in the U.S.",
            "review_date": "April 30, 2003",
            "review_content": "\nThis is one of those econ classes that have \"real world\" value to them as opposed to abstract theories and equations that only deal with \"ideal situations.\"  Professor O'Flaherty mixes anthro, history, and legal policies with economics, and you walk away from the class feeling that you've actually learned the material (even if you don't do ANY of the reading).  His lectures are sometimes monotonous, but mostly interesting, and he tries to keep the class interested by throwing in his quirky jokes, making deliberately un-pc comments, and encouraging class discussion on controversial topics.  I had no idea what to expect at the beginning of this class, but having finished, I would recommend this class to everyone.  \nWorkload:\n3 problem sets, an easy midterm and your choice of an easy final or really easy final if you write a paper\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "April 21, 2003",
            "review_content": "\nThe first class, he started talking about short people.  The second class, he played country music at the end of lecture.  He's definitely a quirky guy.  I'm sure he'd be interesting to talk to, but the lectures bored me to death.  I stopped going after the second week.  Sometime in the second half of the semester, I started feeling guilty, so decided to give him another chance.  Admittedly, the lecture had more content and was kind of interesting, but still was not enough to convince me to go.  The last few, where he gets on tangents sometime, are okay.\nRecitations are required, and one problem with that is GRADE DISTRIBUTION IS THE SAME WITHIN EACH SECTION.  This means if you're stuck with 2 or 3 dorks who make econ their ENTIRE life, it'll be hard to get a top mark.  This doesn't mean the class is hard though; reading the textbook and going to recitation should be enough.  Just go to the very last lecture, where he makes a list of all the topics that are on the exam.  People ask, and he goes over, just about every topic that's not in the book.\nAnother warning, if you want to continue in Econ, this might not be the right intro class to take.  Significantly less material is covered compared to other Principles classes.  This makes for an easier class, but you're put at a disadvantage later on because you have to learn concepts other people have seen before.  Dan's philosophy is to teach this class assuming that most people won't take another intro class, so he wants to 'instill you with an appreciation of econ' or something, but doesn't expect you to major in it.\nWorkload:\nWeekly problem sets, midterm and final.  All easy.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "March 31, 2003",
            "review_content": "\nPlease, Dan is a nice person, funny guy, and intelligent scholar. How can anyone says negative things about him!\nI like the class very much and decided to major in Econ since then. \nI mean, those who blame Intro-econ level professor, must be very incapable of learning econ as a subject, coz with normal IQ and common sense, Principle is really damn easy and fun class!\nWorkload:\nwork for smart cookies, none; for ....., do the weekly probsets and read the whole book lol\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 16, 2003",
            "review_content": "\nO'Flaherty made a wonderful success of a very difficult job in this course. He was witty, personable, and very rarely boring in a huge lecture with over 200 students. The material was pretty basic, with many students knowing most of it from high school economics, but O'Flaherty avoided being boring by focusing on real life implications of concepts, rather than on dry technical definitions. The class does see the supply and demand graphs a few too many times, but perhaps the emphasis is warranted.\nWorkload:\nSimple problems sets every other week or so handed in at recitation. The tests were relatively easy, and each student was allowed one sheet of notes.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 27, 2002",
            "review_content": "\nThe lectures are sometimes interesting, and prof. O'flaherty does his best to make them enjoyable. The recitations would be helpful if I didnt feel like something new was taught everytime.  The readings, the lectures, and the recitations all seemed to cover three somewhat similar but yet very different topics.   I still dont understand the grading system but i dont think it matters much.  I didnt do great on the midterm and the final I found very hard (and can't imagine I did well on) yet my grade was rather good.  I think this is a class where 'things just work out in the end\" .  Warning though if all this info is new to you, you may be a bit screwed; most of the students have already taken econ in some form (high school.. another class etc...) and it seems your graded based on your rank within your recitation.  So find a recitation with the fewest amount of students who already know their stuff ( they're easy to spot they'll be the ones arguing wih the TA's on the first day of class, and constantly asking questions with no relevence to the material) and you shouldn't do to bad.\nWorkload:\nIs an intro course so if you've already taken econ... sleep through it... if not your gonna have alot to study if your really want to learn the material.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 25, 2002",
            "review_content": "\nNo matter what everyone else says, Principles of Economics can be a pretty challenging class if you've never taken an econ course before. Prof. O' Flaherty is a pretty good professor in trying to keep the course interesting in that he will teach concepts outside of the boring text. He is also understanding about grades.\nWorkload:\nProblem sets, midterm, most of the weight is on the final (55 points)\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 24, 2002",
            "review_content": "\nHe's a smart guy, but he can't teach Principles. He taught many things not in the book that were fairly complicated. You'd have to listen very carefully during the boring lecture to get the specific questions that he would ask on the exams. I basically couldn't keep my eyes open during any of his lectures\nWorkload:\n1 problem set a week, midterm, non-cumulative final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "November 19, 2002",
            "review_content": "\nO'Flaherty is a good, though unspectacular. O'Flaherty's lectures are fairly dry; he has his own sense of humor that is entertaining, though not funny. O'Flaherty himself will entertain any and all relevant questions; he will always have the answer, and will simply give it to you- no compassion, no smugness, just information. If you are interested in Economics, you will find several lectures interesting and to your liking. If you don't like the course, you never have to go to lecture. Either way, it shouldn't be too taxing for your schedule.\nWorkload:\nWeekly problem sets, an easy midterm, final\n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "March 31, 2001",
            "review_content": "\nI have skipped more of this man's classes than any other professor at Columbia, and the ones Ido attend, i usually need a crossword puzzle or two to keep me conscious. However, If you wanna learn how many cars can fit thru the lincoln tunnel during rush hour, this is the class for you. Other than that, there are a few interesting topics, but mostly obscure ones. Corny sense of humor, enjoys his own jokes, so just humor him.\nWorkload:\nThree pretty tough problem sets, easy(ish) midterm, and final or final paper. A LOT of reading. I repeat, A LOT of reading.\n"
        },
        {
            "course_name": "Urban Economics",
            "review_date": "December 31, 1999",
            "review_content": "\nNot the most profound of lecturers but he knows his shit down cold. If you're interested in what he's teaching, then you'll like the job he does teaching it.  He won't inspire you in the least, but he won't ruin things for you either.\n"
        }
    ]
}