{
    "prof_info": [
        {
            "prof_name": "Eleanor Johnson",
            "prof_id": 9596,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "British Literature to 1500",
            "review_date": "May 20, 2015",
            "review_content": "\nWonderful course taught by a wonderful teacher. Professor Johnson is absolutely one of the best instructors I have had the opportunity of learning from. She is a bit eccentric, which allows for her passion of the texts to come through all the more clearly. And her passion is phenomenal, you can tell she must have read the texts numerous times, an example of her depth of familiarity became obvious when she sent out conflicting e-mails about which text to read for a certain day, so most of the class read a different text than the one she had been expecting to lecture on, she hadn't even brought a copy of the text most people read to class. After someone pointed out her mistake, she stopped and switched into lecturing on the other text, going entirely from memory. Though she is brilliant, she also is incredibly personable and very very willing to meet outside of class, even though it seems like she must be really busy with other commitments. She isn't like some professor's who take forever/never respond to e-mails, she will respond to your questions and make time to meet with you if you like. Like other reviews have pointed out, she is also great at pausing for questions, you can tell she loves to hear what the students are thinking about. I believe another professor usually teaches this course and Prof. Johnson won't be teaching next year because she will be on maternity leave, but if you can fit a section of this course with her as the professor into your schedule, you will not be disappointed.\nWorkload:\nPretty light I thought, You write a 5-7 page paper and a 10-15 page paper, though she says she doesn't actually care that much about the length, as long as the two papers at least meet the minimum 5 full or 10 full pages, the length beyond that is up to you, for instance you could write a 10 and a 20 page paper. Midterm and final are the same format, ID short passages from the readings covered thus far. Give the title, author, genre, contextualize the passage within the larger work as a whole and then do thematic and stylistic analysis of the poem (and they are all poems). I didn't really study that much or spend too much time on the papers (both were written pretty much the night before) and I ended up with an A in the class so I wouldn't say she is that harsh, but I went to every class meeting. This is an important point, you must go to class because she will take attendance. The really big threat to your grade in this class is if you  get lazy and don't go, your grade automatically drops so after two absences the highest grade you can get is an A-. \n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "May 04, 2015",
            "review_content": "\nTake this class! It's not as if Professor Johnson needs any more praise, but she definitely deserves it.  A really engaging lecturer, absolutely hilarious commentary on the texts you're reading, and so very knowledgeable about the field in general.  This course is great -- a lot of really interesting texts (Beowulf, Sir Gawain and the Green Knight, some Canterbury Tales, etc.) and even if you've already read some of these Professor Johnson will absolutely teach you something new and provide really insightful and interesting information.  The syllabus also includes poems you've almost definitely not read previously, but they're great and Professor Johnson obviously loves them and will make you love them as well.  The lectures are so organized and easy to follow -- she will basically walk you through the poem from start to finish and make sure everyone understands what's going on (which is sometimes difficult, especially with the texts read in Middle English).  She also makes sure to take time to pause at various points throughout the lecture and take any questions students might have, which is great because it adds a slight discussion aspect to the course. \nWorkload:\nWeekly reading, one 5-7 page paper, one 10-15 page paper, midterm (or weekly discussion section), and final.  I did the midterm option because the discussion was on Friday when I work, and I would definitely recommend it.  Very straightforward -- all IDs for which you provide analysis. She's not looking for anything specific, so you can really talk about whatever you want about the poems.  For the final we got to vote on a) all IDs again b)combo of IDs and essay c) just an essay and we voted for all IDs.\n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "May 04, 2015",
            "review_content": "\nTake this class! It's not as if Professor Johnson needs any more praise, but she definitely deserves it.  A really engaging lecturer, absolutely hilarious commentary on the texts you're reading, and so very knowledgeable about the field in general.  This course is great -- a lot of really interesting texts (Beowulf, Sir Gawain and the Green Knight, some Canterbury Tales, etc.) and even if you've already read some of these Professor Johnson will absolutely teach you something new and provide really insightful and interesting information.  The syllabus also includes poems you've almost definitely not read previously, but they're great and Professor Johnson obviously loves them and will make you love them as well.  The lectures are so organized and easy to follow -- she will basically walk you through the poem from start to finish and make sure everyone understands what's going on (which is sometimes difficult, especially with the texts read in Middle English).  She also makes sure to take time to pause at various points throughout the lecture and take any questions students might have, which is great because it adds a slight discussion aspect to the course. \nWorkload:\nWeekly reading, one 5-7 page paper, one 10-15 page paper, midterm (or weekly discussion section), and final.  I did the midterm option because the discussion was on Friday when I work, and I would definitely recommend it.  Very straightforward -- all IDs for which you provide analysis. She's not looking for anything specific, so you can really talk about whatever you want about the poems.  For the final we got to vote on a) all IDs again b)combo of IDs and essay c) just an essay and we voted for all IDs.\n"
        },
        {
            "course_name": "Chaucer",
            "review_date": "May 22, 2014",
            "review_content": "\nTechnically this class was called The Canterbury Tales (Fall 2013), but whatever. Class title speaks for itself, this was a course on the entire Canterbury Tales, where we would read one tale for each class. You read in Middle English, but she provides this line-by-line online translation to follow along in the beginning until you get the hang of it.\nELEANOR JOHNSON IS INCREDIBLE. I have taken basically all the big name profs in the English department and I have to say she is one of my favorites... if not my favorite. She combines all of the best qualities of professors: (1) knows her shit and is an amazing, super engaging lecturer (2) super enthusiastic, approachable, and kind (3) cares about undergrads (case in point: she learned everyone in our lecture's name and face. she made taking attendance fun! she held marathon office hours before each paper was due so that anyone who wanted to talk to her could. I talk about Prof. Johnson in all my tours because she is what I think a prof of undergrads should be like.) (4) not at all arrogant. And basically every other good thing you could ever say about anybody. I can honestly say I have never had a professor who has ALL of these qualities. Usually you have a prof who is like, super smart and engaging but completely unapproachable, or whatever. She also has great fashion sense. And! I think her teaching style is adaptable in that like pretty much everyone I know who has taken her loves her. She's not polarizing, like you either love her or hate her... you seriously just love her. \nThe reading is great, if you're at all interested in Chaucer, and even if you're not, Chaucer's work is pretty foundational and can be related to tons of other writers (like Shakespeare). The Canterbury Tales is some of Chaucer's best (in my opinion, but definitely most well-known) work and most of the tales are enjoyable reads. Even if you don't enjoy the reading that much, Prof. Johnson's lectures are an absolute joy to be in.\nI didn't take a section because I couldn't, but her exams are pretty straightforward so I'm actually glad that I didn't. She's a generous grader on exams, harder on papers, but still fair. Take this class, seriously. Take all her classes. Also, go to office hours. She's so wonderful. \nPS Dear English dept, if you are reading this, I expressed this in office hours once and Prof. Johnson said I should mention it if I ever write a review for any English prof: please consider offering more lectures! I've noticed that there are more and more seminars being offered each semester at the expense of lectures which sucks because I actually prefer lectures to seminars (might be in the minority here but we are still a constituency!). I LOVE lectures. I feel like I get more out of them, at the end of the day. And Prof. Johnson is one of the best lecturers at Columbia.\nWorkload:\n2 papers, 1 shorter, 1 longer\n1 midterm, or a 50 minute discussion every week\n1 final\nreading for each class (one tale)\nI forget the grade breakdown exactly but I think it's like... 25% first paper, 35% second paper, 20% midterm, 20% final? I feel like that's not quite right but it's something like that.\nalso she takes attendance every class, but there's no reason you should be skipping anyway. \n"
        },
        {
            "course_name": "Chaucer",
            "review_date": "January 25, 2014",
            "review_content": "\nBy the end of the first week of classes, Professor Johnson knew the name of everyone in a 90-person lecture. Professor Johnson's commitment to knowing each of her students is a testament to her mastery and zest for teaching. Canterbury Tales is an excellent class that every English major--and to be honest, every undergraduate--should take.  \nWe read a Canterbury tale each class in the original language and ended up studying Chaucer's masterpiece in its entirety, which according to Professor Johnson is quite rare in an undergraduate class. Though some tales may appear uninteresting at first, Professor Johnson's extraordinary lectures and analysis bring them to life, shedding light on Chaucer's genius. Most tales, however, are incredibly witty, clever, and funny; Chaucer isn't considered the father of English poetry for nothing. The tales' language (in Middle English) may seem complicated at first, but after a few classes, will be easy to read.\nAll of the lectures were fascinating, as Professor Johnson shifts seamlessly between analyses of Chaucer's language and broader discussions of medieval philosophy, literary theory, history, and culture. Professor Johnson is absolutely brilliant, able to conjure up etymologies, dates, and answers to the most esoteric of questions in mere seconds! Indeed, in my 3.5 years at Columbia, I have never seen a professor deal so effectively with student participation, not just answering everyone's questions, but also contextualizing the answer sufficiently so that each of her responses became interesting to the entire class.\nProfessor Johnson is also incredibly helpful in office hours and REALLY cares about teaching undergraduates. Whether you are a Middle Ages fanatic, an English major trying to fulfill your pre-1800 requirement, or pretty much any student looking to hear Columbia's best lecturer twice a week, take Canterbury Tales!\nWorkload:\nYou read approximately 1 tale per week, which vary in length.\n1 short paper, 5-7pp\n1 longer paper, 8-12pp\nYou can choose between a weekly discussion section or a midterm (which consists of 6 out of 8 IDs)\n1 final exam consisting of either 10/12 IDs or 6 IDs and an essay (your choice!)\nAll very fairly graded. As long as you do the reading and attend lecture, the IDs should be a breeze.\n"
        },
        {
            "course_name": "Visionary Dramas and Dramatic Visions",
            "review_date": "November 04, 2012",
            "review_content": "\nAs others have said, Visionary Dramas and Dramatic Visions was a fantastic class, and Professor Johnson is an amazing professor.  This class was a perfect mix of interesting material and great teaching.  \nFor those without a background in Lit/Medieval texts:  Don't be scared away; take this class!  Medieval texts can often be boring at first glance, and many teachers have trouble showing students that they are actually bawdy and exciting, while dealing with deep philosophical/theological issues.  Prof. Johnson has an amazing ability to show the interesting side of every text and to make each become a window into the Medieval world.  The beliefs, concerns, interests, and believe it or not, jokes of the each author comes through loud and clear.  If you are at all interested in literature, history, humor, or humans, take this class. \nFor those interested in Medieval:  It's a no brainer...  There are too few Medieval Lit courses as it is, so why would you pass on such an awesome one?\nLastly: go to Professor Johnson's office hours!  She will teach you how to write.  I know, I know, you already know how to write.  I promise you, though, that you will come out a much better writer if you ask Prof. Johnson for feedback/criticism. \nWorkload:\nAs stated below, pretty usual for an English lecture.  Readings are mostly in Middle English, but you get the hang of it quickly.  It's especially doable if you know any French or German.  There is a midterm, a final, and two papers.  If you do the readings and go to lecture, you'll be fine. \n"
        },
        {
            "course_name": "Visionary Dramas and Dramatic Visions",
            "review_date": "September 16, 2012",
            "review_content": "\nNice things about Eleanor Johnson can't be repeated enough, and I agree with everything below about how awesome she is. \nMore specifically VDDV: I went into the class for the professor (as did 95% of the room) and ended up some how really liking the material. Somehow, Prof. Johnson made people want to come talk about 12th century god writings for 75 minutes twice a week. She runs the class well, her enthusiasm is clear and infectious, and she will make every text sound like it is the most interesting thing ever written. She's pretty aware that everyone loves her, so she did a lot to make us stick with the texts  (in-depth review sessions before the midterm and final were particularly nice) and actually get something out of them. \nTL;DR: You would want to take this class if it didn't fulfill the distribution requirement for the English major. The fact that it does is just icing on the cake that is a class with Johnson.\nWorkload:\nPretty standard for an English class. The Middle English might be an adjustment (it was for me) but you'll get used to it. For papers, Prof. Johnson will work through your whole topic with you, and the final was VERY reasonable.\n"
        },
        {
            "course_name": "Visionary Dramas and Dramatic Visions",
            "review_date": "May 14, 2012",
            "review_content": "\nMy experience of Professor Johnson was pretty much exactly the same as everybody else's. I am quite neurotic about my GPA... I got a B+ in this class, my lowest grade at Columbia, and I'm still completely thrilled with the experience. I'm not an English major, so some things which some students may have found easy were challenging for me. That said, I don't think this is an easy class by any standard, so you can rest assured that the amazing reviews for Eleanor Johnson don't derive from unusually lenient grading. I would not describe the grading as harsh either, it seemed pretty fair. \nThe TA, Emma, was wonderful. Her comments on papers were very clear and helpful, and she created an encouraging, fun, and always on-topic learning experience in her (optional) section. \nProfessor Johnson herself manages to make every text seem like the most important text in the history of the language. Her lectures are really thrilling and high-energy. She's also very approachable, and responds almost immediately to emails containing insights, thoughts, and questions about the material. She is encouraging, and loves to help students take interesting if unfocused paper ideas and focus them into provocative topics which result in meaningful work. \nThe exams are straightforward, and she reviews thoroughly before the midterm and final, in class.\nWorkload:\nChallenging readings, in Middle English and occasionally in translations. \nMidterm, final, one short paper, one long term (approx. 10 page) term paper.\nOptional section, but you should go whenever you can. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 03, 2011",
            "review_content": "\nProfessor Johnson is absolutely the best teacher I've ever had. I've been wanting to wait until the end of the semester to write this review, but the sheer magnitude of her awesomeness compels me to write it sooner.\nFirst of all, she is incredibly brilliant and well-versed in just about everything you could possibly hope to study. On the enormously rare occasions that she is wrong or blanks, she demonstrates a level of humility that you would never expect from someone of her intellectual prowess.\nIf that weren't enough, she is hilarious and will make you crack up just about every class. She truly makes the texts come alive with witty and well-timed jokes and extremely insightful references to contemporary culture. It seems like she truly wants each and every student to understand and to succeed and is a member of that rare breed of teacher who legitimately will dedicate time outside of class to helping you.\nMuch has been said of the contribution she makes to your writing. I could not agree more. She's really taught me an important lesson in argumentative writing, and I am sure I think back to what she taught me for years to come.\nIn summary, if you pass up the opportunity to take a class with Prof. Johnson, the angels will weep for you and bad things will happen. \nWorkload:\nStraightforward midterm\n2 papers per semester (she grades harder 2nd semester--but she gives you important criticisms)\n1 to 2 group presentations per semester (just do your work and you'll be fine)\nFinal (plus her really straightforward supplement on the extra works she adds)\n\n"
        },
        {
            "course_name": "Medieval Stoic Autobiography",
            "review_date": "May 09, 2010",
            "review_content": "\nWow. I really cannot put the unparalleled awesomeness of Eleanor Johnson into adequate terms. Professor Johnson was by far my favorite professor in the 4 years I've spent at Columbia. She is enthusiastic, talented, has an encyclopedic knowledge of all things medieval (in the best sense, of course), and, most importantly, is really funny. It's rare that a 4-credit seminar on Medieval Stoic Autobiography would be seen as \"hilarious\" and a \"good time\" but I found myself looking forward to it each week, and actually enjoying the readings (even in Middle English, ack!). It also helps to have a professor so enthusiastic about the texts... her love of medieval literature is certainly contagious, and I started off taking this class just to fulfill the pre-1800 pre-requisite for the English Department!\nThat said, Professor Johnson is no pushover, and is not the kind of professor to hand in poorly-formulated papers you wrote in the past 3 hours. She makes you WORK for the A, but it's definitely attainable (albeit with more than a few necessary all-nighters). But after that hard work, I can honestly say that her feedback was worth more than my first three years with the English Department combined, and she has a serious knack for helping undergrads with paper-writing. I cannot recommend her enough.\nWorkload:\nhefty (but usually enjoyable) readings, 1 short 5 page paper, 1 midterm 8-page paper, and 1 long seminar paper (15-20 pages). Appropriate for an English Department seminar.\n"
        },
        {
            "course_name": "Chaucer",
            "review_date": "January 12, 2010",
            "review_content": "\nWow! Sort of a lame way to begin a review, but I wasn't sure how else to convey just how enthusiastic Professor Johnson is, not to mention insightful.\nI've always been an English lit type, but even I was more than a little apprehensive about taking a course in which the class would be reading every single one of the Canterbury Tales. Professor Johnson, however, immediately drew us into the text, both with her eye-opening dissections of individual tales and, even more importantly, with her ability to weave the storylnes of the Tales together while also connecting them to the Medieval milieu from which they sprung. This made the class not only one of the better lit courses I've taken, but also a fascinating historical review of Chaucer's England.\nProfessor Johnson is really wonderful. As much as we enjoyed this class, she always seemed to be enjoying it more, even when expounidng on less interesting tales. Yet even her comprehensive lecturing style left plently of room for class discussion, only adding to the pleasantness of the atmosphere.\nHighly recommended.\n\nWorkload:\nUsually a tale between classes, except for the longer ones (The Knight's Tale) or the longsome ones (The Parson's Tale's) which are broken up or deemphasized. Two papers of moderate and unfixed length, a pop quiz or two to keep you sharp, a midterm, and a final. If you read the tales, or even if you just pay attention during discussion (since it's so comprehensive), you'll have no issues.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 12, 2010",
            "review_content": "\nProfessor Johnson was my absolute favorite teacher for my first semester, and I truly cannot wait for the next! She is incredibly insightful, quirky, and totally passionate about what she teaches. It's not some convoluted, dry, and useless mess of information that she throws at us but clearly researched and thought-provoking. Discussion was never boring, and for a 9 AM class, I was surprised at how engaged I could be. Her background knowledge (most notably medieval) was definitely helpful with the dense and/or boring texts, and her willingness to help us outside of class with any problems we encountered at Columbia was awesome. I wouldn't say she's a \"tough\" grader (because that might have some negative connotations), but she's not easy; she's very fair though! If you pay attention in class (which should be easy) and actually read the texts, you'll be totally okay. I would definitely recommend her for any class she teaches.\nWorkload:\nThe usual. Whatever is on the Lit Hum syllabus, plus a few extra which are valuable and easy reads (The Bacchae, Philoctetes, and Song of Songs).\nA very fair midterm with analyses of identifications.\nOne 5-7 page essay\nOne 8-12 page essay\n(She gives topics to choose from, but you may also pick your own if you consult her. She'll let you rewrite ONE of the papers, and she's very adamant about helping with drafts. She even devoted half a class to helping us write better essays.)\nOne group presentation per semester. Pretty straightforward and easy.\nThe final exam which everyone else takes, except she was very concerned with the difficulty and helped us out by giving us more options from the extra texts we had read. And her reviewing was excellent.\n"
        },
        {
            "course_name": "Chaucer",
            "review_date": "January 06, 2010",
            "review_content": "\nProfessor Johnson is one of those professors at Columbia that you actually get excited about seeing twice a week. Quirky, brilliant, and engaging, she has the capacity to make an entire course in Middle English both fun and intellectually stimulating. She managed to dissect every single one of Chaucer's Canterbury Tales, and produce truly compelling and thought-provoking lectures for each. I initially thought the class would be utterly boring and recondite, but Professor Johnson is one of those rare individuals who has not only the immeasurable intelligence necessary to teach a difficult course, but also the down to earth personality and patience to make it manageable and enjoyable. While I can only assuredly speak for myself, I'm more than certain that everyone in my class enjoyed it [seeing as how everyone participated at least once over the course of the semester without being forced to do so]. What I also love about Professor Johnson is that she is passionate and dedicated to her subject matter [she tried coming to class the day she was told that she may be having an aneurysm] and she is incredibly open [in fact excited] to work with students. Every time I spoke to her outside of class, she was very open to discussing anything in general, and even gave me some advice on one of my Shakespeare essays. She is by far one of the best English professors I've had at Columbia, and I would highly recommend that you seize the opportunity to have at least one course with her [even if you absolutely detest Medieval literature]. \nWorkload:\nReading in Middle English is initially onerous, but it gets a lot easier after the first few tales\n1 Midterm comprised entirely of quotation identification [simple if you've at least followed along in lecture]\n1 Final Exam comprised of passage identifications and a short essay\n1 6-8 page paper\n1 8-10 page paper\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 28, 2009",
            "review_content": "\nProfessor Johnson is by far the best teacher I had this semester (my first), and one of the best teachers I've ever had. I came to every class full of anticipation, and left every class blown away. She's incredibly brilliant and can talk at length on any given subject. However, she's very humble and quite funny. Her comments are always insightful and open the texts in completely new ways. She's also an excellent moderator for class discussion. She always came prepared with interesting and stimulating questions for the class discuss, and integrated them seamlessly into class discussion.  She can take even the most dumb student comment and pull out nuggets of interesting ideas and opinions. This class convened at 9 AM, but I was never bored or tired, even on only a couple of hours of sleep. I came into Columbia confident that I wanted to be a Philosophy major, but because of her I've decide to major in English instead. I can't wait to have Professor Johnson for my second semester of Lit Hum, and I definitely plan to take classes with her again. Don't miss out on taking a class with her!\nWorkload:\nThe normal Lit Hum reading, plus 3 extra short works (Philoctetes, The Bacchae, and Song of Songs) which are very interesting and short. \n2 papers: one 6-8 pager and one 8-12 pager on topics she assigns, but you can pick your own topic. She's a tough grader, but fair, and her detailed comments really critique your writing, and teach you how to become a better writer. She is also extremely helpful in her office hours, and will help you flesh out your ideas and give direction to your paper. \n1 midterm: pretty easy and straightforward.\n1 final: The standard lit hum final issued by the core department. She thought the passage id's were too hard, and gave us an extra couple of easy ones from the extra texts we read, and an extra credit passage analysis.\n"
        },
        {
            "course_name": "Chaucer",
            "review_date": "December 19, 2009",
            "review_content": "\nI can't possibly hope to beat the eloquence of the previous review, but let me add my own two cents:\na) the above review is 100% correct. \nb) this is my third chance at taking a chaucer/middle english class at this school and i've dropped the other two because they sucked. i stayed in for Johnson. Not only that, but I think I actually love the Canterbury tales now...\nc) this might be the best english class i've ever taken at this school. (i am a senior english major) \ni have no doubt that any class she teaches will be informative, curiosity-inspiring and loads of fun. Don't be afraid of the whole medieval thing--she'll help you out when she thinks things are too hard and will totally make you as passionate for the material as she is.\nin summary: TAKE HER!!!\nWorkload:\nwhat the other reviewer said. she's a tough but fair teacher, but again, ITS WORTH IT!\n"
        },
        {
            "course_name": "Chaucer",
            "review_date": "December 04, 2009",
            "review_content": "\nProfessor Johnson just started this year at Columbia. Before I signed up to take her class on Chaucer, I contemplated taking a Barnard class also on the Canterbury Tales because her class was all the way in Knox Hall and honestly, that's just a far way to walk in the winter. When I tried to sign up for the Barnard class, the professor emailed me to take the class with Professor Johnson and said, \"Trust me, she is one of the geniuses of our age.\" He was right!\nProfessor Johnson is by far the best English professor I have had at Columbia. I think anyone, majoring in absolutely any subject, will end up liking the material she teaches because she is just so damn funny and intelligent and insightful. I'm pretty sure that everyone in our class adores her. What I like so much about her is that she doesn't take herself too seriously-- she doesn't show that she is this stuffy professor but rather admits that her insane amount of knowledge about the Middle Ages is, actually, pretty funny and dorky. Her openness about the subject allows for us to want to speak in class instead of feel intimidated that we'll get something wrong (as I've often felt with the professors in the English Department). \nWhether it is making us fascinated by even the most boring of Canterbury Tales or answering any of our questions (and we have a lot) with extreme patience and enthusiasm, Professor Johnson seems to have really found her calling in education. Whether it is offering advice on her office hours about how to read Middle English or even telling us that she is always available to talk to us about our career paths or even excitedly informing us about Medieval plays she likes in New York (and trust me, there actually are a few), Columbia and the English Department are lucky to have her.\nWorkload:\n2 papers (6 page then 10 page) essay on topics she assigns (though you are able to make up your own topic)\n1 midterm (graded fairly, just make sure you actually read the tales... it's a standard english midterm with passage ids)\n1 final (i have yet to take it, but i assume it will probably be like the final)\n3 pop quizzes (on stuff that she already covered in class)\n"
        }
    ]
}