{
    "prof_info": [
        {
            "prof_name": "Maulik Parikh",
            "prof_id": 2373,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "October 27, 2005",
            "review_content": "\nAgree he's bad at leading classroom discussion (esp outside of physics) but he's amazingly helpful & accessible during office hours.  Clearly loves the material, is super supportive, and clearly wants you to understand & enjoy the topics.  Frontiers has some general structural problems--the best way to get around this is OFFICE HOURS & the extra weekly Helfand group review sessions.\nWorkload:\nproblem sets are massive but interesting--start them early & work with a group.  Requires more math than the course description implies.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 11, 2005",
            "review_content": "\nA nice guy, but not the most interesting teacher. He seemed enthusiastic but never really had any insight into the topics. When someone finally did ask a question he would stubble through some incoherant explanation. He looks for specific answers to his questions, thus you must learn to think like him. Not the best, not the worst.\nWorkload:\nEvil problem sets every three weeks, weekly readings and questions ( reading were generally irrelevant), reasonable final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 02, 2005",
            "review_content": "\nMaulik is a nice guy but he is unable to explain simple concepts in a coherent way or foster any interest in the topics whatsoever.  It is obvious that he is a researcher and that he is not cut out to teach, especially since he was unfamiliar with most of the topics (brain & behavior, biodiversity, global warming, and astronomy) taught this semester.  I felt wholly unprepared for the final exam and was only able to complete the weekly work using guess-work and help from friends in the same discussion section.\nWorkload:\n+ mandatory weekly reading and questions (about 2 hours of work every week)\n+ tri-weekly problem sets (can be done in a group with others from your discussion section, about 2 hours of work)\n+ field experiments (either lame or enlightening, we had 2)\n+ a hard final exam (but thankfully, curved astronomically so everyone passes)\n"
        }
    ]
}