{
    "prof_info": [
        {
            "prof_name": "Brinton Tench Coxe",
            "prof_id": 1540,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year Russian I",
            "review_date": "June 11, 2009",
            "review_content": "\nTench is a rare & delightful man who genuinely cares about his students. He is absolutely hilarious &, despite the amount of hours you spend in class, the time will fly by. Like the best language teachers, he is a touch eccentric & really commits himself to being out there, grabbing your attention & engaging the class. He is particularly strong in preparing students for oral discussion, and by the end of the semester I felt so much more comfortable speaking Russian. He's an interesting guy with great stories that he is more than willing to share.\nI really can't speak highly enough of this man, if you have a chance, TAKE HIS CLASSES (whether film or Russian!)\nWorkload:\nLots of class time but the homework isn't bad, homework every day though\n"
        },
        {
            "course_name": "First-Year Russian I",
            "review_date": "December 12, 2008",
            "review_content": "\nTench is an excellent professor. He makes the class lively and really wants his students to do well. He explains the material in the textbook in a more interesting way and has the right balance of exercises about grammar and vocabulary, dialogues between students and other kinds of activities. You will learn a lot from him! Honestly he is a nice man who knows how to teach and you can tell prepares for each class. \nAs to the class itself, all the different Russian I sections have appointed test dates and at times they come in clumps with only a week between them. That makes for an intense class, and you have to do your homework, and there is homework for everyday. But, the good news about having tests regularly is that it makes it difficult to fall behind. You have to keep up, which also means less stress for the final.\nTake this class! You will learn a lot! \nWorkload:\n7 tests (1 at the end of each chapter), 1 hour of HW a night (every night), and 1 final\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 11, 2004",
            "review_content": "\nTench is a good guy, a fair grader, and an average teacher.  Don't be fooled by his black shirt, black jacket, black pants get up; he's not French, not gay, and not an existentialist chain smoker.  If you're an okay writer, meaning you have good grammar, okay composition, good flow, then you won't learn much, if anything, from this course.  Partially that's because the U.W. ciriculum/concept sucks a fat one.\nBottom line:  the course sucks, but you have to take it, and Tench has no real mean side, and I dont think he gives less than a B- for grades, so go ahead and take his section.\nWorkload:\nFour papers of varying size (1 5 pages, 1 8 pages, 1 12 pages and 1 three pages), a presentation (which is really a joke), and weekly readings and responses.  Grades do not count any weekly work, or class participation.\n"
        },
        {
            "course_name": "Russian II",
            "review_date": "March 31, 2003",
            "review_content": "\nTench ROCKS! All the Russian grad students great (I've had four of them as instructors), but I thought Tench was the best one of all. Really funny. Gets the material into your head. Not overly demanding (usually accepts late homework). Laid back. Not a know-it-all. \nTruly in it to help YOU, not to look smart. Well prepared (lots of pencil notes in his book - means he pre-read the chapters carefully. Not true of all the grad students). \nI find all languages boring, and taking Russian at Columbia is especialy demanding. Tench makes it all better.\nOh, he's in a rock band. I think he plays bass guitar. I'm a Tench fan. \nSecond \"Oh\", he plays cheezy Russian rock music in class for no real reason. Fun guy to take a class with, AND everyone learned a heck of a lot. No trade off between fun and learning. Tench ROCKS!\nWorkload:\nToo much, but it's not really Tench's fault. The syllabus is standardized across all sections. Took me about 2 hours a day, but I'm bad at languages. \n"
        }
    ]
}