{
    "prof_info": [
        {
            "prof_name": "Kimberley Johnson",
            "prof_id": 936,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Urban Studies",
            "review_date": "January 19, 2015",
            "review_content": "\nI took Professor Kimberley Johnson for URBS V1515, Introduction to Urban Studies. Professor Johnson is the chair of the interdisciplinary Urban Studies program (hosted at Barnard, but open to all Columbia College and General Studies undergrads as well), and is very knowledgeable on the subject. She kept lectures interesting with multimedia presentations, guest speakers, and a personal interest in the topic. At times the reading seemed overwhelming, but some of the readings were removed as the course progressed. Also, Professor Johnson was very good at succinctly reviewing the readings, so if there is something you didn't understand or get to, the lecture will fill in the blanks.  There were around 50 students in the class, so the discussion was limited, but Professor Johnson was always available after class or during office hours to discuss anything from the coursework to what other classes to take to pursuing Urban Studies as a major. Professor Johnson is not an easy grader (she apologized to the class for making the midterm more difficult than she had planned, then gave a final which was just as difficult), but there were opportunities for extra credit.\nWorkload:\nOne group project which included a group presentation and a 4-page individual report, one 4-page paper, in-class midterm, and in-class final, both of which will take the entire time to complete.  100-200 pages of reading per week.\n"
        },
        {
            "course_name": "Introduction to Urban Studies",
            "review_date": "January 19, 2015",
            "review_content": "\nI took Professor Kimberley Johnson for URBS V1515, Introduction to Urban Studies. Professor Johnson is the chair of the interdisciplinary Urban Studies program (hosted at Barnard, but open to all Columbia College and General Studies undergrads as well), and is very knowledgeable on the subject. She kept lectures interesting with multimedia presentations, guest speakers, and a personal interest in the topic. At times the reading seemed overwhelming, but some of the readings were removed as the course progressed. Also, Professor Johnson was very good at succinctly reviewing the readings, so if there is something you didn't understand or get to, the lecture will fill in the blanks.  There were around 50 students in the class, so the discussion was limited, but Professor Johnson was always available after class or during office hours to discuss anything from the coursework to what other classes to take to pursuing Urban Studies as a major. Professor Johnson is not an easy grader (she apologized to the class for making the midterm more difficult than she had planned, then gave a final which was just as difficult), but there were opportunities for extra credit.\nWorkload:\nOne group project which included a group presentation and a 4-page individual report, one 4-page paper, in-class midterm, and in-class final, both of which will take the entire time to complete.  100-200 pages of reading per week.\n"
        },
        {
            "course_name": "Metropolitics of Race and Place",
            "review_date": "May 22, 2014",
            "review_content": "\n***This is also counted as a political science class under the Barnard Political Science curriculum fyi.\nThis class was great. I learned a lot about urban theory, policy and practice. There is a lot of reading, but you don't have to read all of it because she goes through the readings in her lecture.There's no participation, it's mostly Prof. Johnson talking. Of course you can input questions or thoughts, but she covers pretty much everything. You start off learning about prominent urban theorists (The Chicago School), brief history of urban development in the U.S. and you also focus on suburban development. Additionally, you address multiple regions in the U.S. and look at different patters of cause and effect of urban/suburban development. All of this is to prepare you for your final project at the end of the semester and ensure you have great background knowledge to help ground your urban studies degree tract. It can be a bit boring at times, but for the most part, it's eye opening. \nWorkload:\nIt varies by year/semester depending on class size, but for us we had 2 papers (that vary in length depending on your analysis) that were worth 25% each and a 10-paper/presentation that was worth the remaining 50%. It seems daunting, but it's all analysis of the text/policies and she gives you a lot of time so there's no reason you should get anything below a B-, even if you procrastinate. \n"
        },
        {
            "course_name": "Power, Politics and Policymaking",
            "review_date": "May 08, 2011",
            "review_content": "\nI took Power, Politics, and Policymaking with Kimberley Johnson and she is one of the worst professors I've ever had.  Avoid her class at all costs.  I never like writing scathing evaluations of professors because they are people too, but she was horrendous.  She assigned a lot of reading that literally nobody did.  She is completely inarticulate and the lectures are word-for-word definitions of terms from the readings.  She is incredibly boring and I struggled to stay awake in her class.  Her assignments are unclear and she will not be around to help you with them or answer any questions.  I learned absolutely nothing--as it is now, this class should not exist.  She turned me away from PoliSci forever.  Really, do a favor for yourself and don't take her class.\nWorkload:\nas much as you determine it to be--a lot of reading that nobody, I mean NOBODY does.  One reading summary, a policy analysis, a presentation, a research paper, and a final.\n"
        },
        {
            "course_name": "Power, Politics and Policymaking",
            "review_date": "April 11, 2011",
            "review_content": "\nKimberly Johnson is one of the least articulate, boring, repetitive professors I have ever had. She cannot function without her power points and the majority of the class just does their other coursework during lecture. 15% of your grade is participation but the questions she asks are typically one-word, too-obvious-to-be-real responses. She assigns an unbelievable, impossible amount of reading--I gave up half way through the semester. That being said, her standards are unbelievably high for not explaining her prompts or the format of most of the papers. I was really disappointed in her teaching. Like another review before me, let me just say, this class should be called The American Bureaucracy. Even the interesting sections on crime and obesity politics are made boring by the long-winded, static lectures.\nWorkload:\nHuge, but I didn't do any of it. One paper, one in-depth research paper, an oral presentation, a policy memo, and a final exam.  \n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "September 15, 2010",
            "review_content": "\nJohnson is a fair, intelligent professor who makes her expectation clear and grades in a transparent, straightforward manner. Although she is bumbling at times and struggles with spelling, she teaches the material clearly and picks good readings. You may not look forward to lecture everyday, but she is a competent instructor who does her job well given the dull subject matter. She is also very kind and interested in the students. Getting a good TA helps so try to be placed well.\nWorkload:\nReasonable midterm/final, research assignment\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "November 18, 2009",
            "review_content": "\nIf you're debating taking Intro to American Politics and you see that Kim Johnson is the teacher, DON'T -- wait until a later semester to take the class.  Put bluntly, she is the worst lecturer I've had in three years at Columbia.  Her lectures have no overall organization other than the fact that she reductively summarizes the readings for that day, despite the fact that a.) the readings are so long they're almost impossible to do, b.) the TAs do the same thing during discussion section, and c.) it's evident that she hasn't read the readings in months -- she flat out gets things wrong much of the time.\nThat being said, you're not going to get a bad grade from the class, and if you do the readings independently, you will learn enough to take any higher-level American Politics poli-sci course.  But I'd hate to see anyone who's debating poli-sci or wanting to check it out take this as his or her first class.  \nWorkload:\nEASY -- two very simple written assignments, participation in discussion, and a midterm and final that are both a total breeze.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "April 11, 2009",
            "review_content": "\nI actually found Professor Johnson to be a great professor. She is definitely a really busy woman, but she was always willing to speak with me about anything after classtime.  She was also a great resource, giving me suggestions for summer internships based on my interests.  The class wasn't that difficult, but it's an intro class, so what are you expecting?  And I thought she did more elaboration of the power points than reading straight from them.  I actually really liked how she used the power points; I think they kept her on target and prevented her from going on rampages like other professors tend to do.\nIt's definitely a class for the self-motivated; you get out of it what you put into it.\nI definitely recommend taking this class, I really enjoyed the class!\nWorkload:\nNot too bad, definitely doable for all classes.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "January 10, 2009",
            "review_content": "\nI took this class as my first real Poli Sci class at Columbia and BLAH! Prof. Johnson is a super nice woman, seems really smart especially in the area of American Politics but god her teaching style just put me to sleep. She prepares powerpoints for every lecture and basically just goes through the powerpoint and elaborates. In the beginning it seemed like it was important to go to class, but by the end of the semester I couldn't get myself to go sometimes and my grade didn't suffer. It wasn't all boring though. When she got to talking about individual presidents I found that very interesting, and those were some of the more interesting readings too. But the stuff about the Equal Protections Act, political action groups, (which are all very interesting topics) she could not have made it more boring. What I missed was the connection to the amazing things that are happening in the political arena RIGHT NOW! That's what made me feel like the class was a waste of time. Now, two semesters later with several more poli sci classes under my belt, I can truly say that I remember almost nothing from her class. Although I did get an A, if that matters.\nWorkload:\nNot difficult.\nWeekly readings, which aren't hard to catch up on even if you fall behind.\nA handful of quizzes, but she tells you exactly what readings will be on the quizzes.\nMidterm, Final, around 3 super easy papers.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "April 15, 2008",
            "review_content": "\nThings that bothered me:\n1. She reads from the power point, completely.\n2. She is incredibly condescending.\n3. She doesn't respond to e-mail.\n4. Her quizzes and tests are multiple choice, and ask questions about minute details in an article.\n5. The reading is absolutely staggering, and pointless.\nThe only redeeming feature is the intense fascination you will probably experience marveling in her inability to engage the class, but alas, the wonderment fades quickly.\nWorkload:\napprox 200 pages/week of incredibly dense, irrelevant articles and books that you shouldn't buy. quizzes that will alternatively be curved, or not counted, or taken over, depending on what time of day you catch her. 2 papers that are compare/contrasts of recommended and required readings, also pointless and very 3rd grade-esque. a midterm, see #4 in review. a final, probs as amazing as the rest of the semester has been.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "April 14, 2008",
            "review_content": "\ni agree... there were absolutely NO dynamics in this class. she basically summarizes various theories of bureaucracy that have been proposed in the last 20 years or so. she is extemely bent on being politically correct and not entering into controversy, insulting the students' maturity level. It seriously requires every last sinew to stay awake in this class. Don't do the readings, she tells you what to prepare for the tests. but do fight the urge to lay ur head down... and make the effort to take notes.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "June 03, 2006",
            "review_content": "\nOk.  I really liked this class.  I did not take AP Gov't so I can't attest to its similarity to the class.  As to the acussations, that the class is boring, or that Professor Johnson is clueless, neither is true.  The class was very interesting.  I enjoyed the historical and sociological perspectives of the class, and Professor Johnson was interesting, albeit occassionally class did drag on. \nWorkload:\nThe readings were VERY interesting.  Don't sign up for the class if you're not going to do the readings, you won't get very much out of it.  There was a sizeable amount of reading involved.  While I didn't love the textbook, the book of readings and the other books were fascinating.  There are two papers based on in-class discussions and a mid-term and a final.  (We got study topics for the mid-term and the final).\n"
        },
        {
            "course_name": "political science",
            "review_date": "January 12, 2006",
            "review_content": "\nThis was definitely the easiest and the worst class I have taken. She assigns an absolutely ridiculous amount of readings each week. Attempting to get through all of the assignments is pointless, as she goes over all the main points in class. I didnt do any of the readings after the first week and I was not lost at all, but make sure you pay attention in class (as painful as that may be). It was a new class, so hopefully she will work out the kinks. Either way, take this class if you are interested in bureaucracy, that is the ONLY thing that will be discussed. Basically, the class sounds far more interesting than it actually is.\nWorkload:\nTONS of reading assignment(which arent really necessary as long as you go to class and pay attention), (3) 5-page papers on random topics she chooses, no midterm, final with ids and 3 essays.\n"
        },
        {
            "course_name": "Power, Politics and Policymaking",
            "review_date": "December 15, 2005",
            "review_content": "\nThis is definitely one of the most painfully boring and pointless classes I have taken in my life. The class should be called \"Bureaucracy\" because that is the only thing covered the entire semester in an endless list of terrible readings and lectures (which are basically along the lines of Johnson reading aloud from the horrible books in a monotone voice). \nLooking back on the semester, I can't really remember what we covered or learning any of it.\nWorkload:\nThree 3-5 page papers which she gives an assignment for, plus final (IDs and 2 essays). The reading load is absolutely enormous and incredibly useless and tiring.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "June 12, 2004",
            "review_content": "\nI don't know what people expected when taking this course - it's not listed as a current events class.  Or as a discussion forum for the War in Iraq.  While I hate that I had to take Dynamics after getting a 4 on the AP Gov exam as a senior - it was not falsely advertised.  This class is about the fundamentals of American government.  It is disappointingly similar to AP Govt, but until Banard offers exemption for a four on the test, so be it.  It touches on key points including congress, the presidency, precedent laws, social movements and human rights.  I feel like anyone could benefit from having some sort of background in these things, so that later in life, you don't have to look like an ignorant monkey in public.  While Kim wasn't the most enlightening professor I've ever met - she wasn't horrible.   Don't take this class just to fufill your Soc Dynamics req, if you HATE American Politics.  You get what you sign up for.\nWorkload:\nLots of reading - I kept up at first and kinda started to fall off the wagon toward the end.  Either way, the reading is interesting in general, especially for those in the major.  They are things that you will be asked to read and reference again and again I am sure.  I loved that we had no textbook, because it pulled more out of your own head for papers and less from a common reference point.  There are four short papers - two are from in class \"debates\", which aren't really debates.  They were graded by Melanie, I think, a TA.  That part was no good, since she's inconsistent and a tad immature in the way she conducts herself around students.  (Very \"look at me, I graduated with a Poli Sci degree!!!\")  But in general, you have ample opportunities to write well enough to earn your grades.  Be originial in your theses.  If you support them well, even if she doesn't agree, she'll go with you on them. \n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "January 03, 2004",
            "review_content": "\nThe worst.  It was like a really bad high school class.  She often seemed clueless and we were always correcting her.  The assignments are pointless and she doesn't specify what she wants from them that well.  I learned little more than what I already knew from American government from senior year of high school.  Classes were mental torture.  One positive note: I didn't do even half the reading and still got an A-.\nWorkload:\nTwo papers from a class debate (almost complete waste of class time), two book reviews (more like book critiques but just as inane) and final.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "October 30, 2003",
            "review_content": "\nShe is HORRIBLE. This is one of the most boring classes i have taken here. She expects her students to know more than she does. The class drags on and on and on. Her grading of the papers is unfair..... mostly b/c it is totally unclear what she wants. She really wanted something different than what she assigned. This class is the reason I am no longer a Poli Sci major (though there are definitely some good classes out there...just hard to find the good Profs).\nWorkload:\nlots of reading you don't have to do. 4 short papers and a final (just study the notes...if you can stay awake to take notes). \n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 16, 2002",
            "review_content": "\nTo sum it up: there are NO dynamics in this class with this professor.  Class size dramatically decreased as the semester progressed, as people realized that lectures were completely unnessesary.  Lectures are STRAIGHT from the highschool-level textbook and are extremely boring.  There was no talk of current politics.  Professor Johnson was monotonous, boring, and appeared clueless at times.  Many, many people fall asleep.  Basically, this class was a waste of time.\nWorkload:\n3 short essays (3-5 pages), midterm and final, all identifications. Grading on the essays is confusing and unfair to me, there were no comments and seeing her in office hours was no help.\n"
        },
        {
            "course_name": "Urban Studies Colloquium",
            "review_date": "January 23, 2002",
            "review_content": "\nThis class was incredibly disappointing. If you can take it with another professor, do so. I really enjoy urban studies yet this class was an absolute chore. She started nodding off during students' presentations of their final projects. I am not kidding. She does little if anything to stimulate discussions. Stay away.\nWorkload:\nSo much reading is assigned it cannot be gotten through. Yet my memories of this class are generally of silence. That's the class in a nutshell.\n"
        }
    ]
}