{
    "prof_info": [
        {
            "prof_name": "Noam  Elcott",
            "prof_id": 3561,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "V3673 History of Photography",
            "review_date": "March 19, 2013",
            "review_content": "\nI didn't love this class as much as I thought I would.\nFirst, I was definitely not prepared for this 3000-level art history course with almost no previous art history classes.\nThe material wasn't as interesting as I expected, but it is interesting now to have all of this random photography knowledge.\nNext, though we had to memorize a lot of slides, he wouldn't specify which we needed, which made studying frustrating when I missed a class. Also, he gave us another museum visit last minute, mentioning that photographs from an exhibit will be on the final on the last day of class, which I thought was kind of unfair.\nLast, the TAs were completely unavailable, gave no feedback on papers, and didn't even tell us their names.\nProfessor Elcott was okay. He was pretty reasonable, tried to make the class more interesting, and changed things around if he thought it would make it easier for us. He tried to give good reviews for tests and help for the papers.\nI wouldn't recommend this class for an easy art history A (I got an A- with a B and a B- on papers, so I'm not sure how that happened, but I wouldn't risk it again), but for an art history major, it might be better.\nOn a completely different note, he is exactly Ted Mosby.\nWorkload:\nA lot of reading, but he reviews main points in class.\nMidterm & Final (Identification, comparisons, essays)\n2 or 3 museum visits\n1 short paper and a research paper. At first he assigned 2 short papers, but then realized that it would be too much work.\n"
        },
        {
            "course_name": "V3673 History of Photography",
            "review_date": "September 22, 2011",
            "review_content": "\nI thought this was a fantastic class. Once you get used to his style, Elcott is a very clear lecturer (He never leaves a thought unfinished - so expect to leave lots room in your notes) and the topic was fascinating. He's a very compelling speaker.\n This was not a typical slide based art history class. It is very theoretical and focuses heavily on how the history of photography has been recorded and photography's place in art, law and science. I would highly recommend this class for VA majors and students with concentrations in photography. \n\nWorkload:\nElcott expects you to internalize the readings as well as the images. Definitely fewer slides to know than most art history classes, but more readings. Expect to be making flashcards about authors as often as you make them for artists. The readings are mostly very interesting though and he spends a lot of time going over them. \nI found his grading to be very fair. He has far lower standards for the first paper than for the last, so expect your grade to go down over the term if you don't work progressively harder. In total I think there were 2 papers, a slide & essay mid term, slide & essay final, research paper.  He gives the research assignment early in the semester so take his advice and start working on it. \n"
        },
        {
            "course_name": "V3673 History of Photography",
            "review_date": "May 14, 2011",
            "review_content": "\nYes, Elcott is weirdly, starchily, compulsively articulate (read: speaks in complete sentences and uses the word \"superlative\" unironically) but he's not a bad lecturer by any means. His approach is almost single-minded in its focus on the theory and not the images itself, which is handy come test time when you realize you've only got a dozen or so IDs to memorize after weeks and weeks of lectures. He loves the readings and really makes you deal with them on tests and papers, but you don't have to freak out about reading them all because he basically runs them through in class. I actually thought this guy was quite interesting. But again, super theory-heavy. so if you'd rather cycle through tons of pictures, maybe not this guy.\nWorkload:\nStandard art history midterm and final of IDs and essays, two shorter essays (4-7 pages, I think) and a longer 10-page that's a \"research paper,\" but really not a research paper.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 10, 2011",
            "review_content": "\nI disagree with the other reviews; I had Noam this past semester for Art Hum, and I thought he was excellent.  I wasn't really expecting a great teacher for this core class, and am not particularly interested in art, but after taking this class my interest was sparked.  The classes went by so quickly.  He is clearly very passionate about the subject matter, and would pace eagerly back and forth at the front of the room as the discussion progressed.\nDiscussion was definitely geared toward a certain end, although he was generally pretty understanding of other interpretations of the works that might not have been on point with his understanding.  He was very patient, and encouraged everyone to speak, since participation is such a large percentage of our grade.  It wasn't like those teachers who say they'll make everyone participate and then fall through; he would always make sure everyone in the class got a turn, and wouldn't let just one person dominate the discussion (most of the time).  Doing the readings is helpful for participation, but not necessary.  All in all a great guy who genuinely wanted us to enjoy the works.\n\nWorkload:\nThree papers and a midterm.  For each paper you have to go see the physical work, either at the Met, MOMA, or St. John, and critically analyze.  It was a great excuse to get off campus.  The midterm was a lot of memorizing, but he told us exactly what was going to be on it, so it was pretty easy to get an A.  Not bad at all.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 25, 2009",
            "review_content": "\nYour typical art hum professor, who favored the kids in the class who had taken an art history course before. Not a great professor (just got his PhD) but still a bright guy overall. He will make the course interesting and make you memorize a ton of slides for ID's for the midterm and final. all in all, decent professor but you dont really have a choice in art hum, but he is not as easy as some of the other art hum professors\nWorkload:\nLight. Three papers, midterm exam and final exam. Reading for every class but no one really does it. He is a very harsh grader though, looking to take off points wherever possible. Also, the final exam was tough, and most other art hum classes didnt have it.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 18, 2008",
            "review_content": "\nNoam, is a phd student in art history at princeton which naturally makes him a douchey pretentious art historian. He taught art humanities, but taught it assuming that we had all taken an art history class before. He was a decent teacher, but really took no extra effort to help out a class which was clearly struggling with the analysis. Elcott is obsessed with formal analysis which we wrote all of our papers about. Overall, not a great professor, but if you have no choice he is a decent choice.\nWorkload:\nA lot for an art hum class. Three papers which ranged from 2-6 pages, last one was incredibly difficult. One midterm which was a piece of cake(about 15 ID's and an essay), readings for every class which are terrible but you really should do, because he tests for them on the final. Final exam which is unusual for an art hum class as well, but it was similar to the midterm. Overall, more than necessary for an art hum class.\n"
        }
    ]
}