{
    "prof_info": [
        {
            "prof_name": "Laura Schacherer",
            "prof_id": 9482,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "December 13, 2010",
            "review_content": "\nAll in all, it is not a bad class and it gets a bad rap.  Most people's only prior experience in a chemistry laboratory is the first year General Chem Lab.  After that semester, many people have this strange thought that all that is important in chemistry is significant digits and error.  Have no fear pre-meds! This class does not require any significant digits or error calculation (though you might just find yourself paying attention to sigfigs out of habit).  The first few labs are not very time or labour intensive.  For the first month of the course, I usually left by around 4PM if not earlier (the class started officially at 1, but we'd rarely start until 1:15 at the earliest).  Most weeks the class begins with a lecture, followed by a quiz and then you get to do the lab work.  The quizzes are from hell after the first 3.  The first 3 had an average of 18/20 or so, and the rest averaged around 60%.  The good news is that the quizzes are scaled according to your own TA.   The first 4-5 labs were done individually in order to learn technique, but they were not difficult, and few people had problems.  Just as you get used to working by yourself, you get thrown a curveball - partners.  Around the same time, the labs start to get more complicated, and require many things to be done at once.  Dividing up the work will get you done much faster.  Don't have one partner just watching the other - it wastes valuable time.  The latter half of the course (with the exception of the final lab) has very long and complicated labs.  The earliest I left during most of October and all of November was 5:00, and sometimes I used up the whole time.  That being said, there is a lot of down time once the reaction starts - some needed to sit for over an hour.  Labs usually do not feel rushed, and you have time to hang out and chill with your class and TAs.  The only exception is for 2-3 of some of the later labs which are water sensitive.  These you need to work quickly once you dry your glassware, or you will get messed up results.  (Watch out for burning your hands)\nTaking this course second semester, if you can get in, would be an advantage.  I was stuck teaching myself most material for pre-labs and lab reports, as the majority comes from second semester lecture material.  If you haven't taken both semesters of Orgo lecture, pay close attention to the pre-lab lectures, otherwise there is no way you will do well on quizzes.  That said, if you take it first semester, most people will be in your situation, which will help the curve.  Also, first semester, the classes tend to be smaller, and there is less competition to get into the class.  My class had 20 people in it (my TA section only had 10), and one class only had 4! \nBottom line: take it first semester if you're confident with the material, or you feel like you can teach yourself.  If you want to take it second semester, you'd better hope you have a good registration appointment, or the post-bacs will beat you to the class.  An alternative: get a senior to register for the class, and drop it when you have your registration appointment.  \nWorkload:\nThroughout the semester: weekly quizzes, becoming impossible after the third week, prelab notebook \nFirst 6 weeks: Pre-lab assignment, usually not more than an hour or two (add a little more if you need to teach yourself the material)\nLast 4 weeks: Lab reports.  Allow lots of time for this, especially if you are taking it first semester.  Lab reports average about 1500 words or more, with most of it coming from discussion.  You will need to analyze NMR, IR and Gas Chromatography for each of the reports, and if you don't have practice with this, it could take a while\nAssume 3 hours a week for weeks when no lab report is due, and up to 10-12 for weeks when you need to do a report.  All of this depends on your prior knowledge of organic chemistry.\n"
        }
    ]
}