{
    "prof_info": [
        {
            "prof_name": "Tana  Wojczuk",
            "prof_id": 12990,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 23, 2015",
            "review_content": "\nThis class was a lot of work. I don't think that was a reflection on TW, but rather UW on a whole. I actually thoroughly enjoyed this class though, and would definitely choose to take it with TW if I had it to do over. In the beginning of the semester I was a bit skeptical of her and her teaching style, but she really warmed up as the semester progressed and the class was pretty enjoyable even with the heavy workload. I do not agree with the previous reviewer and feel that my writing improved a ton and that I was definitely able to apply what I learned in even the classes I took during the same semester. She's by no means an easy grader, but she's definitely not a harsh one either. Overall I thought her grading was pretty fair, and for me at least reflected the work I put in. Definitely take advantage of the writing center. I didn't and regret not doing so as I probably would've ended up with a half to a full grade higher.\nWorkload:\nStandard UW. Reading/written assignments due every class.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 05, 2015",
            "review_content": "\nI thoroughly enjoyed my experience in Professor Wojczuk's class! She's extremely helpful and patient, and definitely go to office hours since she'll be willing to spend almost an hour with you to talk out your ideas and help you figure out what you're trying to say. She knows what questions to ask that will generate a fruitful discussion. I came out of the class with a whole new appreciation for the writing process (especially after that monster P3), and she really encouraged me to always be skeptical and constantly challenge my preconceived notions. This was probably my favorite class last semester! \nWorkload:\nStandard UWriting \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 12, 2014",
            "review_content": "\nIf possible, try to avoid taking this UWriting section. The course is already a waste of time, as it actually just makes writing way more complicated than it is by creating a whole UWriting dictionary of vague terms and ideas. \nWhile the readings that were assigned by Tana were interesting, she was not very good at generating discussion about them nor was she very good at clearly explaining all those vague UWriting terms. \nShe was a harsh grader, something my entire class basically agreed on and was also vague about what she was looking for. Even though she would give us feedback on drafts, it would often not include the criticism that we would get on our final papers. What I mean is that she could criticize one thing in a draft, which you fix, but then in your final she mentions some other huge problem that she failed to note was a problem in her prior feedback. Meaning you can't really end up with the outcome you would hope for on any of the papers. \nHonestly, by the end of the semester I felt like my writing had gotten worse and like I had lost literally all interest in writing on even interesting research topics.\nSince you have to deal with the waste of time that is UWriting, try to find a different section. \nWorkload:\nUsual UWriting \n"
        }
    ]
}