{
    "prof_info": [
        {
            "prof_name": "Clark Hung",
            "prof_id": 2368,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Engineering In Medicine",
            "review_date": "January 03, 2014",
            "review_content": "\nI would not recommend this class.  First off, pre-professional classes are no longer required.  At the time I was registering for classes, pre-professional classes were still required, and I thought that this course would help me decide if I wanted to study BME.  \nAll this class consists of is a weekly ~1.5 hour lecture by someone in the BME department presenting his/her research followed by a super nit-picky online quiz about the lecture and an end-of-semester research paper.  I would say about 75% of the time, the students had no idea what the lecturer was talking about, simply because the research was so in-depth and most of us in that class were still fresh out of high school!  There were perhaps two good lecturers (good as in engaging and could articulate their research to someone who did not know a lot about their field) but other than that, most of us dreaded going to lectures.  Essentially, during the whole lecture, people are vigorously copying down notes, which they are allowed to use in quizzes, even though we don't understand anything we are copying down.  The other group of people are just browsing on the their computers because they will get the quiz answers from their friends.\nThe structure of the quizzes infuriated me the most.  I would say about half of our classes cheated on them.  You are only supposed to use the notes you took in class during quizzes.  However, pretty much a group of 40ish people would take them together.  They would see what score the first person received, change some answers, have another person submit it, see if that changed the score, then have a third person submit different answers, etc, until they knew all the correct answers.  This in turn, screws up the grade average in the class, as more than half the class has a 100% quiz average.  Basically, if you are going to be honest and take the quiz by yourself, like I did, unless you get 100% on all the quizzes, you will be screwed over by the curve.\nThe course ends with a research paper that you do in groups of 4: topic of your choice (related to BME).  It's worth about half your grade, but you're told about the paper at the beginning of the semester, so as long as you don't procrastinate too much, the paper is not a big deal.\nOverall, I would say that now that the pre-professional course requirement has been eliminated, there is really no reason to take this course.  It didn't teach me much about BME except to resent it, being that the research was hard to comprehend and the students in the class/field value grades more than ethics.  \n\nWorkload:\nWeekly 1.5 hour lecture \nweekly online quiz (10 questions, 30 minute time-limit)\nend of paper 10 page research paper (done in groups of 4)\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "December 30, 2009",
            "review_content": "\nThis class serves as a reasonable introduction into biomedical engineering and every week, invites lecturers from various sub-fields (biomechanics, cell and tissue, imaging) to talk about their current research projects. Usually does not take the full time allotted by the registrar (Monday 4:10-6:40 pm), except for the last two classes. If you are thinking of a career in medicine and BME, then you will find most of the topics, especially neurobiology and cardiac catheters, to be very interesting. The best ones were usually short, concise, and condensed, although a few of them can be so unnecessarily long, dragged out, and boring that everybody quickly stops paying attention towards the end; the problem is that the lecture room is so dark that you fall asleep when extremely tired by the end of a long day of classes and the Wi-fi connection also is very tempting. Not bad for fulfilling the pre-professional requirement given the light workload. As for Clark, he acts as a moderator and writes all the quizzes, for which he may decide to accept multiple answers if you can convince him that the questions are ambiguous and mislead you in your reasoning. Very flexible, nice, and caring prof who answers emails promptly and always tries his best to make you understand the material better.\nWorkload:\n(1) Weekly online quiz (60%) - Multiple choice or true/false. Tricky questions that can be tough for those who skip lectures constantly. Time is not an issue, but the style takes a while to get used to and becomes much easier as the semester progresses. 9 in total and lowest grade dropped\n(2) Paper on a bioengineering technique and final presentation in the form of a powerpoint (40%) Very open-ended and free in choosing what to write about, but nerve-racking in terms of presenting in front of the whole class (14 minute time limit, for which points may be deducted if overtime). 15 pages maximum for the report, not including diagrams. No final exam!!! Getting an A  as a final grade can be kind of challenging, but not impossible. If you are willing to put in the effort, it usually pays off and you will do relatively well (B+ or A-)\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "July 23, 2008",
            "review_content": "\nI took this class in Fall 2007.  The process might be different for future students, but the class was relativity easy.\nThe class meets once a week with a lecturer from different concentrations within the department and people in industry.  If you interested in medicine, you will find most, if not all, lectures interesting.  If you are taking the class just for the pre-professional requirement, you may opt out not attending lectures or just bringing your laptop.\nThere was an online quiz once a week which was quite easy and you could work with your friends.  There is a final group presentation and paper where professors from the department facilitate when you present.  They generally do not ask you very in-depth questions but sometimes the TA would!\nWorkload:\nonline five question multiple choice quiz a week; final group paper and presentation on a biomedical engineering method\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "December 31, 2007",
            "review_content": "\nEach week, a different guest lecturer speaks about a topic of his or her choice and Professor Hung acts as moderator.\nThe hardest part of this class is paying attention as it is in a large lecture room, the lights are off and the wireless internet connection is strong (bring your computers to take notes and provide a distraction when you get bored).\nThe content of each week's quizzes comes from the lectures so either take good notes or befriend someone who does.\nThis is an easy option to fulfill the pre-professional requirement for engineers.\nWorkload:\nMinimal. One web-based five question multiple choice quiz each week, one short final group paper and presentation about an appropriate topic of choice.\n"
        },
        {
            "course_name": "Tissue Engineering I",
            "review_date": "January 02, 2005",
            "review_content": "\nThis class is THE CLASS for those in cell/tissue track. Everything that will be on the midterms will be in Hung's lectures, make sure you watch the lectures on CVN again before taking the midterms, there's always something that'll you'll miss the first time round. Prof. Hung is a fair grader. This is a pretty interesting class at times, in addition to learning the material, you'll also learn 300 ways to use the word \"basically\" in a sentence, plus, watch the prof. flip his hair. Sometimes Hung will give a pop quiz based on the readings that he assigned for you to read before class, they aren't long. The TAs usually will give you a subtle hint if a pop quiz is coming up.\nWorkload:\n3 homework assignments, not too difficult; Pop quizzes, he drops the lowest one; 2 midterms, work quickly through these, time is a factor; one 15-page paper on comparing two scientific papers, you work in groups of three for this; one 12min presentation at the end on the two papers that you've chosen with a short questions session. No final.\n"
        }
    ]
}