{
    "prof_info": [
        {
            "prof_name": "Haim Gaifman",
            "prof_id": 154,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Major Seminar in Philosophy: Analytic Philosophy",
            "review_date": "May 10, 2010",
            "review_content": "\nThere is one other review for this class so far (below). It is not completely unwarranted, as most students clearly did not enjoy the seminar and had similar reactions. But I would have to disagree about a few things. \nFirst of all, this class was on \"Analytic Philosophy.\" It presupposes that you know what analytic philosophy is and you have done some other work in the subject. It is a majors seminar, after all. What Gaifman tries to do throughout the class is touch on certain basic tools and concepts in analytic philosophy in order to give students a rough idea of what this sort of work looks like on an advanced level. I think he accomplishes this task. There is a catch, though: analytic philosophy is DIFFICULT. It demands incredible precision and a good handle on a very specific conceptual framework. \nSecondly, Gaifman tries to teach this class through instances of analytic philosophy. He begins with Frege's seminal, \"On Sense and Reference.\" This paper revolutionized philosophy. Ever since Frege's rediscovery by Russell and others, philosophy has never been the same. This is why Gaifman spends SO much time on this one, short paper. He doesn't do a bad job. After six weeks on Frege, he expects you to have a good handle on the system he has been discussing. It's not at all unrealistic of him to expect a good 5-page synthesis. \nThe other examples he uses are: Quine's, \"Quantifiers and Propositional Attitudes\"; Gettier's, \"Is Justified True Belief Knowledge?\"; Nagel's, \"What is it like to be a bat?\"; Hacker's, \"Is there anything it is like to be a bat?\"; and others. The reading list is wonderful. But, again, it is DIFFICULT. Expect to spend hours reading a miniscule amount of pages. But that's the nature of the beast. \nAll in all, Gaifman is actually a great professor and a great guy. The only caveat is that you have to find that out for yourself by seeking him out. It doesn't all come out in class (unfortunately). But if you make an effort to talk to him, you will find he is very attentive and supportive. Note: give him time to read his email; he's not that fast with it. If he doesn't feel like responding via email, he will give you his phone number. You can either talk to him on the phone or set up an appointment. I did this successfully a couple of times.\nSometimes philosophy classes are a bit too easy. This is not an instance of that phenomenon. Gaifman expects a great deal from students. He is a tough, fair grader. I'd say he takes grading philosophical work seriously. And he expects you to take the work assigned seriously.\nWorkload:\nThree difficult 5-page papers. Weekly homework, assigned via email (often a bit late, e.g. assigned Saturday for a Tuesday class). Short, but difficult reading. \nA tough, but fair grader. Challenging, but rewarding. \n"
        },
        {
            "course_name": "Major Seminar in Philosophy: Analytic Philosophy",
            "review_date": "May 06, 2010",
            "review_content": "\nThe seminar was not a success. The topic of the seminar was announced on the first day of class, there was no real syllabus or introductory material for the course, only a list of potential topics, which were not all covered - and this also meant that assignments were often given on Friday or Saturday for a class held on Tuesday. Office hours were not held, and access to Professor Gaifman was difficult through e-mail, and while he hinted at being available by phone, his number was not actually given out. The only 'office hours' that were held were mandatory, right after class, and only for those who did especially badly on the homework. Besides being told what the course material was, we were never really told why we were reading it or analyzing it. After six weeks of Frege, we still didn't really have a clear sense of what Frege was talking about, or why the things he was talking about were relevant. This became apparent after our paper on Frege was handed in, and we were all forced to go to 'office hours' for writing bad papers. Professor Gaifman dominated discussion in what he wanted to be a discussion class, and when questions or suggestions were raised, he would dismiss them as inaccurate, laugh them off, or seem to get annoyed. Whether this was the case or not, it came off as incredibly intimidating, and did not encourage seeking him out to clarify the material that was not well-clarified. He would occasionally ask a question that nobody would be able to answer, and instead of realizing that we didn't understand the material and proceeding to walk us through it (this is really hard material!), he would keep asking it as we groped about in the dark trying to guess the correct answer by scrambling through our readings and old notes. I have taken lots of philosophy courses, but this is the first one in which I was made to feel stupid. Now I know what my friends in other majors feel like when they take a philosophy class and ask me, \"what the hell are you people talking about?\" In this class, I honestly don't know.\nAssignments were typically given on Friday or Saturday for a seminar held on Tuesday. Especially on weekends with holidays (or over Spring break, when he sent out the assignment for our Frege paper on the last weekend of the break, while we were still on break), this policy was infuriating. When challenged about this policy of assigning things extremely late, Professor Gaifman said that we had the first half of the week to do reading and the second half to do new reading and the homework assignment. I would prefer to be given the choice as well as the time to do my homework when and how I see fit. After we received the new readings for the Tuesday, we would typically also have a set of homework questions to do for that new reading; no matter how confusing or difficult, the expectation was typically that we would master the material in the reading, and then apply it to a new situation. Not surprisingly, this did not go well. We did not know how to do many of the homeworks, and our marks on them reflected this fact. Again, instead of reassessing this method of giving homework, Professor Gaifman continued to give us nebulous and highly critical comments on our homeworks, but without grades. Only after the Frege paper did we start to get actual grades on our homeworks. Around week 9, Professor Gaifman sent out a list of the e-mail addresses of people in the class so that we could study together; probably due to the combination of the fact that this was so late in the semester, along with the fact that assignments were given so late in the week, this was never used (it is hard to find time to study together if you get an assignment three days before it's due, and only then know if you want or need to work with somebody else on it). Finally, the paper topics were not very helpful. The first one was not actually a topic, per se; we were just given the title of the paper. The second was a single line prompt, and only for the final paper were we given more.\nWorkload:\nAssignments given out on Friday or Saturday for a seminar held on Tuesday; hard readings (even the short ones), with an associated homework that assumes mastery of the material; if you did not master the material, your grade will reflect this; three short papers of seeming easy difficulty, until they get handed in, and returned shredded to pieces (or never returned)\n"
        },
        {
            "course_name": "Explanation and Induction",
            "review_date": "February 20, 2009",
            "review_content": "\nHe is perhaps one of the best set theorists in America.  However, he does fail to realize that when he teaches an advanced formal concept, the audience does not have the necessary formal background to follow along.  He will say that you only need introductory symoblic logic, but then move far too fast and do far too much rigor for someone with only that training.  I had actually studied logic in many, many classes and have a good handle on the subject, and found his lecture on the Completeness Proof difficult to follow.\nOtherwise, though, he is extremely informative and--at least for papers--not an unreasonable grader.  He is difficult to get ahold of, rarely holds office hours, and is intimidating.\nI would recommend him strongly, IF you have a strong background in the subject already.  In that case, you will find his presentations extremely helpful to know the more detailed and rigorous concepts of the given subject.\nWorkload:\nExtremely light.\n"
        },
        {
            "course_name": "Probability and Induction",
            "review_date": "January 08, 2007",
            "review_content": "\nThis class was one big mix up.  He didn't make any prerequisites for the class, but expected that everyone intuitively had a working knowledge of set theory, Boolean algebra and symbolic logic.  Some of us did, but some didn't, and made sure that he knew that they didn't.  He wanted to spend the class time teaching the philosophy of probability and induction, but ended up just teaching elementary probability and Boolean algebra all semester.  All in all the workload was fine.  We had written math type homework about every week, but they didn't really count for much.  Our grades were based on our final projects- either a philosophical paper about a few chapters from this book, or around 10 somewhat difficult probability problems, or both if you wanted.\n"
        },
        {
            "course_name": "Philosophy of Language",
            "review_date": "December 17, 2005",
            "review_content": "\nProfessor Gaifman is one of the most attentive professors I have ever had at Columbia who will take interest and become personally invested in your success in the class with one (easily avoidable) catch--it is up to the student to initiate the dialogue, and to do so early on in the course. The course is challenging and invovles lots of (very confusing) readings that go quite in depth on certain issues (what on Earth is Wittgenstein REALLY trying to say...ever?), as the subject is quite abstract and requires at least a basic understanding of elementary logic. His lectures are well-organized and his presentation of the material is thorough and clear. \nHe is a tough grader, but like I said, he is not at all unfair. Be sure to go to office hours whenever possible, to attend most of the lectures, and to go to office hours. He has been one of my favorite professors at Columbia, and even though this has been one of the most challenging classes I have taken, I really enjoyed it and would recommend it to anyone interested in the subject.\nWorkload:\nThree or Four Short Assignments, and a final paper that requires a lot if individual research (read: TIME), since it is not based on the articles in the Reader.\n"
        },
        {
            "course_name": "Philosophy of Language",
            "review_date": "July 12, 2005",
            "review_content": "\nDo the reading -- in fact, do the reading twice; you'll have to, because if you don't go back and read the first paper he gives you (usually two a week) after you read the second, you'll miss the point, which is usually to explore both sides of one of the key debates in philosophy of language.\nGives excellent short (1 page, but will tolerate single-spacing) assignments that are meant to force you to work through the questions that tie the material together.  These are difficult and he doesn't tolerate bullshit -- as he says, \"If you make a good effort and write like a philosopher I'll probably give you some grade like A-, and if you get it all wrong I'll probably give you some grade like D-\".  After a few of these everyone got with the program and I don't think there were a lot of \"D-\" homework grades given out.\nSometimes he will tell you you got something wrong and that you need to go to his office hours.  Put up with the hassle of actually catching up with him: he's old-fashioned and it's a lot easier to use the phone than to try email.  He will spend as much time as you have explaining almost any topic to you and working through the implications.\nThe final paper topics are mindbogglingly difficult.  I think he graded them with some degree of mercy.  Here, again, it pays to go to office hours.\nWorkload:\nShort but very difficult readings -- 30 or 40 pages per week.  Short written assignments most weeks, trailing off towards the end of the class.  One very, very difficult paper summarizing a topic covered in the reader but not in class -- almost like having to write a textbook chapter on a topic you've just learned, yowch!\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "April 09, 2001",
            "review_content": "\nI think the Haifman gets a bad rap. I like him a great deal. He's cute, fat, with an adorable Israeli accent. He is not a great teacher, but he generally explains things thoroughly enough that his lack of communicative abilities are overcome. His text book is terrible. But if you want to learn Symbolic Logic, really learn it, this is the class to take. All you philosophy majors will have to readjust your minds to the system, but if you do that and work hard, you will succeed and you will know the material like Jenna knows Rocco. If you want an easy class, take Varzi. If you want to have a mind that picks up logical errors like a Hoover, take Gaifman.\nWorkload:\nQuiz every week, and you always think that you're failing (I got a twenty-eight on a couple). But they make you learn it, so by the final (especially with his adjusted grading system) you'll do well. Midterm, Final, and quizzes.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "December 31, 1999",
            "review_content": "\nMakes symbolic logic a gruelling experience; gives D's with impunity. Avoid if at all possible.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "December 31, 1999",
            "review_content": "\nGaifman is indeed a challenging professor. He was hands down the most difficult grader I've ever had. The mean on the midterm was a C. And he does not curve. Ever. In the beginning of the semester there were around 50 students, by the end there were only 21. (A number of which were grad students). You had to know the material inside out in order to survive the class. Now symbolic logic is forever imprinted on my brain.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "December 31, 1999",
            "review_content": "\nThis is most definitely one of the toughest classes I've ever taken, but mostly that is b/c Symbolic Logic is completely and totally foreign to any normal person. Mr. Gaifman is incredibly bright, and keeps lectures interesting, but his pace is brutal thoughout the semester (that's why you get 4 points, kiddies!). If you keep up, you'll be fine, if you don't, you'll be destroyed by the almost weekly quizes that become quite challenging by the end of the coures. Don't Fall Behind!\nWorkload:\n2 hrs of class a week, and you really must go to as many classes as is humanly possible. The HW assignments (NOT OBLIGATORY!!) will take anywhere from 2 - 8 hours a week. Stay aware of quizes, they're tricky!\n"
        }
    ]
}