{
    "prof_info": [
        {
            "prof_name": "Guillermo Gallego",
            "prof_id": 2497,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "W4150 Introduction to Probability and statistics",
            "review_date": "December 23, 2012",
            "review_content": "\nProfessor Gallego looks to be a very nice person and a decent instructor. Everything he teaches is really at a very basic level and so is his homework. His exams were quite straightforward and did not require a high-level mathematical or calculus ability but a very deep understanding on Probability and Statistics. At a glance his exams look very easy but they are not. His exams are very similar with previous years exams but not with the two last years which he gave in class. If you can gain access to a series of his previous 5 years exams (final and midterm), those are the only things that are relevant with his exams.\nThe textbook \"Introduction to Probability and Statistics\" by Stephen Ross is not quite relevant with his exams. Do not study from the homework taken from that book because they definitely will not come out on the midterm/final. Except some additional problems from him (usually in a LaTeX pdf). \nMaterials that are relevant with his exams:\n1. Last 5 years exams (if you somehow can gain access to those).\n2. Formula derivations in his class notes. The very part that is worth studying is when he discuss about tables and derivations in his notes - others are not quite relevant. So, when you see some tables and some derivation, you should really understand those or try to derive them manually.\n3. Sample exams he gave in class. Never expect that they will come out 100% but his exam will be quite similar.\n4. \"A First Course to Probability\" book by Stephen Ross. This book definitely helps you study for the probability part. Try to master especially Joint Continuous Density from this book, Central Limit Theorem, Bayesian Theorem from this book. It will help you get an A. Try to score as high as possible on midterm although he says he will drop the midterm if you score higher on final but, no one scores higher on final. Try to understand on Gaussian Distribution and Uniform Distribution.\n5. Prof Stephen Kou's Statistics lecture notes on MLE and Method of Moment. In his notes, he will give a table on MLE and Method of Moment estimates on exponential distribution but on the exam he asked to derive MLE and Method of Moment parameter estimates on double exponential distribution. And also try to solve Prof Kou's problems on Bayesian inference (prior-posterior), that will come out on the final.\n6. Try to understand really deeply about the concepts of confidence level, significance level, and area of reaction under different distributions (not only Gaussian, student-t, or Chi-Square) because he will ask different distributions and will intertwine those terms (confidence level and significance level) which will make you confused if you do not understand those concepts in depth.\n7. Goodness of Fit chapter of \"Introduction to Probability and Statistics\" by Stephen Ross. You should be able to use Chi-Square Test to test the independence between two variables.\n8. Multiple Regression Part of Econometric Books. His notations on Regression part is very different from \"Introduction to Probability and Statistics\" book. One book that is quite similar in notation is Gujarati's econometrics. Try to solve some Multiple Regression problems in matrix form from that book.\nHe will allow one page 2-sided cheat sheet on midterm, two pages 2-sided cheat sheet on the final. Use your time from the beginning of the semester to make the cheat sheet.\n\nWorkload:\nIt is like a 6-credit course but will give you a very strong fundamental to take Stochastic course in the following semester.\n"
        },
        {
            "course_name": "W4150 Introduction to Probability and statistics",
            "review_date": "May 08, 2012",
            "review_content": "\nI took this course over a year ago and I'm still pissed about it.  See, I actually took a course in Probability and Statistics not because I had to in order to fulfill a requirement, but because I knew that I'd eventually be doing things where stats would come in handy.  Sadly I wasted time and GPA on this utterly crap class.\nFirst off, he likes playing with technology and he uses his tablet PC to project his drawings.  The problem is, (and you know this if you've ever used a tablet PC), drawing with a tablet PC is like making notes on index cards with a 3/4\" crayon.  The lines are fat, the information density is low and ultimately you're just going to make a gigantic mess that is marginally useful.\nSecond, he uses a terrible book and moreover does not technically use the book.  He covers theoretical stuff in class, sort of, with his giant crayon machine and then assigns plug and chug problems from the book.  Are you familiar with convolution?  If you are, you know that a serious course spends a minimum of a half session up to maybe two sessions discussing it, but not Gallego, you get 30 seconds and some crayon scratchings.  Want to know more about it?  You won't find anything in the book!\nBut whatever, I could complain all I want about his style.  At the end of the day, the real issue is that the class is useless.  I didn't learn a damned thing and have recently taught myself many of the topics covered by just Googling for books used by professors that give a shit and pulling down PDFs of those texts.\nIn any event, if you have to take this class because of a requirement, be prepared for a gigantic waste of time.  If you don't, please take my advice and look elsewhere for a decent treatment of the material.\nHonestly, this is the only Columbia class I have taken that I would consider demanding a refund for.\nWorkload:\nWeekly plug and chug book problems.  Long cram sessions before the exams (the practice tests he distributes right before the exams are the only cue as to what is actually expected).  Many hours of general pissed-offed-ness about the ridiculousness of the situation.\n"
        },
        {
            "course_name": "Probability and Stats W3600",
            "review_date": "May 12, 2011",
            "review_content": "\nProfessor Gallego teaches the IEOR section of Prob/Stat.\nAt first when you meet him, he seems like a very nice and reasonable man. But boy are you in for a surprise. While he is obviously very smart, his accent makes it hard to understand what he is saying. He has very unreasonable demands as to what depth the class should know certain topics.\nHe provides only a theoretic view during class lectures and doesn't usually give specific example problems. The text book he uses is not helpful either. For every theory, the book only shows 1 example at best and does not fully explain the steps at all.\nWhile we are on the subject of the textbook, \"Probability and Statistics for Engineers and Scientists,\" is a convoluted book that has typos and bad formatting. Even the texbook's name is a ripoff of the STAT W1211 book \"Probability and Statistics for Engineering and Sciences.\" Another fact is that the book used for this class is not on Cramster (which in it of itself is not terrible), but Gallego does not provide a very detailed solutions to the homework problems. In effect it's just a one or two liner about the theory that was reference and the answer. His homework \"solutions\" aren't really solutions, but just answers, making studying from old homework very hard.\nFinally, I would like to address his grading methods. He has his TA grade off for minor issues like a certain way of asserting a proof or having the numbers in the right place. The grading is heavy-handed for the homework. (I don't know many people that have gotten full scores.) He says that he curves to a B/B+, but the other section curves to a B+/A-, which just relatively makes it depressing to be in his class when you see friends in the other section.\nWorkload:\nApproximately 1 assignment a week: given out Monday and due the following Wednesday. Homework starts around 3-4 weeks into the semester. He does not drop any homework assignments, but instead allows 5 grace days.\nMidterm/Final is nothing like the practice examples that he gives out. (Some of which are 4 multiple choice questions and 6 short answer) The actual midterm/final is much harder, but you can also BS parts of it. The class median for the midterm was around a 63, which I honestly expected to be lower.\n"
        },
        {
            "course_name": "W4150 Introduction to Probability and statistics",
            "review_date": "December 23, 2010",
            "review_content": "\nIf there is one thing you should take from this review it's this: AVOID THIS PROF AT ALL COSTS.\nUnless you have been doing probstat for a while or you enjoy suffering, this class is terrible.\nThe Good:\nI'm done with it.\nThe Bad:\nHis lectures involve him talking to his tablet while most of the class can't understand what he's trying to say. His handwriting is illegible. He scribbles down three lines per page and then moves on while most of us are trying desperately to copy down the notes. Taking notes AND paying attention.. good luck with that. That wouldn't be so bad if you could just read the textbook but he makes it a point to tell the class that the textbook he uses is not on the level of the class. Except he gives most of his homework from it. On the rare occasion he does give homework that reflects the level he will test you on, most people struggle with it and never truly get it. By the time you have anything to study from (the practice tests) you're pretty much screwed anyway. \nHe also says at the beginning of class he will curve to a B/B+.. That's crap because I hit exactly mean on both the midterm and final and received a B-. I may be bitter and this review is definitely biased because of it but this truly was an awful class.\nWorkload:\n10 problem sets, most problems from the book.\nThe midterm wasn't terrible but as most people had never seen questions like that before it was tricky. The final was impossible. The only way to get through it was have a great cheat-sheet and copy down EVERY practice problem.\n"
        },
        {
            "course_name": "W4150 Probability and Statistics",
            "review_date": "December 21, 2010",
            "review_content": "\nGallego gets a bad rap. This is a course in theoretical mathematics, not AP statistics, and he makes that perfectly clear on the first day---if you don't want rigor, take the 3000-level version of this class. Lectures are about theorems and their proofs, and that's the way it should be. Gallego himself is clear, concise, gives reasonable exams (too easy, if anything; a 98 on the midterm was an A-) and assigns (mostly) useful homework. The only complaints I have are that his lecture notes are absolutely unreadable (he writes them down on his computer, and his handwriting is atrocious), and that more than the one or two theoretical homework problems he assigns (rather than number-crunching problems from the book) would be useful.\nThe students are the real problem in this class. Evidently it's a requirement for OR, FE and econ, so it's made up mostly of students who obsess constantly about their grades but who are breathtakingly uninterested in the material (or, for that matter, in anything other than being rich). Highlights included gasps of outrage at the aforementioned midterm curve, and a large puddle of saliva on the floor after a sample problem involving a financial instrument.\nWorkload:\n10 psets -- I started most of them the night before they were due and had no trouble.\n1 midterm, 1 final -- if you do better on the final, he drops your midterm completely\nNo psets dropped, but a generous helping of late days.\n"
        },
        {
            "course_name": "W4150 Introduction to Probability and statistics",
            "review_date": "January 02, 2010",
            "review_content": "\nEverything that's been said about Gallego by previous reviewers has been pretty much spot on.  Basically, you'll fall under the impression that you are learning something from his lectures and the hw, but when it comes to exam time, he throws all sorts of theoretical questions at you, and you're pretty much screwed.  This dilemma is like being taught how to hammer a nail, then being expected to build a complete house.  Don't get me wrong, Gallego is a friendly guy, but his exams will make you think otherwise. \nTo succeed in this class, you need to know the theoretical stuff cold.  Focus on his handouts and review his practice exams until you know the material inside out.  Use your cheat sheet wisely: copy down the theoretical practice exam questions and their solutions (this saved my butt on the final.)\nThis class would have been bearable if we were given homework that actually reflected the content on exams.  For an \"intro\" 4000 level class, it felt unnecessarily complicated at times. (Compared to Polvani's Complex Variables E4204 class which I took concurrently, it was much harder.)  On a positive note, after taking this class, you probably still learned more than the people taking Stat W1211.\n\nWorkload:\nHW: 10 easy problem sets (although the last one had two tricky proofs on it-an aberration from the usual number crunching problems) [15%]\nMidterm- mean was 56 (keep in mind there were LOTS of grad students in this class): in retrospect, not too bad, but tricky theoretical stuff is tested [40%]\nFinal- insane: without that cheat sheet, there's no way I would've passed. [45%ï¼Œwill become 85% if you do better on final than midterm]\n"
        },
        {
            "course_name": "W4150 Introduction to Probability and statistics",
            "review_date": "December 23, 2009",
            "review_content": "\nThis class is totally schizophrenic.  On the one hand are the friendly lectures and problem sets.  On the other hand are the TERRORIZING EXAMS.  Twice a week, you sit down with Guillermo, and he explains, quite clearly, how everything works, and how to apply all of the methods.  Once a week, you sit down with your textbook, and learn how to use the methods yourself.  Friendly!  Straightforward!  Yay1\nYou're tempted into statistical complacency.  It becomes an easy routine. YOU ARE BEING FOOLED!  You think you understand the material? YOU DON'T KNOW ANYTHING!  Exams don't test a skillset that you would develop listening to lectures, or reading the book, or completing the problemsets.  They tests a fundamental understanding of the statistical methods.\nThe fundamental disconnect between the domain of knowledge tested by the homeworks and exams makes it so that by the time you have the opportunity to study for the exams, to a large extent, it's already too late.\nWorkload:\nEasy weekly homeworks straight out of the book.  2 very difficult exams.\n"
        },
        {
            "course_name": "W4150",
            "review_date": "July 06, 2005",
            "review_content": "\nThe man videotapes his lectures?  Had that been true it would've made my life a lot easier.  His class was hell.  Even though he seems to be an excellent instructor who cares about his students, most of the class felt that his approach was unnecessarily difficult.  Practically all of the lecture notes and the exams in this class are highly theoretical in nature, which is incredibly painful for those of us who were truly taking stats for the first time.  Don't get me wrong, Prof. Gallego is articulate and organized.  I'm sure his proofs of all those statistical theorems are absolutely spotless...but that doesn't help if most of the class would never understand them anyway.  In none of the exams was the class average above 60, and being as brilliant a statistician as he is, I expected the curve to have been a bit more generous.  Avoid this class if possible.   \nWorkload:\nWeekly problem sets--those were straight out of the book, so doable.  Midterm and final--yeah, good luck with those.\n"
        },
        {
            "course_name": "W4150 Probability and Statistics",
            "review_date": "June 14, 2005",
            "review_content": "\nGallego assumes that you know a lot more than you do to begin wtih. Of course, this is an advanced class and the students know basic statistical methods.  However, he presents his information in proofs that are confusing and difficult to understand.  However, if I look the same information up in the textbook or elsewhere, I realize that what Gallego was trying to teach is something relatively simple, or at least understandable when presented more simply.  Basically, he unecessarily complicates theories and equations.  The textbook was excellent, however, so that helped when I had to teach myself material. The fact that he did not prepare us well was apparent when most of the students scored between about 20-30 points on the 100 point midterm; he was forced to give a makeup midterm.\nWorkload:\nweekly problem sets, usually not too taxing; very difficult midterm and final\n"
        },
        {
            "course_name": "W4150 Introduction to Probability and statistics",
            "review_date": "April 21, 2005",
            "review_content": "\nThis man is a good and articulate teacher but rather intense for someone who is not a SEAS student and wants to just an advanced knowledge of statistics. Dont let the \"introduction\" bit fool you, within a few weeks you'll be in deep s$$$ if you don't keep up with the substantial amount of material covered everyday. I had some problems with family in the middle of the semester and had to leave for a week and when i came back i was absolutely lost in the class and he was absolutely unyielding about giving me an incomplete. On the other hand I had a friend in the class who was a freshman stats major and did just fine because he was regular and dedicated. Last thing: theres like 5 tvs in a 40 person class and he keeps calling to an invisible technician to change the focus of the camera so that the video (for students who are taking the class from home) can keep up with him. Its definitely surreal. \nWorkload:\nIntense (for a CC econ major). Problem sets every week, a midterm, a final. \n"
        }
    ]
}