{
    "prof_info": [
        {
            "prof_name": "Benjamin Dorvel",
            "prof_id": 11370,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate German I",
            "review_date": "November 20, 2013",
            "review_content": "\nHerr Professor Benjamin is actually the best. He seems like he's super strict at first but he definitely relaxes after the first week or two. That being said, he will definitely force you to learn the language and participate in class. He is always willing to spend extra time on a particular topic if you need extra help and he makes grammar almost fun to learn. His sense of humor is darkly hilarious and he will make you laugh at least twice during each class. He teaches German in a way that is both cogent and conducive to increasing fluency and eloquence from the bare-bones grammar. On that note, he's a stickler for correct pronunciation. He will literally make you try to say a word ten times before you get it right. His knowledge of Germany's culture and history are likewise impressive.\nALSO, get him to talk about Kafka because he starts geeking out and it is literally the most adorable thing ever.  \nWorkload:\nSmall amounts of nightly homework, vocab lists every two weeks, and three short essays.\n"
        },
        {
            "course_name": "Elementary German I",
            "review_date": "January 14, 2012",
            "review_content": "\nBenni is simply the coolest professor anyone can wish for.\nFirst of all, he's a good teacher. He engages his students in class with small talk and simple questions, all asked in German. He waits patiently for your attempt at a reply and he will rephrase himself, in German if you do not understand him. Beyond conversation skills, he'll also repeatedly stress the importance of grammar and vocabulary. And in case you still feel unprepared for the tests, he'll have a revision, \"aktive wiederholen\" before every test.\nSecond, his classes are fun! He's only in his 20s, he's cool, fashionable, humorous and very chill. He makes jokes all the time and is simply a likable person. The class is worth your time just for the entertainment value.\nTake his class! :)  You'll learn more than just the stuff from the textbook. You'll learn about contemporary German culture, German slang, and you'll love it!\nWorkload:\nWe covered about a chapter every 1~1.5weeks and for every chapter, there are 1-2 assignments, a test, and at most one composition. It's really manageable and he's nice about workload too. \n"
        }
    ]
}