{
    "prof_info": [
        {
            "prof_name": "Mark Tribe",
            "prof_id": 2456,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Open Source Culture: Intellectual Property, Technology, and the Arts",
            "review_date": "January 31, 2005",
            "review_content": "\nFantastic. \nMark is an amazing instructor.  I believe that this is the first course he has taught at the university.  However, let's not hope it's his last! Officially, he is director at the School of the Arts and these interdisciplinary seminars are his own construction.  From what I gathered, Mark has dveleved into the art world a bit and has now settled into devoting his time with art-based theory groups and organizations, mainly over the web.  The weekly course ran juxtaposed to a series of Technology and Art lectures put together by Mark.  This guy seems to know everybody in the Tech art scene.  Speakers would come to class after the lecture the previous night allowing seminar participants to have more intimate conversations with some amazing lecturers and artists. Definitely a highlight of the course.  The rest of the class time was devoted to 'open sourced' discussions of the course topic with Mark predominantly allowing for student-run discussion and interjecting with his own amazing insight.  Do not be scared away by such an approach!  I would guarantee that any course Mark chooses to create will draw an amazing group of students who know how to have intelligent conversations and don't only perk up for those brownie points.  Mark was aptly able to allow the students to mold the class based on their own unique perspective.  Open Source was understood by the lawyers, the landscape history grad student, the art history grad student, a computer engineer from NYU, theatre majors, and econ major, and an art theorist.  Bottomline: grab any class you can with Mark!\nWorkload:\nweekly readings; one presentation; and a final project. all assignments except for weekly readings can be completely outlined by the student. this class is what you make of it.  i suggest you make a lot out of it and you won't be disappointed!\n"
        }
    ]
}