{
    "prof_info": [
        {
            "prof_name": "Elizabeth Keenan",
            "prof_id": 1297,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "August 06, 2012",
            "review_content": "\nGreat professor. Professor Keenan kept most of the lectures lively with her enthusiasm. Her knowledge on the subject is incredible; it's almost a shame that we sped through many of the topics towards the second half of the semester rather quickly. The class definitely starts off slow, especially for people with prior basic music training such as myself. But over time, especially when the class enters the Romantic Era, things move along a lot quicker. \nDefinitely don't fall behind in the assignments. As with most core classes, it's often easy to forget the sporadic assignments (such as two page response papers) scattered throughout the semester for this class. Stay on top and check the syllabus frequently (the assignments are rather straightforward anyway). \nIf you pay attention in class things will be much easier. The exams are based off the lectures and everything you need to know is always written on the board, which makes it easy to take notes. If you're willing to put in the effort, this class is well worth the time. For those even mildly interested in music history, one can learn a lot in this class. \n\nWorkload:\nSix 2 response papers over the course of the semester, 1 midterm and a final (consisting of multiple choice, listening ID's, and an essay), and one final paper on a live performance (ours was La Traviata). Mild amount of reading.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 29, 2010",
            "review_content": "\nKeenan-Penagos took the class seriously, but her personality makes it tough to take her seriously.  She tends to laugh at the end of every sentence, whether it's funny or not.  It was extremely distracting and it added a lot of dead time to the lecture.  Class moved very slowly, with lots of small talk before, during and after any statements of importance.  If you are a down-to-business type like me, you will be frustrated throughout the semester.  That said, the girls in the front of the class seemed to love her personal style.  \nThe readings were approximately 70 page book chapters, each of which described the first performance of a musical masterpiece like The Rites of Spring.  The readings added an historical element not delved into during lecture, but they just did not feel necessary.  The required one-page precis for each reading was very busyworky, if I might coin a term.  \nMidterm and final were easy enough.  I did develop some appreciation for the subject matter, but I'm really just glad that this box has been checked.  \nWorkload:\nAbout 10 seventy-page book chapters, with a one-page written precis for each.  One midterm and final. Class participation and, sigh, attendance.  One four to six page thesis paper based on a live musical performance. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 15, 2009",
            "review_content": "\nHer lectures are very interesting---she's funny. And who doesn't like hearing about the crazy composers' lives, and listening to the music.  Her tests are straightforward and fair. I feel like I learned alot without being tortured by the workload. One word of warning though...she lets students ask alot of questions and have freedom to interject. IMO, it got out of hand and we got behind the syllabus as a result and the last half of the class was kind of disjointed and rushed. But overall, her class was a pleasure, and you learn and have fun! Can't say that about too many classes at CU.\nWorkload:\nVery manageable load. The readings are interesting.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 28, 2008",
            "review_content": "\nWas the previous poster in the same class that I was?  Keenan definitely has a  self-deprecating sense of humor that someone may misinterpret as rabid love for pop musicians, but she's a great teacher.  Her lectures are solid, easily digested, and incredibly clear, and she is a tough but fair grader.  \nIf you're looking for the class that allows you to BS your way through it, like so many classes in the Core, Keenan is not the professor for you.  If you want to learn about music history (and cool fun facts about musicians), then she's awesome.\nWorkload:\nTypical music hum stuff, 2 concert reports and a couple short writing assignments.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 14, 2008",
            "review_content": "\nShe's nice, but a terrible instructor. She wasted class time talking about her Justin Timberlake experience, referenced him a few times in class, then skipped the entire genre of Jazz!  I got the constant feeling that she didn't actually like any of the classical pieces we focused on.  Avoid her course at all costs!  We have some amazing instructors, Keenan isn't one of them.\nWorkload:\nAverage\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 23, 2002",
            "review_content": "\nI took this class at 9am, and dang was that PAINFUL. She's just really boring. Her lectures consist of outlining the textbook chapter by chapter, as if the textbook wasn't boring enough on its own. Going to class was a waste, yet she took very careful attendance. I was impresed by how she knew all of our names by the second class, though. She's a nice person...just a really boring teacher.\nWorkload:\nstandard music hum stuff\n"
        }
    ]
}