{
    "prof_info": [
        {
            "prof_name": "Jarod Alper",
            "prof_id": 3492,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "December 31, 2010",
            "review_content": "\nComing from the perspective of a student who didn't breeze through this class, I'll have to agree with the review below me. Professor Alper is friendly, has good intentions, and uses a specific method of explaining a concept both through theoretical and geometrical example. This, I found was the extent of his good teaching practices. I think this may be partially the fault of having such a large class (no doubt because of his silver nugget rating), as he did mention that he preferred smaller class sizes.\nLectures often consisted of a review of last class, followed by that day's new concepts and then examples. I am personally good with mathematical theory, but I often stumble over problems or make small, stupid errors. Sadly for me, so did Professor Alper on more than one occasion. I don't think he prepared problems for class, so we'd often spend ten, twenty minutes on his puzzling through problems that often remained unsolved and thus completely unhelpful. \nI stopped attending lecture as well, both because I understood the material faster with the book, and because at least the solutions manual actually solved the problems I practiced in the book. I started to get much better grades on the homework and tests, the latter being doable and a little more challenging than the assigned homework.\nI should also mention that my roommate was taking another Calculus III section at the same time I was, and her homework assignments were often half of mine.\nAlper isn't bad, but yeah, I don't know if he deserves that silver nugget.\nWorkload:\nApparently more HW than other sections, with 10-15 problems a week; generous practice problems and exams during midterms and finals\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 23, 2010",
            "review_content": "\nVery straightforward class and teacher. However, I don't think Alper merits a silver nugget. Don't get me wrong - he is a nice guy and willing to help, but his teaching seemed average. After the first few classes I stopped going because I figured I could learn more efficiently from the textbook. Other people in my class that I talked to who went to class weren't raving about his teaching either.\nThe course was graded very generously, so certainly no complaints about the class. I was able to get solid As on all the exams by just memorizing the formulas. The extra credit was really generous as well.\nWorkload:\nWeekly problem sets (a breeze, with extra credit. I had a HW average of about 107), two midterms (very simple, no tricky questions. over 80 on the 1st was an A, over 75 on the 2nd was an A), and final (seemed to have same difficulty level as midterms - easy)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 26, 2009",
            "review_content": "\nJarod Alper. is. the shit. He was the best math teacher I have ever had. He explained concepts fully and had a talent for making really tough three-dimensional concepts understandable even when working with a lowly two-dimensional board. The class itself is still pretty difficult (see: tough three-dimensional concepts) but Jarod had a knack for making most things make sense (except for when he tried to re-derive Newton's proof of Kepler's laws -- that was an utter disaster). What I am trying to say is, if you have the option of taking Jarod Alper, then take him. That's really all you need to know.\nWorkload:\nHomework problems which are very doable if you attend lecture. He also gives extra credit -- enough that my end of the year average was above 100%, which is very nice. The tests are hard but also very completeable.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 29, 2008",
            "review_content": "\nVery straightforward teacher and class.  He followed his own syllabus to the point, and we never really lost pace.  Alper really does try to explain examples and concepts fully.  This was his first semester teaching so it kinda seemed like he might be a little nervous at first, but it got better throughout the semester and did not affect his teaching.  Not sure about the curve though, the class was generally easy so a lot of people did get high.  Easy A if you're a math person I would say.  I recommend taking Alper if you can.\nWorkload:\nWeekly homework set (straight from the book, always with extra credit), 2 midterms (very fair), 1 final (a bit tougher, but still fair)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 26, 2008",
            "review_content": "\nExcellent professor. Professor Alper (or Jarod, as he encouraged us to call him) was brand new this semester, having just completed his Ph.D. last year, and I hope he stays at Columbia, because he was one of the best instructors I have ever had.\nUnlike many other teachers, Jarod has a genuine desire that his students learn and understand the material, which means that he will periodically stop during class to make sure everyone understands what is going on. He teaches according to the book (and which Columbia calc professor doesn't?), which is good, because both he and the book are straightforward and easy to understand.\nIf you pay any attention in class at all, the homeworks will be a breeze. Not only are most of the problems similar to example problems or similar to problems in the solutions manual, but he gives a lot of extra credit problems (8 points or more per assignment is typical). It is very easy to get an average of over 100% on the homework, and these were worth 20% of our final grade (the same as each of the midterms), so it was a valuable way to pick up points.\nProfessor Alper promised to make the exams similar to our homework problems, and he more or less stuck to this promise, which meant that if you understood all of the practice problems he gave, you would get at least a fairly good grade on the exam. (The second midterm, which Professor Alper tried to make 'difficult', was a fluke, and ended up just being too long for the time allotted).\nThis is not to say the class was easy - I know many people who did not do well. However, the difficulty in the class comes from the difficulty of the material, not from unclear teaching or unfair examinations, which is one mark of a good class.\nI hope Professor Alper does not change anything about the way he teaches his class - I found him to be clear, fair, and approachable. The TAs who graded the homeworks and exams this semester were abominable (making mistakes of 10% of a final grade or more), but that's a separate issue and not the fault of Professor Alper who tried to fix these errors wherever reasonably possible.\nWorkload:\nOne homework problem set per week. Lots of extra-credit opportunities on the homework, which is worth 20% of the final grade. Two midterms (20% each), one final (40%). Exams are curved, but the homework is not (though you shouldn't need a curve on the homework).\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 25, 2008",
            "review_content": "\nJarod, especially for a first-time teacher, is gifted. Lectures consist of him explaining concept on the homework, so reading the textbook is not required. Midterms are challenging but manageable, as long as you don't get behind. Given the stereotypes surrounding mathematics departments, it was nice to have a native english speaker teaching the class.\nWorkload:\n1 small homework set/week, 2 exams, 1 final; The work required is light to reasonable, never overwhelming.\n"
        }
    ]
}