{
    "prof_info": [
        {
            "prof_name": "Tyler Williams",
            "prof_id": 3301,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "February 27, 2008",
            "review_content": "\nThis is a fantastic class, or it was with Tyler at least. You learn the language at a great pace and should be able to read and write perfectly by the end of the semester. You learn something new almost every period. Tyler was one of my favourite Professors, he is young, energetic, clearly passionate about the language, good-humoured and very intelligent. He will take time out to talk about big issues, what's going on on campus (ie at Ahmadinejad time) because he is passionate about what is happening. \nWorkload:\nHomework every night. Totally possible to do in 10-20 mins but you are definitely better off spending 30-40, it will help you in the long run and you'll get a better grade.\n"
        },
        {
            "course_name": "Hindi",
            "review_date": "December 09, 2007",
            "review_content": "\nWithout much teaching experience, Tyler ji still understands how to help his students learn.  My five-person class had a lot of variation in each student's Hindi skill, but Tyler worked well with all of us.  His class was challenging, but definitely not impossible.  He always welcomes questions and is available for extra help out of class.  It was nice to have a professor who really cared about our opinions and ideas; we had discussions in Hindi about political issues, campus events, etc to practice speaking.  He is very knowledgeable, having just spent five years in India.  Also, it's nice to have a young energetic teacher, who hasn't lost his passion for his subject.  I definitely recommend Tyler's Hindi class.\nWorkload:\nManageable!  Reading for each class, a few worksheets at the beginning of semester.  Some 1-2 page compositions.  Two oral quizzes.Two written quizzes and one cumulative final exam.He is an easy grader, and all this work really helps you learn the language.\n"
        },
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "November 12, 2007",
            "review_content": "\nTyler is awesome, he's new to MEALAC and didn't stick to the syllabus of the class but he is definitely the better pick for Hindi teachers. Like other young professors he is energetic, interesting, and ready to help with any problems and questions. There's daily homework which is crucial to a good grade. I did my homework in 15 minutes and got a terrible homework grade, it's better to spend 40min-an hour on homework. Several oral and written quizzes which are manageable and easy to get a B/B+ on. The final is very important and requires a good amount of studying. He also takes into account a persons experience with the language and looks for the improvement, so non Indian and non native speakers are not at any disadvantage. Overall he is an amazing person and has been my best professor this semester. \nWorkload:\nDaily homework, 2 oral exams, 2 written quizzes, 1 midterm (counts just as oral exam), and final. \n"
        }
    ]
}