{
    "prof_info": [
        {
            "prof_name": "Brian Kane",
            "prof_id": 3054,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 15, 2007",
            "review_content": "\nOverall a good experience. The actual material felt a bit more untraditional than most classes, but Brian Kane made the class fun and worthwhile. He's passionate about the actual music and doesn't make you do a bunch of bullshit work. Our midterm was take home, our final was open note/\nopen book, and the hardest part of the class is memorizing the different pieces of music for IDs (and even that isn't too bad). You learn to think about music rather than memorize a bunch of dates, composers, and styles. \nWorkload:\nlight, not too hard, just demonstrate some effort- one assignment, one concert report, one midterm, one final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 10, 2006",
            "review_content": "\nThis was a great class with a great teacher.  He specially arranged for live performances during class on multiple occasions.  This made class much more interesting, engaging, and educational than just sitting listening to a recording would have been.  He really knows about the subject and cares about students.  He was always accommodating and friendly and often cracked jokes during class.\nI learned a lot about classical music and the new styles that are coming into favor.  The more recent pieces were really bizarre.  He brought them out more than other teachers. It was really great to learn about and hear something new.\nMaybe the best thing about this guy is that he's so into the material that he doesn't want to waste class time for as many assignments as other teachers give.  We only had one midterm and one concert report while most sections had two of each.  We also had only one other assignment during the year.  Despite this I still feel like I learned more than my friends in other sections.  It was a great experience.\nWorkload:\nOne concert report, one midterm, one assignment, attendance at one opera \nless than other sections. (this may change as this was his first semester teaching the class)\n"
        }
    ]
}