{
    "prof_info": [
        {
            "prof_name": "Sebastian Currier",
            "prof_id": 539,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "August 24, 2005",
            "review_content": "\nI honestly cannot even imagine how a music professor could be better than Currier. There were people in the class who got annoyed that they were sick or busy and missed a class. If I didn't realize that he is completely devoted to his students and classes are discussions, I'd be in a daze for 2.5 hrs a week as to how amazing this man is.\nA welcome contrast to the Diatonic way of teaching, Currier uses his class to explore real music in every aspect from theory to history to even the science, math, and philosophy behind it.\nTo echo a previous review, Currier is one of the nicest professors I've ever met and genuinely treats his students with respect. He definitely does seem unaware of the absolute affection everyone in that room feels for him.\nTake every class Currier teaches if you can and talk with him as much as possible. Go to office hours and pick his brain. He is a rare gem in the otherwise inconsistent Music Dept.\nWorkload:\nSurprisingly light with sporadic composition-based homework assignments (none of those endless exercises from Diatonic). Midterm / Final change up a bit with a bit of in-class analysis, take home composition (Fugue, Chopin-esque piano piece) and longer piece analysis (Fugue, Sonata). So-called required (but rarely attended) Friday sections by TA Victoria to go over take-home work; focused mostly on midterm/final preparation with one-on-one sessions. Other than that, it's just getting involved in class discussion.\n"
        },
        {
            "course_name": "20th Century Composition",
            "review_date": "May 12, 2004",
            "review_content": "\nHe's great.  He leads the class through some really interesting pieces in a relaxed, conversational style.  There's plenty of opportunity for discussion, but Currier keeps it focused.  I learned a lot and had  a good time.  Wish the additional hour had been better attended, but that's not really his fault.\nWorkload:\nA few short (5 or 6 measures) compositional assignments using techniques we discussed;  a one page analysis of a piece;  a final project that could be either analysis or composition.\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "February 11, 2004",
            "review_content": "\nI've had many good professors at Columbia, and some really great profs.  And I've had Currier...who will stand out in my mind as one of my Top 5 favorite teachers/professors of all time.  The man really knows how to teach and how to make his class enjoyable.\nAdditionally, he is the nicest guy on earth....I'm fairly convinced he is also unaware as to the degree that he is adored by his class.\nHighly, highly, higly recommended\nWorkload:\nNothing bad - a lot of analysis\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "January 04, 2004",
            "review_content": "\nFantastic professor. Currier knows everything about Bach inventions, preludes, and fugues that could ever be said or written, and heÂ’ll make you great at analyzing music to death. Even better, there is little homework, and if youÂ’re enthusiastic about the class all the way through, the projects are no problem. Very laid back, canÂ’t say that about many professors I had this term. Take Susser or Kramer and youÂ’re just slitting your own wrists. \n\nWorkload:\nComposition of an invention, analysis of a prelude and fugue, and a midterm (no final). Nothing bad, much profit with little pain. \n\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "December 14, 2003",
            "review_content": "\nPossibly one of the best professors I've had.  Currier knows how to explain material clearly, and is a very interesting lecture.  His assigned homework isn't bad, and the midterm and final aren't particularly difficult.  It's a theory class, but amazingly enough, it's a fun theory class.\nWorkload:\nNothing bad at all.\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "May 30, 2003",
            "review_content": "\nProfessor Currier allows you to get out of the class what you put into it.  That's really comforting if you aren't confident in your skills, and if you are confident, then you can do some really hard-core work.  He will not disappoint you.  Just don't expect to follow the syllabus.\nWorkload:\nThe midterm, final and projects are hard, but he's a very compassionate grader.  And biweekly homework assignments aren't bad.\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "May 14, 2003",
            "review_content": "\nSecond semester only. Currier's big mistake was passing out a syllabus, because he only got about halfway through it. But when you ignore the expectations that he set up, this is a great class on its own terms. You won't be doing endless counterpoint exercises in here, you'll be looking at real music and analyzing it to death. Currier is very thorough, extremely intelligent, and a nice guy who genuinely wants everyone to do well. He teaches theory chronologically so that we can see how the concepts and techniques developed instead of looking at them in isolation, making the course far less dry than your average music theory class. He's definitely the best theory teacher at Columbia; Kramer does an outstanding job imparting the basics, Edwards is a waste; but Currier will really get you thinking about music in a new and more systematic way. Highly, highly recommended. \nWorkload:\nQuite light, but what there is is challenging. Take-home midterm and final are both in-depth analyses of difficult pieces. Variation on a Schumann piece, sporadic shorter homework assignments. Fair grader.\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "December 15, 2002",
            "review_content": "\nCurrier is a really solid professor. Sometimes he moves too quickly through material without realizing that the majority of his students are staring blankly at the board, trying to figure out what in the hell he's talking about, but this problem stems from that fact that he's just a really brainy guy as well as an enthusiastic professor. He's incredibly nice, laid-back, and available if you need help with anything. If you ask him to clarify a concept that you're having trouble understanding, he will make things clear for you right away. Furthermore, the TA [Hiroya] is cool as all hell - smart, enthusiastic, helpful, and a great teacher. I regret that I cannot take the second semester of this class with Currier due to scheduling conflicts, because I really like him as a professor and as a person.\nWorkload:\nRelatively light. A couple of weekly homework assignments [those disappear after a few weeks], a Bach invention to be performed by a student ensemble in class, and a final project. These are not hard, and the professor and TA will help you with all of them. Midterm, no final. Grades were on an unknown scale, but he is very fair.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "December 31, 1999",
            "review_content": "\nHe's relatively new. Looks like a lovechild of Beethoven and Woody Allen. This is possibly the easiest class one could ever take at Columbia. Case in point: I looked at my transcript and both semesters (it's a year-long class), more than 75% of the class received A's. Now, you do the math. He teaches in a pretty straightforward manner. He's very nice and patient to whatever you may ask him during office hours. If his office hours don't match your schedule, you'll inevitably run into him at either Ollie's or Riverside Park. This man is ubiquitous. The tests, midterm and final are all E-A-S-Y. Homeworks are graded on some unknown scale, but also easy. You will have to write a 4-part composition at the end of the semester and a student string quartet will perform it in front of the class. Pretty much anything goes for that assignment.\n"
        }
    ]
}