{
    "prof_info": [
        {
            "prof_name": "John McWhorter",
            "prof_id": 4244,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Linguistics",
            "review_date": "January 03, 2017",
            "review_content": "\nProfessor McWhorter is one of the best lecturer I have encountered at Columbia. A lot of animated examples. A lot of story-telling. He also opened up the class to Q&A; and discussion. Before the midterm, the class followed the textbook more closely whereas after the midterm you really had to pay more attention to what he said in class. At times, John was an awesome tour guide for newcomers to this field and he opened up my mind to a life-long adventure of languages and linguistics. He also recommended a lot of other important linguists and books and I appreciate this. I will give a Gold Nugget for professor McWhorter!\nThe TAs are very helpful as well. They are very chill and approachable. Alma explains concepts really well. The TA office hour is a great opportunity to interact with classmates as well. I have found many classmates in this class are somewhat more brainy and witty than those in my Econ core classes and this really humbles me. In conclusion, I enjoyed the class, the TA office hours and the company of my witty classmates. \nWorkload:\n10 PS. 1 midterm. 1 final. I was lucky to have awesome TAs who gave great exam reviews and thus I didn't have to worry much about the exams. \n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "December 24, 2016",
            "review_content": "\nMcWhorter is a fantastic and extremely engaging lecturer. Not only is he clear about linguistics concepts but he also illustrates them through very interesting, relevant, and sometimes personal examples. I was actually excited to come to class each day because I knew it would be a treat.\nThe TAs for this course were also awesome. They led many review sessions and provided useful tips for succeeding on the exams. Their office hours were also fantastic for understanding how to do the homework.\nThe problem sets can be slightly challenging and tricky. They definitely force you to apply the concepts that you have learned in class and to think logically. However, if you come to office hours, they all become very understandable. The exams are extremely straightforward and actually easier than the problem sets. As long as you put in an honest effort into the problem sets, the exams are very easy.\nI definitely recommend this course! \nWorkload:\nNine problem sets, each worth 7% of the grade\nMidterm and final, each worth 18.5% of the grade\n"
        },
        {
            "course_name": "Introduction to Linguistics",
            "review_date": "December 11, 2016",
            "review_content": "\nProfessor McWhorter would be a great tour guide. He is endearing, funny, but he doesn't give much content. I could have learned this ENTIRE semester in 2 hours maximum. My friend said that \"he's like icing without the cupcake.\" It was very frustrating to sit through over an hour of maybe two sentences of actual content that I could take notes on and think over later. Linguistics is a fascinating field to me, but this course was a waste of my time.\nExamples: the class on syntax was simply examples drawn on the board with ZERO explanations given. The TAs would grade differently based on what they knew, and one TA would tell me an answer while another TA would mark it wrong on my homework. The class on writing systems felt like an abstract on Wikipedia where McWhorter clearly didn’t even open any of the content portions of the page. We learned more about his love life in college than about sociolinguistics. \nIt's also strangely difreview_content. review_content sessions are a MUST (they give all the answers) before the midterm and final. The homeworks are difficult and must be done by a consensus vote of 20-30 people. Go to office hours (or find out what happened in office hours from your 20-30 friends), but you may still get the question wrong if the TA from office hours isn't the same TA that graded your homework.\nTLDR: This class is a waste of your time. Read a book on it and spend your tuition money on something *anything* else. If you really want McWhorter's comedy, then watch his TED talk, which he'll play for you during class anyways because he can't be bothered to teach you. \n\nWorkload:\nNot much reading past the midterm, weekly problem sets you need a study group for, and a midterm and final.\n"
        },
        {
            "course_name": "The Languages of America ",
            "review_date": "July 30, 2015",
            "review_content": "\nFor Linguistics Majors (yes we exist): This class might be the chillest way to get through the language contact requirement. There's weekly readings of somewhere between 20 and 60 pages, all interesting. McWhorter facilitates conversation well, but you sometimes feel it's a 50/50 split of academic discussion on sociolinguistics in America and hanging out with him.\nNotes to others (often American Studies people): There's a lot of underlying linguistics stuff in the readings/discussion that AmerStudies people in my section found to be new, but it was definitely nothing insurmountable. \nI found that the mixed crowd of linguistics and Amer studies kids brought a richness to the discussion.\nThe final paper is easiest when you start getting sources a month before it's due. Choose a topic that fits your interests. Also, he's not kidding about getting it in on time. \n\nWorkload:\nNot bad. Weekly reading, 20 pages final paper. People switch off bringing food for class. \n"
        },
        {
            "course_name": "Introduction to Linguistics",
            "review_date": "May 05, 2013",
            "review_content": "\nProfessor McWhorter is honestly the best! Take this class even if you aren't considering linguistics because he is such a good lecturer and makes the whole class so interesting. Sure, the problem sets might be challenging, but if you go to his office hours, he really helps so much, and you'll be fine. Plus, then you get to know him, which is awesome too because he is just great. I don't see why he doesn't have a gold nugget, personally, because he definitely deserves one.\nHe has been my favorite lecturer so far in my college career and I highly recommend this class.\nWorkload:\nWeekly problem sets, which are pretty challenging, but not impossible. The midterm and final are very easy, however; they're more just to make sure you showed up to his lectures, which you will want to do anyway because he is so good.\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "December 09, 2012",
            "review_content": "\nProfessor McWhorter's lectures are hilarious (seriously) and even in a big lecture, attendance is always near 100%. He is brilliant and passionate about the material and it's exciting to learn from him. However, his lectures are also circuitous and its references seemingly irrelevant. I would leave class with a handful of vague notes that weren't at all applicable to the upcoming problem set. This is perhaps also just the nature of linguistics, a vague field in and of itself. \nWorkload:\nWeekly problem set (1-2 hrs), 11 question midterm and final (about 45 minutes each tops). Office hours are essential for passing the course and find a TA who makes sense to you. I recommend P/D/F-ing the course. \n"
        },
        {
            "course_name": "The Languages of America ",
            "review_date": "May 16, 2012",
            "review_content": "\nProf. McWhorter is an outstanding teacher, but he shines more in lecture than in seminar, because in the latter he tends to take a back seat to the student discussion. Student discussion in a seminar is of course a good thing, but often this semester it was a bit chaotic because he didn't use a firm enough hand as moderator. \nThe material was interesting--we covered native american languages as well as immigrant languages, slang and alternative forms of english, and the influence of technology on language. Interesting topics, interesting readings, and interesting discussion--and you get more out of it the more you put in (do the readings). \nthis is an engaging, energetic, fun course that is not very demanding until the final paper. \nWorkload:\nworkload: 2-3 articles per week, class for 2 hours once a week, weekly one page responses (not summaries) to the readings, one 20 page end of term research paper on the topic of your choosing. keep in mind that McWhorter is not a very lenient grader, and the term paper counts for almost all of your grade--people whose major does not pertain to this subject might want to take it as a pass/fail to not mess up their GPA (unless they plan on cranking out a kickass 20 page paper). \n\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "December 21, 2011",
            "review_content": "\nMcWhorter is great--charismatic, undeniably knowledgeable, entertaining--and for the most part, Intro to Linguistics is a really great class.  I won't reiterate the other reviews, but here are two things you should be aware of when considering taking this class:\n1. The problem sets are pretty difficult, especially if you work on them alone.  I recommend having a study group and going to office hours for each one.  The difficulty often comes from very specific things you need to write in order to get full points that you otherwise wouldn't know to include unless you went to office hours.  Pretty annoying, but it's definitely possible to do well.\n2. People ask seriously inane questions during lecture.  Like an earlier reviewer indicated, any time McWhorter opened the lecture for questions, a horde of sycophants asks questions like \"This is some thing I've noticed in language that I thought was really smart of me to observe, do you agree that it exists?!?!\"  It gets old really. Quickly.  (Looking at you there, redheaded girl.)  DON'T BE ONE OF THOSE PEOPLE.  If you must, save it for his office hours.  Don't waste your classmates' time and only ask questions if you legitimately don't understand the content.\nOtherwise, I highly recommend the class.  You'll learn a ton, have a blast in lecture, and have a good shot at getting a solid A if you put a little time into it.  And aren't classes like this why you came to Columbia in the first place?\nWorkload:\nAlmost-weekly problem sets, midterm and final.  Very straightforward and manageable.\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "December 09, 2011",
            "review_content": "\nYou know when you are watching a highly acclaimed movie and you keep waiting for the good part?  The part that has made everyone rant and rave about it?  Although, this might be an unpopular comment, this analogy directly relates to my experience in Linguistics.\nI love Dr. McWhorter- he is passionate about the subject he teaches, is knowledgable, up to date, reasonable about expectations, and quite funny.  However, there were a couple of frustrating things about this course:\n1) Much of Linguistics I found very boring- sentence diagramming, what sounds are placed where in the mouth, etc., pretty much the entire first half of the semester I found uninteresting.\n2) The notes were usually full of tangents and were not clear- usually before a test I found myself asking what does this term mean?   Why is it important?\n3)  Both the midterm and final exam had oddly specefic questions from class on them- why?\n4)  The homeworks were quite hard.\nAlthough I found the second half of the course to be more interesting (full of sociology and psychology) I would suggest this course to solely interact with Dr. McWhorter.  However, for me, this class was not as easy or interesting as many of the previous reviewers made it out to be, and while I think I am earning an A/A-, I struggled a lot. I guess the good part of the class came when it was finally over. \nWorkload:\nChallenging homework every week, useless textbook readings (buy the book used if you must for the 1st half of the semester, but the readings were boring and mostly a waste of time).  Midterm and Final worth a total of 37% of the grade (not much).\n"
        },
        {
            "course_name": "Introduction to Linguistics",
            "review_date": "December 09, 2011",
            "review_content": "\nSave your GPA; take this course on a Pass/D/Fail.  Professor McWhorter's lectures may be entertaining at times but if he spent less time rambling and more time lecturing on relevant material, the assignments would not be so time consuming. \nSince the Linguistics department is very small if existent at all, the TAs are not grad students but students who have taken this class before.  The course started out with three TAs but had to add more to handle the volume of students who were having difficulties with the problem sets.  \nI would recommend purchasing the study guide even though it is not a required text or even mentioned on the syllabus.\nGood Luck!\n\nWorkload:\nAssigned readings, Nine assignments, mid-term, and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 29, 2011",
            "review_content": "\nI decided to post this after reading the previous reviewer describing Professor McWhorter as \"what every professor should be\". Granted, the class was an engaging discussion on current events and questions that seem to have no one right answer, and many of these discussions got heated really quickly. However, other than in the first ten minutes of class and when I was writing my weekly response paper, there was no mention of the texts or how they related in anything less than the most obvious way to what we were talking about. Perhaps because the professor I had for CC the fall semester took a completely different approach, I could not appreciate this style. There wasn't much said in class that illuminated, explained, or made concrete what we read at home. In my opinion, most of the discussions we had could have been conducted without having read the books. \nAll that said, Professor McWhorter remained an entirely interesting, charming and understanding person. This review should help if you know which style of Contemporary Civilization you prefer. \nWorkload:\nTwo essays with limited context in the texts and a midterm and final that both consisted only of passage identification (They were open-book and doable if you write down page numbers mentioned in class). \n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "May 16, 2011",
            "review_content": "\nJohn McWhorter is a fantastic lecturer. I never wanted to miss a class, as each one was filled with both important basic linguistic knowledge and many other vaguely related but equally fascinating tidbits. I really recommend this class to anyone with any interest in language or linguistics. McWhorter makes a lecture class participatory, making an effort to learn everyone's name and very willing to entertain questions and comments. His assignments may be a little intimidating at times, but he's very helpful and they end up making his exams a breeze.\nWorkload:\nAssignments almost every week that take anywhere from one to three hours, midterm and final (in class!)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 06, 2011",
            "review_content": "\nWow, define baller: John McWhorter.  This guy is what every Professor should be: brilliant, funny, down to earth, interesting, real, moderate, and not afraid to say what he is actually thinking.  I transferred into John's class the second semester after having an awful professor, and I am so happy I did.  It is amazing how much happier one is when one looks forward towards a 4 hour a week class, rather than dreading it.  I chose Columbia because of the core, and John McWhorter verified my selection with his teaching prowess.  I've never learned so much in such a little space of time and enjoyed doing so as much.  \nI ramble, but that's how much I love this man.  You should fight to get into this section.\nWorkload:\n1 midterm, 1 final, both open notes and not cumulative, and 2 1800 word papers on interesting topics.  So amazing.\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "January 20, 2011",
            "review_content": "\nIt's been said in previous reviews, but I'll say it again--this guy is knowledgeable, personable, at times downright rib-cracking hilarious, and capable of bringing fascination to any subject he touches. The review that says he's a God pretty much sums it up. He is as comfortable at the podium as on his living room couch, and the tone he set for the class was infectious--he seemed to bring out the best in all his students--the best inquisitive, positive qualities. Office hours (Introduction to Linguistics) were a 30 person weekly party that I looked forward to attending more than actual parties. His lectures were, naturally, also a delight to attend. \nIn contrast--to an almost amusingly absurd degree--was my experience with the TAs. I found them to be ignorant, difficult, and sometimes downright snide. Luckily I didn't have to experience them much. \nIf you take linguistics--or anything--with Mr. McWhorter, you're making a great choice!\nWorkload:\nWeekly homeworks that were downright puzzling at times, but doable, and actually fun if you met up with some class friends and puzzled them out together (a couple hours per homework). No attendance taken in class, but, as I said, lectures you won't want to miss anyway. Midterm and final were short; you need to know a very manageable amount of info. \n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "January 18, 2011",
            "review_content": "\nI was surprised to read the reviews below because while I agree that John McWhorter is in ways fabulous - funny, smart, engaging, often hilarious - the reviews have neglected to mention his disorganization, which ended up being pretty central to my experience in intro to linguistics.\nThe class was fun, but as mentioned, swerved off into seemingly pointless and endless question and answer periods. In the end I'm not sure how much real material we covered. \nThe problem sets were problematic in the same way. The TAs grading was all over the place. And so were the questions. Each set took me at least three hours, not because of the actual material, but because confusion over the questions asked - a problem I shared with almost everyone I spoke to in the class. When I sought out TAs to explain, they often had no idea what the questions wanted either. On one occasion a TA essentially gave me an answer - which another TA proceeded to mark incorrect when I turned the homework in. I think some of the problem set material went uncovered in class. I'm a good note-taker and a stay pretty focused, and yet occasional homework questions seemed entirely unfamiliar. In this way the textbook is helpful - while the readings never get explicitly referenced in class (and can be easily skipped, especially in the second half), the textbook (often sections never assigned) can be hugely helpful in filling in the problem set gaps. Otherwise, the earlier reviewers are right in calling it useless. \nIn the end the general chaos of Intro to Linguistics became more funny than frustrating, but still I can't help responding to the reviews I've read. John McWhorter is the man. But his class leaves a lot to be desired.\n\nWorkload:\nProblem sets, one a week. Easy in theory but confusingly worded. \nMidterm. Final took me 15 minutes.\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "January 18, 2011",
            "review_content": "\nOne of the best professors I've had. Very animated, funny, entertaining but also just a brilliant mind and a nice guy. He takes the time to talk to you after class if you have questions and to answer questions on the homework. I happen to love the subject matter but even if I didn't I'd imagine it wouldn't be too bad because professor Mcwhorter makes most anything interesting. His lectures can be a bit all over the place but if you make sure to just write down most everything he says you'll be ok. Also, the homeworks are pretty tough. If you don't have a knack for linguistics they can be very challenging but the TA's are very helpful and so is he. I'd reccomend using the TA's office hours for hw questions- a lot!\nWorkload:\nmanagable. 3 hour homeworks once a week. not very time consuming but can be challenging intellectually/ make you think a lot. the midterm was hard but fair and same with the final.\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "January 11, 2011",
            "review_content": "\nI'll add to the chorus here. Professor McWhorter is a phenomenal lecturer, with a great balance of anecdotes and information. He's just naturally engaging and interesting, and you'll always be interested in what he has to say, whether it has to do with descriptivism vs. prescriptivism or his cats. Basically, what you come to CULPA for is to find out whether or not you should take the class, and the answer with Professor McWhorter is, \"Yes, you should take the class.\" The rest of this review is basically filler, but perhaps it will help people know what to expect.\nI will add a dissenting voice to say that the class was more difficult than I anticipated. I would frequently stare at the homework blankly for a good thirty minutes before I started figuring anything out. And riddle-like is certainly the best description of the homework, and, in the opinion of more than one person I know in the class, riddle-like is also an apt description of the grading style. Nevertheless, with a good study group you can certainly figure out what you need to know for the homework, especially if you get in the habit of visiting the TAs or Professor McWhorter during office hours.\nAlso, make sure you go to class every time as the textbook is absolutely useless. Very interesting, but useless for the class.\nOverall, I would basically take any course McWhorter offers, because he's brilliant. He makes class interesting from start to finish without sacrificing learning, which is a pretty impressive feat. While I did perhaps have some issues with the mechanics of the class, ultimately the combination of the sheer amount of things you learn in the course and Professor McWhorter's engaging style of lecturing makes Intro Lingusitics one of the best courses I've taken at Columbia.\nWorkload:\nNot too bad. Homework is confusing, but doable, and shouldn't take more than 2-3 hours a week as others have said. Midterm and final are somewhere between moderate difficulty and easy.\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "December 27, 2010",
            "review_content": "\nMcWhorter is extremely animated, approachable, and a bit of an oddball. He'll regale you with stories about errant opossums, his kittens, and his neighbors - and give you a broad survey of the linguistics field in the meantime. His unofficial office hours became more and more crowded each week, and if you bothered to talk to him, you would inevitably develop a rapport. He has a great sense of humor and it's easy to see that he enjoys being in front of a classroom - bounding around, trying to remember people's names, sucking on his dish of candies... but I know that some people might have a problem in this class despite his charisma and how fun the lectures are.\nFor one, because it's difficult to seriously study all the areas of linguistics, he has his obvious biases - semantics is whatever, and pidgin languages and descriptivism FTW. Secondly, he entertains EVERY question. Every. Single. One. He has about two Q&A;'s in each class. While an open atmosphere never hurt anybody - especially at Columbia, where competition and performance seem omnipresent - it really does end up wasting time. There are going to be students in every class, especially linguistics classes, who feel the need to bring up their childhood, relatives, and language and how the concept McWhorter just taught may or may not apply, but they haven't made up their mind yet, so they're just going to talk about it during open forum, and blah blah blah blah as their classmates couldn't care less whether or not French/Mandarin/Croatian/Arabic/baby nephew/my neighbor/my father/et al subscribe to this obscure rule. If you think about the time we spend on the lecturer's and students' tangents, you realize we could have covered much more material in class. It could be annoying for somebody who wants a more rigorous introduction to the field, but it's not exactly unpleasant to have such a friendly welcome to the subject. \nThirdly, the homework can be a bit of a toss-up. Find a group to do homework with because asking either McWhorter or the TA's for help was an exercise in frustration - it seemed like they felt they had to give you the answer or not help at all. Often the TA's would get frustrated and act all pissy, which was unwarranted, especially because most of them were undergraduates and didn't fully understand the topics themselves. \nBut the good news is that this class is extremely easy. \nWorkload:\nVery light. The average couldn't have been more than 2 hours per pset. But to avoid wasting time reading the textbook, go to class - McWhorter will drop massive hints on how to figure out his riddle-like homeworks. \n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "December 21, 2010",
            "review_content": "\nThere are no words. The best professor I have ever had at Columbia or anywhere else. SO funny, SO intelligent, SO informal, the course was just an amazing experience. He spends roughly half of every class telling jokes or personal anecdotes which are rarely sleazy or corny, so the class would be laughing all the time, while at the same time getting all this knowledge that he had to give. \nHe structured the course in a very systematic manner and it covered everything from Phonology/Morphology/Syntax to Historical Linguistics to Speech Disorders. Truly an introduction in every word yet you learn a lot. \nPlus it was super easy to get a good grade. If you're remotely interested in any sort of language, take this class!!\nWorkload:\n60% (!!!) on homework which was super easy  - one piece of paper with a couple of problems every week, you can do it with your friends and get 100/100 on every one with no effort!\n20% midterm, 20% final - the midterm and final are normal exams - some multi choice, some problems (reconstruct word, write language family) and some essay-type answers. Nothing horrible.\n\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "December 18, 2010",
            "review_content": "\nProfessor McWhorter is a GOD. Best class I've taken since coming here. He is hilarious, smart, well spoken, engaging, easy to talk to, easy to get in touch with, easygoing, and wonderful. I looked forward to this class every week, even though it was very late (6:10-7:25) and during dinnertime. The material of the course is interesting, and he makes it relatable for students. \nGo to his office hours! He will be more than happy to sit and talk to you; about the class, any questions you have, or life in general. \nI've already declared my major, but this class made me want to change it to Linguistics. Moral of the story: I would highly recommend taking this class with him. \nWorkload:\nProblem sets every week. I'd recommend doing them with a partner, because they are pretty challenging. Shouldn't take more than a few hours though. Midterm & final, covering all class material, but not so bad. Fair. \n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "December 12, 2010",
            "review_content": "\nThis was a really fun class. I took it on a whim as an elective and was glad I did. McWhorter is a fantastic and engaging lecturer: enthusiastic, hilarious, incredibly bright, and personable. He strays from the book so you have to go to class, but that's hardly a chore with McWhorter. Very open to questions and participation (although sometimes a little too open, sometimes he should have told some over-talkative students to can it) and when asked a question he can't answer, will actually look it up and tell you instead of bull-shitting you like some professors do. Learned the names of a lot of the class, which is rare in a big lecture. The information is usually fascinating, and even the dry parts (phonology, for example) are made relatively interesting. The homeworks are tricky and sometimes graded harshly, but they are usually tricky in a fun puzzle-y way. Exams are very fair.\nWorkload:\nWeekly homework that takes no more than 2-3 hours.\n"
        }
    ]
}