{
    "prof_info": [
        {
            "prof_name": "Chen-Yun Lin",
            "prof_id": 3508,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "December 27, 2009",
            "review_content": "\nI took Chen-Yun Lin's class in the summer after having failed (yes failed!) the course in the spring. She's not an actual professor, more like a TA but you can feel the difference - she's smart, fresh, funny and she sometime styles her hair into pigtails. She's also chinese but you can actually understand her because she speaks slow which is a plus. And even though we had only six weeks to cover the course, she would stop if she felt that students were not understanding the material. I actually felt sad when the class was over. Definitely take her if she is teaching a class.\nWorkload:\nFive quizzes, weekly homeworks (summer!) and one midterm and final. Midterm and Final was harder than the homeworks but she is very fair. As I said, i failed this class before - with Chen-Yun Lin, i got an A- \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 18, 2008",
            "review_content": "\nI quite enjoyed Chen-Yun Lin's Calc II class. I mostly disagree with the previous review; I found the pace to be perfectly reasonable until the last few weeks of class. Lectures are a little dry but she's actually got a real sense of humor---you just have to listen very closely or you'll miss the jokes. She's very accessible outside of class, gives generous partial credit on tests and homework and used a very forgiving curve for final grades. All in all, I would certainly recommend Chen-Yun Lin for Calc II.\nWorkload:\nReasonable weekly homework assignments, 2 midterms and a final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 10, 2008",
            "review_content": "\nFor the first few classes, you may not be able to understand Chen-Yun because of her accent, but you'll get used to it eventually. What will continue to annoy you throughout the semester is that she assumes you know more math than a Calculus II student actually knows. She's studying really advanced pure math in graduate school and she'll sometimes go off on a tangent with a proof that relates to what you're learning but goes way over your head and isn't even on the test anyway. Her personality is adorable (she comes to class with her hair in pigtails with fuzzy pink scrunchies) but her pace is really too fast, and I had to review a lot on my own in order to really understand the concepts.\nWorkload:\nManageable. One problem set per week with an average of 10 problems. But if you want to do well on the exams, you'll want to do the extra practice problems she gives out with the homework.\n"
        }
    ]
}