{
    "prof_info": [
        {
            "prof_name": "Daniel Kato",
            "prof_id": 12872,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Race, Law and American Politics",
            "review_date": "May 13, 2016",
            "review_content": "\nThe reviews don't lie. I took this class because I thought the material sounded interesting - he is extremely tough. In class discussion if he doesn't agree with you , he will shut you down immediately - or just ignore you and ask if anyone else has any comments. \nBUT he is a pretty brilliant lecturer... that is, if you can keep up with his extremely fast way of speaking and jumping from topic to topic. On the days he had power points, note taking and keeping up with his him was a lot easier...but be sure to pre-download them to your computer because he will fly through each slide. \nHe does ask for opinions on how to make the class better... i think he is trying. But he is a tough tough professor...and sometimes NOT in a good way. \nIf you are up for the challenge take this class - the actually subject is very interesting, but be ready for a challenge...he's unnecessarily tough.  \nThe TA was absolutely fantastic, very helpful and graded the papers/finals! he was very helpful!\nAlso Kato does encourage you to come to office hours and send him drafts of your papers. He is very very helpful in office hours and same when you send him emails. His class is do-able. I actually enjoyed his class a bit more than the other reviewers below seemed to, but at times I was annoyed with how discouraging in class lectures he could be. \nWorkload:\n- HEAVY reading (books - 100 pages per night...or a selection of dense articles..or both)\n- 1 class presentation/summary with questions to spark class discussion on the readings due for that class\n- Midterm paper - argument (very tough...start early!!)\n- Final paper\n- Class participation (class attendance is taken!!)\n\n"
        },
        {
            "course_name": "American Political Development ",
            "review_date": "May 13, 2015",
            "review_content": "\nThis professor is a hardass. Like the other reviews say, he has ridiculously long readings, is very vague about his instructions, and generally has sass. But here's the thing, if you are up to the challenge intellectually, he will push you beyond what you thought you were capable of as a student. Especially because this class seeks to problematize and complicate most other branches in political science, it's necessarily very complicated. The papers are difficult, and definitely made me want to cry when I tried to refine my arguments, but Professor Kato is extremely kind if you go office hours and will sit with you until you feel you've reached a point of understanding. He may be come off as mean, but if you prove yourself as a hard worker he genuinely wants to help you succeed. I was tortured when writing each paper, but felt like I sincerely learned something after it was turned in. It does also take a while to figure out exactly what he wants from you in the papers--the book reviews are especially challenging--but if his answers sound vague it's really because he's trying to give you the freedom to structure your paper however you think is best. Just read the examples, and pay attention to the subtleties of his answers. \nTopics you read about in this course: the relationship between freedom & imperialism, the New Deal, mass incarceration, higher education financial aid. \n\nWorkload:\nTwo 4 page books reviews (misleadingly short for the amount of work put in), a 5-7 page midterm, and a 8-10 page final. Probably like 100-200 pages a class. \n"
        },
        {
            "course_name": "American Political Development ",
            "review_date": "January 29, 2015",
            "review_content": "\nWorst experience I've had at Columbia. Run away from this class immediately. \n- Has attitude \n- Unclear lectures\n- Sets very little expectations of what is expected in written assignments, so it's pretty much a stab in the dark \n- After said assignment is handed in- will bring up some obscure argument from the text and complain no one in the class got it. \n- One of those professors who went to a crappy school and in order to make up for his lack of personal acumen takes pleasure in showing up Columbia Students and giving them low grades. \n- Unrealistic expectations for class reading. Maybe at some lesser crappy school students have the free time to read 100 pages per class, not here. \nRun away. \nWorkload:\nDepends on the class, 2 papers (4-6 pages) and a final research paper (10-12 pages) \n \n"
        },
        {
            "course_name": "Race, Law and American Politics",
            "review_date": "January 15, 2015",
            "review_content": "\nI hate to sound like a broken record, but the previous reviewers are absolutely right about this professor. For the sake of avoiding stress, protecting your GPA, and being productive I would avoid any of his courses. It's unfortunate because the material itself is so interesting and the course had so much potential to be engaging and enlightening. However, this was thwarted by the incompetence of Professor Kato. Several times he didn't know the specifics of his own syllabus, and when questioned about the discrepancies, was sometimes rude in his responses.\nIf you have a TA in his class, count yourself lucky! It’s sad when the TA is basically your only hope for receiving more clarification on the frustratingly unclear assignments. Part of the reason why his class is so stressful is because his instructions for the papers are so vague and unhelpful. If you ask him for clarification, he will tell you to simply “Answer the question” as if that’s the insightful solution to the problem. However, the worst part by far are the readings-they are so long and he expects you to complete them in such a short amount of time that it's virtually impossible to keep up if you're taking other courses. Some of the readings are in fact interesting, but are hard to finish when you basically have 200+ pages to read for each class.\nOn a more positive note at least he tries with his lectures-sometimes he infuses YouTube videos, songs, and lyrics into the teachings, making them somewhat entertaining. All in all, take this course with another professor or just avoid it completely.It was a waste of time.\n\nWorkload:\nHeavy! One oral presentation (you can do more than one for extra credit-do it because you'll probably need it!), 10-13 page midterm, 13-18 page final. \nThe amount itself is not a lot, but the vagueness of the papers and excessive readings makes it unbearable.\n\n"
        },
        {
            "course_name": "Politics of Judicial Interpretation",
            "review_date": "October 26, 2014",
            "review_content": "\nI'm echoing everything that the previous reviewer said.  The only reason I ended up sticking with the class was because I needed to take a political science colloquium and I wasn't able to switch out. NEVER NEVER NEVER take anything with this professor.  He's totally incompetent, unprofessional and his grading really is all over the place.  The syllabus is terrible - The readings are insanely long (to the point where nobody ever finishes them) and the discussions are even worse.  Also my worst experience at Columbia.  I felt like my insane tuition money was a complete waste that semester.  It's an unengaging, frustrating class in which you will inevitably be stressed about grading (because he's so vague and all over the place) and won't learn anything other than Columbia is a self-interested institution that doesn't care about students and that there is only luck to thank when you find a good professor.  See! Cynicism.  Avoid this class.\nWorkload:\nInsanely long readings that are not important to do, a few discussion papers, and a 30 page research paper.\n"
        },
        {
            "course_name": "Politics of Judicial Interpretation",
            "review_date": "April 22, 2014",
            "review_content": "\nDo yourself a favor and stay away from this course and this teacher. Seriously! \nDon't venture into any of his classes. Even if you registered with the political science department at Barnard for his colloquia, don't take this class. \nHe is unclear with what he wants, his office hours are a waste of time and energy. His grading is all over the place. Stay Away!! You will regret taking this class. I usually don't write culpa reviews, but I felt the urge to warn other students. This was by far my worst experience at Columbia. Don't take his class. Run while you can. \nWorkload:\nNormal for a colloquia at Barnard. 2 reading memos and a final 25 research paper with a presentation. However, he will be so unclear with what he wants that this will fell like hell. \n"
        }
    ]
}