{
    "prof_info": [
        {
            "prof_name": "Julia Vazquez",
            "prof_id": 12469,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "March 05, 2014",
            "review_content": "\nI find her to be an engaging professor. She's in grad school, and so is working on a lot of her own things, but always finds time to email back promptly. I found her treatment of Las Meninas (which we just covered) satisfactory, if not particularly thorough. Despite her youth, she's rather skilled at directing in-class discussions, which is something that not many humanities students at Columbia can claim. I\"ve found that in the midst of drafting my first essay, I ended up using a lot of terms that she would use during class, and incorporate many of the ideas that she suggested, as she is really good at getting students to analyze art critically and from different angles and modes of looking. I was surprised to find that I actually enjoyed this class, having come in on the first day with low expectations. \nThe workload, already pretty manageable(one 3-4 page paper, one 6-page paper, a midterm and final), is made even lighter because she doesnt emphasize AT ALL the memorization of names and dates. What she does emphasize though, is the importance of paying attention in class as every day she'd introduce some new idea or technique. The readings, though they can be long, are lightly touched upon in class and usually you can contribute to discussion without having looked at them beforehand, though I would recommend at least skimming them while preparing for her midterm, which asks you to compare and contrast series of pairs of paintings with brief evidence drawn from assigned readings. \nI highly recommend taking her class.\nWorkload:\nlight-medium, depending on the individual. I personally spent 3 hours total on my first paper and probably will spend less than that reviewing for the midterm\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 08, 2014",
            "review_content": "\nFor the most part, Julia is a reasonable and fairly chill instructor. I liked how she established from the outset that the class won't be about memorizing a bunch of crap (i.e. dates, technical jargon) but learning how to look at and analyze art. Each class was structured on in-depth discussions about whatever artist/movement/artwork was scheduled for that day (as would be expected in every other art hum class--no surprise here), and so you would have needed to have done the reading or known something about the art in order to contribute/participate in a meaningful way. Given the fact that the focus of art hum (as are the other core courses) is entirely western/euro-centric, I appreciated how she made an effort to include a token of modern and contemporary artists, some of whom aren't \"western,\" though I was almost always confused about how these artists furthered my understanding of the artists featured on the art hum curriculum.\nAnd at certain points of the course I felt as though it would have actually been helpful and more engaging if she had focused on some of the technical terms thrown around in art history. For example, in her mini-lecture on the Parthenon, she kind of glossed over the Ionic/Doric/Corinthian orders (I think she spent like one slide merely mentioning the first two), though I would think these are relatively important architecture terms that need defining. If I recall correctly, she also mentioned chiaroscuro (contrasting light-dark to create the illusion of form) only once in passing; spending even just one or two minutes more on this term would have later helped me understand why Picasso's use of color was so groundbreaking in the history of western art--I had to figure this out on my own while reading Kahnweiler.\nShe was also somewhat biased toward Renaissance and, later on in the course, Spanish baroque painters, namely, Velazquez (btw she LOVES Las Meninas), not that I had a problem with that--I was looking forward to the Renaissance anyway--but she would sometimes use this as an excuse to avoid answering some of our more specific questions. I understand that one can't know everything about everything, but she could at least have told us that she'd get back to us on questions she couldn't answer immediately.\nA note about testing. I don't know how the other art hum instructors structured their exams, but she gave us 30-ish min to complete the essay portion for both the midterm and final. 30 min to talk about three (and for the final, four) artworks! This ain't the SAT's!!! Her tests aren't impossible, and she's a fair grader--they just might be harder for those who do not have any background on art history (like me).\ntl;dr Enjoyable class on the whole, though I wish she had gone over some of the more important art terms and given us more time on the exams. If you don't have some basic knowledge of the major artworks and architecture of western civ, take it with another instructor.\nWorkload:\nAs I said, Julia is reasonable. Light to moderate readings for each class; some were heavy. Participation and attendance. 2 mandatory trips to the Met. 2 papers, a midterm and a final.\n"
        }
    ]
}