{
    "prof_info": [
        {
            "prof_name": "Leslie Sharpe",
            "prof_id": 1958,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Anthropological Theory I",
            "review_date": "February 10, 2010",
            "review_content": "\nWhile the class is very structured, enjoyable, and engaging, Prof Sharpe, is a stickler for grading. I put in a lot of work every week and really enjoyed the readings and class in itself but was not overjoyed with my grade. Even though I got an A on both midterm and final, I ended up getting a B+ in the class. Be warned, take the weekly writes seriously as this was what brought my grade down, don't think that a few check minuses or checks will even out at the end with the check pluses (as this was what happened to me). Put in extra time and effort in the weekly writes and you should be fine.\nWorkload:\nheavy reading thinning out during the semester. weekly 1-2pp essays. take home 6-8pp midterm and final.\n"
        },
        {
            "course_name": "Personal Essay",
            "review_date": "May 13, 2006",
            "review_content": "\nSharpe is the best professor that I have had at Columbia.  Period.  She gets everyone to write their best, creates a workshop that makes everyone comfortable to read their pieces and get ample feedback, and really improves everyone's writing.  I had classmates who didn't exactly wow me when we took previous writing classes together, yet by the end of Sharpe's class their pieces were really engaging and riveting.  She is very accessible outside of class, responds to e-mails, and is such a caring person.  She line-edits essays (which is awesome) and is willing to give honest feedback, not just a \"good effort.\"  The only complaint was that the class was a little too large to workshop more than 2 essays a piece, but this semester was the exception to the rule (in general the class is smaller).  Her class fills up really fast so get there right at the start of pre-registration.  It will be the best decision that you will make during your time at Columbia.\nWorkload:\n4 essays (one on place, one on life experience, one on an idea/hobby, one on a person... these are really general and everyone interprets them differently, so it's not like University Writing).  Reading, which we didn't ever discuss.  Final portfolio of revisions of those 4 pieces.\n"
        },
        {
            "course_name": "Personal Essay",
            "review_date": "December 26, 2005",
            "review_content": "\nLeslie is amazing.  First off, she's quite an accomplished writer and editor.  She uses this to our advantage; she was great at doing line editing on all of our essays (which is SO helpful!)  She managed to subtly create a comfortable forum so that people could write honest essays and not feel like they had to be reserved, which is often a challenge in a non-fiction writing class.  We were lucky and had a class full of great writers and were unlucky in the sense that the class went on until 9pm on Wednesdays.  However, everyone was always alert and focused and it was a great way to get through the mid-week slump.  \nAlthough she is not available to meet every day, Leslie is great with finding time to work with you and go over your piece.  She also will be honest with criticism and make sure that the class is a WRITING class and not a THERAPY class while still being sensitive to those in the class.  \nI have never gotten as much out of a writing class as I have in personal essay... Sharpe is a true gem!\nWorkload:\n4 essays, we each workshopped 2.  2 short ones (5-7 pages); one about place, one about a hobby/idea/interest.  Two longer ones (7-10 pages) one about a person, one about a personal life experience.  You can interpret these assignments as you please... they took on many forms in our class.\n"
        },
        {
            "course_name": "Personal Essay, Tactics of Nonfiction",
            "review_date": "January 10, 2004",
            "review_content": "\nLeslie is the best professor I've had in the writing program, which says a lot. She is very accessible and attentive, and tries to cultivate a personal relationship with each of her students. She has a career editor's critical eye and a New Yorker's wry sense of humor. She offered very thoughtful suggestions on how I could improve my writing, and really helped me clarify my thoughts. Leslie's classes are a real pleasure, and I recommend her highly for students of nonfiction. \nWorkload:\n(see writing program course descriptions for workload)\n"
        }
    ]
}