{
    "prof_info": [
        {
            "prof_name": "Eldon Grant Porter",
            "prof_id": 2920,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to American Politics",
            "review_date": "May 12, 2006",
            "review_content": "\nGrant is a cool, easygoing, and intelligent guy. Godod things about having Grant as your TA: he's smart and resourceful, knows his Amer gvt well and can direct you well in class assignments. He's also relaxed and won't tell on you if you miss a few sections as long as you tell him first and don't make a habit of it (which is good since JRussell's class counts attendance as part of your grade). Finally, he's still really enthusiastic about helping, and will meet with students for lengthy amounts of time even close to due dates, and is really nice about giving extensions, being understanding, etc. In section we probably spend too much time expounding on detailed cases and stuff that you'll never hear of again in the class, but Grant makes an effort to have us all review the readings (which actually wasn't too helpful since most people give rather uninspired summaries and you're better off just doing the reading yourself). \nI hope I haven't made him sound like a pushover - I suppose it's possible the description sounds like that, but I say don't be an asshole and count yourself lucky to have such a good TA. \nWorkload:\nJRussell's intro to Amer gvt class: 10 page take home midterm, 10 page research paper, in class final that wasn't too bad at all. You don't have to do all the reading, but it's helpful for doing well on the midterm and final. Research paper was on anything involving the Amer gvt, which was good. Feel like you can work pretty hard for the take home midterm (for which you have one week, 20% of the grade), make the research paper good (30%) and go to office hours for that to make sure it is so, and around finals time. Overall not too much work going on during the school year. \n"
        }
    ]
}