{
    "prof_info": [
        {
            "prof_name": "Hans Martin Puchner",
            "prof_id": 1582,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Modern Drama I",
            "review_date": "April 19, 2004",
            "review_content": "\nHans Martin Puchner, or Prof. Puchner to most, grows on you like that nerd you hated as a freshmen, but guiltily loved senior year.  His is overwhelmingly academic at times, and initially I found this both unengaging and off-putting.  Break through that facade though, and you'll find someone who just really loves his drama.  The texts were good, although a bit too much shaw for me.  His lectures didn't change my life or anything, but they were interesting.  He has a real love for the word 'ourve' and when he says it with his accent it's great.  I won't lie, that word kept me awake some thursday afternoons.  The class is laregly non-participatroy, which is great if you enjoy taking the occasional afternoon off.  Don't skip 4 classes on shaw, read only one shaw play, and then expect to not shit the bed on the midterm.  Ahem, I've been told this does not lead to success.  Plays are short though, so reading doesn't take long.  Overall a good class, but not one that will change your life.\n\nWorkload:\nA midterm, a final, and one long term paper.  I got really into the term paper so I thought it was sweet.  If you hated it, it probably sucked for you.  Also, you must act out one scene from any of the plays in front of the class.  The passage ID's on the exams are hard.  Beware.\n"
        },
        {
            "course_name": "Modern Drama I",
            "review_date": "February 15, 2004",
            "review_content": "\nIs Professor Puchner the most riveting lecturer on the planet?  No, but he knows these (sometimes esoteric) plays quite well, and if youÂ’re patient with him, heÂ’ll give you some interesting contextual info as well as some solid, good old fashioned literary analysis.  Though his attempts at encouraging class discussion largely failed, he was very good at fielding student questions and answering them--and then letting his lecture move in an entirely new direction.  HeÂ’s also very friendly and is always very willing (and even excited) to talk with you during office hours.  The plays are good and his lectures are fine, so the class ainÂ’t bad at all.\nWorkload:\nIf youÂ’re not willing to do pretty much all the reading and write a thorough 10-page paper at the end of the term, you probably wonÂ’t get a very good grade.  The IDÂ’s on the midterm and final werenÂ’t too bad if you had read all the plays, but the T.A. graded the responses and analysis pretty harshly, so be thorough.  Otherwise, just take notes, show up to as many lectures as you can, and you should be fine.\n"
        },
        {
            "course_name": "Modern Drama I",
            "review_date": "April 27, 2003",
            "review_content": "\nThis class was pretty dry, but not terribly painful.  The plays we read were very good for the most part - all of the plays you would expect i.e. Ibsen and Chekhov - and his lectures, while pretty boring, were informative.  He almost never calls on people in class so you can get away with not doing the readings.  HOWEVER.  If you do this, he will nail your ass to the wall during the midterm.  BUT he is very nice about it and will severely weight your grade towards the final exam and the final paper if you show improvement.   All in all I would take something else if I could do the semester over again.  It's not hard, and a pretty easy A if you do the work, but it's pretty conducive to sleeping and slacking off.\nWorkload:\nOne midterm (IDs), one final paper (on anything that interests you), and a final exam (much easier than the midterm if many people do poorely on the midterm).  Do the reading and you'll have no problem.\n"
        }
    ]
}