{
    "prof_info": [
        {
            "prof_name": "Sarah Shuwairi",
            "prof_id": 12630,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Seminar in Infant Development",
            "review_date": "May 01, 2013",
            "review_content": "\nI greatly disliked this class, and I do not recommend it to anyone unless serious changes have occurred to the syllabus or course value (3 pts but should be at least 4 pts).\nThis review is a modification of the comments I submitted in an official course evaluation.\nProfessor Shuwairi looks like a nice woman, and she talks in a voice that seems like it was made for an infant development researcher. I felt that her appearance and my first impression of her did not match up with my perception of her after spending a semester in her class.\nI felt that Professor Shuwairi had very poor effectiveness as an instructor, with the exception of clear presentation of subject matter. She was very exacting about what should be presented, both as a presenter and when reviewing student presentations. When putting together my presentation (length of a 2-hour class), I spent over 40+ hour revising and revising it. \nHer comments to clarify course material were often long-winded and occasionally did not more to resolve the confusion. Basic background information on the topics each week was sorely lacking. Professor Shuwairi was unable to encourage student participation effectively: her questions were intriguing and when students did participate, she had desired answers in mind, and would brush off answers that did not correspond to that ideal. At times, it felt antagonistic (i.e. she said \"Meh\" to one commenter). This made me feel more reluctant to participant in class.\nWhile she responded to student questions, opinions, and criticisms, she did not adapt or adjust the course in response to them. Instead, she would dismiss or put down the suggestions. I felt that my intellectual curiosity was not stimulated and in fact diminished throughout the weeks of this course; I have never had that experience in my years at Columbia to the extent that it happened.\nWhile Professor Shuwairi gave out very detailed instructions on assignments, the assignments were not very valuable overall. In part, this is due to the number of them. We wrote weekly page-long responses, a two-page toy review, and a seven-page paper (single spaced lengths given) in addition to putting together a class length presentation that involved over 40+ hours of work. The workload was much too much. The readings each week were redundant and lengthy. Instead of the 5-7 articles, Professor Shuwairi should have assigned 2-3 of the best articles and some background reading to make sure that everyone was beginning each class with a recent reminder in the subject matter (some people have not seen some of the material before, and all of us could have participated better in discussion with a brief refreshers). The amount of work was numbing and lead to less work being done. \nI am not a lazy student, but I do meticulously manage my time. I want to perform the best as possible, and I felt that this class was an uphill struggle that I learned to resent. I was turned off from a subject about which I began the semester incredibly excited. I felt that my intellect was not challenged or engaged. Instead, the course tested my ability to simplify potentially interesting material and reduce it.\nAt the time of writing, I have not yet taken the final exam for this class.\nWorkload:\n100-200 pages of reading (about 5-7 articles) each week; 1-page single spaced response to the readings each week; 2-page single spaced infant toy review/critique; 10-page 1.5 spaced research proposal and literature review; 1 presentation (length of an entire class period; necessitated 40+ hours of work to put together); final exam\n"
        }
    ]
}