{
    "prof_info": [
        {
            "prof_name": "Joel Kaye",
            "prof_id": 775,
            "total_reviews": 28
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "December 18, 2016",
            "review_content": "\nKaye's a great professor all-around who's both passionate about the material he teaches and educating undergrads about it. His lectures are highly organized, and one might think that listening to an old professor read out of his notes about the Middle Ages would be boring, but his style and voice (which is very pleasant to listen to) make all of the material he covers seem extremely captivating. Some might find the thematic approach a bit confusing, but I appreciated it, and felt like all the material tied together in cohesive fashion by the end of the class, and really allowed you to appreciate the period and the vitality of medieval culture (and yes, Kaye does a great job of dispelling traditional stereotypes of the Middle Ages). Even if you're not interested in medieval history I'd advise taking the class- I'm sure you'll get a lot out of it if you don't go in expecting to learn about what people typically regard as medieval.\nKaye's also an incredibly enthusiastic and open professor who takes time to speak to undergrads and develop their interests in history outside class- particularly if you visit him during office hours, when he's more than happy to just spend an hour talking with you about medieval history in general even if you don't have any questions. He gave me a bunch of his old journals to read through once when I asked him and was more than happy to talk with me about the articles in them. \nIn terms of grading, Kaye is very fair. If you write good papers and give good answers on the exams you'll get an A. He doesn't grade to be harsh, but a certain level of accuracy and detail is expected in terms of your exam answers. He expects you to read primary sources closely and with attention to detail and an analytical mindset. The discussion sections are really helpful in that regard and even entertaining (Adam, our TA, has a great and very sarcastic sense of humor). \nWorkload:\nNot too heavy. Discussion post every week based on the primary sources, one 5-7 page paper, a midterm and a final with several IDs and one essay each. \n"
        },
        {
            "course_name": "Introduction to Historical Theory and Methods",
            "review_date": "December 08, 2016",
            "review_content": "\nThis course is primarily focused on improving critical writing skills through historical analysis and comparison, and there could be no better teacher for it than Professor Kaye! Because he's primarily a medieval historian, a lot of his anecdotes trail off into the 1200-1400s but I always found them kind of instructive in showing you a new way to look at the world and how we create history. Professor Kaye is incredibly approachable and makes class discussion insightful and engaging. Be prepared to work though because he expects a lot from you and is always invested in your growth as a student. I've had some papers that he refused to grade(let alone read)  because I just slapped something on the paper and he didn't think it was reflective of the quality of writing I had submitted in the past. So, yeah, he can be intense but it's also awesome to find a teacher who's so ready to support you, work with you and push you to write your best! \nWorkload:\nFairly heavy: short personal essay, 5-7 page theory paper, 5-7 page paper focused on a historical text, 2-3 page review on choosing and exploring archives, and then a 10-12 page comparative historiography or a research proposal in preparation for the history thesis \n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "November 29, 2016",
            "review_content": "\nI always thought the Middle Ages was a dead period, but I couldn't have been more wrong.  This class was so interesting, and Professor Kaye is a great lecturer—he is clear and concise.  The workload is manageable, but there are a lot of secondary sources to read, increasing both in length and amount as the semester goes on.  The discussion sections are helpful because the paragraph assignments force you to read the text closer, which helped on exams.  If you do the primary source readings and the more important secondary source readings, as well as pay attention in class, you should do well.  But while it is doable, it is a harder Intro class than the other European history ones (Renaissance and Modern).\nWorkload:\n-1-3 readings in the primary source book per week, 2-3 courseworks readings per week, 3 books spread through the semester\n-1 discussion section post per week\n-Midterm: 25%\n-1 5-7 pg. paper: 25%\n-Final: 35%\n-Attendance and Participation in Discussion Section: 15%\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "September 09, 2016",
            "review_content": "\nMany reviews of Professor Kaye here are shocking given my incredibly positive experiences in two of his classes. His enthusiasm for the subject matter and expertise make his lectures really captivating, even for students who have no prior knowledge of the middle ages. He does an excellent job of making the material accessible and relevant to modern times, which helps your understanding of all of history. This class sparked my interest in the middle ages, and I promise you will not regret taking it. Do not listen to people who say this class is boring!! If you take the time to read the materials and go to office hours with Professor Kaye, you will discover that this is exactly the type of class that you hope to take in college with a dedicated professor and a subject matter that broadens your perspective. \nWorkload:\nVery reasonable--do the readings for discussion section and participate in class, and you will do fine. Essays are graded fairly, as long as you go to office hours and show Professor Kaye that you actually care and are invested in the class. One midterm and one final, plus one paper. \n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "May 15, 2015",
            "review_content": "\nWords cannot express the stultifying sense of ennui that weighs you down each down you sit down for Kaye's lecture. If you take this class, you should expect to be bored witless. This course should be re-titled The Papacy until 1450, as most of the course focuses on the popes and the development of the Church. Most of the interesting history is excised in favor of church teachings and the development of law. In theory, the workload isn't too bad, but the boredom makes it worse. The teacher expected and graded you on your knowledge of the secondary sources for his exams. so if you unfortunately sign up for this class, you should make the effort to read the 2 or 3 articles he assigns each week and get a general sense of the argument and details. The grading is skewed towards the exams because he only assigns one paper.\nWorkload:\n2 exams - the professor expects you to use the secondary sources. 1 paper (5-7 pages). VIllehardouin's and Joinville's texts on the crusades. Judith Bennett's A Medieval Life. Brian Tierney textbook. Primary sourcebook. Secondary sources - this will be tested on the exam. weekly TA Section - 1 piece of \"short\" analysis on the week's readings - the TA expects you to put effort into it. \n"
        },
        {
            "course_name": "Medieval Intellectual Life 1050-1400",
            "review_date": "April 14, 2015",
            "review_content": "\nThis is by far the most interesting and enriching class I have taken in the history department at Columbia University. And Joel Kaye is an extraordinary professor. This is by no means an exaggeration. This is one of the classes that will leave a mark on you.\nRegardless of what you may think about the Middle Ages, you will come out of this class fascinated by what you have learned. This class will open a world of knowledge and it will shed new light on the origins of the modern world. Professor Kaye often takes a moment to reflect about the way history unfolds and invites students to think with him. He always creates a comfortable and engaging environment.\nThis class will train you to think historically. You will mostly work with primary sources, which includes philosophical, religious, and literary materials. Instead of always giving bland lectures, Professor Kaye spends some time analyzing the sources during most classes, so he really brings the material to life, which makes it much easier and pleasant for students.\nThe course is writing intensive. There are 3 essay assignments, which comprise most of the work. There is also a final, but it is light and nothing to worry about. The essays are not easy, but they are exciting. Professor Kaye is also a fair grader who really gives his students the means to do great in the class. He gives thorough comments on each paper and makes time to give serious advice and feedback in person. Even if you already consider yourself a good writer, this class can really improve your writing skills.  \nThis class will have applications for you beyond the Middle Ages and beyond the discipline of history. I highly recommend it. \n\nWorkload:\n3 essays and a light final. The reading list not extensive - it's much more about quality than quantity because it's mostly primary sources. The grading is very fair and you are really given the opportunity to do great.\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "November 07, 2014",
            "review_content": "\nEven if you aren't remotely interested in history, even if you hold the misguided idea that medieval history has nothing to do with your life, you should take this class. \nProfessor Kaye is one of the best teachers I have ever had. He genuinely loves instructing students. I highly recommend going to his office hours. Your ideas will be more valued in this class than in a normal intro survey. Professor Kaye's passion for the study of history is inspiring. He makes medieval history relevant and engaging by constructing a narrative that favors thematic trends rather than a \"fact\" -based history you might get in an AP high school class. The best parts of Intro to the Later Middle Ages are Professor Kaye's lectures, but the readings are also interesting and applicable to the class as a whole. \nTake this class, or any class with Professor Kaye. You will not regret it. \nWorkload:\nDiscussion section, a pretty substantial amount of reading, one short paper, midterm, final (totally manageable, slightly more reading than a normal intro class) \n"
        },
        {
            "course_name": "Introduction to Historical Theory and Methods",
            "review_date": "April 06, 2014",
            "review_content": "\nThis was one of the most challenging yet immensely rewarding classes I had taken at Barnard/Columbia. The name, \"Introduction to Historical Theory and Methods,\" is somewhat of a misnomer. It is certainly not an \"easy\" introduction history course nor is it about mechanical research techniques. For those who thought history was about dates, IDs and maybe some essays, this class helps you understand what it really means to be a historian and, more abstractly yet so crucially, appreciate the value of a historian's endeavors and the field of history.\nThe seminar is structured as a discussion, as any seminar, and involves analyzing and critiquing/or commending the various ways of writing history (how to use footnotes, quotations, writing style, argument structure, primary source selection). From such discussions, you get a better sense of how to conduct your own historical research and write. The readings (scholarly history articles, Said, Chakrabarty, Foucault, Ginzburg, Darnton, Marx--all from scholars who shaped the field of history in unique ways) seemed intimidating, yes, and difficult, but the depth of understanding gained from our class discussions was always worth the time spent reading (and being confused by) the articles/books. If you take the readings seriously enough, you gain so much knowledge and depth.\nProfessor Kaye is a warm, extremely intelligent and honest professor. He will sit with your for an hour or sometimes more to talk about your papers (his handwriting is sometimes hard to read) and your concerns as burgeoning historians. He is no easy grader, but he is fair. When you get a grade in his class, you really get what you deserve. In class, the types of questions he asks us goes to show how Professor Kaye is not only a wonderful professor but also a thorough and passionate historian who understands the difficulties of history we grapple with throughout the course as mini-historians but loves his work and believes in the power and beauty of history. If you plan to major in history and want to be proud of your senior thesis, take this class.\nWorkload:\n3 5-6 page papers (first one is not graded); a thesis proposal; weekly discussion posts; readings and class participation\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "April 17, 2010",
            "review_content": "\nKaye is one of the best professors I have had at Columbia.  He is engaged in the material, but not to the extent that it is a disservice to his students.  Although some commenters have found his classes to be boring or his style \"pompous\"  I'd just like to say that if you think the middle ages aren't interesting, don't take the class.  If you think his class is uninteresting the first day, it will not be better.  I personally did nearly all the reading, and did not feel that it was any more excessive than any of my other 3000 level humanities courses.  If anything, I found it more interesting because as previous reviewers have stated, most of it is primary documents, allowing you to interpret the material first-hand.\nHis organization may seem a little odd at first, because it's not in chronological order, but when you get to the end of the class you'll surprisingly know it backwards and forwards.  As for those who don't think he knows who you are?  That's probably because you skipped every other class, never went to office hours, or made any effort. Don't be stupid: if you don't like the subject, you will not get a good grade or have a good experience, as with any half-decent course at Columbia.\nWorkload:\nStandard for an intro class.  One paper, discussion section with occasional responses, one midterm and final.\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "September 25, 2009",
            "review_content": "\nProfessor's lectures are dry and boring. If you're not interested in countless accounts of Christianity and Crusades and Medieval Life do NOT take this class. Its lecture based so all you do is listen to a monotone voice for an hour an a half. Pretty boring to say the least. You will probably enjoy it more if you're interested in the subject taught \nWorkload:\nTwo exams, a paper, ALOT ALOT of boring and pointless reading, including primary sources \n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "May 17, 2009",
            "review_content": "\nProfessor Kaye is the kind of instructor that makes you feel like the 50 grand in tuition is justified. He loves to teach and loves his students, which is more then you can say for most professors. He comes into each lecture prepaired, and is perfectly happy to pause what he is saying to answer student's questions. I cam into the course just trying to fulfill a requirement, but he made me actually enjoy learning about the middle ages. His readings are almost all primary sources, so you don't have to slog through hundreds of pages of bs about what some \"harvard scholar\" thinks the middle ages were like. I would recommend this class to anyone, not just majors. Liberal arts degrees are about taking random classes you will probably never use in life, and prof Kaye is the way to go!!\nWorkload:\nHeavy but interesting reading, 5 page essay with an untraditional prompt (which actually makes it rather refreshing), midterm and final both managable\n"
        },
        {
            "course_name": "Medieval Intellectual Life 1050-1400",
            "review_date": "January 01, 2009",
            "review_content": "\nA fantastic lecturer, Kaye makes himself available to students above and beyond the call of duty.  His essay topics aren't standard, but are actually interesting and force you to engage with the material; that said, he's not trying to stump the student, and he does reward time spent on the class.  BC1062 had a great TA the semester I was in it, which probably helped with keeping up with the syllabus (there was a required weekly discussion section); Intellectual Life had...issues with that, and was rushed by the end of the semester.  The coursepacket he assigns is half evil, half great -- the pagination is a pain and a half and you never know when to bring it to class for discussions, but the actual reading is interesting and mean that you're able to think about the topics at hand for yourself.\nWorkload:\nStandard for the level.\n"
        },
        {
            "course_name": "Medieval Intellectual Life 1050-1400",
            "review_date": "January 07, 2007",
            "review_content": "\nThis class was one of my favorite of the semester. I am not a Medievalist, though I am a history major. The primary source selections were very good, and made up the core of the class, being the focus of the three assigned papers.  Professor Kaye's selection of secondary sources were also excellent, and they really helped to give context and relevance to the primary sources, which can be dry at times. Our class was small, which made lectures much more enjoyable, and really allowed us to have lively discussions about the different texts. With regard to grading, Professor Kaye was a very fair grader. He made the most comments on my papers of all my professors this semester, and I felt my grades reflected the level of work I put in. Ultimately, I earned an A- in the course, and was very proud of the papers I wrote. \nIgnore the scathing \"29 December 2003\" review of the course. This class was certainly \"real history.\" Female authors were never emphasized outside of their relative importance, and the most of the works we read were by men. During the second segment of the course--the \"Scholastic\" period--female writers disappear entirely. \nHowever, in a time when literacy was so rare (no more than 10% of Medieval Europe was literate), the writings of monastic nuns and female noblewomen become very important in creating a historical reconstruction of the time period. And for the record, I am a male Columbia student.\nBasically, if you have an interest in the subject matter, you won't be disappointed by this course. The readings are good, and Professor Kaye is friendly, smart, and interesting. You will learn a lot.\nWorkload:\n3 papers, 4-6 pg. each, and an in-class essay final. No midterm. The whole \"Barnard fellow\" situation has been nixed, so there are no required rewrites of papers. \nHowever, if you do want to rewrite a paper, Professor Kaye is very flexible. He's definitely more interested in the process of learning and the growth of his students than he is with, say, keeping grade inflation down or penalizing students for late papers.\n"
        },
        {
            "course_name": "Medieval Intellectual Life 1050-1400",
            "review_date": "December 18, 2005",
            "review_content": "\nKaye loves the people he talks about and to be fair he makes it interesting.  He does not seem to be really interested in students. He claims he has pictures of us all and that he knows our names, but I doubt that.  He a bit pompous and wants to be seen as 'cool.' He directs those in his class to use writing fellows and I did with limited success.  I got  a \"B\" in this class, but to be fair, I felt that Kaye's reviews of my papers were at best cursory.  If your first love is medieval history take this course.  If it isn't this course is best ignored.\nWorkload:\nmoderate -- well defined\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "September 20, 2005",
            "review_content": "\nI hated this course. I found the reading boring and Kaye's lectures interminable. The t.a. was  mildly smarmy but I guess that is to be expected--this is medieval history after all.\nThe exams are pretty easy, the paper is a bit tougher. But don't worry about it because you just shouldn't take this course in the first place. \n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "June 04, 2004",
            "review_content": "\nJoel Kaye is a really nice guy and you can tell right away that he really wants to teach (ie: he left about 10 minutes at the end of class to answer questions). The information covered in this class is also very interesting. However, it was frustrating at times to be a history major because it is so introductory. This is almost like a survey of middle ages history and you will dabble in a little bit of philosophy, religious history and politics, without really ever discussing the issues in depth. Also, there is hardly any reading. I think it's great that he focuses so much on primary sources, but we really didn't have any secondary sources, besides a textbook and a few articles in the course packet. While it's important to focus on the documents, it would have been nice to read scholars' opinions besides those of Prof. Kaye. Kaye is a good professor and he really cares- I would recommend this class to someone who truly wants an introduction to the middle ages, but if you want to take a real history class, it leaves much to be desired. In addition, since it's an intro class you often feel like you're being treated like you're in high school- everything's explained on a basic level (which is often good since most people aren't very familiar with the middle ages), but  it can get a bit tedious when the TAs go so far as to explain how to take an exam or write a paper.\nWorkload:\nShort paper on a primary source (5 pages), midterm, final- no surprises, he'll basically tell you what's on it.\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "May 15, 2004",
            "review_content": "\nAn amazing lecturer.  In this class, Professor Kaye covered incredible material and I was not  bored for an instant.  The reading is intense, but both necessary and interesting.  Prof Kaye is also very approachable and genuinely passionate about his subject-matter, which is a pleasure to see.  He completely transforms your view of the Middle Ages and teaches you to extract the historical truth, if you will, from primary texts.  Take this class.\nThe only drawback was my TA.  Grading was very challenging and discussion sections were unhelpful.  However, I did not mind this because I learned so much anyways.\nWorkload:\nweekly reading assignment, essay, midterm, final\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "April 27, 2004",
            "review_content": "\nLast week Professor Kaye gave one of his finest lectures of the semester, so it seems appropriate now to survey the course as a whole. Despite his mellifluous voice, which rarely (if ever) wavers from its soothing baritone, he is PASSIONATE about the subject, and especially about the medieval economy (which appears to be his specialty). He always writes out a list of key terms at the beginning of every lecture, which turn out to be quite useful when studying for the exams. He is excellent at relating different social, political, cultural, and economic institutions to one another, at a level that isn't daunting for the first-year but also won't bore older students or history majors; another mark of his desire to establish a comfortable, communal class atmosphere is the 7-10 minutes he always leaves at the end of class for questions. Call it pandering to the firstr-years if you will, but I definitely appreciated it. That said, there is a strong anti-Bush sentiment that tends to come out when Prof. Kaye attempts to connect events and trends of the Middle Ages to current events and trends, and he's quite successful at both (to the point of heavy-handedness). Overall, though, I'm leaving this class with an even more profound admiration for the Middle Ages, and for this class that introduced me to them.\nWorkload:\nA moderate but steady reading load each week, ridiculously short responses to the reading due every week in the section, a fairly difficult midterm that was harshly graded by the TAs, one 5-7 pg paper, and a final.\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "April 18, 2004",
            "review_content": "\nI took this class last semester as a senior history major at Columbia, and it was good enough for me to procrastinate and tell y'all: take this class.  \nI was a bit resentful at taking an intro level requirement -- and spring semester at that -- but my irritation was totally unfounded.  Apart from a few overeager frosh trying to extract from him every component of the exams or papers occasionally, the class was always not only tolerable, but interesting.\nKaye is cool, bottom line.  The class is excellent on institutional and legal development.  Lots of nascent nation-state stuff, too.  Worth your time!\nWorkload:\nUh, reasonable?  I didn't do so so much, but it is wise to study for the exams.\n"
        },
        {
            "course_name": "Medieval Intellectual Life 1050-1400",
            "review_date": "April 17, 2004",
            "review_content": "\nI love this man!  This was my first history class at Columbia and I absolutely loved it.  Prof. Kaye has the most wonderful voice, and his lectures are clear and informative.  The readings are really interesting and as long as you go to class you really don't need to do all of them.  There are three papers which are graded fairly, you get a chance to re-write them which is really helpful.  The TA Lee was extremely helpful, go to him to talk about your paper... he's super nice and always willing to meet with students if you make the effort.  This class was one of the best I've taken... highly recommended.\nWorkload:\n3 papers (tough topics, but the TA and Prof. Kaye are more than willing to help you out), no midterm!, final (open book, not bad at all)\n"
        },
        {
            "course_name": "Medieval Intellectual Life 1050-1400",
            "review_date": "January 28, 2004",
            "review_content": "\nOne of best classes I have taken. 3 essays that you get a chance to rewrite, which really helps you to improve your grade, if you make the effort. The essays seem difficult and impossible at first, but once you get into it you can really go anywhere with it. I came to some off the wall interpretations and he never penalized me, unlike some professors. He is one of those genuine teachers who really mean what he says, he wants you to think, not just regurgitate the lecture or teacherÂ’s views. He is kind, never gets frazzeled, and is easy to talk to. He really makes you examine your preconceived ideas. There was no midterm, and the open book final was stress-free. No ID's, and only one essay, but pay attention to the readings as they all tie in for the final. \n"
        },
        {
            "course_name": "Medieval Intellectual Life 1050-1400",
            "review_date": "December 28, 2003",
            "review_content": "\nThe title of this class is a bit misleading. Perhaps a more appropriate one would be \"Medieval Intellectual Life and how it Marginalizes Women\" since more than half the course is devoted to just this issue (silly me for thinking that Barnard could actually put feminism on the back burner and teach real history). I must say, however, that Professor Kaye is indeed a very adept lecturer who blends (and often bends) insights, literature, and factual historical information to his own interpretation of how great and underappreciated the middle ages really were. Yet while this is undoubtedly a great skill, he tried too much to compare the medieval period to the 21st century with an all too pessimistic tone that I did not feel was necessary or too relevant. Again, his delivery as a lecturer is admirable; but if you want an objective, nonbiased treatment of the medieval period that does not overly focus on the mistreatment of women or draw too many comparisons to show how little we have come along today in modern times, then I suggest you look elsewhere (perhaps a real Columbia class). \nWorkload:\nThree 4-6 page papers that are very broad and incredibly difficult to actually narrow down to the page limit, and are accordingly graded on the tough side. Also an essay final, no midterm. Amount of reading is a bit less than the usual Columbia history class. Oh, and this class utilizes the Barnard fellows, who are supposed to help you with your writing but in reality make the entire process tedious, long-winded and just plain pathetic.\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "September 03, 2003",
            "review_content": "\nLike everybody says, he's a great lecturer.  He's got this beautiful, deep, mellow voice, that never gets too excited or upset, but is never bored, distracted or uninteresting.  His vocal style is a perfect reflection and tool of his intellectual style--he's passionate but calm and always reasoned, intelligent (brilliant,) fair and kind.  Since he never gets stressed, nobody else seems to, either.  He's generous with his time outside class, even if he has no idea who you are.  An all-around nice guy with a real interest in teaching and helping people.  He packs a tremendous amount of information into his lectures (a lot of which will surprise you, which is great--isn't that what an education is?) AND makes it all make perfect sense.  He introduces some pretty serious theories to the course, makes them very clear and concrete, and comes back to them again and again to make sure they're understood, remembered, and that their lasting relevance is apparent.  He teaches this introductory course as introductory courses should be--without expect any prior familiarity with the subject matter on the part of his students.  But he doesn't speak down to them either.  When it's all over, he leaves you with a good understanding of the major institutional developments of the era.  He couples primary readings with secondary texts, which also seems ideal.  I can say the secondary text is pretty dry--that's the only real complaint I have about the course, but you don't have to read more than 30 pages or so a week.  The primary sources are pretty fascinating, and mostly short.  Discussion sections were really valuable in providing a forum for dissecting these texts and drawing a lot more meaning out of them--and also asking questions of interested and educated TAs.  (Thanks, TAs, if you're reading this!)\nWorkload:\nThe reading is very manageable; maybe 100 pages per week.  One appx. 6 page paper on one assigned book.  Final and midterm involve essay questions as well as identifications--there is a LOT of memorization required, but he does tell you exactly what to memorize.  If you do it, and pay attention to his very cogent lectures, you can't go wrong.  (Only problem is that if you don't keep using all the names and dates and identifying info you memorized, you'll forget it, making it rather a waste of time.  I do wish more teachers dealt with that unfortunate reality.)\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "September 02, 2003",
            "review_content": "\nProf. Kaye is a fantastic instructor, who knows his stuff so well that he gets you interested in every detail of the period he teaches in this class. At times I felt like blowing other classes off just to dedicate more time to this one.\nThe amount of information is huge, but he makes it clear what is exam material and what is not. His interest for the middle ages is inspiring, and by the end of the semester he completes his mission of showing his students the many layers of a society many times depicted simply as barbaric and ignorant. \nThe TA's are also very knowledgeable and approachable -- they are on your side and want  you to leave the class having absorbed as much as possible.\nWorkload:\nWeekly short papers (couple of paragraphs) on the assigned readings, Midterm, Final, 1 final 6 page paper based on a book.\n"
        },
        {
            "course_name": "History and Human Nature (FYS)",
            "review_date": "July 10, 2003",
            "review_content": "\nThis class started off OK but then got a little sticky when religion began cauing huge controversey among the different students.   Becasue it was  a seminar he sort of let  the students run the class which was not always good becasue we often ended up on tangents which led to controversey.  Also, some students found him offensive at times, and while he says he was just trying to state his opinion, there was probably a nicer way to do it.  His grading system was otherwise fair and he was available to discuss grades and assignments\nWorkload:\nNot bad for the class.  Weekly readings varied between pretty long (and sometimes boring) and very light and easy.  If you dont always finish the readings its not the biggest deal just do it for the next time.  However, he required (bi-)weekly postings on courseworks which were very time consuming and often redundent from previous weeks postingsa or from those of other students. I think there were 4, 3-5 pg papers and peer editting (not a big deal).  \n"
        },
        {
            "course_name": "History and Human Nature (FYS)",
            "review_date": "June 23, 2003",
            "review_content": "\nI love Professor Kaye.  Since the class was a seminar, and not a lecture, it was great to be able to sit down with a truly intelligent and caring professor every week.  He made class interesting with a relaxed feel to it.  Prof Kaye is kind of like that cool uncle that everyone wants.  He was truly interested in what everyone had to say and brought up great discussion points.  I'm actually taking another class of his next semester simpy because I love him so much.\nWorkload:\n3-4 papers with optional peer-editing.  Mandatory weekly postings on Courseworks based on the assigned reading.  Not bad at all.  Very fair grader.  He will make time for you to make sure you understand why you received a certain grade on a paper and work with you to make the next paper better. \n"
        },
        {
            "course_name": "Medieval Intellectual Life 1050-1400",
            "review_date": "December 18, 2002",
            "review_content": "\nThis is a great class even if you don't have any background in the medieval period.  Professor Kaye is a very clear lecturer and a lot of class time is devoted to useful discussion.  The readings are really interesting and for a history class it isn't very heavy.  Don't blow off the papers though -- he's a harder grader than he seems.\nWorkload:\nThree 4-6 page papers, final\n"
        },
        {
            "course_name": "Introduction to the Later Middle Ages: 1050-1450",
            "review_date": "November 19, 2001",
            "review_content": "\nGreat professor. Kind, enthusiastic, and intelligent. He really knows his stuff and his lectures are easy to follow. You always know what the important stuff is (or what to study for the exams). The work he assigns is relevant to what he teaches and very manageable. My favorite thing about him is that he reads many of the papers and exams after the TA's grade them and makes his own comments. He even raised my midterm grade a full letter from what the TA gave me. He teaches as if it is an INTRO level class, something many other History professors neglect to do.\nWorkload:\nEasy midterm, Fair final. One short paper and discussion groups each week with max one page response to readings. Exams are exactly what he tells you they will be, no tricks, so just pay attention in lecture.\n"
        }
    ]
}