{
    "prof_info": [
        {
            "prof_name": "Lauren Spohrer",
            "prof_id": 4568,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "March 05, 2011",
            "review_content": "\nOkay, I'm going with crazy as a nice way to say passive aggressive. She tells you she loves your idea and it makes sense until she suggests something to you. If you don't go with her suggestion word for word, she will kill you. She loves the people who do everything she says (so do this for a good grade. write every paper with the topic she personally suggests for you or else you'll basically get an F) and they clearly become the favorites. If you even try to suggest your own idea, egad! She will tell you that it clearly makes no sense (even if it previously did to her) and by the time that final draft comes round... [a final draft which I had several friends, the writing center twice, as well as my English professor father look over] you will not get what you should.\nSo in short: KISS HER ASS! You have about 2 weeks to become loved. If you don't accomplish this all by then, slim chances for you at getting the grade you deserved. so final note: WRITE HER PAPER. anything she wants, just write it. even if it has nothing to do with what you're talking about or what you want to say. It will make her happy and make you pass.\nIf you have ever seen Harry Potter, she is like the Columbia version of Dolores Umbridge. You take one look at the pink soft spoken hipster and you think she's so sweet and nice. Give it about a day. You'll see.\nWorkload:\n4 essays. countless pointless ungraded assignments etc. welcome to university writing.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "June 16, 2010",
            "review_content": "\nShe comes off as a really nice helpful instructor but don't be fooled. Beneath, that hipsterish small voiced facade is person who knows who she likes and doesn't like. By the second class, she's already chosen her favorites and will thereafter grade accordingly. She'll meet with you whenever you want, which is nice and will suggest countless changes which you will undoubtedly incorporate into your work as you revise your drafts. However by the time she grades your final draft, you'll find that all the work you did was for naught. \nDuring a meeting with her, she literally said to me \"This is perfect. All you need is a conclusion and you're set.\" Of course being unsatisfied with that, I sought out a second opinion from someone at the writing center and she told me much of the same as well. But in the end I saw red marks all over what she had previously described as \"perfect.\" She just didn't like me, which is fine. I just didn't like the false hope she doled out or the sneakiness and subjectivity she used to grade students. Especially since it was clear who her favorites were.\nThe only thing I learned from her was how to write a succinct review of her on CULPA with clarity. Or at least I hope, Ha!\nWorkload:\nThe usual as required in any University Writing class. Lens, Conversation, yadda, yadda, yadda.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 05, 2009",
            "review_content": "\nLauren was great. I had a really good university writing experience with her. It may have even been my favorite class that semester, which I think rarely happens with UW. She was really friendly and helpful, and class discussions were always engaging. \nWorkload:\nVery reasonable\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 14, 2009",
            "review_content": "\nLauren is definitely one of the best uwriting teachers. She is very engaging and encourages participation all the time. She's always ready to make appointments to conference with you; her input is extremely valuable. She does a really great job teaching you how to organize your essay as effectively as possible. She also picks readings that are actually useful for picking a topic to write about (not Karl Marx!!) so you get to write about things that interest you.\nOverall, Lauren is awesome!! and she has a great fashion sense yay!\nWorkload:\nThe standard 4 essays: Lens, Conversation, Research, and Retrospective (the retrospective is very easy). Weekly readings that aren't too bad; sometimes you have to write a few paragraphs about what you read but it's not bad at all.\n"
        }
    ]
}