{
    "prof_info": [
        {
            "prof_name": "Maksym Fedorchuk",
            "prof_id": 5496,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Algebraic Number Theory",
            "review_date": "December 30, 2011",
            "review_content": "\nI read some of his earlier reviews, and I am slightly disappointed by how many great professors get bad reviews for not teaching Calculus well to students who probably take the course hoping for an easy A, but end up getting disappointed when the professor actually makes the class challenging.\nAnyway, I took Algebraic Number Theory with Prof. Fedorchuk, and so far it has been one of my favorite courses in Columbia. This class was at 9am, and I never wake up on time for 9am classes. But, I attended the lectures regularly, which is a fair indication of just how good a lecturer Prof. Fedorchuk is. Even though we had a great text for this course, and Prof. Fedorchuk followed it pretty closely, yet his proofs were often shorter and clearer than the ones given in the book. That in itself says a lot, as we were following a book by a master expositor. What I liked about his lecturing style was that even though he prepared notes for himself for each lecture, he rarely looked at them while he lectured. This meant that his lectures were less mechanical. I think this was one the few times when I took a class where I felt I actually got something out of the lectures. More often than not, I have taken classes where I spent time reading the material on my own rather than attending the lectures. Prof. Fedorchuk always lectured at a comfortable pace, giving us enough time to copy whatever he wrote on the blackboard. This was fortunate as we were in a classroom with only two boards.\nI have seen a few professors who get flustered when they realize that they made an error in their lecture notes (which is understandable because it is hard to rethink a proof when you are lecturing and are under a time constraint), but on the rare occasions that this happened with Prof. Fedorchuk, he always managed to rethink the proof within a few minutes, sometimes taking suggestions from students. This shows that he knew the material well, even though, to my knowledge he does not work in Algebraic Number Theory.\nHe encouraged class participation, and was very patient with students when they asked him questions. Another of his qualities is that he is very approachable and friendly, and always asks students how they are doing. This is really helpful, as it makes it easier for students to approach him with questions. He also gave us extensions on home works, which were moderately difficult, but built on the material in the lectures. He often went through the more difficult problems in class, before home works were due. Perhaps the only shortcoming of this class was the TA who was too busy completing his Phd thesis, and so failed to grade home works on time. \nHis exams were fair and computation based. I previously had professors who gave proof based questions in their exams, so I was a bit startled by the midterm, and did not do well. But, he was understanding, and told me to do well in the final, which I did. His exams are not difficult if you have been paying attention to what he teaches in class. Most of the computational questions he gave were variations of problems he had explicitly solved as examples in class. His exams were also open book, which though not a huge advantage for a 75 minute midterm, is quite helpful in a 3 hour final. It meant that we did not have to memorize some complicated formulas. That makes sense, because Algebraic Number Theory is an upper level undergraduate course, and unless you work in this field, you will end up forgetting those formulas anyway. And, if you do end up working in the field, you can always look up the more complex results from books. No mathematician can remember everything that he/ she reads. \nAll in all this was a great course taught by a very intelligent professor. Prof. Fedorchuk wanted us to get an understanding of what Algebraic Number Theory is all about, and I think he was successful in his goal. The course has inspired me to take the graduate Algebraic Number Theory course in spring. I just wish Algebraic Number Theory were a two semester course so that I could learn from Prof. Fedorchuk. I know he will be leaving Columbia next fall, which is unfortunate for Columbia as they will lose a great teacher who cares about his students.\nWorkload:\nWeekly home works, a midterm and a final. Midterm and final were open book.\n"
        },
        {
            "course_name": "Honors Linear Algebra",
            "review_date": "August 10, 2011",
            "review_content": "\nMaksym's class was one of the best math classes I have taken at Columbia. He makes the class worth going to, as he covers all of the necessary material in class, unlike others who rely heavily on the book. Class usually comprises of him walking through the proofs of the new material, which are important to remember not in the specifics, but in the tools he expects you to use in your own proofs.\nMaksym may seem uncomfortable in class, but he is certainly not uncomfortable with the material; he understands the the math at a deep level, and is happy to explain and answer questions both in and out of class.\nIn terms of difficulty, the class is a mixed bag. The problems sets can be quite time consuming, and difficult, but you are allowed to work on them with other people if you note that on the pset. On the other hand, the exams mostly tested on the process of linear algebra, not the theory (i.e. multiply these two matrices, not proofs). There was a proof on both exams, but it was relatively simple.\nAs a result, take your time on the exams, as simple math errors can quickly hurt your grade, although he makes an effort at the end of the semester to help everyone out.\nWorkload:\nFairly long problem set each week, two midterms, one final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 18, 2011",
            "review_content": "\nHe went quite quickly.  Quirky and nervous on the first day, but you will hear subtle humor here and there.  He is MIT and Harvard educated.  Young Russian guy.  Go to office hours and let him learn your name.  I learned the grades on HW, midterms, and the final were all \"negotiable\", so fight for every point because he doesn't always agree with the way the TA's grade.\nTests are much more straight forward than other classes.\nOverall, I'd definitely take him again.  Got an A for Calc I with him.\nWorkload:\nWeekly homeworks (5% of grade, but he drops 2 lowest), 2 midterms, 1 final. Fair to easy\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 27, 2010",
            "review_content": "\nFedorchuk sped through classes. He went too quickly to take notes or even understand the material he went over in class. I gained little from his lectures, but doing the homework was enough to do well on the tests. He assigns weekly problem sets (ten to twenty problems) that are pretty easy with one or two challenging problems at the end. He gives two midterms and a final. The midterms were not difficult, and if you study from the practice midterms and complete all the homework assignments you should be fine (even if you miss a few classes). I haven't taken the final yet, but I expect it to be fair. His class is not difficult, but if you struggle with the subject you might want to consider a better professor.\nWorkload:\nTwo midterms (one easy, one fair) and one final (I've yet to take it)\nWeekly problem sets (fairly easy)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "February 11, 2010",
            "review_content": "\nThis man is terrible. How in the hell he got a silver star, I will never know. He blazes through lessons and makes frequent mistakes. Fortunately enough there are people who know Calc III in the class and are able to correct him. But for someone who has never seen the material, the class is too fast paced. You have to read the book. Additionally, this man is man has a horrible attitude-plain and simple. He speaks to students with an incredible amount of disdain. As an assistant professor he has no excuse to deal with students in such a manner, he let the power get to his.\nWorkload:\nnot too bad\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 23, 2009",
            "review_content": "\nMaksym was great. He understands the material and is able to teach you just enough that a quick review of the textbook should get you through homework without too much pain and tears.\nMy only complaint is the webworks portion of the class which was awful but he gave a bonus at the end which helped.\nTake Maksym. He's the best for Calc 1.\nWorkload:\nTwo midterms and a Final. All were ok if you studied. Weekly Problem Sets. Very standard. Webworks.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 29, 2008",
            "review_content": "\nMaksym was easy to deal with, and respectful of the students, eager to help everyone learn.  I still had trouble with the class....hard homework and webworks problems...and I think he skips steps when writing problems on the board so sometimes I couldn't keep up with the lecture, but I got through with a B. I'd recommend him for Calc I and as a professor who is pleasant...and, importantly,understandable (accent not bad). \nWorkload:\nLots of problem sets but manageable exams, especially for someone who has had high school Calc. \n"
        }
    ]
}