{
    "prof_info": [
        {
            "prof_name": "Michelle Smith",
            "prof_id": 12308,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Political Theory I",
            "review_date": "May 17, 2012",
            "review_content": "\nProf Smith may seem incredibly charismatic at your first class, but don't let this fool you! She has a wonderful personality, but this does not translate into her teaching abilities. She suffers from new professor syndrome of treating her students like middle schoolers. This class has high amounts of reading which she (despite what she says) incentivizes students into reading  by giving 10 pop quizzes throughout the semester. Not exactly a fun way to start your Mondays and Wednesdays at 9 AM. But even worse than this are the writing assignments that attempt to \"break down\" the different elements of political theory writing into small assignments as if specific elements of writing could exist within a vacuum...what a dismal waste of time! The prompts are dry and uninspired, the lectures even more so! Somehow Smith was able to acquire excellent TAs, but unfortunately, this was not enough to make up for her inexperience and arrogance. If Smith had let the TAs show her how to teach the class it would have been unquestionably better.\nAside from the pop quizzes, there is no need to go to class. Her lectures do not help with the writing assignments and there is no midterm or final. Do not feel the need to frantically record everything she says (which seems like the only option since she offers no powerpoint, notes etc) but only chalk board scribblings every once in a while. Despite her youth, Professor Smith seems to be incredibly lacking in her ability to effectively use technology. She would send several e-mails over the weekends with no attachments, the wrong attachment, the wrong due dates etc. She also did not (could not?) use courseworks at all.\nBottom line: Avoid at all costs until taught by someone else.\nWorkload:\nseveral small writing assignments\n10 pop quizzes\nrequired discussion section with randomly chosen people presenting each week (out of a hat that class, again with the \"pop\" theme of the class)\nfinal \"research\" paper -- repeat smith's opinions and you will get an A\n"
        }
    ]
}