{
    "prof_info": [
        {
            "prof_name": "Flora Ghezzo",
            "prof_id": 1469,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Italian Women Writers",
            "review_date": "January 16, 2006",
            "review_content": "\nProfessor Ghezzo made me love learning again.  She is an amazingly inteligent woman who expects a lot from her students, there is a lot of reading, but she has such interesting stuff to say that you WANT to read it all!  Our class always had more to talk about than we could possibly get to, and the mix between Grad students and undergrad takes the class up a notch.  I recocomend this class whole heartedly and I only wish I could take every class with her.  She's the best!\nWorkload:\nHeavy reading, a novel a week, in Italian + critical essays.  Taught in italian with some english thrown in but u must know italian well.  take home midterm and final.  Midterm rather lengthy, we had three essays to write, final just one long essay.  Its worth it, you learn soooooo much!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 20, 2005",
            "review_content": "\nIn my opinion, Professor Ghezzo is lazy and seems to only care about her own position in the department. Often late to hand back papers, never seemed to show an interest in the class. That being said, she is a nice lady and class was usually fun.\nWorkload:\nharldy any. She seems to be strict, making one page essays mandatory for every class, but then forgets about them.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 03, 2005",
            "review_content": "\nGREAT teacher...I loved this class. Ghezzo is not a tough professor...she is very laid back and hilarious.\nWorkload:\nNot bad at all...same lit hum reading as every other section and 2 papers, midterm and the final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 10, 2005",
            "review_content": "\nI think this prof. is amazing!! I had a wonderful time in this class.\nWorkload:\nNot hard at all.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 30, 2005",
            "review_content": "\nShe was a very charming person and I liked her, but I feel that the reviews here are a little too enthusiastic. She was a little lazy and too worried about getting into trouble with the core office.\nWorkload:\nA bit lighter than most, 2 papers a semester.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 06, 2004",
            "review_content": "\nI was looking through the other write-ups on Professor Ghezzo and realized that, with only a small number of reviews on the website, the truth of these reviews could be overlooked.  So let me convey to you again what my peers have tried before me: SHE IS AMAZING.  She's awesome.  She's an outstanding professor who truly engages her students.  Her eccentricity is the first thing you'll notice when she walks in (purple/black hair, extremely energetic, strong Italian accent), but as the class goes on you'll realize that you should be treasuring the classes because you know you'll miss her when it's over.  Someone mentioned earlier that despite our 6:00-8:00pm time slot, we loved going to class, and it's true.  There were times when she would talk a little too much for our taste, but to keep it in perspective, we wouldn't have wanted to talk so much if she hadn't gotten us so fascinated with the texts!  She did let us debate and discuss all the time (sometimes even about completely unrelated issues that we simply felt like talking about), and her knowledge of the texts was outstanding.  There were a couple classes where she even brought in guests to lecture who were experts on the specific texts, friends of hers from Princeton and elsewhere (she used to teach there).  Overall, if you manage to get her for Lit Hum, no matter what the time slot, BE GRATEFUL.  This is the kind of professor who you will want to join a group of you for dinner or a movie.  Her past students all wish we could take Lit Hum with her again, and a bunch of us are looking into her feminist Italian literature classes simply because she's teaching them.  Get into this class.\nWorkload:\nA couple 6 page papers, midterm, and final; she'll take care of you.  Basically you have two options: B+ or A-.  Pick the A-.  It's higher.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 23, 2004",
            "review_content": "\nProfessor Ghezzo is amazing. AMAZING. She was easily the best professor I had either semester, and this class was without a doubt my favorite. Despite the fact that it was from 6-8pm tuesday/thursday, I was (almost) always exicted to go to class and always left with a smile on my face. She is funny, very passionate about the works and knows an amazing amount. She makes the books interesting and I always felt bad if I hadn't done the reading as I couldn't fully appreciate what she and the rest of the class had to say about the texts. I had never, ever, taken a literature class before lit hum, and I am now seriously considering majoring in either english or comp lit. This class has opened my eyes to a whole other side of literature that I never knew before. I will be honestly very sad when this class is over. Despite our classes best effort, she refused to teach CC next year, and will again be taking lit hum. So if you are fortunate enough to get her, be thankful, know we're all very jealous and do NOT switch out. You won't regret it.\nWorkload:\nStandard for lit hum. 2 6 page papers(although at the start of this semester we wrote a few one pages ones that did not count towards out grade). She doesn't add any optional texts as she wants us to have enough time to do the required ones in detail. I thought her to be a very fair grader, although you will have to work hard to get above an A-(by the same token, I think it's fairly hard to get below a B+). Write a good introduction to your papers, trust me. Paper topics are usually pretty wide and you can pretty much take them in any direction you want. She can be a little slow at getting things back to you. However, that is probably the ONLY negative thing I have to say about this entire class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 16, 2004",
            "review_content": "\nProfessor Ghezzo is really great.  She is very animated and always happy.  She has a lot of knowledge, especially about the Italian texts.  She is hilarious and nice.  Her only flaw is that she often gets so into what she's saying that she neglects the discussion aspect of the class and doesn't let any of the students speak.  You would be lucky to get her for Lit Hum.\nWorkload:\n2 papers, midterm and final...kinda stingy grader (or maybe its just me) but could be worse.  Also, don't expect her to reply to your e-\nmails or send any out herself.\n"
        },
        {
            "course_name": "Stylistics",
            "review_date": "January 20, 2003",
            "review_content": "\nProfessor Ghezzo is amazing.  She's enthusiastic and fun and always seems to make the class enjoyable. In a semester filled with grammar and writing, I wasn't bored once. The material is good and she is an effective and organized lecturer.  She doesn't get your work back to you in a very timely manner but who cares. I strongly recommend any class that she teaches. She is a truly gifted professor.\nWorkload:\nreadings, essays/compositions of about 2 pages almost weekly, midterm, and take home final. --- she keeps you working but she's not a stickler for deadlines and is very understanding.\n"
        }
    ]
}