{
    "prof_info": [
        {
            "prof_name": "Jon Williams",
            "prof_id": 5237,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 21, 2013",
            "review_content": "\nBrilliant, Brilliant, Brilliant.  Absolutely deserving of the golden nugget.\nJon is absolutely amazing.  He is kind, intelligent, understanding.  You can have a conservation with him about absolutely anything- he's just so knowledgeable.  I just wish that I could have him for another semester- Core office is pushing him out for senior faculty, as they do almost every year (such a shame!).\nJon made Lit Hum a pleasurable class.  He was able to give historical, cultural context to all of the works we read.  He style is an informal lecture with expected participation- a few words every class or two is fine.  He just wants to get to know you, he's one of the rare ones that truly cares.\nHe is realistic in terms of what he expects from first semester freshmen.  He is more than happy to make time to talk to you about papers or otherwise.  Great mentor.\nGrading was extremely fair.  Helpful comments on papers.  Got things back quickly.\nIf you're lucky enough to get Jon as a Lit Hum professor, you've indeed hit the lottery.\n\nWorkload:\nReadings, Midterm, 2 papers, class participation, department final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 12, 2012",
            "review_content": "\nIf you're in JKW's class: congratulations, you just won the lottery for Lit Hum profs. \nIf you aren't yet in JKW's class: switch in ASAP.\nI took Jon's Lit Hum class as a freshman and it was by far my favorite Core class. Four years later, the class and Jon still keep in touch, and we even had a reunion! \nJon leads highly engaging, fun discussions that made two hours twice a week fly by-- even in the shitty room in Hartley to which we were relegated. He is understanding (I screwed up a paper assignment, he let me redo it and I still got an A), makes time for students (there is a standing invitation to grab a drink with him to discuss Lit Hum or anything else), and cares about his students and their experiences in the course. \nI can't say enough good things about Jon's Lit Hum section! \nWorkload:\nOne or more short papers, midterm, final. Very manageable readings. Easy. Interesting. Fun. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 20, 2011",
            "review_content": "\nJon is impressively erudite and his pedagogical approach is shaped around the modern minds of students.  Very rarely do Columbia professors taylor their teachings to make lectures enjoyable and beneficial for pupils.  He fosters a dynamic discourse and he encourages students to think outside-the-box concerning the literary context at hand - meaning, he does not limit interpretations of the texts to mere anachronistic level, but pushes you to apply concepts to modern life.  Furthermore, he is very understanding of students' personal/academic situations; thereby, he is always willing to work with you.  He is a gentleman and a scholar.\nWorkload:\n1-2 Term Paper(s), a midterm, and a final exam.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 31, 2011",
            "review_content": "\nJon is a wonderful professor, very very smart, informative and fun.  I feel very lucky that I was in his section.  His lectures are delightful, the discussions are always very lively and he turns the material into marvelous animated lectures. The enjoyment is translated into a drive to study the material and it makes the reading so much easier. He poured a lot of information about the works. When we were discussing The Metamorphoses by Ovid, he brought Ovid's complete works to class.  He read parts of The Art of Love and The Tristia. The art of love was hilarious and it gave us a broader understanding of Ovid. It was a wonderful addition to the class.  Besides being brilliant, Jon is a very very nice person, he is very understanding and willing to help.  Lit Hum is the epitome of the Columbia University experience and Jon contributed in making this class an even more memorable Columbia experience, one that will be remembered as a highlight of my entire time here.\nWorkload:\nTwo papers, a midterm and a final.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 09, 2006",
            "review_content": "\nJon's a really cool guy. He's studying to be a medievalist and he realizes that UW is a bullshit class.  I would take the class with him again.  He's pretty chill because he's still working towards his Ph.D and he remembers what it's liek to be in college.  I went to his office hours alot for papers for other classes and he helped me with those too.  \nWorkload:\nregular amount for UW: conversation essay, lens essay, CCP, group CCP, a fair grader.\n"
        }
    ]
}