{
    "prof_info": [
        {
            "prof_name": "Tomas Vu-Daniel",
            "prof_id": 318,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Intaglio 1",
            "review_date": "October 16, 2007",
            "review_content": "\nI loved this class. I took it as a senior, in my last semester, and it made me regret not having taken a visual arts class before. I had no clue what intaglio was going into it, but I learned so much. It's an amazing thing to work so closely with such talented and accomplished artists (here I include tomas and our great TA's). It's great to be in a creative environment and find out what you are really capable of. And,it's so layed back-it was a nice break form all the other craziness going on.\nWorkload:\n4 plates, each with 2-4 editions. YOu might have to go in to the print shop after class to get some stuff done, but it's not such a big deal. You become very attached to your art, and start feeling like you want to make it the best it can be.\n"
        },
        {
            "course_name": "Intaglio 1 and 2",
            "review_date": "May 12, 2006",
            "review_content": "\ndon't let his sarcasm get to you.  when you first meet tomas he's really kind of scary, but once you get to\nknow him hes really a great guy.  he's really funny and knows the medium inside and out--i can't imagine a more thorough professor for intaglio, as tomas is full of\nnot only answers, but valuable suggestions and ideas on how to improve your work.  not to mention etching is just so awesome anyway and you should take the class just to learn it.  but the instruction is truly stellar.  plus he sends his TA's off to buy the class cookies every day.\n"
        },
        {
            "course_name": "Intaglio 1",
            "review_date": "January 03, 2005",
            "review_content": "\nTomas is fabulous.  He gives his class a fair amount of freedom, yet knows how to push each individual student.  On top of that, he's full of great stories, and is hilarious.  I reccommend him.\nWorkload:\nNot bad at all--I think we did about four projects, and it's not really necessary to put in time outside of class if you don't want to, except for the final.  Its really as much work as you want it to be, but if you're electing to take this class, you probably would want to put in some extra time.\n"
        },
        {
            "course_name": "Printmaking",
            "review_date": "December 31, 1999",
            "review_content": "\nTo be honest, I cannot exactly figure out why this man is such a great teacher. He is very soft-spoken, and at the end of the semester, I was surprised to discover that he even knew my name. But the quality of work produced in his class is some of the best I've seen in the entire visual arts department (both undergrad and graduate). I think he gets the class going by teaching them the process, and then not interfering too much beyond that. I found that I really flourished if left to do my own thing, and I observed the same thing with the rest of the class. Assignments are very-open ended and there is room to be very personal. I had to go in for a few hours every week outside of class to keep up with the pace of the class (which i was always happy to do), but others who worked more quickly didn't even have to. Tomas, though he is very reserved and though he seems barely present, is clearly a very kind, special person who is passionate about making art. His students adore him.\n"
        }
    ]
}