{
    "prof_info": [
        {
            "prof_name": "Vanessa Smith Morest",
            "prof_id": 1598,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "sociology of education",
            "review_date": "April 21, 2004",
            "review_content": "\nThe lectures were very dry and boring, but the reading was very interesting and you will learn a lot about Education in the United States. In spite of the boring presentation and too-long tests, I would recommend this class because the material is so important. The course will change (or at least make you think hard about) how you approach major issues.....and isn't that the point?\n"
        },
        {
            "course_name": "sociology of education",
            "review_date": "October 26, 2003",
            "review_content": "\nIf you are passionate about sociology, education, or LIFE, do not take this course because Professor Morest will in no way understand or reflect any of these passions.  While some of the books assigned were extremely interesting and the TA's were always helpful, Professor Morest is the most boring lecturer I have ever had.  She drones on and on about inconsequential topics and rarely gives any sense of her own experience or investment in the topic at hand.  While clearly a very nice woman, she does not yet understand testing situations (we were given a midterm that few people finished) or how to relate to students in a classroom.  The reading is important to do for success in the class, but only take this is you are prepared to sleep through every class\nWorkload:\n2 short papers, a midterm, a final, and a good deal of reading \n"
        },
        {
            "course_name": "sociology of education",
            "review_date": "September 03, 2003",
            "review_content": "\nThis class is AWFUL.  The syllabus is excellent and covers a wide range of theoretical perspectives.  That said, I dreaded this class everytime.  Morest mumbles, provides little insight into readings, allows students to make ignorant comments, and does not lead discussion very well.  \nWorkload:\nlots of reading. two short papers. midterm. final.  easy grading.\n"
        },
        {
            "course_name": "sociology of education",
            "review_date": "September 02, 2003",
            "review_content": "\nInformative class.  If you come in with an interest in education, you can learn a lot.  Vanessa is an organized teacher and covers the readings exactly as they appear on the syllabus.  The class is taught in a loose fashion in terms of discussion, however, which can often times be annoying.  A few times students were forced to work in small groups during the lecture class, which was unnecessary and counterproductive.  The readings are very interesting, and cover a variety of topics in education.  Readings are covered during class, so if you don't do all of them it's not a big deal.  Vanessa always makes herself available to discuss the material after class, which is helpful.  Overall, a good course.\nWorkload:\n2-5 page papers, midterm, final.  Grading on final lenient.\n"
        },
        {
            "course_name": "sociology of education",
            "review_date": "May 08, 2003",
            "review_content": "\nThis is a pretty good class and not too demanding. tthe primary problem is how huge the class is and how the prof tries to run it as a discussion.  still, when she lectures, the class is very informative, and you will learn a lot.\nWorkload:\nfair amount of reading, but you can skim it, midterm, final, two papers\n"
        }
    ]
}