{
    "prof_info": [
        {
            "prof_name": "Ellen McLaughlin",
            "prof_id": 1928,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Playwriting",
            "review_date": "April 05, 2005",
            "review_content": "\nif you have a serious interest in writitng... take this course!  i was reluctant to post a review because i loved this class so much, i may take it again.  (and i didn't want every one to take it).  prof mclaughlin is a brilliant actor and playwright.  i've seen and read her professional work and she is truly extraordinary.  i agree with the other reviewer.  this is not a course to pad your schedule.  the workload is heavy.  but if you want to learn, heavy is a good thing.  she promptly reads all work given her and returns feedback immediately.  she is thoughtful, warm, encouraging and to the point.  she doesn't give false praise but neither does she tear people apart. (i hate mean arts profs.  i don't think it helps).  she shows her years of experience in her ability to give succint notes that get to the heart of your writing.  my favorite thing about ellen was that she gave us the permission to write badly and you didn't feel like a horrible person for turning in a lame scene.  over the course of the semester, the class got braver and braver.  i definitley made great strides in my writing and confidence. a brilliant woman.  a brilliant course.\nWorkload:\nread 2 plays a week.  write a minimum of seven pages a week.  turn in one act play for final.  \n"
        },
        {
            "course_name": "Playwriting",
            "review_date": "January 08, 2004",
            "review_content": "\nEllen teaches playwriting at Barnard every fall.  I reccomend her class emphatically to people who are very serious about writing.  Her approach is intensive-- you will write at least 7 pages a week, read 2 plays a week, and come out of the semester with a complete one-act play.  This is not a nice, easy creative writing class to pad your schedule with.  But you will quickly learn to get comfortable with a difficult medium, and by the end of the semester your writing will have gotten much better.  She is also a lovely woman and a terrific playwright.\n"
        }
    ]
}