{
    "prof_info": [
        {
            "prof_name": "Herve Jacquet",
            "prof_id": 123,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "August 18, 2004",
            "review_content": "\n  I went to see the Professor several times, and he was always helpful.  \nMy friends from the class, all of whom like math, but none of whom are too nerdy, were all disappointed that Prof. Jacquet is not teaching Calc II this fall.  \n\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "June 26, 2004",
            "review_content": "\nProf. Jacquet is not the teacher for you if you don't naturally understand Calc.  He has very little patience for students who don't pick up on the material immediately and shows minimal desire to provide help out of class.  I found it disturbing that he pretended to be pleasant in class, but in private was an entirely different, unapproachable person.  As knowledgeable as he may be about calc., he lacks the qualitites necessary to be an educator.  \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 23, 2004",
            "review_content": "\nProf. Jacquet is a very nice man who goes out of his way to answer questions in class. His lectures are straightforward, and always add insight not available from our textbook.  He is very organized, and we are well prepared for the tests.  He is very approachable after class if you have questions.  His French accent is funny but does not make him impossible to understand.  \nIt looks like these other reviews were written by bitter students who did not do well in the class. You do need to do the homework, read the book and study if you want an A. But this is the Ivy League.   The professor now goes to great lengths to stand away from the board after he is finished writing so that everyone can take notes.  \n\nWorkload:\nWeekly problem sets reinforced by webworks homework.  The webwork homeworks usually cover subjects studied the week before which is very helping in reinforcing material learned in preparation for tests.  Grading is 25% each for two mid-terms, 40% for the final and 10% for homework.  The homework is often harder than the tests but this is a good balance - people who want to learn more can but those who have trouble with math won't fail if they do the work and come to class.  \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 17, 2003",
            "review_content": "\nVery heavy accent, but if zu underzand thiz zen you will be fine wit z ac-zent.  Very fast writer, some of his letters are not very legible (so its pick a variable),  and he stands in front of his writing (literally) so he gets a good head start in writing his chickenscratch.  With all this said, I can't undermine the fact that he is one of those teachers that knows his stuff, but you just have to unlock it under the accent and horrible handwriting.    \nWorkload:\nProblems Sets (weekly), Two midterms (if you don't do well on the first one, you're going to fail the second), Final\n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "May 10, 2003",
            "review_content": "\nthis guy seems to have lost all interest in teaching. during lectures he completely ignores the class and goes into long proofs which are not particularly relevant to hw or tests. not very nice about questions. i went to see him becasue i had missed a minus signs ina  problem on an exam and he took off 20 of the 30 pts. he was nasty to me and wouldn't  even look at the problem. boring lecture. bad hand writing. hard to understand sometimes.\nWorkload:\nweekly hw, 2 midterms and final were farly straightforward.\n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "May 16, 2002",
            "review_content": "\nA decent, but not amazing professor. His lectures are very straight forward and well organized. He can be a bit hard to understand because of his accent and the fact that it can be difficult to distinguish various letters he writes on the board (as alluded to by an earlier reviewer). Also, if you have trouble understanding something in the beginning of class, it can be hard to catch up, since he doesn't repeat things very often. The problem is, the material for this class is just not that interesting (and I find math interesting in general) and Herve doesn't do much to make it more so. Perhaps he was discouraged from his occasional attempts at humor (which were sometimes quite funny), by the fact that this was the most humorless group of students I've ever had a class with; they never ever laughed. He was very accessible and was happy to talk to me during office hours. He clearly knows what he is doing, he was always able to competently answer the rare question that someone in class asked (although he did sometimes seem frustrated at how brain dead a lot of these questions were). I suspect he would be a better professor if he were teaching a more interesting class. \nWorkload:\nWeekly problem sets, two midterms, final. The exams are much easier than either the problem sets or the problems he goes over in class.\n"
        },
        {
            "course_name": "Calculus S series",
            "review_date": "December 31, 1999",
            "review_content": "\nA difficult to understand Frenchman. Lectures profusely by writing pages and pages on the chalkboard. Prof Jaquet has the look of a mad genius. Not very receptive of questions during lecture.\nWorkload:\nS series homework, midterms, final.\n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "December 31, 1999",
            "review_content": "\nCouldn't understand a word this man said/wrote in class. Is it an \"x\", a \"n\", an \"i\", a \"t\", or an \"f\"? Does it matter?\n"
        }
    ]
}