{
    "prof_info": [
        {
            "prof_name": "Emerson Bowyer",
            "prof_id": 3926,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 18, 2010",
            "review_content": "\nDo not be fooled by Emerson Bowyer's easy going appearance. Yes, he did come 10 minutes late to our midterm, nunning the first tones of Beethoven's 5th and saying: \"My god you guys, are you nervous? I was up all night worrying about how you would do! ... Just kidding, I went to a drag show.\". We also did not get any longer in the curriculum than Monet. And the strictly necessary workload is pretty manageable. \nYet, I have never filled more booklets than I did on our midterm. I have never taken such sheer pleasure in writing assignments. And regarding the curriculum, I'll use Emerson's own words when it became clear that we would not end anywhere near Andy Warhol: \"I said this was a class about learning how to understand visual expressions. Now you do. Now you can go to any of those artists on our curriculum and figure out what they were about for yourselves.\" \nIf you get the chance to choose ArtHum instructor, choose Emerson Bowyer. And if you see this, Emerson, I sincerely hope you will act on your promise from our last class and meet us all for a drink or two! \n\nWorkload:\nTwo 3-5 page assignments (you should probably end up closer to the 5 than the three), take-home final with two essay questions 750 words each, three (amazing!) visits to the Met. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 16, 2010",
            "review_content": "\nProfessor Bowyer is by far one of the best professors I've had at Columbia. He is by no means a traditional boring art historian- instead, he really encourages critical discussion and opposing viewpoints. He also knows everything about everything- Met tours with him were like having a private expert take you through the museum and talk about everything within arm's reach. He is incredibly energetic and enthusiastic in the classroom, and really does an amazing job of explaining things, giving background, and encouraging discussion. He also very approachable, and very willing to help students out with deadline extensions and more information. Even if you don't consider yourself an art person, it would be impossible to take this class and not get something out of it while also enjoying yourself. The workload was entirely manageable, and actually interesting because there was so much room for individual ideas and interests. Honestly, the art history department and core could use more professors like this one.\nWorkload:\nCompletely manageable- two papers comparing works from the Met, light reading, in-class midterm, take-home final, two to three trips to the Met\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 09, 2009",
            "review_content": "\nEmerson has the two most important characteristics of a charismatic lecture; expertise and enthusiasm. Although students have a mix of backgrounds when taking core classes, many of whom have little practical use for this subject matter, I can confidently say that Emerson instilled in every student a genuine interest for art. In class, he'll be constantly moving around and pointing at slides in such a way that leads you dynamically through the analysis of the works. The best part of the class were the lectures given at the Met which became successively better. This is when his already high energy came out most. He's a young guy with a friendly and humble disposition which makes him very approachable. When I hinted that I had been struggling with a paper, he didn't hesitate to offer me an extra day.\nWorkload:\nArt Hum seems to be one of the easier core classes in regard to both workload and ease of grading. The workload is very light and the grading was generous. He does a good job of making you care about the subject in such a way that makes you want to produce quality work not just for your grade's sake.\n"
        }
    ]
}