{
    "prof_info": [
        {
            "prof_name": "Helene de Aguilar",
            "prof_id": 202,
            "total_reviews": 43
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "May 15, 2011",
            "review_content": "\nProfessor Aguilar is my favorite professor I've ever had (granted I just finished freshman year and have only had 9 professors, so take that as you will). She is my favorite type of professor (the ones who scare you shitless so that you do well, but then let slip that they actually are nice people who do care about you). While she was very strict and demanding I learned a lot in that class and also managed to have a lot of fun (she has a lot of great stories that she tells anyone who is willing to listen). I would love to take another class with her (regardless of subject matter) before I graduate.\nWorkload:\nProbably more than most Intermediate I classes. A lot of worksheets, a couple of essays, a couple in class essays. However there was no oral exam or final project like many other classes had.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 13, 2010",
            "review_content": "\nProfessor Aguilar is brilliant; she is clearly an assiduous intellectual and there are times that I think she actually enjoys teaching. She could be an extraordinary professor, however, she is impatient, intolerant of mistakes, intimidating, and borderline verbally abusive. Disparaging comments were not uncommon throughout the course; she stops her feet, yells, and she even managed to make a girl cry in my class, as well. Profesora Aguilar could be an amazing professor if she would maintain her professionalism and watch her temper (which flared almost every single class period). Other than her regular temper tantrums, she's a great professor. In my opinion, though, belittling students with constant degrading comments is unacceptable and frankly, inexcusable. \nGood luck with getting feedback on graded essay assignments. Professor Aguilar's comments/corrections on papers were completely illegible. She is a thorough grader but unfortunately, corrections are worthless as you cannot understand what any of it means (and this is not for a terrible paper - I never got anything less than a B on any graded assignment). \nOn the plus side - Professor Aguilar is terrifying and as a result, you work extremely hard to avoid her wrath. You DO learn a lot, but you'll have to decide if it's worth the many hours of therapy that you'll be needing once you finish the course. \nWorkload:\nIt's definitely doable but probably more than other Spanish courses. You'll write at least 3-4 graded essays and have a couple in class essays. Lots of worksheets, reading (Casa Tomada and La Lengua de las Mariposas), and movies (you'll be assigned 3 movies to watch outside of class that you'll discuss and write about). In class you'll listen to Spanish opera and read 12th century Spanish poetry. It's a good class but certainly not for the faint of heart. \n"
        },
        {
            "course_name": "1202",
            "review_date": "June 20, 2010",
            "review_content": "\nI agree with the other reviews about de Aguilar. She is both tough and a great professor. I learned much more from her in a month or so than I did from my first semester \"easy\" professor. Professor de Aguilar is not for the faint hearted, however. She made a girl in my class cry during her oral presentation. Her grammar worksheets really help you understand the material, and make the departmental midterms easy. Also, go to Aguilar's office hours.   \nWorkload:\nI would say more than other 1202 professors. Grammar worksheets, but same rubric as other classes. \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "November 19, 2009",
            "review_content": "\nI am deeply indebted to Profesora Aguilar.  Without her, I would never have been able to woo the Spanish hotties like I did while visiting Madrid this summer.  For me, her grammatical worksheets translated into a Latina lovefest.\nI took Spanish Intermediate II with Profesora Aguilar, and I learned a ton.  I recommend taking her class if you really care about learning the language, because she will teach you.  If you're just satisfying the language requirement, find someone else.  She has a very thorough understanding of Spanish, English, and apparently several other languages, and she had excellent explanations for all of my questions.  She will repeat the key concepts until the class understands it, but don't expect her to be happy about repeating things if it takes you longer than it should.  Do her assignments and you'll be fine.\nShe likes to bring cultural elements into the class, which I thought made it much more interesting.  She's very interesting to talk to, and it will help you to do so in her office hours.\nWorkload:\nMore than most Spanish Intermediate II sections, but not unreasonable.  The extra work does help learn the material, so if you want to learn it's worthwhile.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "May 17, 2009",
            "review_content": "\nI am not the type of person who reviews professors badly, but this experience was something terrible.\nTo give her a little credit, I liked her a lot. I thought she was smart and funny and she knew a lot about music and art and humanities.  Does she care if her stories are interesting?  No, but that's what's funny about her.  Her clothing was weird, she was kooky, and she is knowledgeable in a lot of subjects, but also insecure as hell.  A friend of mine knows her as a person, not a professor, and loves her.  I could see that happening, but unfortunately I had the displeasure to be in her class.\nShe is also terrifying in appearance and personality.  Once she threw something at a student, she yelled, screamed, etc.  I have blocked out a good deal of her class because I sat there hoping that she wouldn't call on me the entire time, and saw most of the class tremble uncontrollably in her presence.  The only people who did well or enjoyed it were people who took a too low level Spanish class for an easy A.  She does not encourage you to talk to or to be friendly with the other people in the class.  The only thing you can do is similarly lament the C- you received on another paper or quiz.\nOffice hours are helpful, but she mostly complains that other Spanish teachers are too easy, talks about her time in the 1960s, quotes Bertram Russell, etc, etc.  She expects you to remember everything she says, even if she says it once.  I am not a language person, and this was my first language class at Columbia.  I left convinced I was an idiot with no capability to ever learn Spanish, and it was incredibly scarring and follows me today, even after a great Intermediate II Professor and two months in Latin America.  If you are a Spanish speaker or a masochist, this could be great.  Otherwise, steer clear.\nWorkload:\nabsurdly hard.  Daily homeworks that are graded, many quizzes (sometimes unannounced), departmental midterm and final, reading that is departmentally mandated but not at most student's level\n"
        },
        {
            "course_name": "Spanish 1202",
            "review_date": "December 27, 2008",
            "review_content": "\nThis class is hard.  Professor Aguilar is a wonderful woman, but while you are in her class you don't realize it.  She is quick to get frustrated with the level of language skill of her students, and can be very intimidating in class.  She also can make you feel really stupid when you get things wrong.  This aside, she really wants to see her students succeed.  \nWithin the first few days of class she explains how she factors how hard students try into their grades.  This is true.  While the grades you get throughout the semester don't show it, your final grade will.  Just make sure she knows you are putting in the effort.  \nGO TO OFFICE HOURS.  If you don't she will not let you live it down.  Plus, going is actually really helpful - even if you don't go for anything specific.\nProfessor de Aguilar is also crazy.  Honestly.  She sings in class (she's really good), and she tells hilarious stories and jokes, but she is also a little nuts.  Personally, I enjoyed it.  It made class interesting.  \nBottom line: she is a good, tough professor.  It's a lot of work, but it's worth it.  \nWorkload:\nLots.  A lot of homework - worksheets, stories, and 1-2 paragraph essays.  It's not too difficult, just time consuming.  There are a few quizzes, a midterm, a final, and some graded homework assignments and essays.  Go to office hours.  Go to class. \n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "December 23, 2007",
            "review_content": "\nIs Professor de Aguilar a demanding teacher? Yes. Is she also a brilliant one? Yes.\nThere are TONS of CULPA reviews that bash this poor women. And those reviews are written by lazy people who did not do the reading or the homework and were somewhat surprised when she gave them bad grades.\nIf you do the work, if you try, if you show up to class with questions and something to say, then she will reward you. Not only that but she will teach you more than just spanish. Class is never ever boring. If she's not telling you about her days as a professional singer, she's reciting poetry from memory.\nIf you want to just finish your language requirement, then this professor is not the one for you. But if you want to be challenged, have some fun, and actually LEARN then definitely take this class.\nWorkload:\nMaybe 1 quiz a week, 4/5 oral exams which are really more like group discussions in-class, weekly writing assignments, and one test each quarter.\nShe doesn't write the midterm or the final so, as her student, you find them disgustingly easy.\n"
        },
        {
            "course_name": "Latin American Humanities II",
            "review_date": "July 08, 2007",
            "review_content": "\nI do not agree with all the negative reviews about Aguilar. Fine, if you want an easy A then go to a state school and don't take a challenging professor. However, if you want to improve your writing and learn a great deal then she's the professor for you. She was exceedingly knowledable about EVERYTHING. Her lectures were interesting because they often went wherever the students lead them. She is a very tough grader of your work, and it will not be uncommon to get a B or B- on some of your responses. However, at the end of the semester she seems to take a lot of other factors into consideration. I received pretty much straight B+'s on responses (a few A-'s and B's) and B on the midterm. However, I went to every class and finished with an A-. As for approachability, she is very friendly. I went to her office hours several times and she was always willing to discuss your work, and with most students would even up your grade 1/3 of a letter grade on an assignment if you went to see her. \nWorkload:\n6 reponse papers, one long paper, midterm, final, and presentation. Papers graded relatively harshly, but not indicative of your final grade.\n"
        },
        {
            "course_name": "Intro to Hispanic Culture",
            "review_date": "December 28, 2006",
            "review_content": "\nWonderful professor and person!  Profa. Aguilar is very knowledgeable and down to earth about the theoretical pieces of spanish literature that we read in class.  She goes over all of them in small class discussions that are open-ended.  She is easy-going and very friendly.  Even if you haven't done the reading you can still voice your opinion on the themes discussed.\nWorkload:\nWeekly 1-page response papers, heavy readings for the 2 weekly sessions.  One midterm, one final (relatively straightforward and easy).\n"
        },
        {
            "course_name": "Latin American Humanities II",
            "review_date": "November 29, 2006",
            "review_content": "\nAs others have said, she knows everything obscure and is tirelessly intellectual, but this is in fact one of the biggest reasons why her class is intolerable.  She makes far-flung references with every breath, and she doesn't do it for her students' benefit (unless making them annoyed and feel inferior/stupid is part of her teaching strategy).  She's not friendly, not approachable, not even bordering on nice, but perpetually makes you feel inadequate and gives you the grades to reflect it (and she admits that they're very subjective).\nAs for the class itself, it's got such scope that most material is just glossed over, such as contemporary political topics.  Readings are ample but usually interesting.\n"
        },
        {
            "course_name": "Reading and Writing 20th Century Literature",
            "review_date": "June 24, 2006",
            "review_content": "\nAwful teacher.  When it comes to grading your paper, all she does is circle your mistakes, but does not tell you on the paper what your mistakes were.  A biased teacher as well.  If you want to learn grammar with a patient teacher, do not register for her class.  She will talk about how she knows German, and you get lost as to wait a minute I thought this was a Spanish class.  She tries to scare you away, and I really do not understand why the Spanish department still allows her to teach there.  Please faculty if you are reading this, you must try to talk to her about her teaching skills and behavior towards students.  Thank You.\nWorkload:\nHeavy reading, but when it comes down to writing the paper, she'll rip you apart, tells you do not know Spanish and when you want to know how to improve your grammar, her help is not there, believe me.\n"
        },
        {
            "course_name": "Latin American Humanities I",
            "review_date": "April 17, 2006",
            "review_content": "\nThis class is completely disorganized and the sylabus rarely provided any insight as to what we were actually supposed to read, write, watch, present. Yes, there is a lot of work and it's spread into many different categories and there are pop quizes on it, so you have to do it.  Still, Professor Aguilar is one of those people that just knows everything and can quote anyone.  She tells entertaining stories and sings!  The reading material, when you actually know what to read, is very good, but the class produces a lot of stress and she is a hard grader.\nWorkload:\nLots of reading, writing, watching movies, a midterm and final and final paper, a presentation, and every Monday you have to know what happened over the weekend in Latin America- YOU REALLY HAVE TO KNOW!\n"
        },
        {
            "course_name": "Reading and Writing 20th Century Hispanic Lit.",
            "review_date": "February 01, 2006",
            "review_content": "\nIf you had asked me in October, I would have said that Profesora Aguilar was the greatest professor I had ever had at Columbia. Others have already said it here: she knows EVERYTHING, she quotes whole poems, sings songs - everything from Italian opera to Mexican folk songs to Schubert's Lieder to Gilbert & Sullivan operettas, she has a witty obscure quotation from someone famous for everything. Just, really fabulous professor who will awe you with her knowledge.\nSomewhere in October or November though, the enthusiasm in her, and in the class, died. It became tedious to go to, and I can't say why. She seemed less the glorious performer I was in awe of, and more annoyed to be there. She chimed in with the occasional song and poem or quotation, but it seemed half-hearted. It was unfortunate, because before that, she had been the best professor I had encountered.\nShe certainly was not the evil person described for the earlier classes in this class. I think because at the 3000 level, people want to be there. The workload wasn't ridiculous, and even if you hadn't done the work (one time, I had forgotten something), she just skipped over you and looked forgiving - didn't yell at or berate you. If it was clear you were just makign it up because you hadn't read (not that you didn't understand, she forgave that), she could give you the death stare, but wouldn't say anything.\nThe workload was fine: the short stories were fun to read, and enthralling to discuss in class because of all the things she'd bring to the surface about them, or comparing them to world literature (very often German literature, which as a German student, was cool to see some overlap). The poetry block could be sort of tedious or boring. We never got to the book, so I can't comment on that. \nWhats really clear is that she wants you to learn and to do well. She lets you hand in a 1-2 page ungraded response paper every couple of weeks before your longer papers where she encourages you to try out large phrases you might want to use in your bigger papers without the penalty of getting them wrong and being marked down, which is probably where I learned the most in this class. The papers increase in length from 3-5 to 4-6, to a final 5-7 page paper. They seem to be graded harshly, but as she'll tell you at the end of the class, these grades are more what you \"earned.\" She inflates your final grade to the inflated standard.\nOverall: this class was one I enjoyed, but was disappointed by the profound drop in enthusiasm half way through. Had it kept up, it would have been the greatest class I had taken at Columbia, and de Aguilar the best professor. She definitely is among the Spanish department's greatest teachers.    \nWorkload:\nReading for each class from 15-45 pages. Shorter during the poetry block. 1-2 page ungraded reading responses, 3 long essays. Final. \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "November 03, 2005",
            "review_content": "\nHands down worst professor i've had at Columbia.  I don't know what all the reviewers were thinking when wrote what a good professor she is.  If by intelligent they mean pretentious and condescending I can understand.  In her class I had to put up with her daily operatic performances while trying my best to suppress laughter.  After getting an A in all previous Spanish classes she would award D's and F's to about half the students in the class.  She would chastise students who did not come up with the answer right away, and boy does she pick favorites.  Even after going to her office hours to try and give the impression I wanted to improve, there was no relenting in her completely unfair grading methods.  Need proof to back up this review?  About half the students dropped the class right before the drop deadline.  I took a class with a different instructor the following summer and received an A.  Stay away from her.\nWorkload:\nToo much ridiculous work.  \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "July 04, 2005",
            "review_content": "\nProf. Aguilar is intelligent, well-spoken in both spanish and english, hilarious, and an all-around great spanish teacher. I learned more from her in a few months than I did taking years of Spanish in high school. Be forewarned: If you are one of those people who hates foreign language and is dying to finish your requirement, her class is not the best choice for you. While she has a deep respect for students who put forth a sincere effort, she has no patience for people who show up having done nothing, and repeatedly make the same mistakes on a daily basis. She's not afraid to humiliate those people. But, if you do enjoy spanish, even if you're not looking to major in it, but you don't mind doing what you have to do to get whatever is expected of you done, she's awesome. She loves meeting with you in her office, and is willing to break things down for you in english if need be. \nWorkload:\nLight nightly homework assignments, the book \"El Coronel No Tiene Quien Le Escriba\" which is on the longer side (110 pages) and pretty tough vocab-wise, fair quizzes, midterm, final, group oral presentation. Some say her quizzes are really tough, but if you study, you'll do fine. The midterm and final are pretty easy. \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 18, 2005",
            "review_content": "\nThe class was more difficult than any Spanish class I have taken, but I came out with a much better understanding of the language than at any previous time. This class helped me correct prior deficiencies in my Spanish ability, and though I was intimidated for the first few weeks by the professors demanding style, in the end I really felt like I had a much more firm grasp of Spanish. Meeting with the professor is definitely recommended, I felt a lot better after doing so. The quizzes are extermely difficult but the midterms and finals are pretty much a joke in comparison.\nWorkload:\nquizzes, nightly homework, reading a 110 pg book with difficult vocabulary, 4 compositions, midterm and final written up by department... the usual for the CC language requirement \n"
        },
        {
            "course_name": "20th Century Hispanic Literature",
            "review_date": "January 17, 2005",
            "review_content": "\nProfessor de Aguilar is hands down the best professor that I've had at Columbia.  The breadth of her knowledge never ceased to amaze me.  Despite being able to sing 13th century songs and recite obscure poems, she was not pretentious, but instead focused on sharing her knowledge with students.  Discussions on the texts were always interesting and informative, and comprehensive, extensive feedback was given on all written work.   Grading is fair (it seems harsh at the beginning, but she boosts grades to account for grade inflation at the end).  Overall, I wish I could take another class with de Aguilar.\nWorkload:\n3 papers (3-5 pages), midterm, final, weekly readings that take about 2 hours\n"
        },
        {
            "course_name": "20th Century Hispanic Literature",
            "review_date": "January 03, 2005",
            "review_content": "\nShe is so awesome, she knows everything, and she makes class enjoyable by default, not by jumping up and down and putting on some crazy show. \nWorkload:\nReadings - I'd estimate about 2-4 hours per week of work. Papers occasionally, like 4 pages.\n"
        },
        {
            "course_name": "20th Century Hispanic Literature",
            "review_date": "December 17, 2004",
            "review_content": "\nFANTASTIC PROF. i think she has memorized the entire contents of western literature, seriously. she relates what we're discussing in class to a broader historical/social/literary context -- and quotes from memory everything from obscure poetry to dickens. she also has really interesting ideas about the work, and is not afraid to present them, yet is encouraging and respectiful of dissent in class. she likes lively discussion and participation counted for 35% of the grade. \nMany complain about her grading, but I found it fair. She definitely tries to scare students off in the beginning by making her class seem uber-intense. And it's definitely intense -- but it's a great intellectual experience. It is more work and is graded more harshly than the other sections, and Aguilar likes it that way.\nWorkload:\ndaily reading, mostly short stories, some poetry, 5 papers, 4 ungraded, one-\npage reaction papers, 1 novel (read it ahead of time...you'll never realize how much slower your reading in spanish is!) \n"
        },
        {
            "course_name": "20th Century Hispanic Literature",
            "review_date": "October 23, 2004",
            "review_content": "\nThe best, funniest, most intellectual professor here at CU. She is the ideal humanities woman - knows everything. \nWorkload:\nIt's college, you're supposed to have work\n"
        },
        {
            "course_name": "Latin American Modernist Lit. (W 3332)",
            "review_date": "September 04, 2004",
            "review_content": "\nNow, Helene is indeed one of the brightest minds in the spanish department who is, I admit, underrated. However, she also has a personality that can drive her students crazy . I call her an \"intellectual bully\" because that is what she is. \nMind me, she will teach and amaze; and often times exude an air of superhuman intelligence, but when it comes down to it: If you don't know the \"right\" answer to her \"right\" question, DON'T RAISE YOUR HAND because she will often times make it painfully evident that you're wrong, wrong, wrong: \"No, No, NO!\" \nWorkload:\ncuatro ensayos, short stories, and some other stuff.\n"
        },
        {
            "course_name": "20th Century Hispanic Literature",
            "review_date": "May 12, 2004",
            "review_content": "\nTake this class.  It's the best I've taken here so far.  The material is fantastic.  Professor Aguilar is brilliant and funny.  She once said she is \"nothing if not associative\", which is very much the case- she ties modernist literature to all of her favorite poems, which she'll recite, or songs, which she'll sing.  If this kind of thing bothers you, then don't take the class.  Also, she can be harsh, so make sure that you come prepared and go to office hours if you need help.  \n"
        },
        {
            "course_name": "Reading and Writing 20th C. Hispanic Lit",
            "review_date": "May 08, 2004",
            "review_content": "\nIf you were monstruously bored by the grammar overload of Grammar and Composition and want to delve into a Spanish literature class you can really sink your teeth into, take Prof. de Aguilar's class!  She will wow you with her breadth and depth of knowledge regarding the material, and speaking of the readings, they are great!  Quite tricky at times, and sometimes lengthy as well, but this is stuff you have to read if you enjoy Spanish lit.  I found this class to be a great introduction.  It somehow succeeded in going very in-depth while also covering a wide range of genres and styles.  The poetry section at the end is phenomenal!\nWorkload:\nReadings for each class, four essays of increasing length, one really fun poetry translation project, and a final exam.\n"
        },
        {
            "course_name": "Spanish 1202",
            "review_date": "April 28, 2004",
            "review_content": "\nClearly brilliant and highly, highly educated.  Excellent approach to advanced spanish that focuses on rules rather than feel.  She is available for out-of-class help and varies her class meetings to avoid boredom.\nShe has a high standard for students and expects you to work at the material.  However, if you try and see her during office hours she'll be more lenient.\nShe has a tendency to be a little caustic in her responses to students, usually when students ask questions about material they should already know.\nRecommended.\nWorkload:\nexercises, vocab. and readings for each class, not very heavy.  Weekly quizes with vocab and grammar.  Midterm and Final - both not too bad.  You read a novel and have mutliple, short compositions throughout the semester. \n"
        },
        {
            "course_name": "20th Century Hispanic Literature",
            "review_date": "April 20, 2004",
            "review_content": "\nProfessor de Aguilar is excellent.  She is extremely intelligent, and peppers class discussions with insighful connections to other literature and art forms.  She embodies the intellectual experience, and is why students should come to Columbia.  Enjoy this class!\nWorkload:\nFour papers and a final.  Read the novel over vacation as she suggests, or you'll live to regret it.\n"
        },
        {
            "course_name": "Reading and Writing 20th Century Hispanic Lit.",
            "review_date": "January 12, 2004",
            "review_content": "\nI really enjoyed Professor Aguilar's class. She loves the material that she teaches and knows the material extremely well, to the point of being able to quote from most of the works we read, in addition to obscure 12th century philosophers and famous 20th century gravediggers - I exaggerate here, but Aguilar does operate under the assumption that she probably knows more than you ever will or could hope to, and so whatever she says will be of some educational value. I can see how she could be intimidating to people who either don't do the reading or have continued trouble understanding the works, but if you keep up with the assignments and go to her office hours (which are numerous and convenient, to my mind) then you stand a good chance to get a whole lot out of her class. The lectures on the history of latin american literature are boring, but I would fault the class structure itself, rather than Aguilar's teaching style. Her enthusiasm is infectious. \nWorkload:\nSmall(ish) but persistent reading assignments that really catch up if you don't read continually. 5 3-4 pg. essays, a fairly simple translation project, and an easy final. \n"
        },
        {
            "course_name": "READ/WRITING-20 C HISPANIC LIT",
            "review_date": "December 28, 2003",
            "review_content": "\nProfessor Aguilar is quite unique. She is amazingly intelligent. She frequently, for instance, recites entire poems from memory when she is reminded of them by the class discussion. She certainly knows the material, and is not afraid to display this immense knowledge. Often, she talks too much in class, and somewhat disturbs the class discussion. She is, though, pretty interesting, so it's not too bad. The stories you read in class are generally good. Really the only bad part of the course was that Prof. Aguilar ocassionally decided to give lectures about the history of hispanic literature. These lectures were boring, and often hard to understand. In general, Professor Aguilar is a good teacher. She has office hours for several hours every single day, so she is readily available for extra help. She grades fairly, but does give a pretty large amount of work. Although she can certainly be intimidating, she is a kind person.\nWorkload:\nReading for every class (probably average about 1 short story per class). At the end of the course, you read an entire novel. 4 papers varying in length (average about 3-4 pages). 1 in-class \"presentation,\" in which you have to lead the discussion about one of the short stories. 1 translation project (not too difficult). Fairly easy final exam.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 17, 2003",
            "review_content": "\nShe is a very interesting woman.  He is very cultured, and not just in Hispanic culture.  She has a great singing voice and will often burst into song for the class.  But it is true, if you get her to like you, you're home free.  If not, prepare to be called on a lot.  She does this with good intentions though, because she concentrates on the weaker students in order to get them to learn Spanish.  Don't slack off, work hard, study grammar and don't forget it.  Be active in class, she values that a lot.  She is always available during office hours.  If you do what she tells you to, you will doubtlessly leave that class knowing a good deal of Spanish.  I would recommend her if you want to learn Spanish and are willing to work hard.  This is not as important, but try to address her with the Usted form or she will correct you.\nWorkload:\n15-30 minute homework given most days.  A few essays throughout the semester.  Tests most weeks on very little material.  Department midterm and final are shmeezy the way she prepares you for them.  Oral presentation at the end of the semester which she says doesn't count for much because she has seen your speaking abilities throughout the semester.  Buena Suerte!\n"
        },
        {
            "course_name": "Intermediate 1",
            "review_date": "November 09, 2003",
            "review_content": "\nNIGHTMARE.  I never wanted to go to sleep at night becuase i knew I'd have to wake up and go to her in class.  Unless you already know spanish and are taking the class for an A+ all 4 semesters, this is not the professor for you.  Most students sit in constant fear they will be called on.... which then follows in insults and guilt trips if you dare to answer incorrectly.  She calls at least two to three students stupid a week, her workload is overboard, and Ds and Fs on her quizes and tests are the norm.  Office hours are even worse because you have to talk to her one on one, but you pretty much have to go and pretend to want to really comprehend spanish.  The first 5 minutes of class that she is always late to in the morning was the best part of my day *CULPA censor*  Run as fast as you can.  Taking her class was easily the worst move I have ever made at Columbia.  \nWorkload:\ndepartment midterm and final - which will save your shitty grade, loads of daily busy work, weekly quizes and tests that most of the class fails.\n"
        },
        {
            "course_name": "Intermediate Spanish I/II (1201-1202)",
            "review_date": "May 22, 2003",
            "review_content": "\nPersonally, I loved Professor Aguilar. It's absolutely true that if you get on her bad side, the class if over for you. BUT, if you show that you're willing to put in the work to do well, there's not a friendlier teacher in the school. She holds office hours almost every day, and will help you with your conversation, your writing, and even your tests if you ask her. She has very little patience for people who do poorly and then say, \"I just don't get Spanish, I'm not good at it,\" so if you're the kind of person who's looking to coast, stay away. But if you want to learn the language, and are looking for a teacher who will make you do it, Professor Aguilar is the one. Overall, it's a matter of personal taste; if you get her to like you, it'll be a fantastic class for you.\nWorkload:\nModerate to heavy. She's primarily concerned with whether or not you're actually learning the language. Lots of compositions, lots of workbook exercises, and while she's a fairly harsh grader, you can easily get your grade raised by going to talk to her. Department midterm and final, both are killer, but she prepares the class as best she can.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "April 22, 2003",
            "review_content": "\nWatch out.  I thought I'd rise to the challenge and not let this woman get the best of me, but it's just not worth it.  I still regret it.  She's very opinionated and thinks so highly of herself that she doesn't care about making you look and feel incredibly stupid.  Run if you still can.    \n"
        },
        {
            "course_name": "20th Century Hispanic Literature",
            "review_date": "April 14, 2003",
            "review_content": "\nI think the other reviewers have done adequate justice to Aguilar's multiple personalities.  One thing I wanted to add for people considering taking this class is that while it is a good introduction to Latin American literature, you will learn nothing about Latin America itself.  Aguilar is a very traditional intellectual, and for that reason she is completely uninterested and even sometimes repulsed by discussion of politics and context in literature.  Still, she's a smart lady and it's interesting to see what the old school has to say.\nWorkload:\nnot bad at all, seeing as she doesn't even care if you turn in papers late.  I recommend reading the books in English (you can check them out from the library) if you want to get the reading done quickly.  You can always go back and read the Spanish.\n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "March 10, 2003",
            "review_content": "\nIf you are already in her class, don't switch out, take it as a challenge. If not, try to avoid her unless you really want to learn the Spanish language well. For those of us who just want to slide through the language requirement, she is a fiery angel of death. You will learn Spanish in her class or die trying. She has no compunction about destroying your GPA, and frankly she has every right to. Aside from all that, she is a wonderful person, a fantastic singer, and a woman of many interests. I think IÂ’d really like her if I didn't still have bad dreams about her exams.\nWorkload:\nWeekly quizzes where the class average is a D. Some papers graded more mercifully. Midterm and Final are departmental standards, which you will be far above if you pay attention to her.\n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "January 18, 2003",
            "review_content": "\nProf. Aguilar provided a very interesting spanish experience.  Generally, i would say that if you knew spanish already, she loved you, but if you had trouble and did not show that you were working hard to improve, she hated you and would make your life hell.  However, she made class a joy by occasionally singing for us - which was wonderful.  And she always showed a deep love for the language and latin american culture.  \nWorkload:\nNot much assigned homework, but very hard tests that were not curved at all for final grading, making her a very hard grader.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 03, 2002",
            "review_content": "\nLoud, rude, obnoxious --- but what a teacher!! Unlike many teachers, who stick to a syllabus, Sra. Aguilar is more concerned with you learning the material, so she'll conduct the class based on the speed the students are going at, and will teach and reteach concepts and quiz you on them until everyone does well. And she continuously says not to worry about the letter/numerical grades you get on the quizzes and tests, because she will give you your grade based on how well SHE thinks you're doing in class --which you can take at face value, I suppose, but it can also be a teacher's way of saying \"get on my bad side and pay the price.\" But I have to say, it was definitely more of a motivation to learn when I was worrying more about my progress in understanding the language than what was showing up on paper. Be prepared for her to scold you if you're not doing something right, though. And for her randomly to break out into Spanish song (which she likes to teach).\nWorkload:\nIt really seems like a lot -- and it is -- so prepare to be overwhelmed, at first, when she has you write a 1-2-pg (single spaced!!) essay, or assigns you a 5-10-pg short story over the first weekend. But if you stick with it, everything *will* become easier as the semester goes along.\n"
        },
        {
            "course_name": "Span 3200 - grammar and composition",
            "review_date": "December 03, 2002",
            "review_content": "\nA wonderful woman who is interested in the world around her. She brings diverse readings to class and challenges you to think and analyze them. An amazing knowlege of spanish (and english!) grammar and the history of the language, and can even explain why some of the more ridiculous grammar rules exist. It is true that she expects a high level of work, and has no patience if you continue making the same mistakes over and over again. The course is structured around whatever she feels the students need. Class will be a discussion of whatever topic seems interesting, and she will interrupt to explain grammar. There's a reading of some sort nearly every week and grammar sheets due most classes. She never collects the grammar, but goes over it in class. 5-6 writing assignments, 1-2 pages each, and 2-3 in class essays. Not a heavy load at all.\n"
        },
        {
            "course_name": "20th Century Latin American Literature",
            "review_date": "November 13, 2002",
            "review_content": "\nGreat Professor; very, very, smart; the best thing is that you actually learn in class; the readings are right and easy, although she always sees things we can't, but she doesn't expect you to know more than her.... Class participation is encouraged. I'm a Spanish major (senior) and she has been the best professor I've had in the department. Would highly recommend. No, she doesn't call students stupid...., she does criticize, but admits when her criticisms are just her point of view. A++++++++++++\nWorkload:\n6 essays.....extremely easy. I was worried but at the end surprised that i got A's\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "June 09, 2002",
            "review_content": "\nProfesora Aguilar's class was an experience -- to say the least. She has a very vast body knowledge with regards to Spanish grammar and Mexican culture. However, she has very little patience for \"jovenes estupidos\" (also known as my Intermediate Spanish section). Granted, we were NOT the brightest class, but I did feel that her grading was excessively harsh. C's and D's were hardly uncommon grades on tests and quizzes. I think the F Fairy also visited my class a few times. However, you WILL learn a lot. I can conjugate in my sleep now and my ability to speak has improved infinitely because of her. This class is very challenging, but there were some fun times, too. One-on-one, she is very kind, helpful, and funny; in the classroom, though, she is much more intimidating (but still somewhat funny). The professor has a beautiful voice and she sang to us on a few occasions. The projects in this class were more interesting than most, too. You will be put on the spot a few times and you may get called a few names, but I think it's worth it. If you are serious about improving your language skills (you learn stuff that improves your comprehension of ANY language), then this is the class for you. It's a true challenge. However, if you just want a fun, breezy Spanish class, then take it across the street. The 'Yard has kindler, gentler Spanish classes where you never have to open a book or use your brain.\nWorkload:\nNot too bad: a few VERY DIFFICULT tests and quizzes, a project or two, a midterm and a final\n"
        },
        {
            "course_name": "20th Century Hispanic Literature",
            "review_date": "April 28, 2002",
            "review_content": "\nHelene is great! If you participate in class (make sure you say smart things, as she's brilliant and has no qualms about correcting you) and work hard, she'll be on your side. I found her to be a lenient grader on essays because although she disagreed with many of the things I said, she respected the way I argued my ideas...how many professors will do that? She's SO SMART, has a dry sense of humor, and drops the names of random philosophers and thinkers that you probably haven't read left and right. If you make an effort she'll be supportive and respect you. A brilliant professor who loves the material she teaches and wants you to love it as well.\nWorkload:\nNot too bad...five essays of 5 pages each; midterm in-class essay, a lot of reading (but it's amazing stuff like Borges and Cortazar so don't worry).\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "April 25, 2002",
            "review_content": "\nDo you want to analyze Spanish poetry, or air your frustrated liberal tendencies? Aguilar's your professor! She prefers to teach culture over grammar, but she really teaches you grammar. She'll go over the grammar point a dozen times if she has to, but she'll also give you the guilt trip. So, do the work and learn a lot. But if you seek a class to slack off in, may Aguilar have mercy on your soul. Sometimes whimsical (though not a commedienne), randomly drops philosophers' names (\"like St. Thomas Aquinas says...\"). Her past Opera Singer life an added bonus.\nWorkload:\nMedium: lotsa worksheets, which take most of class to go over. A couple of presentations, \n"
        },
        {
            "course_name": "intermediate spanish",
            "review_date": "April 20, 2002",
            "review_content": "\nIf she does not like you-it's over for you! She is an ultimate bitch!!!!!! She is known to call students stupid in class she is also prone to making sensitive students cry in class. Her office hours are meaningless-she'll just tell you to ask another student (trust me they are all in the same position as you are in) !!!! She expects you to do her four hour homeworks and will ostracize you beyond belief if you don't understand something! I hated her class and I still hate her! I really hope that whoever reads this review listens to what I have to say because once you're in her class you are scarred for life!!! By the way she grades on how she feels about you-so if you want to be a dumbass and take her class, I suggest that you suck up tremendously. By now you all should realize that I do not recommend this woman's class. If you are looking for a good spanish professor, take Agueda P. Rayo or Flora Schimnovich. They always see to it that you understand and try their hardest to help you no matter how slow you are.\nWorkload:\na shitload!!!!!! you will have nightmares and they will take place in spanish!\n"
        },
        {
            "course_name": "W3200 Spanish Grammar and Composition",
            "review_date": "December 10, 2001",
            "review_content": "\nThis woman is SO funny...she is constantly making jokes that she finds hysterical, and although they are not usually funny at all, the students end up laughing anyways. She is really sweet, and she will sing for you in class as a special treat. Sra. Aguilar has a great voice and loves music, so you will probably have many \"music days.\" She is very serious about Spanish grammar so she will drill some rules into your head, and point out any error you make in an oral or on a worksheet. However, if you are nice to her and always wear a smile, you will do well. Her grading system seems to be based on how much she likes her class. You will definitely enjoy this one.\nWorkload:\nAlmost non-existent. My class had 2 quizzes, 2 orals, no mid-term, and a final take-home essay (1-3 pages). And as she says, \"you will do better than you think.\"\n"
        },
        {
            "course_name": "W3200 Spanish Grammar and Composition; W3332 20th Century Hispanic Literature",
            "review_date": "December 31, 1999",
            "review_content": "\nSharp and interesting, just watch out for the mean streak. Heavy workload, difficult tests and mandatory presentations. Non-Spanish majors may wonder why they have to spend so much time on her classes, especially the language ones. Has been known to tell students that they are \"stupid\" in class. Still, an extremely intelligent woman capable of giving sound advice even outside the realm of literature.\nWorkload:\nWeekly quizzes, Weekly compositions, 2 presentations, Midterm and Final exams.\n"
        }
    ]
}