{
    "prof_info": [
        {
            "prof_name": "Karl Kroeber",
            "prof_id": 79,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Religion, Literature, Modernity",
            "review_date": "January 13, 2009",
            "review_content": "\nEVERYONE should have Prof. Kroeber at some point (and especially this class)! This class expanded my mind and made me think in completely new ways, all delivered with Kroeber's profound views on human thinking. Besides bringing the class to think completely out of the box, I gained a lot of insight into the philosophy of theology, religion in the modern world, etc. \nEach class Kroeber gives a fascinating lecture and then opens up discussion, encouraging people to disagree and argue with him (runs like a seminar). That's what he wants from students in the course - for them to engage with the material, and that's what he looks for in papers. Reading is very light for an English course, and not all of it is necessary for assignments. Papers are short and mostly self-guided (he asks you to come up with a question about the text and discuss it). \nAt times he could be a bit disorganized, and the syllabus ended up being delayed a few classes. But the readings were wonderful and you really will gain a lot from the course. Make sure to go to office hours!\n\nWorkload:\n3 fairly short papers; moderate amount of reading. \n"
        },
        {
            "course_name": "How Imagination Grows",
            "review_date": "April 14, 2008",
            "review_content": "\nHaving read the previous reviews, I feel the need to let you, poor misguided student, know: this was the worst class I have ever taken at Columbia University. I am an English major. I am a reasonable human being. Take my word for it; I have no idea what these other reviewers are thinking.\nWorkload:\nLow, but painful. \n"
        },
        {
            "course_name": "How Imagination Grows",
            "review_date": "February 25, 2008",
            "review_content": "\nI wrote a particularly scathing review of Professor Kroeber earlier this semester, and I have to put it on record that my opinon of him has changed.  In my last review, I mentioned several exceedingly harsh comments that Kroeber wrote on one of my papers; I am happy to report that he apologized for them and basically took them back when I talked to him one on one.  He acknowledged my engagement with the texts and (unlike his comments) respectfully discussed with me my interpretations that he disagreed with.  I got great comments on my last two papers, and I have to say I've never valued any teacher's praise so much in my academic career - because I know it isn't given out gratuitously.  It's still a bit of a guess-what-his-interpretation-would-be-and-write-that game, but you get better at this as the semester goes on, and it may not be the worst thing in the world to adopt the same kind of interpretation that a man who has studied literature for about 65 years participates in.  His abstract and broad discussions during lectures are still a little hard to focus on and get anything otu of (not to mention stay awake during - bring coffee!), but when he goes around the class interrogating individual students about a specific text, class is quite enjoyable (especially if you have a comment that you can stand up for, against his critique - and in the rare case that you say something that he agrees with - feels like you won the lottery).  So basically, Kroeber may be really harsh on your impersonal papers, but if you sit down with him one on one he is more than reasonable and nice, while still sticking by his ideas about the works.  And best of all, grading is holistic - so as long as he thinks you grow into engaging with the texts during some point of the semester, I think you'll get a decent evaluation.      \n"
        },
        {
            "course_name": "How Imagination Grows",
            "review_date": "December 19, 2006",
            "review_content": "\nSo, I admit it.  Sometimes I had a hard time getting myself to this class.  It was early and Prof. K's lectures had a tendency to be dry and circular. HOWEVER, I by no means regret having taken this class, since Prof. K is one of the most inspirational people I have ever met.  The guy is pushing 80, but he is more youthful than some in their 20's.  He has lived a long and full life and is full of an infectious enthusiasm for the world in which we live.  I really appreciated his unabashed willingness to think outside the box and the fact that he encourages his students to do the same.  And the reading list is AWESOME!  The key to this class is to not follow what you think the instructions are - be creative.  And don't get put off when he tells you you're wrong to your face - suck it up and learn from your mistakes.\nWorkload:\nDaily response papers, final paper (\"as long as you need to make your point\"), reading that isn't necessary ever, but you'll probably want to do it - come on, it's Peter Rabbit!\n"
        },
        {
            "course_name": "Short Fiction",
            "review_date": "August 29, 2005",
            "review_content": "\nProf. Kroeber has to be one of the best professors I have taken at Columbia.  For those of you who are only willing to listen to idiotic rambling, courtesy of your fellow students, don't take this class, or any other class with Prof. Kroeber.  He is unlike many other Columbia professors who allow you to regurgitate their own words with praise.  He's unimpressed by jargon or students with inflated egos.   Prof. Kroeber will definitely make you think, especially before you speak. He's old school and he represents the finest at Columbia.  Even at his age he finds the time to grade his students papers with helpful commentary. If you believe that you're smart you'll realize that you are in good company.\nWorkload:\nAbout 10- 13 short books, two- 3-5 pg papers, and one- 5-7 pg final paper.\n"
        },
        {
            "course_name": "Short Fiction",
            "review_date": "May 18, 2005",
            "review_content": "\nTAKE A CLASS WITH KROEBER. I love this man and I hope he sticks around for a couple more years. He graduated from UC Berkeley in 1944, so he's getting up there. Nonetheless, he is completely lucid and enthusiastic. In a class with 70 students he read everyone's papers and wrote a paragraph at the end of each one. His approach to teaching is wonderful. He wants to learn from his students and encourages them to explore whatever they find interesting in the books. He believes in short papers and open paper topics. His lectures can sometimes be a bit boring but for the most part are engaging. He encouraged discussion, even though the class was big. He's totally approachable and you should absolutely go see him during office hours, just to talk to him. He's a character and should not be missed. Oh, and the books we read were great too. We read short novels (the longest was 200 pages)  and short stories by Tolstoy, Dostoevsky, Balzac, Kipling, Conrad, Achebe and more. The focus of the class was on imperialism and colonialism, so we read books from all over the world. The class was much more about politics, philosophy, and anthropology rather than straight literary analysis. \nWorkload:\n3 short papers (3 pages) and a final paper (5-7). People who did well on the first and second papers didn't have to write the third short paper and instead submitted a paper proposal for their final work.\n"
        },
        {
            "course_name": "Origins of Literary Imagining",
            "review_date": "April 18, 2004",
            "review_content": "\nGreat class. Where else do you get to read PullmanÂ’s The Golden Compass, Watership Down, Winnie the Pooh, etc. Kroeber is a gem- a totally unorthodox, interesting, and stimulating professor. If you have anything to say, you have to be ready to stand up for yourself. If you're bullshitting or not expressing yourself well, heÂ’ll pass over your comment. But he's never sadistic about it (maybe because he's such a big fan of calling on students on the spot, so if you really hate that be careful). That hasn't stopped some teachers I've had from ridiculing their students, but your only danger from Kroeber is a bruised ego. To whoever was shocked at the difficulty of having traditional conversations about children's literature... what class did you think you were taking? Origins explores the relationship of the author to the world he or she creates, and the limits placed on literary imagination, from in literature that's usually ignored or dismissed in academia. If you make any effort to go see him during office hours, he's extremely welcoming and helpful. If you're automatically scared of anyone over the age of sixty, this could also be a great experience to get you over your problem. ItÂ’s rare to see a teacher at least in their 70Â’s get heated up over the state of elementary education in the States, and say Â“hell!Â” at least once a class.\n\nWorkload:\nAround 8 1-2 page papers, 1 6 page paper, 1 15 page paper. He gives frustrating paper topics, but is delighted to let you write about whatever you want if you ask him first.\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "November 19, 2003",
            "review_content": "\nDo not take any course with Kroeber UNLESS YOU'RE WILLING TO THINK OUTSIDE THE BOX. For the person who write the terrible review for Origins of Literary Imagination (which I haven't taken but I have taken 2 other courses with Kroeber in the past), Kroeber does promote free thought as long as you are willing to think outside of the box. In fact, he forces you to think as much as possible. Perhaps he won't agree with you, but he has enough respect for (and interest in) his students to argue with them or grill them for ten minutes. Kroeber really likes to analyze literature from the standpoint of what your reactions to it says about you. He does do the more general analysis (and he always has great things to say, and I have to say that honestly, everytime I come out of class, I am completely inspired, having learned something or learned to see the novel from a different viewpoint) but he won't let anyone get away with BS answers (thank God--why can't they get teachers like that for the Core?) or responses that are not thought through.\nHis expectations of writing is also really different than probably any other professor. It takes a while to get use to this. He doesn't really care about organization or structure; he mainly just wants you to get your ideas out there and explore it FULLY and not oversimplify things (I don't think he'd doesn't even care if it's stream of consciousness--he told us to give \"free reign\" to ourselves for our final paper). I find that it takes a lot of thinking to write a good essay for him.\nOffice hours are a great time to talk to him. You can sit there for 40 minutes and talk to him about random things, but he's also extremely helpful on how you can improve your work. He is pretty critical, but in a good-natured and unself-righteous way. He's probably one of the only people where I don't get offended if he makes a lot of critical remarks. Many of my classmates have mentioned the same thing. However, he is still incredibly encouragin and caring and accommodating. Honestly, if you're ready to be challenged and to think a lot in a really different way, do not graduate unless you have taken a class with Kroeber. \nWorkload:\nUsually a weekly short paper and then a final long paper\n"
        },
        {
            "course_name": "Native American Literature",
            "review_date": "December 18, 2002",
            "review_content": "\nI cannot even begin to explain how privileged I feel to have both taken this course and learned under Prof. Kroeber.  He is, quite simply, everything a professor should be, and much, much more.  Beyond affable and humorous and unquestionably brilliant, Kroeber brings a creativity to teaching that I have never seen in another professor.  He teaches material to English majors in a way that I'm sure none of us have ever even pondered before, and by semester's end KK had completely changed the way I approach a text.  Yes, he does teach with the proddings that the other reviers have mentioned; he will know your name in a week and he will ask you every question that you hope he'll ask someone else.  But it will give you such a deep appreciation of the texts that you'll thank him by semester's end.  A professor unlike any other.\nWorkload:\nOne page paper every week.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 09, 2002",
            "review_content": "\nWhat a frightful experience it was to walk into my FIRST Columbia classroom experience and watch my classmates, one by one, get reduced to blabbering idiots about the finer nuances of \"The Iliad.\" However, it was also one of my most rewarding academic experiences at Columbia. Kroeber knows EVERYTHING about these texts. He's been teaching the class since before most of our parents were born, so he really knows his stuff. He has this really scary habit of putting students on the spot and grilling about anything in the text that he desires, but it is helpful, though. He forces you really to delve into these texts deeply. You learn how to think in a much more clear and effective manner. You learn how to write intelligently on those little nuances that at first seemed so scary. He's absolutely the best Lit Hum teacher on this campus and you'll be lucky to have him. These skills will benefit you for years to come. And yes, he does look a lot like a geriatric Steve Buscemi. \nWorkload:\nThere are quite a few writing assignments and he is a very hard grader, but you'll definitely do better than you expect.\n"
        },
        {
            "course_name": "Origins of Literary Imagining",
            "review_date": "April 28, 2002",
            "review_content": "\nLast semester, everyone wanted to take this course. There were hundreds of applicants, so I was told, and I was one of the lucky few who would get to study childrens lit with the inimitable Professor Kroeber. THIS CLASS WAS THE WORST CLASS I HAVE EVER TAKEN AT COLUMBIA, HANDS DOWN!!! I say this for two reasons: First, Professor Kroeber actually seems to think that you can learn something fundamental about the \"imagination\" from reading childrens' literature, and that this something can then be applied to all imagination, resulting in greater knowledge of humanity for all eternity. He does not bother to define what the imagination is, or why anyone would be interested in studying it, let alone if it is even possible (it's not). He seems to work from some romantic notion of the imagination more suited to the nineteenth century than the twenty-first, although he never makes this clear. Second, what he also fails to make clear are the objectives of the course or the assignments. Writing essays or talking in class is invariably frustrating as Kroeber's reductive interrogations (But why do you think that? But why do you think THAT? But why is that Good?) fool only the most simple-minded, dim-witted students (who seem to follow him from class to class like brain-damaged apostles--another reason to avoid a seminar with Kroeber) into thinking that this man promotes any form of free-thought and intellectual development. In conducting this class, Professor Kroeber managed to squeeze both the fun and intellectual engagement out of rich texts such as Kipling's Kim, Tolkein's The Hobbit, Milne's Winnie the Pooh, and many many others. Granted, the reading list is awesome. So read it on your own, and as far away from Kroeber as possible. I cannot make it clear enough that taking this class will be a mistake. Don't do it. \nWorkload:\nA few short, mindless papers that Kroeber berates for being true to form, and a 10-15 page paper on Harry Potter and The Sorcerer's Stone and The Golden Compass. These books are great, but the paper urges students to draw on all they've learned during the semester about \"imaginings.\" Having taught nothing all semester, Kroeber's assignment amounts to a open-ended paper which cannot possibly hope to satisfy whatever bizzare qualifications Professor Kroeber might think appropriate. I am writing it now. It's hell. Don't take this class.\n"
        },
        {
            "course_name": "Native American Literature",
            "review_date": "April 16, 2002",
            "review_content": "\nThis stuff is his passion and he lets it become yours. The readings are usually short passages transcribed from the oral tradition of Native American cultures from around the \"United States\". He explains cultural context behind the stories, but his focus is on reader response. Every week, a 1 page open ended response to the reading is due, but as long as you keep up missing one will not effect your grade. The class is basically about interpreting the multi-layered and rich stories and making sense of how the lessons contained within can effect your own life. For people bored of the \"Western Tradition\" who want to be exposed to a completely differnet cultural experience, take this class!!!! Kroeber is a wonderful teacher, whose first priority is the exchange of ideas. Class participation is the basis of this class and he really makes an effort to get to know each and every student. He actually cares about your opinion. To the reviewer who left Kroebers office with a feeling of being humbled: ask yourself, did you walk in with an open mind? \nWorkload:\nweekly 1 page responses to the reading, 3 to 4 page final paper\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "January 14, 2002",
            "review_content": "\nI just can't say enough about Prof. Kroeber. He's everything you'd ever want in a professor x 10! His lectures are actually discussions in which he encourages you to think for yourself. And as long as you can back up your opinion, you're good-to-go. He makes sure that EVERYONE speaks up in every single class, but believe me, you'll definitely want to participate anyway. If you're looking for a professor that does what he does because he's genuinely interested in motivating students, then you've found your guy. An absolutely wonderful professor!\nWorkload:\nThe first half of class is devoted to poetry - Prof. Kroeber goes very slow and really focuses on each and every poem. Second half covers I think about 3-4 books, which means a lot more reading, but he makes the class so interesting that you actually want to read the books in order to speak up in class. Workload: a 1pg. response paper due for each class, which was intended more to get you thinking about the material than about handing out grades; last three response papers counted as a final. Very good grader -just do the reading, participate in class, and enjoy!\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "January 14, 2002",
            "review_content": "\nI just can't say enough about Prof. Kroeber. He's everything you'd ever want in a professor x 10! His lectures are actually discussions in which he encourages you to think for yourself. And as long as you can back up your opinion, you're good-to-go. He makes sure that EVERYONE speaks up in every single class, but believe me, you'll definitely want to participate anyway. If you're looking for a professor that does what he does because he's genuinely interested in motivating students, then you've found your guy. An absolutely wonderful professor!\nWorkload:\nThe first half of class is devoted to poetry - Prof. Kroeber goes very slow and really focuses on each and every poem. Second half covers I think about 3-4 books, which means a lot more reading, but he makes the class so interesting that you actually want to read the books in order to speak up in class. Workload: a 1pg. response paper due for each class, which was intended more to get you thinking about the material than about handing out grades; last three response papers counted as a final. Very good grader -just do the reading, participate in class, and enjoy!\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "January 14, 2002",
            "review_content": "\nI just can't say enough about Prof. Kroeber. He's everything you'd ever want in a professor x 10! His lectures are actually discussions in which he encourages you to think for yourself. And as long as you can back up your opinion, you're good-to-go. He makes sure that EVERYONE speaks up in every single class, but believe me, you'll definitely want to participate anyway. If you're looking for a professor that does what he does because he's genuinely interested in motivating students, then you've found your guy. An absolutely wonderful professor!\nWorkload:\nThe first half of class is devoted to poetry - Prof. Kroeber goes very slow and really focuses on each and every poem. Second half covers I think about 3-4 books, which means a lot more reading, but he makes the class so interesting that you actually want to read the books in order to speak up in class. Workload: a 1pg. response paper due for each class, which was intended more to get you thinking about the material than about handing out grades; last three response papers counted as a final. Very good grader -just do the reading, participate in class, and enjoy!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 31, 1999",
            "review_content": "\nLit Hum with Kroeber is everything I ever hoped a Core class would be. The discussions were constantly thought-provoking and interesting. His Lit Humsection remains one of the best classes I have taken to date. \nWorkload:\n2 longish papers, a few in-class responses, midterm, final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 31, 1999",
            "review_content": "\nLit Hum with Kroeber is everything I ever hoped a Core class would be. The discussions were constantly thought-provoking and interesting. His Lit Humsection remains one of the best classes I have taken to date. \nWorkload:\n2 longish papers, a few in-class responses, midterm, final. \n"
        }
    ]
}