{
    "prof_info": [
        {
            "prof_name": "Peter Woit",
            "prof_id": 3581,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Calc I &II;",
            "review_date": "January 22, 2011",
            "review_content": "\nAs a first time Columbia student, Professor Woit was my introduction to Calculus at Columbia;  unfortunately, it was a bad experience.  The median grade for the first test was barely above passing, and the second test saw more than half the class failing his exams.  His midterms aren't timed well, and you find yourself struggling to simply finish all the problems, let alone have enough time to go back and check your work.  His stutter is detrimental to the learning experience as is his poor handwriting and overly-complicated homework problems.  All in all, I would recommend staying as far away from Peter Woit as possible, as you will suffer the same fate as many of my classmates and end up failing or coming damn close.\nWorkload:\nNot too unbearable, two midterms which aren't timed well, webassign problems which will take a painful amount of time to complete, and a tough final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 29, 2010",
            "review_content": "\nI found Woit's lectures pretty unbearable, sometimes actually a detriment to my learning. Everything mentioned in previous reviews- distracting stutter, dry approach, and chicken scratch chalkboard tactics- held true. The class material is pretty straightforward, though, so the class isn't impossible to get through- about halfway through the term I decided that the textbook was a better teacher and my grades improved accordingly. I survived, but I would recommend taking the class from a more highly reviewed professor, if possible.\nWorkload:\nWeekly webassign problem sets, sometimes with additional handwritten problems (20%), 2 midterm exams (20% each), and one final (40%). The average on the exams was something like 50%- demoralizing.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 13, 2009",
            "review_content": "\nCalc II can be a pain but with Prof Woit it was less of a hassle than it had to be. He's American (which is always a plus in the math department) and explains the material quite well in class, giving examples and \"tricks\" which help us do the problems..although I really did not absorb how to do the problems until I had to conquer his problem sets.  Although he stutters a bit, it does not detract from his teaching.  He is very helpful during office hours too.\nThe downside is his problem sets are 10x harder than they need to be and surprisingly take hours for a seemingly innocuous 10-15 problems.  I would recommend doing the webwork problems before the problem sets because even though they are due later, they are much easier and the computer tells you if you have a problem wrong so you can go fix it.  Try to do all the webwork problem sets fully because that is an easy 100 grade that is not reliant on the TAs grading habits or random difficult problems.  Then for the hand-in homework, go to Math Help...but do not despair.  It is only 10% of your grade and the rest of the class and even some of the TAs in math help WILL struggle with the homework too (especially the last few problems).  However, once you have mastered the tricky problem sets well, the midterms look ridiculously easy and very basic.  Also, do look at the book once in awhile because it does help although it's not necessary.\nWorkload:\nhard weekly graded problem sets worth 10% of your  grade, weekly webwork problems worth 10%, two midterms worth 20% and a final worth 40% all fair and curved generously\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 08, 2009",
            "review_content": "\nHe goes over the theory during class and also addresses some examples that are always helpful while doing the assignments. The pace of the class is fair. He always asks which problems from the assignments the students have trouble with and goes over them in class, making sure you understand the material. Professor Woit is very nice and very approachable. Some of his assignments have really tough problems, but the exams (midterms and final) are fair and straightforward. In my opinion, Proffesor Woit is an excellent choice for Calculus II.\nWorkload:\nTwo problem sets per week (around 20 problems in total) which count 10% each, two midterms (20% each) and a final (40%)\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 22, 2008",
            "review_content": "\nDon't choose Professor Woit. Ever. He stutters every word and is difficult to understand and follow in lecture. He also isn't very thorough in his explanations of the material.\nWorkload:\n1 written assignment and 1 webwork assignment each week\n"
        }
    ]
}