{
    "prof_info": [
        {
            "prof_name": "Jisuk Park",
            "prof_id": 2212,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Second Year Japanese 1",
            "review_date": "November 10, 2014",
            "review_content": "\n朴先生大好き！\nSeriously Park-sensei is the best. She's super laid back, is very intent on explaining the material to you, grades very fair, and makes sure that you know what you need to. If you have a choice, choose her.\nWorkload:\nDaily Quiz, usually 30min or less of HW a night, except for weekends when kanji is assigned. 4 exams, 1 midterm, and 1 final. 2 oral examinations per semester.\n"
        },
        {
            "course_name": "First Year Japanese II",
            "review_date": "June 12, 2014",
            "review_content": "\nPark-Sensei is an amazing teacher to start off Japanese with. She is always precisely on time and finished at or before the end of class. Her lectures are clear and interesting, she is very good at explaining difficult pieces of grammar and her slides are not only useful during class, but an excellent study tool. Her grading is fair, even lenient (my transcript said more than half the class had A-level grades as there is no curve) and her office is always open. Quizzes and tests are very straightforward and always have the exact same format (tests add reading and Kanji as you learn more skills): quizzes are vocabulary Japanese to English and English to Japanese and Kanji when you begin to learn it, and you always know exactly which words/kanji will be on the quiz. She gives out a format before each test that is effectively a shortened version of the test with answers, so you'll never be blindsided. If you forget your homework you can bring it into the office by the end of the day which was useful several times in the semester. Best of all, her attitude is extremely enthusiastic and you can tell she really cares about her students and how well they learn. At the end of each semester we had a class lunch and took a break from learning. I would definitely recommend Park-sensei's class to anyone interested in Japanese. You will work, but you will learn a lot of Japanese and do well in the class if you put in as much as Sensei does.\nWorkload:\nStandard for the department, homework each night and a quiz each day, 3 tests, a midterm a final and a project and 2 hours a night of studying is required. Japanese is never a cakewalk.\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 25, 2011",
            "review_content": "\nPark-sensei is the best! She is so nice and approachable for a beginner in Japanese. The course is taught mainly in powerpoint presentations. At times, the slides could be a bit too fast-paced. Other than that, a vocab quiz every day and a test ~2 weeks is more than doable. The amount of work that you do in each class prepares you for exams better than you think. As long as you keep up with the work, there is no reason why you would not get an A.\nWorkload:\nTypical language course workload. Daily vocab quiz, tests (worth 5% each), midterm (15%), final, blog project. I really did not spend 2 hrs each night studying for the class. Homework every night.\n"
        },
        {
            "course_name": "Second Year Japanese 1",
            "review_date": "March 23, 2009",
            "review_content": "\nPark-sensei is the best. I had Nittono-sensei for my first year, so I was shocked at how laid-back Park-sensei was. She tells us what's going to be on our daily quizzes,so we don't have to study every single thing we've been learning! (Shocking, I know.) So, pretty much like every other Japanese class, you have a quiz every day, and you learn material incredibly quickly - as in, one day you learn it practice it, and that's all you get, except the nightly mountain of homework. \nBut the great thing about Park-sensei is that she really cares about her students, and makes sure to meet with us outside of class, and forgive us if we forget our assignments, and generally just act like a nice person. She's also really quirky - sometimes she practices her flamenco routines while we're taking our quizzes, and she tells us great little anecdotes about her life. We're learning a lot, but going to Park-sensei's class really just feels like having a mellow study party four times a week. \nWorkload:\nThe typical Japanese 2 hours per night, with 5 or so tests a semester and a quiz and homework every day. \n"
        },
        {
            "course_name": "Elementary Japanese A",
            "review_date": "December 13, 2008",
            "review_content": "\nPark Sensei is a good teacher. She cares about her students and is really approachable. Although she teaches off the slides, but it is actually helpful that she tries to make students remember as much as possible in class, rather than spend extra time outside of classroom. She will ask students to practise as much as possible in class. Sometimes the style maybe a little repetitive and dry but I think it helps a lot especially for people who don't want to spend a lot of time after class to study. \nWorkload:\nStandard Japanese language workload. Quizzes every class. Language Lab and Homeworks each lesson.1 composition presentation. 2 exams and a final. \n"
        },
        {
            "course_name": "Elementary Japanese A",
            "review_date": "March 04, 2008",
            "review_content": "\nshe is a fine teacher not worse or better than others. I haven't felt like she was annoying or anything. \nWorkload:\nlots of homework for 2.5 credit class\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "April 17, 2005",
            "review_content": "\nPark sensee is a fine teacher, but I didn't like her for some reason. I hated how she taught off of slides, and she told everyone not to take notes in class, because the grammar notes explained everything. However, the department-made grammar notes and textbook were not descriptive enough (though I heard a rumor they are re-writting them soon). The second part of the year I was with Okamoto sensee, and I like her much much better (she's much more relaxed and happy). If you need to write things down to remeber them, try not to be in Park sensee's class. Park sensee is also pretty young compared to the other teachers, and seemed a little less comfortable in the role of teaching.\nWorkload:\nJust like  every other Japanese class\n"
        },
        {
            "course_name": "Second Year Japanese 1",
            "review_date": "November 15, 2004",
            "review_content": "\nPark-sensei is a pretty good professor. She's really adorable and funny and she gives a lot of cute anecdotes about the cultural differences between Japan and America. Her lecture style is a bit dry and repetitive, and she teaches off of slides instead of writing on the board so grammar nuances can go by a little too quickly. You will spend ridiculous amounts of time learning grammar but not so much with vocab and basically no practice for the killer translations on the exams so beware. Other than that, she tries to get you to learn Japanese in the most straightforward way possible and is a very efficient instructor.\nWorkload:\nAverage Japanese workload -- lots of homework, quizzes daily, exams every couple weeks, midterm, final.\n"
        }
    ]
}