{
    "prof_info": [
        {
            "prof_name": "Evan Cornog",
            "prof_id": 540,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Politics and the Press in America",
            "review_date": "June 12, 2008",
            "review_content": "\nGreat class, great professor! I really enjoyed this class. We usually spent the first hour of the class talking about contemporary politics (which, during the Spring of 2008, featured Spitzer and Obama/Clinton/McCain!) and the 2nd hours talking about the readings, which were about a book a week (though you could get away with doing very little of the reading). Evan is great-he's very knowledgable, very funny, knows politics very well (he was press secretary for Ed Koch, NYC mayor in the 1980s). The work load was fine: 2 3-page papers, 1 20-page research paper. We also had very interesting discussions on the role of the media in influencing and shaping politics. I highly recommend this class to anyone interested in the intersection of the media and politics (which we all should be).\nWorkload:\nA book a week (can get away with reading very little); 2 3-page papers; 1 20-page research paper.\n"
        },
        {
            "course_name": "Revolutionary War Seminar",
            "review_date": "August 23, 2006",
            "review_content": "\nHighlight of my experience in the History Dept.  Cornog knows the material inside and out, and stays current on contemporary historiographical issues.  His method is explicit.  Never a dull moment in discussions.  You must participate, but the readings will prepare you to do just that.  Not much focus on the War per se.  Deals with America in a post-war (French-Indian) moment, instead of the more tempting pre-war narrative.  A must for any student of American History.\nLast two classes were a mock debate in which the class was divided along Federalist/Anti-Federalist lines after reading Notes on the Constitutional Convention.  Really your moment to shine, but no pressure.  \nCornog was also Koch's press sect'y, as well as an editor at The New Yorker, and is now a dean at the J school.  Good to be on his radar........\nWorkload:\nTwo 2-3 page responses to readings, one 15-20 page paper on Rev War's changing situation in Amer Hist canon.  Fair/lenient grader.  Totally manageable\n"
        }
    ]
}