{
    "prof_info": [
        {
            "prof_name": "Kaira Cabanas",
            "prof_id": 3932,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 13, 2009",
            "review_content": "\n\nKaira is a smart woman. She's young and energetic and WANTS you to learn! She's passionate about art and that is obvious by how she teaches.  Her method is all-inclusive. She wants the class to participate and ask questions so she passes a pointer around thus involving all her students in the discussions.  She keeps the class light and interesting by talking about her experiences working with up and coming artists and her travels.  She is an art buff and it's apparent she thrives in an environment where her students actively engage in the subject and demonstrate an actual INTEREST in it.  Even if you're not an art history major, Kaira invests a lot of herself in helping you develop an appreciation for art.\nThat said, be forewarned: when discussing art with an ARTIST, you better know your stuff!  She has a critical eye for detail and expects the same of her students.  She's big on adjectives and the more you use them the happier she gets.  When describing a work of art, describe it like you're talking to a blind person (sounds easier than it actually is.)  She wants to know art has somehow MOVED you. So it's important for you to recall names, dates, and mediums for the works you will study.  Dates are VERY important to her and you WILL be penalized if you don't get them correct so memorize, memorize, memorize!\nAlso, pay attention to the assigned readings (all on Courseworks.) The readings tie into her lectures and are the focus of the class discussions.\nShe's very approachable and accommodating so don't be afraid to speak up if you need to.  She's there for you and WILL reach out to you if she senses a problem.  \nOverall, the class was terrific and I totally loved it.  It would have been much better had it not been for a couple of talking bobble-heads in class who did not know when to keep their mouths shut!  Other than that, it was great!\nWorkload:\n2 - 3 readings per week, 2 write-ups on 2 museum visits (2 - 3 pgs each), 1 midterm, 1 final, final paper (no longer than 4 pgs)\n"
        }
    ]
}