{
    "prof_info": [
        {
            "prof_name": "Wolfram Schlenker",
            "prof_id": 8212,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Economics of the Environment",
            "review_date": "January 08, 2010",
            "review_content": "\nProf Schlenker is one of the most relaxed and enthusiastic professors I have come across. His class suffered from being scheduled at 9am, so attendance was at about 50%. But even at 9am, this man was energetic, and his material was actually really insightful. You'd think going in, that Wolfram is going to be a crazy environmentalist hippie, but he's as skeptical and reasoned as any good economics professor should be; very good at proposing and explaining theories and very conservative with making conclusive statements. The class is quite mathematical, building on concepts in micro with a bit of stat/econometrics at the end. If you are great at solving micro-type problems this class will suit you. Many people did not fit this mold and so pass/failed it after the midterm, which was excellent for the curve. Wolfram keeps the class rigorously in economic analysis, and always explains concepts using examples and often real world data.\nThe class includes concepts on resource pricing when resources are public and private (with consumer surplus calculations), dead weight loss when production has externalities, societal benefit/loss of different types of intervention on polluting industries, statistical analysis on environmental data (like how much air pollution affects house prices for example). I recommend this class not only for anyone wanting to enter environmental economics/policy, but also to people extraneously interested in any of the above, the optimal resource pricing, cost/benefit analysis of intervention and ways to analyze statistical data is broadly applicable. \nClass is curved to a B/B+, problem sets (20%) count only if you do better on them than midterm+final. Midterm(25%) was tougher than final(55%), and in general problem sets are marginally easier than midterm/final, but valuable preparation for the midterm/final. I stopped doing p-sets after the midterm, but I did them all as final preparation. If there was a text-book, I didn't need it. \nWorkload:\nAfter going to class, problem sets (once every 2 weeks, 6 in total) take about 3-6 hours each. Without going to class they'll probably take longer.\n"
        }
    ]
}