{
    "prof_info": [
        {
            "prof_name": "Judith Gibber",
            "prof_id": 733,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "General Physiology",
            "review_date": "February 09, 2004",
            "review_content": "\nProfessor Gibber is probably the best professor I've had at Columbia so far.  Does she go off on tangents? Yes, but they are really interesting and usually apply the material she's going over (so it helps to demonstrate her point).  She is disorganized sometimes, but it doesn't detract from the class at all because she knows what she is talking about otherwise...I guess it could detract from the class if you're pretentious or one of those students the rest of us find annoying, but for the rest of us they provide nice breaks in writing.  Also, the only reason she is disorganized is because everyone and their mother asks her for a recommendation, in addition to all the stuff she does for the bio department.  I would definitely consider her inspiring and her class is not that bad (as in hard) at all and I would consider myself a huge slacker (I crammed for every test).  She always answers questions and is willing to discuss anything with anybody thoroughly.  Her lectures are so easy to follow and she makes the material seem really easy and almost intuitive.  This class is great.\nWorkload:\nReadings are unnecessary but help (I did the readings in the beginning and then stopped and it made no difference in my grade).  The mini-exam system is definitely less stressful than fewer but longer midterms, but you definitely need to write down every detail.  Another word of advice: go to every class, because the readings don't even begin to cover what she goes over in class.  Besides studying there was almost no out of class work, besides the writing assignments which are really easy.\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "January 13, 2004",
            "review_content": "\nDr. Gibber is a fantastic prof, one of the best in the bio department. I disagree with the negative comments about her lectures, she does go on tangents at times, but her powerpoint lectures are always well organized and clear and are posted on the web after class, and all the material on her exams comes from the lectures. It's an advantage to do the optional reading before class, but not necessary. Gibber's great about answering questions, if she doesn't know herself she'll look it up and then respond. She's also very open about office hours, she doesn't post them but if you stop by her office and she's there she's usually available to talk. Definitely recommend this class to others!\nWorkload:\n5 mini-exams (about 30 minutes long, covered 4-5 lectures of material), 4 short writing assignments and one longer one, and final exam. 5 mini-exams might seem annoying but it's much less stressful than the 2 or 3 bigger exams from intro bio and you get to drop your lowest mini-exam. Also it does force you to study  the material more often. Writing assignments have to do with evaluating research papers, no big deal, a grade booster.\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "January 07, 2004",
            "review_content": "\nThis is a good class if you liked the second semester of C2006. It's the same layout of lectures and problem sets. However, for some reason this semester Dr. Gibber was extremely disorganized for the lectures so a lot of time was spent waiting for her to remember what to say on each slide. \nThe grading on the five miniexams was retarded to say the least. You get five points taken off if you do not describe a term in detail that most would consider very basic.  A word of advice on the exams: to avoid arbitrary points being taken off everywhere, explain everything that has to do with the subject she's asking about. Don't limit yourself to a coherent and inductive explanation. Go into every minute detail of every process or points will be taken off inexplicably. \nOverall I really liked the content of this class, as all premeds do, but the administrative aspect of this course was awful.  Dr. Gibber is funny, but her jokes lose their charm through the semester as your exams are handed back three weeks after you take them.\nWorkload:\nNot so bad. Five mini-exams (which are like 1-2 pages of a C2006 test), five writing assignments (which are basically busy work but count for more than you think), and a cumulative final. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology II",
            "review_date": "December 16, 2003",
            "review_content": "\nIn my opinion, Dr. Gibber is an odd lady.  She always sounds like she has a cold and lectures rather quickly.  She is quite disorganized.  Visit her office sometime and see what a mess it is--papers everywhere.  She only taught a section of Bio using her famous Powerpoint slides.  My advice to the Pre-Meds who are in Bio with Gibber is to go over the slides and to USE THE BOOK to uncover the tiny details portrayed in a vague manner on her slides--as these details will be on the Test.  She is big on application questions and a student must get use to her method of testing--if you know the answer, be as specific as possible in your response.  If you dont know it, then spit out some vague memorized phrase telling the reason for your answer and youll get some partial credit.  Take Physiology if you want a great prep for the MCAT and are willing to deal with the frequent cramming for the 5 mini-exams.  And I do have to say, I found it tough to be a male in her class--3 Asian girls for TAs in Physio and the study of the male reproductive system was interesting...\nWorkload:\nFor Bio, Prob Sets which you must do with a small group of people talking thru them, 3 Midterms and Final\nFor Physiology, 5 Mini-exams which are 30 min tests after half of a lecture, 5 writing assignments based on medical research, and a very Cumulative FINAL--lots of hours spent on that\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "July 08, 2003",
            "review_content": "\nIf you like the feeling of being a slave and listening to endless her doctrines go take this class( though if you have a choice do not ruin your whole semester) she is awefully bossy over class.  Help!\nWorkload:\ntons, material is interesting but with her requirements in each assignment you'd wish you never took this class ever!\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "January 01, 2003",
            "review_content": "\nI took both C2006 and Physiology with Dr. Gibber, and to sum it up in a few words the experience was extremely informative, exciting and incomparable. You will not only learn about how the systems of the body work individually and in conjunction with one another, but Dr. Gibber constantly applies these new concepts to current relevant research techniques and published articles. Her exams are about 30% straightforward questions, and 70% thought questions, which can be fairly difficult but as long as you are able to write down something about the fundamental concepts pertaining to the question, there is a good chance of receiving generous partial credit.  Her lectures are all powerpoint, which are really helpful to study from, and she is extremely helpful in delineating concepts via email. If you are interested in how your body works, take this class. If you are a Bio major and interested in how your body works and learning how to read and critique research studies, take this class. If you are looking for an easy A, this is not the class for you, but take it anyway, it'll make you a better person in the long run. \nWorkload:\n5 mini-exams, 1 is dropped. 5 homework assignments, moderate difficulty level, with the last assignment being a 3pg. paper critiquing a research article. Final exam- fairly difficult. Total workload- not as much as C2006, but substantial. \n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "January 29, 2002",
            "review_content": "\nIf you like disorganization, having classes cancelled and rescheduled for inconvenient times, not getting any of your work returned for weeks on end and a Professor who is completely not interested in helping you ie. personal attention, by all means take this class.\nWorkload:\nOK\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology II",
            "review_date": "November 07, 2001",
            "review_content": "\nDr. Gibber is a great teacher. Her lectures are informative and interesting. She uses excellent Power Point slides (some animated!) to help explain the material in a clear and concise fashion. Be warned, though, she speaks rather quickly. She's a very friendly person, and will answer your emails within hours, up to and including 3 AM.\nWorkload:\n3 exams, 1 final, optional problem sets (DO THEM), and a hour recitation (with quizzes). The exams are difficult because they make sure that you not only know the material, but that you know how to apply it. If you go to class and recitation and do the problem sets, you should do well.\n"
        }
    ]
}