{
    "prof_info": [
        {
            "prof_name": "Maude Meisel",
            "prof_id": 11793,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 08, 2016",
            "review_content": "\nThe other reviews were solid but let me break it down for you. Maude is a boss. No other words. She probably loves her class more than her own family which makes it impossible not to care about the readings and workload. That being said, the workload was ridiculously standard and Maude was soooo understanding about any issue. I swear Maude Meisel might be God because she taught us that God created the world in 7 days and Maude blew my mind in 7 minutes. Obviously I probably over did this post but really take Maude's class..it'll give you an unbelievably chill and fun freshman year. \nWorkload:\nThe last post said it. 2 five page papers, discussion post before class, midterm (can be dropped), final, and being able to handle all that is MAUDE!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 21, 2016",
            "review_content": "\nProfessor Meisel is truly one of the best professors I have ever had. She is fun, thoughtful, and incredibly knowledgeable. As long as you keep up with the the readings, do the discussion posts, take good notes, and don't fool around in class, you are bound to do well in her class-- she is one of those professors who wants you to learn and do well. Thanks to her, I have become a better writer/reader and have a newfound appreciation for classic novels. She is also super helpful in office hours. All in all, Professor Meisel made LitHum an amazing experience! \nWorkload:\nNormal LitHum workload- 2 discussion posts (150-200 words each), 2 essays per sem, and in-class midterm and final (she lets you drop the midterm grade if you do better on the final or she averaged the grade out if you did better on the midterm).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 21, 2016",
            "review_content": "\nProfessor Meisel is truly one of the best professors I have ever had. She is fun, thoughtful, and incredibly knowledgeable. As long as you keep up with the the readings, do the discussion posts, take good notes, and don't fool around in class, you are bound to do well in her class-- she is one of those professors who wants you to learn and do well. Thanks to her, I have become a better writer/reader and have a newfound appreciation for classic novels. She is also super helpful in office hours. All in all, Professor Meisel made LitHum an amazing experience! \nWorkload:\nNormal LitHum workload- 2 discussion posts (150-200 words each), 2 essays per sem, and in-class midterm and final (she lets you drop the midterm grade if you do better on the final or she averaged the grade out if you did better on the midterm).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 14, 2014",
            "review_content": "\nProfessor Meisel is great. She is so laid-back about readings and the class, but also does a good job at explaining the readings. I had her this past fall semester, and although class discussions weren't really as intense as some other sections, we get the information. Really easy grader, and almost unbelievably understanding. I went to office hours a few times this semester and she was always ready to help. Since she commutes from another university to Columbia, she's not on campus most of the time. However, she is more than willing to skype with students or to call them - really, if you want to get a hold of her, it's not a challenge. I wish that I could have her for the spring semester (as she majored in Russian lit)!\nWorkload:\nlight. courseworks postings of 150 words every class, can skip 3. 2 4-5 page essays. she had a great system where she wouldn't count the midterm if we did better on the final (and if we did worse on the final, she would average the midterm and final scores together). Made the midterm season so much less stressful! \n"
        }
    ]
}