{
    "prof_info": [
        {
            "prof_name": "Dragomir Radev",
            "prof_id": 4226,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Artificial Intelligence",
            "review_date": "December 24, 2014",
            "review_content": "\nRadev's a jovial guy and a decent teacher. However, I didn't learn much in this class since Radev focused a lot on useless topics. We literally spent 60% of the class studying logic of some sort. I would rather have learned more about search algorithms and machine learning. Radev coached the International Linguistics Olympiad team so he's a big fan of linguistics and it shows in his teaching. He spent a lot of time talking about gramamars and outlining NLP at a highly impractical level which I really hated. I think you can learn more about AI by taking a MOOC online from Coursera or Udacity.\nThere are 4 programming projects which are all very time consuming. He gives you 2 weeks for each and they take at least 6-8 hrs. There's no upper limit since you can improve the assignments as much as you want in an effort to get the very generous extra credit (up to 20 points on a 100 point assignment that counts for 20% of your grade). Only 2 of the projects had anything to do with AI. The first one was to be coded in LISP which has the dumbest syntax ever - it's like a poor man's Haskell with a lot of parenthesis.\nAll in all, can't recommend taking this class since it doesn't really cover much. Radev's a nice guy and probably the best teacher for AI you're going to find but the class itself is pointless.\nTests are ok. If you read all the slides you should be fine. If you understand all the algorithms and definitions, you'll do great - there aren't any questions that require a lot of thinking and being clever. He just test how well you know the material. Be warned that some of the slides kind of stink in which case you might want to refer the textbook. Don't waste time reading the entire textbook like he asks you to - it's just a scape goat for him to ask you anything he wants and for you to not complain that it wasn't covered.\nGrading was decently generous. He added points on the midterm and final since the average wasn't as high as he wanted.\nWorkload:\n4 projects - 20% each\n1 midterm - 15%\n1 final - 20%\nclass participation - 5% (totally arbitrary)\n"
        },
        {
            "course_name": "Topics in Computer Science: Search Engine Technology",
            "review_date": "January 05, 2014",
            "review_content": "\nThis is a fun and informative course worthy of your time if you are interested in information retrieval/NLP/machine learning/network analysis. Professor Radev was very knowledgeable and approachable.  The course materials were not hard and the workload not heavy compared to other graduate level courses. But, do go over the materials THOROUGHLY before the final. The final problems were not difficult in nature, but some of them were either hit or miss, namely, if you failed to recall the formula or evaluation method, you would probably have no choice but leave it blank. The slides were not terribly helpful for reviewing the course materials and could have been more organized. But the textbook is like THE book on Information Retrieval and is of very good quality, so read it.  \nWorkload:\n3 programming assignments(30%). The first one was building a document retrieval system, which was the most time consuming of the three. The second one is sentiment analysis for movie reviews, which was a competition on Kaggle. Your rank on Kaggle would count towards the grade, but don't worry if your rank is not very satisfactory, as the impact it has on the grade is very small. The third one was actually not a programming assignment, and it was the easiest and lightest of the three.\n1 final project(30%), can be in the form of a research paper or a software system. \nFinal(30%), like I said above, please do spend time reviewing the materials thoroughly, especially pay attention to ALL those formulas and matrix computations, and make sure you understand how they work.\n"
        }
    ]
}