{
    "prof_info": [
        {
            "prof_name": "Jason Earle",
            "prof_id": 1879,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French II",
            "review_date": "January 02, 2012",
            "review_content": "\nJason is a great professor! He's really nice, approachable, and funny. The pace of the class was perfect and he always made sure that everyone understood the material before moving on. The class consisted of regular grammar lessons and readings from well-known French authors (Baudelaire, Guy de Maupissant, etc.). He also adds in personal experiences and stories to the classes which were always humorous and interesting. Grading was definitely fair and the quizzes and exams were easy. If you have a choice, you should definitely take French with Jason!\nWorkload:\n3 compositions (1-2 pages with a mandatory first draft for each. After you do the corrections on the first draft, your grade goes up a half step.), 3 quizzes (easy), midterm and final (both easy). \n"
        },
        {
            "course_name": "Third-Year Grammar and Composition I",
            "review_date": "December 28, 2006",
            "review_content": "\nJason Earle is a great teacher!  He explains things really well, keeps class relatively interesting, and in general is a really nice and cool person.  He is able to make some complicated grammar rules quite simple and he gives very helpful comments on papers.  I would definitely recommend taking this class with him - it will really help your French skills.\nWorkload:\nFrench W3405 is a lot of work but I think this is mostly not Earle's fault.  We had 5 compositions totaling about 10 pages (4 had rewrites which allowed us to raise our grade by one degree ex. from A- to A).  Also, there were 5 simple grammar quizzes, a midterm, and a final as well as a decent amount of reading (mostly short stories but two novels as well).  All the work is graded very fairly and returned promptly.\n"
        },
        {
            "course_name": "Third-Year Grammar and Composition I",
            "review_date": "December 28, 2006",
            "review_content": "\nJason Earle is a great teacher!  He explains things really well, keeps class relatively interesting, and in general is a really nice and cool person.  He is able to make some complicated grammar rules quite simple and he gives very helpful comments on papers.  I would definitely recommend taking this class with him - it will really help your French skills.\nWorkload:\nFrench W3405 is a lot of work but I think this is mostly not Earle's fault.  We had 5 compositions totaling about 10 pages (4 had rewrites which allowed us to raise our grade by one degree ex. from A- to A).  Also, there were 5 simple grammar quizzes, a midterm, and a final as well as a decent amount of reading (mostly short stories but two novels as well).  All the work is graded very fairly and returned promptly.\n"
        },
        {
            "course_name": "Advanced French Conversation II",
            "review_date": "May 14, 2006",
            "review_content": "\nJason is a great teacher. He structures the class into themes by week and each week, one person does a news presentation and another person does an interesting subject presentation. Bi-weekly vocab quizzes that are easy if you look over the words. He really tries to make the class enjoyable and engages in conversation with everyone. \nWorkload:\nBi-weekly vocab quizzes, one news presentation, one interesting topic presentation. If you go to class and participate, you will get an A\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "August 31, 2004",
            "review_content": "\nJason is a phenomenal teacher. His personality attracts participation and he has no problem making fun of himself. You'll want to learn French so one day you can aspire to hang out with this Texas native in a Parisian cafe. Get into this section if you can- you won't regret it.\nWorkload:\nStandard, department dictated load. quizzes, tests, compositions. All graded fairly, and with useful comments. \n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 20, 2003",
            "review_content": "\nQuite simply a perfect language teacher. Makes French fun and interesting and you learn quickly and well.\nWorkload:\nStandard. \n"
        }
    ]
}