{
    "prof_info": [
        {
            "prof_name": "Emily Feder",
            "prof_id": 10043,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "February 25, 2010",
            "review_content": "\nEmily is an absolutely wonderful professor. You can feel that she really cares about her students and wants them to do well/become better writers. She spends individual time with each student after reading their rough drafts (about a 30 minute meeting). She is very helpful and kind -- and though she often may challenge you or make you work harder, it's for your own good. She is never mean or condescending with her criticism either. She just realizes that everyone can improve their writing and really wants her students to push themselves.\nEmily became a friend to our class during the semester. Class was very fun, generally, and I always felt that I could call her or e-mail her or even meet up with her if my paper needed more work. That said, it's a standard UW class and the workload can be frustrating. It is hard to be motivated to do so many ungraded homework assignments....but they actually help the process of writing your paper. Emily is also understanding about deadlines and will work with the class to find something that works for everyone.\nI loved her class! Be very, very happy if you get her. Your writing will improve and your hard work will pay off (that is, if you put it in)!\nWorkload:\nThis class feels like constant work -- that's the standard UW curriculum, though. Writing exercises are due every class and range from 200 words to a rough draft. There is a ton of thick, dense reading, too. Prepare yourself because this class takes a LOT of time. She is a fair grader, though. Definitely not easy, but fair.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 26, 2009",
            "review_content": "\nEmily is a very helpful and talented UW instructor. She is great at teaching, workshopping, and in general critiquing your writing. Her pointers are very effective, right to the point. She is also very understanding; she relaxed our deadlines as the semester progressed, knowing that both we and herself have lots to do. All in all, a very caring instructor who knows what she's teaching (for example, for each new essay she has us meet her in her office to discuss our topics, and her comments on our drafts are always very detailed and helpful).\nAbout the course: it's a standard UW course. Emily sticks pretty close to her notes. Assignments pretty much every class, ranging from writing a few sentences, to a distillation (summary), to a rough draft. A very intense class and workload (worth 2 of my easy classes). Class isn't terribly exciting and it can feel very long. 4 essay assignments (called \"progressions\" by the department), with around 3 drafts (including the final one). First 2 are 1,500-2,000 words, third 2,500-3,000, last only 1,000-1,500 words. The workshops might help a lot, depending on the person, but I found Emily's notes on your writing and the private discussions with her really important. Oh before I forget: a substantial amount of reading too.\n\nWorkload:\nExpect to work a few hours per week on UW. Much reading and little assignments can take up time; eventually you'll learn to cut corners around those things that don't get graded. The first two papers are relatively lightweight compared to the third, the Research progression. I'd say on average one spends about a whole day on a paper (except for the last, and maybe a bit more on the third). Graded just on the four essays, no exams. First two papers are worth 25% each, third 35%, fourth 15%. She graded our final papers pretty quickly.\n"
        }
    ]
}