{
    "prof_info": [
        {
            "prof_name": "Natasha Lightfoot",
            "prof_id": 3419,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Slavery and Abolition in the Atlantic World",
            "review_date": "January 02, 2010",
            "review_content": "\nI had almost no prior knoweldge on the subject and was intimidated at first because people seemed to have more background knowlege\nbut the course is designed so you can learn the subject from scratch. \nThis class uses a comparative framework, so if you are interested in broader intellectual, economic, and political developments in the new world, this is an ideal seminar to take. You also get to explore a topic of your choice for the final paper, and professor lightfoot is willing to give feedback for your topic.\nReadings were thoughtfully organized by themes and our section had engaging discussions each week. \nProfessor Lightfoot always presented the material clearly and synthesized the readings well.\n \nWorkload:\ntalking points every week (15%, standard coursework postings of 3 or more points that you want to talk about in class about the readings)\n2 reading responses (20%, 3 page essays that connect the readings for the week)\n15-20 page final paper (55%, topic of your choice)\nParticipation (10%)\nYou have to read(or skim intelligently) everyweek to talk and participate in class. Focus on the larger themes. This class was graded fairly. \n\n"
        },
        {
            "course_name": "The Modern Caribbean",
            "review_date": "May 22, 2009",
            "review_content": "\nHistory of the Modern Caribbean was a pretty good class. The weekly readings were for the most part interesting and Professor Lightfoot's lectures were very clear and focused. The syllabus as a whole developed nicely, giving us a strong understanding of Caribbean history, both specific events and broader trends. To respond to the previous reviewer's statements: the history of the modern Caribbean is in many ways the history of slavery and its legacies, including Black Power. \" Yes, Professor Lightfoot is unabashedly liberal but the class is hardly an exercise in anti-white propaganda. \nHowever, this class is not easy, even though the reading load is fairly light for a history class. The lectures are intense (she throws a ton at information at you in a class and people usually scrambled to get everything down). The grading is steep too; I consider myself a strong history student and I had to struggle for an A-. She expects a lot on the exams and paper and the TAs (I'm assuming at her instruction) grade to a high standard. \nIt's a fascinating class if you're interested in the subject and Prof Lightfoot is an informative and interesting professor but I would advise against this class if you're looking for an easy way to fulfill your Global Core requirement. \nWorkload:\nReading was pretty light for a history class (~150 pgs/wk). Weekly discussion sections, midterm and final exams, 7-10 pg essay (using class readings and one outside book source--'conversation'-style essay) \n"
        },
        {
            "course_name": "The Modern Caribbean",
            "review_date": "May 20, 2009",
            "review_content": "\nI really had no intention of writing a review, but I had to just to say the person below me is serious need of a whaaaaaaambulance. The class isn't anymore racist than Contemporary Civilization, and if your white guilt is so strong that you're sensitive to potentially incendiary readings, well, perhaps a trip to the psychiatrist is in order. Professor Lightfoot is not around to coddle anyone.\nThat said, I didn't really enjoy the class. I didn't appreciate the format---you're fed a ton of historical facts in lecture, only to learn that you're not really tested on what you know, but how much your TA likes your writing style.\nOn the subject of TAs, they're actually pretty harsh graders. The average grade for both the midterm and the paper was only a B. So this isn't a class where you can do absolutely nothing and expect a good grade.\nThat being said, the class isn't really hard at all. I didn't do most of the readings or study for the midterm/final, and I just got my grade today---A-. Just try to go to at least 70% of the lectures (and bring a laptop---Prof. Lightfoot moves EXTREMELY fast).\nIn all, the material is actually pretty interesting, but I felt that the general structure of the class left something to be desired.\nWorkload:\nBasically non-existent. A few readings a week that you don't really need to do, since the concepts are repeated verbatim in lecture. One 7-10pg paper. Midterm/final that tests on writing style more than actual history. Any other work varies with the TAs. Not bad at all.\n"
        },
        {
            "course_name": "The Modern Caribbean",
            "review_date": "April 12, 2009",
            "review_content": "\nProfessor Lightfoot is a decent professor, however be aware that \"History of the Modern Caribbean\" is not history of the modern caribbean. It is the history of slavery and the oppression of black people in the Caribbean. While I have nothing against that, the class was ill-described, and you should be aware of what you are signing up for.\nJust a little taste from a required reading:\n\"..If it is anyone who should suffer embarrassment it is the whites. Did black people roast six million Jews? Who exterminated millions of indigenous inhabitants in the Americas and Australia? Who enslaved countless millions of Africans? The white capitalist cannibal has always fed on the worlds black peoples. White capitalist imperialist society is profoundly and unmistakably racist.\"\n-from a reading titled \"Black Power\"\nMyself, and many others I know would not have taken the class had we known the clear political and racist agenda behind this class.\nAmong other things, Professor Lightfoot claims that \"Africans in the West Indies founded the modern banking industry.\" While such an argument can be made, it is  obviously a very narrow viewpoint, and hardly something she should be teaching in \"History of the Modern Caribbean\".\nOutside of her personal viewpoint and agenda, the material she covered was very interesting and informative. Unfortunately 85% of the material is her viewpoint...\nWorkload:\none 7-10 pg  paper, midterm, final. standard weekly readings. not overwhelming at all even to someone with no prior experience in history/the caribbean.\n"
        },
        {
            "course_name": "The Modern Caribbean",
            "review_date": "April 03, 2008",
            "review_content": "\nProf Lightfoot is SUPER organized, as well as knowledgeable, passionate, interesting and funny. She gets into the real political facts and debates about the Caribbean while also covering the social and cultural changes that occurred and all the reasons and progressions that shaped the Caribbean into what it is today. \nGreat Professor because she is so organized and clear in her presentation, while also being engaging.\nOnly criticism: Class moves slow at first, taking lots of time to explain events in the 18th-19th centuries, so there is less time for more modern history, but she still covers it all pretty well for a survey course.\nWorkload:\none 5-7 page research paper, midterm, final. weekly discussion section. Easy.\n"
        }
    ]
}