{
    "prof_info": [
        {
            "prof_name": "Geoffrey Abers",
            "prof_id": 4378,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Plate Tectonics",
            "review_date": "June 10, 2010",
            "review_content": "\nI took this course with relatively little preparation for such advanced coursework.\nProfessor Abers can be a dry lecturer at times, but at least when he is lecturing he is coherent in both his pronunciation and in his explanation of geological processes. He posts all of his lectures as well as \"notes\" from the lectures (bullets of important points and equations that he wrote on the blackboard during his powerpoint presentations) onto courseworks which is extremely helpful when studying for exams.\nUnfortunately, you will be taking this class with mostly graduate students, so finding a study partner is nearly impossible unless you decide to take the class with a friend ahead of time. His grading is fair and he offers to give back 50% of the points that were deducted from homework assignments if you correct your errors within a reasonable amount of time.\nHe does a thorough review before each exam as well as offers pointers on topics he believes are especially important to study for.\nAlso, throughout the semester there are visiting professors that lectured on specific topics in Plate Tectonics, some were better than others.\nOverall, Abers is a A+ professor. Don't procrastinate though, because it can be extremely hard to catch up!\n\nWorkload:\n3 or 4 homework assignments throughout the beginning of the semester worth 30% of your grade, so do well on them! A term paper due before the finale exam worth 30% of your grade; this includes a presentation as well. A midterm and a final, each worth 20% of your grade. It's nice how he places more weight on homework than on exams.\nThe term paper shouldn't seem like a burden; you will most likely enjoy reading about very interesting geological processes and interpreting them on your own and developing your own ideas.\n"
        }
    ]
}