{
    "prof_info": [
        {
            "prof_name": "Nina Shapley",
            "prof_id": 2329,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Materials and Energy Balances",
            "review_date": "February 13, 2006",
            "review_content": "\nProfessor Shapley is by far the nicest and perkiest professor I've had on campus. She's an okay teacher. Students basically spend the whole period copying notes. Literally. You will be taking notes the whole entire hour and 15 minutes. This is unfortunate because there is so much material in the book and it's hard to keep up with the thought process. I think if Shapley didn't try to teach EVERYTHING from the textbook I would have liked the class better. She provides solutions to the homeworks sets, which makes it great for practice tests. And it's true, it's either hard for the sophomores or easy for the juniors. If you want a better grade in this class I'd advise taking it junior year. Overall, Shapley isn't great, and she isn't bad. It's just the density and context of the material that makes it dry.  \n"
        },
        {
            "course_name": "Materials and Energy Balances",
            "review_date": "January 19, 2005",
            "review_content": "\nProfessor Shapley could very well be inspiration for the portrayal of scientists in movies and novels. Big classes, wild and wacky hair, and a kind of absent-minded disposition. However, this warms your heart to her and you can't help wanting to go to class and feign attention just because she tries so hard. Her main downfalls (and I guess these are prety big ones) is that she teaches straight from the text and gives high school type notes, which make for a very boring hour and fifteen minutes. Never let it be said though that she isn't thorough and very well prepared in class. Overall a pretty decent professor. Tries hard to make the class interesting, is extrememly approachable, friendly and helpful, and grades generously.\nWorkload:\nnot too heavy:HW assignments that aren't graded1 midterm (30%)1 presentataion (30%)1 final (40%)\n"
        },
        {
            "course_name": "Materials and Energy Balances",
            "review_date": "December 26, 2004",
            "review_content": "\nProf. Shapley is a very nice teacher.  She is approachable and patient.  She did a great job teaching her first term at Columbia.  She tries to make everything clear to her students and she listens to what we have to say.  The only thing that sucked about this course was the MEB textbook.  The book is poorly written, with no solutions whatsoever.  I had a hard time understanding the problems because there were no solutions.  This class is either very easy for juniors or extremely difficult for some sophomores.  This is the class that determines if you want to be a Chemical Engineer because it doesn't get any easier when you become a junior.  Thermo and Transport will kill your GPA.\nWorkload:\nFour HWs, one fair midterm, one fair final.\n"
        }
    ]
}