{
    "prof_info": [
        {
            "prof_name": "Leora Bersohn",
            "prof_id": 1180,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "June 25, 2004",
            "review_content": "\nI didn't mind the class while taking it. There was a bigger workload than most other UW classes, but it really didn't seem too bad. \nAbout halfway through the semester, though, I started feeling like a lot of the grading was very arbitrary. After one essay, Leora emailed the class to reassure us that she would follow the \"trend\" of grade inflation. At the end of the semester, though, I was shocked to see that my grade was lower than I expected rather than higher.\nBe careful with this class. Even if a response seems insignificant, it will probably wind up being graded. There are rarely drafts on essays, so your first chance is probably your last. If possible, I'd switch profs. I didn't, and now I have to deal with this low grade in a supposedly easy freshman writing class.\nWorkload:\nWeekly GRADED response papers, two 4-5 page papers, one 6-8 page research paper, one retrospective paper. DRAFTS ARE RARE.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 20, 2004",
            "review_content": "\nATTENTION:\nNo matter what other reviews may say do not take Leora's class! And I am sorry if you have no choice and have to take her class because it is miserable. The biggest problem that I had with her teaching of University Writing is that she did not allow us to write drafts. While all of my other peers had the opportunity to really focus on their writing and making it more effective by three or four drafts most of the time our class had to turn in ONE, FINAL DRAFT. \nWorkload:\nWriting Exercises that are graded (unlike in other University Writing classes), 3 major papers, and 1retrospective essay.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 22, 2003",
            "review_content": "\nI was so scared of lnr!! And reading the reviews here for Ms Bersohn only added up to my anxiety.. Turns out they were completely wrong!! Leora is great. She was never in a bad mood as someone said, she always wrote good comments on the essays,  she always gave great interesting topics and the grading was very fair.  The classes went by fast they were so interesting and dynamic. I don t know what else to say, you re very lucky if you get her. I m much more confident about my writing skills now. Oh, and i saw nothing of that teacher s pet thing some reviews mentioned. She is awesome!! \nWorkload:\none short essay a week, longer essays but also fun to write,  library assignment, a couple of email responses to texts she gives out, in class midterm, and final  (also nott bad at all). she said that s changing, though, but that s because of columbia, not her.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 25, 2003",
            "review_content": "\nI love Leora!!!  While all of your friends will be bitching about their LR classes, you'll have Leora.  Her essay topics are interesting.  She doesn't devote class time to completely trashing your essays the way other LR instructors do.  Her classes are always fun and relaxed.  She focuses more on honing your style rather than nit-picking about dangling modifiers. \nWorkload:\nweekly short essays. a few long essays which aren't that bad\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 22, 2003",
            "review_content": "\n    Pay no attention to any of these other reviews!!! If you find yourself in Ms. Bersohn's section, count yourself among the luckiest of students. I, and to the best of my knowledge, everyone in my class, was crazy about her, and would take her again over any other L&R; teacher. \n   The complaint I hear most often about Logic & Rhetoric is that classes are taken over by arguments and uninformed debates over the issues discussed in the paper. That's not what L&R; is supposed to be about. It's a writing class, not a class for debating politics or philosophy. And with Ms. Bersohn, this is never a problem; she's happy to get into discussion about the issues in the papers, but she always sensibly brings the discussion back to LOGIC and RHETORIC, which, believe it or not, is what the class is about.\n   She's a really cool person too! And if you're complaining about her being a feminist, well, gee-whiz, grow up.\n   The readings are really interesting: Orwell (of course), Carl Sagan, and this guy Fussell who wrote about WWI journalistic rhetoric. \n   The other reviewers should not be complaining, unless maybe they had a different Leora Bersohn who also teaches L&R.; Kudos to you, if you're in her section.\nWorkload:\nA paper a week, and two revisions. Except, I think all that is going to change pretty soon. Don't worry, whatever the Core does, Ms. Bersohn will make it cool.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 02, 2002",
            "review_content": "\nI think the best way to describe her class was B-A-D! She's mean and biased on her grading, a rare specimen of evil grad student trying to screw undergrads over in terms of their GPA. She didn't do too well teaching what we needed to know but gave me plenty of headaches. If you end up stuck in her class, beware, cuz she can sense when you don't know your stuff and calls on you just to hear you say \"oh, uh, sorry, i don't know.\" When there's a chance of dropping or switching sections, DO IT!\nWorkload:\naverage L&R; load... weekly papers and readings, along with writing discussion questions... such a pain!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 19, 2002",
            "review_content": "\nI think it's safe to say that this review is written by one of the people who could be considered her \"pets\" (not a brown noser, thanks). I consistently got pretty good grades on my essays, although a couple other people in my class have complained about her grading harshly. I'm not saying this is fact, but i'd like to suggest the idea that she may give the better writers better grades and go harder on the students with a rougher \"style\"--because the three students who've complained to me about their grades happened to be poor writers. i know because i've workshopped their stuff and it wasn't A level stuff, regardless of who likes who or whatever. i don't think she can be criticized for her grading habits. However, her mood swings are another thing. Beware days of class that fall on Jewish fasting holidays--it's murder! Plus the cool, friendly-chill-grad-student can really easily disappear and be replaced with a snappy grouch who will overreact if you are five minutes late. seriously. tardiness = sin with bersohn. but her assignments are pretty interesting, and i personally found her comments to be helpful (yes she made \"bad\" ones on mine, consistently--i honestly don't think she plays favorites) one thing i definitely don't agree with from previous reviews is the idea that she's hard to meet with outside of class. maybe she's turned over a new leaf this semester, but she's definitely available. just talk to her about it in class. all in all i liked the class. it was easy, and we had really interesting discussions about a variety of cool subjects. (ps--she's sort of a raging feminist, so step carefully)\nWorkload:\nmoderate. typical l&r; load, not as bad as the pilot sections! a short essay per week (they get longer as semester progresses)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 19, 2002",
            "review_content": "\nI think it's safe to say that this review is written by one of the people who could be considered her \"pets\" (not a brown noser, thanks). I consistently got pretty good grades on my essays, although a couple other people in my class have complained about her grading harshly. I'm not saying this is fact, but i'd like to suggest the idea that she may give the better writers better grades and go harder on the students with a rougher \"style\"--because the three students who've complained to me about their grades happened to be poor writers. i know because i've workshopped their stuff and it wasn't A level stuff, regardless of who likes who or whatever. i don't think she can be criticized for her grading habits. However, her mood swings are another thing. Beware days of class that fall on Jewish fasting holidays--it's murder! Plus the cool, friendly-chill-grad-student can really easily disappear and be replaced with a snappy grouch who will overreact if you are five minutes late. seriously. tardiness = sin with bersohn. but her assignments are pretty interesting, and i personally found her comments to be helpful (yes she made \"bad\" ones on mine, consistently--i honestly don't think she plays favorites) one thing i definitely don't agree with from previous reviews is the idea that she's hard to meet with outside of class. maybe she's turned over a new leaf this semester, but she's definitely available. just talk to her about it in class. all in all i liked the class. it was easy, and we had really interesting discussions about a variety of cool subjects. (ps--she's sort of a raging feminist, so step carefully)\nWorkload:\nmoderate. typical l&r; load, not as bad as the pilot sections! a short essay per week (they get longer as semester progresses)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "October 18, 2002",
            "review_content": "\nShe assigns both reading assignments and writing assignments, both of which I find completely \"distasteful\". To tell the truth, I feel like I did not learn much at all in that class. Her comments on papers told me the problems but gave no suggestions as to how to improve. She's not responsible in helping you out outside the classroom either. So don't expect much from her, UNLESS you're one of her \"pets\".\nWorkload:\nnot too bad if you're into reading and writing about random stuff; if you're not, sucks for you.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "October 18, 2002",
            "review_content": "\nShe is definitely qualified to discuss essays and reading assignments, however, beware of her \"nice\" attitude near the beginning of class. This will all change if you do not wiggle your way onto her good side. She apparently shows a large degree of favortism and grades based on that factor. Discussion sessions were often boring and worked better as a sleep inducive element rather than a learning environment. For the essays you write, she will make numerous comments on how poorly you did and what was wrong, but seldom mention how to improve upon those various points. Again, her expectations of your writing level increases if you appear on her blacklist, which of course means that your grades will rapidly drop (if she doesnt like you). If you are not a brown-noser, dont expect an A in her class. \nWorkload:\nWorkload is moderate. She assigns 2 essays a week during one semester and 1 essay a week for the next semester, so the essay writing workload varies. I hope you get lucky. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 06, 2002",
            "review_content": "\nI have to disagree with the other review. I got some bad grades, but only on bad papers, so there's justice in the world after all. I didn't notice any moods or profanity. What sold me, though, was that the essays we got assigned were usually pretty interesting, like what makes a good title for a movie or a book. Not a bad teacher at all, although the handwriting could be better.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 20, 2002",
            "review_content": "\nAt first I thought she was such a nice and knowledgeable person, but then I realized I was only half right. She's definitely knowledgeable, but she's certainly not nice. In fact, she literally used a profanity in describing a student's work! But in terms of class discussion, she does a good job leading them. I personally thought grading was not too generous, especially towards the end when she gets into those wonderful \"C\" moods... She's not too good about replying emails, and her handwriting is just plain bad. The class wasn't my least favorite, but she was definitely my least favorite teacher.\nWorkload:\nReadings and papers weekly (short at first 2-3 pages and then a bit longer ones 4-5 pages). Midterm, and Final.\n"
        }
    ]
}