{
    "prof_info": [
        {
            "prof_name": "Stephen Sullivan",
            "prof_id": 12961,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "History of the City of New York",
            "review_date": "April 22, 2015",
            "review_content": "\nABSOLUTELY LOVED THIS CLASS. I thoroughly enjoyed the History of the City of New York with Professor Sullivan. The man is a walking fount of historical knowledge of NYC. I thought the curriculum was planned out well for a twice weekly class, meeting one day for lecture and one day for a walking tour to various sites such as Central Park, the Lower East Side, lower Manhattan, and Brooklyn Heights. Professor Sullivan often added his own personal anecdotes to both lectures and walking tours which made the class more interesting. It's also a perfect class to take during the summer session since we had beautiful weather for all of our walking tours and it sure beat sitting inside a classroom. Stephen does go off on tangents (as he admits) but I find his lecturing style refreshing. But he really shines as a tour guide because of his vast knowledge of the city. As a native New Yorker who thought knew everything about the city, I was amazed of how much I actually didn't know about the city. \nThe bottom line: If you love both history and New York City, then I wholeheartedly recommend this class. It was the fastest (and most enjoyable) 6 weeks I have ever spent in a class at Columbia. \nWorkload:\nMidterm, final, 5-paper paper (he gives a choice of interesting formats), and a 1-page walking tour reaction paper. Moderate amount of reading, but, again, if you're really into the history of New York, you'll enjoy the books.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "August 09, 2014",
            "review_content": "\nDO NOT take A History of the City of New York with Sullivan, who teaches during summer sessions. He is disorganized, teaches the course at a 9th grade level and goes off on endless tangents about his tenuous personal connections to famous people and places. I once timed the amount of class he wasted name dropping and it was over 17 minutes! His tours are taken directly from Big Onion Tours (which he never fails to mention he contributed to as an undergrad at CU) and are not recalibrate for college students. While he means well and is an easy grader, Stephen Sullivan is too self absorbed to impart any knowledge. Wait for Fall or Spring to take it with a real professor.\nWorkload:\nLaughable. Midterm, final, a 5 page paper and a 1 page walking tour reaction paper. Moderate amount of reading that only comes up on the midterm.\n"
        }
    ]
}