{
    "prof_info": [
        {
            "prof_name": "Demetrios Caraley",
            "prof_id": 1250,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium: Democratic Political Theory",
            "review_date": "January 16, 2003",
            "review_content": "\nYou will constantly look at the clock and be amazed that only 5 minutes have passed. Wow! this was the worst class that I have taken in this University. Caraley is a good man, but a bad teacher. In a discussion class, he would lecture for about half an hour on something no one cared about. We were supposed to pass in response papers once week, but he never passed them back.  Then in response to our questions about our grades before the final paper, he said \"if you were doing ambismallly, I would tell you!\" He is an intellegent man, but he seemed not to care about us. At the beginning of the year, we asked about how the grading was based. He thought for a second and came up with some random fractions. We asked how long our final paper was supposed to be and he said \"I don't know, i guess 25 pages\". He did not enjoy begin challenged in class, but it was quite funny to see how he reacted to a challenge (basically just telling the person that they were wrong).  He is great grandfather type to tell you a story about Plato or Lincoln, but an awful professor. I'm so glad I am done with this class.\nWorkload:\nHonestly, never really did it. A bunch of classic books that was quite easy to find on the web. Once a week 2-3 page response paper on every assignment for that week. Final 25-30 page paper with a presentation (if you would call it that) at the end. \n"
        },
        {
            "course_name": "Colloquium: Democratic Political Theory",
            "review_date": "November 18, 2002",
            "review_content": "\nCaraley is unbelievably boring! I feel like I entered Sainthood every time I went to his class. He is quick to dismiss your opinion and is incredibly arrogant. His class has no structure and gives no deadlines for things such as topic proposal, bibliography, outline, etc. This is a great class for catching up on your grocery list and other things you need to do for the week. DO NOT TAKE HIM EVER!!!\nWorkload:\nmanageable, weekly responses to him on the readings. BEWARE! If you don't give him length, he will email you back saying \"skimpy response--do it over\"! Exactly what you need when you have other assignments to do!\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "November 17, 2002",
            "review_content": "\nAVOID!!! Do not go in, he is not helpful, never gives constructive feedback and is just arrogant. Has no problems telling you that he does not think you are going to graduate.\nWorkload:\nRandom\n"
        },
        {
            "course_name": "Colloquium: Democratic Political Theory",
            "review_date": "November 13, 2002",
            "review_content": "\nCaraley is a son of a b***h. What else can I say? He is rude, opinionated, haughty, and completely evil. I would rather die than take another course with him, he is not only lecherous but so unbelievably arrogant it surprised everyone in the class. Stay away.\nWorkload:\nreally unorganized, but a big term paper and some weekly assignments\n"
        }
    ]
}