{
    "prof_info": [
        {
            "prof_name": "Elizabeth Abzug",
            "prof_id": 948,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Community Building Seminar",
            "review_date": "January 26, 2009",
            "review_content": "\n\nProf. Abzug is smart, driven, and intense.  That being said, I loved her class. The readings were manageable (some great, some bad), and she really expects you to participate.  Don't try to BS anything because she'll rip you apart.  And it will be funny.  I learned a lot from Abzug and would recommend her class to anyone interested in urban policy/politics. \n\n\nWorkload:\nWeekly readings, one 3-paged paper, one 15-page paper on any CDC (great topic in my opinion)\n\n"
        },
        {
            "course_name": "Community Building Seminar",
            "review_date": "May 20, 2006",
            "review_content": "\n\nProf. Abzug is a solid professor.  She's not the most amazing prof. anyone will have, but she's definitely above average.  Community Building was a seminar, and she did a great job of keeping discussions lively and engaging for everyone.  She was also good at letting people talk or not talk as they wished, while also encouraging wide participation.  The readings could be a bit redundant and sometimes boring, but you don't need to do them all to keep your head in the game in class.  There's not a whole lot else to say--Prof. Abzug was definitely understanding and willing to give extensions and that kind of stuff.\nI know some reviewers have lamented Prof. Abzug's eagerness to share stories from her work, which can sound a bit like name-dropping.  To me, it never came off that way.  Her work--outside of Columbia/Barnard--is as a community developer, and it always seemed to me that her stories were meant to illustrate the very real implications of the material we were covering.\n\n\nWorkload:\nPrepare discussion questions for one class, 3 pg. field review, in-class presentation, final 15-20 pg. paper.\n\n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "November 16, 2004",
            "review_content": "\n\nGreat professor who really knows her stuff.  Don't miss out on an amazing opportunity if you get the chance to take a class with her!\n\n\nWorkload:\na lot, but its set by the department so it's the same in either section\n\n"
        },
        {
            "course_name": "Community Building Seminar",
            "review_date": "May 06, 2003",
            "review_content": "\n\nProf Abzug is AWESOME! Not only are the papers manageable (one 3pg paper and one 15pg paper), but its actually a FUN class! Shes extremely knowledgeable. The weekly readings can be long at times, but you can skim it to get by.\n\n"
        },
        {
            "course_name": "jr collq & Building Community",
            "review_date": "May 23, 2002",
            "review_content": "\n\nAwful Prof? No Way! First, if U.S is your shtick then her class will give not only a sound foundation but one friendly, nurturing and fun atmopshere to do it in. Yes, the readings are long , but you can skim and still come out way ahead. 1/3/- 1/2 grade based on class participation; so if sitting quietly in the background is for you , look elsewhere. She's fair, knowledgable,amd down to earth...a rare commodity in this place. \n\n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "January 27, 2002",
            "review_content": "\n\nShe has a great reputation in New York politics but she is an AWFUL professor. Very self-absorbed. Always talked about her community board and how much they did, and also her losing campaign for city council. She might be a good person to know to get you a job or something but she didn't carea bout the class. \n\n\nWorkload:\nThere was massive amounts of reading---maybe 500 pages a week---3 books or so---but i heard they changed that. Also one BS paper that doesn't matter for anything. The big thing is the final research paper---20 pages ors omething---and a presentation. I doubt she spent much time reading them They key to a good grade is participating in class discussion. Split up the reading and only read the intros just so she'll know you read in the 10 minutes of conversation before she starts talking about herself.\n\n"
        }
    ]
}