{
    "prof_info": [
        {
            "prof_name": "James Connolly",
            "prof_id": 2483,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "GIS: Methods and Case Studies",
            "review_date": "January 17, 2007",
            "review_content": "\nJames is great! He is extremely helpful and available if you have problems at any stage in the class. During the midterm he made labs available to the class and had office hours for days at a time so that we would be able to figure it out.  He was also understanding of computer problems and issues with regards to turning things in because he knows that sometimes its hard to figure out problems with the program. By doing all of the labs and things you really are prepared to look at your own research topic for the final.  GIS is also really useful for anyone interested in cities because it helps you see them in a different way.  Really just a great class.\nWorkload:\nweekly labs that take a couple hours, some reading that isn't really necessary, take home midterm that will take more time than you think so plan ahead for that, and a final project/presentation\n"
        },
        {
            "course_name": "G.I.S. ",
            "review_date": "January 17, 2006",
            "review_content": "\nThis is the second time I have worked under James and it was even more rewarding this time. He is intelligent and excited about the material because he is studying it as well. He is organized and REALLY helpful to everyone (even when one would think his patience should be wearing thin.) Classes move at a relatively slow pace because it is hard for a teacher to expect computer literacy from everyone. The best time was definately during the final project (basically the second half of the term) when people all did their own thing and got feedback from James on an individual basis. He also seemed to take a genuine interest in everyone's final projects; after all, he did really stress that he wanted it to be interesting to the individual, or else the whole thing would just be a drag. Best of all is that he is SO understanding of his students and their busy and stressful lives. The thing is, though, that he is so nice and unassuming, you would have to be a cold-hearted *** to take advantage of him. Oh, and by the way, he is quite a nice person to look at, too (wink)!\nWorkload:\nWeekly or bi-weekly labs (the first grade is kinda rough because he doesn't tell you about layout, but from then, it is smooth sailing. They are kinda time-consuming, but definately don't feel tedious), a midterm (definitions...slightly pointless), and a final project (so much fun! You really feel like you have learned something! Make sure not too take on too much or you will get too frustrated--do what you can and build upon that until the deadline.)\n"
        },
        {
            "course_name": "GIS: Methods and Case Studies",
            "review_date": "January 05, 2006",
            "review_content": "\nJames was an excellent professor. He did a solid job of explaining the computer program if you just paid attention. The only people I know who had problems were people who didn't pay attention. James was also held numerous office hours - he added extra hours when people were unavailable during the initial hours offered, and during crunch times, added even more hours to compensate for the problem that arose because the program was quite tempermental. This was definitely one of those classes where the professor did more work than the students. I only have two complaints - first of all, there were too many people in the class. It also fulfilled Barnard's quantitative reasoning requirement (which it really shouldn't have), and so the class was a combination of Urban Studies majors who found the class really interesting and then people wanting to fulfil the gen ed requirement and didn't care, thus bringing down the overall excitement that students had for the class. Ideally, the class should have been capped at maybe 20 (I believe it was capped at 30, but James was a softie and left a few more people join), and it should have been limited to Urban Studies majors. Secondly, and this is more a reflection on the nature of the computer program than \nWorkload:\nFour labs that at times required a ton of time, other labs required very little. the computer software was very tempermental, and sometime there would be issues and that would practically double the amount of time it took to do anything. \nOn midterm - straightforward, and pretty easy if you'd done the readings and kept track of key terms. There was supposed to be a final but it was cancelled. There was also supposed to be a 5th lab, but it was cancelled. James was very flexible with the syllabus because a number of the labs took much longer than they were supposed to because of the labs. Also, there was a final project that culminated in a presentation and a structured 10-15 page paper. James was a very fair grader and always tried to make himself available in the event that people had problems. \n"
        },
        {
            "course_name": "GIS: Methods and Case Studies",
            "review_date": "December 26, 2005",
            "review_content": "\nI took it as an elective, but I heard it's a good way to satisfy one of the pesky Urban Studies requirements.  James is extremely accessible, knows his stuff really well, and made the projects/labs interesting.  GIS is really powerful and a great skill to have though trying at times because of computer crashes and what not.  But he went slow enough for all of us to understand the program, gave us a lot of flexibility in our final projects, and graded fairly.  Highly recommend!\nWorkload:\n4 labs on urban issues (low income housing, traditional families, poverty, historical preservation), midterm on readings & concepts, final project (10-15 page paper on a subject of your choice... we had to use census data and other info to show our stuff visually and then write up about it).\nBreakdown: 40% labs, 35% final project, 25% exam (I think)\n"
        },
        {
            "course_name": "GIS: Methods and Case Studies",
            "review_date": "November 09, 2005",
            "review_content": "\nJames is a really good professor - especially for teaching those of us that are technically unskilled a pretty complex and frustrating computer program.  I signed up for this class because I think that GIS is a really good program to know how to use, and he really helped us in getting through all of the problems with the program.  He is good at creating labs that allow us to approach urban issues using spatial data, and although the readings are extremely dry there is only a small coursepack that is assigned.  James has done a lot of work in GIS and it was apparent that he really knew his stuff.  He's also really accessible - though his office hours are pretty much the same each week since you have to reserve the GIS lab, he responds pretty quickly to e-mail.  Highly recommended - especially for Urban Studies majors who have to fulfil the analysis requirement.\nWorkload:\n5 labs (first 3 were longer than the last 2), Final Project, Midterm and Essay based on readings.  Readings for some classes which are really boring but pretty short.  Post something on the discussion board for each lab.  Fairly graded.\n"
        },
        {
            "course_name": "20th Century Urbanization",
            "review_date": "April 28, 2005",
            "review_content": "\nJames was a good TA. He ran interesting discussions and just generally seemed like a good guy. Even though I never went to his office hours, I got the impression from others that he was very accessibly. I found his grading to be extremely fair. I'd  definitely recommend him. \n"
        },
        {
            "course_name": "20th Century Urbanization in a Comparative Perspective",
            "review_date": "April 10, 2005",
            "review_content": "\nJames is a great TA.  He's the sole TA for a 90 person class, and leads discussion sections, grades papers/exams, and is still extremely accessible and willing to help.  He is a master's student in urban planning and is teaching us his GIS skills as an option for section.  I am astounded by the amount of work he takes on for this role, especially considering most classes that I've had this size have at least 2 or 3 TAs.  He and Prof. Gutfreund work together to create a really great interactive course.\n"
        }
    ]
}