{
    "prof_info": [
        {
            "prof_name": "Gregory Pflugfelder",
            "prof_id": 1262,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Who Is the Samurai?",
            "review_date": "September 02, 2015",
            "review_content": "\nI am not an EALAC or History major, but this was one of my fondest courses from undergrad. Prof. Pflugfelder is exactly what you would hope a professor to be at this University - a true subject matter expert, who is very approachable, fair, and engaging.\nA previous reviewer mentioned that this, \"is not a military history course by any means, but there's a bit of that.\" In actuality, the fundamental essence of the samurai was his capacity as a warrior. Hence, everything involving the samurai was in some way military, but the class explores, \"every conceivable angle--sexuality, ethics, legend, economics, law, gender roles, art, literature, film, political formations, major figures,\" as he or she noted.\nIf you have any interest at all in Japanese History, the chance to explore it via \"Who is the Samurai?\" is a fantastic opportunity. \n\nWorkload:\nThis course has a fairly hefty workload, between the readings, weekly response/reading summaries, short essays, and research paper. There is also a potential bonus paper.\n~ 200 pages of reading a week\n- Weekly reading responses (reading summaries), which he may discontinue once he feels everyone is doing the readings\n- Three 4-5 page essays\n- 10-15 page research paper (he is extremely flexible about topic choice)\n- additional 4-5 page bonus paper\n\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "June 08, 2015",
            "review_content": "\nGreat Professor, however there were some issues with the class. One of the TA's was constantly scanning the back of the classroom for people using their computers inappropriately or falling asleep, and her behavior was extremely distracting. Another issue I had was just with general housekeeping issues. Professor Pflugfelder didn't go over the syllabus in class which contributed to a number of misunderstandings. We were told to expect an average reading load of 50-150 pages per week- however on the last week of class the workload practically tripled with no warning whatsoever.  There was nothing on the syllabus to suggest this because one of the assignments was an entire work with no indication of how many pages it contained. Additionally, I was left a little pissed off after I purchased materials that were later provided on courseworks for free. \nAs a whole though, despite having no real interest in the subject matter and only taking the class because it was the best of the remaining global core options I had available to me since I had to register late, I feel positive about the course. I felt that everything was graded very generously and Prof. Pflugfelder is kind of hilarious. \nWorkload:\n1 midterm, 1 final, 1 8-10 page paper, weekly readings ranging from 50-350 pages and weekly 250-300 word responses plus a mandatory discussion section.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "March 30, 2015",
            "review_content": "\nDO NOT TAKE THIS CLASS!\nFor those of you who are not dissuaded by the first statement, please let me elaborate.\nIt's quite sad that I have to tell you not to take this class because Pflugfelder is a great lecturer and attempts to be very engaging. However this class is ruined by unbearable required recitation and poor TA choice.\nThere are four TA's in the Spring 2015 class.\n2/4  TA's are certifiably insane\n1/4  obviously paid someone a good amount of money to take the TOEFL because her English is not understandable\n1/4 appears to be normal\nIn this class the 2 crazy TA's pace the back of the lecture and torment students who are using their computers to distract themselves from the droning lecture. Personally I cannot pay attention during this class and the behavior of these 2 TA's serves as more of a distraction than a benefit to any persons involved. Instead they should just mind their own business and allow people to self-distract instead of not coming to class (due to this unnecessary policy).\nTLDR: Japan studies grad students are crazy and ruin the class. Take rise of civ and hope that you get an A-.\nDisclaimer: I had to stop going to this class because I can't stand it, but I still go to recitations as they play a role in participation.\nWorkload:\nToo much reading, 10 page paper, easy midterm\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "January 03, 2014",
            "review_content": "\nThis class was thoroughly useless, though not at all difficult to do well in. If you're a student from any of the \"hard\" majors at Columbia (read: not gender studies, poli sci, religion, EALAC, philosophy, etc.) and you're trying to fulfill your global core requirement then take this class!\nNegatives:\n-weekly 50 minute discussion section (just make 1-2 semi-intelligent comments are you're good to go)\n-boring class\n-absolutely useless (doesn't even make it chronologically to 1941, Pearl Harbor, WWII, Hiroshima & Nagasaki...unbelievable)\n-one really boring paper on Japanese art (not hard, just unbearably useless and uninteresting)\nPros:\n-class is not very useful\n-midterm and final are easy\n-TAs give review sheets for both the midterm and final with all the terms you need to know (Wikipedia these and make a review guide and you'll do great, not only in ID questions but also for knowing the context for the essay questions)\nOverall: if you are conditioned to do lots of work for a class (i.e. you're a STEM major or something with equal workload) and you need to fulfill your global core, this class will require minimal effort to get a decent grade. Yes. it's an utter waste of time, but isn't that the point of global core? Take it.\nWorkload:\n-Weekly discussion post (1 paragraph) and weekly 50 minute discussion section\n-LOTS of reading. Do none of it. Just print it out, wikipedia the reading, and bring the printout to class to B.S. with when the TA asks questions\n-Easy final, easy midterm (a few term IDs, a few essays, LOTS of choice)\n-One 8-10 page paper on Japanese art (holy shit it's boring, but not hard. My suggestion: lock yourself in the library for 20 hours and do it in one sitting)\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "August 25, 2010",
            "review_content": "\nThis class made me want to tear my hair out towards the end of the semester. \nTo be fair: Pflugfelder's syllabus is mostly comprehensive, and covers the important anthropological, cultural and sociological developments of Japan insofar as he could over the course of one semester. His lecturing style was not at all esoteric; his powerpoints were clear and his points were useful. \nThat said, ASCE: Japan for me was saved by the strength of his TAs. On their part, they did an incredible job of scanning and uploading every single one of the extremely numerous and useful readings. While you didn't have to do them to get by in class, they were a resource for any EALAC major that came in useful for a variety of different classes. \nPflugfelder tends to be tardy to classes, which results in him rushing his lectures. Almost every lecture ended with a hurried summation of important factors, some of which will never be got to, and every next lecture begins with a time-consuming and repetitive summary of the one before. Discussion sections do much of the legwork in making sense of and rounding out the lectures, especially in areas which the professor chooses to tread lightly upon.\nFocus on material is generally fair until the Tokugawa. Not much was said of any of the time between the Kamakura and Edo periods, steamrolling important chunks of Japanese history (the Azuchi-Momoyama period?) in favour of him discussing Edo sexuality and literature. He does give fair warning that this is his disciplinary focus, but for as long and important a period as Edo, one expected at least a little discussion of politics and economics. The Meiji era, too, was subject to steamrolling due to the amount of time Edo discussion took up.\nWorkload:\n- Two papers, both moderate on the research. For the 2009 Fall semester we had to inspect a work of Japanese craftsmanship from the Met. \n- A lot of reading, much of which is actually related, not much of which you need to do to get by. \n\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "January 10, 2010",
            "review_content": "\nPflugfelder was a solid professor - usually a bit late to class - who presented thousands of years of Japanese history in a relatively clear manner. His main tool is his power point presentations. He presents the class with cultural artifacts/paintings/prints as a means to bring the material to life (pardon the cliche). I was never one of those guys who obsessed about Japanese culture / anime, so I was quite surprised to find myself genuinely engaged with the class. That said, he focuses on gender and sexuality, which can get tiresome. Sometimes you really don't care about the aesthetics of imperial courtship and would prefer to just read about the events of the era.\nI did the readings only to get my weekly courseworks posting out of the way. Meaning I skimmed the first ten pages of the document, read other comments in the discussion thread, and BS'ed something. I highly recommend you do the same, as almost none of the material appears on the midterm or final. The focus is on lecture material.\nThe grading was surprisingly tough - a friend who took the class a year before me said this was probably due to my TA. If you put in an earnest effort, you will wind up with a decent grade.\nWorkload:\nMidterm, paper, final ... definitely a standard amount of work, perhaps a little less than average.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "January 14, 2007",
            "review_content": "\nI'm glad I took this class, but it is definitely a mixed bag.  The readings are pretty consistently awesome/fascinating, and never a drag to read, and the text is relatively short, though a little boring at points.  The lectures range from funny, to MIND-NUMBINGLY BORING, and weigh heavily towards the latter.  I tended to bring my laptop towards the end of the semester and just go online during lectures..  The worst part of the course, however, was defintely the fact that Pflugfelder showed up for class at least ten minutes late every day!  And sometimes he didn't have a lecture prepared...  I also applied for another class of his and he took more than a WEEK longer than he promised to notify us about it.  You can't rely on this guy.\nI didn't take this class for major cultures, cause I'm an EALAC major, but if you're interested in Japan, this class isn't bad, it's just frustrating sometimes.\nWorkload:\nWeekly postings for section, one quiz at the beginning where you have to draw Japan and label locations in it, one 6-8 page paper on a piece from the Japan section at the Met, midterm, final\n"
        },
        {
            "course_name": "Cultural History of Japanese Monsters",
            "review_date": "May 23, 2005",
            "review_content": "\nThis is the sort of class where you'll get out of it exactly what you put in. The material is absolutely fascinating; readings come from every discipline, from psychology to art history to ancient Japanese folk tales. The class itself was a similar mix, including several EALAC majors, but also students from neuroscience, political science, math, and history. Professor Pflugfelder is also incredibly interested in the subject matter; he once told us, \"I can't believe I get paid to do this,\" and that sort of enthusiasm makes for a more interesting class. That being said, he's also incredibly lazy, so you won't get much feedback on your work, and more than a couple classes wound up being substituted with outside lectures or panels he was speaking at, seemingly because he forgot about the schedule conflict until the last minute. On the one hand, the class is small enough that everyone will notice if you haven't done the reading; on the other hand, nobody seems to care very much. If you're looking for a class to coast through, there are much better ones to take, but if you're genuinely interested, then this class has the potential to do a lot for you.\nWorkload:\nModerate-ish. It's hard to say for sure, because although there's a lot of work, none of it is actually graded on quality. Courseworks postings on the readings for every session, 3 3-4 page papers with general topics assigned due throughout the semester, and a 12+ page term paper on whatever you want due at the end. No midterm or final. If you do all the work by the end of the semester, then you'll get an A-minus; handing in an extra credit 6-page paper makes that an A.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "May 13, 2005",
            "review_content": "\nReadings are very stimulating and interesting.  His teaching style, not so.  He speaks very slowly which is good for notetaking, but he ALWAYS digresses so that he doesn't finish everything on his agenda.  Most of the times we had to stay over for 10-15 minutes for him to jam important info into 5 minutes.  He focused on gender/sexuality and the Tokugawa period since he's an expert in that field.  Lectures aren't all that important since 70% of it are just digressions.\nWorkload:\nA decent amount of reading, a midterm and a final.  A 10-15pg paper, a short presentation during recitation, required weekly recitations that are actually helpful.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "May 03, 2005",
            "review_content": "\nPLEASE PLEASE PLEASE DO NOT LISTEN TO THE NEGATIVE REVIEWS. This is the Major cultures class to take!!! Trust me. Here is my Major cultures class check-off list, and if this is what you are looking for, go for it:\n1. Minimal readings, so-so workload (i mean, the entire core can't be surfaces and knots, but the course textbook is LESS THAN 100 PAGES and written at a 3rd grade reading level)\n2. Lectures are optional, if you read. Reading is optional if you go to lecture.\n3. He is a NICE NICE NICE guy, and really knowledgable, so you'll learn atleast something about japanese history...which is surprisingly interesting.\nSure, he emphasizes gender and sex...but I can think of a lot more boring subjects to emphasize, if he insists on concentrating on one area more than others. Yeah, discussion sections are annoying, but my TA - Steve Wills - was incredible, so just hope for the best.\nTake the class - its the best way around the requirement.\nWorkload:\nDepends on the TA - postings every week on the readings, but they aren't that bad. Midterm and Final and 2 papers aren't bad either.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "January 16, 2005",
            "review_content": "\nDon't listen to the negative reviews. Professor Pflugfelder's lectures are comprehensive. He emphasizes sex and gender, but various other aspects of Japanese history are aptly addressed. I have such an appreciation for the Japanese culture after having taken this class. Pflugfelder's sensitivity to gender issues is quite refreshing in a university environment that sometimes seems stiflingly patriarchal. The readings he assigns are deeply interesting; students too lazy to read them miss out. My TA, Reto Hofmann, was also excellent. He gave helpful comments on papers and led seminars in an organized fashion. Take this class!\nWorkload:\nLots of reading, very reasonable mid-term, very reasonable cumulative final, weekly postings on Courseworks\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "January 10, 2005",
            "review_content": "\nEven though Japanese History is so rich and interesting Pflugfelder does the worst job of presenting such an interesting material. He somehow connects most historical events to gender and you basically miss the interesting part of the class such as Japanese culture and politics. Yes, studying gender is part of the culture but for Pflugfelder Japanese history is all about gender.\nFurthermore, the way Pflugfelder talks just makes you fall asleep in a minute. Taking notes is such a pain since it is hard to follow the pace of Pflugfelder. In addition, he always arrives late and class almost ends around 7.35, which is another reason to fall asleep. I am sure that Pflugfelder knows a lot about Japanese history and culture. However, knowing something is as important as being able to present in an interesting way.\nApart from Pflugfelder, the readings are interesting, especially readings towards the end of the semester. However, there was way too much reading for a 3-point point class.\nThe questions in the midterm are basically a combination of the lectures and the textbook. So, going to lectures may help but you may also be fine by only reading the textbook. However, if you are patient enough I would recommend attending classes and taking notes.\nBasically, I would definitely recommend you taking Jap. Civ. but with some other professor.\nWorkload:\nweekly readings (way too much, just read the textbook) and postings, lond midterm, long final, easy 8page paper\n"
        },
        {
            "course_name": "Japan in the Twentieth Century",
            "review_date": "December 13, 2004",
            "review_content": "\nSigh, this class made me really sad.  I came into the class expecting a comprehensive overview of Japan over the past 100 years.  Instead I got images of umbrellas and a lot of sex.  Pflugfelder decided to show history through images. The problem with that is he never really tells us anything about history.  It's all well and good that the Japanese like to depict their political figures as catfish, but I definitely have no idea who those political figures are, what their importance is, or pretty much about anything relating to history.  The textbook is also extremely dry when it comes to political matters.  It seems like Pflugfelder had very little invested in this class and didn't even attend the last two weeks of lectures.  The only saving grace of this class was the TA, Federico, who was incredibly intelligent and, believe it or not, actually taught us some things about Japan -- in the Twentieth Century no less!  All in all take this class if you like looking at porn from the 1880s, but not if you enjoy something I like to call \"history.\"\nWorkload:\nThe reading is rather heavy but overall the requirements are pretty lax, much like everything else in this disaster of a call.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "December 11, 2004",
            "review_content": "\nWhat a class. A comprehensive overview of Japanese history, civilization and culture until the mid 1900s, the class was never short of fascinating, the readings always engaging, and the lectures incredible. Professor Pflugfelder's vast wealth of knowledge and particular interests -- specifically gendered spaces throughout the different periods of Japanese history -- were the core of a broader narrative that was at once easy and a pleasure to follow. This course was never just a requirement-filler, but I consider myself lucky to have had Plugfelder as the professor. \nThe format of the class -- honking big lecture twice a week, discussion section once a week , coursework postings the night before section -- created a nice balance of information and interaction. \nWorkload:\nCourseworks postings weekly, midterm, research paper (6-8 pages), final, lots of reading every week. \n"
        },
        {
            "course_name": "Cultural History of Japanese Monsters",
            "review_date": "January 20, 2004",
            "review_content": "\nThe best part about this course is it draws a really interesting mix of wonderfully geeky students.  Discussions, while often off topic, were always thought-provoking and interesting.  You'll learn about not only Japanese monsters, but also American and European monsters, and you'll find yourself dissecting your 80s childhood frequently.  Overall a fun course.  Only annoying thing is that Pflugfelder is really spacey.  He tends to end class 10 minutes late on a regular basis - either that or 10 minutes early.  He's very easy to talk into extensions or changing due dates, which can be a bad thing when you realize that he's pushed things so far back that they're all due at once.\nWorkload:\nThere's a HUGE amount of reading, but you don't have to do even close to all of it.  Read some of it, enough to do your twice-weekly online bulletin board posting.  Class discussions are so often off-topic that you can contribute all the time without having read much of anything.  That said, many of the readings are interesting, so if you have time to read them, you'll probably enjoy them.  A few readings (such as Kappa) are essential, but he'll make that obvious during class.  He assigns three short papers and one long paper.  You don't have to take notes as you are never tested on in-class material, but he grades on participation, so it's a good idea to go to class frequently.\n"
        },
        {
            "course_name": "Who Is the Samurai?",
            "review_date": "August 31, 2003",
            "review_content": "\nI have to agree with the previous reviewer--this is one of the best history courses (or courses of any other kind) that I've had.  Prof. Pflugfelder is so relaxed and personable, his interest so genuine, and his knowledge (of course) so extensive that he is a real pleasure to work with.  (He also has a great sense of humor.)  This is not a military history course by any means; there's a bit of that, but the issue of \"the samurai\" is examined from nearly every conceivable angle--sexuality, ethics, legend, economics, law, gender roles, art, literature, film, political formations, major figures, etc.  The course material, which is the most consistently interesting I've read, covers Japanese history from about 500 AD to present day.  Be prepared for lots of visual aids (sometimes too many,) lots of off-the-wall theoretical questions, and lots of discussion.  I don't know why it's not listed as a seminar; it is one.\nWorkload:\nThe work is enough to give you a very thorough understanding without ever overwhelming you.  Plenty of interesting reading (maybe 200 pages per week,)  two 4-5 page papers (there were three on the syllabus, but he agreed to cut out the last one to let us focus on the term paper, when we brought it up,) and an independent research paper on any relevant topic that runs about 15 pages.  Also, one film viewing.  Brief postings before every class.\n"
        },
        {
            "course_name": "Who Is the Samurai?",
            "review_date": "May 14, 2003",
            "review_content": "\nThis is a fantastic courses, one of the most interesting history courses I've had to date and a very rare undergraduate seminar non-seminar. Prepare to go very in depth into the world of the samurai, which is not only exciting and full of swashbuckling but is also a fascinating view of one social class (or mentality, or profession, or what?) throughout Japan's history.\nThe readings are varied in topic and style, and the class topics are designed like a prism to reflect a different view of the samurai each time. The seminar-like atmosphere of a small discussion-based class is lively and offers a chance to sit back or go on for hours as you decide.\nThis year we had the luck to have the class coincide with the 300th anniversary of the Ako Incident, otherwise known as the revenge of the 47 Ronin. Samurai movies and art exhibits opened right after class.\nProf. Pflugfelder is an amazing professor, adept at both lecturing and leading discussions. He's very good at bringing out people's opinions and then rephrasing disagreements as opposing hypotheses. \nHis only downside is that he likes to bring in a lot of pictures to show the class, which eats up discussion time.\nWorkload:\nQuite managable really:  50-200 pages of readings per class either from the books or from the reader, a posting before each class, 2 short papers (3-4 pages) on very loose topics, 1 long paper (15) pages on a topic of your choice, no final.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "December 18, 2002",
            "review_content": "\nThe subject area is interesting. The lecturer, not so much. Pflugfelder's a great guy, and he is knowledgeable and funny about his area. However, his lectures tended to drag on, and we almost never got through what was planned before the end of the class. If you can tolerate dry lectures (interspersed with humor and interesting anecdotes), then what you learn totally makes up for what you suffer. However, beware if you have a tendency to fall asleep during slow lectures. Logistics: The lectures have little to do with what's on the test, and the discussion sections are pretty worthless but necessary. The midterm was based on the reader, and the final was based on the textbook; this may not always be true, but reading both should prepare you for the tests.\nWorkload:\n1 paper, 8-10 pages; midterm and final (ID's and essays, straightforward and graded very fairly)\n"
        },
        {
            "course_name": "Cultural History of Japanese Monsters",
            "review_date": "November 17, 2002",
            "review_content": "\nI loved this seminar course. Professor Pflugfelder is really interesting and fun. While he's not the best lecturer, he's very good at leading and provoking discussions, and he loves to tell funny stories. He talks to you as an equal and respects your opinion, even if he does not agree, which I appreciated greatly. If you ever take a seminar with him, be prepared to discuss the material. The workload is pretty heavy if you don't like lots of readings, but most of them, for this course at least, were very interesting. \nWorkload:\n800-page reader (yikes!), 5-7 paper, 10-12 final paper, weekly webposts\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "December 31, 1999",
            "review_content": "\nThis is a good course for the major cultures requirement. Pflugfelder's lectures run hot and cold, and he tries to infuse them with as much humor as possible. Weekly discussion sections are required and help clarify the material. Pflugfelder is a very easy grader, but watch out for numerous lectures on scat. This is the kind of course that will either turn you into an EALAC major or put you to sleep.\nWorkload:\nMidterm, paper (8-10 pages), final. Weekly discussion sections.\n"
        }
    ]
}