{
    "prof_info": [
        {
            "prof_name": "Daniel Leonard",
            "prof_id": 543,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 22, 2011",
            "review_content": "\nAfter having had Mr. Leonard for a semester of CC, I can agree with the previous reviews--he's a perfectly good CC professor. His classes weren't the kind of thing you rave about, but the kind of class you don't mind attending for four hours a week. He has a relaxed attitude that is friendly enough, and a subtle self-depreciating sense of humor that, on the very rare occasions it appeared, made me marvel at where it had been hiding. Yes, the hours can get long, especially towards the end of each class, but as long as more than two people have actually read the text, the class discussion should have no trouble carrying the day. \nFrankly, there are some CC teachers who ARE horrible. I have had Core teachers so soul-crushingly bad they have made me never want to pick up a book again. I was VERY happy to land in Mr. Leonard's class, and when shopping around for a good CC section, keep in mind that in a pool containing legitimately awful professors, Mr. Leonard is a welcome choice.\nOn a side note, towards the end of the semester I finally realized who he had been reminding me of--he looks just a little like Robert Sean Leonard from House MD. Anyone else? \nWorkload:\nFor my class, he replaced the midterm with a smattering of in-class exercises, such as writing a short comparison of quotes or group work. He called them \"quizzes\" with heavy air quotes. 2 papers. One final, in which there are passage IDs, short writing bit, long essay bit. Normal CC reading load. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 18, 2010",
            "review_content": "\nInitially concerned about having Daniel Leonard after having read old CULPA reviews, I was relieved to find that he was a fine Lit Hum professor.  Lit Hum could have been a much better experience, but it also could have been much worse.  He knows the material well, comes to class well prepared with discussion ideas and specific passages, and though the class drags on for the 2 hours, I did learn a lot.  The workload was manageable - usual Lit Hum reading list, 2 papers, and second semester he added on weekly CourseWorks postings about that week's reading especially vital for the participation grades of those who do not speak much in class.  He is by no means an easy grader, caring more about the nuances and development of ideas in essays than whether or not people can write well, but when it comes to the midterm and final he understands that people cannot write the most beautifully constructed responses given the time constraints and grades accordingly.  \nWorkload:\nLit Hum reading list (with some substitutions of passages he likes better than the ones assigned), 2 papers, midterm (1st semester in class, 2nd semester take home), final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 29, 2009",
            "review_content": "\nI was mortified when I got Professor Leonard as a teacher instead of Elizabeth Amann, who I was preregistered for. This was based solely on the CULPA reviews, which painted a really bad picture of him. We were all predisposed to disliking him because of this, but I had a very positive experience. I'm going to go ahead and assume he has changed in the past few years, so you should really consider the more recent reviews before you freak out.\nHe's laid back, and he's not so caught up in the grandeur of being a core teacher. I even recall one of the older reviews saying he openly states he's not a fan of the core, which I can't validate (I could see it being true though). While Professor Leonard does like to talk and is rather dry, there aren't many ways to teacher these texts in an exciting way. Part of what is supposed to make it interesting is DISCUSSION, something that he is very open to but you have to facilitate. He does not give quizzes, or very many supplementary assignments (we had one). That said, in order to not be bored you actually have do the readings and participate. That's a pretty mature thing to ask of, for all intents and purposes, lazy high school seniors (first semester college, you're not that different) who probably still use SparkNotes, but it's worth it. To me at least, this sort of class is superior to other Lit Hum sections where you mindlessly get a quiz every class...\nLeonard isn't too big on deadlines- they're usually extended and he's pretty understanding with conflicts like sickness or sports. Oh yeah, did I mention he gives Extra Credit? And for the final review he brings Starbucks and to the final he brings snacks... he's a good guy, in that he feeds college students, if anything. It could be that he cares a lot, or doesn't care to the point where he becomes easy-going.\nWorkload:\n-Read.\n-Come to class.\n-Two Essays (don't expect them back in a timely fashion)\n-Midterm\n-Cumulative Final\n-Extra Credit\n-One Page Responses, we literally got only one.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 24, 2009",
            "review_content": "\nLeonard hasn't taught Lit Hum for a few years judging by his most recent Lit Hum Culpa reviews. If you have him, you're lucky.  He might not be the best out there, but you get the full Columbia Core experience from him.\nI don't really know how to compare Lit Hum professors because they all seem to have different teaching styles and different specialties.  Some like to turn every text into a message about women's rights, and some like to strip out the underlying philosophical arguments and spend the whole time analyzing those.  From my point of view, Leonard is a straight up classic Lit Hum professor.  We analyze the prose, characters, ideas, context, and author.  We learn a little about everything.  \nAs some reviewers have said, Leonard likes to go on long speeches about something.  I don't think that is the best use of time during a discussion class, but what he is saying is worthwhile.  I think there is room for improvement with regard to class discussions, but by no means does he discourage people from asking questions and arguing.  \nSometime he brings in supplementary pictures and essays by people that add to the readings.  You aren't required to read them, but they are interesting and there if you really want to delve into the subject.  I think it shows that he really knows the context and impact of each text.  He reads along with us every class ( I think).\nAlthough I've never been to his office hours, I think he has them for several hours after each class at Brownies (the business schools cafe).  \nDon't despair if you get Leonard for Lit Hum!  You will learn and have a good time. \nWorkload:\nReadings (He doesn't add or take away from the generic syllabus)\nTwo essays per semester (Broad prompts that you can change if you want.)\nMidterm (Kinda like the final: Character IDs, passage IDs, and an essay)\nFinal (Made by the department.)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 24, 2009",
            "review_content": "\nLeonard hasn't taught Lit Hum for a few years judging by his most recent Lit Hum Culpa reviews. If you have him, you're lucky.  He might not be the best out there, but you get the full Columbia Core experience from him.\nI don't really know how to compare Lit Hum professors because they all seem to have different teaching styles and different specialties.  Some like to turn every text into a message about women's rights, and some like to strip out the underlying philosophical arguments and spend the whole time analyzing those.  From my point of view, Leonard is a straight up classic Lit Hum professor.  We analyze the prose, characters, ideas, context, and author.  We learn a little about everything.  \nAs some reviewers have said, Leonard likes to go on long speeches about something.  I don't think that is the best use of time during a discussion class, but what he is saying is worthwhile.  I think there is room for improvement with regard to class discussions, but by no means does he discourage people from asking questions and arguing.  \nSometime he brings in supplementary pictures and essays by people that add to the readings.  You aren't required to read them, but they are interesting and there if you really want to delve into the subject.  I think it shows that he really knows the context and impact of each text.  He reads along with us every class ( I think).\nAlthough I've never been to his office hours, I think he has them for several hours after each class at Brownies (the business schools cafe).  \nDon't despair if you get Leonard for Lit Hum!  You will learn and have a good time. \nWorkload:\nReadings (He doesn't add or take away from the generic syllabus)\nTwo essays per semester (Broad prompts that you can change if you want.)\nMidterm (Kinda like the final: Character IDs, passage IDs, and an essay)\nFinal (Made by the department.)\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 18, 2006",
            "review_content": "\nHe is a horrible teacher. He hardly gives drafts and is a harsh grader. He has high expectations in each students and is boring and he keeps in you in the class overtime. But, he doesn't take attendance and he doesn't notice if you don't go to the lectures or his class. He is a very nice guy, but a horrible grader.\nWorkload:\n2 papers and 1 research paper. He doesn't revise papers. \nYour first draft is your final draft\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "November 11, 2006",
            "review_content": "\nProfessor Leonard is a nice guy, but his teaching style leaves a lot to be desired. Class gets a little boring sometimes, seeing as how the format never changes. It's just discussion. \nI wouldn't suggest taking a class with him if you don't like discussion, because he seems to like it a lot. His grading is extremely confusing. He graciously allowed us to do rough drafts of our first papers, and trade with another student for peer reviewal. However, he read only our final drafts, and we didn't get any feedback from him before we received our final grades. Then he had the nerve to say, \"None of these papers were very good.\" We were all less then pleased, both with him and our grades. If you're looking for a professor that seems to go out of his way to help his students, Professor Leonard isn't for you. He also is fond of sending additional assignments over e-\nmail...Everyone's favorite. So, overall, I wouldn't suggest taking Legacy with Leonard.\nWorkload:\nGrade is based 20% on discussion and 80% on three papers.\n"
        },
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "May 03, 2006",
            "review_content": "\nThis class is extremely boring. I recommend staying away. \nThe books were good but the discussion was dead. We tried to save it but there's only so much you can do. His grading standards are puzzling at best. All in all he is a nice guy though. \nWorkload:\nlong reading assignments. 2 papers, prospectus and research paper (with no 1st draft!)\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 05, 2006",
            "review_content": "\nDaniel Leonard is a very mediocre teacher. He does little to incite discussion, choosing instead to completely monopolize class time with tangents that have little to do with the text. His grading criteria is absolutely mysterious, and meeting with him to discuss your paper prior to handing it in will just leave you feeling even more lost and clueless as to what he wants. Ultimately, if you want a positive first year English experience, find a different teacher. He will make you lose faith in the prestige of the University. \nWorkload:\n100 page readings for each class, two mid-length papers, one large research paper\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 01, 2005",
            "review_content": "\nI'm going to give Daniel the benefit of the doubt and say that he has yet to \"grow into\" being a professor. Most of the professors at CU have been teaching for decades while Daniel is still relatively new to the profession. His grading system can be completely illogical. Don't expect to understand your grade (and don't expect practical comments on your rough drafts). I actually thought that Daniel's lessons were well-prepared and I agree that few professors are quite as patient with their classes. I think that Daniel has the potential to be a high-quality professor in a couple of years (so maybe hold off on taking his classes until then).\nWorkload:\nThree essays (not difficult)\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 01, 2005",
            "review_content": "\nI'm going to give Daniel the benefit of the doubt and say that he has yet to \"grow into\" being a professor. Most of the professors at CU have been teaching for decades while Daniel is still relatively new to the profession. His grading system can be completely illogical. Don't expect to understand your grade (and don't expect practical comments on your rough drafts). I actually thought that Daniel's lessons were well-prepared and I agree that few professors are quite as patient with their classes. I think that Daniel has the potential to be a high-quality professor in a couple of years (so maybe hold off on taking his classes until then).\nWorkload:\nThree essays (not difficult)\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 07, 2005",
            "review_content": "\nI can't fault Daniel for the class being boring. It's impossible to make all of that material interesting, especially since nearly everyone in the class has already read at least some of the books. I give him credit for introducing bits of information that I was unaware of, but that helped make the material more clear. He's a better prof than most, but he isn't the best I've had. In short, don't not take a class just because he's teaching it. The guy did his best, it's just my class wasn't particularly interested in the subject matter.\nWorkload:\nSeveral papers, peer editing, LOTS of reading--we read more than the other classes (standard for the class)\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 29, 2004",
            "review_content": "\nDaniel Leonard does not seem to expect much from his students.  It doesn't matter how hard you work, he will give you the same grade.  You can write a review before class or spend time on it and care about what you are writing and you will always get the same grade.  He doesn't care if you attend class or not so most students take his class as seriously as he does.  I did not learn how to write at all.  If you want to learn go to the writing center.  With him there is no hope in learning how to write.\nWorkload:\n3 papers, no mid-term, no final\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 29, 2004",
            "review_content": "\nI hate to admit it, but I did enjoy Daniel's class.  While many of my peers slept straight through the semester, literally sprawled and drooling on the table right next to him, I absorbed quite a few chunks of wisdom from the guy.  He is definitely a teacher that does his homework.  He always came prepared to class with carefully analyzed passages to talk about and often brought up really interesting points I never would have thought of on my own.  With the load of books we have to pack into the semester, who has the time to consider that Homer spares the bard in the Odyssey from murder?  Daniel does the work of careful reading for you.  Although I admit, I had days when I looked at the clock every other minute, I have to give him credit for his well thought out lessons (and incredible enunciation!).  On the other hand, though he brought interesting points to the table, he didnÂ’t do a great job of involving the class in conversation.  He certainly tried by asking us many questions, wanting our view and opinions, but somehow he couldnÂ’t ever start that rousing debate English teachers seek.  If you do speak, he listens carefully, and your point will be acknowledged with an \"excellent\", or at least a \"great\", but in my class, people would rarely contribute.  Oh what patience Daniel had!  He could wait through whole, awkward minutes of silence before he would give up on us answering.  His tolerance was almost maddening at times when half the class wouldnÂ’t show up some days and he wouldnÂ’t say a word, or people would practically fall asleep on top of his notes and he wouldnÂ’t so much as give them a nudge.  He is such a nice guy you should almost feel guilty not taking this class.\nWorkload:\nLight, I hear, compared to other Legacy classes.  We wrote two papers, the ten page required paper for First Year Seminars, and a reaction paper roughly every other week.  As long as you write a mini analytical essay for each reaction paper, Daniel will be happy (single space if you must).  He gives the same grade for every piece of work you turn in, so start off on the right foot.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 20, 2002",
            "review_content": "\nI'l like to put in a good word for Daniel Leonard. As a Lit Hum profesor he might not be brilliant pedagogically and he sometimes asks overly-leading questions. But he's a really nice guy (with great mannerisms=) and a pretty good sense of humor) and knows the material well enough to make connections, provide context, and guide class discussions in useful directions. He's critical of the core, but doesn't bring that into the classroom too much--unfortunately. Daniel's also very accessible and very willing to talk with students individually about their ideas and suggest further reading from cultural critics or post- modernist types. He's in 18th century French Lit, so somewhat removed from the class. However, he knows and likes the material enough to keep the class engaging, and he's just a smart person in general.....so don't despair if you get his Lit Hum section, and transfering into it isn't a bad idea either.\nWorkload:\nA LOT lighter than most other Lit Hum sections. Besides the readings (which, yeah, is way too much) you've got 2 papers (one five pages, the other ten), the mid-term (easy) and the standardized final. there are weekly postings on courseworks, but i'm not sure how much he really cares about that. He takes the class seriously, but not seriously enough to really make it tough.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 20, 2002",
            "review_content": "\nI'l like to put in a good word for Daniel Leonard. As a Lit Hum profesor he might not be brilliant pedagogically and he sometimes asks overly-leading questions. But he's a really nice guy (with great mannerisms=) and a pretty good sense of humor) and knows the material well enough to make connections, provide context, and guide class discussions in useful directions. He's critical of the core, but doesn't bring that into the classroom too much--unfortunately. Daniel's also very accessible and very willing to talk with students individually about their ideas and suggest further reading from cultural critics or post- modernist types. He's in 18th century French Lit, so somewhat removed from the class. However, he knows and likes the material enough to keep the class engaging, and he's just a smart person in general.....so don't despair if you get his Lit Hum section, and transfering into it isn't a bad idea either.\nWorkload:\nA LOT lighter than most other Lit Hum sections. Besides the readings (which, yeah, is way too much) you've got 2 papers (one five pages, the other ten), the mid-term (easy) and the standardized final. there are weekly postings on courseworks, but i'm not sure how much he really cares about that. He takes the class seriously, but not seriously enough to really make it tough.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 20, 2002",
            "review_content": "\nI'l like to put in a good word for Daniel Leonard. As a Lit Hum profesor he might not be brilliant pedagogically and he sometimes asks overly-leading questions. But he's a really nice guy (with great mannerisms=) and a pretty good sense of humor) and knows the material well enough to make connections, provide context, and guide class discussions in useful directions. He's critical of the core, but doesn't bring that into the classroom too much--unfortunately. Daniel's also very accessible and very willing to talk with students individually about their ideas and suggest further reading from cultural critics or post- modernist types. He's in 18th century French Lit, so somewhat removed from the class. However, he knows and likes the material enough to keep the class engaging, and he's just a smart person in general.....so don't despair if you get his Lit Hum section, and transfering into it isn't a bad idea either.\nWorkload:\nA LOT lighter than most other Lit Hum sections. Besides the readings (which, yeah, is way too much) you've got 2 papers (one five pages, the other ten), the mid-term (easy) and the standardized final. there are weekly postings on courseworks, but i'm not sure how much he really cares about that. He takes the class seriously, but not seriously enough to really make it tough.\n"
        }
    ]
}