{
    "prof_info": [
        {
            "prof_name": "Gavin Steingo",
            "prof_id": 10950,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "August 09, 2011",
            "review_content": "\nI loved this class! Which is pretty amazing given that I came into it with no musical knowledge at all and was dreading being so far out of my comfort zone. From the outset Gavin was enthusiastic and interesting, but more importantly he really knew his stuff and was able to communicate his knowledge in ways that even those of us with no musical background could easily understand. He also managed to push me just hard enough that I felt like I learnt a lot, but without making it an overly stressful or painful experience. \nAdmittedly, as the other reviewer said, the format of the class may not be ideal for those who already have a reasonable amount of musical experience (although I spoke to several who were keen musicians and loved it), but this is really not Gavin's fault. The class is made up of such a mix of people, backgrounds and abilities that it is just impossible to meet everyone's needs perfectly, and maybe this is something that the core department as a whole needs to look at. Given the material Gavin had to cover, however, and the mix of people he had in the class, I think he did a fantastic job. \nIn terms of workload, the class was very manageable. One short essay (analysing a rendering of the Orpheus myth) and one opera report. Both were explained clearly and graded fairly. Gavin was also always available in office hours and via email to give help or advice if needed. There was also a midterm and a final, both of which were fairly straightforward. Sure, some of the questions were on extra musical material, but Gavin warned us about that several times in class, and also provided us with a list of topics to focus on, sample questions and brief style guide. I basically listened to the pieces until I felt I could recognise all the major themes and events, read the assigned chapters carefully, re-read my class notes and came out with an A+. Don't get me wrong - I worked hard and this was not an easy, mindless class, but I found the directions clear, and the grading fair. And, perhaps more importantly, I now have a playlist of beautiful works I actually know something about and a desire to expand that list further.\nIf you get the chance - take this class. You won't be disappointed!\n\nWorkload:\nOne short essay, one opera report, couple of short listening tests, midterm and final - very doable.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 09, 2011",
            "review_content": "\nI'm still not entirely sure what to make of this class.\nSome if it's frustration with the curriculum: as someone with a (fairly limited) musical background I found all the baby-talking we had to do around ideas like keys and chord progressions to be incredibly annoying. Likewise the emphasis on \"extra-musical material\": I did not imagine myself cramming for the final exam by trying to memorize the names of the soloists in the premier of Beethoven's 9th or the name of the theater in which the \"Sacre du Printemps\" was first performed. Nor, for that matter, the profession of the individual who played Euryidice in Monteverdi's \"Orfeo\", the identity of Berlioz's love interest, or any of the other useless minutiae we were forced to learn in this class, and which contributed exactly nothing to my understanding of the music.\nSome of it's confusion about the format: participation counts for 20% of our grade (enough for him to assign everyone basically whatever grade he feels like); but opportunities for participation were so limited that the class got used to remaining silent: when a guest instructor came in to talk about jazz and asked questions, the class just sat there with its collective jaw hanging open.\nAs for Gavin himself, he's goofy, cheerful, and friendly. (He's also utterly tone-deaf, which is sort of endearing). I really think he means well, and I really want to like him. But then he does things like putting an ID on the exam which he explicitly said wouldn't be tested, or assigning an essay that has nothing to do with music.\nAs Heinlen says, \"never attribute to malice that which is adequately explained by incompetence.\"\nWorkload:\nPretty light: an essay, a concert report, a handful of little responses and quizzes that go into your participation grade. Two exams, both more irritating than difficult.\n"
        }
    ]
}