{
    "prof_info": [
        {
            "prof_name": "Jason Oakes",
            "prof_id": 5676,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Rock",
            "review_date": "May 22, 2009",
            "review_content": "\nReviewer below me was way harsh, but his fundamental argument is right: Oakes is not a good lecturer, and this class was disappointing. I P/F'ed it thinking that it would be awesome and that i couldn't pass up the chance since this was the first time the class had been offered in my four years here. the readings (of which there were waaaaay too many) were great, the lectures were sleep-inducing. He cannot form a coherent sentence, tends to ramble, and makes it incredibly difficult to take notes. oakes himself is a nice (if dorky) guy (he even plays bass in a band that sounds like REM and Guided By Voices put together! how rAWK!), but nice personality does not a good class make.\nskip this one. if you want to know arcane details about the led zeppelin II recording sessions, read about it on wikipedia - you'll learn more.\n\nWorkload:\nabsolutely ridiculous, and tests are largely based on reading (both by design and because his lectures are so incoherent)\n"
        },
        {
            "course_name": "Rock",
            "review_date": "May 20, 2009",
            "review_content": "\nSo Professor Oakes is definitely up there on the list of worst lecturers, but the syllabus he put together was really good. Going to class was basically torturous, and he takes attendance, so you better drag yourself to class or have someone sign you in. You actually have to do alllll the reading he assigns, but it's best to do it right before each test, since you are basically reading aimlessly otherwise. Before each test, he gives study guide questions based on the articles that are really helpful. His tests are really straightforward. but extremely long. He is a nice guy just boring in lectures because never says anything. The readings are really great though. Almost all of them are really interesting. He chose a lot of REALLY random songs to discuss, but that is mostly because he wanted to introduce the class to music that we hadn't heard before. Overall, a pretty harmless class with really boring lectures. Bring your computer and go online to entertain yourself or something. He also blasts the music and if you didn't have a head ache coming into class, you will leave with one...\nWorkload:\n3 tests (not cumulative-last one is called a final, but it's not cumulative and counts for the same percentage as the other 2), a bunch of graded response papers, lots of reading, a 6-8 page final paper. \n"
        },
        {
            "course_name": "Rock",
            "review_date": "April 06, 2009",
            "review_content": "\nWORST class I have ever taken at this college.  The subject of the class is rock music, so clearly the subject is not to blame for this miserable experience.  Clearly, the X-factor in this equation is Professor (and I use that term as lightly as possible) Oakes.  After the first day of class where he promised a discussion format, he set off on a semester long power trip filled with lengthy, boring, and often flat out wrong lectures.  The only good parts of the class were when Oakes stopped his flapping bald head long enough to play rock documentaries like \"Don't Look Back\" and \"Gimme Shelter.\"  Oakes is the type of guy who thinks he knows a lot about music but since he is pushing 40 and completely out of touch (and a little bit pudgy) he is the opposite of \"cool,\" and therefore has ZERO clue what he is talking about.  I am sure he loves going to bars around Columbia talking to geeky grad students about Yo La Tengo, but that in no way gives him the right to teach a class about rock music.  If Oakes' terrible teaching style, awful wardrobe (black shirt, solid color tie, black jeans--wow he's so dark, minimalist, and rock oriented), and overall off-putting demeanor are not enough to deter you from taking this class, just take one look at the work load.  By far the heaviest reading, writing, and test work load I have taken at this school.  I guess all this is why Oakes always said rock is based on contradictions and irony--it sure is contradictory and ironic that Oakes was able to make a class about music so miserable.  Professor Oakes tested my love of rock music, but more importantly, he made me lose my faith in humanity. \nWorkload:\nINSANE... endless readings for each class, 3 difficult tests (difficult because he asks obscure and inane questions), 3 five page response papers, and a 10 page term paper... (not kidding)\n"
        }
    ]
}