{
    "prof_info": [
        {
            "prof_name": "Bruce Robbins",
            "prof_id": 744,
            "total_reviews": 33
        }
    ],
    "reviews": [
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "May 27, 2014",
            "review_content": "\nDo you like to read?  I know that prior to the first day of this course, I hated reading whether it was for fun, or analytical purposes.  However, the selection of novel's that construct the syllabus, combined with the often hilarious lectures opened up a whole new outlook on the act of reading and analyzing.  With a heavy load of reading (13 Novels), the Professor and TA's managed to select novels that will keep you entertained the whole semester.  \nIn short, awesome course, awesome Professor, and  awesome TA's.\nWorkload:\n1 Novel/week\n2 Papers\n1 Final\nPop Quizzes\n"
        },
        {
            "course_name": "Studies in Narrative Fiction",
            "review_date": "December 25, 2010",
            "review_content": "\nI've never taken a lecture with Professor Robbins, but given previous reviews, perhaps he's best in that setting.  In a seminar setting, he takes far too laid back an approach, offering no structure to the discussion or even attempting to stimulate it with a introductory question or topic.   Instead of leading the discussion or presenting his thoughts on the text, Professor Robbins would make some very broad comments and then turn it over to the students.  The students, in turn, could either attempt to respond to something that he had obliquely alluded to or go off on their own tangent. Sometimes these tangents were interesting and even relevant, sometimes not.  But the way Professor Robbins responded, or rather failed to respond, to what students said was the most frustrating aspect of the class. To have a seminar in which the professor opts not to lead the discussion ostensibly in favor of the input of students and then have the professor not engage with much of what the students say leads to a very disjoint, unsatisfying and ultimately unproductive discussion. \nI mean that all said, Professor Robbins is a very charismatic professor and of course has a million insightful things to say about the books he assigns - all of which are stellar.  As has been said, the seminar setting doesn't seem to be the ideal platform for him.  Also it was frustrating that he'd refer to lit theory without actually assigning any of it. But that's a common English prof flaw, I guess.  \nWorkload:\nweekly response papers - not graded.  final paper. \n"
        },
        {
            "course_name": "Studies In Narrative",
            "review_date": "December 21, 2010",
            "review_content": "\nIt's a shame that Professor Robbins isn't taking the time to read and learn from the reviews posted here, which I think are generally on target in their criticism: Robbins is obviously intelligent and has so much potential to be a mind-blowing Professor, but his obvious laziness made each seminar devolve into disconnected and shallow bantering amongst students. He failed to lead our discussions at all, and the most he would try to provoke or steer them would be to ask something along the lines of, \"Can someone say something about this scene! I mean, look at this scene!\" and then look around with incredulity that no one would reply. He also seemed obsessed with one particular idea (which he mentioned he's writing a book on) and would bring it up during EVERY. SINGLE. CLASS, even if connections were at best tenuous. To make things worse, he never assigned or explained this idea in depth, so the class ended up being split between those who would roll their eyes at its mention, or sycophantly try to latch on to it without knowing what they're talking about. Professor Robbins is actually a really nice, warm and funny man with a great personality, but unfortunately no amount of personality is enough to make up for not actually caring. \nWorkload:\nmidterm and final paper\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "June 07, 2010",
            "review_content": "\nClass was easy as balls, books were chill, papers were extremely hard to do 5 hours before they were due (but manageable), final was chill sauce. I was expecting a lot of hot chicks to be in this class, didn't work out that way, only complaint. Other than that this class is chill and the classroom chairs are soft.\nWorkload:\n6 or 7 easy to read books, 2 papers and final\n"
        },
        {
            "course_name": "Modern Comparative Fiction, The Big Ambitious Novel in Contemporary America",
            "review_date": "May 18, 2007",
            "review_content": "\nI had Professor Robbins for a lecture in the fall, and I was a little disappointed in his class. Don't get me wrong; the syllabus was fantastic (he always chooses such wonderful books), but it seemed like he was sometimes straining to fill the alotted hour and 15 minutes. That said, his analyses were often very thought-provoking and articulate, and he has a great personality complemented by an offbeat sense of humor (even when he misfired). So I decided to take an American novel seminar with him, and I'm really glad I did. It turns out he is fantastic with a smaller group of students: he leads discussions very well, raises good questions that cut to the heart of the text, and does a good job of encouraging everyone to participate. He introduced me to several books that have since become my favorites, and he was very easy to get in touch with outside of class, whether via e-mail or during office hours, to discuss various assignments. He directed the class very well, and he was good at quickly evaluating which topics were producing quality discussion and which were not. I learned so much from him in seminar, and I recommend that you take one with him if you get the chance. (And if you get the chance to take a lecture with him, you should also do that, keeping in mind that he's somewhat weaker in that format.)  \nWorkload:\nFor the lecture, two short papers and a final that was curved (who curves in a humanities class?). For the seminar, weekly responses and a final 10-15 pp. paper. He's a very fair grader, and his comments are helpful, if sometimes a little sparse. \n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "January 02, 2007",
            "review_content": "\nI say this as a senior English major: Robbins' class was the biggest disappointment in my college career. His lectures left me more often than not uninspired and uninformed. They linked disparate ideas without logical rigor, stopped short of concluding anything with any determinacy, and misunderstood the literary intelligence of his audience (in both directions). Half-hearted doesn't do him justice, but he never seemed to take his job with more than three-quarters interest: always ending early, starting late, canceling class, even answering his cellpiece once (the wife) after stopping with mock annoyance every time someone's ringtone blew up. Plus there was this streak of what I perceive as faint arrogance and overestimation of self, exemplified by his overuse of bad metaphors and remarks which he intended as levity but fell completely unfunny. I got no beef with edutainment so long as it does at least one or the other; Robbins does neither.\nTo be fair, he does a ok job in the grand scheme of all professors everywhere, and I did like some of his ideas. But such a great reading list deserves better. One should expect a higher perception of being correct/relevant and a more serious intellectual environment from a generally stellar Columbia literature faculty. That environment, by the way, includes flocks of assclowns, AIM addicts, overassertive or somnolent lifelong learners, and GS students (not the chill ones, the garrulous nitwits). Why anyone with any literary gumption would take this class over another Columbia offering is beyond me--well, except for that\nWorkload:\nit's easy as balls.\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "January 01, 2007",
            "review_content": "\nDon't let the fancy sounding name and great reading list fool you. Bruce Robbins is a terrible terrible lecturer. Every time I went to class, I felt like I was listening to Charlie Brown's teacher speaking. I probably got more out of the sparknotes I read to study for the final than from his lectures. If you want to have a meaningful experience as an English major, take a class with Nicholas Dames (he usually teaches 19th Century Literature) or Molly Murray. \nMaybe his inability to speak without rambling on about irrelevant sources or topics could be excused if he were a nice guy. Unfortunately, he is also not a nice person. In Bruce Robbins' head, he is the Brad Pitt of the English department, maybe of the world. Who else writes \"No Kidding\" next to a point on my friend's essay after a re-grade?\nAnd lastly, I bet you that \"vectors of desire,\" a phrase he loved to throw around in every single class, means absolutely nothing. And yes, I'm pointing my vectors of hatred at Robbins. \nDON'T TAKE THIS CLASS. If you're looking for something to boost your GPA, this is not the class you want to take. If you're looking for a meaningful experience, this is not the class to take. Basically, I don't care who you are or what you're looking for, this class blows. \nWorkload:\nVery good reading list. Get it off the English department website and read them over the summer on the beach. Just 2 papers graded by TAs who think they are Bruce Robbins and a final with IDs and an essay question.\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "December 27, 2006",
            "review_content": "\nWhile Professor Robbins has accomlished works on literary criticism like  \"Feeling Global\" and \"Cosmopolitics\", his lectures tend to meander to fruitless comprehension.  Many of the books on the reading list need further examination than what Robbins offers.  Gone are the examinations of themes, extensions of modern day relevance, and character analysis; rather, Robbins places emphasis on cherry-picked snippets of text and examines them with deft analysis.  However, the books he selects need more than this.  For example, Midnight's Children is probably one of the most dense books of the 20th century, but he spent three classes on it (and ended each class 25 minutes early).  He spends most of the class shouting about how you have to read the book because it will be on the exam, but then he spends less than half the class speaking about anything noteworthy in the author's intensions or anything laying within the subtext.\nYes, the papers are graded very easily.  Yes, you don't have to work very hard in this class; but it was incredibly disappointing that we ended with Sebold's The Emigrants, when he gives us a 600 page novel like Midnight's Children during mid-terms AND a paper due in his class.  His final was easy from my perspective, but he did end up grading on a curve based on what he claimed were hard identifiers.  If you take literature seriously, I don't recommend this course.\nWorkload:\n2 papers (5-7 pages each), 1 Final.  Easy grading.\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "May 19, 2006",
            "review_content": "\nIt appears that Professor Robbins doesn't need another gushing review, but I assure you, he does.  Not only is he an easygoing, funny, inspiring, and magnetic man-- his course is actually good too.  His lectures are insightful, provocative, and worthy of standing side-by-side with the class' phenomenal syllabus.  The texts are top-notch, but had someone handed me them to read on my own, my experience would have been maybe half as good as what I got out of Robbins' course.  It's easy to forget how enjoyable reading can be when it piles to unseeable heights during a semester; Bruce Robbins' class helped me remember.\nWorkload:\nA book per week, except for the two longer ones, which each get two weeks.  2 papers (graded by TA's so it's luck of the draw in terms of an \"easy A\" or not) and a very fair final.\n"
        },
        {
            "course_name": "Modern Comp Fiction - Spring 2004",
            "review_date": "October 30, 2005",
            "review_content": "\nI'm a GS student and I found this class to be one of the best classes I've ever taken.  The reading list is sublime, and Robbins' lectures almost always gave me that thrill that comes from having my perceptions challenged and my critical faculties engaged.\nI left class twice a week with more ideas dancing in hy head than there had been when I went in.  For me, that is the mark of a successful class.\nIf you don't believe art and literature are vital, as necessary for life as food, shelter and medicine...you might hate this class.\nIf, however, you tend to swoon over exquisite writing, and you yearn for something more from your lit classes than the merely literary, you may love this class as much as I did.\nWorkload:\nIn class MT (ID's, not too challenging), 2 short papers (challenging, but fairly graded), Final Exam.  \n"
        },
        {
            "course_name": "Comparative Modern Fiction",
            "review_date": "September 08, 2005",
            "review_content": "\nThis had to be the most rewarding class I'd taken at Columbia. Prof. Robbins teaches with passion and is genuinely concerned about getting his students to read the books. This class also had the best syllabus with novels ranging from Midnight's Children to The Lover. Sometimes lecture can get slightly boring, but everything considered, this class was great. \nWorkload:\na few essays, mandatory discussion sections, a not so easy midterm which was eventually curved, and a final. \n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "May 08, 2005",
            "review_content": "\nYou will leave this class every day wishing two or more of the following:\na) the lectures were longer and every day\nb) Bruce Robbins would adopt you\nc) Bruce Robbins would marry you\nd) you were Bruce Robbins\nIn my three years at columbia, this was the only class that actually inspired me to really learn.  While the reading on its own is pretty awesome, I guarantee you will be less than impressed with at least one or two of the books when you read them.  However, when you come to class and listen to what he has to say about them, you'll want to go back and read them again and again.  Even though he's incredibly self-aware and some might say acerbic, he's really nice, isn't hard on anyone AT ALL and almost tries to put himself on the same level as students by constantly poking fun at himself.  I actually looked forward to going to section and writing the papers (seriously, no joke), which is definitely a first for me.  And to top all of this, the class is pretty easy.  I've taken classes with most of the other \"great\" professors in the English dept, and Robbins definitely blows them all out of the water.  Please don't graduate without taking this class, it will teach you things about the world we live in now that you won't get from any other class.\nWorkload:\nThis class really isn't hard and you'll look forward to doing the reading (I know it's hard to believe, but it's true).  The reading isn't that heavy and goes by really quickly because all of the books are enjoyable at a really superficial level as well as on a deeper level.  There are also 2 papers (topics are really interesting & easy grading), an EASY EASY midterm & final testing basic plot and character facts (they each take under an hour to finish).\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "May 08, 2005",
            "review_content": "\nI won't speak for lit majors, but I highly recommend that non-majors avoid this man. \nThis is especially true for GS students who think this might be an easy way to get through the lit requirement. It isn't.\nRobbins is, without a doubt, the worst public speaker of all the teachers I've had at any school I've ever attended. Perhaps he's better in small groups, but this man has no business standing in front of 100+ people and speaking for an hour and fifteen minutes. He seems convinced that he's got a lot of important things to say, but he's never able to connect them into any sort of meaningful arc over the course of a lecture. In the end, he seems to string together lots of statements that are recited more to prove how important his theories are than to provide us with any kind of useful information.\nPerhaps I'm too used to the sciences (both social and physical), where statements are either supported or disproven by facts. I have no doubt that Robbins is a briliant author of criticism, but that doesn't make him a good lecturer.\nIn the end, Robbins seems to think that everyone in the room is a masters student, and that he can use terminology that will only be familiar to people who are already on the road to advanced degrees in Literature. He would probably be disappointed to find out that the class had at least a couple of dozen GS students who had no intention of being Lit majors, let alone pursuing an advanced degree.\nThe most offensive part was when he flat out lied about the midterm. He told us very specifically that there would be identifications on the midterm, and that he would ask us to match specific characters with the book they'd come from. He then gave a midterm in which he gave a list of identifications for each book, expecting us to be able to explain the place of each similarly named character within the book. Of course, everyone did poorly, since he'd told us to prepare for an entirely different exam.\nThere has got to be a better way to get the GS lit requirement out of the way for non-lit people...\nWorkload:\n2 papers, both 4-5 pages, based on questions that really don't yield more than a paragraph or two of well written text.\nMidterm exam that covers far more detail than Professor Robbins told the class to expect.\nFinal, identifications with essays.\n"
        },
        {
            "course_name": "Backgrounds to Contemporary Theory",
            "review_date": "May 11, 2004",
            "review_content": "\nThis class should be entitled Â‘Welcome to RobbinsworldÂ’ or Â‘Being Bruce Robbins.Â’ The reading list is top notch, but the texts arenÂ’t really considered for their own value so much as they are shown to be the building blocks for RobbinsÂ’ Meta-narrative/Master-Plan. As has been noted before, this plays right into the hands of the Robbins groupies who eat it up like candy. To the rest of us tourists, the class is a great introduction to the mind of one of AmericaÂ’s top wannabe public intellectuals. You will, without at doubt, be swept up in Robbins charisma. At that point itÂ’s up to you whether you want to leave the fun house or become a Mouse-keteer. Who knows which is better. YouÂ’ll just have to take the class to find out.\nWorkload:\nTwo papers, 6-8 pages each which may or may not really have anything to do with the reading list. A final, which was canceled due to the TA strike.\n"
        },
        {
            "course_name": "Backgrounds to Contemporary Theory",
            "review_date": "May 07, 2004",
            "review_content": "\nProf. Robbins is wonderful.  This is my second class with him, and the experience was great.  I was rather underqualified for this course, so I was prepared for much of the material to go over my head, but Prof. Robbins' lectures manage to make the dense philosophy clear and comprehensible without oversimplifying it.  He is passionate about his teaching, academia in general, and his scholarly pursuits, and he integrates his own research projects into the class without taking the focus away from the material itself.\nA self-effacing and kind person, he is always available during office hours and by email to any student regarding any topic.  Best of all, he has a great sense of humor, which makes lectures far from boring.  Be original in your essays; he loves ideas he hasn't heard before and is legitimately supportive of dissenting opinion (he is what other professors pretend to be: be open to opposition).\nWorkload:\ntwo 8-10 page papers, no midterm, final is usually canceled or is easy.\n"
        },
        {
            "course_name": "Backgrounds to Contemporary Theory",
            "review_date": "April 19, 2004",
            "review_content": "\nHe's good.  There's no doubt about that.  The texts are hard, but he's smart and personable so, violia, a good lecturer.  This class will fill all the holes CC left open, which in my case was about the size of the grand canyon.  But instead of creaming my pants about him like the other reviews, let me tell you about a few more interesting details.  The first two rows of the class are filled with eager hipster students, mainly girls, that lead up the bruce robbins fan club.  I wouldn't be surprised if they painted 'love me' on their eyelids like in Indiana Jones.  They do love him.  If that isn't entertainment enough for you, either sickening or enthralling, Robbins himself is a character and a half.  He read his first Sartre at 15.  Need i say more?  Academia is this man's life, and no one is better suited for it.  His witty arrogance is endearing.  One day he wore this crazy asian kimono/dress suit thing to class.  It looked ridiculous, but i'll bet he felt like a pig in shit.  I don't know what that was trying to tell you, but just take him for christ's sake.  he's the closest thing you'll get to an intellectual celebrity in the english department, and he's the best lecturer i've come upon.  And do love him.\nWorkload:\nTwo papers.  Supposed to be an exam, but TA strike nixed that one.  The papers are challenging in that in order to write them you must have read and the reading is challenging, so you put it together.   Fair grader, and by fair i mean he was schooled at harvard so he knows how to give a's.  wa-hoo.\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "January 20, 2004",
            "review_content": "\nUnlike most reviewers, I found this class rather disappointing.  While the syllabus really is great and covers a nice batch of authors, Prof. Robbins gave little insight into the material.  He relied on the same themes and interpretations for practically every novel, making lectures very uninspiring and superficial.  To me, the strength of the course lies in the strength of the syllabus--not in Robbins' weak  and obvious analyses.  Also, beware Robbins' arrogance and the kiss-ups that eat up class time....My advice is to get the syllabus and read the books on your own.\nWorkload:\ntwo short papers, two exams (IDs mostly)\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "January 05, 2004",
            "review_content": "\nProfessor Robbins is one of the most wonderful PEOPLE I have ever known. He is passionate, brilliant, kind, witty, and inspiring. I eagerly looked forward to each lecture. The assigned books are amazing. I have already recommended the entire syllabus to a lot of my friends! I am currently reading other books by the same authors. Please  take a class with Professor Robbins. I assure you that this decision will be the best one you ever make. \nWorkload:\nTwo papers, a midterm, and a final\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "November 13, 2003",
            "review_content": "\nThis course is fabulous.  The readings are great and his lectures are engaging.  He is a very smart, entertaining professor.  It is easy to do well in this class.  For the papers he just wants you to take one of his ideas from the lecture and prove it basically and you will get a good grade (providing you don't suck at writing).  Enjoy!\nWorkload:\nNot bad at all. 2 short papers that are easy to write as he gives you obvious, midterm (that he cancelled in my class, yay!) and final (easy if you've done the readings).  \n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "May 09, 2003",
            "review_content": "\nTAKE THIS MAN'S CLASS.  Prof. Robbins is that rare professor who can let his scholar and teaching careers feed into each other while not expecting his students to immediately publish in the New Yorker.  He has a great sense of humor which makes the long lectures much more bearable, and his syllabus is very reasonable.  You'll enjoy the selections, too, of which there is a wide variety of non-American (and mostly non-\nWestern) authors.  Grading is fair although sometimes done by the TAs, but he generally picks good ones who grade the way he does.  Try to read most of the books because the lectures are boring and make no sense if you don't, but are really interesting and packed with info if you do.  Professor Robbins is so great that I'd reccommend taking any class that he's teaching.\nWorkload:\n2 5-page papers, 1 midterm (sometimes cancelled) and final exam.\n"
        },
        {
            "course_name": "Intro to Literary Theory",
            "review_date": "December 25, 2002",
            "review_content": "\nI just want to echo the previous positive reviews. Robbins has an amazing command of the material and his ability to explicate is wonderful. Some of the writers we read are nearly incomprehensible, but Robbins made them lucid and interesting. He does really interesting intellectual history and goes off on a lot of tangents, which are interesting, especially if  you have a general interest in theory. Friendly and inviting in office hours and seems to genuinely care about students and the material. Some of the theories we do in class are incredible and may just change the way you think and live. The only negative side were the papers, which were somewhat boring topics. Otherwise, highly recommended\nWorkload:\nLight reading. 20-60 pgs/week. 2 papers, 5-7 pgs, midterm final. \n"
        },
        {
            "course_name": "Intro to Literary Theory",
            "review_date": "December 06, 2002",
            "review_content": "\nThis is the best class IÂ’ve ever taken. Robbins is brilliant, self-effacing, inspiring. Go into it with an open mind, listen hard, do some reading, go to office hours, do some thinking. It will change the way you look at the world.\n"
        },
        {
            "course_name": "Victorian Novel (6000)",
            "review_date": "December 05, 2002",
            "review_content": "\nThis seminar was filled with some of the brightest graduate students in the department, all attracted to Robbins's challenging theoretical methods and command of material. This was an excellent course that has substantially changed the way I consider history. The only criticism I have is that Prof. Robbins's comments on our final papers were disappointingly sparse and general. In fact, upon comparing endcomments, some students found that Robbins had used the same phrases.\nWorkload:\nWeekly two-page response papers, final 20-25 page paper.\n"
        },
        {
            "course_name": "Intro to Literary Theory",
            "review_date": "November 25, 2002",
            "review_content": "\nMan, is Professor Robbins pretentious, but he's so damn cool anyway! Theory's his thing and he obviously loves it, but sometimes it's hard to tell what he's getting at. He tries really hard to make us understand him, but sometimes he's a little scattered. But any class with him is worth taking. And he puts together a hell of a reading list.\nWorkload:\nMidterm, final, 2 five-page papers. Not bad at all.\n"
        },
        {
            "course_name": "Intro to Literary Theory",
            "review_date": "November 24, 2002",
            "review_content": "\nBruce Robbins is the best professor I've had at Columbia. In his Intro to Literary Theory class during Fall 2002, he didn't seem to have any of the problems mentioned in earlier reviews. After trying to have an open discussion the first day of class, he quickly realized that he would have to give lectures and then did the class as a lecture course from then on. He did allow for questions and comments, but not too much. And it's a good thing because his ideas were far more interesting than those of the people in the class. He really knows his stuff and really helped me understand the big names in literary theory. I highly recommend this class to any English major.\nWorkload:\nNot too bad. A midterm, a final exam and two short (5-7 pg papers)\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "January 06, 2002",
            "review_content": "\nIf I'm not mistaken, Robbins will be on sabbatical next semester and then will be joining the faculty full time for the 2002-03 school year. The course reading was fantastic, and he demonstrated that he sure knows his shit during the lectures. Unfortunately, he allows far to much discussion, especially given that in a 110 person lecture, there are bound to be quite a number of ass-clowns. Also, he puts up a guise of false modesty, in which he assures the students that they're all geniuses and learns so much from them and they always beat him to the point. It was frustrating to hear him--a rather smart guy and, after all, the only one in the room with a PhD in literature--falsely prostrating himself before students. I rather enjoyed his analyses, but it's worthy of note that the course definitely has a postcolonial timbre if you're into that.\nWorkload:\nTwo papers (decent analyses will earn you good grades), a midterm and a final (do the reading--the tests are almost all IDs of this or that character or event).\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "January 06, 2002",
            "review_content": "\nIf I'm not mistaken, Robbins will be on sabbatical next semester and then will be joining the faculty full time for the 2002-03 school year. The course reading was fantastic, and he demonstrated that he sure knows his shit during the lectures. Unfortunately, he allows far to much discussion, especially given that in a 110 person lecture, there are bound to be quite a number of ass-clowns. Also, he puts up a guise of false modesty, in which he assures the students that they're all geniuses and learns so much from them and they always beat him to the point. It was frustrating to hear him--a rather smart guy and, after all, the only one in the room with a PhD in literature--falsely prostrating himself before students. I rather enjoyed his analyses, but it's worthy of note that the course definitely has a postcolonial timbre if you're into that.\nWorkload:\nTwo papers (decent analyses will earn you good grades), a midterm and a final (do the reading--the tests are almost all IDs of this or that character or event).\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "December 19, 2001",
            "review_content": "\nThe man knows how to assemble a good reading list (he included Ishiguro, Ondaatje, and Rushdie, among others). That being said, it often seemed to me that Prof. Robbins was more interested in discussing the socio-political aspects of the texts rather than the literary merit/storytelling techniques. I would have preferred the latter, but hey. FYI-- there was an absurd number of Lifelong Learners in my class. Beware.\nWorkload:\nTwo easily graded papers, a midterm, and a final.\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "December 03, 2001",
            "review_content": "\nI agree with the previous poster that most people enjoyed the class. But the class is basically the reading list. You could have another professor teaching the same class and people would still enjoy it because the books are so good. I'd say Robbins is not bad but the course was good because the books were. In response to the previous review, it's the professor's decision to cap or not cap enrollment so I don't see how the registrar is to blame. I think rather it's Robbins' inexperience with Columbia. Further, something that is commonly done isn't necessarily right, or even fair. We're all used to shitty professors at Columbia; does that mean they're supposed to be shitty or it's alright to be shitty? Although a junior myself, I personally agree with the other poster. In this case it's fairer to remove people according to registration time because I know a lot of juniors and seniors just saw the reading list and the hype and signed up for it as a \"fun class.\" And they were right; it's really a fun class.\nWorkload:\nok\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "December 02, 2001",
            "review_content": "\nIt shocked me to see such scathing reviews of this professor--everyone I have talked to genuinely enjoys this class, and not just the amazing reading list. Robbins has strong opinions about the texts but doesn't dismiss students' comments. Although he sometimes gets distracted by post-modern criticism and forgets about the book as a whole, in general the essays he bring up are relevant and interesting. (In response to the previous review, it's unfair to criticize him for not capping registration: this is nearly always the fault of the registrar, not the professor, and also, it's by no means unheard of that seniors get first choice at popular classes.)\nWorkload:\nA book a week (that you'll really want to read), two 5 page papers, and insanely easy midterm and final (just to make sure you've done the reading). Not hard at all.\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "November 14, 2001",
            "review_content": "\nThis is not a really a course review; I'm just disappointed at what this professor did. Read on if you're interested. As one of the reviewers said, this class has an extremely lucrative reading list. And as a result about 200 people flocked to his first class, a lot of whom were or would soon be registered for it. I was one of them. Two days later I was very disappointed to be informed by the Registrar, in more diplomatic wording of course, that I was kicked out of the class, for no other reason but that I'm not a junior or a senior. So enrollment dropped from 150 to 70, and slowly rose back to 100 after a few days, presumably because some first-years and sophomores insisted and/or some more juniors and seniors signed up. In any case, I just want to say that I was very mad about the way he went around a problem he himself could've avoided (by setting an enrollment limit, for example). More important I don't think it was fair to remove people according to seniority, but rather according to who signed up first; I registered for the class when there were about 30 people in it. Not being able to do the class is okay, especially after I've read negative comments about him, but being deprived of an opportunity that was given to you was bad. Anyway, I hope next time when Prof Robbins teaches a class with such a great reading list, he remembers this experience.\n"
        },
        {
            "course_name": "Modern Comparative Fiction",
            "review_date": "November 13, 2001",
            "review_content": "\nIt's hard to dislike Robbins, since he seems like a nice, self-effacing guy. But by the end of the semester, you definitely do. His is one of the best reading lists at Columbia (Garcia-Marquez, Kundera, Ishiguro, Rushdie), but the class bored me to tears. He takes all the beautiful books and reduces them to vague political-theoretical analogies. It makes you want to squirm from frustration, as you hope and pray that one day, just once, he'll stray from the political influences of the book and maybe discuss the beautiful prose, or the imagery, or ANYTHING. \nWorkload:\nThankfully, you don't need to attend lecture to do well on the exams. Just read all the books (which you'll want to do anyway) and you'll do fine. Papers graded by TAs, who are your typical grad-TAs, not particularly easy or hard, sometimes make wild misjudgements... Not particularly hard.\n"
        },
        {
            "course_name": "Modern American Fiction",
            "review_date": "November 10, 2001",
            "review_content": "\nThis was his first semester at Columbia from Rutgers, where he taught small discussion classes, and spent a great deal of time in this class apologizing incessantly for not having a clue how to teach large lectures. He seemed to have mixed feelings about his students, and couldn't understand why discussions didnt flow in a room of 150 students. His lectures were never centered on the books as a whole, but often detailed descriptions of obscure post-modern critics' interpretations of the books. The class was dull, the books were great. I would NOT recommend taking a lecture with him for his insight.\nWorkload:\n2 papers, 5-7 pages each, midterm and final. exams based on ridiculously minute details in books, NOT overall ideas and comprehension.\n"
        }
    ]
}