{
    "prof_info": [
        {
            "prof_name": "Jennifer Mangels",
            "prof_id": 271,
            "total_reviews": 25
        }
    ],
    "reviews": [
        {
            "course_name": "Cognitive Neuropsychology",
            "review_date": "April 25, 2006",
            "review_content": "\nThough there are no tests in the class- and Dr. Mangels' writes very difficult exams- you are required to write a weekly 2-page (single-spaced, often difficult to squeeze onto the two pages) as well as pair up with a student and lead an entire lecture. The amount of reading is very heavy- the articles are often interesting but the text, which you only use during the first half of the class, is long and painfully boring/dense. Dr. Mangels is a great lecturer and discussion leader and the class is really interesting. The seminar leading on your own will probably take a good 20 - 30 hours of preparation/\nresearch.  If you like neuroscience, definitely take the course! If you like Dr. Mangles from Mind, Brain and Behavior definitely take the class! It was a really interesting class and Dr. Mangles really knows how to pick good material to keep you interested. I highly recommend this course to anyone with an interest in psychology/or neuroscience.\nWorkload:\nA few chapters a week (each about 30-40 pages of VERY dense material) or 3-5 articles. Lots of reading. You have to post questions the day before the class. A 2-page single-spaced essay once a week, you can drop a total of five though. One presentation that you and a partner have to run a seminar, LOTS of prep. But the class is all worth it!\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 21, 2005",
            "review_content": "\nI generally concur with the other reviews on here, but want to stress that Dr. Mangels is a phenomenal professor, in my opinion. The course was very difficult, disproportionately so for an introductory level course. However, the material was really interesting, and practical and current - - significantly moreso than in the other intro psych course (Science of Psych)- - and Dr. Mangels is interesting, clear, concise and totally transparent as a professor. You know exactly what you need to do, need to know, what opportunities will help push you forward in the class. Whether you have the time or inclination to actually do them is another issue, but I think Dr. Mangels is the kind of professor who can inspire someone to choose neuropsychology as a future profession - which is pretty powerful and I am grateful that someone of this caliber is teaching an intro level course. \nThe self tests were very difficult but very useful for the exams. There was a lot of anatomy and a lot of memorization in that area, which is rough for some (like me) but doable if you set your mind to it.  The first two exams were reasonable and the final was quite difficult, but she gives you very clear review sheets for every exam. Stick to them and you will be in good shape.\nWorkload:\n3 exams, first 2 are not cumulative, the third is.  Optional self tests throughout the course as well as extra credit readings and lectures.  A lot of material but it is useful and ties together nicely.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "January 02, 2005",
            "review_content": "\nWhat is everyone talking about?  \"All of the neuroscience majors throw off the curve too much\"--\"This class is overwhelming and hard.\"  Look, you have to know what you're getting into from the beginning.  If you want an easy class to fulfill a science requirement, don't go with this one.  At the same time, you don't have to be in the field to appreciate it.  \nI am by no means a neuroscience major: after high school I vowed never to take another math class again.  I am a freshman.  I did take this class to fulfill my science requirement and yet I finished the class with a freakin' A+.  It was the last thing I expected.  After looking on CULPA before I took it I was petrified, but I took it anyway because I didn't have many other options and I think it's interesting.  If you don't think it's interesting, don't take it.  This has to be something you like to learn about.  \nYes, there's an insane amount of information in the class, but it comes part and parcel with COGNITIVE NEUROSCIENCE.  That's exactly what the class is.  She gives extra credit--that's so generous!  Yes, it often takes more than an hour to successfully complete a self test, but you should do it anyway because that information is almost always covered in some form on the exam.  Yes, it forces you to go back through your old notes, but you're going to have to do that anyway to study!  You might as well get credit for it.  Be prepared to do your work and you'll be fine.  \nDr. Mangels' lectures are extremely interesting and she's a very nice person--even by the negative reviewers that seems to be undisputed.  I only realized after the class has ended how much I truly enjoyed it.  It has affected the way that I think and view the world.  Incredible.\nWorkload:\n3 tests and 11 weekly self-tests.  You will want to get that extra credit which requires about 8 of 11 self-tests completely successfully (at least 75% of the questions right).  They're a decent commitment, but so is the class.  Know what you're getting into and it's an incredible learning experience.  I'm still babbling about neuroscience to my family over break.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 25, 2004",
            "review_content": "\nLike the previous reviewer, I had a love-hate relationship with this course.  I found most of the material very interesting, but had a strong distaste for MangelsÂ’ approach to teaching.\nThere were some good things: Mangels is quite organized and her lectures are fairly easy to follow.  She incorporates video, overheads, and blackboard notes pretty well.  Our TAs were knowledgeable and tried to be helpful.  Mangels herself is a fairly nice woman, enthusiastic, and happy to answer questions during lecture.\nAll of the good aspects aside, I still would not recommend this class to anyone who did not have BOTH a strong interest in psychology (or rather, brain anatomy) and lots of time to devote to studying ridiculously detailed anatomical details of the brain.  There is practically no understanding required to do well in this course, just memorization.  For example, although you will have no idea what a superior olivary nucleus IS, you will be required to know that it is part of the auditory pathway.  Anyone who has to take MBB for whatever reason (psych or neuroscience majors), IÂ’ve heard that Weidenmeyer (who teaches second semester) is a much more reasonable professor (and has an accent to boot).\nMangelsÂ’ biggest fault is that she attempts to teach far too much.  She covers a lot of topics (itÂ’s an overwhelming amount) and most of them are interesting.  She teaches each topic in great detail, so you will undoubtedly learn a ton in this class.  However, to eke out a decent grade, you will work hard.  Probably harder than for any other intro course you take.  (Note this was a 3 pt 1000-level class, but it felt like a 4 pt 3000-level class in terms of workload)  It is not the class itself that is hard Â– it is MangelsÂ’ approach to teaching it.  \nFor example, her exams cover the minutest detail Â– stuff you would never think would be on an exam.  Your whole grade will be based on your exam grades.  Mangels claims that her optional self-tests can help Â“nudgeÂ” your grade upwards if you are borderline by the end of the semester.  But donÂ’t bother unless you plan on doing all of them or a large majority of them.  She does not consider doing 5 or 6 of the 11 self-tests Â“nudge-worthy.Â”  Moreover, they will take your several hours to do correctly, and you will not get any credit for them unless they are at least 80 percent correct.\nMy opinion may be skewed because I had a very full schedule when I took this class.  I am pre-med and was also taking bio and orgo.  I was considering a neuroscience major, but now I am not.  IÂ’m pretty sure I would have enjoyed the class more if I had more time dedicate to it.  But I ended up feeling like I devoted hours and hours of time to this class that I did not really have to spare, and my grade did not reflect my effort.  I studied more for the final exam for this class than for my orgo final.  I pulled an A in orgo and got a B+ in this class. Take from that what you will.\nWorkload:\n2 exams during the semester and a final.  A lot of reading, but I never cracked the book, which was useless and convoluted.  The exam questions  will test your memorization ability, not your ability to learn.  Self-tests are generally useless and take a few hours if you want to get credit.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 24, 2004",
            "review_content": "\nI concur with the review on December 24.  I withdrew from the class after the second exam.  The class requires an ENORMOUS amount of time commitment.  As the reviewer before me stated, this is a 3 unit, 1000 level class.  Dr. Mangels' expectations are unreasonable.  This is evident in her rigid teaching style.  She covers an enormous amount of material each and every class, sticking to her lesson plan.  She appears annoyed with questions from students because the questions cut into her pre-programmed structure.  This leaves little room for spontaneity in the class and real learning gets lost.  I would never recommend this class to anyone.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 23, 2004",
            "review_content": "\nI had a love-hate relationship with this course.  Ultimately, I can't recommend it.   IÂ’ll begin with the good (and there is quite a bit): Jennifer Mangels is a fantastic lecturer.  She integrates powerpoint, overheads, the chalkboard and great movies to present the material in a fun and interesting way.  She often gives cute anecdotes and nmemonic which make the material easier to learn and remember.  The TAs were great Â– they always explained things clearly, and the two guest lectures they gave were good.\nThat being said, the workload of this class was RIDICULOUS.  Although none of the material was particularly difficult, there was TONS OF IT and the level of detail is overwhelming, requiring tons of studying and memorization time.  The review sheet for the final exam was SEVEN PAGES LONG, and that was only half of the exam (unlike most classes, this final is truly cumulative).  I quickly began dreading the weekly self-tests which required me to go back hunting through my notes (and the book) for the most minor details.  The book does a really terrible job explaining things, but they might be switching to another book next year.  \nAlthough many of the lectures presented really interesting material, some were excruciatingly dry (for example, the architecture of the hippocampus) and required pure memorization.  On a few lectures, she didnÂ’t manage her time well and spent the last 10 minutes writing the material on the board (as we frantically copied it down) without explaining it Â– it's like Dr. Mangels feels this strange obligation to get through an absurd amount of material.  For example, she didnÂ’t have time to teach us about Schizophrenia, but she required us to teach ourselves that section (as if i didnÂ’t have enough to do while preparing for finals!)  As an earlier reviewer said, it is as if she believes this class is every studentÂ’s sole purpose in life. \nThe tests, each consisting of 70 multiple choice questions (the final was an absurd 144 questions) were really frustrating and easy to screw up even if you knew the material.  The questions often asked REALLY minor details (sometimes pure memorization) Â– details that any normal person studying for this exam would conclude Â“thereÂ’s no way sheÂ’ll ask thatÂ” Â– but she does...\nSO, TO SUMMARIZE: Great lectures, great TAs, material sometimes fascinating sometimes boring, large workload, harsh grading, way too much material and way too much detail (especially for a 3 point, 1000 level class) = a painful experience = avoid this course.  It's not worth the pain\nWorkload:\n3 difficult tricky tests.  If you are going to take this course, take advantage of the many Extra Credit opportunities (attend science lectures, read extra scientific articles)\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 21, 2004",
            "review_content": "\nMangels is a great lecturer and you learn a lot in her class.  She clearly knows how to teach a class and is very accessible via email and office hours.  The class itself, though, is really hard.  I went into it having taken 4 other psychology classes here (including ones about the brain & cognition) and found this course to go more in depth with every subject... which means a lot of studying for exams.  I personally thought the exams were hard, but extra credit counts for a lot.  She mentions that she curves exams - the first one a lot of people did well on, so no curve, the second was only curved 3 points and the final 8 (out of 144).  So basically don't count on much of a curve.  If you're willing to put in the work it's a good class but be ready to work hard... about 9% of our class failed and another 13% or so got Ds as final grades... and with a bunch of junior & senior psych and neuroscience majors in the course, it's basically study your ass off and get an A or B or don't study too much and fail.  \n\nWorkload:\n3 exams (first 2 are non-cumulative, final is cumulative).  Not much of a curve, but that depends more on people in your class & how they perform.  You can earn a bunch of points though with extra credit - they boosted me up a lot.  Self tests every week are optional but if you are within 1% of a letter grade then you get bumped up as long as you have 80% or better on 80% or more of the self tests.  \n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "January 29, 2004",
            "review_content": "\nDr. Mangels has had plenty of good reviews already, but given the last few, I felt I had to respond.  I found this course to be very interesting.  The nature of the course is such that the first half of the semester is mostly biology, and you may decide that this is not your cup-of-tea, but that in no way qualifies it as a boring, misguided course.  I found Dr. Mangels to be a fascinating lecturer, and I felt that she is just an amazing person.  For example, in one of her interactive experiments, one of the test words was 'terrorist.'  After the experiment, she made a side-comment that \"much later, you'll tell your grandkids that you had this experiment, and you still remember the word 'terrorist' being in it, and they'll say, 'What's a terrorist, grandpa?'  Wouldn't that be nice?\"  Dr. Mangels' human side made it such a pleasure for me to learn from her.  I love you Dr. Mangels!\nWorkload:\ndescribed well below - one correction: the extra credit is factored in *after* the curve, so it does *not* hurt those who don't do it.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "January 27, 2004",
            "review_content": "\nJust to counter many of the reviews, which seem to have been from people looking for an easy way to satisfy their science requirement: Mind, Brain and Behavior is a fantastic course, if you take it to be an introduction to cognitive neuroscience. Professor Mangels does an excellent job of exploring in depth a great variety of topics in a clear and interesting way. This was the course which motivated me to become a Neuroscience and Behavior major; if you're considering it at all Mangels is definitely the professor to take this class with. That said, the same reason that makes this class great for the science-inclined may make it an awful experience for those who are looking for the least painful way to satisfy their requirement. But if you're prepared to put in the effort, anyone can leave the class with some really comprehensive knowledge. \nWorkload:\nThe tests are challenging but fair. Extra credit is a possibility (very generous for a college course).\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "January 08, 2004",
            "review_content": "\nEvil, Evil, Evil! Stay away from this woman. I read reviews about her before I took the class thinking, \"it can't be THAT bad.\" Well, it is worse. She is a brilliant woman, don't get me wrong, she knows her stuff. The problem is that she knows everything but can't grasp the fact that other people don't pick up on it so easily. Mangels just talks 'at' you during lectures. She is easily annoyed when people ask a lot of questions. The self tests, extra articles, etc are all well and good but they are too time consuming and can be a waste. If you dont get ALL of the extra credit questions right, you get NO credit. How ridiculous. If you really need this class just wait until a spring semester to have a different teacher.\nWorkload:\n3 tests...extra crredit self tests, psychology talks, and articles\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "January 04, 2004",
            "review_content": "\nAside from a cryptic text, shallow and boring lectures, weekly self-tests that have nothing to do with either text or lecture, grouchy TAÂ’s, acid exams that test ridiculous detail, and a stingy curve made even worse by NS + B majors, this class was a joy.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "November 19, 2003",
            "review_content": "\nOMG!  Hmmm...Where can I start?  Let me dish you in on Professor Mangels good qualities first: 1.) she knows her field; 2.) she can answer almost any question you throw at her about the material; and 3.) most of the time she is a good lecturer.  However, the bad outweighs the good!  I respect Professor Mangels b/c she is a very intelligent woman but she needs to have at least a little compassion for her students!  First and foremost, she needs to get GOOD TA's b/c ours were no help at all!  The truth is if you are not good in science DO NOT TAKE THIS CLASS!  Please while you are still ahead, LEAVE!  Basically, the whole field of neuroscience is what you are responsible for--from 19th century Phrenology to the real nitty gritty like \"visual primitive\" and beyond.  The exams are horribly difficult and viciously/shrewdly deceptive .  The majority of the questions on the exams, you have to read more than twice--to make sure there are no hidden tricks.  She does give out a review outline for every exam but if you are taking more than just this class it can almost be impossible to get through the entire outline. And trust me I started studying as soon as the outline was posted on courseworks!  But it is as if she believes this class is every students soul purpose.  There is too much material you must MEMORIZE for each exam.  Furthermore, the review sessions that the TA's hold in case you have any questions, are no help either.  They either tell you to refer to the book on page blah or they totally misinterpret your question.  They do not elaborate at all.  Finally, the extra credit self-tests are Bulls***!  You have the option of doing them and if you do decide to, you MUST get at least 80% correct in order to get any credit.  They too are dreadful!  I spent agonizing nights pulling my hair out on finishing the exams only to find that I recieved no credit b/c I got 1out of 10 questions wrong (the question I got wrong was worth 1 point more than the rest).  I wanted to be a psychology major but the psychology at Columbia College and General Studies is completely different from most institutions.  I have changed my major, do you see how traumatized I am?  Additionally, for all of you who think I am stupid and that is why I am giving Professor Mangels a bad review, no, you're wrong!  I passed the class well off too! \nWorkload:\nYou have 3 exams!  Exam #1 was 60 multiple choice and extra credit question.  Exam # 2 was 65 m/c and 2 extra credit questions.  Exam # 3 was same as # 2 but semi-cumulative!  Optional self-tests every week (purposively extra credit)!  And a sure seizure.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "September 03, 2003",
            "review_content": "\nTHIS IS THE WITCHIEST PROFESSOR I HAVE EVER HAD AT COLUMBIA! DO not take her class. She is ruthless, secretly malicious, unforgiving, and inflexible. Her lectures are boring and you will fall asleep the whole time, and then you will fail her brutally esoteric - 100 question multiple choice exams.  If you're smart, get out while you can. PS - the bulletin fails to mention that many of the students taking this course are Neuroscience majors, who skew the curve. \nWorkload:\nweekly chapters of reading, weekly \"extra credit\" assignments which do not help your grade (but youre tested on the material regardless) and three ridiculously difficult multiple choice exams.  \n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "January 22, 2003",
            "review_content": "\nThank you people! I thought I was the only one who have had an EXTREMELY frustrating experience with this class. Pure memorization. This is a class for pre meds, biology and psychology majors, but not for people who are looking for an interesting science class to fulfill a requirement. The amount of details is ridiculous.\nWarning: don't be fooled by Prof. Mangels smooth talk about how she'll get you into this stuff. Although she is in fact a good lecturer, you begin by thinking she'll discuss how drugs affect you brain and end the semester with your brain fried by hours and hours of useless studying. As if that wasn't enough, she'll pull little tricks on the exams - so not only you have to remember the answers but you have to read the question over and over again.Besides, if you're not going to use it for anything else (i.e: your major) you forget all you have \"learned\" by the second day of your break.\nWorkload:\nWeekly self tests that are supposed to help you but rarely do. 3 exams that can keep you awake for several days if you're not a science person.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "January 22, 2003",
            "review_content": "\nOk, I think we've heard enough from all the science-phobics out there...now it's time to hear the TRUTH about MBB!  I admit, there is a lot of memorization and it's pretty difficult to get A's unless you have plenty of time to devote to this class, but since it's so enlightening, WHO GIVES A DAMN? \nA word of advice to all the budding neurologists, neuropsychologists, and psychiatrists out there: don't even think about interning until after you take MBB! I swear, you'll know pretty much everything you need to know for a career in one of those fields! You'll learn about all the latest technological advances, all the psychological tests, and almsot every cognitive disorder in MBB...and, to your surprise, you'll remember most of it! And, believe me, if you mention anything you've learned in MBB, the docs will just ADORE you! \nBottom line: if you're just another neurotic grade-grubber, stay away from this class. If you really want to learn and apply your knowledge to real life, I command you to take MBB before you leave CU! And, finally, if you're reading this...Jennifer Mangels, you are the greatest! \nWorkload:\nNothing! Just study before exams. Don't bother with the self-tests and the textbook until exams roll around. She'll list EVERYTHING you need to know for the test on her review sheets, including specific page and self-test numbers where you can find info. As for the extra-credit...if you have the time, definitely do it. If you don't, just fuggedaboudit and focus on the main material.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "January 01, 2003",
            "review_content": "\nGod, that last review I read was SO right on. This class has nothing to do with comprehension--just straight up memorization. That's it. Mangels will ask ultra-specific questions that seem more like trivia as opposed to an actual review of whether or not we grasped what we were supposed to know. Oh. And the extra credit is BS. Pure BS. I did EVERY SINGLE SELF-TEST (which DON'T help you review for the exams) and got ZERO points of extra credit. They take time, too... very specific, with exact page numbers, etc. Ugh. Please, please don't take this class unless a) you're insane about memorizing stuff (that's ALL THIS CLASS IS) or b) you're looking for a biological approach to cognitive neuroscience. No traditional psychology is taught here. What a shame. Mangels, as a professor, isn't so bad. I mean, she seemed nice enough. The TAs were ridiculous--they weren't accessible, and if you went to one of their asinine study sessions, they'd tell you to \"look up an answer in the Schermerhorn psych library.\" How's that for help?\nWorkload:\nToo much reading. Reading the book doesn't even help--it's all the more confusing. Self-tests are optional, but like I said, they're pointless. She'll also assign extra credit articles for the exams (very specific--if you miss one part, you don't get ANY extra credit).\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 25, 2002",
            "review_content": "\nIncredible. Never thought anyone could make me interested in science, but Mangels is an interesting lecturer who makes you care about the subject even if you didn't before. organized, clear, totally understandable. A lot of memorization. Class focuses on the neuroscience aspect of psychology, so its biological and scientific.\nWorkload:\noptional (extra credit) questions due each week, hard midterm/final but they're curved and if you study her review sheets, you'll do fine.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 17, 2002",
            "review_content": "\nMangels is an excellent lecturer.  IÂ’ve taken more than 50 points in the psychology department and I enjoyed most of those classes; this is one of the better courses in the area.  Mangels clearly enjoys teaching and likes talking to students.  The class is a bit more difficult than other classes you could take to fulfill the science requirement, so if youÂ’re looking to loaf, go somewhere else.  I actively avoided neuroscience for three years and came into the class with a less than optimistic attitude, but her interest in the material is contagious.  If you came to Columbia to get straight As and get into law school, this may not be the easiest way to achieve your goal.  If you came to learn from bright, interesting, and skilled professors, this is an excellent course.  Strongly recommended.\nWorkload:\nDense reading.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 08, 2002",
            "review_content": "\nI hate this class. 1) The name of the class is complete shit - it has nothing to do with mind or behavior. just brain, brain, brain. This is NOT a psychology course - this is a biology course - cognitive neuroscience. If you're trying to avoid taking a bio course for the science requirement, you fail with this class, even though it's in the psychology department. 2) Jennifer Mangels is an obnoxious, condescending professor with immature and preconceived notions of how to run a class. She makes everyone sign an attendance sheet (ostensibly only for extra credit, but the curve changes this - see below). She and the textbook manage to come up with a new word basically every sentence. She treats students like children, has a completely hands - off approach by having the TA's do *everything*, and is just plain an annoying speaker to have to listen to twice a week. 3) the course is pure memorization. the first exam had a question with about 20 parts, asking you to label every single fucking part of the brain. no comprehension, no analysis, just memorization. 4) the grading system is unbelievable. There is extra credit on exams, there is also extra credit for attendance (but only if you attend each and every godforsaken class) , and there is extra credit for handing in optional self-tests. The self tests are extremely annoying, by the way. The point is, a curve is instituted, but she doesn't institute a curve based on raw scores -she looks at all the extra credit, and if she likes the distribution with that, then she doesn't do a curve. so if you don't do extra credit, you get screwed.\nWorkload:\nnot bad, but if you do all the self tests, extra credit, attendance, it's brutal. don't take this class. it's not worth it. take something else for science requirement. you've been warned.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "July 14, 2002",
            "review_content": "\nAre these people joking with their reviews? This is the single worst class I have taken in Columbia. Mangels treats it like a high school class! She assigns \"optional study questions\" every week, \"extra credit\" readings on tests, and gives extra points for perfect attendence, but the class grades are CURVED. If you want to get an A, you have to do most of the extra work and come to EVERY class at 9AM. Still, the class would be \"ok\" if Mangels knew how to organize information. There is an incredible amount of memorization involved and Mangels just throws it at you in arbitrary categories. Go over your notes while studying for the final and you'll have no idea whats important and whats not. So EVERYTHING becomes important. Studying for her tests will take your youth away from you. I got an A in the class and I'm pleading with you not to take it. It is simply not worth it. \nWorkload:\n2 midterms and final, reading assignments (required and optional)\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 30, 2001",
            "review_content": "\nI would highly recommend this course and professor to anyone mildly interested in psychology or simply trying to fulfill the science requirement. Professor Mangels is very engaging and a fantastic lecturer. My only warning: this course doesn't discuss any interesting psychological concepts until the last few weeks of the course, until then it's almost entirely neuroscience. If you're willing to put up with lecture after lecture on neurons, this class is definitely worth it: there's very little work of any kind, and only 3 straightforward multiple choice tests.\nWorkload:\n3 multiple choice tests: that's it. It does require a lot of memorization, but it's easy to get a C or B in the class with very little studying.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "November 28, 2001",
            "review_content": "\nProfessor Mangels is an excellent professor. Even at the dreadful hour of 9:10am she is fresh, awake and ready to go, always trying to throw in the occassional joke to keep the class awake. She also does everything possible to help her students learn. Every lecture is taped and all the materials used in class are put on reserve. She gives extra credit for going every time. Nevertheless, she still expects alot from her students, as evident by the test. Still most people get an \"A\", I think about 40 percent of the class.\nWorkload:\nThree exams that are really specific.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "November 11, 2001",
            "review_content": "\nAlthough her outlines and class lectures are very well outlined, they are extremely dry. I found myself falling asleep most days when I showed up to her class. The only real thing for this class is memorization. If you can memorize everything she says then you will have no problem with this class.\nWorkload:\nNot too significant. 3 tests and extra credit is available. The 3 tests are straight memorization.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "April 09, 2001",
            "review_content": "\nMangels is a well-organized, energetic lecturer, even at the painful hour of 9am. She uses helpful overheads and interesting video clips to supplement her lectures. She holds many review sessions and office hours throughout the semester. She offers many opportunities extra credit. She knows her stuff too and is able to field on-the-spot questions well.\nWorkload:\nthree moderately difficult multiple choice and fill-in tests (they have extra credit sections)\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Mangles is phenomenally up to date with the latest news in neuroscience research. Even at 9 a.m. her lectures are dynamic, engaging, and remarkably interesting. The material is always clear and well presented. She makes a special effort to incorporate slides, videos, and the web. If a dull moment ever occurs, she'll rattle off a joke about the time she was having an MRI (something you talk about in the class) and major problems occurred because she forgot to take off her underwire bra.\nWorkload:\n3 fairly difficult exams comprise the entire grade. Optional extra credit is offered, but it isn't worth a significant amount of points and is exceedingly difficult and tedious, and therefore not worth doing.\n"
        }
    ]
}