{
    "prof_info": [
        {
            "prof_name": "Jacob Hoyle",
            "prof_id": 12714,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Topics in Maternal Cribbage through the Ages",
            "review_date": "November 21, 2013",
            "review_content": "\nFirst off, I have to admit that Professor Reverend Jacob Carlos Hoyle PhD MBA MD Esquire's credentials are impressive. He has clearly worked hard to attain them and I understand he has a great deal of experience and expertise in the real world in the telephonic solicitation field, something of which few professors at Columbia, or indeed anywhere, can boast.\nNevertheless, I have to say: DO NOT TAKE THIS CLASS! He is, in his own words, the \"hardest of motherfuckers\" and you are \"sure to fail.\" His lecture style was unorthodox to say the least, full of strange hmming and snickering noises, and he was highly argumentative which prevented any real discussion from taking place. His grading system is also wildly unhelpful, bordering on random; he will reward and remove points seemingly at will, often giving two students with the same answer completely different grades. He also would fail students completely for nonspecificity; homeworks had to be presented with a disclaimer explaining that they were homework assignments in response to questions (which we had to list) which he had given in his class (which we had to specify) by him (who we had to name) written in English (which we had to describe linguistically) on paper (whose history we had to give). When I tried to reach him at his pre-appointed office hours to discuss these grading issues, he was not there; in fact the door was locked and it seemed that the whole room had been abandoned for many years, as the inside (as viewed through the window) was a complete mess and ravaged by mice.\nI am also doubtful of many of his claims; he claimed for instance he had much Spanish heritage (hence his middle name) but he appeared to be about as Jewish as Woody Allen. He claimed also he was close personal friends with a certain Korean dictator (who he refused to name or even specify which Korea he was from)--again quite doubtful, although he did indeed speak a little Korean. In fact the only plus side to his class was the Burrito Day which we celebrated in honor of said Korean dictator midway through the year.\nWorkload:\nThe workload for this class was as impenetrable as Professor Rvd. Hoyle PhD MBA MD Esq.'s mother is penetrable. 1 10-page essay per day, plus about 800 pages of reading due in the break he gave us in class (although I must give him credit for giving us a break midway through class). He also would call us up occasionally in the middle of the night to surprise us with questions about almost anything, from the subject matter to the very nature of life itself.\n"
        }
    ]
}