{
    "prof_info": [
        {
            "prof_name": "Lorena Garcia Barroso",
            "prof_id": 13629,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 12, 2019",
            "review_content": "\nI took her class last spring and had mixed feelings. TLDR: course itself/grading/learning was fine, but i'm not a huge fan of her personally. if you get put in her section, just do the assignments and do them on time, participate in class from time to time, and study for the tests. Keep a low profile and you'll be good. That's basically what I did to get an A \nThings she did well:\n-got us to speak a lot in class. This really helped me improve my confidence in speaking/applying the concepts\n-others lamented that she was a harsh grader, but I actually felt that she was pretty fair... when she took points off, it was because I legitimately did have mistakes and my final grade was fine.\n-was pretty clear in explaining content imo\nThings I didn't like:\nShe said some things that were honestly very problematic. This was my big issue with her. Here are some examples:\n1) our class only had 1 boy in it, and she called him \"attractive\" in an example of a grammar concept. When the class was understandably confused, her reaction was \"come on guys, be nice to him.\"\n2) she would bash the US in a problematic way, calling Harlem ghetto (in so many words), and saying things like \"well back in Spain we don't have racism\" (which is obviously not true)\n3) using the names of students from other sections in examples, but describing them negatively (called one guy a womanizer)\n4) she would show up 5-15 minutes late somewhat frequently but chastise other students when they did\n5) when certain students were presenting their final projects, she would say things like \"this is what I want out of all of you,\" when other students had already presented\nWorkload:\nwhat the syllabus says, except she actually checks to see if you did the assigned readings and factors that into your participation grade which is annoying tbh since basically every other prof i've heard of makes it optional.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "May 30, 2019",
            "review_content": "\nShe is a really harsh grader and not a great professor. I would not recommend taking her class. Stick with another Professor.\nWorkload:\nHeavy and annoying \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 06, 2018",
            "review_content": "\nProfessor Garcia Barroso needs to be better organized. I understand that she just had a child, but she would often come up to 10 minutes late to class. She had no listed due dates for papers assigned, and would drop an assignment on students five days before they were due with the expectation that it would be fine. She would double assign homework every night, having required book work in conjunction with online material, something that was very, very rare in previous language courses at Columbia. She also had little patience for those struggling with concepts or grammatical rules, and would become frustrated with them. Avoid at all costs. Seriously. \nWorkload:\nUngodly – daily bookwork and myspanishlab, with papers given on Monday in class due Friday in class during the same week as presentations. In total 3 papers, a final project, a midterm, an oral exam, and a final. \n"
        }
    ]
}