{
    "prof_info": [
        {
            "prof_name": "Zoe Trodd",
            "prof_id": 10626,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "African American Literature",
            "review_date": "January 18, 2012",
            "review_content": "\nDon't take her!!! She is not an impartial grader. I've never contested a grade in my time at Columbia except hers. She makes it almost impossible to accommodate you for office hours when her pre-existing ones conflict with your other classes. I asked her for guidance with the paper during the first week of classes because I knew I needed all the time I could get, she said don't worry, it's too early for that, we'll get to that, you have plenty of time, yada yada yada, then when she graded it at the end of the semester, she penalized me saying I should have taken more time to develop it and it seems like I rushed through parts of it. Ugh! As a person I'm sure she's great, but as a professor she needs help!\nWorkload:\n3 in-class presentations throughout the semester, a 20 page paper, weekly written provocations. \n"
        },
        {
            "course_name": "Topics in the Black Experience: African American Photographic Culture",
            "review_date": "May 18, 2011",
            "review_content": "\nZoe was the best professor I've had at Columbia. She's a great lecturer and actually can talk about history and historical themes and writers and artists in a really provocative and interesting way. Her seminar was great because there was just the right amount of student participation (read: nobody had to talk too much if they didn't have good stuff to say!). I loved her and would take another class of hers if I could. She makes her self really available outside of class and on email, and is internet-savy so we used facebook and had all the readings posted online. \nWorkload:\nEasy, great readings, one big essay but you have tons of time to do it. \n"
        }
    ]
}