{
    "prof_info": [
        {
            "prof_name": "Ayten Gundogdu",
            "prof_id": 3540,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Violence and Justice",
            "review_date": "September 03, 2015",
            "review_content": "\nTAKE THIS CLASS! \nBest professor i've had so far at Barnard (only a freshman) and even though im not a person interested in poly sci, she made every class engaging and enjoyable. You will love this class if you follow the news and have an opinion about the world. Can't express enough how much this class rocked!\nWorkload:\nA lot. But very engaging.\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "February 09, 2015",
            "review_content": "\nPros:\nProfessor Gundogdu is a brilliant professor, and extremely nice.\nI heard from many of my peers that she was very helpful in office hours.\nNo homework.\nReadings aren't necessary, you could leave it for last minute and understand the parts you have to read and smart-read them. usually, you will have to focus on a chapter or two. \nNo midterm, no final. 3 papers. \nShe gives out a detailed outline for all papers that really help. \nCons:\nMandatory attendance, you pass around an attendance sheet for each lecture. \nNo computers allowed! (WHAT THE.... was my first comment but each to his own I guess...)\nMandatory disc sessions which go by quite fast since it's usually the TA talking and peers sharing thoughts. \nSince there are a lot of GS Students, many well thought claims come to light which help for the essays.\nEach time a paper topic was announced, 70% of the class was confused. Like literally, the next lecture would go by with people reformulating \"WHAT SHOULD I WRITE?\" around a million times.. \nPersonally, I enjoyed the class very much. She organized the class so that she begun with Plato's democracy discussion up until John Locke, etc. So, it was like a timeline of political theory. She is obviously very intelligent and extremely kind, yet not the most entertaining teacher, I must say. Grades really depend on the TA, hope that you get an easy TA for the final one! \nSHORTCUT: If you're just getting into politics, don't want too much work I would definitely recommend the class\nWorkload:\n20% participation (it would help to participate in lectures..  sorry)\n15% first paper\n30% second \n35% third\n(the percentages of the first and second paper may be wrong)\nthe papers are mostly about a claim about something you read (see how clear I was? that's how clear the prompt will be..)\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "February 09, 2015",
            "review_content": "\nPros:\nProfessor Gundogdu is a brilliant professor, and extremely nice.\nI heard from many of my peers that she was very helpful in office hours.\nNo homework.\nReadings aren't necessary, you could leave it for last minute and understand the parts you have to read and smart-read them. usually, you will have to focus on a chapter or two. \nNo midterm, no final. 3 papers. \nShe gives out a detailed outline for all papers that really help. \nCons:\nMandatory attendance, you pass around an attendance sheet for each lecture. \nNo computers allowed! (WHAT THE.... was my first comment but each to his own I guess...)\nMandatory disc sessions which go by quite fast since it's usually the TA talking and peers sharing thoughts. \nSince there are a lot of GS Students, many well thought claims come to light which help for the essays.\nEach time a paper topic was announced, 70% of the class was confused. Like literally, the next lecture would go by with people reformulating \"WHAT SHOULD I WRITE?\" around a million times.. \nPersonally, I enjoyed the class very much. She organized the class so that she begun with Plato's democracy discussion up until John Locke, etc. So, it was like a timeline of political theory. She is obviously very intelligent and extremely kind, yet not the most entertaining teacher, I must say. Grades really depend on the TA, hope that you get an easy TA for the final one! \nSHORTCUT: If you're just getting into politics, don't want too much work I would definitely recommend the class\nWorkload:\n20% participation (it would help to participate in lectures..  sorry)\n15% first paper\n30% second \n35% third\n(the percentages of the first and second paper may be wrong)\nthe papers are mostly about a claim about something you read (see how clear I was? that's how clear the prompt will be..)\n"
        },
        {
            "course_name": "Violence and Justice",
            "review_date": "May 08, 2013",
            "review_content": "\nFascinating readings!! Gave a very holistic overview of how thinkers or philosophers or others grappled with violence, politics, and justice.\nThe professor has a solid grasp of the material, and is very interested in helping students. However you have to be prepared to put in a lot of hours of reading. And it's not semi-optional, you actually have to read, annotate, respond, participate etc. But if you do the readings and keep up with the material, you'll be interested in what these people had to say.\nWorkload:\n3 papers: ungraded rough draft for each. Each is about 5 pages, last one a little longer. \n6 short responses to the readings throughout the semester. \n1 5-minute presentation about a reading, which you sign up for at the beginning of the semester. \n"
        },
        {
            "course_name": "Human Rights and Immigration",
            "review_date": "April 15, 2013",
            "review_content": "\nProfessor Gundogdu is an exceptional instructor. Prior to class you have to read articles related to a specific subject then she reviews the readings in class VERY CLEARLY. There is absolutely no doubt what the author's main points are, how the argument is constructed or how it relates to topic/class. After spring break she began having us discuss the readings in groups rather than lecturing the entire time, which was very useful to work with others in trying to understand the material. If you have ANY question (which you probably won't unless it's about an assignment) she is very helpful. She definitely enjoys her field and she is passionate about teaching. If you keep up with the readings you will be prepared for the essays and short responses. Course is about how human rights laws/norms work with governments to address refugee, migration and asylum seekers' issues. VERY interesting course!\nWorkload:\nReadings for every class usually about 60-80 pages, so 120-160 pages per week. 3 essays (longest one is 7 pages) and you only use the class material so don't worry about researching. Responses to at least 5 readings during the entire semester (400 words, posted on Courseworks, you pick when and what they are, she gives you feedback, small percentage of overall grade) \n"
        },
        {
            "course_name": "Violence and Justice",
            "review_date": "May 16, 2011",
            "review_content": "\nThis seminar was amazing. It wasn't initially my first choice for a first year seminar, but I am so glad that I was able to take it. While the subject matter was not really in my area of interest, it was all very though-provoking. This class taught me how to think critically about my sources instead of blindly accepting them as fact. While this seminar did seem to have more work than the rest of the first year seminars, I feel that it is well worth it. Although Professor Gundogdu is strict about the course material, she is actually a sweetheart and knows everybody by name. I highly recommend this course.\nWorkload:\nModerate amounts of reading for each class, 5 written commentaries throughout the semester, 3 in class presentations, two 3-5 page papers, and one 8-10 page paper\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "December 24, 2010",
            "review_content": "\nThis class was a vague jumble of philosophers. Professor Gundogdu tricks you with the first assignment of reading Antigone. It appears that the course is going to be easy and straightforward. As a freshmen, you are put at a disadvantage in this class. The upperclassmen with more college-level writing experience have a much easier time. It takes a while for the papers to start coming, but towards the end it is close to a paper every other week. Gundogdu is vague in her explanations and asks for too many student opinions. Students typically repeat what the professor and fellow students are saying. The professor fails to keep the attention of almost all of the medium-sized lecture class, and will constantly remind you that she cannot focus because of the \"movement.\" The TAs are unhelpful in discussion. The best way to get a good grade on a paper is to go to office hours and have a TA or the professor thoroughly read over your paper. This class had a fair amount of work, if you did all the reading. Much of the reading is irrelevant to the papers. Towards the end, attendance was taken in almost every lecture. She often hands out note cards in response to a vague question about the reading. This is easy to bull shit even if you don't do the reading. The note cards and attendance were 10% of the final grade.\nWorkload:\n2 2-3 page papers\n2 5-6 page papers\n20-50 pages of reading per night \n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "December 12, 2010",
            "review_content": "\nUgh this class. Not a fan. I was choosing between this and Intro to International Relations, and I really wish that I had taken the latter. More than anything, this class was just boring. I should have been more inspired, as I am a political science major, but I just could not get myself interested in the more abstract concepts the course involved. I think that the professor means well, and I really want to like her because she's adorable, but she can be crazy strict (for example, not allowing students to leave in the middle of class without a note, even just to go to the bathroom). \nI never did the readings, and I had trouble focusing in the lectures. However, from taking notes in the larger class and discussion group, I was able to get a basic idea of the texts' main points, and that was usually what I wrote my papers on (with help from sparknotes). I never got anything lower than a B+.\nI took this class as a junior, and I think the fact that I'd already had some experience writing at a college level really gave me an advantage. There are a lot of freshmen that take this class, and they're still figuring out how to write a paper the way that the professor wants them to, so if you're an upperclassman you'll already going to be ahead of the learning curve. Just actually do what she asks and follow the directions, and you'll be fine.\nOverall, this class was boring but not terrible. If it was not in my major, I probably would have chosen to take it pass/fail. It requires a lot of work for just a 1000 level class, and expects a lot of you, which is difficult when the subject matter is pretty uninteresting.\nAlso, the TAs think they know everything (or at least, mine did).\nWorkload:\nI guess this has changed from last year, reading the previous CULPA reviews. She's removed the graded in-class quiz things, we just had to answer a question on a note card. Basically as long as you write something semi-intelligent, you'll be fine. You get points for just writing your name and being in class anyway. These were not hard.\nThe majority of your grades comes from the 4 papers, with only like 10 percent coming from participation (aka the note cards and attendance in your discussion groups). I only missed one note card, and I was fine.\nAs for the papers, you don't really have to know what you're talking about in order to make a good argument (at least, I never did). It probably would have helped me to go see my TA during office hours to approve/get help on my thesis, but I never really got started on the papers until the night before they were due. My discussion section TA was really good about giving us help on how to write the papers, and what kinds of arguments would work best. As with most professors, it's best to write the argument you already know that the professor agrees with.\nBasically, this class was not as hard as it was time-consuming (and I put in the minimum amount of time necessary). \n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "January 10, 2010",
            "review_content": "\nA good class, and a very good professor. Professor Gondogdu is very concise in her explinations\nand very clear explaining the material, which is necessary because sometimes you will understand\nwhat she says but fall asleep on a reading. She is also very approachable and helpful, and takes time to learn\nyour name. There are some petulant complaints on culpa that she's unfairly strict but clearly those\nreviewers have failed to read what is on her syllabus; she's organized and strict but not unreasonably\nso, she made herself clear from the beginning e.g. about late work, cell phones, etc. Just meet her\nhalfway, respect her the way she does you, and if you have a real issue then let her know.\nI came away from this class really learning something about citizenry and government though I was\nfreaking out in the middle of the course, and a lot of people were. For me it was because some of the\nculpa reviews led me to believe this was an easy A class and I could just lean back and concentrate\non other work.\nWrong.\n\nWorkload:\nIt's 1000 level but will challenge you to be very precise and organized in your writing/argumentative\nskills, and it will force you to think outside of your ideas. I thought the 2 microthemes were harder than\nthe 2 persuasive essays. Be very clear on both. I think this writing class is better than an English course\nfor someone who doesn't like writing.\nThe in-class writing assignments are okay, but there's only 3 grading categories out of 15 (5, 10, 15) and\nyou have to know the text to get a full mark. Do well and it will help, because the essays are tough.\nPlan your other coursework efficiently around this class's; you usually have a week for an assignment.\nGo to the writing sessions.\nIf he's around next semester see Sundipto, the TA. He gives you more outside perspectives & clear explanation\nof the material.\n"
        },
        {
            "course_name": "Intro to Political Theory",
            "review_date": "November 21, 2009",
            "review_content": "\nThis is a teacher is one person you will want to avoid... The class is supposed to be awesome but the professor is just horrible at teaching, her lectures are dry and boring. I am a poliSci student who loves Political Theory and political philosophy, and in fact I read philosophy books on my own time because I love it. However, Mrs. Gundogdu has turned this subject into something i want to avoid forever, and quit possibly I may never read the work of my beloved philosophers, just because of the agony I have to endure every minute I am sitting in this class. \nLet me make it clear, I have no problem with hard classes, but this class is not hard, it just does not make sense. The assignments are unclear and she does not take the time to clearly explains what we are suppose to write about.\nTo be honest, I feel bad for saying this but TA's in their 1 hour writing sessions help me understand the material better than she does in class. And since we are talking about the TAs, you must know that they have absolutely no mercy in grading the papers. They expect you to know the material and write good enough papers as if the class lectures actually make sense. Unfortunately the lectures do not make sense. \n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "November 14, 2009",
            "review_content": "\nI feel badly doing this, but I do not know one person who actually likes this class. Everyone complains. Her lectures are unclear, and the TAs are incredibly harsh graders on the in-class writing assignments. (Essentially there are 10 surprise in class assignments). There are only 3 possible grades for these assignments, 5/15, 10/15, 15/15. I don't care if you've done the reading and feel like you understand everything asked of you, it is damn dear impossible to get a 15. Those grades will accumulate faster than you think. She also gives a lot of reading--most days are manageable (30-40 pages of reading)--but she also assigns reading the same day as essays. Her writing prompts make no sense, and she'll make up a lot of words during class. She actually speaks English quite well, it's just that she doesn't acknowledge that she makes mistakes and new words... I've spent a good 15 minutes simply deciphering her essay prompts. She's boring and uninspiring. I took this class hoping to really get some insight, but she manages to turn interesting reading into the worse hour+ in your life. This class ruins my day, everyday. Nice thing is that there is no midterm, nor no final.\nWorkload:\n10 pop-quiz in-class writing assignments (Total 150 points/15%) (This is your attendance/participation grade)\n2 smaller papers (150 pts/15%; 200 pts/20%)\n2 \"persuasive\" essays (250 pts/ 25% each)\n\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "January 10, 2009",
            "review_content": "\nOverall, I give this class a thumbs up, although there were some times during the semester when I was doubtful. Prof. Gundogdu is a super nice, young woman from Turkey with a real passion for Political Theory. She's new to Barnard and it shows, though. Her biggest fault is that she spends too much time asking for student responses to her questions. The class is medium-sized so it's not necessary that she have student participation, and it's a nice idea that she does, but she just takes it too far. We all know that students have a tendency to basically say the same thing that the last five people have said, and that's what it is always like when she opens up the floor to comments, which is once or twice each class. I wish she would just wrap it up more quickly, get one or two responses and then shut the rest down. Everyone else thought that as well, you could see the exasperated looks on older students' faces. Other than that, though, I really enjoyed this class. It's super digestible even for your first political science class, and it's nice because you don't speed through a thousand readings. Instead, she picks 5 major books complemented by other smaller readings, and you end up spending at least two weeks on each segment of the class, which is focused on addressing a major issue of political theory. I liked the organization of the lectures and found the assignments very do-able. I like that the TA's hold optional writing sessions before each assignment is due as well.\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "December 23, 2008",
            "review_content": "\nThis is a great class to take if you're looking for an introduction to political science. The assignments increase in point value so you can get used to the style of writing and thought process. Professor has trouble getting people to participate in class and the conversations were dominated by a few overly enthusiastic students. She understands that not everyone feels comfortable talking in class therefore the class participation grade is composed of ten in class writing assignments on random days... you just answer a short question about the reading...really not hard at all. The other 50 points come from attending the 5 in class discussions on the days the papers are due. It is possible to get 20 extra bonus points because she gives two extra in class writing assignments. The reading is somewhat fast paced but manageable. The TA's hold writing sessions for each of the papers and grade them. The persuasive essays were somewhat hard but doable because there is not a specific correct answer to the question you are addressing. I definitely recommend this class as an introduction to political science and as a manageable way to get a good grade. \nWorkload:\n1st microtheme: 100 points (10 %)\n2nd microtheme: 150 points (15 %)\n3rd microtheme: 150 points (15 %)\n1st persuasive essay: 200 points (20 %)\n2nd persuasive essay: 250 points (25 %)\nAttendance and participation: 150 points (15 %)\n -- it is possible to get 20 extra bonus points if you don't miss a notecard. \n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "December 15, 2008",
            "review_content": "\nThis class is a waste of time. The readings are interesting, sure, but if you're in CC and going to read them in Contemporary Civilization, then don't take it. Ayten does not make going to class worthwhile, and if it weren't for the 10 point attendance quizzes, I wouldn't have gone: she only ever went over the reading, and never added anything insightful. I mean, we all got into college, I'm sure we can all understand what we're reading. But even more irritating, she tried to turn the eighty-person class into a discussion class; which isn't horrible in itself, but she did it by calling on people in a row, so that the \"discussion\" ended up being a series of disconnected comments rather than a fruitful conversation. If you want a reason to read these texts, or want to get a head start on CC, take this class, but otherwise wait to see if a better teacher comes along.\nWorkload:\nabout 50 pages of reading/night; 3 Microthemes, 2-3 pages; 2 essays, 4-5 pages. Very possible to get an A.\n"
        }
    ]
}