{
    "prof_info": [
        {
            "prof_name": "Steven Gregory",
            "prof_id": 1390,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Urban Anthropology",
            "review_date": "January 02, 2013",
            "review_content": "\nDO NOT TAKE THIS CLASS! Professor Gregory stopped showing up about a month or so into the semester. Three weeks before the end of the semester Professor Pemberton stepped in and attempted to give us something to do and grade our final papers (pretty much worth 100% of the class). The bizarre part is that this is apparently the third year that Professor Gregory has just stopped showing up. It was a waste of my time which was unfortunate because it was a class I was really looking forward to.\nWorkload:\nThere's only work when there was class. One 15 page final paper\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 26, 2010",
            "review_content": "\nI thought this class was really badly organized. I could not tell you after an entire semester what Anthropology is or what the significance was of any of the readings we did. The first half of the class focused on the history of ethnography which was interesting but the second half was reading contemporary texts that seemed to have no relationship to eachother beyond that fact that Gregory happened to ahve read them. Gregory is not very insightful and doesn't really know how to engage the students in the class. I thought his lectures were pretty shallow and he seemed uncomfortable with the process of teaching and being in front of the class which was awkward. He made us break up into groups and talk with the TA's during class which was uncomfortable and a waste of time. As an intro class the discussions were pretty useless since no one knew what they were supposed to get out of the books. If you went to lectures it was really easy to get an A though, but not really worth it. You don't really learn anything. \nWorkload:\nMidterm, one paper that is your own ethnography \"research,\" and final take home paper, Reading is about a book a week that after the midterm you don't have to read\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 14, 2010",
            "review_content": "\nProfessor Gregory is probably one of the more \"down to earth\" professors at Columbia. Professor Gregory has a warm manner and truly loves his work, which he tries hard to impart on his students. \nThe other reviews are accurate concerning the TA's involvement and importance in both grading and conceptual clarifications. If also found the TA's to be excellent and informative for the most part. \nOne piece of advice; Make sure that you participate in discussions in class by conveying your interest or at minimum your knowledge concerning the assigned readings. Although this is an introductory course, Professor Gregory takes his material seriously and quickly becomes noticeably withdrawn and disenchanted with an unresponsive class. Professor Gregory is a lecturer that seems to opt for a more interactive setting.\n\nWorkload:\nMidterm, 6-8 page essay, and final (sometimes also an essay)\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 06, 2003",
            "review_content": "\nLectures are often pretty superficial, as the last reviewer pointed out, and Gregory has the disconcerting habit of beginning sentences, interrupting himself, and then never finishing them, so make sure you pick a good TA(s), since they will be actually teaching you the material and grading your exams/essay.  Mine were wonderful.  Discussion sections are optional, but most people go and you should too, at least for the denser readings (also, Gregory assigns up to 300pgs of reading per week).   Professor does a great job of answering e-mail right away, and in-class questions on the material--the class did not feel as anonymous as many large lectures do.\nWorkload:\nIn class essay and ID midterm, book review, and take-home final.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 27, 2002",
            "review_content": "\nGregory gives occasionally entertaining lectures (depending on the book/excerpt you're reading at the moment), however much of what he says in class tends to be fluff. The TAs do most of the real work in discussion section, while Gregory himself doesn't exactly impart nuggets of wisdom to his students. The later readings are more interesting, so don't lose heart at first. Gregory isn't a total bore, however, he doesn't explain, or \"dumb down\" concepts to students. Most of what you'll learn depends on whether or not you actually do the readings. While you do need to go to lectures, be sure to pay attention to the texts.\nWorkload:\nAn in class mid-term, a 5-6 page book review on a book on the syllabus, and a take home final\n"
        }
    ]
}