{
    "prof_info": [
        {
            "prof_name": "Simon Schama",
            "prof_id": 568,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Reading and Writing Narrative History (Seminar)",
            "review_date": "December 11, 2005",
            "review_content": "\nThis course is offered about as frequently as England gets a new queen - Schama is just that badass that he's a university professor who has to crawl out of his knighthood only once a century or so to teach.  If you happen to be around for this sesquacentennial occasion, here's what one young history major to-be thought.  The organization of the class is very interesting - you tour through some of the best \"narrative\" histories ever written, and by narrative Schama loosely means written so that the reading of it is fun.  Reading topics range from the history of artificial limbs to the beheadings of various greats.  For your term paper, you write your own narrative history about any topic and critique your classmates, workshop style.  The workshops don't do much to help you get through writer's block, but they are somewhat fun because you get to read some great work and see the kids who are always annoying get chewed out by old Sir Simon.  Sometimes the professor is a little condescending and aloof, but I suppose if I had eight PBS documentaries I might be a little impatient with kids who don't know harry truman from their left buttcheek, too.  To top it off, as a bigwig, he has a budget the size of the science fiction club, and he uses it to bring you dinner on the many occasions when classes are rescheduled because he had to fly off to London to bandy with Prince Charles.\nWorkload:\nTwo short pieces of narrative history writing and one 15 pager.  Very fun assignments if you like to write and want to research a topic you're in to.\n"
        },
        {
            "course_name": "Rembrandt",
            "review_date": "January 21, 2002",
            "review_content": "\nSimon Schama is always entertaining. He's a charmer, an eloquent lecturer, and certainly a showsman. He's also self-obsessed and ungentle. He loves the sound of his own voice and he cuddles up to his fame as though it were a fluffy teddy bear. He lectures with panache, he's sharp as a tack, and I honestly loved going to class. I learned a lot. He's tough on presenters after they've given a talk; he likes to interrupt, and if you displease him he will happily embarass you in front of the class. Schama is also, surprisingly enough, open to new ideas and takes his students seriously when they speak. A corollary is that he assigns a lot of reading and expects that everybody's done it and come to class ready and able to discuss. He reads and grades papers quickly.\nWorkload:\n2 papers (5 & 10 page minimum), 1 presentation, participation (he's not patient with those who didn't make the time to read)\n"
        },
        {
            "course_name": "Reading and Writing Narrative History (Seminar)",
            "review_date": "December 31, 1999",
            "review_content": "\nThis quaint middle-aged brit is one of them famous professors, who spends more time getting knighted and such than teaching or holding office hours. But that's all fine and good, and I'm glad his career is kicking ass. His big shtick is to emphasize the role of the historian to speak to the public, rather than to other historians; for Schama, this means making history appealing through illustrating the human aspects present in every history, and through using a storytelling style rather than a bland academic one. This is a fascinating approach and a subject for wild debate, but only rarely does he fully address the many questions and issues his quest raises. Schama has a lot of brilliant analysis to give; I think, though, that he could do a better job of challenging himself to dig that brilliance up. Too often this class was just a string of empty, lit hum-style ruminations on various works of history, without enough attention given to the deep questions that those works brought up about style, approach, and adherence to truth.\nWorkload:\nA typical seminar workload: lots of long books, and a long (25-page) paper in a style of narrative history. The reading stopped at midterm, however, and we concentrated solely on responding to the work being done by our fellow classmates. A cool approach to organizing the semester's work.\n"
        }
    ]
}