{
    "prof_info": [
        {
            "prof_name": "Philip Gross",
            "prof_id": 802,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Programming Languages: C#",
            "review_date": "May 18, 2005",
            "review_content": "\nThis is a professor that comes painfully close to amazing. He's a fantastic lecturer and actually kept my attention for most of the gruelling 2 hour sessions. He's funny and has great talent at explaining concepts. The homeworks are very well put together, as they challenge the student just the right amount for what you learn. Unfortunately, outside class he's not quite as good. He seemed to be having a busy semester, but his turnaround time for grading homeworks, responding to emails, and sending out final exam grades were far longer than they should have been. I'd definitely take another class with him, as there are weaknesses, but they're in the non-essential areas of teaching.\nWorkload:\n4 Homeworks (average about 2-3 hours each), Final Exam of reasonable difficulty\n"
        },
        {
            "course_name": "Programming Languages: C#",
            "review_date": "April 26, 2005",
            "review_content": "\nPretty good prof, he is pretty leniant and will go out of his way to be available out of class, but his lecture notes are not very helpfull, and  often takes a long time to post solutions and sample code. all in all the class is tought more as a transition to C# for Java programmers and less as a class on C#.\nWorkload:\n4 programs, in increasing dificulty, and a final, very dificult.\n"
        },
        {
            "course_name": "Programming Languages: C++",
            "review_date": "April 23, 2002",
            "review_content": "\nBad but not bad enough. i've seen worse. at least he brings some programs to the class athough he does not care about explaining them. \nWorkload:\na lot it will kill you\n"
        },
        {
            "course_name": "Introduction to Software Engineering",
            "review_date": "December 09, 2001",
            "review_content": "\nRun don't walk away from the hell that is Computer Science!!!!!!! If you don't want to sleep, don't want to see friends at all, go ahead. Lots of work. Teacher unrealiable. If you insist don't take SoftE, you lucky people have a choice now. \nWorkload:\nHell! A huge project, group work, tons of reading which no one ever did. Not too much fun. \n"
        }
    ]
}