{
    "prof_info": [
        {
            "prof_name": "Veli Yashin",
            "prof_id": 12909,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 29, 2014",
            "review_content": "\nPros: \n- Relatively easy grader\nCons:\n- Easily angered. Two notable examples: 1. someone mentioned game theory in the class and then forbade anyone else from mentioning it ever again without giving the class a 10 minute lecture on the topic. 2. a student went to visit him during office hours and was welcomed in by the other grad student who shared his office even though Mr. Yasin was not there at the time. Upon returning, Yasin became offended and harshly criticized the student for going into his office without him being there.\n- Discussions were disorganized and he would comment only to further confuse issues, and not in a way that was academically rigorous--he would most often just misinterpret what someone was saying.\n- He would routinely arrive late for class (to get Starbucks, of all things)\n- Obliquely criticized particular students; passive-aggressive.\n- He offered inconsistent, contradictory and vague instructions and feedback for essays.\n- Biased against engineers for whatever reason.\nThe class was not enjoyable. Several people switched sections after the first semester and the rest stayed because of the one pro listed.\nWorkload:\nStandard CC coursework: class participation, two essays (each with a minimum requirement of less than ten pages), a midterm and a final. The passage IDs on the exams were easy to identify, but were worth a disproportionate amount: by missing one ID on the midterm you were guaranteed B at best (83%).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 14, 2014",
            "review_content": "\nDespite the fact that this was Veli's first time teaching CC (and a class in general I think), he showed that he could definitely guide the class to understand the different texts in relation to each other.\nHe decided to teach CC to prove that it could be more intellectually stimulating than it was when he took it.\nHe's obviously really smart and did a pretty good job explicating certain concepts. I'd say the one thing he should focus on is better guiding discussions for the class. \nIt often seemed like he let us make points and just go back on forth on those until someone else brought something else up. I would have liked a bit more structure instead of depending on the questions the presenters asked. \nAbout half of the class from the first semester stayed, although I think he was much improved in the second semester. Along with the new students, he was just more open and approachable which I think led to a better class dynamic with more lively debates occurring. \nHe was very receptive to feedback and it showed that he took his role as a preceptor seriously. \nVeli's a very fair grader, although the amount of points he takes off per the portion of the overall grade can seem a bit daunting and the feedback he gives back is very minimal.\nIn all, I definitely learned to both appreciate and better evaluate the texts we read in CC, thanks to in particular the extra reading Veli introduced to our class. \nWorkload:\nBasic CC readings with some extra 20th century stuff that analyzes western philosophy.\nTwo papers a semester. At least one 15 minute presentation that could be done with a partner.\nMidterm and Final were made up of several passage IDs and essays that required outlines.\n"
        }
    ]
}