{
    "prof_info": [
        {
            "prof_name": "Katharine McIntyre",
            "prof_id": 11172,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 12, 2014",
            "review_content": "\nTAKE THIS CLASS WITH KATE. Especially the second semester.\nShe is the ideal Lit Hum professor- both extremely knowledgeable and accessible as well as great at generating class discussion. She always has excellent points to bring up about each text, including potential criticisms of it and implications for modern life. In fact, she makes a point of trying to connect the texts back to our own lives which I found refreshing since it can feel pretty pointless to go through the whole Lit Hum syllabus if it isn't being made relevant in some way. \nShe makes sure everyone gets a chance to contribute during class discussions and raise their own points, never shutting down anyone's argument but also not letting people make sweeping generalizations or statements without supporting them. \nSERIOUSLY, by the end of the year she actually made me think a lot about my own life and the world I live in through the way she taught and had us engage in the texts which is beyond valuable. She also revised the syllabus so that we got to read some more modern and diverse writers. \nIn terms of assignments, she is a fair grader (though not an easy one) and makes her expectations very clear. She provides tons of useful feedback and genuinely just wants to help you become a better writer, reader, student, etc. There are 3 essays, progressively longer and with more room for interpretation and creativity as each semester progresses. \nKate is a fantastic professor who will teach you a lot, make you question many things, and create a sense of community in your class. She is friendly, intelligent, understanding, and generally amazing. So count your blessings if you are in her section and transfer into it if you can. \nWorkload:\nReasonable- 3 essays, midterm, final, very short quizzes on each text assigned \n"
        }
    ]
}