{
    "prof_info": [
        {
            "prof_name": "Cherrymae Golston",
            "prof_id": 1954,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Beginner II",
            "review_date": "May 14, 2006",
            "review_content": "\nShe is very dedicated to her work.  There is no arguing that fact.  However, her style just did not work with me.  I came to Columbia having never taken a day of Spanish in my life.  I needed a professor that understood that Spanish is not second nature to some people in the class.  The fact is, Golston thinks that in a Beginner Spanish II class, everyone should be able to speak and because of a few students who are too lazy to take the level they are ready for, the majority of students who are at a Spanish II level end up suffering.  She teaches to the minority, not the majority.  If you are good at Spanish, by all means take her.  She will gear the class towards you.  However, do not take her if: You want an easy A, you have no background in Spanish (preferably an extensive one), and you don't want to deal with little busy work homeworks everynight.  You learn a lot, if you sleep with your textbook at night, not from her directly.  \nWorkload:\nTests after every chapter (which are very difficult--even she admits), homework everynight (which she never checks), midterm and final exams, and an oral exam.\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "April 12, 2006",
            "review_content": "\nIf you want to be extremely confused and disoriented for majority of this class, take this professor.  She talks incredibly fast and most the time I couldn't understand her.  Most of the work in class has nothing to do what you are learning or goes along with the book.  With this being said, she does care a lot about you learning Spanish.  I would not recommend taking her if you don't have an extensive knowledge of Spanish even though this is an elementary class.\nWorkload:\nHomework almost every night which she rarely checks or goes over.  She gives a test at the end of each chapter which is probably the most difficult test you will ever take.  Midterm, final, and compositions.  \n"
        },
        {
            "course_name": "Comprehensive Intermediate Spanish",
            "review_date": "January 17, 2006",
            "review_content": "\nProf. Golston does like participation, but she encourages some fun and thoughtful participation from her students, who often get excited during the discussions. She genuinely wants her students to be as excited as she is and to really learn the language. She speaks very clearly and fluently though she is not a native speaker. What stands out most is that she is a caring individual that wants to hear your voice--we will often stray from the informal course plan to talk about something she believes is more important. She will talk occasionally about her family and personal life...so maybe you will be lucky enough to have her husband as professor as well (he is a gold nugget, by the way)!\nWorkload:\nYes, there is some busy work, but that is all expected when learning a language. A few compositions that she has you correct, tests (she drops the lowest score), and the occasional dialouge or group story/presentation. Definatley manageable.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 20, 2005",
            "review_content": "\nNot too bad, but I would recommend that you take this course with a different professor.  She loves class participation, so if you are not willing to speak up in class, do not take this section.  Her quizzes and tests are pretty easy, but she gives a lot of busywork for homework.  I did not enjoy this class at all, but it was tolerable.\nWorkload:\nBusywork, quizzes, and a midterm and final.  Not hard, but annoying.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 16, 2005",
            "review_content": "\nReading the two previous reviews on CULPA, I was severely disappointed with Senora Golston;  I had taken four years of Spanish with really phenomenal teachers, so the drop in teaching quality once I got to Columbia really caught me by surprise. Classes were very unstructured, the book similar to the one teacher scoffed at in 9th grade, and Golston's attempts to explain grammer only made the class more confused until she could come back the next day after having gone back to her office and asked a real Spanish teacher.  I could not help but notice that the class's fluency scarecely improved over the semester, and the super-light-almost-nothing workload did not help to build our vocabularies.  She's very nice, but does not have to skills to judge a student's language profficiency and help improve it.  Basically, if you want to pass the language requirement with the least effort possible, this is a good option, but if you actually are interested in learning Spanish then don't waste your time.  \nWorkload:\nVaries; alway's light, sometimes literally nothing.  There was a very small scale project towards the end and a couple of very easy one page papers spread out over the course of the semester.  \n"
        },
        {
            "course_name": "Latin American Culture Through Conversation (SPAN 3101)",
            "review_date": "May 19, 2004",
            "review_content": "\nSra. Golston is an extremely nice woman. She is dedicated to helping her students improve their spanish. She is more than happy to meet with students during office hours, etc. My only complaint about her is her seeming lack of preparation. Sometimes she seemed a little lost in class, so she told us to just kind of talk (in spanish) amongst ourselves. It's possible that I mis-read these situations; maybe this was really how she wanted to run this kind of strange conversation class. I also felt like she could have encouraged a little more conversation and a little less reading out of the (bad) textbook. All in all, she did a pretty good job teaching a class that any spanish-speaking person could teach. In fact, she is probably over-qualified to teach this class. In general, I would recommend her, as she is extremely kind, and clearly cares about her students. \nWorkload:\nVERY light. This class was extremely easy, especially compared to upper-level spanish literature classes that many people in the class have previously taken. The homework assignments were usually to read stories that are like 2 pages long. These stories were then discussed in class. There were no written assignments at all. Grades were based on participation, attendance, and 2 oral presentations (first one about 10 min, second one about 15 min). The presentations were graded a little more harshly than I thought they might be, but good class participation will make up for that. Sra. Golston planned on having a final oral exam, but decided to use the second presentation as the \"final\" instead. You probably won't find a much easier class at Columbia!\n"
        },
        {
            "course_name": "Beginner Spanish 2",
            "review_date": "January 18, 2004",
            "review_content": "\nWhen our first Spanish prof left after a few weeks, we were all a little frightened by the prospects of what kind of replacement Columbia could muck out of New York's muddy waters.  To our relief, we had Sra. Golston, a vast improvement over the previous prof.  Not only is she sweet and patient, she can actually explain how Spanish works!  I actually learned a great deal, which means something after 6 years of spanish teachers who were dolts.  I highly recommend her.  The class is enjoyable, and you'll even learn something.  My only complaint is the book, which is too colorful and happy, and reminds me of textbooks in the sixth grade.\nWorkload:\nIt's fine.  It's not ridiculously easy, and it's certainly not impossible.  If you study for the quizzes she gives once every two weeks or so and do the homework, you'll be fine.\n"
        }
    ]
}