{
    "prof_info": [
        {
            "prof_name": "Mike Woodsworth",
            "prof_id": 3440,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "History of the City of New York",
            "review_date": "November 20, 2009",
            "review_content": "\nMike is a really sharp guy; he used to be a journalist, so he's full of interesting information and he doesn't like BS. If you make an assertion in the discussion group, be prepared to defend it, because he will press you on the reasons behind your interpretation. He doesn't do it in a confrontational way; he comes across as honestly curious about your reasoning, which is a pretty cool feeling if you know what you're talking about. If you didn't do the reading and you're just saying something to fill the void, however, he'll recognize it in a heartbeat. Plus, he's cute, as are all the TA's in History of the City of New York. \nWorkload:\nNot too intense; biweekly discussion sections with well-reasoned responses to the readings due before each one. Come in with some specific questions or opinions (and some evidence to support them) and you should be fine. \n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "April 28, 2008",
            "review_content": "\nMike is awesome.  He is really intelligent, respectful of the students' opinions, doesn't make anyone feel stupid.  We had really interesting discussions in our section that I felt helped me understand major themes better, and probably helped me do better on the exams.  I felt like I really got something out of going to recitation.\nYou have to do more work with Mike than with the other TAs, but it's worth it, and it will help you.  If you have the opportunity, choose Mike as your TA!\nWorkload:\nPost a ~700 word response to the book we were reading that week.  The response could be anything.  He didn't grade them on content, just to make sure we were doing them.  I found them really helpful to look over other people's in my recitation to study for the exams.  It was a good way to keep you on top of the reading.\n"
        }
    ]
}