{
    "prof_info": [
        {
            "prof_name": "Tri Dang",
            "prof_id": 10760,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Corporate Finance",
            "review_date": "May 22, 2014",
            "review_content": "\nOverall, I enjoyed this class and learned a decent amount. The only issue I had with Prof. Dang is that he's pretty quiet/softspoken, so if you don't sit in the front you can't really hear him all that well, and he also doesn't tell people in class who are being rude and talking to stfu. Dang is a really nice prof and a pretty funny guy, would agree with below reviewer on his personality. He obviously cares about the students (he is super nice, super helpful, always willing to answer questions) but he doesn't take the class too seriously, in my opinion... his jokes are funny. Because of his softspoken personality lectures can get kind of boring, unless you are super into the material. \nThe second half of the course is less theoretical than the first, and we actually look at cases, so the class gets more interesting as the semester goes on. The first half of the course is a LOT more theoretical and some of the stuff could get complicated and I didn't really get everything, but everything you need to know for exams is in the homework, and once you figure out how to do the problem you're fine. TAs also were very helpful. \nThe BEST part about this class, in my opinion, is that it's such a laidback class. If you pay attention you will learn a lot about the topic... if you need a more low-key class though you don't really have to go to lecture b/c everything you need to know is in the slides. There are five problem sets, three pre-midterm, two post-midterm, doing them is really important because the exams are basically exactly like the problem sets. Gonna echo the last reviewer and say at least 80% of the exams are the exact same type of problems as in the homeworks, and he gives practice exams as well. Final is non-cumulative, on the last day of class. Both exams are completely open-book and open-note. This is a fairly easy and straightforward class... the material can get difficult and complex, but it's easy to do well as long as you do the work before exam day. \nWorkload:\n5 problem sets - 20% total - couple hours each, max\nmidterm - 40% \nnoncumulative final - 40% \n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "November 02, 2011",
            "review_content": "\nThe review below is completely unfair. Tri Vi is generally very good, very clear, and very straight forward. \nIt is true that he teaches a 'liberal arts' version of corporate finance. He is more concerned with the theory of corporate finance, and his grading reflects this emphasis on approach, not execution. It is also true that his lectures can seem boring. However, this is a by-product of highly structured and well-organized slides. Missing class is not a problem. And I suspect that most students in the class are happy enough taking a class in which finance is the focus. \nHis assignments (of which there are only 5 or 6) can sometimes seem challenging, but working through them pays real dividends come exam time. And the exams are at least 80% homework problems. Despite the opinion of the reviewer below, I found the exam questions to be absolutely explicit, especially if you've done the homework. \nTri Vi has a slight accent, but it is not debilitating. He obviously knows his stuff, and he's a super friendly guy. He's also refreshingly incisive and to-the-point when it comes to describing investment banking, private equity, and taxes. This makes class kind of funny. \n\nWorkload:\n5 or 6 problem sets. Open note midterm. Open note final. None of this is too painful, in my opinion. \n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "December 21, 2010",
            "review_content": "\nHe was horrible. His lectures were boring and unorganized, and you cant even understand what he says half the time. Literally 10 people would show up for lectures out of a 70 person class. His teaching is highly theoretical and has absolutely no real world application. Instead of teaching us the concepts behind corporate valuation, he gave us matrix problems about no-arbitrage. The wording on the problem sets and exams is like a child wrote them--you have no idea what he is looking for. He requires you to buy a textbook that is not even remotely useful--not that the book is bad, but he just makes everything up as he goes along. His problem sets--of which there were only 5 for the semester--were full of material that was not in his class notes (which he posts on courseworks...often late), or in the book. If it hadn't of been for the TA, there would be no way to solve half of the problems in the homeworks. I did not learn a thing from this guy, which really is a shame as I was looking forward to this class. Avoid this guy like the clap, he will ruin your semester--and I got an A in the class...\nWorkload:\nHomeworks arbitrarily assigned on information that was never gone over. Midterm and final were open book, which didn't help much when you couldn't understand what he was asking for. \n"
        }
    ]
}