{
    "prof_info": [
        {
            "prof_name": "James Schamus",
            "prof_id": 1431,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Seeing Narrative",
            "review_date": "May 02, 2007",
            "review_content": "\nProbably the most intellectually engaging interdisciplinary course you can take at Columbia. We read Kant's Critique of Judgement, John Ashbery, Tanizaki, Alberti, and watched Herzog, Bergman, and an Italian slasher flick. Professor Schamus can seem intimidating, but as long as you are engaged with the intellectual debate, you will get a LOT out of this class. If you're looking for a film theory class, this is not it. Amazing professor. One of the best courses I've taken yet at Columbia. \nWorkload:\nChallenging reading material, as mentioned above. A final 20-25pp paper.\n"
        },
        {
            "course_name": "Film Theory I",
            "review_date": "February 07, 2007",
            "review_content": "\nLet's admit it.  Everything about the Columbia film department smells of pretention.  From the harsh grading to being a department that is somehow above posting discussion sections ahead  of time-like everyone else in the school-you're like, please.  But.  If they all were as cool as Schamus, they could carry the ego.  Very good teacher.  Intent on teaching.  Very friendly.  Good man.  Good course.  Take a class and join the fan club. \nWorkload:\nFairly hard.  Definitely a manageable workload but the readings are dense.  If you didn't read them, absorb it, understand lecture and the like, they really will notice.  Grading slightly hard.  Not at all cruel but definitely not an easy A.  On the upside, I'm writing film papers currently and, now, I understand the language and pov of the theorists.\n"
        },
        {
            "course_name": "Film Theory",
            "review_date": "January 09, 2007",
            "review_content": "\nThis is a difficult subject and Schamus does a good job with it.  He drops names, yes, but we all want to hear them.  I think it's cool that a guy in the business is interested in teaching a class about theory.  Grades depend entirely on who you have as a TA if you are an undergrad.  \nWorkload:\nTwo Quizzes (IDs and essays from the reading), a midterm paper of about 5 pages, and a final paper of about 7 pages.  \n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "April 11, 2005",
            "review_content": "\nYes, Schamus is very, very bright, perhaps the most intelligent professor that the film studies program has.  He's also very smug and less interested in fostering debate or discussion than letting students talk amongst themselves before explaining his own definitive interpretation of the material.  I appreciated his incorporation of challenging texts into the class (Benjamin, Lyotard, Kristeva, etc...), but I think that he is aware that few film studies students have had exposure to this sort of material before (a fault of the department), so he only offers a very rudimentary take on some very complex theories.  His method is to allow students to make comments or ask questions about the reading and then call on each other, while he sits and watches.  This leads to an engaged class, but there's no effort on his part to guide the class towards asking the right questions.  Much of the time feels inevitably feels wasted when someone blathers on with their total misreading of Marx and he doesn't step in and say something.  The best part about the class might be his position as co-president of Focus Films and his insight into how the movie industry really works.  We'd meet on Mondays and he'd spend the first minutes of class talking about the weekend box office, what we'd seen, what we liked, etc...  That said, it's hard to not be a little cynical when he has us read Adorno's \"Culture Industry\" essay and then to see him gleefully talk about how great his company's remake of Assault on Precinct 13 is.  \nWorkload:\nEssay a week, thesis work, a few minor papers.  Very manageable.\n"
        },
        {
            "course_name": "Film Theory I",
            "review_date": "January 12, 2005",
            "review_content": "\nI have to agree with the other reviewers -- Schamus is absolutely brilliant and puts to shame every other professor i've had so far. His class is difficult, but in the end, extremely rewarding. He says in the very beginning that he will grade harshly, and sticks to his promise. However, his insight and ability to connect film with philosophy not only dazzle you, but allow you to understand the otherwise difficult readings. The films he shows vary from the typical (Potemkin) to the not-so-frequently-seen (Close-Up), but are always relevant to the reading and usually enjoyable. He deserves to be the rich and famous man that he is. Hands down the best Columbia class i've taken. \nWorkload:\nHard, sometimes long readings, that always turn out rewarding; 2 papers -- he claims he gave only 6 A's and A-'s on the first one (75 person class); 2 exams that are only check-ups and can pretty much only help your grade. \n"
        },
        {
            "course_name": "Film Theory I",
            "review_date": "December 27, 2004",
            "review_content": "\nThis class was amazing.  Schamus is blatantly brilliant-- the best professor I've had so far at Columbia.  The class, being theory, is very philosophical; it will relate more to CC than any film class you've taken.  Some people may not like this deviation from the typical film class, but those people are boring.  The class is definitely a challenge, but it is incredibly rewarding.  Most film classes give you in-depth analyses of a few movies....so you can talk about those movies....but I feel like this class allowed me to walk away with a different perspective on the world.  Not gonna lie, the reading is dense as hell, but you shouldn't worry if you don't get it at first.  Schamus somehow makes everything clear and comprehendable.  Take this class! And yes, he does screen a brand new Focus Features film for the final.\nWorkload:\nA bunch of reading-- sometimes 150pgs/week, sometimes 15, but always dense and time consuming, but really really interesting.  2 papers- graded harshly (by TAs), but rewarding to write.  2 quizzes that are just a check up to make sure that you're reading (not too bad). \n"
        },
        {
            "course_name": "Film Theory I",
            "review_date": "March 09, 2003",
            "review_content": "\nPay attention to James Schamus and with luck, maybe you'll be as successful as him.  He is the co-president of Focus Features--you know, that production/distribution company that put out The Ice Storm, Crouching Tiger, Hidden Dragon, Far From Heaven, and The Pianist.  He's considered a prolific screenwriter, and he has a few producer credits to his name as well.  All that aside, he is an incredible professor with an extensive background in film theory.  Kinda makes you think--someone who knows this much about classical film theory can put it to use and work with Ang Lee to pen The Ice Storm and Crouching Tiger, Hidden Dragon?  He makes the material--some of it can get a bit heavy-handed at times--quite understandable.  He also likes to chat up the audience for the first ten minutes of class, asking what movies everybody's been seeing and if they liked them and whatnot.  He actually very interested in student responses to new releases--not only to incite some discussion about recent films but also to get some imput in terms of his role in the film business.  All around great professor in the film department, and I highly recommend him.  Why the hell can't they kick Milena Jelinek out and have Schamus teach Script Analysis I don't know!\nWorkload:\nA midterm and final test--neither of which really count for anything and 2 papers.  On the day of our final he screened a print of The Pianist for us several weeks before its release.  \n"
        },
        {
            "course_name": "Seeing Narrative/Narratives of Seeing",
            "review_date": "January 14, 2003",
            "review_content": "\nSchamus is flat-out brilliant, probably the best teacher I've ever had. The class is incredibly hard to get into--he only takes about a dozen people--but do whatever you can. It doesn't seem to have much to do with film at first. (Not to mention the 300 brain-cauterizing pages of Kant that are the core of the whole affair.) Patience. \nBy the end, it all comes together in amazing ways--and the class turns into a little community. \nWorkload:\nStaggering, but worth it.\n"
        }
    ]
}