{
    "prof_info": [
        {
            "prof_name": "Michael Shnaidman",
            "prof_id": 3414,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "4105 Probability ",
            "review_date": "January 15, 2011",
            "review_content": "\nMichael Schnaidman is not a jerk...but he is not a good professor.  His lectures were always confusing, and he usually focused on theory.  There were many cases were the material was difficult to comprehend, but he did little to clarify.  He also went out of the country for about two weeks and left us in the hands of a grad student.  The book is more for the proof lovers(good for some, bad for most).  If you take this class, I recommend referring to a free online pdf stat book for actuaries: \nhttp://grove.ufl.edu/~fass/Exam%20P%20Study%20Guide.pdf\nThe class was ridiculous...\nWorkload:\nRelatively easy homework in the beginning with permutation, but begin to get terrible when you realize you don't learn much in class, and that poisson distributions are not easy to grasp.  Easy midterm, horrible final.\n"
        },
        {
            "course_name": "4105 Probability ",
            "review_date": "December 31, 2010",
            "review_content": "\nWhile the textbook for this course is very good and the weekly problem sets were interesting and valuable...\nThis guy is terrible. He's probably a nice guy but he's absolutely clueless during lecture. He read off of notes and didn't know what he was doing. The midterm was really easy and the final exam was really hard. This could be a really good course if it weren't for this guy's incompetence. Everything I learned in this class I learned from the book. If you have this guy as your professor, switch out of the class, even if you think you can get the A.\nWorkload:\nProblem Set (Takes 1-5 hrs) each week\n"
        },
        {
            "course_name": "Probability",
            "review_date": "December 21, 2010",
            "review_content": "\nI had him for Probability 4105 Fall 2010.  It has been a miserable experience.  Like the others who took Statistical Inference last year, I found his teaching to be completely useless, if you can call it that.  He just reads from notes, doesn't explain much of anything and teaches random things that have little to do with the homeworks or the exams.  The homeworks were very time consuming, but they're worth doing to learn the material (about the only way you were going to).  The midterm was surprisingly straightforward and many people did well.  Sadly the final was absolutely impossible, and we have no idea how he will be grading.  He claims he does not curve which is going to be an absolute disaster, if true.\nWorkload:\n9 homeworks (lowest grade dropped) 30%\nMidterm 30%\nFinal 40%\n"
        },
        {
            "course_name": "Survival Analysis",
            "review_date": "January 20, 2010",
            "review_content": "\nHad him for Survival Analysis. He's a fair teacher as far as the stats department goes. He does teach and his lectures are useful.\nHowever, only if you're reading the textbook simultaneously. He's not a social person but he's a nice guy. He normally stays after class\nto answer all questions. \nExpect a reasonably challenging course. Read the book. And do the homeworks. Don't copy with the homeworks without understanding them like I did.\nHad him for Survival Analysis. He's a fair teacher as far as the stats department goes. He does teach and his lectures are useful.\nHowever, only if you're reading the textbook simultaneously. He's not a social person but he's a nice guy. He normally stays after class\nto answer all questions. \nExpect a reasonably challenging course. Read the book. And do the homeworks. Don't copy with the homeworks without understanding them like I did.\n\nWorkload:\nRegular homeworks. 2 midterms. A final. All quite reasonable.\n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "January 05, 2010",
            "review_content": "\nI had this professor for 4107 Fall 09. It was a total waste of time. It's probably a good brush up course if you already know the material. But if you want to learn something, you are out of luck. I truly wonder how many people actually understood what he was attempting to communicate in class. The failure comes mostly from his nonchalant attitude to the teaching responsibilities. I don't think he put in much time preparing for the class, even after almost everyone flunked the midterm. The students are left in chaos as the class\nmaterial, homework and exam only remotely correspond. I don't mind tricky questions, but they only make sense when the basic concepts have been grasped. The truth is with this class, you struggle after class and spent much time on your own just to get the basic concepts. The Prof's teaching is not contributing anything in that regard. \nWorkload:\n8 homework, very time consuming if you want to actually understand it\n2 quizes\nmidterm, final\n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "December 28, 2009",
            "review_content": "\nI totally agree with the review about him. I was in his fall 2009 Stats Inference class, and it was a totally painful expireance. Schnaidman works in industry, and it was clear that he ran the class as an after thought. He used another professor's notes and read straight from them. He would literally list off theorems. After a while, most people stopped going to class, or showed up periodically for the announcements. The notes didn't really match the content of the class, and were pretty theoretical. Everyone was stumped by the midterm (he doesn't teach us anything, and throws tons of curveballs on tests). The class was completely disorganized, with most people feeling like they were failing. I think he's probably going to have to curve a lot in the end, but it still won't be worth the miserable experience.\nWorkload:\nhomework that's pretty time consuming if you actually try to understand it rather than copying straight from the manual. towards the end when he realized we were behind, we were covering 2 chapters a week. ridiculous.\n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "December 24, 2009",
            "review_content": "\nI had this guy for W4107-Statistics in the Fall 2009 semester.  He was a horrible professor, spending all of the lecture time reading word-for-word off of a PDF document that listed key definitions and theorems from our textbook.  He clearly did not put much effort in the class at all, and did not believe he should be putting any effort into lecturing because he thought it was the students' responsibility to ask questions if things were not clear.\nThe best part of the class was that we used Casella and Berger's Statistical Inference textbook, which has a handy solutions manual for the majority of the problems.  The worst part of it is that we essentially did one chapter a week, covering chapters 1-9 over the course of the semester.  The mid-term covered Chapters 1-4, and the final exam was cumulative, with focus on Chapters 5-9.\n\nWorkload:\nHomework                                        15%\nMidterm Exam                                    25%\nFinal                                                   40%\nQuizzes (2 or 3)                                  20% \n"
        }
    ]
}