{
    "prof_info": [
        {
            "prof_name": "Fabio Nironi",
            "prof_id": 9786,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "February 13, 2013",
            "review_content": "\nI found Professor Nironi to be very difficult to learn from.  He spend the majority of class time proving the formulas and equations that will be used on his problem sets rather than giving examples of how these tools will be used.  I found this immensely frustrating and aside from the first two weeks of class (which were easier and more clearly taught), I learned 100% from the textbook.  This is no exaggeration.  I would sit through class, pay attention, take notes, and grasp only about five minutes of lecture.\nI went to his office hours several times to ask questions and while he was very eager to help, his explanations often continued to go over my head.  I ended up getting most of my help from the Barnard Help room.  (Keep in mind if you decide to do this, only some of the TAs there are familiar with Calc III material so make sure to take note of when they're there.)\nProfessor Nironi also offers a voluntary recitation on Fridays.  I couldn't make it due to a conflicting class, so I can't comment.\nFurthermore, only one problem set out of nine were returned over the semester, making it very difficult to learn from my mistakes.  He also doesn't believe in posting answers to practice exams, so you won't know which concepts you're getting wrong until you get your midterm back (i.e. too late).\nHe writes his midterms to be longer than any student could complete and then grades entirely based on the curve.  This seems intimidating, but actually can work to your advantage because on exams you can entirely avoid one topic that you just couldn't understand and focus more on the things you did understand.\nAlso, no Webassign.\nOn the whole, I would say that Professor Nironi is a fair professor who is ideal for the student who is absolutely in love with proofs and the more esoteric side of math.  If all you're looking for a solid and clear understanding of Calc III, he's probably not the professor for you.\nGrading:\nNine problem sets, worst two dropped. %20\nTwo midterms.  Best one counts for %25, other counts for %15\nOne challenging, but doable final counts for %40\nWorkload:\nOne reasonable problem set per week.  Usually took me 4-6 hours, maybe 8 on the hardest ones.  He drops your lowest two.  He also offers extra credit problems which are significantly more difficult.  Challenging, but manageable.\n"
        },
        {
            "course_name": "Intro to Modern Analysis I",
            "review_date": "January 11, 2013",
            "review_content": "\nProfessor Nironi is fantastic, Most of the reviews that have been posted here are very misleading and are probably written by dumb students. I did both modern analysis 1 and 2 under Prof. Nironi's guidance and thanks to him i acquired a solid understanding of Real analysis. Any course on mathematical analysis is bound to be rigorous, if you cant handle mathematical rigor, this course is a strict NO, if you like math and if you are passionate about learning math, then this is the most basic course that you need to master. I didnt have any prior background in topology/analysis or any other fancy stuff that has been mentioned in other reviews. Prof. Nironi explains the concepts very well and his notes is excellent. Infact i prefer his notes to the prescribed text(Rudin) just because its more accessible than Rudin for a novice. He is very helpful(There were instances when he went over the entire proof when i had trouble understanding the proof)and his grading too is fair. I do agree that he gives difficult(but thought provoking)mid term exams sometimes and he does it deliberately to gauge the level of the class. He adjusts the difficulty accordingly in subsequent examinations. Over all it was an enjoyable experience learning analysis 1 and 2 from Prof. Nironi. \nP.S. If you cant understand what Prof. Nironi is teaching then you are simply not good enough for studying real analysis , drop the course otherwise you will inevitably screw up and post another misleading review here !\nWorkload:\n1 homework a week\n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "January 03, 2013",
            "review_content": "\nI agree with both of the previous reviews. Fabio Nironi has no idea how to teach a class.  After observing other analysis classes, there is a clear difference between the teaching those professors gave and that of Nironi. They helped, he recited.  De Silva was amazing, Nironi was terrible.  Take it with her or whoever else.  The last review talked about how Nironi made the midterms 20% and 30% and the final 50%, and I agree it's unjust.  Yeah maybe people cheated, but that's the real world and Nironi, after all that schooling, should learn to deal with it.  That's why the homework is only 20%, if people didn't cheat the homework would be 100% rather than putting 80% of the grade on random sit-ins prone to error.  \nThat's not to say cheating is a good thing. I'm sure the class would have loved to have done the problem sets, but you see other professors assign 4-5, maybe 6 problems a week from Rudin. And those problem sets take forever.  Nironi assigns 10, and they're mostly the most obnoxious problems Rudin provides.  The class almost felt like this guys revenge on people who didn't appreciate math like he did.  I mean the proof of Rolle's theorem, probably one of the easiest questions on the exam, still takes a fair amount of ingenuity to pull out of thin air.  He has no idea how to write a test because the problems he assigns for homework can take 3 hours to hammer out in your head, and the questions on the exam were harder than those on the homework. \nIt's not like he went out of his way to help anyone. He didn't host review sessions, answer questions well, post any notes after like the second week, collect the problem sets (we had to drop them in his drop box on our own time), or even tell us when he assigned homework or when it was due.  His method was simple,  Assign the first three questions from the last chapter and the last 7 (very annoying ones) from the previous chapter.  He did squat for this class.  Office hours were pointless or absent, and you'd never see your problem sets even if you attended because he tended to lose them in his train wreck of an office.  The only point where I disagree with the previous reviews is where they claim he cares or is even a good person.  He's lazy (he desperately ran through half the material when he realized he was far behind) but he wants to be brutal out of some misguided idea this will make us all love and be better at math.  His worthless presentations and claims of A+'s are just excuses for his apathy. I'm dead serious, stay away. No matter how well you'd do with him, you'd do better with someone else teaching.\nWorkload:\nAn unreasonable amount:  9 homeworks of 10 problems each. some required topology textbooks, others were just painfully long.  One was 11 pages for me.  The exams literally require that you've seen and remembered the proofs elsewhere, they don't test your knowledge of a process taught by him but of a process either taught in topology or something completely unrelated to analysis (what was his stuff on commutative maps?) or your memory of a proof from some topology book or a half a page long proof in rudin.  \n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "December 30, 2012",
            "review_content": "\nI agree with the previous post. To sum it up, I think Nironi's teaching style punishes, rather than encourages, students who are learning the subject for the first time; for example, from personal experience, he doesn't give much partial credit on exams, if it all.\nFinally, at the last second (way after finals), he decides to completely disregard the homework portion of the grade (20% of the final grade), saying that most students copied from online sources (which I assume is b/c while most students did relatively well on the homeworks, only a handful did well on the exams). I don't agree with this in three aspects: 1) homework problems are much easier than the ones on the exams b/c they're open book and there's no time constraint 2) even if students did find solutions online, it's not that much different than looking up solutions in the student manuals, which is available for many math classes 3) while some may have cheated, some may have actually gotten help from other students or tutors. To drop 20% of the final grade and make the final exam worth 50% after the exam had already been taken, I think it's unfair.\nNironi is a likable professor but his teaching style discourages students who are learning the subject for the first time. The material as difficult as it is, on top of that, with no homework grade and no partial credits on exams and an exam format that favors students who have a strong background in the subject (exams are structured in a way that there are more questions than you have time to answer, which naturally favors students that are familiar with the subject from the start), his teaching method is extremely unforgiving for newcomers. I'd recommend taking this class with some other professor.\nWorkload:\nfinal workload completely different from the original one in the syllabus (not sure if he's allowed to change it?) but it's 50% final, 20% 2 mid terms (25% best 15% worst)\n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "December 25, 2012",
            "review_content": "\nUnfortunately previous reviews for Nironi also hold in proof-based classes. I'd like to say he's very dedicated to the subject and looks to share that inspiration, but I feel there are some problems with that.  First of all he quit posting homework solutions after the fourth problem set, and when people requested more solutions he emailed the class and told us to Google them.  In fact, he didn't even hand back our homework, you had to be lucky enough to find him in his office.  \nSecond  his office hours were a real pain, immediately after the class at a time where almost anyone would have another class to attend, and he wasn't particularly personable when he was available. of all he pretty much just lectures straight from the textbook, it even sounds as if he's reading to you.  Some people find it a virtue when a professor follows the textbook closely, but that wasn't really the case.  Rudin's exposition is so much better than most people didn't really take any notes or pay much attention at all to his lectures, which are particularly hard to follow anyways.   \nThird, he mostly, with some notable exceptions, just lectures straight from the textbook, it even sounds as if he's reading to you.  Some people find it a virtue when a professor follows the textbook closely, but that wasn't really the case.  Rudin's exposition is so much better than most people didn't really take any notes or pay much attention at all to his lectures, which are particularly hard to follow anyways.  As for those exceptions, he adds in a ton of topology, far past what Rudin found necessary.  Some of the definitions in Rudin are esoteric but that's because they make the material more fluid.\nFinally, while on the note of topology, quite frankly if you haven't taken topology and algebra don't take analysis with Nironi.  He really presumes you know a lot of mathematics beforehand even if he claims this is where everyone should start in college.  I was in topology for about half the semester and I could clearly see that the handful of us had a clear advantage over those who didn't know what all his additional topology was going on about.  This was particularly obnoxious on the first midterm and to some extent the second midterm where half the material was literally topology, which is fine only as far as the second chapter is concerned, not when he expects you to pull the product/box/discrete topology out of some spark of innovation and work with it.\nOther notes, his exams were pretty much a free for all, especially the first one wherein he just put a ton of questions without even knowing how many points there were total and told us to run with it. I guess that's fine if you want to do a ton of stuff on an exam, but he wound up curving the average, a 48 or so out of 200 something to a C.  There was a clear distribution based on previous background.   Second midterm was alright, and the final was a pain. \nI guess he also realized at the second to- or last week of the semester that he was pretty far behind, so he pretty much crammed differentiation and integration into a week or two and made a problem set due Monday (we were a Tuesday Thursday class) without any announcement (I was particularly unhappy about this since I turned it in unknowingly on Tuesday and have yet to get a grade for it) and then he jammed both the integration and differentiation into a problem set due on study week.  \nHe tries to be generous with presentations and extra credit. I did a presentation, its 5 points and given his curves Im not quite sure how valuable that was, if those points are even for tests.   The extra credit assignment I handed in twice and he never noticed I guess, I'd have given it to him at office hours but, you know...\nLet's put it this way: If you have a lot of math background, you'll kill in this class.  If not, stay out. Either way, you'll probably enjoy it a lot better with Savin, De Silva, Masdeu, whoever else is teaching, and you'll have a reason to come to class.  I really think he's a nice guy and he probably means well, he just needs to figure out what he's doing.  Maybe disregard this review when it turns brown/green with the \"5 years ago\" statement, he needs to grow has a teacher.\n\nWorkload:\n20% 9 problem sets with breaks given randomly but he says he'll disregard them if you do really well on tests, 2 midterms (25% your better `15% your worse), final 40%.\nHe assigns the worst, i,e. 5-part with little benefit in return, problems\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 19, 2012",
            "review_content": "\nHis biggest pitfall is that he doesn't take in to account that everyone learns things differently; that each student has a unique way of understanding concepts. \nI thought I was just bad at learning calc because I couldn't understand concepts like he did, but I realize that's not the case. I took calc 2 simultaneously  with calc 3, and I did significantly better in calc 2 because that professor took the time and effort to explain concepts in different ways that suited my way of thinking. I'm not saying that my ability to learn solely depends on the teacher's ability to teach - the student also needs to show initiative and willingness to learn (which I do - I'm not throwing $60,000 a year to not learn). But there's need to be a balance; efforts need to be made on both sides in the right way. Nironi doesn't make that effort, either because he doesn't want to or doesn't know how to. No doubt he's an intelligent man, but not a good teacher.\nWorkload:\nweekly problem sets; 2 midterms; 1 final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 19, 2012",
            "review_content": "\nI thought I wanted to be a math major...until I took Nironi's class. He is a very smart guy and approachable, but he doesn't understand how to communicate with students, particularly students learning a subject for the first time. I went to his office hours for the first half of the semester, but I always walked out even more confused. Recitations weren't that helpful either. homeworks are useless for studying for exams (he said that himself). exams aren't meant to be finished (he said that too). he doesn't give solutions to past exams, so I struggled a lot when I tried practicing on my own and with classmates too.\nOther students may say that Nironi actually makes you learn real math rather than regurgitate theorems and formulas. But I disagree. I felt that Nironi could have done a better job of laying down the basics before throwing us into the deep end. I've never felt so discouraged about a class before. \nPlease take this as a fair warning - if you want to keep your sanity and have a decent GPA, don't take Nironi's classes (at least the basic level ones). \nWorkload:\nweekly problem sets; 2 midterms; 1 final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "July 08, 2012",
            "review_content": "\nProfessor Nironi, or Fabio as we affectionately call him, is incredibly dedicated to teaching in the most basic sense: his goal is to make you learn math, not to make it easy or fun.  I took Calc II and Calc III with him.  He will put in many extra hours to help his students; he holds an optional recitation to do homework problems and frequently meets with students in his office.  That said, while he works extra hours, so will you.  My classmates and I spent a great deal more time working for his class than our friends in other sections.  I really recommend finding a study group within his class, that was super helpful for me.  \nDo not take Fabio's class if you are easily frustrated, entirely uninterested in math, or just want an easy A.  I felt that grading was very fair, but the averages were brutally low, so much so that your raw score was basically meaningless.  I got an A both semesters, but I worked really hard and enjoyed a lot of the math.  \nAs a person, Fabio is a wonderful, kind, eccentric, brilliant-professor type.  I sincerely appreciated how he would be knitting an enormous fuzzy sweater during our midterms and some of his better comebacks when people asked annoying questions.  He also never intentionally made me feel stupid (and I asked a fair amount of questions).  He would never think of sending a student to a TA without helping him/her first.  He didn't even trust the TA's (with good reason) to grade our finals.  \nI'm really glad that I took Fabio's class, but it certainly wasn't easy.  Best of luck!\nWorkload:\nA problem set (usually pretty long) every week.  Two very hard midterms, but with a fair curve.  An extremely hard final (usually with averages below 50%), but a fair curve.  Harder than most Calc II or Calc III classes, but not unmanageable.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "June 29, 2012",
            "review_content": "\nSo, indeed, prof Nironi is a very smart guy, HOWEVER this is not an excuse for his poor teaching abilities!! \nThe class was incredibly hard. Nironi assumes that all student have previous knowledge in clac 2 and linear algebra and spends all of the class period doing crazy hard profs on the board. \nHe often teach material that is not included in the syllabus or in the book, which he gives handouts for; but good luck with understanding them.\nIt came to a point where the  TA's in the help room didn't knew how to solve his hw, and exams questions.\nThe exams are Incredibly hard. The average for the first midterm was about %45 (!) and it did not resembled the practice exam or the hw problems in any way. \nBasically, nothing can prepare you for this class, so do yourselves a favor and take it with a different professor.\n\nWorkload:\nWeekly problem sets . He drops the lowest two.\n2 midterms and a final. All crazy hard.\n\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 25, 2012",
            "review_content": "\nI wish I could say something positive about Fabio as a professor, but ..... he is pretty useless for students who IS NOT math geneius. His explanations are way too complicated and very theoretical. You can never solve a homework unless you read a book, get a help from tutors, and have solutions from previous years.\nHis lectures are very demotivational and makes you hate math. Most of the people didn't attend his lectures at all and managed to get a better grades than some of those who attended. \nOn the positive note, he is a friendly guy who is willing to help, BUT his explanations are way too complicated and very theoretical :) So this professor, definitely NOT for people with average knoweledge in math. \nWorkload:\nWeekly HW set: kind of manageable: 15-20 questions every week, BUT do help you to get ready for tests at all.\n2 Midterms: review sessions do not  help at all and just confuse you. Last year tests that he gives as a sample were much easier than an actual tests he gave us.\nFinal:  extremely difficult if you tried to study from professor's explanations.  The only way to pass it is to use every available help for CALC class throughout the semester, and study from the book on your own. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 15, 2012",
            "review_content": "\nTake this class if you are an aspiring mathematician (or masochist). Otherwise, there is really no reason to put yourself through this. Fabio is really easy-going and niceâ€”he wears sweats and a power rangers shirt pretty much every classâ€”but his explanations in class tend to be unnecessarily complicated and abstract. I found that I was better off learning from the book, except he likes to diverge from the book sometimes. For instance, he taught us second order Lagrange, which was not in the book at all. But the real trouble with this class is the exams. For the most part, the problems on the exams are nothing like any of the problems from the book. Preparing for his exams felt pretty hopeless for that reason. \nWorkload:\nweekly problem sets\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 17, 2012",
            "review_content": "\nThis class was hell, to put it simply. He spends class periods going through long and complicated proofs, which he can't clearly explain and which he doesn't often completely finish. \nHe knows the knows the subject a little too well - he'll give explanations that skip several steps, which would be fine if we weren't trying to learn the information for the first time. He will backtrack and explain if you ask him to, but often his explanations become more convoluted with time. And because he's so familiar with the subject, he has his own method of solving problems that don't correlate at all with the textbook and don't make sense to a lot of students.\nHomework isn't bad, provided you go through the textbooks explanations and use the math help room for any questions you have. However, once homework starts including his practice tests, your kind of screwed. I've taken the test to the help room and had TA's be completely stumped, and asking me if I was sure it was for Calc II and not a higher class. Unfortunately, these practice tests are a good reflection of what the midterms and final look like, meaning not good.\nReview sessions before the test - eh, go if you want to. It probably won't actually help, but feel free. I went to all of them, and each felt like a waste of time.\nWorkload:\nHW is pretty manageable. About what you'd expect.\nTwo midterms, the first of which isn't bad at all if you learned the info in high school, the second is considerably worse. He actually offered extra credit, the scores were that bad.\nOne final that is absolutely, depressingly impossible.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 29, 2011",
            "review_content": "\nCalc II with Prof. Nironi was pretty much hell, even for a an engineering major with a pretty good math background. He is a very nice, understanding person but he isn't very good at explaining the topics. He makes Calc II way harder than it has to be by teaching techniques not included in the textbook and spends every lecture doing confusing proofs. He didn't even finish the syllabus so I still haven't learned parametrics or polar coordinates. Unless you are a talented, math major AVOID AT ALL COSTS. He's a nice person but this class is not worth it.\nWorkload:\nNot too bad but the problems he makes up himself are very difficult\n2 impossible midterms and a depressing final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 15, 2011",
            "review_content": "\nProfessor Nironi is a great guy. He is very nice and takes time to help a student in the middle of his lectures. His lectures can get a bit confusing at times, but if you skim the text book your notes will start making sense. He has many little quirky mannerisms that if you pick up on will allow you to really enjoy going to class. Homework is reasonable and the midterms are fine if you study for them. He is a pretty generous grader and will give out a few A+s.  Overall I really enjoyed my Calc 2 experience and I am taking Calc 3 with him. \nWorkload:\nProblem sets every week: 1-5 hours of work 20%\nBetter Midterm: 25%\nWorse Midterm: 15%\nFinal: 40 %\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 11, 2011",
            "review_content": "\nProfessor Nironi is a passionate professor and is very dedicated to his students. His love of mathematics sometimes results in complicated explanations, but (lucky for me) he is willing to spend hours in his OH explaining those concepts.\nHe is approachable and genuinely kind, which is more than I can say for many other professors at Columbia. The work is straight forward, and he is a professor who loves assignments that force you to understand the material. His work is extremely unforgiving for students who love to memorize algorithms.\nAll in all he is challenging, but not malicious nor pompous, which is what learning mathematics should be about.\nP.S.I AM NOT A MATH MAJOR.\n\nWorkload:\nWeekly problem sets that he is willing to help with if you attend his OH. Bearable amount.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "September 06, 2010",
            "review_content": "\nI never understood what this guy was talking about. He's Italian and has a strong accent, and pretty poor English. At one point, we had to explain to him that \"remainder\" and \"reminder\" are different words. For some reason, his handwriting is really weird too. X's look just like N's, which can make taking notes hard.\nThese communication barriers made class more or less useless. At the end of the semester, almost no one was even bothering to show up. Like, literally, three people. I always did for some reason, but I probably shouldn't have bothered.\nYou can mostly rely on the book, but I would look for another teacher if, like me, you need someone to explain mathematical concepts to you before you really get them. I'm pretty sure I would have done better in this course if I'd had a professor I could understand.\nPersonally, though, Professor Nironi is a really nice guy who's willing to answer questions and help people out. He's occasionally a little funny.\n\nWorkload:\nNormal / not bad.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 23, 2010",
            "review_content": "\nFabio Nironi is too brilliant for his own good.  His lectures are complicated and hard to follow with an abundance of unnecessary notes.  Stewart's explanations will usually do the trick though, so study out of the book when the time comes.  The problem sets will definitely help to understand the material.  Before each midterm and the final, he ran two review sessions-- not entirely a good use of time, but he occasionally drops a problem that might show up on the exam.  He gives a good curve on exams and gives you credit for as much as possible, so write down everything you can think of even if you have no idea how to solve the problem.  I got a 45% on the first exam and it was a B-, and a 61% on the second and it was an A.  It's not the end of the world if you skip lectures but if you do, definitely keep up using the textbook.\nHe's occasionally funny, but most of the time, lecture's a bore. \nWorkload:\nWeekly problem set with extra credit that's reasonable but still challenging; takes at least an hour to do. He drops the two lowest at the end of the semester.\nTwo midterms and a final which are all ridiculously hard.\n"
        }
    ]
}