{
    "prof_info": [
        {
            "prof_name": "Sarah Sasson",
            "prof_id": 2304,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Third-Year Grammar and Composition I",
            "review_date": "November 15, 2009",
            "review_content": "\nThough Sarah Sasson is a nice enough person, she is extremely scatterbrained and just doesn't have her shit together at all. She was consistently 5-10 (sometimes 15) minutes late for class, was horribly disorganized and took ages to return our papers, which she kept in a huge disorganized pile somewhere at the bottom of her huge disorganized bag. \nThe reading material for this class is extremely light and she's a really easy grader. She even lets you re-do all your essays if you get less than an A-. She's also really lenient with missing class and making up any sort of work, including essays and quizzes. You'll probably be mildly bored 90% of the time, but you won't want to kill yourself either. Take it if you need to fulfill a requirement and you want an easy A. \n\nWorkload:\nVery light: several poems, a few very short stories, a Moliere play and short book (you don't really have to do the reading as long as you make crap up and participate a lot in class). Three 3-4 page essays, 3 grammar-based quizzes, midterm and final. \n"
        },
        {
            "course_name": "Third-Year Grammar and Composition I",
            "review_date": "May 18, 2009",
            "review_content": "\nHere's the deal: this class is easy if you take it with Professor Sasson. Basically you go to class twice a week and speak in French about things sort of related to some syllabus. I liked it, but I could see where others in need of more structure would not. I didn't do any of the readings and I ended up fine. I really like Mme Sasson as a person, she's funny, caring, and nice. She lets you speak French which is what is supposed to happen in a French class, but sometimes she doesn't explain things well to people who don't understand basic French grammar rules. If you already have your French grammar down and are just trying to take French Lit classes (which the dept doesn't let you do unless you take this class first), take this class and it'll be a breeze.\nWorkload:\na few papers, short quizzes, easy midterm, and final\n"
        },
        {
            "course_name": "Intermediate Conversation II",
            "review_date": "April 21, 2009",
            "review_content": "\nWhoever said that Sarah stressed them out from lack of work is slightly neurotic. As far as a conversation class goes, Sarah was a great professor! She really does create a very relaxed and open atmosphere, and this class was a nice contrast to the other French class I took the same semester, for which I always had work. \nThere seemed to be no real syllabus or direction for the class, but the comfortable atmosphere gave me a lot more confidence to speak, and she is very good about introducing you to idioms and slang - things you might actually use in conversation!\nThe only downside is that I was never sure what I was being graded on, seeing as there was practically no workload apart from a few readings and 1 oral presentation. \nOther than that, if you want a relaxed, easy class to improve your conversation skills, this one is a no-brainer!\nWorkload:\nhardly any\n"
        },
        {
            "course_name": "Third Year French Language and Composition",
            "review_date": "January 09, 2007",
            "review_content": "\nI completely disagree with the previous negative reviews of Sasson. I thought that she was a wonderful teacher. Our class was quite small and this gave us the opportunity to speak a lot of French. Yeah she was late every other day but only by a few minutes, and this didn't take away from the class at all. She always knew what she had planned for the class that day and was extremely friendly and approachable. She is very willing to tailor to your needs as a student because she understands everyone has different backgrounds in their French studies, and was a VERY easy grader. I never got As on compositions in high school, and with her I got an A on every one. She encourages discussions and doesn't mind straying a little off topic to let us relax and really practice speaking. She also takes suggestions on what we want to review, or if we need more time for assignments. Slightly disorganized, but aren't most people? And if you never know  what the homework is, try listening at the end of class (in French) and reading the emails she sends out every other day reminding everyone what the assignment was.\nWorkload:\nEasy, while still learning =D A few short homework assignments once in a while, a page-long composition every other week, and predicatable and well-reviewed test and final.\n"
        },
        {
            "course_name": "third year conversation",
            "review_date": "October 01, 2006",
            "review_content": "\nI highly recommend this class to any student looking to practice speaking French, particularly those students preparing to study abroad. Professor Sasson was open to discussing a wide range of topics, allowing us to broaden our vocabulary base and thus become competent speakers in general. She brought in outside articles and film clips that I thought really added to our understanding of contemporary French society. She really wants to help her students as individuals and is open to meeting with them. This class is a nice addition to a full schedule of reading-based classes.\nWorkload:\n2 presentations on topic of your choice. Other than that, short readings and assignments. I think that more work actually would have been helpful.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "May 17, 2005",
            "review_content": "\nWow, those reviews are pretty harsh. I had her for both 1201 and 1202 and despite her disorganization, I thought she was pretty amusing and she created a very relaxed atmosphere in class. At first, she seems a bit rude but after a week, you just learn to laugh at her mistakes and she does the same. She makes up for her lack of organization by being an EASY grader and a funny person. She is late from time to time but she really doesn't care if you have to leave early. I'll admit, it gets annoying but basically, the class is a joke. If you really want to learn a good deal of French and you're expecting a challenge, I wouldn't choose to have her as a professor.. but if you are just trying to fulfill your language requirement and are pretty good at French, her class isn't that bad if you can relax and appreciate her \"whims\". She also teaches you French slang and very French sayings.. good for travelling abroad! She's really not that bad and if you have her, you're in for a less-than-perfect but amusing class. \nWorkload:\nNot bad at all... a quiz every few weeks.. make sure she tells you what vocab. is on it, that shit always got me. A composition every few weeks.. 1 page long, very easy. Mid-term and final.. she curves them slightly. \n"
        },
        {
            "course_name": "Third-Year Grammar and Composition I",
            "review_date": "April 23, 2005",
            "review_content": "\nI am writing this to reiterate what was previously stated on CULPA about this professor- do NOT take this class.  If you do, prepare to be confused, do NO substantial work, and be very stressed out about it.  It was a relatively small class, usually three or four people were missing every time.  She is ALWAYS late, often we'd sit there for ten minutes waiting for her to show up, and she'd run over time and get annoyed that the rest of us usally had class in some far off location that we always ended up having to run to . . .  She was NEVER prepared for class and would be annoyed that we never were either - then we'd get annoyed at her because she was completely unclear as to what we should be prepared to do.  We learned early on NOT to prepare for class  because if we did it would just be a HUGE waste of time and we wouldn't end up discussing the material for at least a week.   Her worksheets usually had mistakes on them that we would find and have to correct (this was not an exercise but her making mistakes and confusing us once again) and they were generally unhelpful and had poor explanations of rules.  \nWorkload:\nConfusing- the syllabus did not look too grueling, however, it's psychologically exhausting to try to keep up with her whims.\n"
        },
        {
            "course_name": "Third-Year Grammar and Composition I",
            "review_date": "December 22, 2004",
            "review_content": "\nAVOID PROFESSOR SASSON LIKE THE PLAGUE.  She is by far THE most disorganized, unprofessional, irresponsible instructor I've EVER had at Columbia.  For starters, she was psychologically incapable of following the departmental syllabus.  No one in the class ever had a clue as to what we were supposed to do for the upcoming class, let alone the upcoming weeks.  Classes usually consisted of us painfully trying to discuss some reading that no one had done, or going through packets of grammar worksheets (which she always had us go collect from her box in Philosophy because she could never remember to make photocopies of anything.)  Even when there was preparation to be done, it didn't mattter if you did it because discussions often digressed into her giving a soliloquy on some unrelated topic.  She seemed to assign things at random, and often only when she realized she HAD to make us do something.  Due dates were generally fuzzy, negotiable, and/or irrelevant.  All in all, this class was the bain of my existence, and I think my french actually got WORSE thanks to her.  Despite the lack of work, this class totally stressed me out because of her unclear expectations.  It was a complete waste of my time.\nWorkload:\nSeveral ungraded grammar worksheets, light reading (unevenly distributed over the semester), 3 short compositions, and 1 slightly longer one--you'll be lucky if you ever see a grade on these.  2 challenging grammar exams (since you didn't learn anything), and 1 lengthy grammar final.  When she gets around to grading your work, she's pretty easy on you--maybe because she feels bad for not teaching you anything.\n"
        }
    ]
}