{
    "prof_info": [
        {
            "prof_name": "Anne-Marie Bouche",
            "prof_id": 2846,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 05, 2006",
            "review_content": "\nI absolutely loved Professor Bouche. She's a great professor and obviously knows a lot about  the art we learned in class. She never gave us busy work; the assignments that she gave were really meant to teach us something - for example, the problems of drawing a 3D object into a 2D paper. If you get her for art hum, consider yourself extremely lucky!\nWorkload:\nVery little. She gave us something to read only once or twice during the semester, we had a 2 pg paper and an 8 pg paper to write. A few other assignments were scattered through the semester - these were mostly drawings, etc.  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 19, 2006",
            "review_content": "\nI really liked Bouche.  Every day before class she would sit and talk w/ us, joking around.  She always took extra care to make her own slide shows, saying that the ones provided by the department were insufficient.  She really tried to encourage us to say what we thought about each piece and really did make the class worth going to every day. I came out of there w/ a much better appreciation of fine art.  I'm saying this despite the fact that I had to take it at 9am.  She didn't make us buy any books or do any reading either.  Her assignments were creative and fun (the first thing she had us do was to draw Low Library, in order to get an appreciation of the effort put into it).  Get her if you can.  Although it may seem like there was a lot of writing involved, there really wasn't.  These papers analyzed the art, but she didn't expect you to cite any sources or look at expert opinions: only to say what you thought.\nWorkload:\nReally light.  1 HW, 1 short paper (discussing the architectural effect of the St. Paul's Chapel), 1 10-12 pg paper comparing two works, in-class midterm, in-class final\n"
        }
    ]
}