{
    "prof_info": [
        {
            "prof_name": "Claudia Kelley",
            "prof_id": 13771,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Russian I&II",
            "review_date": "May 19, 2020",
            "review_content": "\nClaudia is a STAR. She cares so, so much about her students. She once emailed her students a poll on their learning styles so she could make sure there were studying materials that suited everyone. She makes so many handouts and is constantly holding office hours and taking the time to meet with her students. She genuinely wants everyone to succeed and if you show that you are willing to put the effort in she meets you at that level of dedication by doing everything she can to help you succeed. She's definitely not a fan of people phoning it in though, with all the work she does she expects you to work hard as well. Also, she has very chaotic energy and is just very energetic in general. I can't recommend her enough, I absolutely loved her class. \nWorkload:\nFirst year Russian is a 5 credit class, there is a heavy workload but that's the nature of the course not her teaching. \n"
        },
        {
            "course_name": "First-Year Russian I",
            "review_date": "April 16, 2020",
            "review_content": "\nClaudia is one of the most caring instructors I've ever had the pleasure of learning from. Russian I is no joke. My first year in Russia could have been terrible and painful (because the class was at 8:50AM every morning and Russian requires learning a whole new alphabet/grammar system), but Claudia made it the best experience. \nShe's not as organized as some of the other teachers, but 1) she's only marginally less organized and 2)the level of dedication/care she devotes to her craft (teaching) is insane and wholly trumps that small level of disorganization. \nYou'll have so much fun in her class. Claudia is kind, quirky, and an awesome choice for your first year in Russian or Polish. I wish she could teach the second or third year! \n \nWorkload:\n> Very heavy, but this will be the case for you no matter the teacher you take. They give the same workload. \n> Weekly quizzes (usually on Thursday or Wednesday) \n> Nightly homework\n> One midterm (oral and written)\n> One final (oral and written) \n> Participation \n"
        },
        {
            "course_name": "First-Year Russian I",
            "review_date": "December 12, 2019",
            "review_content": "\nI am really glad that I was in Claudia's section of this course. The effort that she put into making sure that her students could gain the most from this course was really apparent. Not only did she return our assignments in a very timely manner, she would also take pictures and email us corrections of the homework assignments we had turned in the day before a quiz or exam so that we could have the corrections that evening while studying for the quiz. I was particularly impressed by her powerpoint presentations and the charts she had created to help us study difficult concepts. Whenever the textbook explained something in a way that was at all unclear or if any of the students were confused about something Claudia would (usually that night) make incredibly organized and comprehensive charts, diagrams, and lists to help us with what we were having trouble with. Claudia has put the time into getting to know each one of her students and sometimes has even catered the assignments to our individual needs.  \nWorkload:\nvery heavy, but as should be expected with a 5 credit course\n"
        }
    ]
}