{
    "prof_info": [
        {
            "prof_name": "David Baldwin",
            "prof_id": 364,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "American Foreign Policy",
            "review_date": "April 21, 2004",
            "review_content": "\nThe fact that this man has managed to become a well known political scientist and is tenured at a place with people like Waltz and Jervis is just one of the universe's great mysteries.  As one reviewer pointed out, if you know ANYTHING about the regions he discusses, you will want to bang your head against your desk repeatedly because Baldwin seems to know very few accurate facts about the topic - you know, foreign policy?  His class on the Cuban Missile Crisis was in and of itself a great puzzlement.  The man does not seem to actually know in what years the Cuban Missile crisis took place.\nThe one redeeming thing about the class was a terrific TA.  Justine Rosenthal knew her shit, ran discussion sections smoothly and efficiently, and was very responsive and helpful, especially if you made the mistake of occasionally showing up for class and confusing your knowledge of world events (likely correct) with Baldwin's knowledge of world events (divorced from reality).\nWorkload:\nIn theory, an absurd number of articles, books, etc.  In reality, it's a take-home midterm, a long-ish paper (I think it was 10-12 pages) and an in-class final.  Don't ever go to class (seriously, ever, it's a giant and very boring waste of time), skim enough readings to be able to cite something where relevant, and go to section the majority of the time.  You'll do very well.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 04, 2004",
            "review_content": "\nHmmm..what can I tell you that you haven't already heard? True--this is not the best class ever but it is not the worst. If you have no prior knowledge of foreign policy, you'll learn the essentials. You might be able to learn a couple of other things from Baldwin's lecture, but they're not too insightful. \nThe good news: you dont have to go to class or the TA sections. Read the articles in the books (preferably right after he assigns the paper)...mention the authors and their ideas..present a balanced argument, and your'e set. As for the other books--well just look at the chapter reviews and skim. \nWhile I was somewhat amused by the many times Baldwin was interrupted, I did not find his lectures to be THAT boring. But then again I dont bore easily. \nWorkload:\nfew readings, 10 pg midterm, 10 pg term paper; 1 in class easy final \n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "December 28, 2003",
            "review_content": "\nDO NOT TAKE THIS CLASS! By far the worst class at Columbia. This class was so boring you'll loath the days that you have to attend to listen to his mind numbing rhetoric of rivisionist non-sense. The class highlights include a devoted cadre of front row occupying sychophants who hang onto every word from this tired relic of a person, constant mis-information and mistakes during his lectures, as well as backrow know-it-all's who constantly interupt Baldwin to interject  meaningless and irrelavant statements. The grading system in his class made no sense as well as the lack of feedback on the two assignments.  Overall you will LEARN NOTHING at all and if you do not know how to politically score a good grade (A.K.A. Grade Grub) you're toast. Baldwin wears the same unflattering outfit to class everyday. In his assignments he is looking for a regurgetation of ideas not original thought. Definately avoid this class and all classes taught by him.\nWorkload:\nTake home midterm and paper. Final is 50% of your grade that can really hurt you. Be warned the grading in this class is completely arbitrary. \n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 16, 2003",
            "review_content": "\nYou'll learn a lot and be able to watch CNN like a pro after this class. The price? Bored silly for 75 minutes twice a week. If you have mild interest in foreign policy or if you get bored easily, avoid this class. But Baldwin does have a lot of interesting things to say if you can keep yourself from doodling all class. By the way, he's an impossibly hard grader.\nWorkload:\nlots of readings, 2 papers, midterm, final\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 07, 2003",
            "review_content": "\nDecidedly an unimpressive course. Yes, you learn some pretty basic material, but this is a whirlwind survey of foreign policy and will leave you feeling ripped off. Baldwin is organized but does not offer any particular insights of note, save the occasional jab at the military establishment to which he apparently was once belonged. The readings are basically articles from Foreign Affairs magazine (NOTE: DO NOT BUY THE $100+ READER, AS YOU CAN GET ALL ARTICLES ONLINE FOR FREE) and a couple of books which require relatively brief skimming in order to write the two papers assigned--fixed topics. Can't say it was a complete waste, but not much to gain either.\nWorkload:\nTwo papers and a final, lots of articles that you can read pretty much at your own discretion.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "December 21, 2002",
            "review_content": "\nMy goodness, three positive reviews and one negative for Baldwin - I dare say I must cast my lot with the negatives.  The most arbitrary and subjective grading I've ever encountered at Columbia.  Gives us nothing but informed opeds to read for course material, and yet lambasts us for producing the same in our papers.  Not ON the papers, mind you - \"feedback\" is not a word in Baldwin's vocabulary.  \nYou'll learn the nuts and bolts of foreign policymaking, and then move on to a glossy, useless section on regional issues, where you will sit chomping at the bit to point out the factual and analytical fallacies in his lectures if you have a profound-ish knowledge of any particular region.  It's awful.  Awful, I tell you.  I should have dropped it, but kept holding out hope that things would turn around.  They didn't.  Run.  You're better off reading Foreign Affairs and the international section of the NY Times.\nWorkload:\nIf you're not a poli sci major, it looks like a lot of reading.  If you are a poli sci major, it's a normal work load, lots of articles you can polish off in a half-hour or less.  Two 8-10 page papers, final consisting of three essays (no IDs!).  No mandatory section, which is nice.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "December 11, 2002",
            "review_content": "\nSounds like a cool course, right? But with a rotten professor, it was as nightmarish as the subject matter itself. Do not take this class!!!\nWorkload:\nWay too much, with way too little feedback. Grades that were so arbitrary I wondered why even try...\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "November 15, 2002",
            "review_content": "\nBaldwin is a reasonably entertaining and definitely intelligent professor, but it hardly matters; a junior polisci major could teach this course just as well. It's a cross between high school American history and intro to int'l politics. Great course if you've never taken polisci and want an overview of foreign policy, but PoliSci majors, avoid; you'll be bored to tears.\nWorkload:\nVery light for a polisci course: takehome midterm, paper, in class final. Graded reasonable easily.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "May 06, 2001",
            "review_content": "\nBaldwin is a great lecturer. Some people think he's incredibly dull.. I, on the other hand, believe that he hits each topic, which he lays out on the board before class begins. It's funny to watch Baldwin lay into his TAs when they are late or forget to do something. If you get bored in class you can laugh at Baldwin's perpetual wardrobe. He wears the same clothes every day. If you want to get an A, buy him a new shirt... he will be eternally grateful. Baldwin is very difficult to talk to outside of class. Like most other Columbia professors he won't remember your name.\nWorkload:\nnot too much reading.. take home mid term, and a final\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "December 31, 1999",
            "review_content": "\nBaldwin's lectures are very clear and organized. The class material is interesting, though he is not especially engaging. Overall, the class is very good.\nWorkload:\nLots of reading. A take home midterm, an 8-10 page paper, and a final. Not an easy class.\n"
        }
    ]
}