{
    "prof_info": [
        {
            "prof_name": "David Rosner",
            "prof_id": 4964,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Social History of American Public Health",
            "review_date": "December 22, 2010",
            "review_content": "\nWhile I definitely agree with what much of the previous post said, I think it gives the class a little too much credit. As a person, David Rosner is by far one of the most interesting people I have ever met. However, lecture can become redundant. If you're one of those students that feels compelled to always go to class and feels guilty about skipping, this class might be the bane of your existence. There are times though when they class is very enjoyable. \nIf your TA is Kylin...switch. \nWorkload:\nWorkload is same as before, except you should make sure you do at least one reading per week.\n\n"
        },
        {
            "course_name": "Social History of American Public Health",
            "review_date": "December 21, 2010",
            "review_content": "\nRosner's class is definitely one of the most interesting that I've taken in my four years here. I bought all the books for the class (about 6) in the beginning of the semester and planned to re-sell them after the class ended, but I'm now going to keep them so that I can read them over break and use them as references for the future. I didn't take many notes during lecture, but all the discussions there and in section were really enlightening and I regret not having done more of the reading. It seemed like most people hadn't done the reading (at least very well), because Rosner had some trouble getting people to participate and answer questions about it, but he was pretty genial about it and assumed the best, which made me feel a little guilty after each class. In addition to going over the reading, we looked at political cartoons, movie animations, advertisements and youtube videos, and had at least two classes when Rosner posted lyrics on the computer screen and we all were instructed to sing along as part of the learning experience. Hands down awesome experience. \nWorkload:\nHefty reading. One Courseworks posting each week based on the reading or discussion, and section each week. Two short papers (one 4-6 page and one 8-10 page), plus a final that consists of several broad essays. Got by doing minimal reading but after each class regretted that I hadn't done more.\n"
        },
        {
            "course_name": "Social History of American Public Health",
            "review_date": "December 21, 2010",
            "review_content": "\nThis was possibly one of the best classes I have taken at Columbia. Rosner gives a great overview of major issues in American public health, beginning with colonial health and tracing the development of cities, epidemics, and bacteriological theory, then moving into issues such as lead, tobacco, AIDs, and vaccination. Rosner is essentially an incredibly intelligent teddybear--he's both extremely experienced in his field but also approachable and really tries to make the class fun and interesting, outlining major themes and mottos over the past few hundred years. I emailed him about my first paper and he not only gave me a million different sources, he also set up a meeting for me with another professor at the school of public health who is an expert in my field--he's always willing to help out students in any way possible and is genuinely interested in both his subject and his students. Definitely take this if it's offered again!\nWorkload:\nShort historiography paper, longer research paper, easy final--1 document essay (on something we read in class) and 2 short answer questions on major themes, section with easy reading\n"
        },
        {
            "course_name": "Social History of American Public Health",
            "review_date": "January 21, 2010",
            "review_content": "\nI took Social History of American Public Health the first time it was offered, in Fall 2009, and I absolutely loved this class. Probably one of my favorite ever in my career at Columbia. It is offered through the history department, but plenty of premed kids also take it so there is a good balance of history and science. It's taught seminar style, with the professor asking a lot of questions, which may sometimes seem boring and pointless as first when your classmates are largely incorrect; however, the arc of the course is broad and extremely clear, and although many time periods are simplified down to a few rules and \"mottos,\" you do come out of the class with a good general idea of what the history of public health has been. The professor himself is amazingly charismatic, very personable - makes a huge effort to learn your name if you speak up in class (even in a class of about 50 kids), draws upon his wide personal experience and generally is humorous and a really nice guy. I think he is offering it again so take the class if you're interested in this type of thing at all. \nWorkload:\ntwo papers - one 5-7 pg. historiography, one 10-12 page original research; recitation section w/ weekly readings (very manageable lengths) and final exam. if you are not clear what historiography is, make sure you know what you're doing before you write the first paper.\n"
        }
    ]
}