{
    "prof_info": [
        {
            "prof_name": "Philip Kim",
            "prof_id": 1589,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Classical & Quantum Waves",
            "review_date": "December 06, 2010",
            "review_content": "\nLet me preface this whole ordeal with the fact that the man is brilliant. He is also extremely cheerful and willing to communicate if you care to do so.\nThat being said this class is one of the most demanding I have taken, nearly requiring most of the class to attend the problem session in order to have a manageable amount of work. When Professor Kim is addressing physical insights and discussing concepts the class moves very smoothly. Former complaints about the man's accent are greatly exaggerated. He is thorough with his material and address every correction of the math in his derivations with a thank you. However, when Professor Kim has to explain advanced math concepts (please note that Math 1202 is, in my opinion an inadequate corequisite) the class was left wanting. Such examples include the use of the Eigen vectors and numbers and the use of Fourier Series. Professor Kim himself expressed that he was disappointed with the class' ability to utilize the latter on exams.\nExams: they take a very long time to grade and get back to the students. In both midterm waves I had 5 exams. His was the first I took, and the last I got back by a lag of no less than 2 weeks compared to the others. They are very long, time will be a factor. Remember this.\nAssignments: These are the striking point of the class. These assignments will take much longer than those for 1601 & 1602. The second assignment of the year took a good 40 or more man hours (you should certainly work in groups) and ~50% of the class dropped the course after this assignment.  To their loss as the course became more interesting after that point. Expect to dump 10 hours or more into an assignment. With this in mind the only way to learn is to do, the better you do on the homework, the more prepared you are for the exams.\nTwidoo (don't worry, you'll get it)\nWorkload:\n(see above) Weekly problem sets(20%). 2 Midterm (20% ea), Final (40%). Curve: exists, data unknown. Attend the problem session and work in groups.\n"
        },
        {
            "course_name": "Quantum Mechanics I",
            "review_date": "March 26, 2008",
            "review_content": "\nI am shocked at some of the reviews that Professor Kim got in the last few years, and I can only chock it up to a very steep learning curve in his teaching style.  Kim is among the best teachers in the physics department, and you will find very few people in the Quantum Mechanics class who disagree.  His lectures are integrated well (heh heh) with the textbook so that they supplement and reinforce each other, and I always leave class with a  better understanding of the material.  There is a lot of material to speed through, but he is very good at boiling down concepts, explaining derivations and getting excited when something cool happens (like the Hydrogen atom).  Quantum was definitely my favorite class of the semester.\nProblem sets are long and difficult - make sure to start at least 3 days in advance - but they build knowledge of physics and useful problem-solving techniques, so you will learn a lot from the problem sets.  Exams are pretty fair: 3 or 4 problems with 1-3 parts, and an average around 60.  The curve is nice.\nSummary: ignore the 1400 comments (a good rule in general) -  Kim should have a gold nugget.  Be prepared to learn some serious physics.\nWorkload:\n10 weekly problem sets, 6-20 hours long (no kidding!), one midterm, cumulative final\n"
        },
        {
            "course_name": "Quantum Mechanics I",
            "review_date": "August 12, 2007",
            "review_content": "\nProfessor Kim was the best physics professor I've had here.  He respected the students, as well as the subject matter and did an excellent job filling in where griffith's ran short.  He ran his own recitation section which turned into a third lecture because there was so much he wanted to teach us.  Depending on the amount of math involved, the hw's took 5 to 40hrs so get mathematica or at least use the integrator online.  The first midterm was extremely long, but the final was ok with the second semester being the opposite.\nHe's a sweet guy that will actually recognize and say hi to you, and is also someone who really knows his physics and teaches it well. This was his second year teaching it and he seemed to have a very clear lesson plan for  each class that left plenty of time for the inevitable questions.  \nWatch out for his TA's though, they have no idea how to run a recitation or help you with your hw.  \nWorkload:\nProblem set per week (usually about 15hrs, less if you use mathematica), one midterm and one final per semester.  This was the most work I've done for any physics class up until this point.\n"
        },
        {
            "course_name": "Quantum Mechanics I",
            "review_date": "May 31, 2006",
            "review_content": "\nProfessor Kim makes this class a pretty painless experience. The majority of his lectures are drawn directly from the textbook (Griffiths \"Introduction to Quantum Mechanics\") and he works through the material at a fair pace, so it's not very hard to keep on top of everything. It was his first time teaching QM, but I think that he did a good job. \nThe homework problems were mainly drawn from the textbook. Overall, the difficulty was typical for a physics class, although some problems were algebraic nightmares, involving endless swarms of integrals.  I'd definitely recommend using mathematica to do at least some of the computations; it'll save you a lot of time. \nThe exams basically regurgitated the material covered with homework problems - if you fully understand the homework, the tests will definitely be doable. The averages generally seemed to be in the 60s or so. I don't know how the grades were ultimately curved, but everyone I spoke to seemed satisfied with their final grade. \nIt's also worthwhile to point out that the homework problems in the second half of the second semester seemed a bit harder than the earlier ones. I also felt the 4022 final was harder than the earlier three exams. It may have been the specific material that we were covering, but I think that Prof. Kim may have been intentionally making everything harder - this may carry over into Fall 06. But everything's curved ANYWAY, so who cares. \nProf. Kim is very approachable and helpful and the class should only get better as he gets more experience teaching it. At times, the mathematical rigor of the class is  questionable (as made evident by the entertaining smart-ass questions that were occassionally asked), but that's expected for an introductory class that covers a wide range of material. Overall, I'd call it a very good experience. \nWorkload:\nWeekly problem sets of varying difficulty. A midterm and final modelled closely after the homework. The total amount of work/studying required is about average for a physics class. \n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "November 08, 2005",
            "review_content": "\nAh, grow up.  If you can't understand Kim, then don't go into physics or engineering, because his accent is fine and many others are much worse.  Also, if you find the lectures boring, then just don't go, because his questions are completely straight forward and you can learn all of the material from the text book.  That being said, I found Kim to be an above average lecturer and a generally excited, friendly, and all-around nice guy.  I showed up two hours late to the final exam and he gave me the full time, when he was entirely within his rights to say forget it.  The curve is also ridiculously high (half the class gets an A- or better), so any small injustices get ironed out in the end moreso than most of us probably deserve. \n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "January 05, 2005",
            "review_content": "\nThere is no way out. He is the only 1403 instructor. I think the 1402 reviews were a little too lenient, and over the years, this professor has become even worse. Possibly one of the most boring lecturers encountered in the 1400 physics track. By week four, the lecture room was half empty. His notes are very concise and organised, and yes, I'll admit his explanations make sense..... if only you could get over his poor grammar and decipher his accent!!! The fact that the 1403 physics was at 9 am didn't help, but again, you don't have a choice, therefore, I shall stop bitching about him and give some advice. \nGO TO THE TA RECITATION SECTIONS because the TA will do the homework for you.... if you don't go, the other students will get full marks for sure and you won't - keep in mind homework is 20% of the grade. Good news is he grades around a B+. Bad news is you have the 1600 dropouts wrecking the curve. The book is pretty good, so use it as a guide, especially since you'll most definitely skip at least 4 or 5 lectures (falling asleep during lecture counts as missing a lecture). Try doing the problem sets yourself. Bank the midterm because the final is going to be a KILLER and no matter what you will have studied, he will ask you to apply the knowledge to situations you've never seen before - three dimensional calculus (calc IV anyone?). The relativity section is a joke so make sure you know that too.\nWorkload:\nWeekly problem sets (20%), one okay midterm (30%), one  killer final (50%) - and by killer, it was a killer: mean 52/100\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "October 03, 2004",
            "review_content": "\nHe's the best professor I've met in Columbia because half of his class gets an A- or better.   His lectures are well-organized but  a little boring. You probably need to know the stuff before going to the lecture.\nReview session \"teach\" you to do the problem sets, which means that the TA actually does them for you and the majority of people attend to copy down  solution rather than to learn problem solving skill.\nWorkload:\nweekly problem set which is pretty challenging that probably explains why there are alot people attending so called review sessions\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "June 06, 2004",
            "review_content": "\ni just could not understand any of the stuff he said, i ended up dropping the class. he does not have power point notes, so you have to go to his class and it is very easy to lose attention in his class because of his accent and his handwriting\nWorkload:\nmedium\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 21, 2004",
            "review_content": "\nKim is a boring lecturer, by the middle of the semester you had around 30 people out of around 150 actually showing up to class (yes, i counted, i told you he's boring). His english isnt good, but its understandable, though it does get confusing sometimes when he mispronounces terms. Kim will simply put u to sleep. his demonstrations NEVER EVER worked and i mean NEVER, he might have gotten a simple one to work once, but that pretty much puts him at like a 2% success rate. Just like 1401, the material goes by way too quickly and you'll only do well if you already know it. Plus you have ppl dropping down from 1600 along with people who took AP physics who all mess up the curve! So if you dont know any physics like me and this is truely your intro to it (like me)...may God have mercy on your soul! Bottom line, all intro physics profs at columbia suck, kim might suck a bit less than others and apparently his exams are easier (though i didnt' notice a difference). If you have to take this class, kim might be your best option simply because he is the better of two evils.\nWorkload:\nTwo midterms and a final. weekly problem sets\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 07, 2004",
            "review_content": "\nMy second semester of being in a physics class that I didn't want to take (engineering requirements suck!).  Prof. Kim was much clearer (terms and voice) in his lectures than my first semester teacher, Elena Aprile.  However, like most classes, students lost interest and stopped showing up to class.  The homeworks are pointless because they are more like proofs of problems.  To understand the concepts is much more important--the review sessions tell you how to DO the problems on the midterms and final.\nWorkload:\nImpossible homework sets worth 10% of final grade, two fair midterms, and a 50% final.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "January 21, 2004",
            "review_content": "\nI don't like bitching and I want to be constructive.  With that said, I had a very hard time in Prof. Kim's class.  It was difficult to understand what he was saying due to his accent.  I don't think he presented things in a clear manner.  I wanted to understand but slowly had to admit that the lectures were really not helping me other than to let me know where we were in the book.  I'm a science major, so I'm not an idiot. I got an A first semester.\nHe is a nice guy and I think he genuinely cares about the students lives.  He's very reasonable about workload and grades.  The main problem was the language issue.  I don't know if he realizes it's a problem.\nWorkload:\nreasonable.  problem sets, but not every week.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 12, 2003",
            "review_content": "\nUndoubtedly, Prof. Kim knows his stuff. But here are some of the small things that make him different from other knowledgable professors: he will always stop at the end of a topic to ask for questions, even if he hardly ever gets any from the students. He introduces a new topic by stressing its relevance and often tries to put thought provoking demos (or examples) into his lectures. What I appreciated in Prof. Kim was his personal involvement in the course: he encourages students to email him and answers emails in detail if necessary, he is there for the midterms and final (and doesn't just leave that job to a TA). He is ready to shift the syllabus, and let students hand in a problem set a few days late, when necessary. Basically, he has a human approach to teaching, and is very accessible to his students.\nSo it's physics 1400, thatÂ’s all one need to say about the material, but Prof. Kim is definitely the best (and most human) teacher for this class.\n\nWorkload:\n2 midterms, final, and weekly problem sets.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 04, 2003",
            "review_content": "\nWell he is a lot better than Aprile, but than again I could be a lot better than Aprile. His lectures are clear, but mostly out of the book. He is receptive to questions, but often gets none from his half alseep class. He is a very very boring lecturer. He tries to incorparte modern examples and experiments which are intresting, but you must stay awake long enough to follow them. Overall, he's the best 1400 professor, but still pretty boring. If only he was more lively than this class would be reallly good. As it stands, you'll learn physics, but might pull your hair out while doing it.\n\nWorkload:\n2 midterms, final, weekly problem sets\n"
        }
    ]
}