{
    "prof_info": [
        {
            "prof_name": "Peter Awn",
            "prof_id": 188,
            "total_reviews": 31
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 30, 2013",
            "review_content": "\nGreat section leader. He encourages much discussion, but keeps it pretty focused to the text. Before each class he emails out about a dozen topics for discussion. Each person has to pick a topic and be prepared to lead a discussion on it. This is GREAT for making the conversation flow, and for people to actually have something developed to say. If you're short on time, you can also use it to help focus your reading.\nHe, unsurprisingly, really likes to bring up ancient Iranian and eastern religions and history, eg Zoroastrianism and such. His anecdotes can be a little repetitive, but if you've seen him talk much about GS you know he likes to repurpose his favorite lines/anecdotes. This can wear thin at times, but they're interesting and he's a great speaker.\nHe's surprisingly available for office hours, but only by appointment. Most of the time you'll be talking about things besides the class, which is sort of the reason to take a section with him.\nHis reputation for harshly grading essays seems exaggerated. I found that he expects you to make a clear, specific argument and use the text to support it. It doesn't have to be particularly insightful or revolutionary, although that helps. He doesn't have to agree with it. Just make a specific argument, and argue it. Then polish your English for typos, grammar, punctuation, etc. He is a stickler for that.\nThe grading structure for his LitHum is similar to his Islam. 3x essays, each worth about 25%, and participation worth about 25%. You must take the standard final exam, but it's functionally irrelevant (\"1%\" on the syllabus). \nWorkload:\nHeavy reading, as you all know. Each class you must pick a topic from the reading and be prepared to lead a short discussion on it. Participation is 24%\n3 essays, 25% each.\nFinal exam, which he doesn't care at all about.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "April 30, 2012",
            "review_content": "\nThis class is terrible. Granted, Professor Awn warns you during drop week that his class is difficult, but drop it as soon as you can despite any interest you have in Islam. There is an abundance of reading, that the material is ambiguous and that the essay topics are difficult to analyze. HOWEVER, he does not tell you that the abundance of required and recommended readings are UNNECESSARY for an 2000 level, undergraduate course. His lectures are pompous God forbid you choose to be a Catholic!  \nThe worst part of this class, as anyone who has ever taken it can tell you, is that bad essay grades are inevitable. NO MATTER what you do or how great your general theses are, they are never developed enough to receive an A. Additionally, you only have four papers each worth 25% (at least, that's what happened in my class), so if you get a C or a D on one of them, you're doomed. By the way, the class average is usually a 75. \nHe does not curve. He does not simplify anything, he's an unreasonable grader, and there is an unnecessary amount of reading. (I'm not talking articles here, I'm talking about having to read the entire Qu'ran.)\nOn a good note, the TA's are amazing. People would most definitely fail this class if they did not exist. \nI'm definitely not the first to advise others not to take this class; it's awful. I recommend taking Intro to Islamic Civilization instead. \n\nWorkload:\nFour essays, each worth 25%, some classes get a final exam.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 12, 2011",
            "review_content": "\nThe reading list is fantastic.  Writing essays for this course greatly improved my academic writing and also helped me learn a lot more from the lectures and reading.  The course is built to give an overview of a HUGE topic, and manages to do so almost seamlessly.   I highly recommend you take this class.  \nI don't want to set unrealistic expectations about the professor, though.  Yes, he is an engaging lecturer.  Yes, he has a fabulous collection of ties and suspenders.  (My personal favorite was the red velvet pants, though.)  And yes, somehow, he reads every essay and leaves a decent number of comments.  However, those comments can be condescending and harsh.  He has every right to be direct; it was just a bit disheartening for me personally.  He's also an elitist.  Those are kind of ridiculous ad hominems; I just thought I'd toss them in because it disturbs me how many people view Peter Awn as some sort of god.\nAll that said, take the class if you're up for an above-average workload for a humanities course and/or are fairly relaxed about your GPA.\nWorkload:\nAn absurd amount of reading, most of which you can skip if you're short on time/energy.  Four eight-page essays.  Final and midterm which only matter if you're between two grades.  Mandatory weekly discussion section.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "April 30, 2011",
            "review_content": "\nDean Awn is fantastic!  In fact, one of his lectures was so effective that I fainted right in the lecture hall.  Just like Dickens, right?  I'm not sure if he noticed.  Thankfully, I was assisted by my fellow classmates.  My first words when I came back to consciousness were, \"What did he say!?\"  The reading is great.  I wasn't able to finish it, but I'm absolutely doing it over the summer!  Also, Dean Awn reads EVERYONE'S essays!  It amazes me that Dean Awn manages to read all those essays in the first place, not to mention return them so quickly!  I love that he doesn't value examinations!  Also, the four essays in this class dramatically improved my ability to craft a truly well-written academic essay.  You should absolutely take this class!\nWorkload:\nLOTS of reading (although not necessary to get a good grade), four eight-page essays (not graded evilly), and an \"idiotic\" midterm and final that don't figure into your grade AT ALL unless you're teetering on the edge.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "April 12, 2011",
            "review_content": "\nI completely agree with the previous reviews about Professor Awn's lecturing abilities: he has charisma, intellect, and an amazing sense of humor. He is completely invested in sharing his love of Islam and it works. I also now have a new found love of suspenders. \nThis is definitely one of the classes in which I have learned the most, and I am extremely glad I took it, BUT in my opinion there was a ton of work. The four 8 page essays are not easy. I learned an immense amount from researching and writing them, but I also think the stress may have cost me 5 years off my life. I'm doing well in the class so far, but I am also working my butt off. So, if you are looking for a light load, this is not it. But, if you're not afraid of working, don't let the papers deter you from taking Awn's class, you will finish the semester being a hell of a lot less ignorant then when you started.\nWorkload:\nLots of reading, but not all necessary. Read what helps you with your papers or what interests you. Four 8 page papers. Also a midterm and a final BUT they are a cinch and are meant to be there to help your grade (I just read over my notes once or twice and got an A). \n"
        },
        {
            "course_name": "V2630 Islam",
            "review_date": "May 03, 2010",
            "review_content": "\nProfessor Awn's course was extremely delightful. He shines as a beacon of subject-matter expertise and pedagogical genius. What sets him apart from other lecturers is his ability to connect with the students and not take himself or anyone else too seriously. His relaxed matter fosters a relaxed atmosphere in which the material does not feel like work. Some of the lectures were a bit dry, which he acknowledges. The majority of the lectures, however, were delightful to attend and very informative. He does not seem to be an extremely difficult grader, though that guess is mere conjecture. The key to success on the essays seems to be thinking critically about the material and writing coherent sentences with proper grammar and punctuation. No witchcraft here. Another nice part of the course is the reading list provided. For every topic on the syllabus, a list of recommended readings is included. I will be referring back to that list in the years to come to deepen my understanding.\nProfessor Awn's class was a diamond in Columbia's occasional academic rough.\nWorkload:\nThere is a fair amount of reading for this course. However, this is one of the courses you can skim the reading if you have a lot of other work to get done. You're best served by doing it, however. Four eight-page essays and a simple final.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "April 15, 2010",
            "review_content": "\nThis is a review of Professor Awn's Islam course. \nI cannot say enough good things about this man. You might think that a semester's worth of twice-weekly lectures on the history of Islam could get a bit dry. In fact, however, of all my classes, this has been the one in which I have laughed the most, been the most entertained, and learned the most. Somehow Professor Awn knows just the right way to present everything so that it seems fresh and interesting. He has a great speaking voice that never descends into monotony; he seems to take deliberate care in applying just the right inflection in his words to keep you listening actively. \nIn addition to his clear academic expertise on his subject, he also seems to have lived in just about every country on earth at one time or another (many, many of his stories start \"When I was living in...\"), and he has a wealth of personal anecdotes that help to shine new light on what otherwise might be difficult topics. \nThis guy has a terrific sense of humor. If you don't believe me, just check out the BWOG's coverage of the emails he regularly sends out to us. They are always hilarious and he frequently cracks jokes in class too. He is extremely personable and clearly cares about his students; he will stay after class and talk to students for as long as there are students to talk to.\nAs further evidence of how invested he is in the class, he grades every essay himself - in a class of 100+ students. The TA's mark them with a preliminary grade, but Professor Awn goes through and reads each essay, provides his own comments, and marks them with a final grade. I see other reviews that say the essays are graded harshly, but that has not been my experience. He is deadly serious about spelling and grammar, and if you screw those things up he will ding you for it, but if you're at Columbia, you shouldn't be screwing those things up. Otherwise as long as your argument is coherent and supported by some kind of evidence, you will do fine. \nAs far as I can tell the TA's also seem to be very good - I only have experience with one, and he is not a student of Islam, but that doesn't seem to hurt our discussion sections. In fact, it enriches them because he is able to compare what we're learning in Islam to his knowledge of Christianity (the religion he studies). \nIn short, take this class. You need a humanities course, and you need a major cultures course - this can serve as both. Peter Awn is one of the best professors you will ever have. I wish every professor at Columbia would sit in on one of his classes and learn a little bit about how to give a lecture.\nWorkload:\nLOTS of reading - seriously. We were told to read the Qur'an in one week. He recommended that we \"start from the back,\" which was actually helpful, but still. There are also other books (to purchase) and random excerpts from various publications (which he provides). You will read a ton every week in this class, and while you may occasionally be able to get away with not doing it, if you fall too far behind you will find yourself in trouble when it comes time to write your essays.\nIn addition to the reading, there are four 8-page essays. You'll have to do some work, but they're not as tough as others have made them out to be. I've been very happy with the grades I've seen so far.\nThere's also a midterm and a final - I can't comment on these because the midterm was canceled and the final hasn't happened yet, but Professor Awn characterizes them as \"an insult to your intelligence and to my intelligence.\" Also, they can't hurt you, they can only help you. \n"
        },
        {
            "course_name": "Islam",
            "review_date": "October 11, 2009",
            "review_content": "\nA self admitted relentless snob who could care less about his students in the classroom while professing, or GS, of which he is the dean, in general.  Scattered reading assignments, vague questions that require specific responses, and tangential lectures.  I am completely mystified as to how Awn is a golden nugget, let alone the dean of GS.  Avoid everything about him!\n"
        },
        {
            "course_name": "Islam",
            "review_date": "June 06, 2009",
            "review_content": "\nTake this class\nProfessor Awn is brilliant and you will come out really feeling that you learned something\nYour only regret will be that there isn't enough time to finish all the readings, but that doesn't matter in terms of your grade because the essay topics are usually focused on  a fairly small number of texts\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 13, 2009",
            "review_content": "\nProfessor Awn is an AMAZING professor! His lectures are incredibly engaging and amusing, and he is really funny.  I would definately, 100% reccomend the class!\nDont let the time of the class or the syllabus deter you- prof awn is such a good lecturer that the time doesnt matter, and the syllabus has a lot of readings listed, but you only have to do the readings you want.  really, you'll get out of the class what you put in to it. \nalso, i wouldnt let the workload deter you- 4 8 page papers seems like a lot, but i found the questions very interesting and relevent and so i very much enjoyed writing the papers.  we didnt have a midterm, and the final could only help but not hurt you, and it was a vague topic and no studying was required.  also, awn is a very fair grader and the TA's were very helpful in wrting the essays. he has the TA grade the papers, give you a grade and make comments, and then he reads all the papers over himslef, writes his comments, and then gives you a final grade.  (and he grades the papers very quickly)\nTAKE THIS CLASS! ITS REALLY GREAT! YOU WONT REGRET IT!! \nWorkload:\n4 8 page papers, very interesting topics\n1 final that can only help your grade \nmandatory 1 hr discussion section once a week\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 07, 2009",
            "review_content": "\nVery interesting class, and Peter Awn is a great lecturer.  He's lived everywhere, seems to speak every language, he's clearly brilliant.  Lectures were interesting and engaging.  There's a lot fo reading (seriously, a lot) assigned, but generally it's maybe only half of it necessary.  There are 4 8-page papers to write on mediocre-interesting topics, and they all be read by both your TA AND Professor Awn (he reads 1000s of pages of student essays for this class), which I really appreciated, since Awn always had interesting things to say on top of my TA's comments.  There was no midterm because Prof Awn was in Jordan that day.  The final was in-class (last class) and was one very broad essay question (we were given one blue book and asked to please not fill it all the way, the final counts for very little next to the four essays).  \nBasically, a fun class, but a lot of work, so keep that under consideration. \nWorkload:\n4 8-page papers, lots of reading, our midterm was canceled, 1 quick in-class final\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 01, 2009",
            "review_content": "\nYou owe it to yourself to take a class with Peter Awn.  He is an outstanding lecturer, not just because he is so knowledgeable about the material but because he has had first hand experience with much of it in his long and fascinating life.  Even better, he is an incredibly sweet and funny man, and I doubt a student has ever had a seriously bad experience with him.\nWorkload:\nFour 8-page papers.  Not a high volume of work; it strikes the perfect balance between being manageable and intellectually worthwhile.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "April 13, 2007",
            "review_content": "\nProfessor Awn is brilliant. He is a fascinating lecturer, and this is a great course to take to get an introduction to the study of religion more generally in addition to the specific study of Islam. That being said, if you aren't really interested in the material, you might not want to write 4 8-page papers for 3 credits. Like another reviewer said, you will get out of this class what you put in. One of the best courses I have taken here.\nWorkload:\n4 8-page papers (I have heard 'graded harshly' but I think this means, 'graded fairly' -- you get what you deserve), vague midterm/final on broad concepts, absurd amounts of reading\n"
        },
        {
            "course_name": "Islam",
            "review_date": "January 22, 2007",
            "review_content": "\nGreat class, Professor Awn is really into the material, he also is highly amusing. \nThere is a lot of reading, of which you have to do NONE of it.  The 3 papers were very easy, the mid-term and final were simplistic.\nIt's a great class but you get out of it what you put in.\nWorkload:\nAverage\n"
        },
        {
            "course_name": "Islam",
            "review_date": "November 26, 2006",
            "review_content": "\nTake this class!  This is one of those courses that every Columbia Univeristy student should take (Religion major or not).  I can't speak highly enough of Prof. Awn.  He really knows his stuff, but more importantly he knows how to present it.  Yes, it is true that he goes on a lot of tangents, however, they do not take away from the course... he still gets through all of the material.  There is a lot of reading and four 8 page papers which may seem annoying at first- but I loved writing them.  The questions are pretty broad so don't worry (plus he gives you options).  My only advise is not to take this course while enrolled in other reading and writing intensive courses.  \nWorkload:\nLot of reading, four 8 page papers, weekly section... Awn is a tough grader but he forces you to improve your writing throughout the course... One can easily pull off a B\n+/A-\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 26, 2006",
            "review_content": "\nI am completely mixed on the Islam class.  I thought that the lectures were pretty bad, mainly because Awn went off on so many tangents - including in the middle of sentences.  However, my dismay of the lectures may have been exacerbated by the fact that I came in knowing nothing about Islam (which is totally okay for this class) so the smallest tangent threw me off... my friends who had taken classes with Awn before knew to expect this so it didn't disrupt their notetaking as it did mine.  Also, when I was really into the material (like on Malcolm X and Islam in America) he was either much more on point or was just so engrossing that I didn't notice the tangents.\nBut the reason why I didn't hate the class was the papers.  Yeah, they were a royal pain in the butt to write (there are 4 8-pagers for the class) but once you talk to your TA they're really doable and THIS will help you learn the material.  Honestly, my notes for the class were crap because of the tangents (as soon as I got lost I basically stopped taking notes).  But once I realized that for each paper you only had to write about a portion of a question, as the questions are ENORMOUS, I was able to read the material and understand it well enough to write a strong paper.  And at the end of the day, I felt like the papers helped reinforce the material whereas classes with just exams left me feeling clueless about what I learned.  \nI think that if there was a better lecturer for a major cultures class I would have taken that, but if you need a list A and don't mind writing 32 pages about Islam and taking 2 exams then this isn't such a killer.\nWorkload:\n4 8 page papers, weekly reading, weekly discussion section, midterm & final which really don't count for much.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 13, 2006",
            "review_content": "\nI'm a religion major and this course is definitely one of the best courses I've taken so far (in any department.) I thought it was generally enjoyable and gave me a very solid overview of Islam. I would just like to make a few comments in response to the previous ones.\nFirst of all, only take this class if you are actually interested in Islam and/or the study of religion. There are much easier ways of satisfying your major cultures requirement than 4 8-page papers. If you are interested, however, the papers can be very enjoyable.\nSecond of all, I am totally perplexed by the reviewers that claimed that Professor Awn somehow allowed for only a narrow range of responses to questions he asked on assignments or exams. I never had this problem and no one in the class that I have spoken with seemed to have it either. He and the TA's will even let you write about whatever you want if you get it pre-approved. He might not tolerate one-sided arguments, but this doesn't make him an unfair dictator, but rather, a real professor. \nAs for the discussion section, maybe I got lucky, but it was the best discussion section I have ever been in. If you take the class and get the option of taking Michael Pregill, make sure to be in his section.\nIn short, while I don't expect that everyone will like this class as much as I did, I still think it was one of the best classes i've taken. There are many enjoyable courses and there are many where you learn a ton, but very few that are both. If you enjoy studying religion this class is a must.  \n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 12, 2006",
            "review_content": "\nDean Awn is an excellent professor. He was definetly the best professor I had in my last semester. His lecture style is a good and he makes the material as interesting as possible. He is known to make amusing digressions that sometimes depart fromt he main focus of the lecture but they stay within the general topicality of the material. I enjoyed them. He is also very approchable with questions after class. I would not recomend interrupting his lecture with questions because it does mess up the flow of the lecture for everyone and he can't give you a great answer in the middle of the lecture. Save it for afterwards. \nOn another note, I also enjoyed him because of the perspective with which he tackled topics. He is always unbiased with his treatment of material. Not to say he is always politically correct. He is critical of certain things and those become clear but he always argues his point well.\nIn regards to the work. It is based on your essay writing. I thought he was a very fair grader. As a tip, DO THE READING and USE the reading as EVIDENCE to make your points. The reading is long but if you read the material his essay topics are very easy because they flow organically from the material. \nWorkload:\nHEAVY reading in the first half of the course which becomes moderate by the end. Four Essays @ 8 pages. Midterm and Final (a.k.a. easy \"reading checks\")\n"
        },
        {
            "course_name": "Islam",
            "review_date": "March 17, 2006",
            "review_content": "\nThis class is absolutely ridiculous.  I am in it for my Major Cultures requirement, and figured that it would be as interesting as a List A could be, since the Massad/Bakhle class is not offered this year.  Boy was I wrong.  First of all, Awn goes off on tangents in the middle of about every sentence, making note taking difficult.  I came into this class with little knowledge of Islam and so weeding out what I need to know and what I don't is impossible here.  He spends so much time ranting about anything to do with bodily secretions in Islam rather than just talking about the backbones of the religion.  Ew.\nThe readings are long but I guess can be skipped/skimmed/shared.  Discussion section is the biggest waste of time.  No one - including the TA - contributes anything to these mandatory weekly hours of torture. I mean, this dude is the Dean of GS and he can't even get TAs that know the subject?  My TA said that he didn't know any more than we did about Islam.  Go religion department!  Also, the TAs are apparently supposed to grade \"tough\" on our first paper - as if it's University Writing or whatever.  I really don't care what I get in this class so long as I don't flunk it but c'mon, are we still in High School?\nI think the MC requirement is pretty dreadful because while there are interesting courses offered in the department the List As are killer.  But this one is probably about as bad as it can be.  I took Somerville's Christianity class with no knowledge coming in and a good amount coming out (and the discussion sections were optional AND useful, even though mine was on Friday mornings).  All I've learned so far in Awn's class is that Muhammad wasn't celibate.\nWorkload:\nThis is a 3 point course?  4 8 page papers that have the most roundabout topics and no guidance from the TAs or Awn.  Midterm which he first said was a joke but was not all that easy (but also wasn't awful).  Final.\n"
        },
        {
            "course_name": "Islam (Intro)",
            "review_date": "February 20, 2006",
            "review_content": "\nI can't believe anyone could say it's hard to get an A in this class.  There is a lot of reading and I think 4 8-page essays, but Awn grades all the essays himself, which means he does so very quickly, and I never got below an A-.  True, I was lucky enough to have Awn as my section leader as well, since our original section leader had to leave (and luckily, cause based on the first class he didn't seem to know anything about Islam).  \nAnyway, watching Awn lecture is a treat, and he is fascinating, down to earth and hilarious.  Plus it's a joy to listen to his arguments, which are always level-headed, without being anti-religion.  He obviously loves lecturing, and tells stories better than any other religion professor I've had.  I'll admit I got a bit lost in the history of Islam at some point, but I didn't really keep up with the reading.  He does a good job of clearly providing basic points of interest in the history of Islam.   \nWorkload:\nmidterm, final, 4 8-page essays, lots of reading...but also lots of fun website links on courseworks.  i thought the work was fun.\n"
        },
        {
            "course_name": "Islam (Intro)",
            "review_date": "July 17, 2005",
            "review_content": "\nAwn is a great lecturer. Other than that, there isn't anything that great about this class; and it's not really his fault since it's ridiculous to try and cram so much into a single semester intro.\nProblems that should make you think twice:\n-Too much material (readings weren't too heavy, but very scattered, without much context, and as a Muslim, still confusing without proper guidance; I found myself correcting things and suggesting alternatives that Awn and his TA's just didn't offer in class; consider that a warning for those of you who don't have any background in this religion;)\n-VERY vague topics: on both tests and papers, the topics were very strangely worded, and very amorphous so that there was little to grasp on to and structure an argument around; for Muslims: given the way you may have learned about Islam--that is to say with years of quotes and lessons from here and there, memorization, debate -- this class will be very strange. Awn does not allow for debate at all, just regurgitation of his (while certainly erudite) single view. \n-The amount of work for papers and tests is hefty, and you still might not do great. This is certainly not a very difficult class: an easy B/B+ but a very difficult A, no matter what your level is. Remember to write very simple, uncluttered papers; do NOT take any outside source or personal viewpoint (he will say \"he doesn't understand it\" no matter how well you support and argue your point)\nOverall: you will learn some new things, and Awn to his credit is an extremely engaging and entertaining lecturer, who has had the awful luck of having to teach such a complicated course without dumbing it down while having to combat preconceptions and misinformation (sometimes with only one explanation, instead of the many that actually exist).\nYou'll have to devote a lot of time to get an A; TALK TO HIM AND THE TA's; only then will you get an idea of exactly what they want you to write; don't be 'daring' with your essays unless you don't mind a slightly worse grade. \nWorkload:\nThree papers of 8 pages (no less no more) each (though it was supposed to be four)\nMidterm and final (reading checks, but still very vague and irritating; it's one of those things where you only understand the question after the assignment is over and he's told you what he's wanted.) Approachable man.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 16, 2005",
            "review_content": "\nThis class is extrememly challenging especially for those who don't have experience with Islam. Also, in order to succeed in this class you must be an excellent writer. As a person Professor Awn is cocky and not respectful of his students. As a professor, he is very challenging and (nobody doubts this) he knows his stuff. \nWorkload:\nA lot. Be prepared to write 3 or 4 8 page papers plus a midterm and exam. Plus lots of tedious reading...\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 15, 2005",
            "review_content": "\nAs Professor Awn himself stated numerous times during the semester, \"I'm a relentless snob.\" And that he is. If you get excited to hear him say on the first day that people should be more critical of religion, don't be. Make sure you know how to regurgitate information and make sure you do not read ANYTHING outside of what is required/recommended because it is simply \"wrong.\"\nI will however admit that Professor Awn is an excellent speaker.  \nWorkload:\nOriginally four essays of 8 pages in length in addition to a midterm and final that did not count for much at all. HOWEVER, near the end, the four essays actually became only three, with the questions on what was supposed to be the fourth paper, to become the essay topic of the final (which then counted for more than it was originally supposed to). Midterm was an essay meant to check if you do the reading and come to class. TONS OF READING, mandatory discussion section. From my experience, and from what I heard, he is a difficult grader as well.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 01, 2005",
            "review_content": "\nThis class is truly what you make of it.  Awn assigns lots of incredibly interesting reading that delves into all different aspects of Islam -- and then covers in class, in the most patronizing and simplistic way possible -- the most obvious & general aspects of about 50% of what you've read.  You could probably get an A without doing any of the readings, just taking notes at lectures, but check out some of the books and you will actually learn some fascinating stuff...\nWorkload:\nThere's a lot of assigned reading, but hardly any of it is necessary;  a one-hour TA session that struck me as a waste of time; three approx 8 page papers; a midterm and a final, all VERY generously graded.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 01, 2005",
            "review_content": "\nAwn is a rivoting speaker.  He is incredibly knowledgeable, provocative, eloquent, and, above all, hilarious.  Going to lecture was invariably fascinating and humorous.  I walked into the class knowing absolutely nothing about Islam except for the token introduction to the Qu'ran given in CC.  The course is completely accessible if you have no background in religion, but it is not dumbed down like most intros. \nDo not be afraid of getting a harsh TA for the discussion section.  The TAs give the essays an initial grade and then Awn reads each paper himself and assigns the final grade so that we're all held to the same standard.\nUnlike most academics, the man does not take himself overly seriously and he never misses an opportunity to poke fun at himself.  On the last day of class, he stopped in mid sentence when he noticed it had started raining to tell us all about the trials of being bald in a rainstorm.  If you're tired of crusty old professors who fill the syllabus with their own books and only give As to students who parrot the lectures, take a class with Awn.  He is a breath of fresh air.\nWorkload:\nmedium.  there are three eight-pagers.  the topics are straight forward and broad so you can write pretty much anything as long as its original and has some textual support.  a fair amount of reading is on the syllabus, but you only need to do about a third to ace the midterm and final which are essay based.  there is one discussion section each week. attendance is taken.\n"
        },
        {
            "course_name": "Colloquium, Ancient Traditions",
            "review_date": "April 13, 2004",
            "review_content": "\nProfessor Awn's style is so awesome.  He possesses an incredible depth of knowledge about so many different subjects.  His asides and anectdotes are hilarious and memorable.  (He jokingly refers to himself as Professor Tangent!)  He unobtrusively challenged some of my deepest help convictions and I emerged from the class with a more balanced perspective on life in general.  But in this small class (mine had 7 students) you must participate actively in the discussion to get a good grade.    \nWorkload:\n2 - 15 to 20 page papers.  Heavy reading load, but all texts posted online.\n"
        },
        {
            "course_name": "Islam",
            "review_date": "May 10, 2002",
            "review_content": "\nIf you are a religion major, try to take this course during freshman or sophomore year. While Awn is dynamic, interesting, and incredibly erudite, he allots way too much of the course's time to tangents that function as an introduction to the study of religion rather than a deep analysis of Islam itself. While I would have appreciated such an organized introduction earlier, it was annoying when, as a senior, what I wanted was an intense course on Islam. The class is otherwise a pleasure, though. \nWorkload:\n Light reading load, reasonable papers. Midterm and final are each an essay that doesn't count for much but whose topic is out of left field. Section, as always, varies by TA and the students there.\n"
        },
        {
            "course_name": "V2630 Islam",
            "review_date": "December 31, 1999",
            "review_content": "\nThe man is witty, entertaining, opinionated, and interesting to listen to. He peppers his lectures with fun anecdotes. Despite the large classes, he attempts to personally grade every paper submitted. He's also a nice guy to speak with.\n"
        },
        {
            "course_name": "V2630 Islam",
            "review_date": "December 31, 1999",
            "review_content": "\nThe man is witty, entertaining, opinionated, and interesting to listen to. He peppers his lectures with fun anecdotes. Despite the large classes, he attempts to personally grade every paper submitted. He's also a nice guy to speak with.\n"
        },
        {
            "course_name": "V2630 Islam",
            "review_date": "December 31, 1999",
            "review_content": "\nThis is one of the most overrated courses at Columbia. Yes, his lectures were somewhat enjoyable because of his personality but I learned literally almost nothing about Islam from this course. You're supposed to read all these ancient religious texts but without context they're meaningless and difficult to make sense of--and he doesn't really explain them very well. Also, they're unmatched for boredom. You thought the Iliad was boring? Ha. Awn is a very nice man who is funny and entertaining. I remember on the first nice day of weather when I took the class, half the class skipped, and he announced, \"The Steps, 1; Me, 0.\" But that can't compensate for his all-over-the-place, unorganized lectures. If you're someone who likes a little structure in a lecture, you're going to be irritated. In all honesty, there are better ways to fulfill your major cultures requirement and learn about Islam (just not with Saliba's Islamic Civ class--he's like a lunatic).\nWorkload:\nYou don't need to do a lot of the reading. Three 7 page papers, final exam is a joke and I don't even think he counted it. But it's really unclear what he expects from you in the papers and the topics kind of sucked each time (very boring and vague). Don't remember if there's a midterm. Easy to get a decent grade, hard to do well because the requirements aren't clear, sort of like the readings and the lectures. (Detecting a theme here, Sherlock?)\n"
        },
        {
            "course_name": "V2630 Islam",
            "review_date": "December 31, 1999",
            "review_content": "\nPeter Awn is a great man, and this class is dope. Whether he sticks to his lesson plan on a given day, or not, is neither here nor there; as his diversions, covering topics ranging from female circumcision to his favorite racist movies, are at least as interesting and educational as anything he planned at the outset. His offbeat background (which I haven't figured out entirely yet, but it appears to contain a stint as a Jesuit priest and frequent experimentation with what he lovingly refers to as \"pharmacological delights,\" among other things) makes even the lectures concerning more mundane subject matter extremely entertaining. Awn uses Islam as a tool for confronting students preconceptions about both that particular religion and religion in general, and forced me to ask myself questions that I would never have thought of on my own. The TA session was a total waste of my time and Awn's paper topics are vague and very difficult to mold into anything of value, but if you can slog through that stuff this is a gem of a class.\nWorkload:\nThree short papers, a final, which in Awn's words, \"I can assure you will be of absolutely no educational or societal value,\" medium-weight reading assignments, and a trip to the Islamic Art galleries at the Met.\n"
        }
    ]
}