{
    "prof_info": [
        {
            "prof_name": "Whitney Slaten",
            "prof_id": 9697,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 06, 2012",
            "review_content": "\nI agree completely with the previous review but would like to add one important detail: he is possibly the easiest grader alive.  Seriously, As for everyone.  I know that this is not a forum for sharing which classes are easy, but this is an important thing to know.  If you're looking for an instructor who will put as much effort into grading a paper as you did writing it, this is not the guy.  He allowed me to review the 4/20 Wolfgang Gartner concert for my concert report, and he knows exactly what that date means.  I got both papers back with an A at the top, no comments, and no crease by the staple, where someone would fold it if they were to read the paper (he may not have).\nReally nice guy, though.  He's funny and great to talk to about music -- just not Music Hum, per se.  \nWorkload:\n2 five-page concert reports, one about technical music details and one about social context.  There are some bullshitty format rules involving making certain sentences bold.\n1 midterm: multiple choice (but really) and a straightforward listening section that did not require memorizing the names of anything.\n1 final: multiple choice (I know) and one short answer question (2 paragraphs).  It only covers the second half of the semester, barring basic knowledge and terms we used frequently.  He will answer your questions about first semester.  He might even accidentally flash the answer key at you.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 06, 2012",
            "review_content": "\nI went into music hum thinking it was going to be fun, interesting, and easy. I had friends telling me that as in any core classes, I'd be screwed if I had a subpar professor, but I thought to myself, how bad could it be?\nWell, I was horrendously wrong. Whitney Slaten's first impression was nice enough, a nice guy with what seemed like a genuine interest and experience in music. However, he didn't really \"teach\" us, he most of the time read word for word what was on the crappy slides provided by the textbook. He also digressed a lot, which was admittedly more fun than reading the slides, but it still didn't help us learn the material.\nThis may be a little bit more controversial, but I also think the way the curriculum is laid out is a bit flawed. The course attempts to teach you the histories and the inner workings of the music (up to a point) while being very, very careful to avoid any Music Theory in order to... I actually don't know why. Still, this jumping around definitely caused a lot of confusion. Whitney tried to dodge and evade answering any theory related questions, which ended up with him answering some questions incorrectly (which I knew from taking music theory before).\nIn conclusion, nice guy to talk about music over a cup of tea, poor, poor instructor.\nWorkload:\n2 Concert Reports, Midterm, Final. Not very time consuming.\n"
        }
    ]
}