{
    "prof_info": [
        {
            "prof_name": "Joanna Hershon",
            "prof_id": 2378,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Fiction Workshop",
            "review_date": "November 11, 2006",
            "review_content": "\nI disagree with the previous comments, she's gone out of her way to meet with us and she wrote three pages of insightful criticism for every story I've turned in.\nShe's published three books and has plenty of excellent advice for aspiring novelists. She will also look at chapters from larger works instead of only accepting short stories like some of her counterparts. \nHer writing style is language-loving, rhythm conscious and beautiful, so her edits will reflect this tendency. She also emphasizes character interaction and effective use of detail.  \nWorkload:\nSame as any other workshop: 3 stories or  chapters, one re-write. 10-30 pages. Don't know yet about grades.\n"
        },
        {
            "course_name": "Narrative Forms",
            "review_date": "March 13, 2005",
            "review_content": "\nI agree with the previous review.  She really didn't seem to care.  She didn't respond to my emails.  She had a required conference after each story, but she was late both times and took personal phone calls both times, thus my 15 minute conferences ended up being abut 5 minutes.\nBeyond that, she didn't give solid advice, it was sort of airy and I'd leave the workshop not having any idea of what worked and what didn't.  Of course, a lot of the student work was abyssmal, pretentious and inaccessible (style over substance).\n"
        },
        {
            "course_name": "Narrative Forms",
            "review_date": "January 02, 2005",
            "review_content": "\nJoanna Hershon didn't seem to care all that much about the class.  She makes good points about students' writing ocasionally, but she was boring and didn't push students.  I don't know, in my opinion she kinda sucked. \nWorkload:\n2 long short stories, weekly shorter creative assignments which were fun, final portfolio is a compilation of all writings and one major rewrite. \n"
        }
    ]
}