{
    "prof_info": [
        {
            "prof_name": "Claire Dunnington",
            "prof_id": 4562,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 06, 2011",
            "review_content": "\nThis was no doubt the worst class that I have taken in my life. Initially, Claire seemed to be very nice and receptive towards various opinions and comments, but don't let this first impression deceive. The lady doesn't care what you really think and believes that only her views/ideas are correct and valid points to consider. For instance, she always says \"i wonder how this interesting topic will turn out for the essay\" to our proposals, but then has no trouble tearing you apart afterward when grading the papers (which is absolutely arbitrary and evil). You will not even get a respectable grade unless you write exactly what she wants to hear (thus, flattery) and by the time one figures it out, usually towards the closing stages of the semester, it's too late to be redeemable. Even after attempting to edit the work based on her \"useless\" comments, you will still get a lousy grade and be shell-shocked. To be honest, I don't think this course taught me anything helpful. I came in somewhat appreciative of writing, but came out hating and fearing it.\n\nWorkload:\nLens, conversation, research, retrospective -> meaningless progressions. An assignment, in some form of composition, due every class that will make you tear your hair out. No curve, since the freaking English majors will spoil it for almost the whole class. Why can't Columbia understand that we're not all humanities majors and we have more important matters to contend with? \n\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 15, 2009",
            "review_content": "\nYou will not get higher than a B+ on any graded assignment/final grade with Claire Dunnington. The fact that she makes your do a retrospective essay is absolute BS. \nWorkload:\nlens, conversation, research, and retrospective, and extra little assignments\n"
        }
    ]
}