{
    "prof_info": [
        {
            "prof_name": "Melissa Gonzalez",
            "prof_id": 2338,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "June 22, 2005",
            "review_content": "\nGood news: the grading in this class is really leniant, she said she doesn't like to give anyone a final grade under a B, and even that's hard to do.  Bad news: she's just mean.  Mostly just unfriendly, but sometimes mean.  The questions on the midterm and the final were often from side comments she had made in class, which sucks, and it was painful in the morning, but since you have to take the class, and she not evil about her grading, it's not bad.\nWorkload:\n5 concert reports, each 2 pages, midterm and a final.  The concert reports can be handed in one of the last days of the semester, so besides having to actually go to 5 concerts, there's basically no work.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 03, 2005",
            "review_content": "\nif you want a JUST FINE music hum experience-- to learn a bit, to enjoy it, to not be stressed out, and to learn anything you will learn by semi-cramming the night before-- then take melissa.  she recognized that not everyone wanted to be there, that music hum wasn't everyone's first priority, and that some of us knew NOTHING about music.  she made it all just fine.\nWorkload:\nnot much...never did reading.  we listened to all hte pieces in class and discussed them, which was better than some other music hum classes ive heard about.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 29, 2004",
            "review_content": "\nTo say that she sucks is a bit harsh.  I enjoyed her class and found her to be a good instructor overall.  The work load was doable and she presented the material clearly.  I agree that she should have focused more time on class discussions but overall.  I received comments on my concert reports and she always offered to review first drafts.  She also did her best to ensure that we did well on exams by supplying outlines, review sheets, etc.  Overall, I was satisfied with the course.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 29, 2004",
            "review_content": "\nThis definitely was a great class. melissa was very knowledgeable about the subject matter and taught both the significance of the piece as well as the musical elements, which adds greatly to one's appreciation of music. there were five concert reports but they were only two pages each and that is far more enjoyable to write than a long research paper. i don't think than anyone would say that ten pages of writing is too much for a three credit class. i also think the exams were fair. i don't think you would be at a loss if you were to take music hum with this instructor; i would recommend it.\n"
        }
    ]
}