{
    "prof_info": [
        {
            "prof_name": "Peter Balsam",
            "prof_id": 838,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "April 11, 2016",
            "review_content": "\nBORING yet also easy. His lectures are horrible. He is unorganized and confused half the time himself.  However, he is a very cute old man that shows a lot of videos and there is a ginormous curve.  The only thing you really have to do to study for the class is fill out his study questions and know them backwards and forwards.  Also for the essay part of the test write a ton. He’ll say write as much as you need but ignore that advice and vomit everything you know onto the blue book and you’ll do better than if you actually make a structured argument.  The multiple choice questions can sometimes be worded strangely but he tries to account for this by letting you throw out 2-3 questions per test depending on how many questions there are.  Also, there is the occasional homework assignment that if you put even the slightest amount of effort into you’ll get a “great!” written as feedback.\n\nWorkload:\noccasional homework assignments, 3 equally weighted tests\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "May 24, 2015",
            "review_content": "\nProfessor Balsam, as the previous reviewer said, has really been misrepresented.  Before you continue reading, I am going to preface this by saying that I am a Neuroscience major and pre-med and did well in the class; perhaps the negativity in the other reviews stems from the fact that those students did not receive an A.  \nI found his class to be one of the easiest classes I have ever taken.  Yes, there is some math...but seriously, it's just basic algebra, nothing a Barnard student isn't capable of.  If you read the book, go to class and take notes, and study for the tests, there really is no reason why you can't get anything less than an A- on his tests; they are very straightforward.  Plus, he lets you throw out three questions on the test!  Can't go wrong with that.  \nTo do well on his tests, read the book and answer his study questions to the best of your ability.  Any questions you have on those can be brought to Balsam who is so wonderfully accessible to his students.  He really does care and it's quite refreshing to have a professor who cares as much as he does. \nSpeaking of how much he cares, Professor Balsam is an incredible resource.  He has the most amazing connections, especially at the Columbia Medical Center (he also his own psychology/neuro lab at the medical center for those of you who are interested in his research).  For those students out there who are looking to find a lab at the medical center, Balsam is the guy to go to.  Trust me, he is so nice and friendly...he will hook you up with the lab of your dreams!  \nWorkload:\nTwo tests and a final (not cumulative).  Easy problem sets due every so often that help you practice the material and give you points.  Light, very manageable!\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "May 15, 2014",
            "review_content": "\nProfessor Balsam has been really misrepresented in these reviews. While he certainly is not perfect at teaching, he's one of the most understanding and kind professors I've encountered (and I'm a senior)! His humor is definitely quirky, in a sweet dad kind of way, but once you've got it, he's hilarious. He also really cares about his students and gives excellent feedback and invests time to further their comprehension. He's always looking to improve and asks for feedback- and actually implements it.\nI would advise any psych or neuro student to develop a relationship with him and neuro students! Be in his seminar! \nTo do well on the tests, read the textbook and take notes. The textbook is dense, but plow through! His questions are based almost solely on it. He can tell who shows up to class, so its a good idea to go.\n\nWorkload:\n3 Tests\nCute easy homework that are really just there for attendance.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 10, 2013",
            "review_content": "\nI don't know why all of these reviews are so bad. Like the previous commenter said, Balsam's lectures can get kind of boring at times, but he is definitely not a horrible professor. In fact, he's a genuinely nice guy who really wants his students to succeed. He adds videos wherever he can and is generally organized and clear. He is available outside of class hours and he even set up a chat room the night before both of our midterms where we could log on and ask him questions. The tests are typical for a psych class, and yes you do have to read the book, but this is a college course, so you should expect to have to do some work. He even posts reading guides for all of the chapters, which are extremely helpful. Don't let the bad reviews scare you away from taking this course. Balsam is nice, friendly, and really cares about the material (and you might even learn something, which is something the previous posters seem to be opposed to). I also recommend taking the lab with Ken Light--the lab and the lectures lined up pretty nicely and we were able to get extra practice on the equations introduced in lecture.\nWorkload:\nLight-- 2 midterms and a final (non-cumulative). Standard for a psych class. A couple of small assignments that were easy and only counted for a handful of points. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "November 06, 2013",
            "review_content": "\nI don't know why everyone says he's so horrible. these reviews scared off way too many people and deserve to be changed. Professor Balsam may not be the most interesting lecturer, but he's far from horrible. He makes jokes and shows video clips and tries to engage the class more so than most professors. the material isn't hard either and neither are the exams - if you've ever taken a psych class before you should understand exactly how to study for one. Definitely take notes in class but reading the book is not necessary until before an exam - and even then you only have to read the book to answer the questions he posts after each lecture. study the answers to these questions and the tests should be a piece of cake. \nWorkload:\n2 midterms (non-cumulative) and a final. all very manageable and straightforward - just answer the questions he posts and take notes in class. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 17, 2012",
            "review_content": "\nThis is by far THE WORST class I have EVER taken at Columbia or Barnard. Do not and I mean DO NOT take this class no matter what! Professor Balsam is an absolutely disastrous professor; he is boring, confusing (and confused), condescending, and seems to have no grasp of proper written grammar. The material is about as dry as humanly possible, and Balsam makes it even worse by complicating it to the point of incomprehensibility and comparing every theory to his pathological fear of boats. Lecture is worthless, and the book is only a bit better. Studying is pointless, you'll do poorly no matter what because the exams make absolutely no sense whatsoever. Basically prepare yourself to watch your GPA free-fall into an abyss after this class. On the other hand, the lab is not bad at all, although not particularly interesting. Still, there is nothing that makes this class worthwhile; if it's required for your major I suggest rethinking your plan of studies. \nWorkload:\nThree exams, all terrible when you take them and even worse when you get them back. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "November 08, 2012",
            "review_content": "\nThis is the only class in my Barnard experience that I truly disliked.\nDo not take this class if you can help it.\nI took Intro to Psych with Stokes and it was great -- she was engaging, clear, and fair.\nBalsam is the opposite. I don't understand how a LEARNING PSYCHOLOGIST could be the most ineffective teacher I've ever encountered.\nThe textbook is dense and the language is horrible. He clearly just likes it because his face is in it.\nHis lectures are very boring and he simplifies the material. He also always says annoying things like \"this is easy stuff guys\" \"dont worry guys\"\n...... if it's such easy stuff, then why do you have to curve every exam, with the median grade still being a B-.\nUnless you're a Psych wiz I don't think you can endure this class without wanting to punch Balsam in the face all the time.\nOne time a PHD candidate taught our class when Balsam was out and I realized how simple the material is, but how confusing he makes it. You're right Balsam, it's not rocket science--- you make it rocket science.\n\nWorkload:\nTwo Mid-terms and a Final Exam.\nExams are long and he doesn't SHUT UP during them. He gives multiple choice questions related to examples/experiments discussed in class (but not in textbook) without referencing them first--- so if you don't memorize all his examples you'll get these wrong.\nThe phrasing is also horrible and often grammatically incorrect.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 10, 2012",
            "review_content": "\nPsychology of Learning - I have never had such a terrible experience with a psychology class and as a psych major, I've taken a lot of them. This class was absolutely horrible, the lectures are boring and you end up with only a handful of people attending. The textbook assigned is also incredibly dense and difficult to understand. As for the exams -- Professor Balsam needs to understand that this is an Intro level class. He is unclear about the content and when he tries to teach math he fails. The lab instructor ended up being the only reason I understood the math because she spontaneously decided to go over it in lab. In terms of getting help outside of class I would say that he is very unfriendly and unapproachable. He is borderline condescending and this is an opinion shared by numerous peers who were taking the class with me (even students just went in to pick up their exams found that he was rude). I got the impression that he did not have the capacity for patience with students asking intro-level questions; maybe he makes a much better graduate level professor.\nWorkload:\nLab is standard, group work once a week but the lab report you hand in is individual. The tests are non-cumulative and really difficult but he adds a good curve -- the text book helps if you can get through it.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 21, 2011",
            "review_content": "\nPeter Balsam is the worst professor I've had, possibly in my entire time at Columbia/Barnard. He is confusing and difficult to hear. He tries to connect to his students, but he has no idea how to do so, and he is completely deluded about the difficulty and content of his class. \nNone of the material is actually very difficult, but he just gives the same slides over and over again and doesn't actually explain them in a different way each time, which would have been a way to take advantage of that kind of teaching strategy. He claims his tests do not have any material from the book, but he lies. He tries to explain math on the bored, but it just makes it more confusing, and then he doesn't understand why anyone wouldn't have gotten it on a test. \nI personally get especially frustrated when professors who teach about LEARNING can't teach in a way that facilitates LEARNING. The class is really about animal behavior, not actually about the concept of learning. \nBalsam is standoffish and unfriendly. He lectures very poorly, cannot be easily understood, and has no variety in his slides. He is old and doesn't understand how to use youtube, yet he insists on trying to show videos in class. He makes simple content seem confusing and does not prepare you for his tests. \nDO NOT TAKE THIS CLASS. It is a horrible class. Literally nobody I talked to in it enjoyed even a fraction of it. Stay away from him if at all possible.\nWorkload:\nOnly the two midterms and the final, each worth 1/3 of your grade if you have no lab. If you have lab, lab is 1/3, and the three tests together make up the other 2/3. Reading is not necessary until right before the tests. Don't go to class, it just makes it more confusing.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 21, 2011",
            "review_content": "\nPeter Balsam is the worst professor I've had, possibly in my entire time at Columbia/Barnard. He is confusing and difficult to hear. He tries to connect to his students, but he has no idea how to do so, and he is completely deluded about the difficulty and content of his class. \nNone of the material is actually very difficult, but he just gives the same slides over and over again and doesn't actually explain them in a different way each time, which would have been a way to take advantage of that kind of teaching strategy. He claims his tests do not have any material from the book, but he lies. He tries to explain math on the bored, but it just makes it more confusing, and then he doesn't understand why anyone wouldn't have gotten it on a test. \nI personally get especially frustrated when professors who teach about LEARNING can't teach in a way that facilitates LEARNING. The class is really about animal behavior, not actually about the concept of learning. \nBalsam is standoffish and unfriendly. He lectures very poorly, cannot be easily understood, and has no variety in his slides. He is old and doesn't understand how to use youtube, yet he insists on trying to show videos in class. He makes simple content seem confusing and does not prepare you for his tests. \nDO NOT TAKE THIS CLASS. It is a horrible class. Literally nobody I talked to in it enjoyed even a fraction of it. Stay away from him if at all possible.\nWorkload:\nOnly the two midterms and the final, each worth 1/3 of your grade if you have no lab. If you have lab, lab is 1/3, and the three tests together make up the other 2/3. Reading is not necessary until right before the tests. Don't go to class, it just makes it more confusing.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 29, 2004",
            "review_content": "\nProf. Balsam seemed like a nice enough person, but I have to say that his voice is simply not fit to lecture. Some company should tape his voice and sell it as a sleep aid. The textbook was dense but not unmanageable and there wasn't anything all that surprising on the exams. The labs required a ridiculous amount of time, particularly since I was only taking the class for a requirement. 3 APA papers is not only a lot, itÂ’s a lot that really didn't teach anybody much of anything. The reviews of class material that we sometimes had in lab were actually helpful.  Steer clear if you are taking it just to fulfill a requirement, there are other classes that will take up a lot less of your time and possibly teach you a lot more.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 21, 2004",
            "review_content": "\nThe class had the potential to be interesting, but Balsam sucked the materical dry.  His lectures are unorganized and BORING. He's really moody and an even worse lecturer.   The tests were not difficult, and I actually found them to be on the easy side. But they weren't graded fairly either.  Balsam is just a strange professor. Stay away from this class at all costs. \nWorkload:\nI took it without the lab. The reading is very light. Just read a few days before the test and you'll be fine.  Answer the practice questions he gives out online. 3 tests with MC and essay. Non cumulative. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 20, 2004",
            "review_content": "\nI thought this was a great class.   I found most of the lectures interesting and Balsam to be very enthusiastic and willing to explain things.    True the book is dense but the lectures helped a lot.   Balsam made the material interesting with his explanations and examples.     I thought that the number of people who came late to this class was ridiculous and it annoyed me as much as the instructor.   \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 18, 2003",
            "review_content": "\nHe is the worst professor ever. He is sarcastic (not in a funny way) and extremely anal. His grading is unfair and his exams are difficult. He has a hard time with new technologies. The lab is not helful - the new lab director (Florer) knows nothing.\nWorkload:\n3 tests (non-cumulative)lab: three full lab reports, questions and graphs\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 04, 2003",
            "review_content": "\nThis was honestly one of the worst classes I've ever taken.  Prof Balsam in some ways does a good job at making the rather dry ideas more accessible through his numerous everyday examples.  However, I do not believe that makes up for his extreme arrogence and self involvement.  The last few weeks of the semester he decided to torture the people who came into class late, which in my opinion was grossly inappropriate, and frustrating to both the people who came in late, and those of us that had come on time.  The lab was by far the worst portion of the class.  The assignments were incredibly time consuming and didn't actually help you learn everything.  Additionally, there were 3 full APA papers, which is ridiculous for a 1.5 credit lab.  The new lab technician (Dr Florer) was unclear in her expectations, and completely inconsistent in her grading.  Although she seems like a nice person, she is highly emotional, and a disaster to have as a prof.  So, unless you have an enormous interest in the psych of learning, I would STRONGLY recommend that you find another class.\nWorkload:\nLecture: reasonable, 3 exams.  Lab: average about 5 pages of writing per week in the beginning, and then 3 full APA papers in the second half of the semester.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "November 17, 2003",
            "review_content": "\nI actually liked this class. Yes, the textbook is extremely dense and boring, but I loved Prof. Balsam (though he can be cranky sometimes.) The lab is a decent amount of work, but it definitely helped supplement the lectures. A lot of people complained about tough grades for lab work, but I followed directions and I did fine. \nWorkload:\n2 tests and a final for the lecture (tests can be tricky), and tons of write-ups and a final project for lab. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "November 09, 2003",
            "review_content": "\nI HATEd this class. SOOOOO boring.  I am a non-psych major and had no choice but to take this b/c it was the only thing that fit my schedule, which made it all the more horrible.  Normally I am strict about never missing a class, but with this one, it was so boring that I must have missed at least 4 classes and that is a lot for me. Balsam has a hypnotic voice, the book is poorly written, and he can make you feel rather stupid when you don't understand something. Even though the lab is a lot more work, I found the instructor to be much more engaging, a a hell of a lot funnier, and I learned much more.  I dreaded the lecture every morning. Bring coffee - and I mean with a double shot of expresso.  Non majors who are looking for an easy way out of the science requirement - stay as far away from this as possible.  I will add that of all the students I spoke with in this course, no one liked it, and that included psych majors as well.  \nWorkload:\nLecture 3 exams, non-cumulative - not bad, but the material is so dry it will probably take you hours to study (plus the tests are tricky)...Lab - more work than you'll ever wish to have... a lab report every week adn a huge final project at the end..... not worth your time if you are not majoring. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "November 03, 2003",
            "review_content": "\nI cant say I love it, I cant say I hate it. Sorry if that isnt helpful. Balsam...can be somewhat scary at times. He tends to patronize students who ask questions and has some crabby moods. Class has dull moments, but the text is horrendous, so comparatively speaking, he does an ok job. Im not a psych major, and I suppose there are easier classes within the department....but the real warning is the new lab instructor. Ill give her the benefit of the doubt, it is her first semester. But I gotta tell ya, she needs a hell of a lot of improvement. The labs arent uber-hard,although they expect three APA-style labs over the semester, which is ridiculous. Most psychologists dont even use it, and for me, who has zero interest in the field, finds it a little ridiculous to require of undergrads.\nWorkload:\nclass: two tests, non cum, and final. Lab: weekly partial reports of graphs and questions, 3 APA reports. Final project being one of them.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "April 01, 2003",
            "review_content": "\nI love Prof. Balsam. Okay so the material is a little dry sometimes and you may be looking at your watch I little too often. However he does know and love his stuff and offers plenty of examples. He doesn't use slides but I actually didn't have a problem with his notes on the board. I found him very well-paced and easy to follow. Do the study questions and you can even email it to him to check. He is very very accessible and you can go to him with any questions. Plus if you love emailing prof's thousands of questions don't worry - he loves questions and people who show some effort in studying. \nWorkload:\nFine. Some say exams are tricky but I found them pretty reasonable. Even if you get a few wrong you can still get an A. There are 3 non -cum multiple choice and equation exams. I would def. recommend this class! Do not fear other people's review. Woohoo for Peter Balsam\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 20, 2003",
            "review_content": "\nThe professor's fine.  Balsam is actually more entertaining than a lot of psychology professors.  The class though is another matter.  I took only the lecture and found the textbook boring and incredibly dense, at times even incomprehensible.  The labs probably helped people understand the  material better; the study questions Balsam offers help very little, as the questions on the exams are dependent on both the book and the lectures.  The exams are tough, and watch out -- some questions are very tricky.  It could be worse, but this was not one of my favorite psych classes, even with a tolerable professor.\nWorkload:\nThree exams for lecture-only students, non-cumulative final.  Read the exam even if it kills you, especially if you are not taking the lab.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 02, 2002",
            "review_content": "\nBalsam is a really strange professor. He is totally paranoid. In my opinion he is always under the suspicion that no one enjoys his class, that you are drawing instead of taking notes, and are cheating on his booooring exams. i would stay clear\nWorkload:\na coupla exams . and labs if you are in that section\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "November 10, 2002",
            "review_content": "\nI found this class to be unbearably boring but it partly may be due to the fact that I took Human Memory and Learning. I'm hard pressed to find anything enjoyable about this course. The textbook is dense and dry and goes into the type of detail that I never wanted to know about (it doesn't even have color!) and the professor is not any better in class. Most of the time his lectures are random and not organized at all. He seems to have no real direction and he tries too hard to be funny in class (which he is not). His voice is monotonic and he speaks slowly, making it difficult to maintain consciousness during lectures. If I didn't have to take this class, I would have dropped it by day two. \nWorkload:\nTwo midterms and a final. Doing the questions that he puts online is slightly helpful. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 31, 2002",
            "review_content": "\nHe thinks he's funny, but he's not. The course is interesting, however the lectures tend to drag. You need to go to lecture and read the book to do well. The labs take a long time to complete, but they aren't bad.\nWorkload:\nReading, Midterm, Final and lab reports. The exams are TRICKY\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 17, 2001",
            "review_content": "\nI really liked this class. The textbook is really dense, but the lecture really helps. He gives thousands of examples to help you understand topics, and he'll go over something as many times as it takes for everyone to get it. Hes very big on applying the concepts you learn to the real world, and I liked that. The lab is a great supplement to the lecture, and the people in the lab understood the concepts much better than the people who weren't, but it took up a hell of a lot of time- 5-10 hours a week, and then the idependent project at the end takes over your life, but you learn a lot.\nWorkload:\nreadings, 3 tests, non-cumulative. Hes a fair marker, and his tests aren't tricky, but you really have to know the material. Lab reports are hellish and long, the two full ones are over 20 pages, but you have over 2 weeks to do them.\n"
        }
    ]
}