{
    "prof_info": [
        {
            "prof_name": "Rivka Galchen",
            "prof_id": 2256,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 07, 2006",
            "review_content": "\nif you are lucky enough to get rivka as your u writing teacher you are really blesed. she is the greatest teacher at columbia. she is kind and willing to help people out side of class....soooo basically she is amazing and thank god i had her.....she helped me get through the clas\nWorkload:\nsame\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 15, 2005",
            "review_content": "\nI definitely recommend taking this class with Rivka.  University Writing is, in all honesty, not a favorite among the Core classes- parts of it are interesting, others less so, and the second half of the semester in particular can feel a bit too structured and high-school-esque.  But Rivka tries hard to keep everybody up to speed, and although she does adhere to CC's attendance policy, she can be very understanding about personal matters or unexpected obstacles of any kind.  She replies to emails from her students promptly and thoroughly, and although she will not tolerate consistently late work, she makes herself available to meet with her students individually, and will work with you if you are struggling with a particular assignment.  If you want a professor who knows who you are and works with you intensely on an individual basis, Rivka is the prof for you.  Oh yeah- she's also pretty funny and wears nifty outfits.\nWorkload:\nFour papers, none of which are terribly difficult, and 1-2 short homework assignments based on readings per week\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 19, 2005",
            "review_content": "\nI'll keep this brief. Everyone knows University Writing sucks and it'll make you miserable. The papers will still be a pain in the neck to write and the readings will still be a pain in the neck to do. But I promise that if you have Rivka she'll make it worthwhile. She's smart and funny and just interesting in general. She's a fair grader, not particularly easy, not particularly hard. You'll still hate doing the work but with her at least you'll actually look forward to going to class.\nWorkload:\nThe same 4 papers as any University Writing section.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 06, 2005",
            "review_content": "\nOK I will be honest: University Writing is probably THE most boring and unnecessary and time taking class @ Columbia. But, Rivka made the class not only bearable but FUN! YES, she is a great person and teacher. \nThe first day of class, when I saw her, I thought that she was a student! Rivka is a live, enthusiastic, and fun person who just adds so much to you in a single semester. \nAnyway, anyone lucky enough to get Rivka as their UW teahcer is about to have the most fun they can in the UW class.\nRivka is always enthusiastic, motivating, supporting, and there for extra help if u need it outside class hours!\n1 to 10 (10 being the best) I rate Rivka a 10!\nWorkload:\nThe required UW essays, not much extra work, just the regular UW readings and the 4 essays - no final but just the 4th essay as the final essay.. It WILL take up much of your time, but you'll get a good grade in return. You truly get the grade in proportion to the effort you put in. Finally - Rivka rocks!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 04, 2005",
            "review_content": "\nRivka is a great teacher.  She is engaging and funny, extremely smart, preceptive, and understanding.  She is always willing to meet outside of class and gives wonderfully detailed comments on papers.  She is amazing, in fact, some people in the class developed a cultish obession for her (no joke) and created a facebook group fan club.  Unfortunately, given the ridiculous nature of the writing assignments (a CONVERSATION essay?  what does that mean?), Rivka--along with the majority of the class--struggled to discuss and convey the purposes of the assignments and the techniques that were supposed to be gleaned from them.  This is not Rivka's fault; rather, it is the fundamental problem of this course.  Give this great teacher and person a real class to teach, Columbia, and she will be amazing.  Future students: mess with her and 12 dedicated students will kick your ass--that's how great she is.\nWorkload:\nThe usual:  4 essays, all pointless.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 08, 2004",
            "review_content": "\nRivka is a truly amazing teacher and I cannot recommend her class more highly. Not only does she have the craziest fashion sense (good crazy that is), she is fun, approachable and sincerely interested in her students. She is happy to meet after hours to help on any matter, and writes full and helpful responses to your work. I have heard terrible stories about U.W. but none came to fruition with Rivka. She made this class one of my favourites, and if you get half a chance, you should take her section. \nWorkload:\nStandard U.W. system--four essays of varying lengths and difficulty. She's a tough but fair grader, as required of the whole program (so no point complaining). No final.\n"
        }
    ]
}