{
    "prof_info": [
        {
            "prof_name": "Summer Ash",
            "prof_id": 3519,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 23, 2010",
            "review_content": "\nI hate science and I REALLY HATED Frontiers of Science lectures. But Summer Ash was the one benefit to being in that class. Not only was she fair and approachable in seminar, but she also cared about each and every student in our class, often checking in on our process with WIAs, term assignments, and exam prep. Also, it's rare if she doesn't respond to an email within a few hours. Summer somehow managed to make the most obscure and seemingly dull topics decent for our class. If you have her, appreciate her, because she is truly the best FroSci seminar leader you could ask for.\nWorkload:\nAverage FroSci workload. We had to do drafts for our final paper, so it seemed like we had some extra work, but it paid of because we had very little work to do by the last weekend.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 11, 2010",
            "review_content": "\nIf you have any experience in legitimate science classes in high school, you will be fine in this class - don't worry.  Summer Ash is a smart person; she is approachable, but fair.  The concept of the course in itself though has its positive and negative aspects because it attempts to lightly introduce 4 different areas of science.  \nTo get an A:  Participate in class, do the homework assignments well enough to get a check on them.  Although before the midterm, she will grade one of the WIA's on a point-basis (you are warned - do well on that WIA/go to the help room if you are not confident enough).  Be very meticulous on the midterm.  Focus on units, assumptions, and avoid math mistakes.  Also, work quickly on the midterm.  The final is a bit more lax, but still, keep track of your time.\nWorkload:\nThe WIA's should take about 30-45 minutes and if you get a check, you are good.  They are not graded on a point system, so you do not need to pain yourself to get every single detail correct.  Make sure you LABEL EVERY SINGLE UNIT and LABEL EVERY ASSUMPTION AS AN ASSUMPTION on the WIA's and on exams.  The midterm and final this year took me two hours each to study for.  The pop-quizzes were sometimes on general facts from the lecture, and occasionally also on some specific details that you will not know if you fell asleep during the lecture.  There is no need to really study for this class - just stay awake in the lectures if you can.\nFrontiers workload is almost non-existent.  If you think Frontiers was a lot to handle, wait to you get to the hard classes!  \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 03, 2010",
            "review_content": "\n  I did not mind Summer as much as everyone else is saying.  Yes she did summarize what was said in lecture in seminar in almost the exact same words, and yes she is a little robotic, but I felt overall she was pretty fair.  She grades homework, which is essentially a bit of graph reading and some critical thinking after some articles that may or may not be very helpful, extremely tough.  However, the inclass quizzes are a joke: they are the big ideas of what was said in lecture, and it is not necessary to study for them.  The midterm and final are departmental, and they are pretty straight forward.  With Summer, all you need to do is write a logical answer and explain your thinkign and she will give you full credit on the assessments.  Also, if you participate in class she is willing to bump you up a half letter grade.  Finally, if on the final you surpass your first midterm score by the standard deviation of the midterm (which was 8 in my class) she replaces both your midterm and final score with your good final score which is significant.  Overall, I felt she was qualified and was not the worst teacher as everyone else seems to think.\nWorkload:\nMidterm Final, inclass joke popquizzes, weekly hw  \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "November 19, 2009",
            "review_content": "\nSummer Ash, Wow. Worst teacher ever. \nThe class is terrible and a joke, but that's beside the point because we take it. Anyway, do yourself a favor and switch out if you get her. I decided to not do the homework after a while because (as some other posters have mentioned) it was pretty difficult and totally unrelated to the lecture or seminar with Summer. She doesn't grade based on effort for homework, just if you got it right or not. In fact, one of my friend's (econ major) used calc to solve a problem and she didn't give him credit because it wasn't what she taught in class. She'll pretend to offer you a lot of help outside of class, but don't be fooled into thinking she'll look favorably on you for your seeking the extra help. And besides that, she's just not a good a teacher so it's totally not worth it. Her social skills are terrible in general. She acts like a robot and if someone makes a joke she looks at other people's reaction so she can gauge whether or not it would be appropriate to let out a slight smirk.\nWorkload:\nToo much , a lot. Don't do it\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "November 10, 2009",
            "review_content": "\n     Throughout this course, I held a strong and thorough appreciation for the subjects we were learning about. When it came to Astronomy, I found fascinating the idea of Andromeda being the only galaxy coming towards us, I found the idea of Cosmic Microwave Background Radiation to be an undeniable proof for the Big Bang Theory. I enjoyed the earth sciences, the quantum mechanics and chemistry, the neuroscience, but unfortunately, my grades just didn't reflect this.\n      Every week, I put at least two to three hours or more on the homeworks, doing them intuitively where possible, and even then, I was given failing grades. It was after being patient and receiving three straight 60's on the homework with nothing but checks or x's on them that I approached Summer about what was going on. I found it unreasonable that she would fail a student who showed thorough work but did not get the right answers on questions that were so strongly mathematically oriented (especially astronomy).\n      Even with office hours, Summer was often very vague and at times questioned whether or not I went to lecture even though I had made it clear that I did, nor would she hesitate to mention her undergraduate experience at Stanford and how it was just a good ol' time.\n      I am sorry to wreck on a teacher so hard, but if you have her, do not look at it as a challenge, you can learn just as much through other teachers who are more active and contributory to their field. It is great when a teacher grades meticulously, because that is when a student learns the most, but when a teacher grades like this without offering proper guidance on how to progress as a student in their class, then get out, it is simply unfair.\nWorkload:\njust the same as everyone else who is taking Frontiers of Science, except harshly graded without explanations. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 11, 2008",
            "review_content": "\nI did not care for this class and Summer did not help.  She did not explain things clearly and expected a stronger science background than most people had.  I'm pretty sure she cares that you are doing well, but I was never comfortable around her.  It also doesn't help that she doesn't have a strong biology background.  She admitted to taking high school biology, but nothing since then.  When I would ask about complicated terms or ideas, she could recite what was mentioned in lecture or the reading, but she was not aware of much more than that.  The most annoying part what the tone.  I felt as if everything was punitive.  She grades things very closely.  The homeworks have scores (not generally very high) and the midterm was brutal.  After she returned the midterm she refused to talk about them.  I have no idea about a mean, median, standard deviation, curve or anything going into the final.  Some people in the class like her, but most dislike the class and really dislike the section.\nWorkload:\nThe weekly homeworks.  Be warned: she actually grades them.  The articles aren't really necessary, but some were helpful or interesting.\n"
        }
    ]
}