{
    "prof_info": [
        {
            "prof_name": "Stiliana Antonova",
            "prof_id": 1770,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "December 16, 2005",
            "review_content": "\nThere is lecture twice a week.  I go half the time because there is a problem set due every week.  Lectures are boring because she follows the book exactely and she does not lecture too well.  Problem sets aren't bad except for when you waste sooo much time thinking you have the wrong answer when the answer that she posts for the problem set is incorrect.  Even the practice final exam has errors in the answers and you wonder why you study for so long and you never get the right answers.  The midterms is no longer open book.  The lab is a joke, you go to class to pull on a string.  \nWorkload:\nWeekly problem sets, 2 midterms, and final\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 29, 2004",
            "review_content": "\nAntonova is an adorable Russian professor.  However, her lectures are monotone and if you haven't had a good night sleep, you are likely to doze in her class.  The pace of the class is not too fast, especially because she works problems on her power point presentations with the class.  The lab component is easy.  There is no specific format for the notebooks, and as long as you've included all the calculations and a convincing paragraph in the analysis, there is no problem earning a high grade.\nWorkload:\nHomework once a week.  Two open notebook midterms.  Final with an equation sheet.\n"
        },
        {
            "course_name": "Mechanics Lecture + Lab",
            "review_date": "December 24, 2004",
            "review_content": "\nProfessor antanova is definately a sweetie.  however her teaching style isn't that great and the textbook isn't really that much of a help either.  if you have already taken physics in high school, take it with her - if you haven't, i suggest you go over to columbia and take it there.  \nWorkload:\nweekly problem sets, 2 midterms - open notes, 1 final exam - closed notebook \n"
        },
        {
            "course_name": "Mechanics Lecture + Lab",
            "review_date": "January 04, 2004",
            "review_content": "\nProf Antonova is a very nice, but is also extremely boring. Her tests are easy (open notebook) if you study the homeworks. Attend class if you want to take notes, but you can learn the material on your own. If you have any questions ask her. Be presistent because sometimes she's unclear. \n\nWorkload:\nAbout eight homeworks, one easy midterm, one medium midterm,  one medium/difficult final.\n"
        },
        {
            "course_name": "Mechanics Lecture + Lab",
            "review_date": "November 14, 2003",
            "review_content": "\nThis woman is really sweet but incredibly boring. Her accent is fine, you shouldn't have too much trouble understanding her, but her teaching is really not that great. I used the book to understand most of what I learned, and the rest I already knew from high school.  Despite the lectures, she'll answer any question you have at any time, accept late homework, and has open-note tests.\nWorkload:\nWeekly homework that's no big deal, 2 open-note midterms and a final.\n"
        }
    ]
}