{
    "prof_info": [
        {
            "prof_name": "Gina Diaz",
            "prof_id": 2045,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "conversational spanish I",
            "review_date": "December 21, 2005",
            "review_content": "\nGina is a typical product of american liberal higher education.  As are we all.  She's cultured, intelligent, interesting, ultra liberal, and...disgruntled with the system.  Casa hispanica is a department lacking a pulse.\nWouldnt you be unorginized and uninterested?  You have this phenomenal education and want to teach spanish literature to eager students...and instad, you get to teach elementary spanish to a bunch of spoiled brats who are taking spanish because it is easy and moan about the class being too late/early in the day.  Usually her students are either know it alls (with crappy spanish) or kids who could care less and do nothing.\nShe's very understanding.  People who abuse that generosity got caught with a nasty grade.\nBut dont worry - shes out to get her PhD so she can finally teach what she wants - so none of you will probably have to worry about getting her anymore.\nWorkload:\ncake.  great if you want to take and expose yourself to a spanish environment, but cant do work every night for it.\n"
        },
        {
            "course_name": "Comprehensive Intermediate Spanish",
            "review_date": "August 31, 2004",
            "review_content": "\nEverything the other two reviewers said about the Spring 2004 course is completely right. Although she is a very sweet person, she shouldn't be teaching Spanish, as even she will admit she doesn't know how to teach grammar. There is nothing you can learn from her that you can't learn from the book [faster and less painfully].\n"
        },
        {
            "course_name": "Comprehensive Intermediate Spanish",
            "review_date": "May 20, 2004",
            "review_content": "\ngina is a very nice person, who i think honestly believes that she is teaching you.  unfortunately, she isn't.  the class is conducted at least 50% in english (sounds nice until you realize you aren't really learning spanish).  nonetheless, when you ask her to explain a grammar point, she can't explain it, saying that instead you should instinctively know it.....from hearing the spanish that she never forces you to speak! my class was also bogged down by people who were all to eager to speak english and carry on fairly pointless conversations, whom gina allowed largely to run the class.  to be fair, it isn't entirely her fault. \nWorkload:\nlike any language class, loads of busy work.  while she is a very nice person, that niceness does not translate into what i would call easy grading.  \n"
        },
        {
            "course_name": "Comprehensive Intermediate Spanish",
            "review_date": "May 05, 2004",
            "review_content": "\nThis class was the bane of my existence for the entire spring semester. Gina is a very nice person, which is why I feel bad giving her such a bad review. Her class is completely unstructured. It was not made clear what we had to learn or why we had to learn it. Quizzes would be given with ambigous answers.  She did not encourage classroom conversation. The whole class was a big waste of time as I did not need it for the language requirement.\nWorkload:\nquizzes/workbooks/studying that will get you nowhere...\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "April 26, 2004",
            "review_content": "\nIf you want to learn anything Gina is DEFINITLY NOT the person you want to take this class with.  Not only will you not learn anything, but she will grade you really harshly and wonder why the WHOLE CLASS is not doing to well.  She incredibly nice but a very horrible teacher that speaks WAYYY to much english and then tells the class they need to speak more spanishh.....\nWorkload:\nthe regular load for any elementary II class...weekly tests and some 1 page essays\n"
        }
    ]
}