{
    "prof_info": [
        {
            "prof_name": "Vanessa Agard-Jones",
            "prof_id": 13665,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 04, 2020",
            "review_content": "\nI took this class to fulfill a major requirement (not anthro) because the professor and class came highly recommended. While Professor AJ is super sweet and a good lecturer, I personally didn't find the content interesting. The weekly readings were super long and dense. We spent a considerable portion of the semester focusing on the histories of past anthropologists like another reviewer said, which I guess is important to our understanding of the discipline, but I wasn't expecting that going into it. Also, my TA did a bad job of facilitating discussion. The museum essays were fun to write, though! \nWorkload:\nWeekly readings (50-100 pages)\n2 museum essays (you go to a museum and analyze exhibits through an anthropological lens)\nField work assignment (cancelled due to COVID)\n750 word reading response penpal letters to a randomly assigned student in the class\n\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 20, 2020",
            "review_content": "\nIf you're taking this class because you think it will be a fun and interesting one to fulfill your foundations requirements. Don't. Only take this class if you are genuinely interested because there is a huge workload that is not enjoyable if you don't genuinely like cultural anthropology. The class is structured well and the TAs are very nice. Professor AJ is a good lecturer but I personally would not take this class again because of how time consuming it was considering that I have no plans on going into this field at all. This class is a lot of work considering its at the introductory level. The actual content of the class is mainly the history of anthropology. So you just have to read a bunch of work by racist old white dudes for at least a month or two before you actually get into reading modern ethnographies.\nWorkload:\n50-100 pages of reading per class session (meets twice a week), 2 museum response assignments, 3 fieldwork assignments (which we didn't do because of coronavirus), and a final (which we also aren't having because of coronavirus), weekly 750 word responses to each reading (only started because of coronavirus)\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "March 04, 2019",
            "review_content": "\nProfessor AJ is phenomenal for this course. She is thorough in her lectures, and they pair perfectly with all her assigned readings. While she assigns a heavy workload of reading, they are all clearly well thought out and relevant to her lectures. She is engaging to listen to, and thus a great professor for an introductory level course. Highly recommend!\nWorkload:\nHer assessments are mostly in the form of papers, both analytical and ethnographic. She asks difficult questions of her students, but if you do the readings and come to lecture you will be well prepared to write. \n"
        }
    ]
}