{
    "prof_info": [
        {
            "prof_name": "Ruth Borgman",
            "prof_id": 1825,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 30, 2012",
            "review_content": "\nThe positive review on the top of this page was written by the professor. This was the most atrocious semester we as students ever endured. Class is very disorganized. It is not possible to learn by listening, since we never get a chance to listen to anything other than arguments started by one student to another to another, to the teacher, back to the student. It is not a good way to spend your time. Try enrolling in a class that is taught by a person exhibiting some leadership and organizational ability. Please do not read any reviews that are positive. They were all written by the professor. We know this, since she stated this in class. Really bad decision to enroll here.\nWorkload:\nhigh\n"
        },
        {
            "course_name": "2nd Semester Spanish V1102",
            "review_date": "January 30, 2012",
            "review_content": "\nI can't even begin to describe how dumb this teacher really is. To be totally honest, it was almost as if we as students were expected to understand spanish as if we were fluent, before even entering the class, DESPITE the fact that this TEACHER CAN'T EVEN SPEAK SPANISH. She has trouble, HUGE trouble, stringing together multiple sentences on a consistent basis. It is frustrating and unremittingly difficult to speak with this person, as she has virtually NO SOCIAL ABILITY TO CONVERSE WITH HUMAN BEINGS. I find it unwise to enroll in this class. There is nothing to gain from a teacher that has nothing to teach. She is not spanish, she is barely able to speak spanish, her obvious american accent is ridiculously unkempt, and worst of all, she knows close to nothing about how to teach a class. My goodness. Teaching means teaching, not reading word for word from your textbook all the time.\nWorkload:\nsomewhat overdone\n"
        },
        {
            "course_name": "Comprehensive Beginning Spanish",
            "review_date": "December 15, 2011",
            "review_content": "\nTo be Fair\nBefore the beginning of each semester, Professor Borgman sends out an email to all of her students warning that the class will be fairly difficult and fast-paced. She also reminds us that the course is intended for those that have already been exposed to the language and have a decent grasp on it. Students that have had little to no exposure to the language, however, are focused on the \"Beginning\" part of the course title, instead of the \"Comprehensive\" and stay despite Borgman's warning. Or perhaps this may be their last year to complete Columbia's language requirement, and thus, have no choice. Despite the reason, these students are usually the ones that experience difficulty throughout the semester.\nBorgman speaks in Spanish a great deal of the time. She switches to English for students that have difficulty speaking/understanding the language, which is nothing negative on her part. She tries to cater to the students' needs, while at the same time encouraging them to speak in Spanish. \nCons\nWith that said, Professor Borgman is by no means perfect. She has great difficulty explaining grammatical concepts and rely on other students that excel within the class to explain the concepts for her. When confronted with grammatical inconsistencies in the language, she gives the right answer, but if you continue to push, she is very easily overwhelmed and instead validates the wrong answer proposed by the confused student, thereby confusing the entire class. When reviewing a test, students hand in their tests and tell her that she graded incorrectly. She very easily changes the grade, despite the fact that sometimes the student really is wrong. This, I attribute to a flaw in character, as she needs to be much more confident and assertive in delivering the material. I have no doubt that Professor Borgman is fluent in Spanish. She just isn't fluent in particular aspects of teaching it. \nPros\nShe does, however, have redeeming qualities. I thoroughly enjoyed the cultural aspects of the class. Every few weeks, Professor Borgman spends an entire class on dissecting the language and meaning of Spanish songs by Juanes, Celia Cruz, etc. It might not be your cup of tea, but in terms of an integrative approach to learning Spanish, it was pretty awesome. In fact, the entire course is structured in an integrative manner rather than an instrumental one, as it is centered more around cultural and idiomatic expressions in Spanish. Learning the tenses and grammar seems to be more a review of something that has already been learned previously. \nHonestly, I think this is what oftentimes throws students off who have learned Spanish in a more basic and chronological manner (i.e. present tense > imperative > preterite > imperfect > future > conditional). An integrative approach is slightly more confusing as it assumes that the student already has a grasp on the tenses (which was what the course was designed for). My Spanish improved tremendously within one semester due to this approach.\nFinally, in terms of grading, I think Professor Borgman really is fair in terms of grading based on effort. If you truly show that you care, and you actually do your homework and speak to her during office hours, your grade will reflect that. This would be particularly helpful to those that spend most of their time complaining about Borgman's grading system. If she were to grade based on test scores, those students would fail. \n______________________________________________________________________\nNote: Homework assignments from MySpanishLab aren't particularly useful, as the program allows you to try as many times as you like, and eventually gives you the answer. \nI hope I've given you the tools you need to make your decision on whether or not this course is for you. I do agree that it is not for everyone, but I definitely wanted to point out certain pros that previous reviewers have not. It's far from being all bad. \nWorkload:\nVery manageable: MySpanishLab assignments (easy), occasional worksheets, 2 quizzes, 1 midterm, 1 written final, 1 oral final, 1 oral presentation - Grading is very lenient for the orals and homework assignments are very easy (see note above).\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "June 07, 2011",
            "review_content": "\nI just want to say that all the negative reviews below are fairly accurate. \nShe is not a qualified spanish instructor, period.\nShe doesn't explain, and doesn't know how to explain, any, and all aspects of the fundamentals of spanish grammar, either in the colloquial/vernacular sense, nor in the formal/written. She rarely converses in spanish.\nGrading is rarely based on performance on a test/exam, but on whether the teacher thinks you like her or not. This usually works, since on written portions of exams, she can literally alter the grade down enough for the objective portions (multiple choice) to get compromised, regardless of performance on the exam as a whole.\nLet's just say she is an unorthodox teacher, with a fairly weird way of going about grading/teaching/organizing class time and the class syllabus. The only problem is that students shouldn't have to get caught up in this type of class. If there is any purpose for culpa reviews, it shouldn't just be to assail and warn you of horrible, horrible wackos, and vice versa for good teachers, but to inform the reader of what they are getting themselves into. When I say don't sign up for this class, please, please, don't do it. It's not ok to say, well, you just want to try it out to see what these reviews are about, or, to say, well, there aren't any other sections of the class which fit your schedule. In all honesty, if this is the case, don't even take spanish! You came to Columbia, you are in an Ivy, a prominent one at that, you are paying 55 grand a year to come here, and I'd be damned if another student gets caught up in a class which reminds you of being back in a public middleschool, with the worst middle-school teacher on campus! Don't sign up for this class, period! \n\nWorkload:\nappallingly large.\n"
        },
        {
            "course_name": "Intermediate 2",
            "review_date": "May 15, 2011",
            "review_content": "\nBEWARE! If you want to learn Spanish, or feel as if your tuition dollars are being put toward good use, stay away! Borgman is without question the worst Spanish teacher I have ever had (and I've taken Spanish since 6th grade, at a public school). 1) Classes have absolutely no structure. 2) She speaks English for about 60% of the class period (what happened to the idea of learning by immersion?) And 3) Your grade is the most arbitrary thing in the world. You will have no idea whether you will receive an \"A\" or a \"B-\" until you timidly log onto SSOL come post-finals time. \nStay Away.\n\nWorkload:\nMediocre. MySpanishLab assignments/periodic worksheets. 2 quizzes. 1 Final Exam. 1 Final Project. \n"
        },
        {
            "course_name": "V1101 Elementary Spanish I; W1220 Comprehensive Intermediate Spanish",
            "review_date": "May 14, 2011",
            "review_content": "\nSPAN c1220.   This class combines two semesters of intermediate spanish into one, so you would think the school would hire someone who really understands the language to teach the class.  Unfortunately, Borgman is not that teacher.  She is a sweet lady, but often speaks in English, teaches to the lowest common denominator, has a very difficult time explaining grammar, and is disorganized.  I would not recommend taking this class if you actually want to learn Intermediate Spanish, but you certainly can learn it on your own and the grading is not harsh.  \nWorkload:\nStandard workload for a spanish class; weekly workbook assignments, two quizzes, midterm, a final, and a final project.  \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "April 01, 2011",
            "review_content": "\nWow. Just Wow.\nThis has got to be by far the worst class i have ever taken. She is not a native speaker of the spanish language, and she is not even fluent. Wow.\nPlease save yourself and choose someone else. I am still kicking my foot for not switching out before the drop deadline. I guess i thought i might give her a chance after assuming she needed time to feel more comfortable. How wrong i was.\nAll you do in class is go around in a circle answering the homework questions from the night before. It is absurdly tedious and annoying to cooperate under this sub-highschool standard classroom environment. You feel like you are back in middle-school. How much can you actually learn going around in a circle spitting out what you already wrote on a paper the night before. Class is an absurd waste of time, and it doesnt quite make sense how if you are late to them, your grade goes down. Your grade is based on whether or not your voice in class sounds enthusiastic when it's your turn to talk. She has a false idea about what it takes to learn a language, and firmly believes that it has to do with how good you are at faking a spanish accent, as opposed to what words come out of your mouth. Figure this out for yourself if you wish, because the only students with a decent grade will be the ones who speak with fervor, and act as superficially spanish as possible (nothing wrong with this! They are good fakers, that's all, and i'm just saying that this ability shouldn't be why they get A's!)\nI don't mean to be rude, but, spanish students, beware!\nWorkload:\nnot to bad, but the teacher is the problem\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "March 22, 2011",
            "review_content": "\nThis is a rather disappointing semester. Classes are exceedingly disorganized, with class discussions often diverging into student led debates over proper grammar use. This teacher is rather uninformed in advanced understanding of the structure of the spanish language. She rarely speaks in spanish, and it is often questionable whether she is even fluent. Tests and quizzes are poorly written, and the amount of reliance on the book belies how little this teacher probable is able to teach and explain the language at all. There are absurd amounts of homework, and classes are exceedingly painful to sit through. Please seek another teacher before wasting your time with this overly pedantic, simple-minded, and deficient teacher.\nWorkload:\nfar too much for an intermediate spanish I class, not to mention the lack of sense in assignments, which all too often rely on assemply-line-esque reptition homework labor. The workload doesn't even pay off- the extent to which it is focused on mundane repetitive tasks makes you not pay attention while you even do the homework in the first place, not to mention how badly it affects your memory of the subject matter.\n"
        },
        {
            "course_name": "Spanish Intermediate II",
            "review_date": "May 10, 2010",
            "review_content": "\nProfessor Borgman is a very nice woman who tries to engage all her students in discussion. She is not evil or out to get you... just do not get her angry by having half the class not do homework ... she does not appreciate it (Who would?) and at one point this semester she almost lost her cool. Besides that, she's always smiling and seems to enjoy what she is doing. \nWhat I did not think was too effective was the fact that she did not have a set schedule of things for us to do. Sometimes we actually had to ask about what we would do during a particular class, because you could sort of sway her to do anything. \nShe allows you to rewrite all your essays, and wants to help you out. I liked that we spoke Spanish nearly all the time. However, she will let you speak in English if you ask and have something complicated to say.\nShe's also the only prof. this semester to have allowed my class to go outside for a session on Hamilton Lawn. That was very nice of her. \nOverall, I think her class is fairly simple - no worries taking a class with Borgman. \nWorkload:\nNot much at all. About 5 or 6 compositions total, 400 words each or so. However, the rest of the time we would either have MySPANLAB homework which she did not check, or 3 exercises or so in one of the spanish books. She does tend to collect homework, so it's a good idea to do the ones with multiple questions on text or any of the movies. Also, one final project at the end. This year in pairs we picked a neighborhood and did a powerpoint/written assignment on it. It was actually pretty fun.\n"
        },
        {
            "course_name": "Pre-hispanic societies",
            "review_date": "January 18, 2006",
            "review_content": "\nI actually expected a lot more from this class than what I got. I must say it was definitely stress free, not much work was demanded. She is approachable but not too clear when it comes to what she's looking for in a paper, so you have to take the initiative to find out exactly what she wants. She can't stand more than one lateness though, it'll put you on her bad side.\nWorkload:\nFour 2-3 page papers and a final 7-10 page paper; in-class presentations- nothing difficult. \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "August 29, 2005",
            "review_content": "\nI think that Prof. Borgman was great. She tried really hard to engage everybody in conversation and to make class exiting. Some days I felt bad for her though because nobody would talk, and if they did, they would give one word answers. Although she may not have been the best at teaching the grammar, she definitely notices the people who put in effort, even though not much is required, because almost all of the work is in the workbook. Prof. Borgman also has a good sense of humor, and enjoys students who attempt to talk a lot in class, even if they make fools of themselves. She does make some jokes that people do not understand, because they are in spanish, but if you nod and smile when she is talking she will think you completely understand her and like you.  She is a fair grader and a nice woman.\nWorkload:\nDaily workbook assignments, 3 written assignments, a final and oral presentation. Midterm was a regular sized standard test.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "November 07, 2004",
            "review_content": "\nThis class was a mess. I took it w/ her because I figured taking Spanish w/ a non-native speaker would be easier... but it wasn't. She used all kinds of vocabulary that NOBODY knew and taught grammar in her own special, confusing way without giving thorough examples. She'd much rather be teaching her spanish lit classes b/c we read random short stories that nobody understood about some grocery store soap opera thing. Quizzes were completely random as 75% of the class got C's or below on them and on her midterm. Plus side: no formal 2-3 page compositions and an in-class oral that's a random dialouge between you  and another class-member. There has to be a ridiculous curve because I got C's on 5 of the 7 quizzes and on the midterm but I got a B+ in the class.\nWorkload:\nusual spanish department stuff, some random reading assignments, and \"projects\" like a cookbook comprised spanish recipes that the class submits\n"
        },
        {
            "course_name": "Spring 2004 Spanish W3220 section 001",
            "review_date": "August 06, 2004",
            "review_content": "\nI took this course in the spring 2004 (Pre-Hispanic Societies).  If you want a thorough and in-depth study of the Mesoamerican and Incan societies, this is the course you want to take.  Starting with and overview of both societies and a subsequent study of each region and each society, first  with the Olmecs of Mesoamerica, the Teotihuacanos, the Toltecs, the Mayans, etc. , the class studied not only the peoples, but their arts and artificats, their writings, their astronomies, customs, cultures, and religions.  It was no less so with the societies that predated the Incas, those of Chavin, Nazca, Tiahuanaco  and, ultimately, the Incan Impire and its disintegration after the arrival of the Europeans.  If your desire is to learn, up close, about these wonderfully developed societies that equalled and, at times, surpassed that of ancient Egypt, yes, yes, yes, do take this course. \nWorkload:\nBesides the books assigned, almost on a daily basis, there was a plethora of addition materials distributed to the class that served to expand on the class discussions and assigned texts.  Additionally, there were documentary videos that depict the results of archeological digs, ancient games,  and the magnificent artworks of the societies studied.   Yes, there was a lot of material, but without it we could not have gotten such a comprehensive study of these ancient Latin American  socities.  The professor always kept the class interested and talking about the different aspects of the materials being studied at any moment.  You would certainly not fall asleep in this class.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 08, 2004",
            "review_content": "\nI took four year of Spanish in high school, but I figured \"Hey, I spent a significant amount of time learning Spanish, why forget it now?\" Thus, I took this course thinking it would be a brainless A. It's certainly brainless, but it's by no means a guaranteed A. Prof. Borgman knows Spanish, but doesn't (if that makes any sense). I caught her in numerous grammatical and conceptual errors, but, figuring I shouldn't trifle with the woman who controls my grade, I said nothing. In fact, she directly conrtadicted her packet on the subjunctive three times in one class. I would be ok with that if she was correcting the packet, but the opposite was true. Do I think I'll end up with an A? Yes. Did my Spanish skills suffer as a result of being in this class? Yes. Would I recommend it? No.\nWorkload:\nPretty light. Workbook exercises that can be corrected via a pain-in-the-ass website that are due at the midterm and final. Some essays that she wants corrected until you get the check mark in the upper right hand corner of the paper. One short novel by Marquez that won't set your world on fire. A couple of oral presentations. Tests here and there. Not too bad if you don't wait till the last minute on the workbook.\n"
        },
        {
            "course_name": "Pre-hispanic societies",
            "review_date": "March 15, 2004",
            "review_content": "\nThis is the first semester BorgmanÂ’s offered the Pre-Hispanic Societies class, so you might expect that sheÂ’d have some kinks to iron out. But Â“some kinksÂ” does not even begin to describe everything that is wrong with this class. Certainly do not take it if youÂ’re interested in the subject, because the juvenile readings and lame videos will just frustrate you. Some of the reading is at 3rd or 4th grade level, no joke. The workload is not that bad in terms of amount Â– the reading always takes less than half an hour, and the in-class Â“discussionÂ” (read: summary) is easy. But as someone else said, Borgman is really vague about what she wants and then grades relatively hard with no explanation. I havenÂ’t really seen the psycho side that the other reviews talk about, but sheÂ’s completely uninspiring and, at times, infuriatingly condescending. Bad teacher, bad class. I recommend against it, although my experience hasnÂ’t been the disaster others have described.\nWorkload:\nVery short readings, three short essays, four 1-page reflections\n"
        },
        {
            "course_name": "Pre-hispanic societies",
            "review_date": "February 29, 2004",
            "review_content": "\nI would have to agree with the other reveiw.  Never has any teacher acted so rude and condescending towrd me in my entire life.  It is quite possible that this woman has some kind of split personality disorder.  This class is composed of a series of relatively short packets of reading material, and discussion their contents.  In addition, there are 4 \"reflections\" and three short essays.  It sound easy but don't be decieved.  Proffessor Borgman is exceedingly vague in expaining what she wants out of you in written work and when its not exactly what she wants she'll asks you to re-do it or labels you as stupid(probably both).  Furthermore, anyone who shows up late is secretly black listed which is death in a class where grading is so subjective (40% of it is based on \"participation,\" basically a measure of whether or not she likes you) .  On top of it all, the class, though the subject it covers is fascitiating, is almost totally unispiring.  In other words: AVOID THIS PROFESSOR AT ALL COSTS.  She may appear to be a sweet lady, but underneath she is totally psycho.  I never thought I would have to drop a class because of disagreemant with the teacher.  Proffesor Borgman showed me I was wrong.\nWorkload:\nnot bad if you can read Spanish well.  5-10 page readings plus 4 reflections and three essays.  God help you though if any of these are not exactly what she wants.\n"
        },
        {
            "course_name": "Spanish Emmersion",
            "review_date": "December 03, 2003",
            "review_content": "\nDEAR LORD, SAVE YOURSELF!!!!!!!!!\nAt first she comes off as this really sweet old lady, with full intentions of helping you learn and appreciate the Spanish language.  Little do you know the amount of time and effort needed to exceed in the class.  If she were the slightest bit exciting or lively, maybe the class might have been a bit more tolerable at 9am.  DO NOT piss this woman off or get on her bad side, b/c she will turn into the most condescending woman alive.  Nothing you do will ever please her.   Tardiness for any reason is unacceptable.  She's not as understanding as she looks.  Be aware!  I've seen she tends to be twice as hard on the native spanish speakers, trying to change the language that they are accustomed to.  In other words, don't take the class if you don't have to.\nWorkload:\nNumerous never-ending articles and long essays\n"
        }
    ]
}