{
    "prof_info": [
        {
            "prof_name": "Michael Stanislawski",
            "prof_id": 102,
            "total_reviews": 63
        }
    ],
    "reviews": [
        {
            "course_name": "History of the State of Israel",
            "review_date": "August 22, 2014",
            "review_content": "\nJust been going through CULPA for next semester and am very upset at the most recent review of Stanislawski's History of Israel. I took it last year and loved it! The lectures were VERY clear and easy to listen to and to learn from, the professor was always available to talk to students, the readings were heavy but fascinating, and I love the fact that the exams are open-book.For me, too, the fact that this was not a typical Middle East class in which the professor's politics dominated everything was a huge plus. Stanislawski tries to remain as neutral as possible, mostly succeeds. and spends more time on culture and society than on the wars and the conflict as a whole. \nTake this course!!\nWorkload:\n2 lectures a week, one discussion section focusing on the readings, heavy reading but you can skip a lot, 15-20 page research paper., open book midterm and final.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "May 22, 2014",
            "review_content": "\nJust finished Stanislawski's LitHum section, and think it was fantastic. Stanislawski knew the texts intimately, but more importantly, worked extremely hard to get us to understand and appreciate the material, which was often not easy. Contrary to some of the reviews here, he was extraordordinarily accessible and caring-- he went out of his way to meet with each student individually, to discuss not just this class but our overall coursework and academic plans, and was genuinely concerned about each student. He did have to cancel some office hours, but always made up for that with private meetings at another time. And at the end of each semester he invited us to his home form a review session, but it was as much just a friendly informal gathering to make us feel better facing the daunting exam.\nIn class he did sometimes talk a little too much, but this is because we really needed context and information about the authors and texts and he has amazingly wide knowledge and is really committed to students' learning. He used visual material a lot, which helped, and accompanied us to two tours of the Met to supplement the classes. He also required that we submit rough drafts for the first two papers each semester, which I guess doubled the work load for him, but was amazingly helpful in trying to get us to write better papers.\nFinally I enjoyed this class so much that I will definitely take other courses by Stanislawski, even though my major is far away from History. He is the kind of professor you came to Columbia to study with.\nInn short, if you can get into his section, do so! \nWorkload:\nThree short papers each semester, first two with required rough drafts.\nOpen-book midterm, class-wide final.\nGrading seemed to be generous.\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "January 16, 2014",
            "review_content": "\nI took him twice because we have mutual interests on Russia and Jews, Disappointed me both times. He is self-absorbed, mumbles a lot, and name drops. No structure, a lot of sidebars often irrelevant. Shows a lot of slides and uses youtube a lot, so that he does not have to prepare real lectures. Does not show up to his own office hours (3 times), or kick you out in 2 minutes, actually less. It is a shame because on occasion he got excited, and showed some potential to be a real intellectual, not just a monotonic, barebones lecturer. he just does not care about teaching, probably counting days to retirement, \nWorkload:\nLarge amount of readings with a TA that does all the grading in a tough manner with low grades assigned to non-favorites.\n"
        },
        {
            "course_name": "Imperial Russia 1682-1918",
            "review_date": "December 22, 2013",
            "review_content": "\nProfessor Stanislawski is alright.  For the most part, he just stood in front of the class and read off of rather boring lecture slides.  There were a few things, however, that really put me off about his class:\n1) He does not read over the midterm, papers, or final.  He may glance over them, but the TA is entirely responsible for the grading, and the TA this year (Alana Hein) was particularly tough and generally rude, although this is not the proper place to review her performance.  \n2) His powerpoints would typically include huge (HUGE) blocks of texts from historical documents that nobody could read due to the small print and that he would basically just read verbatim without giving much insight.\n3) There were times where he would read aloud texts that he already assigned for reading outside of class.  For example, he once read about 3 pages of a text that he also assigned for the discussion section.  I'm not really sure how this could be seen as beneficial or productive to the lecture.\n4) For the most part, the materials he used seemed to be lacking.  In the discussion of Tolstoy, he showed us the YouTube preview for the remake of Anna Karenina with Keira Knightly and Jude Law.  You can't tell me that there was \"just no information about this topic that would be relevant!\"  It's Tolstoy.  And Anna Karenina.\nOverall, I found his class to be loosely organized, yet occasionally engaging.  When Professor Stanislawski actually takes a stance on an issue or contentious historical subject, he immediately becomes a fascinating lecturer and intellectual, although these occurrences are rare.  The class is not necessarily the hardest in the world, nor is it the most riveting (which is a shame, because Imperial Russian History is truly fascinating).\nWorkload:\n1 Midterm \n1 Final\nThe tests themselves are not too difficult, although some of the questions can be rather dull.  His stress is less on the regurgitation of facts and more on the application and meaning of historical events.\n1 15-20 page research paper on a topic of your choice, which I found to be a little excessive for a lecture class, although both the professor and TA were very helpful and offered positive insight.\nWeekly readings which can be excessive but are not always necessary (the Riasnovsky text is a little boring.  Grabbing any other text covering the history Imperial Russia will be equally beneficial and probably a tad more exciting).  \n"
        },
        {
            "course_name": "Imperial Russia 1682-1918",
            "review_date": "December 11, 2013",
            "review_content": "\nProfessor Stanislawski is extremely knowledgable about the subject matter, and presented a sufficiently comprehensive overview of imperial Russian history. I would have liked to see him take a more argumentative stance on the course, though. Particularly towards the beginning of the semester, the lectures were almost entirely fact-based, not particularly interesting when talking about the Great Northern War and the 18th century succession crises. When he did present his own opinions, he tended to repeat himself ad nauseum, and the claims were fairly basic ones, for example his insistence on the contingency of historical events. As for the readings, while I thought the selections of primary sources was great, the only secondary source we were assigned was a rather boring textbook. There's no shortage of great historiography on Imperial Russia, as I ended up discovering while researching my final paper, and it's a shame we didn't have more of it assigned. Stanislawski's choice to highlight intellectual history was definitely a high point of the class. I have a feeling that Stanislawski would be a great seminar leader, and I was happy overall with this course, but as a lecture I would say it was not the most engaging that I've had in the history department.\n\nWorkload:\nMidterm and final, 15-20 page research paper (which I think is a little much for a lecture but was nonetheless a good experience), and relatively light reading for the history department. I skipped most of the Riasanovsky textbook but definitely take the time to read the primary source intellectual history.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 25, 2013",
            "review_content": "\nStanislawski is brilliant; unlike the previous reviewer, I had him for BOTH semesters, but didn't truly appreciate what a great experience he could make LitHum until the latter half of my LitHum career.\nIt's true, Stanislawski's class is what you make of it. If you choose not to do the readings, if you choose not to participate in class, no harm will befall your GPA...but it's your loss. At times, I was somewhat frustrated with the futility of our discussions or the wayward directions they'd take, but at others, I walked out of LitHum immensely satisified. Stanislawski doesn't waste time with arbitrary passage analysis or by decoding what the placement of a simile here, a metaphor there means; instead, he uses his class time to TALK about the significance of a particular work and give juicy tidbits from his really vast library of knowledge - it makes me feel like he really appreciates what LitHum is SUPPOSED to be. \nOne word of caution: Stanislawski responds to your (/class') enthusiasm; it's hard to foster a lively 2 hours if you're the only one who cares about the material. Try to engage with your fellow classmates and cultivate an atmosphere of appreciation - Stanislawski will more than meet you halfway. And as for playing favorites (see review below), it's true. \n\nWorkload:\nEasy! 3 essays, lenient with extensions. Best of all: Stanislawski doesn't believe in Quote IDs, baby!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 03, 2013",
            "review_content": "\nStanislawski is a very knowledgeable and intelligent professor, and as rigorous as you want him to be.  Basically, you could probably get a B in the course without doing any of the readings (he doesn't believe in quote ids) and the tests are OPEN BOOK (because they're just 2 essays).  Hell, if you're clever and eloquent and charming and act like the type of student he likes you could probably get an A in the course without ever reading.  But if you actually do the work, you'll be rewarded during your conversations with him and questions you might ask.  He cares about his students, but doesn't want to baby them.  \nTherefore, to make the most of the class: seek him out during office hours (i discovered this really late second semester because i wasn't in the class before and didn't know what was up), do only the reading you want to read (but when you read it, do it so you can talk and ask questions) and don't be discouraged if he cuts you off.  he tends to play favorites a little bit but if you put in the effort, he will afford you the same courtesies.\nif you're not a go-getter and want to actually learn something, take another course.  if you don't want to try too hard and get a good grade, take this course.  if you want to learn a lot and are willing to put effort into creating a relationship with one of the biggest names on campus, this course is perfect.  you won't ever have to do anything you don't want to do.  Stanislawksi has somehow made it so that if you want to learn a lot and engage with the texts, it can be a stress free experience.  He's very liberal with extensions and isn't about to give pop quizzes or call you out for sleeping in class (though it's rude..and you're just languishing in ignorance if you do that).\nWorkload:\n3 papers (easy peasy, because he doesn't want quotes..so it's all YOUR ideas) + midterm (open book) + final (departmental but he doesn't count ids because he is a sane and wise man. also because he has tenure and doesn't give a f).\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "December 22, 2012",
            "review_content": "\nHaving no background in Israel except what I read in the papers or watch on the news, I was not really looking forward to this course. I am a history major and needed something to meet a time/space requirement and this was one of two classes that fit the time slot that I needed. After reviewing CULPA and the terrible reviews of the other class (which I have since learned to trust based on my experience from last semester) - this was the only choice.\nI read a few reviews on CULPA and was disappointed about my options and this class - but I was surprised when I realized that I was actually enjoying the class and looking forward to going. The Professor is great - his lecture style is great - it keeps you interested. He cares about the subject and makes time to meet with anyone who has questions. I also appreciated him not pushing his views down your throat - the reading selections give you multiple sides to the issues and incorporate some interesting cultural aspects. \nHis tests are open book - as he is not interested if you can spill facts on demand - he is looking for deeper understandings of the materials. The materials are all pretty straightforward and if you go to his lectures - you will be fine.\nThe term paper was long (I think 20 pages) but it gives you an opportunity to dive into just about ANYTHING related or even not so related (as long as you can make a case for it being related). \nI highly recommend taking the History of Israel course - even if you are not interested in that part of the world - because he makes it so interesting. \nThis was in contrast to the course that I waited 2 years for the world famous professor to get around to giving which was a total bore. I guess sometimes it's the unexpected that makes it all worth while. This guy is good and possibly one of the best professors that I have had in four years here. \nWorkload:\nMidterm - 2 Essay Questions - Open Book\nTerm Paper - 20 Pages\nFinal- 3 Essay Questions - Open Book\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "May 17, 2012",
            "review_content": "\nI was looking through CULPA for next semester's History courses and noticed that one of my favorite history courses, and professors, had not been reviewed for several years and got, I think, unfair reviews-- Stanislawski's History of the State of Israel. I took this course last year and loved it. The lectures were very informative and well organized, the readings were helpful, the assignments doable, the TA's excellent. The major difficulty surrounding this course is Stanislawski's attempt not to be political--i.e. to be as objective as possible in so controversial a subject, not to be drawn into the battle on the side either of Israel or the Palestinians. Obviously by the very fact of teaching (or trying to teach) Israel in the same way you would any other state he is making a political statement, but he goes out of his way to present different \"narratives\" of the story he is telling. Therefore like some of the earlier reviewers I knew a lot about Israel before starting this course, but unlike them, I felt that I learned a great deal, particularly in regard to the internal history of Israel --especially its cultural history, which Stanislawski obviously loves far more than political or military history, and conveyed his enthusiasm to the class.\nSo my recommendation is: take this class, you will gain a lot from it.\nWorkload:\nOne research paper; midterm and final exams, both open-book. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 17, 2011",
            "review_content": "\nI was lucky to be in Stanislawski's class.  If you have him, make the most of the opportunities he gives you to talk in class. My class was awkward and quiet, and it's shame because Professor Stanislawski is hugely knowledgeable but also very open to class debate and discussion.  He's very familiar with all the works, but also very reasonable with expectations - as in, he helps you figure out which sections to skim, gives you feedback on paper drafts, and gives OPEN-BOOK exams.  That's right, no identifications for those of you who hate them.  He's a really nice guy, take the time to get to know him.  And just because he doesn't give pop-quizzes, that doesn't mean you shouldn't do the reading - it can be really rewarding if you do.  \nWorkload:\nTwo essays (5-7 pages) and he intended to assign three essays, but scheduling was messed up.  An in-class midterm and a final, each of which consisted of 2 out of 4 relatively open and comparative essay questions.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 25, 2011",
            "review_content": "\nI was in Stanislawski's CC section last semester, but don't recognize it all in the previous negative review. Simply put, I loved this section, thought Stanislawski was great, and miss having him this semester. I never saw Stanislawski be rude or mean or vindictive to any student, as is alleged. On the contrary, I found him trying as hard as he could to encourage students to talk, which a large part of the class simply did not. He clearly loves this course, knows the texts thoroughly, and (if you visit him in his office hours) is eager to help you with any problem. So don't take the negative review as indicative of what his teaching is REALLY like.\nWorkload:\n2-3 5-7 pp papers, midterm, final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 17, 2011",
            "review_content": "\nHis CC class was one of my worst experiences thus far at Columbia. Stanislawski clearly has some serious insecurities which he allows to influence his teachings and is very hung up on Judaism and his knowledge of it. Not exactly an impartial scholar, Stanislawski cut the Quran readings to expand Old Testament class time and didn't seem to make much of an attempt to explain or rationalize the Quran. The whole time I was in his class he made me feel as though he was doing us a favor in simply being there, and he seemed a little arrogant about his teaching position (as head of Contemp. Civ.) and his academic reputation stemming from this position. Very quick to pick an argument with students in the class, particularly if you disagree with him, and he seemed to hold some grudges stemming from these arguments, which he often wouldn't allow students to finish or fully articulate. \nI get the feeling that he can be a nice guy and, on an academic level, I don't even think he's all that bad of a professor. He certainly was fair with his tests and always tried to ease anxiety about them anyway he could. But his inclinations towards negativity and spiteful arguments make him a pretty bad choice if you have other options.  \nI know this sounds like a bit of a rant, but I stuck with his class after I read the mixed reviews on CULPA, thinking the negative reviews were just a very vocal minority, and wish I hadn't. If you are at all speculative about being in his class from these reviews please trust them and switch sections.  \nWorkload:\nOne aspect of his course that actually wasn't any worse than any other CC section. Pretty standard, 3 essays (this 3rd was an optional replacement for a previous essay grade) and fairly easy midterm and final.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 10, 2010",
            "review_content": "\nI just finidhed CC with Stanislawski and loved it! He was great in the classroom-- not only obviously knowing the texts inside-and-out but enthusiastic about trying to get us to be as excited by the course as he is. This was difficult, since about half of the students didn't want to talk, but he was clearly trying as hard as he could. Outside the class, he was one of the most helpful and caring I have had at Columbia so far-- I had a difficult semester and he was always willing to hear me out and help me as much as possible, and his general attitude was one of kindness to students and concern about them\nSo if you can get into his section, DO SO!!!\nWorkload:\n3 readings questions before each class, which I found helpful; open-book midterm and final-- some students liked this, others would have preferred closed book, He obviously wanted us to read all the texts, but was honest enough to say that one of the skills we had to learn was how to skim intelligently.\nNot an early grader, but fair (to my knowledge...)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 24, 2009",
            "review_content": "\nI took his CC class with proven trepidation. I am afraid that the negative reviews must prevail. My experience was that he is not that nice to students, changes assignments on a whim, and talks on whatever is on his mind, not the relevant contents. Sorry, Mike, but you did not win the hearts and minds of my section members. try to engage us with waht history WAS, not what you want it to be!\nExamples abound. He does not like philosophy. He does not like geography. But, he DOES like dates, plenty of them...name dropping occurs repeatedly (of both historical figures and current scholars). He Talks a LOT. Not wishing to be challenged, he cutrs you off if you present an idea not part of teh liberal canon he dogmatically lectures about. Subttle issues of Judaism are not his forte.\nWorkload:\nSeveral papers, response papers, and assorted assignments.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 14, 2009",
            "review_content": "\nNot for the faint of heart, Professor Stanislawski's class demands a lot. Heavy reading, heavy discussion, and a tough grader. If you choose this class, you'd better be prepared to go all in for CC. The only way to do well is to actually care about the concepts in the philosophical history this course presents, do the reading, and engage with the texts. You're at Columbia, you're here because you can do this, and he's going to make you prove it. He's not going to let you bullshit your papers (I learned this the hard way) though you can get away with being general on the open-book, open-note exams. \nLots of negative reviews: he's tough. But you'll get what CC is trying to give you if you stick with him. He knows what he's talking about and will make sure to cover the most important parts of each text, as well as give an arc of thought. We had some really interesting discussions, and Stanislawski seems to be making more of an effort to incorporate students' thoughts/questions/interprerations (unless they're wrong.) I think it's worth it if you really want to understand the CC material, and he's really pretty great, especially compared the lot of clueless grad students you could be getting. \nTough, but what did you really expect? He's Chair of CC for a reason. \nWorkload:\n3 papers, 3 questions to post on the reading the night before each class, midterm and final (both open book/open note)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 22, 2009",
            "review_content": "\nI am another member of Prof. Stanislawski's spring 2009 section of CC, and I enjoyed it so much I am enrolling for his History seminar next fall. I never contribute to CULPA, but given some of the negative reviews below I feel I have to correct the record. First of all, Stanislawski did NOT, repeat NOT, add something like 7 extra readings to the syllabus,. as one of the gripers (who I suspect returns to complain here time and time again and to press the agree or disagree buttons all the time) claimed: in fact, he added just ONE author-- Spinoza, and changed the reading of one other, Montesquieu, from one text to another. The rest of the syllabus followed the standard CC syllabus entirely. In addition, Stanislawski NEVER refererred to these classes as \"lectures\" and I think he tried as hard as he could to encourage class discussion-- except that the group (as another reviewer wrote) was really passive and quiet. Yes, as a result he did talk a lot, but I would put the ratio closer to 70-30, and his comments were really smart and pointed out the most important points the authors were making.\nYes, the \"response papers\" were a  bit annoying, but they forced us to read the texts and think about them before class-- something I'm sure a lot of the kids would not have done otherwise. As to the open-book exams, I found that they did reduce the pressure I felt in my other classes to memorize stuff; as far as I could tell from discussions with other students in the class, the grades were mostly pretty high-- from B+ to A-, with some straight A's. (I got an A-, which I deserved....).\nMost importantly, Stanislawski is a kind and caring professor, he clearly loves CC, knows the materials deeply, and TRIES to convey this excitement to his students. He certainly succeeded with me.\nSo CULPA readers: please do not be misled by the negative reviews below. This is a wonderful section of CC, and I am delighted that I was assigned to it. You should be, too.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 18, 2009",
            "review_content": "\nI just have one comment.  Would there really be THAT many more \"agree with\"s than \"disagrees with\"s for the negative reviews of Professor Stanislawski if there WASN'T a problem? \nI agree that in office hours he's a harmless, relatively nice guy.  But I also agree with the critiques of his teaching.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 01, 2009",
            "review_content": "\nAnother huge vote in favor of Stanislawski and against the negatives here-- thesee must have been kids who got bad grades or simply didn't understand what was going on. Stanislawski knows the material cold, but is totally undogmatic about how to interpret it, so long as you have actually read the text and can make your point. He encourages class discussion. but since our class was rather a dud in this regard (and I must admit, since I am shy, I did not talk much myself), he had to talk more than he said he wanted to. In any event, his explanations were hugely helpful. Yes, he does sometimes go off on tangents, but these are meant to try to make the text more relevant to our lives.\nI know a lot of kids had problems with the \"response papers\" since you really had to read the text and then think about itl if you merely summarized it (or what your read about it or Wikipedia or Spark Notes) you would get a B. Plus, he is a stickler for good writing, and once or twice he called me out on a paper that I had dashed off. One paper I totally screwed up-- and he let me redo it, without counting it against my grade.\nPlus, in office hours, he was really caring, wanted to know where we came from, what our interests were, how he could help in any way. I wish there were more professors at Columbia who cared as much about their students.\nSo, if you are put in his section, you will have to work hard, but it is totally worth it. If you aren't put in his section and can find a way to get in, try! \nAnd ignore the carpers who post angry reviews on CULPA because they get bad grades.\n\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 28, 2009",
            "review_content": "\nAlso a member of Stanislawski's CC section this spring, I TOTALLY reject the previous reviewer's rejection.  My guess is that it was probably written by one of the polysci or philosophy majors in the class the first review wrote about.  An absolutely terrible and boring class that seemed directionless. Bi-weekly responses were done before any discussion at all on the books; not that discussions were very helpful anyway.  I did fine on the responses but wished the class required 2-3 long papers instead, like most other CC classes.  One of my favorite parts of Lit Hum and first semester CC (different professor first semester) was the camaraderie I felt with my classmates resulting from the stimulating class discussions.  By the end of this class, I barely even knew anyone in the class's names as the Professor literally spoke about 95% of the class; the other 5% of talking was usually the very beginning of a student's comment before he or she was interrupted.  I do agree with one point from the previous review; Professor Stanislawski does care about his students' work, which was nice.  He encouraged students to attend his office hours.  However, everything else about the class was not good at all.  Tough to switch out of this class as he is the head of the CC department.... If you end up with this class, either immediately attempt to take every class your philosphy/polysci major friends have taken up to this point or, like most people must do, suck it up.  Best of luck.....\nOh, and if you are in his class....ask him his opinion on the prevalence of little girls and horseback riding.  He will get real Freudian on you. \n\nWorkload:\nVery random for CC.... Response papers due at the beginning of every class, an \"open book\" midterm, and \"open book\" final.  (\"open book\"= you get to look at all the irrelevant and pointless notes you were able to take the whole semester! Whew!)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 13, 2009",
            "review_content": "\nAs a member of Stanislawski's CC section this spring, I TOTALLY reject the previous reviewer's account of that class and the professor. On the contrary, I found Stanislawski to be a wonderful CC teacher, truly committed to the class and to his students, not dogmatic in the least. True, he demanded a lot of the class, and did indeed sometimes go off on tangents (though I actually enjoyed these tangents...) But overall, he did an excellent job of leading us through the texts of CC, and would recommend him highly to anyone for CC.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 08, 2009",
            "review_content": "\nProfessor Stanislawki made CC a living hell.  I was never going to like the class, but he made it torture. He is the embodiment of that tenured professor you always hear about who does not care about teaching and is so wrapped up in himself that he forgets what he is supposed to be doing.  He calls this supposedly discussion-based class his \"lecture,\" and NEVER ONCE let a single student finish a comment.  If he doesn't agree with you he says things like \"In my not so humble opinion, you are wrong.\"  And on response papers he writes things like \"This is your interpretation of Darwin, not mine.  B.\"  \nHe was a one-note professor. We had daily response papers.  Not weekly, not bi-weekly, but daily.  And that was it. And he never explained what he wanted.  He refused to give an example of a good one, and only said that he wanted us to \"grapple with the text.\"  \"Grapple, grapple, grapple.\"  He even printed out the dictionary definition of \"grapple\" but refused to define what he meant by it in terms of these papers.  \nThe only one I did well on was one where I regurgitated the most obscure, random information that I had learned in a different class.  It is a core class.  Everyone has to take it, from philosophy to bio to econ majors, and it is not fair to expect people to be able to tie these works to outside knowledge without guidance and help, of which he provided absolutely NONE.\nThe midterm and final were open book, open computer.  Sounds nice, right?  It wasn't.  His questions are very similar to I guess what he wants you to answer in your response papers, and again, he just expects you to grapple.  And then grades it arbitrarily according to how close you are to what he wanted.\nSeriously, you might think I am joking, but if you get assigned to this class, and if you are not a philosophy or poli sci major, SWITCH NOW.\nWorkload:\nObscene amounts of reading (He added about 7 things to the normal list this semester), daily \"grappling\" papers and open book midterm & final.  \n"
        },
        {
            "course_name": "Rise and Fall of the Soviet Union",
            "review_date": "January 08, 2009",
            "review_content": "\nTerrible coure. A total waste of time. I am trying to be respectful, so let me just write that the lack of organization, cohesion, and care undermined the capacity of this subject at a respectable academic level. There was also a Stockholm-type Synderome of affection to a gone empire best described by Reagan as evil. \nWorkload:\nToo many papers, too many exams...\n"
        },
        {
            "course_name": "Rise and Fall of the Soviet Union",
            "review_date": "December 10, 2008",
            "review_content": "\nProfessor Stanislawski did NOT seem qualified to teach this course. I do not doubt that he is probably a lovely person one-on-one and he probably is a dynamo in his specialization. However, he is living proof that sometimes tenure does not equal great professor. The lectures were unfocused and he rambled. He barely focused on the material necessary not just for having a general knowledge of Soviet history but also for successfully completing his assignments. He focused too much on snazzy quotes and culture and too little on the actual history. He managed to make Soviet history BORING which is a big feat. Additionally, out of all of the scholarship on the Soviet Union, he chose some of the WORST BOOKS EVER, books that aren't even real histories. Robert Conquest is a CIA hack, how is he a historian? I felt bad for the TAs who were stuck trying to teach 60 kids the actual material. One of them confessed to me that he thought Stanislawski was unqualified to teach the course and that the course was going poorly. NOT A GOOD SIGN.\nWorkload:\nthree reading response papers (3-5 pages), one in class midterm with two essays, one take home final with three essays, discussion section\n"
        },
        {
            "course_name": "Modern Jewish History II 1870-1948",
            "review_date": "October 04, 2008",
            "review_content": "\nI hated it. He expects too much and gives too little. He is not focused, and he does not listen to questions. He could use refreshment from recent scholarship, and more respect to gender and class issues.\nWorkload:\nAbove average\n"
        },
        {
            "course_name": "Modern Jewish History II 1870-1948",
            "review_date": "April 14, 2008",
            "review_content": "\nI was just going through the list of History profs on Culpa, planning for next fall, and I am shocked and upet by the negative reviews of Prof. Stanislawski, with whom I am now taking Modern Jewish History. This is a great class, his lectures are crystal clear and well organized, and he is very nice to students.\nSo I don't understand why he has so many negative reviews in the past. In any event, I rate this course and professor a straight A\nand recommend him highly to everyone.\nWorkload:\nmoderate\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "July 09, 2007",
            "review_content": "\nI felt that it was a waste of time. If you know the basics, you won't learn a lot. He tries to impress students with some prose and showmanship. The readings are predictable. The TA sections were unnecesasry.\nWorkload:\ntwo papers, a mid-term and a final\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "April 17, 2007",
            "review_content": "\nTotal waste of time if you know half the general history ofthe country and its people. No insights, just repeated facts and went tirelessly (FOR HIM)into small stories of little general value.\nWorkload:\nseveral papers and exams\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "May 14, 2006",
            "review_content": "\nIf you're on the fence with this guy, jump away.  Unless you find the material of the class worthwhile, he's ultimately not worth it.   His lectures lack organization and coherent theses.\nWorkload:\nPlus, besides discussion sections, you only have three opportunities to make your grade: one lengthy paper, midterm and final.\n"
        },
        {
            "course_name": "History of the Jews of Eastern Europe, Beginning to Present",
            "review_date": "March 04, 2006",
            "review_content": "\nOh Stani. What can one say about a man who speaks like eight languages, works arduously to promote human rights, and travels great distances to bring balanced opinions to the melac department? you can say this: Stani is one of the most pompous people in the history department...but if you were that smart you would be too. He is Harvard educated, copiously published, well-spoken, and a bastion of information. The problem is that his TAs suck ass (other than David) and their goals to prove to undergrads that they are smarter are their only motivating force in leading discussions. the paper grading was RIDICULOUS! then one of them was assy enough to bring in his own work so we could see what real writing was like. well apparently real writing was taking a 16th century anglecan thesaurus to hand when writing a paper to sound like the most self-impressed ass around. so if you dont get along with the TAS, you will fail, so get stanni to grade your papers. he will do it if you push him.\nWorkload:\ntakehome midterm and final had nothing to do with the material learned but wasnt hard.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 11, 2005",
            "review_content": "\nBasically, he is a totally nice guy. He encourages students to go to office hours. You should. He's much better at one-on-\none than in front of a classroom. He is also really lax about everything. I wonder if he even reads papers and exams, because there is usually no marking except the grade. He tries really hard to give you a good one. He lectures, there's really no discussion besides random and unimportant fill in the blanks. We often talk about anything but the reading. He is all context, hardly any content. One of his favorites side topics is \"Which Christian denomination goes with which ivy league school?\" Just so you know, Harvard = Congregationalist. Also, he harps about how we're all part of the upper middle class and so we don't know what the real world is like... Which is really not if you actually survey the class. So that's ultimately really annoying. \nWorkload:\nLight. Readings. Two short papers, required rough drafts. \nEssay midterm and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 11, 2005",
            "review_content": "\nBasically, he is a totally nice guy. He encourages students to go to office hours. You should. He's much better at one-on-\none than in front of a classroom. He is also really lax about everything. I wonder if he even reads papers and exams, because there is usually no marking except the grade. He tries really hard to give you a good one. He lectures, there's really no discussion besides random and unimportant fill in the blanks. We often talk about anything but the reading. He is all context, hardly any content. One of his favorites side topics is \"Which Christian denomination goes with which ivy league school?\" Just so you know, Harvard = Congregationalist. Also, he harps about how we're all part of the upper middle class and so we don't know what the real world is like... Which is really not if you actually survey the class. So that's ultimately really annoying. \nWorkload:\nLight. Readings. Two short papers, required rough drafts. \nEssay midterm and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "October 02, 2005",
            "review_content": "\nI am not impressed. The readings are great, but he talks all the time without focus, sometimes without merit. A multitude of anecdotes, some of whom are totally irrevelant, smothers substantive deliberation.\n"
        },
        {
            "course_name": "Seminar",
            "review_date": "September 20, 2005",
            "review_content": "\nI understand some of the unflattering comments about Stanislawski, but ultimately I think he is a pretty kind and caring professor. Yes, he has the tendency to ramble a bit, and you may not learn the most in his class. However, he is a smart guy, well-read, knowledgeable, etc. If you are in a seminar and want a fulfilling experience, I might recommend thinking a lot about the reading before class and coming in with your own questions and strands of reasoning in an effort to help focus the discussion. Otherwise, there is a tendency to not really delve that deeply into the reading.\n"
        },
        {
            "course_name": "The European Enlightenment",
            "review_date": "August 08, 2005",
            "review_content": "\nI had low expectations becasue of past reviews. I was proven right. I don't think he cares much about students. He craves attention and gratification. He was prepared, but not focused. The assumption is that you know the basics, but he does not offer a lot of insights.\nWorkload:\nWorkload: Seminar: weekly reading, 15-20 page paper Lecture: relstively long weekly readings, discussion sections leagues below expectations, midterm, take home final, a 15 page paper\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "July 06, 2005",
            "review_content": "\nI did not enjoy the course. He talks a lot, extemporaneously. He is more full of himself thatn of knowledge. I do not recommend him\nWorkload:\ntoo heavy per points\n"
        },
        {
            "course_name": "The European Enlightenment",
            "review_date": "May 24, 2005",
            "review_content": "\nStanislawski is incredibly bright, insightful, generous and interested.  The list of positive adjectives that can describe this amazing professor is endless.  I took a seminar class, and yes, he does talk a lot, but what he has to say is impossibly important and intelligent.  I highly recommend him!\n"
        },
        {
            "course_name": "The European Enlightenment",
            "review_date": "May 14, 2005",
            "review_content": "\nStanislawski is much better in seminar than in lecture. He uses his time effectively and gets through material more efficiently. More enjoyable & engaging in smaller format.\nWorkload:\nSeminar: weekly reading, 15-20 page paper\nLecture: weekly reading, discussion section, midterm, take home final, 15 page paper.\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "January 22, 2005",
            "review_content": "\nStanislawski is one of my favorite professors at Columbia and I take all his History courses. I regret missing him in CC, where I hear he rocks! He is incredibly smart and truly cares about this students!\n"
        },
        {
            "course_name": "History of the Jews of Eastern Europe, Beginning to Present",
            "review_date": "January 04, 2005",
            "review_content": "\nStannie's lectures are definitely interesting if you care about the subject. His sarcasm is hilarious, as is his overall demeanor. He assigns an absurd amount of reading that isn't even worth starting, as you will never ever ever finish it. The take home midterm and final are reasonable, but the 15 page research paper is insane. I had no idea how intense it would be, and it consumed an incredible amount of my time. You'll learn some stuff, but unless you have a talent of writing research papers, be aware that while on the surface the class might seem like a blow-off, it certainly isn't. Also, a lot of the books he assigns are only on reserve, so even if you are inclined to hit the books, your chances of finishing are slim. \nWorkload:\nTons of reading you don't have to do (although it makes the midterm and final a bit more challenging), decent midterm and final, and ridiculous research paper. the midterm and final are a couple 3 page essays, so to finish them in five days is challenging when also balancing the 15-pager and four other classes. \n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "December 09, 2004",
            "review_content": "\nProfessor Stanislawski has an amazing breadth _and_ depth of knowledge on all things Jewish History.  Despite the occasional (usually interesting) tangent, his lectures are some of the more organized I've encountered in the History department, and usually balance information and entertainment just enough to keep your interest.  \nThat said, there are certain situations where he is at his best.  The History of Israel lecture is too big and too tense for him to do a good job - he often rebuffs student questions that he finds too controversial and avoids entire topics to prevent arguments.  He makes no effort to get to know anyone (even those who come speak to him after class multiple times) and seems to want to run in, teach, and run out, not to be seen again until his next scheduled lecture.  However, in the (much) smaller Eastern European Jewish History lecture, he's in his element.  He claims to want to get to know every student and encourages questions and discussions (and here is where everyone could use a little less of the life long learners who have fascinating things to add but try to take over the class).  The class is surprisingly comprehensive for covering such a long period, and his lectures are usually very interesting and dynamic.  On the other had, don't think that just because he says he wants to get to know you he really does.  While a few people have found his office hours helpful, my experiences and those of people I know have been very negative.  His helpful comments soon turn to degrading a question as stupid or self-evident, what he perceives as \"pep talks\" can be condescending, useless, and obnoxious at best.  For a good office hours interaction, best bet is to ask him to talk about himself or his own work, and leave yourself out of it. \nWorkload:\nLots of reading which is essentially optional, open book midterm and final (take home for Euro), and 15 page research paper with draft.  Annoying and useless discussion sections, same as any history lecture.\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "September 26, 2004",
            "review_content": "\nHe is no mentsch. I found the course unstrcutured and lacking proper context. His misconduct toward students is subtle, but it is obvious that he thinks about himself, not about us. The readings were the best part of the course.\nWorkload:\nboring weekly sections, 15-20 page research paper, \"easy\" midterm and a reptetive final (open book)\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "June 12, 2004",
            "review_content": "\nI have to join the negative column. He is self-absorbed and thin skinned, which comes across in his teaching. The readings are much better than his lectures. I don't recommend him, although I did go to his office hours and tried to talk to him. He was more interested telling me about his research (and get some ideas off me, which, I guess, should be flattering, but tells how insecure he is) than addressing my concerns.\nWorkload:\ntoo heavy for what you get.\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "June 12, 2004",
            "review_content": "\nI have to join the negative column. He is self-absorbed and thin skinned, which comes across in his teaching. The readings are much better than his lectures. I don't recommend him, although I did go to his office hours and tried to talk to him. He was more interested telling me about his research (and get some ideas off me, which, I guess, should be flattering, but tells how insecure he is) than addressing my concerns.\nWorkload:\ntoo heavy for what you get.\n"
        },
        {
            "course_name": "Intro to History and Historiography",
            "review_date": "May 12, 2004",
            "review_content": "\nFantastic course-- I do not understand the complainers. Stan is  a great lecturer, helps students in his office hours, really cares about students learning and their lives. \nTAKE ANY CLASS WITH HIM!\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "May 10, 2004",
            "review_content": "\nI agree with the most recent reviewer of Stan that people who take the negative views expressed in Culpa about this lecturing are mistaken and misleading, and may cause people to miss out on a simply wonderful professor.\nI can't wait to take the course on East European Jewry and would urge all of you out there to do so too--Stanislawski has written 3 books on the subject and is regarded everywhere as one of the world's experts on the subject.\nHis lecture style is informal, not disorganized as other claim-- he knows his subjects so well he doesn't use notes, and lets students' questions guide him. perhaps a bit too much.\nSo take his classes!\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "May 06, 2004",
            "review_content": "\nI've just registered for Stanislawski's History of Eastern European Jewry for next semester and found only a very small number of students-- and am afraid that some of the nasty comments on CULPA are responsible for this. PLEASE do not take these comments as a reason to miss Stanislawski's classes-- though he does wander  a bit in his lectures, he is really a FANTASTIC teacher, won the Best Teacher in the College award for good reason, and is one of the world's real experts on Russian Jews. So anyone interested in Jewish history should DEFINITELY take this course, and will find that the reality is so different from what the handful of complainers here say.\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "February 09, 2004",
            "review_content": "\nAlthough Stanislawski is very interested in his students and subject, I would advise against taking a lecture course with him.  The lectures are completely unstructured, and he goes off on many tangents.  Also, there is a HEAVY reading load, which you basically have to read (or skim) if you want to learn something about the history of Israel. Anything that I learned during this course I learned on my own.  I would think twice before taking a large lecture with Stanislawski. \nWorkload:\nweekly sections, 15-20 page research paper, \"easy\" midterm and final (open book)\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "January 15, 2004",
            "review_content": "\nSo much has already been written that there isn't much to add, but I just wanted to say that anybody who takes a class with Stan should DEFINITELY go to his office hours.  He is a totally different person than in lecture, and is incredibly interested in his students.  I would bet that those who wrote negative reviews of him never went to his office hours or spent even a short amount of time with him one on one, while those who wrote positive reviews did.  \nWorkload:\nBoth the midterm and final are open book and open note.\n"
        },
        {
            "course_name": "Multiple",
            "review_date": "December 29, 2003",
            "review_content": "\nAs a Lifelong Learner, I've already taken classes at Columbia  for over five years!  So I suspect I have a longer perspective than most undergraduates here - to say nothing of my four years at Yale and one at Harvard many years ago.\nWith that perspective, I can say unequivocally that Stanislawski is the best teacher I've  ever had.  Period! \nWhile the perspective of some Columbia  undergraduates may be different  - many  seem  more interested in grades and workload than pure learning - as an  LLL who has no interest other than learning for its own sake, I found Stanislawski to be a most knowledgeable, interesting,  drolly amusing lecturer.  \nIf you want to be in the presence of a great teacher, I urge you to take one of his courses.  \n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "December 27, 2003",
            "review_content": "\nI enjoyed this class. There's a lot of reading, but you don't really need most of it for the exams. If you already know a lot about Israel, you're not really going to learn many new things in this class, but it was nice to learn about the wars and about politics. It wasn't something I ever knew a lot about and I'm glad I took this class. Prof. Stanislawski isn't the best lecturer. He goes off on tangents and you start daydreaming, but sometimes the lectures are really interesting and he is a nice guy. He knows a lot about Israel and he will have an answer for whatever question you have for him in class or after class. I felt that this class was about 30% lecture, 70% recitation and I will probably remember my TA more than Prof. Stanislawski. The big focus of the class is the 15-20 page research paper which really was FUN. That was my favorite part of this class and you just learn so much more when you research a topic you are really interested in. It's important to start the paper EARLY because it's a lot of work and the TA's expect an amazing paper. You need to write a rough draft and the harder you work on that, the easier it will be for you to write your final draft. I'm very proud of the paper I wrote.\nIf you care about Israel and want a fun class with your fellow Jews (and a few non-Jews as well) take this class!!! If you're Jewish and aren't in this class, you will feel left out because like all of your friends are in this class. Well at least everyone from EC is in this class.\nWorkload:\n15-20 page research paper\nMidterm and Final which are open-book and open notes and don't really require any studying. The topics on the exams are creative (especially on the midterm) and you have to have more of a general knowledge of Israeli History than just a memorization of facts. The essays were pretty fun to write. Have a general idea of where to find info you'll need in the books, or if you have time, do as much of the reading as you can - at least from Morris and Sachar. If you're taking this class, you probably care about Israel and want to know more about it, so you might as well do the reading!\nWe had to see two movies in this class - Salach Shabbati, which is HYSTERICAL, and Kadosh, which is sooo disturbing I wanted to get up and leave.\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "December 17, 2003",
            "review_content": "\nI really wish i could give an incredible review for this course.  Stan loves his field, and his students, and he is very committed.  However, he just isn't built for a big lecture course.  He wanders and wanders, and by the end of the class, he has covered 20% of the material.  He then spends 10 minutes after call is over cramming in the other 80%.  He spends a lot of time on election results in Israel, which is really interesting...if you're interested in that sort of thing.  He spends little time contextualizing Israel in the middle east, which is unfotunate.  Also, he's BORING. But i'm sure he would be really interesting in a smaller section.\nWorkload:\nLots of reading, but no one i know did any of it.  midterm, final, both open notes and books. 15 page term paper, on anything in israeli history, usiing primary sources (definitely the best part of the class)\n"
        },
        {
            "course_name": "Modern Jewish History II 1870-1948",
            "review_date": "May 26, 2003",
            "review_content": "\nI'm writing to counter the last terrible review that totally misrepresented one of Columbia's great professors-- Prof. Stan actually won of the Great Teachers Awards and totally deserved it! I'm afraid some other students will read the stupid negative comments and miss out on this great prof! It's true he often does spend alot of time on the first part of his lecture, but that's only to tell us how historians work, and is often the most important thing he can teach us. His lectures are always well organized and clear, and his book on Zioniosm is brilliant (the student who said it was mostly in French is just plain wrong--obviously he or she never read it!!!!)\nStan is also a kind and conscientious professor who really cares for his students, and though he can be real slow in answering emails, he will spend hours with you in his office advising you on academics or life choices.\nSo if you can take any one of his classes, don't miss it, and disregard the creep who said otherwise!!!\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 26, 2003",
            "review_content": "\nCC with Stan is the best you can get!!! He is dedicated to the class, totally knowledge-full about everything on the syllabus, lets you write rough drafts for the papers, and is always there for you in office hours and beyond.  He doesn't give out many straight A's, but an A- or B+ is manageable with some work and thought.\n\nWorkload:\nmidterm, s2 short papers, final\n"
        },
        {
            "course_name": "Modern Jewish History II 1870-1948",
            "review_date": "May 14, 2003",
            "review_content": "\nI agree with the previous reviewer than Stan is a bit of a tool but Dan S is great. One minor note: I was annoyed that my discussion was in the morning at 9:30 when my first class TuTh was supposed to be Stan at 10:35, but only a consideration if you dread waking up in the morning. I did it anyway.\nStanislawski *does* begin most lectures with a long historiographical note about how previous historians/general understanding totally misunderstand Jewish history, usually portraying Jews as victims of something or other when Jews really were not victims to the degree they are portrayed as.\nThat said, with the additional caveat that Stanislawski is *not* a dynamic lecturer, the lectures are *very* interesting, if only due to the material he presents. The material is great, and it takes a little adjustment to his boring style, but I found the lecture consistently interesting. He is also a terrific historical thinker and scholar. His book _Zionism and the Fin de Siecle_ about Max Nordau and Zeev Jabotinsky is enlightening, a book really worth reading that sheds light both on individual characters, on the historical background of the Zionist movement and on the fin de Siecle, the period at the turn of the 19th century into the 20th.\nHis class was good enough that I am registered for History of Israel.\nWorkload:\nOne correction to the previous review: the paper is only 15 pages, not 20. And the midterm and final were tough? Come on, the midterm was open-book/notes and the final was take-home!\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 09, 2003",
            "review_content": "\nI would highly, highly recommend Professor Stanislawski for CC. Having taught this class for decades, he knows his stuff much better than the average CC teacher. He says that he is teaching CC not because he has to, but because he wants to, and it really shows in his enthusiasm during class. While undoubtedly one of the most pedantic professors I've had so far, he's very much aware of it, and he seems to thrive when he knows he's talking down to the class.  He tends to spend the entire class lecturing, without allowing for much student discussion, but I'd much have that than a professor who allows students who just want to hear themselves talk take control of the class (and you can't expect too much out of a 9am class, anyway). He's also very available outside of class, whether it's for extra help with the course, going over your papers (he *does* accept rough drafts), or just general academic advice. And an added bonus: he doesn't believe in taking attendance.\nWorkload:\nVery light for CC. 2 short papers (4-6 pages). Midterm (2 out of 4 essays), final (3 out of 6 essays), both open-book and open-notes. And as I mentioned before, no required attendance.\n"
        },
        {
            "course_name": "Modern Jewish History II 1870-1948",
            "review_date": "May 06, 2003",
            "review_content": "\nPerhaps the most offensive, least interesting professor at Columbia.  He spends 30 minutes at the beginning of every class talking about why he CAN'T talk about what he's planning to lecure on (i.e., the way every other historian does anything is wrong. ) His lectures aren't very interesting at all and he frequently goes off on tangents.  This class was a joke.  \nWorkload:\nLots of out-of-print books with irrelevant primary source material, his book that's more in French than English, a whopping 20-page paper (yes, this is SUPPOSED to be a 3000 level course) and TOUGH midterm and Final.\n"
        },
        {
            "course_name": "Modern Jewish History I 1790-1870",
            "review_date": "December 25, 2002",
            "review_content": "\nGenerally interesting, obviously brilliant on the subject. A bit repetitious and often spends 45 minutes on the first point on his outline, then flying through the rest of it in the remaining 30 minutes. \nWorkload:\nLot of reading, but you don't have to do all of it. Midterm/final are open book and hard, but fair-all essays. 15-20 page term paper on subject of your choice.\n"
        },
        {
            "course_name": "Modern Jewish History I 1790-1870",
            "review_date": "December 08, 2002",
            "review_content": "\nOverall, a good class. Hes a decent lecturer, a little on the boring side, but very organized and really intelligent. He's really fair and just wants you to learn. Not a hard class. The TAs grade everything, and theres an annoying mandatory section.\nWorkload:\nan in class midterm and final, open book, open notes, very straightforward and fair. 20 page paper, but you get to give in a draft. \n"
        },
        {
            "course_name": "Modern Jewish History I 1790-1870",
            "review_date": "November 30, 2002",
            "review_content": "\nProf Stan is one of the few history professors that manages to get across both information (factual) and analysis. Too often professors skip the former and then lecture ad infinitum while students dont really know whats going on. The reading list includes many classical pieces of modern Jewish historiography and each is worth the read. I would also like commend Prof. S. for teaching his students HOW to think like a historian- i.e. where to find information, how to speculate with reason...... Very open to questions, unintimidating... all in all, a great class!\nWorkload:\nWeekly reading (200 pages?); Midterm, Final, Paper (15-20 pg)\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "November 03, 2002",
            "review_content": "\nHis classes are a true pleasure. He's funny, articulate, knows everything, and loves hearing what his students think. Although, as someone else mentioned, he is sometimes hard to reach, I've found that he consistently responds to every other email I send him, so if you just keep trying you can get a hold of him. And when you do, he'll be happy to talk to you for hours about anything. He's a really kind, good-hearted person, the kind of professor that gives you fond memories of Columbia even years later. Take anything that he offers -- it'll be an experience you always remember.\nWorkload:\nHe assigns tons of readings, of which you should read some, but certainly don't have to read all. He's a fair grader. Just show that you are putting in real effort.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 03, 2002",
            "review_content": "\nWow, I really expected to find a slew of positive reviews of Stanislawski. He's recieved at least one major teaching award, and for good reason. As a CC prof, he was clearly sad about our meat-headed class (discussion reminded me of a nursing home) but did a remarkable job of perking us up. Very good sense of humor and not a single hole in the fabric of his knowledge of the historical and religious grounding of modern political thought. I hear his history classes are the same. \nWorkload:\nVery little (I think maybe 2 short papers and the mandator midterm and final) -- kind grader\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 03, 2002",
            "review_content": "\nWow, I really expected to find a slew of positive reviews of Stanislawski. He's recieved at least one major teaching award, and for good reason. As a CC prof, he was clearly sad about our meat-headed class (discussion reminded me of a nursing home) but did a remarkable job of perking us up. Very good sense of humor and not a single hole in the fabric of his knowledge of the historical and religious grounding of modern political thought. I hear his history classes are the same. \nWorkload:\nVery little (I think maybe 2 short papers and the mandator midterm and final) -- kind grader\n"
        },
        {
            "course_name": "History of the State of Israel",
            "review_date": "December 31, 1999",
            "review_content": "\nA decent lecturer. Nothing special. Perhaps slightly above average. He definitely knows his stuff, but so does every professor here. Teaching is pretty impartial. Extremely hard to get ahold of - he doesn't respond to emails you send him. People say he's really friendly and I believe them, I just can't say I've experienced it firsthand. I'd say it was overall a pretty good class, just don't take it and expect to learn a whole lot of new stuff if you already know a fair amount about Israel.\nWorkload:\nIf you know a lot about the history of Israel already, it's not that hard. You will learn some new stuff but a lot of it will be review for you, except the fiction assignments, which are pretty cool. If you don't have any background, it will be harder but still not a hard class. He assigns a massive amount of reading but you don't have to do near all of it. Medium-difficulty midterm, take-home final and final research paper. Don't worry about the workload. \n"
        }
    ]
}