{
    "prof_info": [
        {
            "prof_name": "Anna Vallye",
            "prof_id": 2756,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 04, 2006",
            "review_content": "\nAnna Vallye was really terrible and stifling. She has very strict ideas about what each piece of art was about and its importance and was completely uninterested in exploring any other possible perspectives. She completely took the joy out of looking at and interpreting art. Vallye acted as though each art was some sort of math equation that needed precise figuring out and had a correct answer. It was definitely the worst and most frustrating class I have ever taken at Columbia, and I love art. If you want to be able to recite the names of some paintings, and could care less about art- take her class- she is easy to zone out and won't notice you playing suduko, but if you have any interest in art -avoid her, she will try to convince you that every art piece is as boring and straight forward as she is. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 24, 2005",
            "review_content": "\nAnna is very nice. Her goal for the class is to give us a vocabulary to talk about art and an overall sense of art litteracy so that we can enjoy and benefit from trips to museums. She becomes visibily excited when people say semi-intelligent things in class, but she also questions comments that are totally off track. Her explanations of some theoretical concepts are a little verbose and unclear, and it can be difficult to know exactly what she thinks is important about certain pieces or readings. When studying for the final, I realized I should have taken much more detailed notes because she does expect you to know the significance of every work discussed in class and how it relates to the readings (which are short). \nWorkload:\nNo slide memorization. None. Short readings. She really cuts out everything you don't need to know. Papers: 3page, 5page, and 10page. No midterm, final is 3 essays and \n"
        }
    ]
}