{
    "prof_info": [
        {
            "prof_name": "Edward Tayler",
            "prof_id": 2303,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 05, 2009",
            "review_content": "\nWould anybody like to stop and consider if what you're learning from Prof. Tayler is different in quality from what a popular TA could give you? Should it be mentioned that the New Yorker's main critic, David Denby, wrote a bestseller back in the 90s about returning to Prof Tayler's Lit Hum course? Or do we just continue to mutter that he's \"intimidating,\" as if that were always a bad thing. Maybe we can't do better. They say of these websites that students are competent to, as it were, evaluate the taste, but not the nutrition-- and what's their favorite food? Fries. Anyone who serves fries with his course delights them, even while he clogs their arteries. Go to Amazon and read a bit of the Denby. How many teachers rate a best seller about themselves?  \nWorkload:\nIf you don't want to work, why are you at Columbia? There are many easier schools. Just leave. \n"
        },
        {
            "course_name": "Shakespeare",
            "review_date": "August 28, 2007",
            "review_content": "\nDo not leave Columbia without taking a class with this man. If you pay attention to what he says, invest the time and energy he asks of you, and resign yourself to comprehending only a fraction of what he says, he will change your life. Tayler is the kind of professor whose mind seems to operate at a different level from the rest of us. At a certain point you have to be content to sit back and let that powerful mind wash over you, comfortable in the knowledge that if you absorb even a fraction of the knowledge he offers, you will be a better person for it. That said, don't get too comfortable. Tayler doesn't allow anyone to drift through his lectures. He will call on you. He will ask you to explain a passage from a play, and while he won't push you too hard he does expect a certain level of familiarity with the play and a certain ability to prise apart Shakespeare's thematic and poetic strings. But remember that Tayler is a kindly old gentleman who genuinely cares about and respects his students. He'll call you by your last name (Mr. or Miss. So-and-so), he'll listen when you talk, and above all he will read every single word that you write. I don't have to tell you guys how rare that is. \nA word to the wise: brush up on your Lit Hum before you take this class. Realistic or not, he expects you to remember what you read in Lit Hum and to be able to apply it to Shakespeare. \nWorkload:\nWeekly passage analysis of one page or less, one in-class presentation, and a short final paper\n"
        },
        {
            "course_name": "Shakespeare",
            "review_date": "August 25, 2007",
            "review_content": "\nA modern day Socrates.  If you have the opportunity to take a course with Professor Tayler and don't, either for fear of the time you will have to spend on his assignments or of the grade you will receive if you do not put in that time, life--and with it a fresh perspective on art and the world--will have passed you by.  You will receive a good grade if you work for it, and you will learn more in this class than anywhere else.  Professor Tayler will make you use your own mind to ask the deepest questions there are about literature and life.  Why else are you in school?\nWorkload:\nWork hard, learn a lot, and get a good grade.\n"
        },
        {
            "course_name": "Shakespeare",
            "review_date": "May 19, 2007",
            "review_content": "\nOnly take a class with Tayler if you can prioritize learning something remarkable and potentially life-changing over getting a perfect grade.  You might manage it anyway, but if you go into the class preoccupied with your GPA, youÂ’ll make yourself crazy.  Tayler is truly a great professor, among the best that IÂ’ve had here.  HeÂ’s also very approachable if youÂ’re struggling, and does seem to genuinely care about his students.\n"
        },
        {
            "course_name": "Shakespeare",
            "review_date": "April 17, 2006",
            "review_content": "\nFerociously challenging.  At times it is difficult to understand what you're supposed to be writing about, but then that's part of what you're being tested on.  \"Look at these lines\" he'll say and write a page for monday.  This is a man who knows his shakespeare though, and you will come out of his class a much better critic of art.  Don't take his class if you can't put in the work-- this from someone made the mistake of thinking he was up to it when he (I) wasn't.  But if you can hack it, Tayler's well worth the time.  You'll understand stuff like Richard II begins with a discussion of cain and abel, ends with \"a second fall of man\" and has a garden scene in the center that you just don't get elsewhere.  As to entertainment: some people have called him dry, others think he's hillarious, and i think in like situations you have to assume that the difference is that one group gets the joke and the other doesn't.  A lot of laughter this year.  I look forward to class weekly.  \nWorkload:\nAt once light and crushing; less than 15 pages of writing, but a lot of thought involved.  Maybe you only have to read five plays, but you have to know them very very well.   \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 05, 2005",
            "review_content": "\nSo I accidentally agreed with whoever said it was impossible to get a good grade in tayler's class --damn mouse!-- so I have to set the record straight: that's totally wrong.  Whoever said that was dumb.  True story: people who say its impossible to get a good grade in a class are generally not very good students.  Some of us got As, but not everybody -- this isn't Harvard you know and your grad school of choice will understand.\nTrue, Ted actually calls you on your bull.  You may find yourself getting a bad grade on a bad paper, so do not use a sesquipedalian when you can use a regular word and do not, through laziness, attempt to draw an essay together by inventive use of language instead of logic.  Don't try to coast, don't jump to conclusions, don't try to apply the aesthetics and morals of today on the past, because they don't apply.  Ted will stop you if you try, because it's a waste of everybody's time (who in the class actually gives a crap if miss x or mr y thinks Achilles is an immoral guy?).  That's the biggest thing you'll learn in a Tayler class: how to judge art in it's proper context and, if you're lucky, understand that way how other minds work.\nWork hard, stay on it and you'll earn exactly what you deserve in Ted's classes.  Oh, and though I now think I've set the record straight, there's just one more thing: this guy, who taught among others the late Edward Said and David Shapiro (the famous Jewish poet guy who sat in the president's chair in 68), has given A minuses to some pretty amazing people.  Don't get your panties in a twist if you get an A minus, your chances of becoming very famous one day are, it seems, likely to be better for it.  \nWorkload:\nToo many books, too little time; Literature Humanities.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 11, 2005",
            "review_content": "\nFor the person that said that the first year grade doesn't matter, it certainly does! It is so hard to get an A (if that's all you care about) with this professor. For you science majors, choose someone else!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 30, 2005",
            "review_content": "\nA very sweet man... he is extremely intelligent and quite intimidating at times.  It'll take you a few classes to get used to his style of teaching.  His essay topics can be difficult to understand, and he doesn't take kindly to BS in said essays.  You probably won't get a good grade, but the man is a Columbis icon so at least you can say you took a class with him.\nWorkload:\nA few papers, midterm, final and the usual appalling amount of lit hum reading\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2005",
            "review_content": "\nThere are two things you should consider in order to evaluate a Professor: one is how much you'll learn from him/her, the other is what kind of grade you'll probably get. Professor Tayler is the best professor I've ever had in terms of the first factor, but the worst one in terms of the second factor. Trust me - you will be enlightened (or feel like it) every after his lecture, although you may not understand every bit of what he says in class. Yes, his love for Greek and Latin may be intimidating, and yes, he is a hard grader, but if you want to learn and take the most out of your first class of Core Curriculum, do everything to switch into his class. Freshmen grade doesn't count anyway. \n\nWorkload:\nPressing amount of reading (like in any Core class), a couple of short essays, Identication Midterm (he'll give you more than 50 quotations to identify and to explain the significance, but his curve is pretty generous), and final. Don't expect any kind of final review. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 21, 2005",
            "review_content": "\nBest teacher I've ever had, enough said\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 18, 2005",
            "review_content": "\nAlthough I can see how someone might not fall hopelessly in love with Professor Tayler, he is right up there with the best teachers I have ever had, and that's truly saying something because I have had some life changing, best friend-type teachers.  I never thought that an hour and fifty minutes of class could go by so quickly.  I completely disagree with the previous reviewer that he talks more than listens.  Practically all he does is ask us questions and urge us to think for ourselves.  He even has explicitly stated that he doesn't like to talk too much because he wants us to make up our own minds.  He is a wonderful man inside and outside the classroom.  I feel like I've really honed my ability to analyze great literature.  Professor Tayler must spend hours grading our papers.  I learn more from reading his comments on one of our two page papers than I did in my entire semester of University Writing.  Professor Tayler has won just about every award imaginable, and is one of the world's foremost experts on John Milton.  He just added Paradise Lost to our second semester reading list, and I can't wait to see what he does with it.  Also, Professor Tayler isn't afraid to criticize books and the cannon.  He thinks some of the books we read aren't that great, and he doesn't back down from telling us, which shows me that he isn't just doing what the liberal suits tell him to.  I didn't like some of my first semester classes, and Professor Tayler basically saved my Columbia life so to speak.  I probably would have considered transferring if it weren't for the incredible knowledge and infective passion that he brings to the classroom.  As you can see, I cannot say enough good things about this man.  The only criticism is that he doesn't spoon feed us, but I like that - we are becoming better thinkers.  True, it's hard to get an A, but it's possible if you have some talent in English and work your arse off.  The final was a joke because he prepared us so well.  He isn't an easy teacher, but unlike many students (and teachers), I came to Columbia to learn, and boy have I learned in his class.\nWorkload:\nA few short papers, impossible midterm which he scales generously and which basically didn't count (at least not first semester).  The final was so easy thanks to his incredible teaching.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 22, 2004",
            "review_content": "\nVery strange man. He is a hard grader and he jumps around a lot. \nTayler has many intelligent ideas, but he is not very entertain. Edward is also very hard on in class comments and he tends to talk more than listen. He expects you to know Greek and he expects that you have read all of the books on the first day of class. I personally found him to be a bit intimidating. Outside of class, he is a pretty nice guy. If you are some one who cares a lot about grades... do not take this class he doesn't like to give A's. He does not have clear plans and he does not tell the class what books to bring. He is rather ambiguous in general.  His lectures were very irrelivant to the final.\nWorkload:\nHe added 2 books, 2 papers... he did not grade one, midterm ... he says it will only help ... and the department final.\n"
        }
    ]
}