{
    "prof_info": [
        {
            "prof_name": "Duncan Neilson",
            "prof_id": 2689,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 30, 2006",
            "review_content": "\nDuncan is definitely an extremely nice guy like a lot of the other reviewers have said. HeÂ’s also an inspiring musician. His class is fun to sit through, and he comes off as really laid back. But, his midterm comes out of nowhere. A lot of people in past yearsÂ’ ratings said that they never did the reading and still aced the midterm and final. Well, unless I am just a complete idiot, that has changed.  The final had a ton of stuff that he might have quickly rushed through at some point in class, but for the most part, I was only able to do well on it as a result of the fact that I read 250 pages of the textbook in three days and made a 15 page study guide to go along with it. So, I guess the point I am arriving at is that I strongly disagree that his class is a walk in the park. Most people think of Music Hum as a joke, and you might think his class is going to be one, but I promise you that the midterm will be a brutal eye opener if you donÂ’t do the work. \nAlso, his teaching style was one that I had a hard time following. He jumps from whiteboard to whiteboard writing all over the place about musical terms, movements, composers, forms, etc. IÂ’m not musically challenged and a lot of it still went way over my head. I had a hard time keeping up with him. I tended to focus on the movie clips or the song clips that he would play us rather than his scribbling about late Romantic form. Just donÂ’t get distracted like I did because thorough class notes to study from would probably be a huge help. IÂ’m just not sure how one is to take thorough notes in such a scatter-brained formÂ…But, again, let me emphasize, I really like Duncan a lot. \nIÂ’m semi-bitter that Music Hum ended up being my lowest grade this semester, but I canÂ’t really complain because I got what I deserved. So just donÂ’t blow off his class because he doesnÂ’t just give everyone AÂ’s or A+Â’s like a previous reviewer indicated. He might have back then, but he definitely doesnÂ’t anymore. \n\nWorkload:\nDaily reading assignments and listening assignments. 1 midterm. 1 final. 1 research paper that is supposed to be 8-10 pages about anything music related that you want. Grading seemed strictly according to numbers. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 16, 2006",
            "review_content": "\nIf you are nervous about music hum for whatever reason, Duncan is the way to go.  That is, if you could rank music hum courses on a scale of easy, challenging, and hard he is definetely of the former.  Besides being one of the kindest people I've met in NYC and at Columbia, he realizes that Columbia students have much more on their mind than music hum and doesn't demand hours and hours of their time.  However, you'll want to spend all of your spare time doing homework for his class because he is so energetic and enthusiastic.  I was consistently sleep-deprived throughout the semester, which is usually a killer for 9 am classes.  But Duncan was better than coffee, and often his class kept my attention enough so that not only did I not fall asleep in his class, but I rode on the energy from music hum to get through my 10:35 class.  As if that weren't enough, I feel I actually learned something, and the 9 am class was well worth my time.  If you have any hesitations, NEVER FEAR, DUNCAN IS THE MAN.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 12, 2006",
            "review_content": "\nI don't know what everyone else is talking about, but Duncan isn't that great of a professor. Yes, he does make a 9:00 class extremely entertaining. We had Star Wars videos, Rammstein, Wizard of Oz/Pinfloyd, and live music. This is, of course, admirable, but I never felt that I actually learnt anything. Other Music Hum profs spend one class discussing a particular piece, period, and composer, while Duncan just gave a VERY general overview.  After the midterm, he practically stopped teaching, and we spent the rest of the time watching videos and listening to live performances. However, if you want a easy A, take this class!! I ended up with an A, when I had a B in a midterm, and never spoke in class (apparently participation counts for 10% of the grade). He also practically teaches you the midterm, and doesn't really require you to do the reading, even though it is part of the daily assignments. Just make sure you take notes in class, and EXTREMELY detailed notes during his final review session, and you should be headed towards an A. If you want to learn about music, don't bother with this course.\nWorkload:\nmidterm, final, and research paper (everything is easy)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 03, 2006",
            "review_content": "\nDuncan was excellent. I'm not a morning person, and he kept me up and excited at 9am. \nHe avoided the nitty gritty details of music, and instead focused on the concepts we might actually remember and absorb. He brought in incredible audiovisual presentations, and spent the whole first few classes learning about us and our music taste. One of the best for Music Hum, I'm sure. Fully Recommended. \n\nWorkload:\n 7-10 page term paper linking a concert (literally anything you want) to the terms material. Fairly easy midterm, fairly easy final. Lots of room for bullshit, no nitty gritty details, Only terms on a sheet he gives you. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 20, 2005",
            "review_content": "\nTHE BEST TEACHER EVER.  Literally the best teacher i have had since i have been at Columbia.  Amazing audio and video presentations, phenomenal amount of material, but most of all, he made a 9 AM class the most enjoyable class that i have taken at CU.  Without a doubt, this is the teacher that you want to have: we watched Star Wars in class, heard some Rammstein, did the Wizard of Oz/Pink Floyd together along with countless other unforgettable experiences.\nTAKE THIS CLASS NO MATTER WHAT.\nWorkload:\n7-10 page term paper on ANYTHING, midterm that takes 20 minutes and final that took 70 minutes; all terms will be given to you and the listening is cut down to about 1/5 of the normal load needed.  Also, no bullshit musical terms, all conceptual and great!\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 14, 2005",
            "review_content": "\nDUNCAN NEILSON IS THE BEST MUSIC HUM TEACHER EVER!!!!...of you are lucky enough to pick into his class, count yourself among the blessed.  Not only is Duncan super nice and vary entertaining, he does not expect you to know ANYTHING about music. He's all about broad concepts and having fun.  Unlike other music hum teachers, you dont have to know technical things about music, he just wants you to appreciate and have a working understanding of it.  He brings in videos, live musicians and other music-related things to make class entertaining!\nHe is engaging, EXTREMELY helpful in all respects and all around AWESOME! he's paper and midterm and final are ridiculously easy--the hardest part about them is the listening--and he tells you what pieces will be on it ahead of tim!\nbottom line--TAKE MUSIC HUM WITH THIS MAN!\nWorkload:\nEASY!--reading from the book for each class which you dont really have to do (i did it and realized that is wasnt that necessary) and listening. 1 paper 7-10 pages which you have the whole semester to do on anything to do with music, and a really fair and easy midterm and final!\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 13, 2005",
            "review_content": "\nAmazing.  One of my favorite, if not my absolute favorite professor here at Columbia.   He is easily accessable, and made class interesting as well as fun to attend.  I would highly recommend him to anyone who is taking music hum.  Brilliant!   He's also an accomplished music composer, which he actually shares at the end of the semester, it's wild. Keep your eye out for silk lady, and the funkytown hybrid.   \nWorkload:\nRelatively light, he doesn't quiz on any of the material from the reading. Midterm, Final, one 7-10 page paper.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 08, 2005",
            "review_content": "\nTAKE MUSIC HUM WITH THIS MAN!!! Duncan is an awesome teacher, and not to mention extremely perky which is nice when you have it at 9 am.  He grades very fair and does not expect you to know technical things about music like other teachers do...he's a bout broad concepts.  He has great visual aids and multimedia stuff, not to mention the live performances he brings to the class. Exams are straightforward--he basically tells you exactly what you need to know. No surprises. All around...AWESOME TEACHER, you want this man for Music Hum!\nWorkload:\nLight reading and listening for each class. 1 7-10 page term paper, midterm, final\n"
        }
    ]
}