{
    "prof_info": [
        {
            "prof_name": "Lucia Carbone",
            "prof_id": 11892,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intensive Elementary Greek",
            "review_date": "March 31, 2014",
            "review_content": "\nLucia is one of my favorite instructors that I have had so far at Barnard/Columbia. She is extremely kind and considerate, and she has a very maternal personality. She is pretty flexible when it comes to homework and test/quiz dates. Her enthusiasm is so infectious that she is one of the reasons I am going to be a classics major. I would take any class with her.\nThat being said, her constant supportive demeanor was necessary in order to keep up the morale of all the students who took this class. It is a VERY difficult class, and Lucia can only do so much to help you memorize all the different pieces of grammar and syntax you have to learn. If you decide to take this course, be prepared to do a lot of work outside of class. \nIf you have a decent amount of experience with the basics of Latin, you should find the class demanding, yet manageable. And if you want to brush up on your Greek, this class is really appropriate. But if you don't have any experience with Greek or Latin, I would suggest taking the basic Elementary sequence instead. After all, the only students who \"made it\" to the end of the course were those who had prior experience with Latin and Greek; all the others dropped it.\nLucia is also a very generous grader and used a curve on almost all assignments. Most people who were willing to keep up with the assignments did very well. Only take this class if you're willing to put in a lot of time for it.\n \n\nWorkload:\nPretty Heavy: Homework from Grammatical Exercises in the textbook to be handed in every class; 2 quizzes every week; 2 midterms, 1 presentation at the end of the semester, cumulative (and very difficult) final. \n"
        }
    ]
}