{
    "prof_info": [
        {
            "prof_name": "Dalpat Rajpurohit",
            "prof_id": 5582,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Hindi II",
            "review_date": "April 22, 2016",
            "review_content": "\nTougher than other professors in this dept, but you learn a lot and the extensive work is really worth it as the language comes together. \nWorkload:\nDaily homework, weekly quizzes, can be a lot of work if you don't stay on top of it\n"
        },
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "November 28, 2011",
            "review_content": "\nI took Elementary Hindi-Urdu with Dalpat this semester and moved my schedule around so I could take one of his sections of Elementary II next semester. He is absolutely wonderful. His class is relatively fast-paced, which I enjoyed -- I felt like he covered a lot in the first semester, and I already feel so much more confident about my Hindi than I did at the beginning. He tries to get us speaking as much as possible, which is great. When it comes to his explanations of grammatical concepts, it's clear that he's not a native English speaker, but he still does a decent job explaining and he really encourages us to ask questions if we don't understand something. He is very approachable. Plus, he is possibly the cutest person alive.\nWorkload:\nVery moderate. Daily writing practice, occasional oral presentations. Might be a good idea to learn the script before starting the class since he starts using it immediately.\n"
        },
        {
            "course_name": "Intermediate Hindi II",
            "review_date": "June 21, 2010",
            "review_content": "\nI have taken Dalpatji's intermediate-level Hindi class for two semesters now, and I can honestly say that he is one of the best professors in the Middle East and Asian Languages and Cultures department, if not the best Hindi professor the department has got.\nDalpatji was always more than willing to help his students. He even initiates student meetings to discuss your progress in the class, and makes time to sit down with students and accomodates them in any way possible.\nThe course was very organized and structured - Mondays were devoted to reading comprehension (including ghazals, poetry, short stories, and excerpts from novels), Tuesdays were devoted to grammar (grounded mostly in Usha Jain's Advanced Hindi Grammar, but some topics were discussed because students expressed curiosity in them), Wednesdays were for presentations, film, and verbal practice, and Thursdays were for Urdu. The only downside to such a structured course was that it was difficult to find time to actually practice speaking in Hindi-Urdu. But if you enjoy the language enough, you'll find a way to practice outside of class.\nOverall, I would definitely recommend taking this course, and I'd strongly encourage anyone to take Dalpatji's section. You can tell that he cares about the subject and his students, which is a rare combination at Columbia. Plus, he is hilarious and quite witty, so you'll always be entertained!\nWorkload:\nVery light and completely managable for a 5-point course.\nOne assignment Monday, Tuesday, and Thursday nights, along with a weekly journal. Occasional quizzes which are pretty easy.\nA midterm that includes an oral/verbal exam, and a final exam. A short individual presentation (less than 5 minutes) at some point during the semester, and a final group presentation (around 10 minutes).\n"
        },
        {
            "course_name": "Elementary Hindi I, Elementary Hindi II, Intermediate Hindi I",
            "review_date": "September 09, 2009",
            "review_content": "\nDalpat is an excellent teacher. He taught us Hindi language,literature, movies and so many other things. I learned a lot in two semester. He explains all the concepts very well and I would love to take any class with him again. \nWorkload:\ngrammar, literature and journal \n"
        },
        {
            "course_name": "Elementary Hindi I, Elementary Hindi II, Intermediate Hindi I",
            "review_date": "September 08, 2009",
            "review_content": "\nProbably one of the most lenient and easiest professors I have ever encountered at Columbia. If you're new to hindi or are really looking to have a solid foundation, he's not that great. He has a thick accent and has a tough time explaining a lot of grammar concepts. That said, he does try and get a lot of reading practice in for the class. \nWorkload:\n2 assignments and journal a week. Although I don't really think he checks for journal submission. Very very easy.\n"
        },
        {
            "course_name": "Elementary Hindi I, Elementary Hindi II, Intermediate Hindi I",
            "review_date": "September 01, 2009",
            "review_content": "\nHas an accent, is a bit all over the place with lessons, doesn't explain concepts well. But he is a sweetheart (for the most part), and is lax on grading. If you're looking to REALLY understand the language, you won't get much speaking practice here, and he doesn't explain grammar rules very well.\nWorkload:\nHomework once or twice a week in Intermediate, including journal entries. Not hard.\n"
        }
    ]
}