{
    "prof_info": [
        {
            "prof_name": "Kenneth Jackson",
            "prof_id": 97,
            "total_reviews": 45
        }
    ],
    "reviews": [
        {
            "course_name": "Warfare in the Modern World",
            "review_date": "May 08, 2015",
            "review_content": "\nTo be quite honest, I don’t know what I was expecting from this class. Both here at Columbia and in high school, military history was never really explored in depth beyond, “These are important battles, actors, etc.” We never did battle analyses and we were often more concerned with the outcomes and impacts of the wars rather than the techniques, generals, ships, weaponry, etc. So I thought that this class might be an exciting way for me to learn more about an area of history that I have not yet covered. \nWhile Jackson is obviously very passionate about this material, he was often very, very unprepared. The lectures were haphazard, often going on tangents, with generally unhelpful PowerPoints that were either vague maps or incredibly long and detailed list of dates of battles, involving specific troop movements. The material covered was covered in the wrong order, at the wrong level of detail, with small details that you would have to put together into the bigger picture, rather than the other way around. I would much rather have a general overview of the war, know some key battles, general movements, technologies, strategies, etc. that influenced the war and its outcome, rather than have a litany of events in North Africa, then Europe, then the Pacific, then Korea, etc. \nI would have also appreciated knowing how these wars affected the home front and social conditions. This was a HUGE topic in all of my history classes before and this could have been explored in more depth in a class like this, but instead we got a few cursory points about Pals Battalions and the home front in New York during World War II and the Holocaust in Nazi Germany (which were two of the best lectures, btw). \nLike I said, Jackson is incredibly motivated and knows what he’s talking about. I just wish that the lectures were better organized and I wish we spent less time watching films (I know, shocker! but I got nothing out of them, and felt my time was better spent doing readings for other classes or even just going on Facebook). We had a few lectures by one of Jackson’s colleagues at Purchase College, Professor Lisa Keller, and her lectures were ORGANIZED, COHERENT AND MADE AN ARGUMENT! These are what Jackson’s lectures should have been! I don’t come to class to get what amounts to reading the Wikipedia page. I would like to be able to understand what happened, what the professor thinks, and then go from there. \nThis was the first time Jackson offered this class and on the very last day he apologized that more people did not like the class. He seemed open to suggestions written on the evaluation, so hopefully in the future this course will take a more comprehensive, or at least ORGANIZED!!! look at warfare in the modern world. \nThe class was very focused on World War II. Seriously, we spent half the class on it. We spent two lectures on a general history and theory of war, two for exam review, three lectures on the Civil War, two for World War I, fifteen (!!) lectures on World War II in North Africa, Europe and the Pacific, one on Korea and Vietnam, and one on the Gulf and Afghanistan and Iraq wars. In all I have a very comprehensive understanding of World War II, which as definitive as it was, is perhaps vital to understanding the present. \nWe also had a number of veterans in the class, and though Jackson made attempts to incorporate their experiences in the class, I would have liked to hear them more as primary sources about the war, and their experiences in it, as a sort of exercise in oral history. It could have been a very rich way to introduce students the historiography of war, so I hope that if Jackson is reading this, he will incorporate it in the future. I would have also appreciated hearing their opinions on how studying versus living in war are different. \nThe upshot was that this class was generally very forgiving. The midterm and final were very fair and the grading on the essays were equally fair. Reading was light, though Jackson would often assign hundreds of pages at a time, so note! and make sure to keep them spaced out. \nThe TA's were generally accessible and helpful, though they did say they would upload the PowerPoints for the final, though they didn't. \nWorkload:\nNot too bad, light for a history class.\nReadings -- for history, light. Mostly Keegan’s books “The Mask of Command,” “The Price of Admiralty” and “The Face of Battle.” Also included were Toland’s “The Rising Sun” and Bradley’s “The Flags of Our Fathers,” each in their entirety, which were never discussed in class. One of the essay options for both the final and midterm consisted solely on the readings, so you may want to do it, though it is pretty optional. \nExtracurricular Participation -- 10% -- involved going to the Intrepid or the Museum of Jewish Heritage, and writing a one page report. Also, you could go on the class trip to Gettysburg. \nLetter from the Somme and Movie Reflection -- 10% -- Letter from the Somme: write a letter to your wife/mother as a private fighting in the Somme. Movie Reflection: write three pages about a war movie, a list is included in the syllabus. Really open-ended. \nBattle Analysis -- 20% -- 3 to 5 page analysis of a battle in a war between Waterloo and World War II. Not too difficult, though you are expected to do research for this. N.B. Columbia’s war history collection is mostly offsite so you’ll have to either go to NYPL (like I did) or plan it more than three days in advance (which was hard, since the assignment was not given out until the Wednesday before it was due)\nMidterm -- 20% -- 6 ID’s and an essay (6 bluebook pages). Straightforward though one of the IDs (von Blücher) was a figure from Waterloo, which was covered only in the readings. \nFinal -- 40% -- 10 ID’s and two essays (4 bluebook pages each). Straightforward. Essay questions were incredibly, incredibly broad, making it easier than the midterm. \n"
        },
        {
            "course_name": "Warfare in the Modern World",
            "review_date": "May 05, 2015",
            "review_content": "\nI can't figure out how I feel about this class. On the one hand, I learned a lot of certain wars, as well as strategic maneuvers, which is why I wanted to take the class. On the other hand, Professor Jackson frequently gave out irrelevant or incorrect facts, had not very useful power points, was easily led on a tangent, and had virtually pointless readings. \nHowever, you could tell that Professor Jackson truly was interested in the subject matter, which is a plus, so for some battles he would be able to give a very good in-depth analysis of what happened. I came out of the class with a stronger knowledge of military history, and an interest to take more history classes of the sort. \nThe class was often divided up in the first forty five minutes was Professor Jackson lecturing, and the latter half was watching a movie clip. It was a very easy class work-wise, and there was little class participation. When there was, the question was generally not fully resolved, and a comment was generally waved away. \nIf you are interested in taking an easy history course, or are interested in building a foundation in modern warfare, take this class.\nWorkload:\nRelatively light: a couple readings that were not at all necessary, two papers, a midterm, and a final\n"
        },
        {
            "course_name": "Warfare in the Modern World",
            "review_date": "May 01, 2015",
            "review_content": "\nPerhaps the best thing about this course is Professor Jackson’s genuine love of the subject matter. He is passionate about the material yet maintains the tact and sensitivity necessary for a meaningful analysis of modern warfare. Professor Jackson claims that he cannot do the material justice and often incorporates outside sources to compensate. He supplements his lectures with film selections on an almost daily basis and, on several occasions, he brings in guest lecturers. \nThere are sporadic reading assignments which are too long to be practical. As a non-history major, I didn’t have time to dedicate to over a hundred pages of overly-technical battle accounts. The written assignments are somewhat vague, which can adversely affect your grade if you don’t meet the TAs unclear expectations. The tests consist of short answer IDs and essay questions. Some of the IDs are really obscure names that were only discussed in a single lecture. This is probably the best reason for attending lecture regularly. \n\nWorkload:\nYour grade is broken down as follows\nParticipation in Extracurriculars\t10%\n     (trip to Gettysburg)\nMidterm                         \t20%\n3 Page Movie Analysis\t\t\t10%\n3-5 Page Analysis of a Battle\t \t20%\nFinal Exam \t\t\t\t40%\n\n\n"
        },
        {
            "course_name": "American Urban History",
            "review_date": "April 29, 2013",
            "review_content": "\nI found this course to be excellent and eyeopening.  Those who have criticized Kenneth Jackson are expecting too much.  Perhaps he isn't as spry as he used to be, but come on! he's 72!  While his lectures didn't have strict organization and he had a habit for getting off into tangents, Jackson was extremely engaging.  He also has an old world sense of Southern class.  You will learn to love his drawl.  Personally, I found the material fascinating.  This class provides a whole new outlook for understanding the United States.  The history of urban development in this country does not get as much attention as it should, and Jackson advances a number of theories on how urban influences affected U.S. history.  Moreover, you get a sense for how urban landscape of America developed and how those developments affect the world we live in today.  Fascinating stuff.  Additionally, I thought the tour requirement was a great idea.  As Jackson explains on the first day, going to a place is usually far more memorable than what you learn in class.  \nThe one huge downside of the course was my TA, Aurelie, who was without question the WORST TA I've had at Columbia.  She did a pretty terrible job of leading discussion, and didn't help us digest the readings at all.  Many of the times she managed to direct discussion away from relevant topics to ones completely irrelevant to the course.  Remarkable.  The section would have been better without any leader at all.  On top of that, she seemed to have developed personal vendettas against certain students in the section.  Not what they did, but the dislike was palpable.  Even worse, her grading was harsh and made no sense. The comments I received on my papers and exams were actually nonsensical-and most of the time my grades were still pretty good.  Other members of the class had the same experience.  I still don't understand why I did better on some assignments and worse on others.  \nOverall, I would still recommend the course.  After all these years, Ken Jackson is still the man, and this class is fascinating.  And don't be discouraged by the TA.  Apparently, the other two (Ian and Joanna) were excellent.  Just avoid Aurelie at all fucking costs.  \nWorkload:\n4 tours, most of them led by Jackson.  4 2-page response papers.  One responding to a book off a large reading list, one on a movie, one on a tour, and one on a museum exhibit. These should have been fun and easy, but Aurelie made them hard.  A midterm and a final.  We were given a list of possible ID's in advance for both.  We also got a possible list of essay questions for the midterm.  This made the exams pretty painless.\nA fair amount of reading, but you only really had to do Jackson's Crabgrass Frontier and Jane Jacobs' book.  The rest was interesting but unnecessary. \n"
        },
        {
            "course_name": "American Urban History",
            "review_date": "December 27, 2012",
            "review_content": "\nThis course was a massive disappointment for me. Lectures were way behind schedule and plenty of topics we were told would be addressed were left out. Lectures had no shape to them and frequently only reached an interesting question in the last five minutes after ages of rambling to no particular point. At least three lectures were just watching videos. We frequently had guest lectures, which were hit and miss: some were better-prepared and thus more compelling than Jackson's; some seemed irrelevant and shapeless.\nThe readings were often interesting and if you have a good TA, that will save the class (I had Ian Shin, who was awesome; Joanna Dee Das also seemed to know her stuff). \nThe problem with this class is its tendency to chuck a lot of information at you, not in a particularly sifted or structured way, most of which will be irrelevant, with no central question or problem or theme to bind it all together.\nI was coming to this thinking it would be more of a history class. Those coming to it with an interest in urban studies or sociology might find it more interesting, but I found its shapelessness and Professor Jackson's lack of commitment (entertaining though he is) extremely frustrating.\nWorkload:\nFour field trips (beware if you have a Friday class, but you can make them up taking private tours in New York); four responses to a book/film/field trip/museum (not hard but require some effort); a fortnightly discussion section. Not too heavy - no essays, though I think that would have helped the class be more structured. The exams aren't hard.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "April 19, 2012",
            "review_content": "\nI very much disagree with the previous reviewers.  Professor Jackson's class is the sort of experience where you will get exactly what you put into it.  Unfortunately, for many students in a 300+ lecture class, this meant skipping lectures, coasting through discussion sections, and half-assing it on assignments.  To be fair, it's unsurprising that there's some disappointment with Jackson's class: his lectures can (at times) be vague or repetitive; some of the books fail to be compelling; and the field trip requirement can be tedious (especially when not planned out properly--many of my friends didn't go to any the first half of the semester and got screwed around finals season).\nThat being said, Jackson is a living legend at Columbia (and unfortunately at age 72 he may not be living too much longer).  For those that actually do the readings, you will learn more about New York City than you thought there was to know.  If you keep your ears open in lecture and your eyes open on the field trips, you'll leave the semester with a factoid about every other block in the city--something I love to share whenever I have relatives in town.  Jackson's class gave me the single largest bulk of information of any class I've taken in 3 years at Columbia.  That not to mention the fact that his Tennessee frankness makes lectures delightfully entertaining.  Jackson rambles, yes, but his anecdotes are genuinely interesting and often quite funny.  Lastly, the field trips, if you take them seriously, will take you to places in the city you've never been before, and the TAs set out truly awesome experiences.  To name a few: the all-night bike ride, going backstage at the opera, and walking across the Brooklyn Bridge to eat Grimaldi's pizza with Jackson himself!\nOn a personal note, I found the neighborhood project was truly an enlightening experience.  Ask your TA for a particular neighborhood assignment early in the semester so that you get somewhere you're interested in (otherwise the assignments are random).  I picked Mott Haven and found it to be a genuinely eye-opening--not to mention fun--experience.\nA word of caution: for those considering History of New York City just because it has a reputation of being a legendary class, there is a possibility you'll fall into the category of the previous reviewers and not get much out of the class.  Personally, however, I'm not a history major, but I love New York (as should every Columbia student).  So, if you really want to learn a ton about the city you live in, and enjoy some southern humor and quirkiness twice a week, I recommend Kenneth Jackson wholeheartedly.\nWorkload:\n1 midterm\n1 final\n8 required field trips (you can select out of approximately 20, including movies)\n1 neighborhood project (15-20 pages incl. pictures, done in groups of 3-4)\nExtra credit: groups that do tours of their neighborhood project can get extra points.  Not sure how many, though.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "April 09, 2012",
            "review_content": "\nThis class was a huge disappointment.\nJackson is a decent lecturer, but not necessarily enough to make it work waking up for a 10:35 class. Add that to the fact that some of his 'lectures' are just him playing documentaries that happen to feature him commenting about the subject on hand. Do yourself a favor and buy the PBS special miniseries of the history of New York on DVD. Congratulations - you just bought 3 of the 22 lectures in this class, and you didn't even have to pay any tuition!\nThe neighborhood report is a joke - it's a high-school level assignment (a glorified book report), but it's a huge pain to visit the neighborhoods, as none are in New York. You're lucky if your neighborhood is only an hour away by subway.\nThe walking tours/field trips could hardly be scheduled more inconveniently. A few were even scheduled during the lecture time - I kid you not. It adds insult to injury when you find out that most of the tours are run by a tour company that was founded by one of Jackson's old students (and which employs many Columbia graduate students/alumni as tour guides). \nI stopped going to the class a week before the midterm (except for the two exams, I didn't even set foot inside the lecture room afterwards, though I did go to recitation). Didn't miss a thing, apparently, since I did very well in the course anyway.\nI'm a bit sad, because I was really excited to take this class as a freshman, and I waited until senior year to take it, only to find out that it was more tedious than anything else. On the plus side, I got to sleep in until noon two days a week, which was a nice surprise.\nWorkload:\nDepends on the TA, but 1 neighborhood report, weekly Courseworks postings. Midterm and final (each contains IDs, plus two essays). IDs are given in advance. Final exam essay questions aren't known in advance, but midterm essay questions are chosen from four possible questions.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "November 13, 2011",
            "review_content": "\nLove New York. Love Kenneth Jackson. Hate this class.\nDo not take this class if you do not have money to pay for the numerous trips or buy all the books. Do not take it if you are also a busy individual with other slightly important courses.\nI wanted to love this class and would have if we did not have to have eight credits worth of field trips. Yes, the bike ride sounds amazing, but only if you own a bike or can afford a rental. \nToo much reading for a 3 credit class. Your grade depends on your TA. Each TA grades differently and it really sucks.\nThe Neighborhood project is great though. I was able to learn about another neighborhood that I judged before visiting. But if you group stinks, then your grade does as well.\nOverall, the class gets a B-. It would have been great without the extra work. The class is also not worth going to unless you are an outsider that does not know NY history already.\nWorkload:\nTwo books a week. Depending on your TA, a courseworks post every time you have discussion section.\nMidterm, 20 page neighborhood project, and Final\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "October 24, 2011",
            "review_content": "\nKen Jackson shares a number of characteristics with another beloved New York institutionâ€”Regis Philbin.  Both are enthusiastic entertainers who sincerely want their audience to enjoy the show (oops, I mean the course).  Both really do know their stuff and have become admirably proficient over the years in their stagecraft.  Unfortunately, both have grown far too comfortable with being caricatures of their better selves, and settle too often for â€œshtickâ€\u009d over substance.  Both are far too fond of name-dropping and random digressive reminiscences.  To be honest, both are critic-proof, so I doubt that my comments will make the slightest dent in their popularity.  I will say this, though:  If your parents have never been to college and they come to visit you, this is the course to take them to. Theyâ€™ll think itâ€™s just wonderful.   On the other hand, if you have a friend who is a history major at another reputable university who comes to visit, this is the last class to bring her to.  Youâ€™ll spend your time cringing in embarrassment and explaining apologetically that the Columbia/Barnard History Department really isnâ€™t like this.  \nWorkload:\n     A bunch of field trips, the arranging of which takes so much time that the lecture period sometimes seems like high school home room.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "March 07, 2010",
            "review_content": "\nIf you have the slightest bit of interest in the city surrounding Columbia, Kenneth Jacksonâ€™s History of the City of New York is one of the most important classes to take before graduating. \nMost of the reading comes from a book of primary sources that Jackson himself edited, Empire City. In past history classes, I always felt a little uneasy assigned to read a book written by the professor. In this class, I felt grateful that we were able to read such an amazing collection of stories on New York. Empire City includes writings on four centuries of the cityâ€™s history, from early Dutch settlers to Fredrick Law Olmstead to Jack Kerouac, and arguably the greatest piece ever written on New York, E.B. Whiteâ€™s 1949 essay, Here is New York. \t\nA few weeks into the semester, Jackson leads a Friday night bike ride beginning at midnight. It could have easily been one of the most amazing experiences I have had at Columbia. Riding under the lights of Times Square with two-hundred other people on bikes and seeing the looks of bystanders standing outside bars was truly unforgettable. The ride encompassed Central Park, Times Square, Greenwich Village, Federal Hall, the Brooklyn Bridge, and finally ended with an incredibly peaceful moment on the Brooklyn Promenade just before 5 AM. \nThe neighborhood analysis, a group-project where students prepare an online wiki article detailing the history, sites and culture of a New York City neighborhood (including an account of a personal walking tour), was a very creative way of experiencing a completely different piece of the city. Unlike the reviewer below, I chose to cover a neighborhood in Staten Island with two other classmates. It was my first time to Staten Island and it was truly fascinating to see a residential neighborhood in the same city as Manhattan with an entirely different character. We had the opportunity to meet a handful of local residents, ranging from a devoted cricket player hailing from Sri Lanka who leads an organized league every weekend at the neighborhood park to a young Italian woman who explained the sharp divisions in socioeconomic class between the â€œNorth Shoreâ€\u009d and â€œSouth Shoreâ€\u009d of Staten Island.\nJackson himself is an incredibly entertaining and informative lecturer. When discussing how the work-life balance shapes New York relative to other cities, he instructed us to â€œthink about people in Madrid or Seville. They have a siesta in the middle of the day when they get to go homeâ€¦.and have sex if they are lucky. New York doesnâ€™t have that.â€\u009d One requirement of the class is to attend seven field trips to different places in the city (my favorite trip explored the history of ghosts in Greenwich Village). If you are lucky, Jackson will sometimes come along on these trips, which can range in size from 15 â€“ 30 people. On one such trip, to the temporary home of the National September 11th memorial downtown, I asked the very approachable Professor Jackson about how he got interested in cities. While I donâ€™t remember his answer, I remember the advice he gave. Things will happen in life (like getting married) that may cause you to move somewhere or take on something you never thought you would do. So donâ€™t worry too much about every detail now because life is too fluid to be planned out. Not only is he a great teacher, Kenneth Jackson an inspiration.\n\nWorkload:\nLike most history lecture classes, your grade is almost entirely dependent on your TA. There is a midterm, a final and a neighborhood analysis. I found that while my TA gave just about every group a top score on the neighborhood analysis, he was arbitrarily strict on the midterm and final. The midterm and final consisted of concept identification (4-5 sentences per concept), quote significance (final only) and an essay on a broad topic (â€œHow is New York the most American and least American of cities?â€\u009d). Possible essay topics are given in advance so you can prepare (and memorize) outlines. \nThe seven (7) field trips are set up so that if you donâ€™t do all seven, your grade will be lowered. There is no extra credit for doing additional trips. \nReading is manageable (approximately 60 - 100 pages per week). On the midterm and final, you are expected to bring in evidence from different readings in order to support your essayâ€™s argument. \n\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 02, 2010",
            "review_content": "\nI loved History of New York with Prof. Jackson. Taking this class really makes you appreciate the city we live in.\nProf. Jackson is a great lecturer. He's very clear with what he's stating, selects interesting information to give, and also throws in personal anecdotes. I will, however, say that he loves New York too much to say anything negative about the city and found that he did not mention some of the problems the city has faced. Also, it's hard to cram 400 years of New York history into a semester and we never went too far in depth. But overall the delivery of his lectures were fine and I enjoyed listening to his lectures. He also invites a few guest lecturers.\nThe midnight bike ride was epic - can you imagine a 70-year old professor leading over 200 students on bikes around New York City? I thought it was very generous of Prof. Jackson to do several field trips including the bike tour. \nIn terms of grading, it all comes down to your TA. Unfortunately sections meet every 2 weeks so you never get the chance to really get to know your TA. Sections are mandatory and count for a large chunk of the grade. I've heard mixed reviews about different TAs. \nFor the neighborhood analysis, you are assigned the neighborhood and do not have the option to choose. I lucked out with my neighborhood being accessible by subway and with great ethnic food. If you're unlucky you may have to schlepp over to Staten Island... \n\nWorkload:\nDaily readings from primary sources and other NY related books.\nMidterm\nFinal\nNeighborhood Analysis: you are assigned a neighborhood and have to write an extensive report on it. Counts for a large chunk of the grade. You also have to write walking tour of the area and have the option of doing an actual tour.\nField trip credits: need 7, some field trips count for more than 1 credit - try to do the ones that are free.\n"
        },
        {
            "course_name": "American Military History & Policy",
            "review_date": "December 23, 2009",
            "review_content": "\nHe requires one book a week for discussion.  You don't have to know it all.  Understand important concepts, and details.  Expect to answer questions like \"Why did Hitler attack the Soviet Union when they were his allies?\" or  \"Why wasn't the United States ready for the attack on Pearl Harbor?\"  He is a total nerd about the subject matter, and likes to lead the conversation.  You can get away with saying little, but at least say something substantive.  He will call on you if you are mute.  He will avoid you if your comments are inane.  \nYou will be graded only on the two papers.  He will provide the prompt for the first one, and the subject of the second will be up to you (he must approve it, however).  He likes concise, clear writing; edits comprised most of the marks he made on my papers.  (DON'T repeat any word in the same paragraph.  That is his pet peeve.)  If you want to know precisely why he marked down your grade, you may have to meet him during office hours, since he is vague in his written comments.\nAt random points of the semester, he will want you all to turn in a short draft of your research paper.  A one-page summary here, a 4-5 page bibliography there.  None of this is graded.  He doesn't worry about reading this early writing, either.  It is all required so he knows you are progressing.\nHave fun with it.  Jackson does.  Like I wrote, he is a nerd for this stuff.  If you can relax, come to discussion reasonably prepared, this will be good experience.\nWorkload:\nReadings: One book a week; understanding the important concepts\nTwo papers: a 5 pager due the second week of class; a 20 page research paper due the very last day of class.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 09, 2009",
            "review_content": "\nAt the very least, this is a fair class.  Lectures often contribute specifically to subjects covered in the exams.  If Jackson brings up a piece of information more than once, put a star next to it; it might be on the exam.  Otherwise, if he happens to go off-topic, he will say so, and state that the information is unnecessary to know.  I recommend you attend lectures often, as they will be helpful to your preparation of the graded work.\nHe requires 7-points worth of field trips (some trips are 2 or 3 points) as part of your grade.  Some are free, but most are led by tour guides, and therefore cost either $12 or $15.  There are enough trips that you probably won't need to ruin your life just to schedule one (I didn't).  Get these done early, if possible.\nThe Neighborhood Project is a major component of your grade.  You will work in groups of three to wrote a 20 page report on a specific NYC neighborhood.  Get ready to do some original research.  You may have to dig deep if you are assigned a more obscure area.\nI recommend this course.  Jackson was a concise lecturer (and fun to quote out of context!) and made sure we knew when he was discussing fact, or his own opinion.  \"Now, this is an editorial...\"  I enjoyed listening to him.\nBut--your grade is up to your TA.\nWorkload:\nReadings: primary sources every week, one book every two weeks.  \nNeighborhood Project: you have two months to work on it.\nField Trips: a 7-point minimum.  No extra credit.\nMidterm and a final, comprised of subject identification, quote identifications, and an essay.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "July 01, 2006",
            "review_content": "\nJackson's taught this class for so long, that you FEEL that you're getting rote, regurgitated info. Some reading material was interesting. As were some field trips. \nHere's what's definitely unfair about the class. Even if you do A to A- work in exams, your grade will be lower than some lackey who's gotten B's & B+'s on exams but went to ALL the field trips, because Jackson gives extra credit for field trips. Yup. Elementary school redux.\nSo if you have a job or family duties that preclude you from attending some bull*&^% field trip to a hippie taking you through Gramercy, you are out of my luck, my friend.\nIf this class was ever good (and deserving of its reputation), then it's merely a shadow of its former self.\nWorkload:\nmid-term, final, a medium length paper on a topic of your choice. Oh yeah: field trips.\n"
        },
        {
            "course_name": "Robert Moses & the Modern City (co-taught with Hilary Ballon)",
            "review_date": "May 13, 2006",
            "review_content": "\nThis class was amazing.  I took Jackson's lecture classes as an underclassman (City of NY and American Urban Hist) and liked them, so was happy to have him in a seminar setting.  Both he and Ballon really know their stuff and I think they compliment each other really well.  While Jackson sometimes meanders, everything he has to say is really interesting and Ballon would get the seminar back on track.  Robert Moses is a really interesting character and for those of us interested in Urban history he comes up time and time again so it was awesome taking a class just about him.  The seminar was about half-lecture, half-\ndiscussion which I really liked - I've found seminars with all discussion to be pointless because everyone just regurgitates reading.  In lieu of a seminar paper, we had 3 groups and each group researched an aspect of Moses' involvement: parks & recreation, urban renewal & housing, and roads.  I'm not a big fan of group work but everyone's projects came together by the time of our presentation.  Still, I think I would have preferred to work alone.  Regardless, the course was excellent and I'd highly recommend it.\nWorkload:\nWeekly reading (the Power Broker, Moses' books, Jane Jacobs, etc) - usually 100 or less pages a week, or so it seemed.  Big group project.  \n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 15, 2006",
            "review_content": "\nI totally agree with the previous reviewer. This class does not live up to the hype.  I am a native New Yorker & I decided to take the class to learn more about my native city.  I was often insulted by Jackson's remarks about the city, especially the outer boroughs.  I also found that I wasn't learning anything I didn't know & Jackson presented some obvious misinformation.  The readings were too many in number & pretty pointless.  The field trips were terrible because you had to pay Big Onion Walking Tours to go on them & you still had a good chance of having your TA as your tour guide because they all work there!  Discussion sections were a joke.  So were the exams & paper but somehow the TAs can find reasons to grade harshly.  I was not impressed with Jackson himself.  I was insulted on the occassions that he felt like not showing up to class & his lectures were ridiculous.  He would start on some important idea & then go off onto millions of little tangents, often stopping in midsentence.  This class is not worth the trouble.\nWorkload:\nseveral pointless books\none confusing paper (you can get exempt from it by doing an internship with a NYC-based organization like the New York Historical Society or Friends of Morningside Park)\ndeceptively straight-forward midterm & final\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 11, 2006",
            "review_content": "\nYou could take this class.  Or, alternatively, you could learn the two big lessons of this class right now by reading this review.  Ready?  1.) In the nineteenth century, the streets of New York were covered in manure. 2.) New York is the best city in the world.\nBasically, this is what I got out of this class.  It is possible (if not likely) that Jackson imparted other important information in his lectures, but it is difficult to be sure b/c they were so painfully disorganized that it was impossible to pinpoint at any given moment just what Jackson was trying to say.  Except, of course, that New York (horse s--t and all) is really really awesome.  The class does have redeeming elements.  The reading list is for the most part excellent.  The field trips are a great idea, and the research for the paper on the New York Times is actually very interesting.  There is also the fun of watching Jackson shamelessly direct some hapless TA to fastforward to every point in a video where he is speaking, neatly skipping those pesky parts in the middle where he can't listen to himself talk.  If you've always dreamed of taking a class with the vainest professor at Columbia, this course is a must for you.\nI believe Jackson loves New York (maybe even as much as he loves himself).  I believe (b/c I read his book) that he is remarkably intelligent.  I also believe that taking this course was a huge waste of my time.  I know some people take this class and really enjoy it.  I can see how maybe it might be fun if it is the only history class you ever take at Columbia.  Otherwise, do yourself a favor and stay far far away.\nWorkload:\nPretty heavy reading load, even for a history class.  Much of it can be skipped or skimmed (although the reading is essentially the only way you will learn anything substantial from this class).  Minimum of 8 field trips.  Choice between an internship, writing up a walking tour, and a four page paper based on old New York Times articles.  Midterm and final.  My class was given study sheets for each that gave about 50 ids, 10 of which were on the exam and 5 essays or general themes, out of which the exam essays were pulled.  It does make studying easier, although you will be left hunting through the indexes of the books, wondering if the TAs (b/c the TAs are the ones who make up and grade the exam) sat through the same class you did.  I can only hope, for their sake, that they didn't.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 05, 2006",
            "review_content": "\nCertainly one of the \"must\" courses at Columbia though sadly as a \"must\" fails to live up to the hype. The class comes built in with two fatal flaws: it's enormity and a lack of control on the part of the professor.\nFirst, the enormity. 350 registered students means a few things: students won't be showing up to lecture or section, students won't be doing the readings, and students simply won't take the course serious assuming it's an easy A. The class is just too large, but little can be done given the persistent demand whenever its offered. A class of this size means students are stuck with a single TA throughout the semester, for both bi-weekly recitations (a breeze, though many of the other students can be quite annoying when you have something worthwhile to contribute) and grading (thankfully, I had a really great TA on both fronts, though I've heard horror stories). Then there's the famous field trip requirement -- 8 trips for full credit, 13 for a 1/3 final grade bump, and 21 for a 2/3 final grade bump. The objective of the field trips, somewhat insulting, is to get the students out of Morningside. As someone who makes it his obligation to get out of the area, I found that I had visited nearly everything on the field trip list at some point. Thus, many of the trips were wastes of time, and costly ones at that. I never had a chance to experience the bus trip because the head TA would routinely send conflicting information, only to correct herself in three-plus subsequent emails. By the time students were allowed the sign up, the bus trips would be somehow full. Of course, again, the enormity of the class is to blame.\nSecondly, while Ken Jackson's phenomenal, he has absolutely no control over the course other than the two times a week he shows up to lecture -- granted, there were five times last semester, not counting exams, that he decided not to show up, and instead insulting us with either a movie or a guest lecturer. His lectures were interesting, albeit extremely dated. His best work was certainly the historical component of the course that really lasted through the midterm. After that, I'm not sure what we were supposed to pick up from the second half -- there was a degradation into American Urban History (independent of New York), common suburbanization trends, and, for awhile, his feelings on energy consumption. The point is, to do well in the class, and he lets you know this on the first day, you don't ever have to show up to lecture. Lectures can become redundant anecdotal stories, with one \"editorial\" after another. He also seemed to ignore the post-1945 cultural and economic rise of the city, favoring broader trends over New York. Finally, and again due to a lack of control, the readings rarely corresponded with the lectures. The exams seemed to ignore his lectures completely. This is of course not to take anything away from the man as he's the greatest living New York City historian. Though he seems to have lost control over his classroom.\nAs for the readings --\nI can't understand why people go insane over Jackson's booklist. Don't bother with the novel; not just because Time and Again was a lousy read, but because it's not going to show up anywhere, on anything. You'd be better off paying a visit to the Dakota (on 72nd and CPW) and just looking around the neighborhood. You also shouldn't spend too much time with Empire City, other than reading the chapter intros. Don't bother reading Carol Willis' skyscraper book if he assigns it again. While it shouldn't take more than an hour or two to plow through, it's one of the most poorly written academic works I've ever suffered through. Read The Power Broker. It's 1,200 pages of pretty easy reading (by Robert Caro) that doesn't take more than a few days to complete, and it's a great tool for the final. Read Jane Jacobs' book, not only because it's required, but also because it's one of the greatest critiques of postwar urbanization ever written. Read Jackson's Crabgrass. I think the reasons have been well articulated in other reviews. If he's still assigning Doig's book on the Port Authority (and Austin Tobin), read it for the final. The same goes for Craig Wilder's book -- a critique on the rise of Bed-Stuy as Brooklyn's ghetto. Buy Dolkart's book on Morningside Heights because, good god, you're studying there. While it probably won't show up on anything, it's a fantastic read with fantastic historical pictures throughout. Hell, I'd even recommend the hardcover for a coffee table.\n\nWorkload:\nStraightforward in-class midterm and in-class final consisting of IDs and essays -- each of which get passed out ahead of time. Thus, I can't see how you can do poorly on the exams, unless you don't bother to do the readings. Paper, or the more esoteric designing of a walking tour. The paper is a short four-page deal looking at four different editions of the New York Times based on family birthdays. It can actually be fun too. Field trips (described above). Bi-weekly discussion sections (also described above).\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 23, 2005",
            "review_content": "\nI just read the latest review. The most amazing class ever? The sad thing is that for a minute, I thought that was a joke. Literally, I thought that was sarcasm. \nDepth? Analysis? Non-existent. Immigrants came to NY. NY is unique. The Industrial Revolution changed NY. Transportation changed NY. Yay, NY! \nJackson loves NY. I believe it. I love NY, too. But I learned nothing in this class. Really.\nWorkload:\nmidterm and final (review sheets with all the IDS/essays so if you do poorly, that's kind of sad for you), short (interesting) paper based on old NYT articles or do an internship or write a walking tour, 8 walking/bus tours/activities/lectures out in the city (13 for extra credit), section every other week. Read Jackson's book, Crabgrass Frontier. If only Jackson could teach that coherently.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 11, 2005",
            "review_content": "\nThis is the most amazing class ever!  Sitting in Jackson's class is something I looked forward to every monday and wed.  THis man is a legend and deserves the reputation.  Not only is he engaging and interesting, but he is interested in his students.  Impressive considering the size of the class.  THe lectures resembled a story time, that you left with a huge amount of information without realizign how you acquired it.  The fieldtrips are time consuming but so interesting.  It allows you to experience NYC, forces you outside of the COlumbia Bubble.  His enthusiasm and love of the information makes you want to learn the information, the enthusiasm is contagious.  THis is THE BEST CLASS I HAVE EVER TAKEN!!!!! I wish I could take it over and over.  \nWorkload:\nThe workload was not bad, do some of the readings, Crabgrass is a must on the midterm.  THe readings are interesting and overall work well together.  The midterm was easy with the IDs and essays given in advance, however your grade depends on your TA, and how anal or forgiving s/he is.  This class is not about a grade it is truly about enjoying the time int he class and the opportunities the class presents.  So ENJOY!\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "April 26, 2005",
            "review_content": "\nI have taken everything this man offers at Columbia for a reason...hands down the chillest man alive.  Hes definitely not the teacher for people who want structure.  But let me suggest him for those who like to sit back in class, relax, and just absorb his knowledge and really fun little stories.  A word of advice for Urban History and City of New York, READ HIS BOOK \"CRABGRASS FRONTIER\" its all you have to know basically.  I read this book once, really well and was able to write like 5 papers using the ideas from it for his classes and got all A's.  His reading lists are usually enormous, but he never expects you to actually have finished every single book, just know the juicy stuff and you'll be fine.\nWorkload:\nHes the man, it doesnt matter.\n"
        },
        {
            "course_name": "American Urban History",
            "review_date": "January 19, 2005",
            "review_content": "\nThis class was incredibly frustrating and dissapointing. Despite his reputation as an innovative, engaging, bike-riding professor, he is perhaps the worst lecturer I've had in four years at Columbia. His lectures follow no outline and have no purpose other than for him to expound his many hypocritical \"editorials\". Many classes were occupied with videos where he appears as speaker. On one occasion, he was finishing a subject from a previous lecture and decided not to continue with what was actually progammed for the day. However, instead of dismissing the class, he kept the 100 people in the room for 30 minutes to discuss absolutely nothing of import! The readings are informative and the TAs understand the painful lectures we all must endure, but that cannot account for the poor lectures with waning attendance. \nWorkload:\nGreat readings. Two papers, for which he had no idea what he wanted! He made up the instructions and the criteria as he went along. One midterm and final, but midway through the semester he decided to change his grading procedure to further confuse his students and muddle our standing in the class! 8 mandatory field trip (another waste of time...) DISAPPOINTING CLASS WITH ABSENT-MINDED PROFESSOR!\n"
        },
        {
            "course_name": "American Urban History",
            "review_date": "January 17, 2005",
            "review_content": "\ngreat, non-stressful class.  Jackson loves teaching and it's obvious.  You have to go on 8 field trips, but they're pretty easy and there's something like 40 that you can choose from.  Lots of looking at slides, and sometimes he has a guest speaker.  Basically its a really great class.  If you don't take at least one class with Jackson before you graduate, you are really missing out.\nWorkload:\n2 short papers, midterm, final both composed of id's and 1 or 2 essays.  For the final they give you 40 terms, of which 15 will be on the exam, and 5 essays, of which 2 will be on the exam.   Several hefty books to read, but skimming is all you need to get the main idea.  Discussion sections focus on the books.  Overall -easy class\n"
        },
        {
            "course_name": "American Urban History",
            "review_date": "January 04, 2005",
            "review_content": "\nI stand in awe of this man's brilliance. I am but a mere undergraduate majoring in urban studies, and I have had the privilege to sit in a class with the foremost authority on American urban history. Wow. WOW.\nSome people have criticized his lecture style, saying Jackson has a hard time organizing coherent speeches. OK, so he rambles - but it's useful stuff. The main ideas will be thoroughly drilled into your head. Given, you will only discuss the books in your TA's discussion sections, and the book material will form the basis of what you have to write in your exams. However, I didn't see this as a problem - you listen and absorb in lecture, you think critically and discuss in the TA section. Imagine how difficult it must be when you're as brilliant as Jackson and you have to dumb down your lectures for undergrads! He brought in some decent guest lecturers, too.\nLike DeBary and Foner, Jackson is one of those quintessential Columbia professors you should jump at the chance to have teach one of your classes. So what if he's not the world's best lecturer? You'll still learn volumes. I have to say this was the one class in which I was finally given decent ammunition to fight back against people who ask, \"How come blacks haven't pulled themselves up and succeeded where all the other immigrant groups have?\" Thanks to Jackson, I can now practically give my own lecture on specifically why government-approved policies have instituted racism in America and worked to concentrate poverty in inner-city areas. \nCompleting eight \"walking tours\" is not a problem because eventually he'll concede to letting museum trips count. Some of them are pretty useless, but others will be excellent if they are in parts of NY/NJ you haven't visited.\nJUST TAKE THIS CLASS!\n"
        },
        {
            "course_name": "American Urban History",
            "review_date": "January 01, 2005",
            "review_content": "\nI took this class after being really impressed by his City of New York class last Fall.  Jackson clearly knows a lot about Urban History but had a difficult time tranferring his knowledge into coherent, streamlined lectures.  Instead, classes wandered and there was rarely a structured theme to a lecture.  However, I still think the course was worth taking.  Even though his lectures were all over the place, what he had to say was interesting.  The reading list was fantastic - many of the books focused on race relations, although a few were on the built environment - and discussion sections were very interesting.  The TAs really helped us with drawing important themes from the lectures and books.  Lastly, the mandatory field trips help you experience the city, which makes the class really worth it.  So yeah, the lectures are really disorganized but you'll come out of the class learning a lot about urban history.  \nWorkload:\n2 papers - 1-4 pager on how travel guides depict a city (what they put in / what they leave out), and a 6-page paper on the historiography of a city.  Midterm - they gave us 4 essay topics in advance and picked one, plus 10 IDs.  Final - they gave us a list of ~50 possible IDs from which they took 14, and a list of of 7 essays from which they picked 2.  Everything's graded by the TAs, but ours were pretty fair.  If you study the review sheet, you're golden.  \nMandatory discussion sections about every week or two (20% of your final grade).  You have to go on a minimum of 8 field trips (some longer ones can count for up to 4 field trips).  If you do 12+ you get a \"bump\" in your grade.\n\n"
        },
        {
            "course_name": "American Urban History",
            "review_date": "December 29, 2004",
            "review_content": "\nThis class was really disappointing. The required readings were almost without exception very interesting and useful, but lectures were a joke. Professor Jackson rambled and talked in circles without ever achieving any real message or theme. Lectures were utterly useless in terms of understanding the subject matter of the course, but attending them was relatively necessary, as many of the IDs on the midterm and final were people or events mentioned by Professor Jackson in passing but not included in the reading. Mandatory walking tours were equally uninformative, and took up huge chunks of time, as most were 2 hours long and required at least an hour of commuting. Stay away from this class and this professor.\nWorkload:\n2 vague, relatively purpose-less papers; moderately easy midterm and final; weekly discussion sections (1 book read per week); 8 required walking tours\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 27, 2004",
            "review_content": "\nOkay, so he's arrogant.  Granted.  But the man is THE foremost authority on New York history (and urban history in general).  His lectures rarely follow the syllabus, but they are nonetheless interesting.  Depend on a good TA for reading guides (so you don't kill yourself reading superfluous material) and discussion of the readings, which are the subjects of the midterm and final.\nWorkload:\n2 papers, midterm, final, 8-10 required field trips, lots of reading, midterm and final (ids & essays, written by TAs, so go to section!)\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 16, 2003",
            "review_content": "\nWhile his lectures drift off, I still found Jackson to be very interesting and charismatic in his lectures.  He more or less gives you the important points - and any confusion can be sorted out in his book Empire City.  He brought in several guest lecturers, some of whom were more interesting than others.  You have to go on 8 or more walking tours (over 10 warrants extra credit) and those were pretty good... another plus - KJ leads a great walking tour.  While the book list looks long, the books are very interesting and some books you only need to read chapters of.  And if for nothing else, take the class to go on the All-Night Bike Ride - the most awesome trip you will take at Columbia.\nWorkload:\n2 papers (1 short one comparing Gangs of NY to Anbinder's Five Points, another one involving newspapers or designing a walking tour - or you can intern at the NY Historical Society or Museum of the City of NY); midterm; final.  TAs grade your stuff, so your grade depends on them a lot.  Discussion sections once every week or two.  Minimum of 8 walking tours (there were about 40 offered).\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 07, 2003",
            "review_content": "\nA real mixed class. I thought the first half was great but the second half sucked. KJ's like an old man who regales you with two good stories until you realize those are the only ones he knows. Still, I'd recommend it. The walking tours are great. They're something you could and should do in your spare time, but never will. Plus, the class is relatively painless. Even when KJ's at his worst, it's more pointless than boring.\nWorkload:\n2 short papers on stupid but managable topics. A midterm and a final. Mandatory attendance on at least 8 walking tours, which occur throughout the semester.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "September 03, 2002",
            "review_content": "\nprobably the only class i'll take at columbia that i will remember for the rest of my life...ken jackson is one of the kindest, smartest profs i've had.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "July 11, 2002",
            "review_content": "\nHistory of the City of New York is a great class. Professor Jackson mixes lectures, walking tours, and the infamous midnight bike ride to tell the history of the city. Rather than trying to provide a straight narrative of the city from 1636 to the present in the course a semester, he focuses on the main themes of urban history--sanitation, public health, transportation, commerce, and politics--and traces their development through the years. You definitely benefit from going to lectures, where you hear not only about the day's topic but all of the random facts that Professor Jackson knows about the city. There's a reason he's the authority on New York City, he knows it all. Professor Jackson is incredibly busy, but he still makes time for his students--leading some walking tours himself and replying to students' emails. Don't miss this class!\nWorkload:\nNot to bad. Midterm, final, and short paper.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "February 16, 2002",
            "review_content": "\nThe criticisms of the class are too harsh. Although the reading workload was rather heavy, most of it complimented Jackson's lectures very well. Jackson's concentration on the facts, as well as discussion and readings on multiple theories, allows and requires students to decide on their own which of the many complicated fact-driven urban theories they will subscribe to. It is true that Jackson often lectured more by subject than chronology, but most of the major deviations were clearly as a result of his trying to accomodate the events of September 11th, so that we got to hear about related subject areas in September, rather than having to wait until December. Regarding his interruption of Carol Willis - SHE was a terrible lecturer who simply regurgitated, verbatum, what was said in her highly illustrated book (whose premise can be summarized in about two sentences). I was more embarassed for her when she bitched out the TA's for not operating the slides to her liking and relieved when Jackson tried to straighten her out in his gentile southern manner. Bottom line: you get to take field trips to baseball games and ride around the city on a bike and still actually learn alot.\nWorkload:\nHeavy if you do all the reading (a must to get the most out of the class). Paper is easy. Midterm and final range from easy to excruciating depending on your TA (the class' most serious flaw). Field Trip boost is nice, but expensive in time and money (although Jackson does offer to accomodate those with financial concerns)\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "February 07, 2002",
            "review_content": "\nAfter reading all the CULPA reviews, it was pretty obvious that someone needed to defend the guy. Yes, his lectures were massively disorganized. Yes, he didn't get through his syllabus. And yes, the workload was a bitch. But last semester was something totally different for Jackson, the man wears his love for this city on his sleeve and it was probably the worst semester he's ever had. He's got a tremendous love for the subject and you do learn a lot about the city, but it's not a class that goes chronologically--because that's not New York. Instead, Jackson takes you into the subways and sewers and immigrant neighborhoods, because to him that's where the city is, that's where the important elements are. The readings are often unrelated to the lectures, but sometimes they worked well in tandem. He does know more about New York than anyone else and he seemed rather free and open to questions. I never found his demeanor in class \"puerile,\" as other reviewers have put it. He was, for the most part, a funny, interesting lecturer who strung together the history of New York through anecdotes, something that worked a heck of a lot better than straight political history. And to respond to those who saw him as an egotistical prick, Jackson most days seemed utterly the opposite of that. He did refer to the NYHS a bit too much, and yes, he did refer to Crabgrass a lot. But he really did love teaching, especially when he was out on a walking tour, he loved being around the city with students and it showed. Jackson wasn't great, but it was pretty obvious something knocked him off his game in 2001. Maybe it wasn't his fault that he taught the History of the City of New York a bit differently.\nWorkload:\nHeavy, heavy readings, some very good, others serviceable at best. If you work for Community Impact, no paper. The midterm and final come with heavy warnings: the questions seem out of the blue and the grading is fierce.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 28, 2002",
            "review_content": "\nThere are several professors at Columbia whose reputations as teachers are vastly overexaggerated. Ken Jackson's reputation is the most overexaggerated of all. I took this class because (A) I'm a History concentrator and (B) I thought it would be interesting to learn a bit more about the city I live in. I learned very little in this class despite attending all the lectures and doing (most of) the reading. Jackson's lectures were not in any kind of chronological order (we might learn about skyscrapers one day and the Dutch the next) and were completely lacking in organization. I can honestly say that I learned more about 19th-century New York from reading THE AGE OF INNOCENCE in high school than from taking this class.\nWorkload:\nMidterm, final, joke paper. Don't even think about reading all of THE POWER BROKER (1,200 page monster Jackson assgins about the career of Robert Moses)--just cull a few of Robert Caro's criticisms of Moses for the final. Nobody will know the difference.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 27, 2002",
            "review_content": "\nI was incredibly disappointed in this class, perhaps because Jackson's reputation was so great and I had high expectations. Jackson has his lectures memorized and can talk endlessly in front of a mirror, not caring about what he's actually saying or relating to his students (aka audience). He once gave the same exact lecture twice, weeks apart. He skipped class a few times and babysat us with documentaries where he was of course the key speaker---giving once again the same lectures that he'd given in class repeatedly. It's definitely not an easy class like people think in advance---perhaps it was just this semester that he wasn't so interested because now he is president of the Historical Society. Also, he uses classes to stroke his ego, as he knows how much people love him as a professor and how difficult it is to get into his class, and he [CULPA CENSOR] likes it when his students applaud him after every single class and his ten minute standing ovation at the end of the semester. It would sound from that that he is a loved professor, but i know of very many students in the class who really hated him and the class---but perhaps they just aren't culpa writers.\nWorkload:\nA LOT of work... A lot of walking tours that are very interesting but expensive and time-consuming. A paper that is based on either heavy microfiche researching OR a community service project that is FIVE hours a week or an internship for the Historical Society for TEN hours a week. Also a hard-as-fuck midterm and final based on a hell of a lot of reading. HOWEVER if you are pass/failing the class, then he'll let you get out of the final if you get a B on the midterm (or do a lot of extra field trips for extra credit) and do the paper---though they probably won't even read the paper if you're pass/failing, so then it's not too bad. But getting the B on the midterm can be hard....\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 23, 2002",
            "review_content": "\nGranted, his book Crabgrass Frontier was a landmark, his Encyclopedia of New York City is fantastic, and if you read the Times (or either of the tabloids) you're bound to read a glib, entertaining quotation attributed to him. BUT - this man should not be teaching! Ken Jackson needs to brush up on how an adult acts in public: the more embarassing episodes are already described above. He needs to realize that a professor serves students, not vice versa, and make himself at least somewhat available and attentive to students (If you ever want to see a rat's nest, go to his office, if you can track him down - the office is symptomatic of how he runs the class). He needs to actually place facts in his lectures, which are completely off the subject, simplistic, have little to do with the exams, and, despite the myth, are not entertaining but rather frustrating. The field trips are a mixed bag -- in general, I can't stress enough how disorganized the class is, and the uber-haphazard administration of field trips is a key example. The Bike Ride is transcendent - but if you don't draw attention to yourself, you can tag along, even if you're not in the class. Don't worry. He won't recognize you. Once again, DON'T BE FOOLED!!!\nWorkload:\nThe reading assigned is ridiculous in size and will never be discussed. Grading is completely dependent on which TA you have. Mine was unfriendly and absolutely ridiculous about grading. Toss the dice and pray.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 12, 2002",
            "review_content": "\nHe loves to talk about the horse poop problem in NYC and that is what this class is...horse poop. He is so busy trying to remind his students that he is president of the NY historical society (and therefore is being generous by teaching us with his precious time) or that he has a huge front lawn out in westchester, (which means in his bible of crabgrass that he is a rich mofo) that he actually repeated a lecture once! .... [CULPA CENSOR].... This man is a story teller who without a doubt is \"the man\" when it comes to nyc facts...but that is about it. I would have rather put my time into another class where I actually may have felt my brain being stimulated. Depending on your TA the midterm or final can be a biznitch, but have no fear: If you do over the required class trips you can bump your grade up a whole grade.\nWorkload:\nMidterm, final, joke paper and field trips can be pretty cool and informative. a ton of reading... listen to the TA for the key books\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 06, 2002",
            "review_content": "\n\nWorkload:\nMidterm and final--the latter is difficult but graded leniently. Choice between an internship, a paper surveying three editions of the NYTimes, or some other bizarre things, including writing your own walking tour. Field trips (and although he says the all-night ride doesn`t count, he later changes his mind and rewards the faithful with two trips for their effort).\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "November 27, 2001",
            "review_content": "\nThis course wasn't the most inspiring, insightful, or educational I've taken at Columbia, but then again, no one should expect it to be. It is what it is touted to be -- a fun class about an interesting subject. Jackson is a great lecturer. If you're looking for lectures jam-packed with facts, this isn't for you. But if you're just looking to have a good time with the added bonus of learning about horse-poop, this is a great class. He is funny and irreverent, very rah-rah-New York, sometimes offensive, but always in good humor. The class is ridiculously easy -- the midterm is a piece of cake, the required field trips are a pain, but sometimes interesting, and the TAs are pretty good. Definitely take it for a good time, but not if you're rigid in your definition of what a good class should be.\nWorkload:\nA lot of reading (can be done selectively), an easy midterm, a short paper, final, 7 pesky field trips.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "November 14, 2001",
            "review_content": "\nKen Jackson seems to believe that simply walking up and down the aisles in Oprah fashion constitutes exciting teaching. His lectures lack structure and insight, and they follow no perceptible order. In my opinion, he clearly has done nothing in particular to prepare every day. More than a few times, he has not come to class at all, preferring instead to have his TAs show banal documentaries. If you enjoy television a great deal, Jackson's your man. For a professor who bears such a reputation for oratory, he is also surprisingly glib (and I don't simply mean that he's Southern). My favorite quotation thus far is: \"The British brought the Hessians with them to New York. Hessians are Germans with big boots and big hats.\" That's Ken Jackson in a nut shell. My favorite classes have been when Jackson has not spoken. Two guest lecturers--one on public health and another on skyscrapers--were erudite and engrossing. During the second lecture, however, Jackson's behavior was disgraceful. His GUEST stood up on the stage in front of 400 eager students speaking to slides. The esteemed Professor Jackson manned the projector operator and proceeded to skip through her slides without her prompting in an effort to speed her up. He would literally switch them while she was in mid-sentence, which kept throwing her off. It would have been no different if he had simply ripped a page of lecture notes from her hands at random intervals. At one point, she actually said to him: \"I WILL NOT go faster because you keep switching the slides.\" He just smirked at her. I was embarrassed to have witnessed the spectacle. As for the bike trip, it's a wonderful experience. Then again, despite Jackson's assertions to the contrary, you can participate without being enrolled in the class. Several people I know did so this year. History of the City of New York has been a terrible disappointment.\nWorkload:\nA few dictionary entries per class. One ridiculous 1200 page reading. I'd recommend several of the books for outside reading, particularly Jane Jacobs' The Death and Life of Great American Cities.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "November 14, 2001",
            "review_content": "\nUnscholarly, uninformative, and aimed at the lowest common denominator, Ken JacksonÂ’s lectures resemble high school pep rallies more than a class on the history of New York City. Â“ProfessorÂ” JacksonÂ’s ramblings cause one to wonder whether he ever earned a history degree. In one class, and I quote verbatim, he proclaimed, Â“I donÂ’t believe in theories, just facts.Â” He seems incapable of responding to questions with at least a bare minimum of insight or intelligence: his responses are either facile or donÂ’t answer the question. When asked whether he thought that the September 11 tragedy could lead to anti-Arab sentiment and violence in New York, he responded, Â“No, because that would be un-American.Â” His lectures are usually devoid of anything but superficial content. On one occasion he took 25 minutes to explain that City Central Placement Theory means that barring any geographical aberrations, cities develop in the center of a perfectly circular landmass. Jackson can also be exceptionally rude, even to guest lecturers. When Carol Willis, Director of the Skyscraper Museum, spoke last week, he would not allow her to finish making points about individual slides. He took control of the slide projector, and before she had finished a sentence about an image, he would advance the carousel to the next slide in order to make her go faster. At one point she interrupted her lecture to ask him to stop. He continued anyway, although thereafter he wore a boyish smirk. Under any circumstances, this puerile behavior is unacceptable. But it was especially egregious in light of the fact that she was already providing more compelling analysis and interesting information, at a faster rate, than he ever does. By the end she was frantic and clearly very frustrated. Although many of the readings are interesting, and the midnight bike-ride is fun, donÂ’t waste your time with this class. You can read and ride on your own.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 31, 1999",
            "review_content": "\nThis class is way overrated. I can think of many other history classes that are more worth your while. However, if you're the slacker type, this is the class to take. Reading is a joke, the paper is a joke, and you go on fieldtrips. Be warned: Grading all depends on which TA you get.\nWorkload:\nmandatory field trips, light reading, midterm, final, paper.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 31, 1999",
            "review_content": "\nNot as good a course as you hear it is. It might be worth taking, though, just to get you to read a few of the better books (like Robert Caro's book on Robert Moses). And of course, the bike trips around New York are legendary.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 31, 1999",
            "review_content": "\nHe drives a red sports car and keeps an apartment on the Upper West Side, as well as a house in Westchester. It's all paid for by his landmark books, which make for a good read. He's the authority on all things New York City, the rise of the suburbs, and car culture. The lectures are interesting if a bit haphazard--his passion for a particular topic sometimes requires that he gloss over other important subjects. The required walking tours could be more informative, but are enjoyable since they often end up at places like Katz's Delicatessen or Yankee Stadium during a pennant race. Avoid the walking tours by Joyce Gold. The reading is voluminous, but much of it is interesting stuff vital to a solid understanding of cities and politics.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 31, 1999",
            "review_content": "\nI'm not a history major, but I enjoyed this class. There's really not much work at all, so all you really have to do is show up to lecture once in a while. The class is so big that you can take it with a bunch of friends and just have fun with it.\n"
        }
    ]
}