{
    "prof_info": [
        {
            "prof_name": "Konstantina Zanou",
            "prof_id": 13273,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 14, 2016",
            "review_content": "\nA few very strange things have happened in this class which have prompted me to write this review. I will try to do my best to give as much of an objective account as I possibly can. I will address Konstanina Zanou as Konstantina because that is what she has asked us to call her in class. It is not meant out of disrespect. As for the quotations, I am doing my absolute best to be faithful to her actual wording, but my memory isn't perfect.\nI. Very Personal Approach\nThe thing that strikes me most is Konstantina's incredibly personal approach to teaching. This, for the first few weeks, seemed amusing and perhaps even nice - but as time went on, it developed into something rather uncomfortable. \nShe often makes personal remarks about students in front of other students (half jokingly, half not), such as telling someone that it's okay that they didn't do well on the first paper because there are other ones, or that such and such needs to prioritize school over sports, or that \"the blondes aren't participating\", etc.\nAlso, she organized a few out-of-class trips (I think with the best intentions) and (as far as I could tell) didn't realize that most of the students didn't want to stay for dinner with her after one such event (they had to pay for their own dinner but felt uncomfortable saying no to her invitation).\nShe tells many personal anecdotes in class, which are (I have to admit) amusing in a shocking sort of way. She told us about her ex-lover who she met after many years of being apart and who, she had hoped, might still be suitable for her and then, after a summer together, it turned out that he \"was stupid!\" The point of this anecdote was to explain the way nostalgia alters our recollections.\nDuring that same discussion she asked the students to share personal stories. When people didn't want to share (because they felt uncomfortable), she assumed that we had never experienced nostalgia (inaccurately reading the vibe of the classroom).\nShe showed us an X rated film (Dionysus in '69) in class without much context, which lead to an uncomfortable viewing experience and an even more uncomfortable discussion afterwards (to make it clear - I am not against showing X rated films in class, but there needs to be some sort of contextualization so that the class understands WHY the film is being watched and feels comfortable talking about it afterwards). The film was intended to be sexually arousing (it was based on the Bacchae) and watching it with Konstantina in the room was - I use the word AGAIN - uncomfortable.\nShe seems to believe that she can read other people (I hazard to guess it might be her acting background), which means that she sometimes psychoanalyzes her students. She told one girl that she reminded her of herself in many ways and then told her that she had a mental breakdown in her 20s and doesn't want this girl to experience the same thing (a conclusion she reached based on very little in-class interaction). I only give one example because I don't want to share stories online that other students might not want shared. This is not the only time she has done something like that, however.\nShe told us that she wants the class to feel \"more like a book-club discussion with friends\" rather than a seminar, partly because she was reading many of the texts for the first time in English or at all.\nII. Requirements for Papers/Exams\nInstead of writing in my own words, I will copy paste a few of her requirements below. These are direct quotes from her assignment sheet:\n\"Simple, clear sentences with neat, appropriate terms are better than convoluted sentences and pompous phrases. Your sentences should not be more than 2 lines long.\" (she grades down if they are longer than 3 lines)\n\"Don’t psychoanalyze. I am not interested in claims along the lines of 'Because Achilleus is childish and attached to Patroklos, he refuses to participate in battle.' Characters are not real people with psyches. They are fictional depictions, crafted by an author or multiple authors. All you have access to is the words on the page that actually describe them. Do not speculate. Analyze what we do have access to.\"\n\"In the first paragraph of your paper (Introduction) you should state what your thesis statement (=argument) is and be crystal clear about it. I should have no doubt after your first paragraph as to what exactly you will be arguing in your paper. A good way to do this is to signpost (“I argue first that ... subsequently turning to.... in order to show...”). All paragraphs and observations should relate to this central thesis statement. A cluster of unrelated or only vaguely-related observations about a topic, however brilliant, does not a paper make. Everything you say should contribute to a single argument.\"\nThat last quotation is crucial - because it seems reasonable enough on its own, but Konstantina also expects the students to include all of the material discussed in class that is relevant to her prompt. In other words, when one student decided to write about \"the animals in Homer\" and didn't include the horses in his argument (because the horses were an animal that was not relevant to his argument), he was told that that sort of omission was unpardonable because \"horses are animals too!\" So, if we are to include all of the material discussed in class, then it is incredibly hard (perhaps impossible) to write a cohesive paper with a clear thesis (unless the thesis is rather broad and more of a summation than an argument).\nAll of these requirements are easy to follow once you understand what she wants, so it is not hard to get decent grades as long as you are able to tailor your writing to her expectations (which may feel, at times, like it is making your paper worse).\nAs for the midterms, she grades based on class discussion. After the test, she told us that she \"didn't take away points for additional information if it was correct\" which translates to: \"I only gave credit for the things we explicitly said in class\". Several students did quite poorly on the midterm because they gave their own interpretations of the text thinking that Konstantina wanted to see original thought rather than the things we have already discussed. She said that she grades this way because \"how else would [she] be able to grade them?\"\nIII. Just started teaching at Columbia and it shows\nThis is more of a minor point, but if you are placed in a Lit Hum class soon after Fall 2016, realize that Fall 2016 was her first time ever teaching at Columbia (not only Lit Hum, but any class in general).\nConclusion:\nThis is, undoubtedly, a negative review. I tried my best to remain \"objective\" (whatever that may mean) and give facts rather than personal opinions - although I included personal opinions in parentheses when I thought some sort of explanation was necessary.\nTake my opinion with a grain of salt, but also recognize that if you take Lit Hum with Konstantina it will not be your average Lit Hum experience. Whether that is a good or bad thing, you will have to decide for yourself.\nWorkload:\napproximately 100 pages of reading per class + three papers (first semester)\n"
        }
    ]
}