{
    "prof_info": [
        {
            "prof_name": "Tobias Myers",
            "prof_id": 7839,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 28, 2012",
            "review_content": "\n--First things first, I had this class at 9am and I am not a morning person at all. I could have switched classes at the semester, but chose not to, in order to stay with Prof. Myers. If you read no further, consider that.--\nI quite liked Prof. Myers as my Lit Hum instructor. It might be telling that it kind of feels weird every time I actually type \"Prof. Myers\"--he, and his class, are laid back in that sense, but at the same time I just didn't really call him anything, I always just approached him and started talking. I can't even remember if he did the stereotypical write-name-on-chalkboard-introduction thing at any point. Also, he's technically not a professor (yet?). No matter. \nPoint is, he's super approachable, and won't ever get in your face. For some people, this is the perfect combination for a core class. He will cater to your every inquiry, provided that you actually bring it up or go to office hours. For many freshman at Columbia, this can be an intimidating prospect, especially considering Prof. Myers' vast and readily apparent knowledge of the material and his slightly more reserved style. But go anyway! He's super approachable. \nThat being said, there's a clear sense of responsibility in this class. If you approach him in want of an extension or help with a text, you better have actually put a morsel of genuine thought into your proposal. I don't mean to say that he'll mad dog you if you don't--far from it. He's always very polite and looking out for the interests of his students. But don't expect to fool him by showing up to office hours and expecting to be given \"answers\" or making specious comments in class to pad your participation grade.\nIn my opinion, this, combined with his ever-open attitude toward student responses, resulted in a somewhat strange, restrained classroom environment where everyone felt compelled to make the most profound statement ever (But then again that kind of thing is common at Columbia). He was totally interested in honing our analytical and reading skills, and sometimes I think that came at the expense of actually being familiar with some of the material. Students are naturally going to really focus on some texts and skim over others, so it's natural that we really do want to know (at bare minimum) appropriate cocktail party lip service about each text. I'm not sure if I know that for all of them.\nIdeally, I would have liked for him to construct a bit more of an introductory premise to the texts. I think that might have preempted some of the slightly lingering after-question silences too. Also, I would have liked him to shut down the pompous always-slouching kid that joined our class at the semester, but he was too nice. Alas.\nWorkload:\nStandard for Lit Hum. Occasional one-page assignments that are not always graded. Ample opportunities for creative projects, if that's your thing. I always freaked out about the midterms and finals, even as I flipped through them for the first time, but I always ended up doing pretty well on them. He grades well.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 26, 2012",
            "review_content": "\nProfessor Meyers is amazing. He's a funny, understanding, kind, and helpful guy. He is strongly invested in students and their literary growth. As stated before, he's always makes himself available and gives more than enough feedback so that you have something to go off of. He encourages discussion in a way that's enjoyable.\nAlso, before each class, you're given a class preparation sheet so that you'll have a guide for where to focus your reading. This is extremely helpful considering the amount of text we have to read sometimes. It's also helpful when studying for midterms and finals.\nAs for the difficulty of the midterm (made up by Professor Meyers), it's not that hard if you take his study advice, do the readings, and participate in discussions. He's a fair grader, and is always doing his best to get us the highest grade possible. The final isn't made by him, but he grades fairly.\nWorkload:\n20% midterm\n20% first paper\n20% second paper\n20% final\n20% class contribution (attendance, participation, short assignments)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 10, 2011",
            "review_content": "\nTobias is certainly an intriguing character. I cannot say I enjoyed his class 100% of the time, and I do not think the discussions were comprehensive enough to grasp the true character of Lit hum. Nevertheless, Tobias unequivocally deserves a silver nugget, especially considering his unwavering engagement with the students' welfare and the development of our literary minds. Although I thought his grading of the papers focused a bit too much on the \"writing\" criteria, he will certainly guide you towards a better direction in writing a well-rounded Lit Hum paper. His mellow character and extremely kind disposition will draw you closer to this professor as the semester continues. Be prepared for the exams however, they are not easy.\nWorkload:\n2 papers a semester (free topics), midterm, final, very very few written assignments here and there.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 04, 2011",
            "review_content": "\nI have to say Tobias is easily one of my favorite First Year professors. He's brilliant, of course, but what makes him truly exceptional is just how much attention he's willing to devote to you individually. He encourages us to meet with him after giving us back our papers, and writes many, many comments so you'll always have a general idea of how to improve. He isn't the easiest grader but not a super hard one either. If you talk to him and get an idea of what he's looking for, you'll be able to do well in the class.\nHe never makes you feel stupid, even if you make subpar reflections.Instead, he'll comment on what you've said, and help you complicate your thoughts with his responses. That being said, he takes great caution so as not to influence you with his viewpoint, and encourages you to develop your own perspective. He warns you against reading online analyses/introductions to texts, asserting that each of your individual opinions can be just as if not more valuable than the interpretations of others. \nHe's made me love discussing literature and even improved the way I read. \nWorkload:\nProbably the same as every other Lit Hum class, though he's willing to listen if you really cannot make a paper in on time. He assigns readings in smaller chunks when possible-I had a lot more time to read most of the novels than my other friends in their respective Lit Hum classes.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 20, 2011",
            "review_content": "\nI agree pretty much with everything said in the previous review. Just wanted to point out that the final is only 20% - 15% is for participation.\nAlso Tobias is super-smart, a great teacher and a nice guy so if you get the choice, take his class.\nThe first semester of the class is probably a bit more fun than the second but that's probably owing to the fact that Tobias is classics guy so he really knows his Homer and like.\nWorkload:\nOnly two ~6 page papers outside of the readings. Readings can be long but they're pretty much the same for every section. Midterm and final are easy if you've been doing the readings and staying awake in discussion.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 17, 2010",
            "review_content": "\nTobias is a stand-up guy. He is incredibly mellow, which is fitting as he teaches some of the earliest sections of Lit Hum. Though he is a classicist by trade, he is well-read enough to intelligently guide classroom discussions in second semester and provide appropriate context for all of the readings. He's not a particularly harsh grader, so long as you make an effort to read his feedback on essays and incorporate his modifications into future drafts (these won't be controversial, they'll be more along the lines of appropriately arguing a thesis). If you stay on top of the reading, which can be a bit much at times, you'll do absolutely fine in his section. I recommend staying in this course if you can survive the early mornings (if you are in his class that means that you probably wound up with a nine o'clock start time). Try not to regurgitate Wikipedia or Sparknotes during class discussions. Though he'll never call you out for it, he is able to distinguish who did the reading and who did not. I really enjoyed the class; The texts are good springboards into meaningful discussions and Tobias masterfully keeps the class awake (much more difficult than one would think at nine o'clock).\nWorkload:\nReadings-Vary depending on the length of the work. Expect them to take the average student about two or three hours and plan accordingly.\nMidterm (25%)-Very easy if you've paid attention in class. ID's, a close reading, and an essay question. You will definitely have discussed all of the passages/prompts on the finals before, so take notes, if you need that sort of thing to remember the semester's discussions.\nEssays (one 20%, one 25%)-Charitably graded. You'll usually get four different prompts from which you can work, though if you have some sort of insight that doesn't fit into any of those categories you can just clear it with him. As long as you are coherent, rigorous in your exegesis, and avoid making sweeping generalizations, you will be eligible for an A grade.\nFinal (30%)-Never saw a graded one, so I don't know exactly how his grading on this compares to the others, though I have no reason to think that it is any different. So long as you study and don't completely screw the pooch on the final, it won't hurt your final grade. Just study the review sheet he gives you and look over the ones your friends got from their teachers (assuming they don't have Tobias as well). Don't lose sleep over the test.\n"
        }
    ]
}