{
    "prof_info": [
        {
            "prof_name": "Jon Carter",
            "prof_id": 2280,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Taboo and Transgression",
            "review_date": "May 15, 2005",
            "review_content": "\nWithout Jon, Taussig's lectures would be like mud.  However, the super-combo of Carter and Taussig makes for some very exciting anthropology.  Carter is extremely open-minded and encourages experimental yet rigorous writing.  In addition, his discussion sessions reveal a breadth of knowledge.  Discussions always illuminated the texts and even extended to other interesting related topics.  This guy's a real scholar in the least stuffy sense of the word.  However, please remember that this is anthropology, not history, so rather than search for facts, just relish in the possibilities of representation and interpretation.  Enjoy!\nWorkload:\nRead.  Write 5 short essays.  Participate in discussion.  No problem.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 17, 2005",
            "review_content": "\nJon's really great. He is flexible and willing to help you out until you can understand the material and get somewthing out of it. His discussion sections were lively and interesting even iof sometimes off topic, but htat is part of the charm of that class.\nWorkload:\nmoderate\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 09, 2004",
            "review_content": "\nJon is the best TA I've ever had.  Hes intelligent, insightful, and creative when it comes to leading recitation and putting out ideas.  He can lucidly explain even the most obscure of Taussig's ideas and he puts thought and care into commenting on papers.  He is very generous with deadlines and extensions, and would rather you turn in a good paper a few days late than a crappy one on the day its due.  You can tell he really cares about his students and wants us to do well and understand the texts and ideas put forth in class.  I have absolutely no complaints about Jon: recitation was always fun and interesting, very informal and ran more like a group discussion than a teaching session, yet it was nevertheless always very helpful.  He's a fair grader, gives good feedback, and is always available outside class.  He's also the head TA for Taussig and section with him will make you want to be an anthro major.  \nWorkload:\nsix 3-page papers which require a lot of effort and thoughful writing, but are very interesting and can be as unstructured as you want, so you feel youre not writing for a class but writing for yourself.   Best paper topics ever.  \n"
        }
    ]
}