{
    "prof_info": [
        {
            "prof_name": "Mark  Mulder",
            "prof_id": 12749,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Archaeology and Africa",
            "review_date": "December 15, 2013",
            "review_content": "\nThis course was one of the worst classes I have ever taken - if not the very worst class . I don't know why everyone before me is being so positive on Zoe. She's very sweet and loves the subject, but her lectures are incredibly disorganized. I have no idea what I was supposed to get out of the class about African archaeology, other than the general theme of white people sucking, which the TAs shoved down our throats repeatedly. \nBecause of this emphasis, it felt like we never actually talked about African archaeology - just the Western gaze. One student late in the semester asked that we move on, take the western framing as a known fact and actually talk about Africa. Nope. TA Natasha shot her down, implying that our class was too dumb to get that point so we'd be addressing it as we had for the rest of the semester, i.e. talking about this and only this. Someone raised a point about this perpetuating stereotypes, and Natasha then said it wasn't archaeology's job to do anything, but rather to critique, since it's academic. \nWell, I won't go into this here, but archaeology has a huge political and cultural impact. Ignoring that is 1) ignorant and 2) extremely harmful when racially-charged comments are tolerated (i.e. treated as acceptable in class). TA Mark wasn't much better, also on more than one occasion pointing out the inferior minds of the students in our class. How is that helpful in any way? And if we're so  dumb, please teach us! Neither TA provided comments or criticisms on anything turned in.\nAssignments were vague. Readings were dense and had nothing to do with lecture. The TAs were condescending and sometimes flat out offensive. Zoe didn't do much to address racially-charged comments made in class, which I think creates a very bad environment and promotes closed-mindedness by not calling it out.\nTLDR: Do not take this class. It's a waste of your time. \nWorkload:\n2 short papers (responses to readings, attend 2 sections discussions along these lines)\n1 midterm - 10 page paper on an object\n2 map quizzes (TA Natasha managed to be condescending about this, too, regarding us not being able to handle the second one)\n1 final - no idea what to expect since I feel like a lot of random info was thrown out at us, but the exam is supposed to be thematic\n"
        }
    ]
}