{
    "prof_info": [
        {
            "prof_name": "Deborah Steiner",
            "prof_id": 1232,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Selections from Homer",
            "review_date": "May 24, 2013",
            "review_content": "\nSteiner is quite intimidating at first and runs a pretty no-nonsense class, but in the end she's really rather chill :) She genuinely wants to give you the best grade she can--you can fuck up a few quizzes (and even the midterm..!) and still end up with an A if you improve throughout the semester and are consistent with your reading/translations/participation. On the other hand, since she assigns final grades impressionistically rather than using a strict breakdown of quizzes/exams/recitations/etc., you really have no idea where you stand until the end of the semester. \nAnother nice thing about her is that if you don't volunteer to translate, she will not call on you and force you to do it. So it's not the end of the world if you don't quite get through the reading before class. Which is not to say that you're fooling her or anyone else by staring intently at your book to avoid her eye contact, but at least she won't call you out on it in class.\nShe also absolutely knows her stuff and likes to go on really long, interesting tangents about myth or Homeric reception. Yay!\nSimone is really nice. She seems new and nervous, but she's willing to go above and beyond to help students out. Friday morning sessions on Homeric grammar are rough in the best of circumstances, but she did her best and made us some killer handouts. \nWorkload:\nAround 150+ lines per week (not turned in). Weekly quizzes with translation and grammar questions. A midterm and a final, each covering half a semester's worth of text (fairly brutal). Small recitation (first 10 lines of the Iliad, no big deal). \n"
        },
        {
            "course_name": "Augustan Poetry",
            "review_date": "January 04, 2013",
            "review_content": "\nI did not enjoy this course. Looking at previous course reviews, I thought it would be mangeable, but that simply was not the case. We barely went over the translation, which I understand--this seemed to be more of a literary analysis class. I didn't like the pace or the rhythm of the class. I do admit, though, Professor Steiner is very knowledgeable.\nBut, this course needs some serious restructuring. And by the way, everyone in the class is at a different level of experience. Yet, it was assumed that we knew how to, for example, write a close analysis--something I did okay in--but would it not have been helpful just to go over the basics for 15 min? That was something that could have benefited everyone. Also, the translation is a lot. Keep up, or you'll be lost. \nEvery week you are expected to know 300 lines in total. It is expected that you know your vocab, grammar, scansion, etc, but you never get tested on it or go over it in class. Ultimately, I did fine, but this was my least favorite class out of all the classes I have taken. Honestly, it's put me off from taking another Latin class again. \nWorkload:\nWe looked at Virgil's Aeneid, Books 1, 7, 12. \nWe did not have time to read Horace's Odes\n300+ lines of translation per week. (150 lines per assignment)\n1 midterm-- translation 20-ish lines, and a close reading of 20 ish lines\n1 essay--a close analysis of a passage not done in class\n1 final--translation of 20-ish lines, close reading 20 ish lines, and prepared essay that counts for 50% of the final \nNB: you do have a choice between passages for the close analysis and the translation. \n\n"
        },
        {
            "course_name": "Augustan Poetry",
            "review_date": "October 31, 2012",
            "review_content": "\nI've got to admit, I've been pretty underwhelmed by my professors this first semester, but hands down, Professor Steiner is the absolute best and my favorite professor! \nHer impressive knowledge of both latin and greek make this class incredibly engaging. And she has great sense of humour! In high school I'd gotten a chance to translate the Aeneid but I'd never gotten such a rich understanding of the language and its allusive and historical qualities as I have this semester. Professor Steiner has truly made Latin a pleasure to continue studying and I hope to take another one of her classes in the future. \nWorkload:\nIt's manageable though you don't want to make my mistake and fall 300 lines behind cus the course is fast-paced. You translate Book 1 and Book 7 of the Aeneid for the midterm and write a 5 paged paper, and then translate Book 12 and a couple of Horace's odes. \n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "December 31, 2010",
            "review_content": "\nWonderful class. I am a first year engineering student who was absolutely terrified of joining this class. Interested in the material, but worried about the difficulty of the class based on previous reviewers. But grading was extremely lenient, and I got an A. That is not to say, however, that the class was a breeze. We covered a large amount of literature over the semester, all of which had to be known for the exams. \nThe way that the class worked was that every lecture was split in half, covering a certain mythological character. For the first half, Professor Steiner would talk about the literary portrayals of the character/family, then Professor De Angelis would take over and speak about visual sources. Both professors were always well-prepared and gave very fascinating and accessible interpretations of the myths. For someone like me, with no previous knowledge of classical mythology, I was still able to grasp the lectures without a problem. \nI came out of the class feeling like I've learned so much about mythology, and still feeling like there is so much to be explored that I want to learn about classical mythology. I mean, what more is a class supposed to do?\nWorkload:\nMidterm (visual IDs, text IDs, analysis of a long passage with choice of one out of two), Paper (8-10 pages, I wrote it in one night and got an A/A-), Final (visual IDs, text IDs, essay that was prepared beforehand). for the final, we only had to study a selection of 75 visual works for the visual IDs out of 200 covered the entire semester. \n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "February 27, 2010",
            "review_content": "\nI agree with the previous reviewer. Professor Steiner is brilliant and extremely well-read, but the expectations for a 100-person lecture seemed unreasonably high. While it is important to have high standards at a school like Columbia, she seemed to expect students to be able to analyze mythology at the same level as Helene Foley or Claude Levi-Strauss. What this class did to my GPA is part of the reason I'm not a Classics major anymore :(\nThe lectures are engaging. The readings are very reasonable in length. The midterm was also reasonable, especially if you went on Courseworks and discovered that a sample midterm was embedded at the end of the uploaded syllabus. The final paper and exam totally caught me off-guard. But looking back, I'm really not sure what I could have done differently, given the a.) the time constraint and b.) the fact that this was the first time I'd ever attempted to apply structural or comparative analysis to Greek mythology. Also, a significant portion of your final grade hinges on these two things.\nIn summary, don't take this class unless you're a die-hard Classics major and you're willing to go above and beyond for the paper and final. If you're just interested in the subject matter, take it pass/fail.\nWorkload:\nWeekly readings, 1 long paper, midterm, final\n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "February 15, 2010",
            "review_content": "\nProf. Steiner has a wealth of knowledge of all things Classical. Her lectures were always interesting, because she never failed to teach things most people do not know. She is a harsh grader; she always dropped the grade the TA gave by a full letter or more. Prof. Steiner was receptive to questions and comments in class; she was particularly good at politely ending conversations that were wrong or irrelevant and engaging ones that were interesting. The lectures were generally a pleasure. The exam, on the other hand, was unfair. We were told to memorize more than two hundred pieces of Greek art only a week before the exam. Often the questions on the exam were esoteric and confusing. Compounded with her harsh grading this made it almost impossible to do well in the class. I would recommend this class to students who want to learn and don't care much what grade they end up with.\nWorkload:\nOne paper, Midterm, and Exam. All very hard and harshly graded.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 10, 2006",
            "review_content": "\n  Professor Steiner is one of the most intelligent people I've ever met---and the whole class was completely in awe of the amount of knowledge she imparted on us.  I entered the class hating the greek classics and left loving them.  She leads engaging discussions,with open-ended questions that prompt class participation, but she makes sure to clearly end each issue with her view on the point--so you are never left wondering which idea is correct.  Not only do I feel that I learned much more than many other freshman in lit hum, but I think Professor Steiner was probably one of the fairest graders.  Each night she assigned us to come up with two \"thought-provoking\" questions about each reading that we did (which could also be easily completed during the class time), and if you get a good grade on many of them, it boosts your overall average at the end considerably.  Also, she stresses the area that you do best in (for example, if you do well on the papers but mediocre on the midterm she will count the papers more).  TAKE HER CLASS!!!\nWorkload:\nusual lit hum reading, two questions with each reading (easy), 1 3-4 page paper, 1 4-5 page paper, 1 7-8 page paper, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 04, 2005",
            "review_content": "\nClearly an expert in Greek and Latin, Steiner effectively used her experience expand the in-class discussions. Though a bit intimidating at first, she is approachable if you make the effort to attend her office hours. Her help, including extensive edits of my papers before they were due, allowed me to improve my writing ability more than any other one class has in a long time. She is a bit stuck in her opinions on literature and it definitely shows. However, her stubborness forces students to sufficiently back up their assertions. Her homework assignments (2 questions we had on the reading) were a bit nebulous. But the fact that no one really knew what she was looking for didn't end up having any huge toll on the final grade. I'm definitely glad to have had her.\nWorkload:\n2 questions / class, 3 essays (5, 7, 9 pages), midterm and final (neither of which were terrible)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 02, 2005",
            "review_content": "\nVery interesting teacher...she'll give you the Greek translation for pretty much every text you read and it's actually pretty interesting to see how 1 word can have 2 translations in Greek and totally change the meaning of a sentence..or even shine a new light on the text.  She's a very fair grader - I got exactly what I expected in the class.  Her comments on essays are useful and she's always there to be \"used.\" (as she would say)  There's no pressure to participate, it will only help the grade, but don't fall asleep - she'll wake you up and it will be embarrassing. (but funny for the rest of the class haha)\nWorkload:\nThree 3-5 page papers, midterm, 8 page final paper, and a final.  Also 2 discussion questions per class on the assigned reading (it's a bit of a pain, but you get used to it and it's fine)\n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "April 07, 2003",
            "review_content": "\nI was a little surprised to see a previous reviewer call Professor Steiner \"cute,\" in reality she is a rather severe looking woman who can be a bit intimidating on first encounter.  Despite this, she is an excellent professor.  By taking this class, you will become familiar with most of the major Greek myths.  Not only will you learn the basic characters and plots, but you will also get a lot of historical, sociological and literary background.  The readings are well chosen, not impossibly long, almost all from primary sources and are generally quite interesting.  As the other reviewers have noted, Prof. Steiner seems to know an enormous amount, both about a wide variety of myths (particularly near-eastern) and the etymology of Greek words, names, places etc.  I found her interpretation of myths to be very compelling sometimes, for instance when she discussed the myth of Demeter or the Odyssey.  Other times, her interpretations were not quite as compelling, however, they were rarely totally implausible and were usually well backed up.  Furthermore, she generally encouraged questions and disagreement.  The only part of her lectures I usually didn't like was when she would sometimes try too hard to connect a particular myth to the modern world.  (For example when she spent ten or fifteen minutes during one class describing what sounded like a  dreadful, pretentious modern version of the prometheus myth.)  Overall, this class is highly recommended.\nWorkload:\nReadings are reasonable but significant.  I managed to do most, although not all, of them.  Midterm, paper, final.  Grading didn't seem to be that hard.\n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "November 07, 2002",
            "review_content": "\nA gem. Prof. Steiner is a warm, delightful, erudite teacher, the kind who evokes comments like \"She's so cute, I love her\" when she walks into class. By the second week, the class seemed infatuated and awed. But she's no lightweight. As the previous review said, she has an astounding, encyclopediac knowledge and love of myths from any culture and society. Very accomodating and unpretentious--she invites students to interrupt her lectures with comments/questions at any moment. The type of teacher who gives Ivy League schools a good name.\nWorkload:\nThe reading list may seem intimidating, but you'll find yourself WANTING to read them (although Lit Him may have soured you on \"The Odyssey\"). You can get away with doing the readings right before class, or doing them all the week before the test. Very fair midterm--if you read carefully (which is very important) and can write at a college level, you should do well, 8-10 page paper, and final.\n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "November 01, 2002",
            "review_content": "\nGreat professor. Organized lectures. Wonderful reading list. This woman knows ungodly amounts of myth from every culture ever. Relatively fair grader. Expect a B or B+.\nWorkload:\nMidterm, Final, 8-page paper.\n"
        }
    ]
}