{
    "prof_info": [
        {
            "prof_name": "Pierre Gentine",
            "prof_id": 9421,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Applied Mathematics I",
            "review_date": "December 30, 2010",
            "review_content": "\nProfessor Gentine is a strange professor. There's nothing consistent about him; you can't really call him good or bad, and you can't really call the class easy or hard. I'll just list facts.\nHe speaks English with a slight accent, which isn't a problem, but he likes to invent words. Have you ever substracted two numbers? What about multiplicate them? I can't tell if he says unicity (instead of uniqueness) because it is a real word or because he doesn't know the word uniqueness.\nClass itself is fairly dull, mostly due to the slow pace of the course, but all you need is the book anyway.\nThe weekly homework is a joke. It usually consists of 5 basic questions from the textbook. You won't find any of that \"think for yourself\" mumbo jumbo. It's all arithmetic and fundamental properties. One assignment actually had an entire question that consisted of finding the lengths of two vectors and their inner product. It gets worse: there are grad students in this class! Moreover, if he puts the assignment up late he likes to push the due date back a week. While it's nice not to spend hours slaving away at homework, this isn't helpful in the slightest.\nWith the homework in mind, you'd expect the tests to be a piece of cake, right? Nope. The tests almost exclusively deal with problems from the most recent topics (for which there hasn't yet been homework) and are about as poorly-worded as possible. On the final he insisted that he was asking us to find the determinant of a rectangular matrix. Good luck!\nWorkload:\nHomework might as well not be there. It's really just a formality to make you go to Mudd one more time every week. Tests are ridiculous - read everything in the book and do all of the problems in preparation.\n"
        }
    ]
}