{
    "prof_info": [
        {
            "prof_name": "Lois Putnam",
            "prof_id": 185,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 12, 2011",
            "review_content": "\nPutnam's class is in no way a sleeper class or slacker-friendly, but it has absolutely been one of my favorites in the department.\nEvery lecture requires your full attention. I was afraid to miss even one because of how vital her explanations are. Her slides themselves can be a little sparse at times but, personally, I think that's just to make sure people are really listening and not just assuming they can download the slides later and learn from them alone. But Putnam makes up for it in a rich, engaging lecturing style that's very aware of how her lessons (and students' understanding) are progressing. She uses illustrative examples and goes at a really great pace, making sure that you get take-away points from everything she covers and that you remember the big picture of the course. And she holds herself accountable to really admirable standards, wasting no time and no energy. If it's superfluous material, you won't find it in lectures or your reading. Even every video clip she plays is worth your attention and a few quick notes. \nI can't stress enough that for every ounce of energy that Putnam demands you to put in, she gives you back tenfold in a really rich methodology and curriculum. In that respect, the woman is no less than a force of nature. Her lectures and syllabus are meticulously designed. I don't think I've ever seen a more rigorously maintained and organized Courseworks page in my life, or had a teacher more on top of reminding you of what will be on an exam, when things are due, how much they're weighted, and the like. It sounds insignificant, but when you're juggling as much as you're asked to juggle in the class, it's something that you'll quite consciously appreciate. Even though its an undergrad intro lecture, she is, again, almost obsessed with making sure you get stuff out of being engaged with the material and the class. She makes herself and her TAs extremely available and treats the class really seriously, which is really refreshing.\nI came in with the class with a marginal (at best) interest in developmental psychology and now I'm leaving knowing so much and totally convinced that the subject area was worth my time. I have a slightly broken back, too, but it was really worth it. She reminded me how good it feels to walk away from a class feeling revitalized, not defeated by myself and my own slacking and disinterest.\nWorkload:\nThe reading and lecture material is quite a lot. There's a midterm (~30%), a final (~40%), and a bunch of take-home writing assignments (~30%) that are spread out throughout the year, and a few throw away points for regular attendance. Her exams cover a lot of material and you are expected to have a grasp on all of it, but her MC midterm/final questions aren't real brain busters. She doesn't curve those grades (or anything), but the class average is on par with what's expected. And unlike a lot of other classes, the writing assignments are not giveaways to pad your grade. If you're even just a little sloppy, she and her TAs who she's apparently trained in her vigilantic image will be all over it. If you want to get an A on them, you need to demonstrate that you understand the concept inside and out, not just rephrase textbook material. I learned that the hard way on my first few, but actually putting energy into them paid off on exams and in other long-term senses. All of her assignments are really useful and worth your time.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "September 09, 2010",
            "review_content": "\nI cannot believe this woman does not have a silver/gold nugget, she should get one just for the effort she puts in to every single class.\nI was very skeptical about this course when I came in, not being particularly interested in child development, but she made it interesting, challenging and engaging. I learnt so much from this class that I don't even know where to start.\nShe can be a little nitpicky, and expects you to put in at least as much effort as she does into preparing for the class, but you really get so much out of it.\nClearly organized, often detailed slides, interesting reading and engaging discussion.\nAs long as you pay attention in class, and skim the readings you will be fine.\nI personally loved this class, and the professor!\nWorkload:\nMidterm and Final Portfolio, Midterm and Final Exam\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 18, 2009",
            "review_content": "\nThis is not the course to take if you want an easy A. Putnam does a good job of showing you the important aspects of each reading (well those she goes over anyway) but then in the exams you are asked super specific (and often weirdly phrased and misleading) questions. She's really kind of over-enthusiastic about the subject. The portfolios you have to hand in twice during the semester are not hard at all...however they do take up some time and are require much more effort than Putnam allots them. I never want to write 10 2-page papers for 10 percent of my grade. Putnam grades the portfolio's generously but she grades the tests harshly and they are basically your grade. The multiple choice don't leave room for error and if you're not willing to sit there and memorize everything and anything then don't go. Also go to lecture because you have \"minute-papers\" after almost every class which add a few points extra credit. You also have in class essays...which aren't graded but its important to not miss more than one. \nWorkload:\nTwo midterms (which consist of mostly multiple choice and a one long short answer). A final (which consists of only multiple choice - and was based mostly on things she hadn't covered in class but were in supplementary reading). Two portfolios (each portfolio consists of 5-6 two-page papers. 2-3 are based on in class writing assignments, and 2-3 are \"response papers\" to articles you've found that relate to class material). \n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "January 04, 2009",
            "review_content": "\nI took Putnam's Intro to Developmental two years ago despite the less than stellar CULPA reports she had - what a great decision!  Putnam's lectures are always well-organized and incredibly interesting.  She's very clear about the material, and the TA's were also knowledgeable (one had taken the course previously, which was really helpful).\nWorkload:\nObviously, I really liked this course and it was NOT graded as \"nitpickily\" as previous reviewers bemoan (READ: I got my first-ever A+ at Columbia in this course).  The portfolio?  Total cinch.  You have to find a few relevant psych articles (they tell you what library database to look in), you summarize them, and if you're worried your summaries are sub-par, take them to a TA and they tell you precisely what will get you a good grade and what you are not.  You have to really try to get less than an A on this.\nExams?  Just do the reading.  It's multiple choice, it's straightforward.  If you study, you will get an A.  \nBottom line: take this course!  It's interesting and it's easy.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 24, 2006",
            "review_content": "\nThe reviews for professor Putnam are outdated, so I figured I'd write one. Putnam is very good at teaching.  It's very clear she takes her job very seriously and does everything in her power to make sure you get everything you possibly can out of the material she presents.  That being said, she expects close to perfection from her students.  Grading is incredibly difficult and nit-picky.  No extra credit is given anymore, so don't rely on that to help your grade.  No one in the class had anything positive to say about the writing portfolio, and I cannot stress this enough.  She expects a portfolio before the midterm and the final.  Both times I printed out my portfolio, it was over 25 pages in length.  Including newspaper articles you had to locate yourself and EXTREMELY detailed two page writing assignments.  Be prepared to write four pages making sure you covered every little detail she asks for and then be forced to cut every possible ounce of creativity out of the thing in order to size it down to the two pages she limits you to. She counts words and lines to make sure you don't go over the limit by a sentence.  Be prepared to get a C on the overall project, and repeat the process again a week before the final is due.  If all of this sounds like something you can handle, take the class.  Aside from the portfolios, the class is a bit irritating but interesting.  If you're a strong writer and don't mind a TON of busy work, the class might be a good fit.    \nWorkload:\nSilly 'minute papers', Midterm Portfolio, Midterm, Final Portfolio, Final.  The midterm and final are all multiple choice, but doable if you've read the book.  Grading of written work is very strict.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 14, 2006",
            "review_content": "\nShe really is a talented lecturer.  She always lays out what she is going to teach and then moves point by point.  Putnam will stop lecture for any question or comment (no matter how stupid) every time.  The readings are extensive but ABSOLUTELY NECESSARY.  What she teaches in lecture only makes up about 75% of the questions on the exam.  The rest are pulled from the readings (even if she never brought them up once).  SO READ.  Putnam DOES NOT CURVE so if you're looking for an easy way out of the science requirement, keep looking.  If you work, you will do well and come away with in depth knowledge about developmental psychology.  My main criticism of the course were the two portfolios you had to turn in.  They are graded VERY NITPICKILY (is that a word?) and are way too high school like to be called a college assignment (i.e. Find articles related to class discussion, summarize in your own words, and criticize).  They were both really pointless and time consuming.  But overall, a class I would definitely recommend for those fitting.\nWorkload:\n1 midterm, 1 final (both mostly multiple choice--not too bad if you've attended lecture and done the readings), 2 portfolios, readings.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "April 27, 2006",
            "review_content": "\nUndoubtedly, Prof. Putnam teaches a great lecture. She is also generally sweet and attentive to her students. Unfortunately, she seems to think that developmental psych really means \"make your students feel like they are three years old.\" This can be helpful, as she builds in lots of review into the lectures, or downright horrible. Case in point, the written assignments. Ten pages long, and due the week before the midterm and final, Putnam describes them as \"fun\" and \"good review.\" Worth a measly 20 percent of your grade, and subject to the full extent of her anal retentiveness, they are a huge waste of time and worthless. She actually accused us all of plagiarism on the midterm written assignment and made us all rewrite any passages we thought might be questionable. I am now trying to re-rephrase perfectly acceptable passages to fulfill this useless requirement. Is this a plot to make us all sweat? I just wish they offered this material with a different professor...\nWorkload:\nA considerable amount of reading. Multiple choice exams that are easy if you do the reading. A mind-numbing writing assignment for midterm and final subject to her obssessive rules/requirements.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 15, 2004",
            "review_content": "\nSome of the topic matter was really interesting. However, on the whole, I couldn't stand this class.  Too many lectures were devoted to too little, and there seemed to be little connection between topics such as developmental bio and speech and IQ testing.  SO SICK of writing little notecards about any questions we had about the lecture, and the writing portfolio is the BIGGEST waste of time.  The extra credit opportunity is good, and will actually teach you something.  I think that might have been the only benefit I got from this class.  All in all, if you want to learn about how children develop, and are uninterested in the bio aspect of it, take Social and Personality Development with Dweck (who is a much more talented lecturer).  Seriously think about this class before you take it, because if you get annoyed easily by professors who treat you like children (or who dote on their own children and use them as case studies WAAAAY too often) this class will just drive you nuts.\nWorkload:\nWriting Portfolio (5 in/5 out class writing assignments and 3 reaction pieces), midterm, final.  Extra credit project which is lengthy but worthwhile.  \n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 12, 2004",
            "review_content": "\nProf. Putnam herself is very nice.  She and the TA's put a lot of effort into the class, posting lecture slides and readings etc etc.  The lectures are ok (though the previous comments about Putnam talking to us like we're 10 are pretty accurate).  Writing portfolio assignment is lengthy, and lets be honest, the exams make up most of the class.  NOTE TO PEOPLE WHO HATE MULTIPLE CHOICE EXAMS: the final is 50% of the grade, the midterm 35%, and they are both almost all, if not all, multiple choice.  Oh yeah, and THERES NO CURVE.  A lot of the questions are worded rather ambiguously too.    \nWorkload:\npretty good amount of reading, writing portfolio, midterm, final, lengthy extra credit (but its worth it)\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 03, 2004",
            "review_content": "\nLois Putnam is the worst professor I have had in the entire psych department, which is my major.  It is nearly insulting the way she repeats things over and over, and don't be fooled into thinking you will enjoy this for its \"ease\"--classes are so boring you will want to cry.  Putnam seems like a nice grandmother-type, but when you approach her on your own outside of class she has little time to talk to you at all.  however there seems to be no shortage of classtime devoted to listening to lengthy tapes of her son babbling as a baby, which honestly has no educational value if you've ever heard a baby before.  This class is ridiculous, and if you would like to actually learn something you didn't already know, take a different class.\nWorkload:\nin and out of class writing assignments, which are an extreme waste of time.  midterm and final, mostly m/c.  lots of reading.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "November 18, 2003",
            "review_content": "\nI thought this course was fascinating, and Professor Putnam is not only organized and very open and friendly to students, she lectures in an engaging manner and really conveys her enthusiasm for the subject.  Well-worth it for anyone interested in the developing mind, and the kinds of factors that shape and affect brain development.\nWorkload:\nNothing grueling.  Do the readings and you'll be fine.  The professor and TAs are very helpful during office hours.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 17, 2002",
            "review_content": "\nAt first i thought it seemed interesting, and reasonable.... but pllleeeassee! the only good things this course had going for it was a) Lara Kammrath, the TA who was decidely more brilliant, and interesting than Putnam... and b) the xtra credit opportunity in which you can observe children, do an experiment, and write up a report. too much crappy stuff that is meaningless... most of the info is common sense, and the final was designed to trick you. a pitiful last-ditch ploy to avoid grade inflation when you haven't taught anything meaningful all semester.\nWorkload:\nnot too bad, really... most of the readings can be ignored, and lectures skipped... just get the notes off-line... it is a good idea to go to section, so at least you can get some particip. pts...\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 12, 2002",
            "review_content": "\nIf you're coming into this class expecting psychology, be prepared for the unexpected Â— almost the entire first half of the semester is spent dwelling on topics such as prenatal biology, genetic and teratogenic effects, etc. Post mid-term material does get better, but overall the course material alone doesn't quite save this class. Professor Putnam, though knowledgeable, treats the students in her class like elementary school children (except, of course, when it comes to work and grades). 'Take out your crayons or colored pencils' was a common command in her assignments, but luckily the TA's were slightly more lenient. Putnam's organization is also fanatical but a little uneven Â— expect to have a lot of very, very specific assignments assigned via e-mail at the last minute before discussion sections. My only suggestion regarding this class is to be careful about taking it: avoid it at all costs if you're taking it just to fulfill your science req. If you truly are fascinated with developmental psychology, you might be able to look past the course's shortcomings.\nWorkload:\nMidterm, final. Portfolio for each, which are long wastes of time.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 02, 2002",
            "review_content": "\nProfessor Putnam makes an incredible effort to get to know her students and help them succeed. She even takes pictures of them in discussion section so that she can associate names with faces. Though some students found this elementary and demeaning, I found it impressive that she cared enough. The content of the lectures and readings themselves outweighed my personal opinions of Professor Putnam, even though I liked her - the class is very engaging and interesting. The content covered in tests was fairly straightforward and light, Putnam employs a lot of repetition to help people learn, and it does. \n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "March 22, 2002",
            "review_content": "\nUnbelievable - and not in a pleasant way. Someone said she treated students like they were freshmen in high school - I think I'd go ahead and knock that down to middle school, perhaps even a nice 4th grade-ish level. The class isn't even PSYCHOLOGY until after the midterm, because it's only just before that time that you finally start looking at infants and not ova, embryos, and fetuses. Just avoid the class. If you're thinking about taking it to fulfill the science requirement, take something - anything - else. It isn't worth it, even if it can help the GPA.\nWorkload:\nMidterm, final, portfolio (collection of annoying short writing assignments throughout the year). Reading would be entirely unnecessary if not for the minimum one-question-per-reading on the midterm & final.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "March 22, 2002",
            "review_content": "\nUnbelievable - and not in a pleasant way. Someone said she treated students like they were freshmen in high school - I think I'd go ahead and knock that down to middle school, perhaps even a nice 4th grade-ish level. The class isn't even PSYCHOLOGY until after the midterm, because it's only just before that time that you finally start looking at infants and not ova, embryos, and fetuses. Just avoid the class. If you're thinking about taking it to fulfill the science requirement, take something - anything - else. It isn't worth it, even if it can help the GPA.\nWorkload:\nMidterm, final, portfolio (collection of annoying short writing assignments throughout the year). Reading would be entirely unnecessary if not for the minimum one-question-per-reading on the midterm & final.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "March 22, 2002",
            "review_content": "\nUnbelievable - and not in a pleasant way. Someone said she treated students like they were freshmen in high school - I think I'd go ahead and knock that down to middle school, perhaps even a nice 4th grade-ish level. The class isn't even PSYCHOLOGY until after the midterm, because it's only just before that time that you finally start looking at infants and not ova, embryos, and fetuses. Just avoid the class. If you're thinking about taking it to fulfill the science requirement, take something - anything - else. It isn't worth it, even if it can help the GPA.\nWorkload:\nMidterm, final, portfolio (collection of annoying short writing assignments throughout the year). Reading would be entirely unnecessary if not for the minimum one-question-per-reading on the midterm & final.\n"
        },
        {
            "course_name": "Children at Risk",
            "review_date": "December 31, 1999",
            "review_content": "\nShe seems very nice, with anecdotes about her own parenting experiences, her lectures are interesting and her use of the multi-media classroom is very good. Very strict with deadlines.\nWorkload:\n(Children at Risk:) Individual Project, Group Project, Exam, tons of work, attendance mandatory.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "December 31, 1999",
            "review_content": "\nThe worst class I have taken at Columbia. The lecture outlines that she hands out at the beginning of every class are a complete joke. They imply that she is organized and coherent, which she certainly is not. She treats her students as if they are freshman in high school, which becomes very tedious after about the first day. Avoid this class if you can, especially if you are taking it to fulfill the science requirement.\nWorkload:\nMidterm. Final. \"Portfolio\"--worthless and time consuming\n"
        }
    ]
}