{
    "prof_info": [
        {
            "prof_name": "Rebecca Young",
            "prof_id": 1312,
            "total_reviews": 22
        }
    ],
    "reviews": [
        {
            "course_name": "Women and Health",
            "review_date": "February 01, 2010",
            "review_content": "\nI expected more from this class. The topics were interesting, Becs is charasmatic and funny, but somehow, despite always completing the reading, this class left me confused. I left it with a pretty good grade but instead of feeling like I had a deeper knowledge of the many issues in women's health, I felt like I had heard a lot of terms and themes and ideas instead of a firm grasp of the material. All in all, I am glad that I took it because I had not expected to ever take a women's studies class and I do feel that some parts of the class really provided insight. I just wish it had been a little more solid. \nOtherwise:\nThe guest lecturers are great; very informative and clear and come with Powerpoints\nBecs can be somewhat disorganized but she is so great as a person\nIt was clear that most people did not do the reading on a daily basis--she once proved this to us by giving a pop quiz\nWorkload:\nToo much reading. Hardly anyone completed all of it. About 6 homework assignments; only have to do 5. Some extra credit opportunities. Poster presentation that counts as a midterm. Final w/ multiple choice and long-answer. Manageable, but kind of a lot.\n"
        },
        {
            "course_name": "Colloquium on Feminist Theory",
            "review_date": "January 26, 2009",
            "review_content": "\nAmazing, shes sharp as a tack knows exactly what shes talking about. She will probe you to be specific, not go off into whimsical theoretical generalization. Say what you mean, explain your points and your thoughts clearly. Dont be offended by this though she wont judge you harshly, she just wants to see you make sense of your own ideas and not just produce verbal diarrhea while you try to sound smart. \nWorkload:\nAmazing readings, lead one day of discussion, one midterm which is the draft of your final paper. \n"
        },
        {
            "course_name": "Discourses of Desire",
            "review_date": "May 16, 2007",
            "review_content": "\nI expected much more from this class. This rarely offered class was one of the worst I have taken in my several years here. Young  is knowledgeable in the fields of sexuality studies, feminism and women's health, but she seems to have no training in proper ways to conduct a class. When she should have lectured, she had us do useless group work with other confused students, and when she should have let us discuss things, she droned on tangentially. She expected students to fully grasp every word of the readings before lecture, and, with the assumption that we had, rarely addressed the mountains of texts in class at all. She would pull out one point of more than 100 pages of text from the week and waste the entire class asking students puzzling questions which never got to any point. On her assignments, however, she expected clear connections and references, which she did little to help us establish. \nHer TAs had no clear grading objectives and seemed to change their schema from week to week. The weekly assignments were posted late almost every week, sometimes only a few hours before a class, leaving students hanging. When assignments were actually distributed in a timely fashion, the wording made almost no sense. Both Young and her TAs avoided questions asked of assignments, as if taking offense to the idea that they weren't already clearly stated (which they weren't). The midterm assignment was a disaster; no one knew what they were even supposed to do and she never even gave out formal guidelines. Most people seemed upset at C's for what they thought were thoughtful papers.\nI could go on and on about how disappointed I was in this class, so I'll stop now. It is really unfortunate that the Women's Studies department relies so heavily on a professor who cannot come up with a simple syllabus and stick to it.  \nWorkload:\nLaughable reading loads each week (100+ pages a week, 80% of which was usually irrelevant).There was a large midterm field-trip project which did not contribute to my understanding of the material, and a final with a comprehensive study guide (though she would have served us all better if she had actually taught the material throughout the course instead). There are weekly 2 page response papers that were tedious and mostly useless, as the readings did not tie together well usually. We were allowed to skip up to 2 responses. Heavy workload considering that it was a 3 credit course and all of the material was so dense.   \n"
        },
        {
            "course_name": "Women and Health",
            "review_date": "April 14, 2007",
            "review_content": "\nThis class is a prime example of why people consider women studies to be a joke. I took this class after sitting in on 2 lectures and being impressed with Prof. Young. When I decided to take it I know IÂ’d be made fun of. I heard from almost everyone I knew - youÂ’re taking a class in the Barnard womenÂ’s studies department?! My response was, the class is a serious epidemiology class using women and their relationship to the healthcare system as a case study.\nI ATE my words. This class was a boring waste of time. There are maybe 2 lectures that have interesting material.  Everything else Â– you know or should know. There was a visiting lecture by one of the barnard deans in which we were asked Â– Â“does everyone know what DNA is?Â” I am NOT kidding. Other classes included sobbing Â– sharing your experiences psychobabble waste of my time. In one class we were told to spend 15 minutes reflecting on our 1st gynecology exam. The next 20 minutes were spent sharing different peoples stories. It is not appropriate in an academic setting to spend time like that. I guess it was good there were no guys in the class. You might be asking yourself Â– why did I go to lecture  if it was such a waste of time? Lecture is required. Prof. Young passes around a sign in sheet.\nIn terms of work and other requirements. Prof Young was so vague that nobody quite knew what was going on. When we were told we had midterm poster presentations, it wsanÂ’t until someone asked a question about where to buy the poster board that she clarified the Â“postersÂ” were actually wiki files to be made online. Not that that helped much seeing as noone had every heard of a wiki file (except having to do with wikipedia) and that didnÂ’t help clarify the assignments.\nTo be fair, some of the reading is interesting Â– if youÂ’re willing to spend the over $200 on coursebooks/packs for the class. If youÂ’re generally intelligent and donÂ’t mind the money youÂ’re spending on an education to be wasted, the class is an easy A (at least I really donÂ’t understand how anyone could not have gotten an A in the class)\n\nWorkload:\nsome homeworks, online quizzes, midterm 'poster' presentation, and final. she gives a comprehensive study guide for the final. \n"
        },
        {
            "course_name": "Women and Health",
            "review_date": "January 15, 2007",
            "review_content": "\nI thought that this class was going to be more about health problems that women experience but it was more about how their place in society impairs their health which i found really disappointing.  Also, she spends each class on a different topic so you cover so many topics superficially and then she expects you to know tem all for hte final.  the class seems a lot more intimidating than it actually is though.  I barely did anything in that class and managed to pull off an A.  She also gives a comprehensive study guide for the final with everything you need to know on it.  Overall I thought this class was really intersting but very one-sided.  She actually states in the beginning of the course that the material we will be learning is from a strictly feminist perspective so that kind of gets annoying sometimes because some of the information feels more like perspective than actual fact. \nWorkload:\nfairly light.  There is a lot of reading that you don't have to do but some of it is really interesting.  there is one poster presentation instead of a midterm which is a lot easier than people thought it would be.  she just wanted somthing really simple and i think that confused a lot of people.  the final was also not very hard.  she gave like 3 homework assignemnts that were all fairly simple and short.\n"
        },
        {
            "course_name": "Women and Health",
            "review_date": "December 22, 2006",
            "review_content": "\nThis class is a straight up intro course--it does not delve into much.  Though Becks is extremely knowledgable on HIV/AIDs, the HIV/AIDS class was her worst--she forgot her slides and forgot how to teach without them.  The material is outdated and very rooted in the 60s and 70s.  Most of the material complains about how bad things were for women's health then, how little improvement there was in the 80s, and barely gets into the 90s or 00s. Instead of establishing in the beginning that there was injustice towards women in basically all aspects of health, Becks devotes most of each lecture to repeatedly lamenting how women were gypped in treatment of each disease.\nGuest lecturers were hit and miss--Brenda Slade, Jenny Higgins and the director of the Columbia Rape Crisis Center were AMAZING--but many others were so boring I wanted to cry.  Becks doesn't attend most guest lecturs, so not only does she repeat a lot because she was unaware of what was covered, but she doesn't try to establish any cohesiveness between herself and all the guests she brings in.  You are allowed two absences, and attendance is taken every single lecture.\nWorkload:\nSix assignments (she drops your lowest), 1 website presentation in lieu of a midterm (interestng but very hard) and a final\n"
        },
        {
            "course_name": "Women and Health",
            "review_date": "May 03, 2006",
            "review_content": "\nIn this course, you focus on women's health issues and not women in health professions. She tells you exactly what's going to be on the midterm and final, so as long as you follow that, you'll be well in the course. Attendance counts, as she passes around an attendance sheet. The TAs are snotty about grading: if your answer doesn't match exactly with their answer, you'll be down-graded.\nWorkload:\nmedium midterm and final. long readings\n"
        },
        {
            "course_name": "Intro to Women's Health",
            "review_date": "January 31, 2006",
            "review_content": "\nBEWARE: although the syllabus seems really interesting, the class is EXTREMELY FRUSTRATING for many reasons. Although she gives outlines for the midterm and final, the HWs and quizes are sooo frustrating and badly worded. Even if you know the stuff backwards and forwards, you are bound to get screwed. Plus, the HWs and quizes are worth so much that your grade is still low...(she also only curves to a B-). I had to ask her for re-grades on almost everything, (where many mistakes in her grading were found each time). Also- she just sent a mass email to my entire class, because, apparently there were so many complaints about final grades that didn't seem to fit- that she had to go back and regrade everything. The subject is definately interesting (although remember it is a gender studies class, not a bio one- at all.) Overall,though, she is a nice person and makes class fun, but you have to be able to deal with all of her grading frustrations.. \n"
        },
        {
            "course_name": "Intro to Women and Health",
            "review_date": "January 20, 2006",
            "review_content": "\nThe reading list for this class is awesome and includes info any female student should know (but probably doesn't) about her body.  Prof. Young brings it tons of guest lecturers - some of whom are interesting and some not - because she recognizes that it is most interesting to hear experts in their specific fields talk about their work.  Prof. Young can be very neat to talk to, but her own lectures are often not that compelling.  I think she is so nervous about making a mistake/ being insensitive or not PC that it limits her ability to freely talk about issues to students with only limited knowledge.  Though the reading is fascinating, it is often unnecessary and doesn't tie directly into class except in the reading comprehension questions she asks.  This class is worth taking for reading material it would be hard for humanities students to find otherwise, but the lectures and small homeworks are often not rewarding.\nWorkload:\nlots of reading (that is interesting); nitty gritty homeworks that are pretty tedious\n"
        },
        {
            "course_name": "Intro to Women and Health",
            "review_date": "January 10, 2006",
            "review_content": "\nAs with many other students I have mixed reviews about professor Young. \nShe definitely knows whats shes talking about in class and is well informed about the information presented in her class. But the problem I found is that she doesn't seem to convey her information well to her students. Yes she's smart but for some reason her she has a hard time presenting all the information in her head to her students. There was also soooo much unnecessary reading like 80 pages per class that didn't even make it on the final. The class focused more on women in the health system and the different kinds of studies dealing with disease and exposure than it did with women and their health in a biological sense. The class was just boring even though she is a nice lady.\nWorkload:\n5-6 homework assignments with 2 online quizzes, with the lowest grade dropped. 1 midterm and 1 final and 1 poster presentation\n"
        },
        {
            "course_name": "Women and Health",
            "review_date": "December 06, 2005",
            "review_content": "\nI have mixed feelings about this class.. Beck Young is an amazing person - she teaches several intense classes, she's fun, she's a parent, she's writing a book, and she's done a lot of influential research.  She knows pretty much everything there is to know about women and health, in both history and current news.  But sometimes her class is kind of confusing; the questions on the homeworks aren't really straightforward, and often she just rambles, which is interesting but not always conducive to a good grade, for those who care more about grades than about learning. A lot of the readings are quite medical and a little abstruse for non-premed students, but mostly it's fascinating and relevant to your life (even if you are not a woman!).  She had several guest lecturers, who added to our knowledge and scope but I thought there were a couple too many.  She is very enthusiastic and her language is very precise; she obviously cares about her subject; but with such a wide topic it was hard to cram everything in.  There were some topics I wish she'd spent less time on and some I felt she completely ignored.  But I am definitely walking away from this class with a much better understanding of women and health and all the complex issues surrounding it.  I'm really glad I took this class, and am going to be a women's studies major largely because of it.\nWorkload:\na ton of reading that is very interesting but not necessary.  a few homeworks where you just answer some questions.  a couple online quizzes, a midterm (avg grade was a B i think) and final.  a large research project that counts for i think 20%, and we had to attend a sexual violence workshop and write a paragraph on it.  attendance is mandatory and i think she factors it into your grade.\n"
        },
        {
            "course_name": "Gender and HIV/AIDS",
            "review_date": "June 06, 2005",
            "review_content": "\nGreat class. By all means, take this class. Although she co-taught with Amanda Swarr, Rebecca Young really knows her stuff and really fosters great dialogue on extremely relevant and important topics. \nWorkload:\nWeekly readings and postings of questions to Courseworks. AIDS and activism project. Film series required for the first half of the semester. Final paper 10-12 pages. A lot of work. Entirely worth it. \n"
        },
        {
            "course_name": "Women and Health",
            "review_date": "January 19, 2005",
            "review_content": "\nThis was an incredibly interesting class with an amazing professor who was interested, dedicated, and intensely engaging. I have never felt so much passion from a teacher and I would recommend this to anyone. \nWorkload:\nPretty easy. Reading that is interesting but not necessary to do. She gives a completely detailed outline of what's going to be on the midterm and final, so it's not really necessary to do any advance reading.\n"
        },
        {
            "course_name": "Women and Health",
            "review_date": "January 01, 2005",
            "review_content": "\nI admire Professor Young as a scholar.  She is the worst professor I have ever had.  The environment of her class contradicts learning--it thwarts more of it than it stimulates.  She seems to feel insecure about the perception of the subject, Women and Health, as easy.  She addresses this insecurity by trying to make an inherently straightforward class difficult.  She concocts a grading scheme and style to ensure that the average grade is lower than it should be in order to prove to the world that Women and Health is a rigorous and challenging field.  I wish she had realized that that by enrolling in her class, students already acknowledge that the subject belongs in Academia and were there to be awakened to and excited by it--instead Professor Young turned me off to Women's Studies altogether.  Don't let her seemingly organized syllabus dupe you; the class is not well structured or thematic, it is disjointed.  Her lectures are boring.  Some of the readings are great.  If you're interested in this subject, then I recommend reading about it on your own.  The class is a waste of time.   \nWorkload:\n5 homeworks, 2 online quizes, a poster presentation, midterm, and final.  \n"
        },
        {
            "course_name": "Intro to Women's Health",
            "review_date": "December 29, 2004",
            "review_content": "\nAwesome awesome awesome class.  Professor Young is an amazing teacher, and the class itself was so interesting.  It's not all that sciency, so if you're not so into science it's great.  I looked forward to it everyday.  This was probably the most informative and relevant class I have ever taken - I feel like it should be required for all college age girls.  I recommend it to anyone, even boys.\nWorkload:\nActually a bit time consuming.  A TON of reading, and while some of it was really dense and annoying, most of it was really interesting, and when I had all the time necessary I didn't mind doing any of the reading at all.  6 homework assignments, including two online timed quizzes.  Midterm, poster presentation, and final.  Note: For some reason they wrote on the homeworks that answers should be 2-3 sentences long, but then they took points off for not being detailed enough.  So as long as your entire assignment isn't longer than a page, if you write longer answers you'll do well on the homeworks.  \n"
        },
        {
            "course_name": "Women and Health",
            "review_date": "December 29, 2004",
            "review_content": "\nThis class remained interesting to me from beginning to end. Each lecture covered a completely different topic, ranging from social disorders to straight up biology, all within the realm of women's health. The homeworks were graded a little too roughly by the TAs, and the online quizzes could get tricky, but overall if you attend lectures it is not hard to get a good grade. She delivers a study guide for midterm and final that basically spoon-feed you exactly what you need to know. Sometimes it's really nice to have your hand held. Overall, I'd recommend this class highly to anyone who is interested in gender studies from a more medical point of view.\nWorkload:\nA TON of reading that by the end you realize isn't really necessary, a few short homework assignments, 2 online quizes, a poster project and presentation, midterm and final. \n"
        },
        {
            "course_name": "Women and Health",
            "review_date": "November 16, 2004",
            "review_content": "\nI write with mixed reviews about Professor Young and about her class.  I feel like she really wanted to use this course to arm us with the information that we need to make informed decisions about healthcare as women and possibly as future doctors.  Guys should not feel like they won't find the class interesting; the class is pretty much a public health course with a focus on women and there is a teensy bit of biology.  The texts and the lectures are usually interesting.  Prof. Young has an unusually high tolerance for stupid questions and fails to tell people that asking dumb questions in class does not count as class participation.  The kind of stupidity displayed during class wouldn't have been allowed in my elementary school.  Although lectures were usually cool, the discussion sometimes made class unbearable (girls, listen up: no one wants to hear about your 158  trips to the gynecologist). The midterm actually wasn't hard, but because of nitpicky grading, people did badly even if they obviously had a good understanding of the material.   The homeworks are graded just as harshly.  The TAs are morons and if your answers don't match their answer sheet verbatim,  no points for you.   Overall, the material of the course is interesting, but I find that the grading is unnecessarily nitpicky and makes the homeworks and quizzes more of a bitch than they should be considering how easy they are.  \nWorkload:\nYoung curves around a B minus, so watch out.  She seems to be under the impression that she's a Columbia professor teaching a premed course. \n"
        },
        {
            "course_name": "Women and Health",
            "review_date": "November 11, 2004",
            "review_content": "\nPlease note:  It appears Professor Young got the memo that her class used to be the easiest class on campus.  I suggest you speak to someone who is presently taking the class, like myself, because the average on the midterm was a C+.  It's not an impossible class but she has become maticulous in her grading.  Watch out... I wanted to let you know before you add it to your Spring 2005 Program.\nWorkload:\nShe provides a study-guide for the midterm and final which is very generous, however... online quizzes and homework assignments through email/courseworks are no fun.  There is also a poster project at the end of the semester.\n"
        },
        {
            "course_name": "Intro to Women's Health",
            "review_date": "November 23, 2003",
            "review_content": "\nWow! What a wonderful professor and a wonderful class.  She genuinly cared about her students and their understanding of the subject matter. She once ended class a bit early to answer any extra questions we had and discuss our areas or interest more thouroughly.  I took this class the first semester of my first year and it proved to be highly manageable and the high point of my day.  I rarely read the homework for the class and even never bought one of the assigned textbooks- all you really need to do well in the class is know the slides she posts on courseworks.  Great Professor- great class- highly reccommended.\nWorkload:\n3 quizes (questions can sometimes be a little tricky), 1 midterm (managable), 1 final\n"
        },
        {
            "course_name": "Introduction to Women's Health",
            "review_date": "January 20, 2003",
            "review_content": "\nProf. Young rocks!  Her class was interesting, informative and TOTALLY managable!  The topics were well chosen, lots of great films and readings and good ( with very few not so good) guest lecturers.  Her grading was reasonable and fair with alot of multiple choice, fill ins, and true/false as well as some easy questions, however, she gives you a TOTAL and COMPLETE outline of the midterm and final and does not ask anything more than what is on the sheet she emails you!  To top it all off, Professor Young is articulate but not condescending, passionate but never preachy, and really interested in knowing her students!  If you can't tell...i had a great semester in Women's Health with Prof Young, one of the best...my advice take the class and take advantage of Professor Young's availability and intelligence and of course her study guides/notes!!! You won't be sorry!\nWorkload:\nSame as others said...1 midterm, Final, 2 quizes, and some extra credit thing (not needed if you pay attention and USE the study guides) Reading varies, but on the light side with enjoyable articles...\n"
        },
        {
            "course_name": "Introduction to Women's Health",
            "review_date": "December 23, 2002",
            "review_content": "\nI completely disagree with the other review! Professor Young's lectures might have been disorganized at times, but I found her to be a very enthusiastic and informed lecturer.  She continuously emailed us direct notes from lectures so we knew esactly what material to focus on, and she was extremely accomodating and available to meet with students.  Sometimes, though, the guest lecturers were pretty dull and those classes were pointless, but I found the rest of the class to be really interesting and just stimulating enough to keep me awake at the end of the day.  She's really sweet, the TA was great, and overall, this class is a definite keeper!\nWorkload:\n2 quizzes, a midterm, and a final, all of which were basically spoon-fed to us with review sheets that said exactly what we needed to know.  She delineates precisely which lectures and what facts to know that studying is a breeze. This class has THE smallest amount of work/reading I have ever had, and I probably spent a total of 1 hour over the course of the entire semester preparing for class.  The only work you need to put in is when test-time rolls around, but if you memorize her review sheet you'll be a very happy camper.\n"
        },
        {
            "course_name": "Introduction to Women's Health",
            "review_date": "December 01, 2002",
            "review_content": "\nProfessor Young's class is unorganized, and the facts presented often seem quite random. She grades rather hard-on every occassion I entered the exams knowing the information very well, yet did not do well. She does not test on the amount of knowledge her students possess, or how much they studied. She takes off unreasonable amounts of points for stupid nit-picking. To do well in her class is to merely get lucky. It is a very frustrating course. On the upside though, she has a good disposition and is a nice person to speak with during office hours. \nWorkload:\n2 quizzes, one midterm, one final, and a [massive and difficult] extra credit essay assignment at end of semester to bring up the low grades on the unfair quizzes.\n"
        }
    ]
}