{
    "prof_info": [
        {
            "prof_name": "Joel Lee",
            "prof_id": 10465,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Religions of the Oppressed: India",
            "review_date": "January 16, 2011",
            "review_content": "\nI took Prof. Lee's Religions of the Oppressed: India class this past semester, and am SO happy I did. I actually only ended up there because I got kicked out of another class due to over-enrollment, so I scrambled just to find something that filled that time space. I was freaked out the first day because I came in to find only six other people in the class, which later became reduced to five people including me. I was the only one of the five who had NO experience with religion classes of any kind, let alone Indian religion. I actually think 3 of the 5 kids had been to India. Joel did a great job evening the playing field, as the first couple of weeks were devoted to learning the Hindu names of the various castes and divisions of Indian society, which were crucial for the rest of the readings. I was frustrated when he gave us a test on these terms very early in the semester, but I realize now it helped me remember them for the rest of the semester. The readings were varied and interesting, and Joel's enthusiasm for this subject is so incredibly apparent. The class was a mixture of religious theory (Marx, Foucault, Nietzche, Bourdieau..etc) and books and articles about different religious movements in India, and the intersection of politics, society and religion in India. I feel like I learned such an incredible amount about the topic.\nAll in all, I would recommend this class to anyone and everyone, even if you've never taken a religion class in your life. Joel is amazing, and I think the curriculum for the course is going to continue improving.\nWorkload:\nWeekly reading was relatively heavy, and you HAVE to do it (or at least I did, because with 5 kids there's nowhere to hide) and a weekly posting on the readings due by Sunday night at 10pm. One fill-in-the-blank test early in the semester on Hindu terms and geography. One easy 4-5 page paper applying Bourdieau's theories to a religion of your choice, and a term paper due on the last day of class 15-20 pages on a topic of your choice. I found the assignments relatively easy, although I did get a B on the final paper because I wasn't careful enough with my citations (he seems to be a REAL stickler for those kinds of things). I ended up getting an A in the class though. He grades everything himself and is very approachable. I even got extra credit for doing well in an in-class debate. LOVE random extra credit.\n"
        }
    ]
}