{
    "prof_info": [
        {
            "prof_name": "Kristin Mammen",
            "prof_id": 2148,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Economics of Gender",
            "review_date": "November 07, 2012",
            "review_content": "\nI wouldn't recommend this class, but if you choose to take it, you should be sure you know what it's about first. As an econ major with an interest in feminism and women's studies, I signed up for this course thinking it would explore the main economic issues facing women in today's world. Instead, it was a pretty bizarre application of microeconomic concepts to marriage, having kids, and doing housework, with some fairly trivial exploration of other gender and econ related issues at the end of the semester. For example, we modeled people's decisions to marry based on specialization in \"household\" goods and \"market\" goods - a really strange and, I felt, somewhat pseudo-scientific way of looking at a particularly personal and often irrational choice. If this sounds appealing to you, by all means take this class and enjoy it, but be aware of what you'll be getting. \nFor econ majors, this class will also probably go too slowly to be interesting. It has no prereqs that I know of, and that shows up in the level of rigor. Professor Mammen will have to explain extremely basic concepts to the rest of the class regularly, and you'll probably be bored. She'll do it quickly to avoid this, and so your non-econ classmates will be confused. This brings me to Professor Mammen herself. She's a really nice person, and seems to care about the topic. However, her explanations of economic concepts are frequently rushed and disorganized. She often promises to \"come back\" to particular topics, but it rarely happens. You'll sometimes spend the first five to ten minutes of class trying to sit in alphabetical or birthday order so you can \"get to know each other\", which I felt was a waste of time.\nAdditionally, people with an interest in women's studies or social justice should watch out for some problematic statements that get made in this class. From the extreme heteronormativity of everything we discussed to Professor Mammen's assertion that she \"just doesn't understand why anyone would get pregnant by someone they weren't going to marry\", you may find yourself raising your eyebrows and your hand to challenge her more often than you should have to in a class about gender issues. \n\nWorkload:\nEasy for people with a prior knowledge of economics- you can get away without doing most of the reading. The only reason you'd have to is to answer the reading questions she distributes, and that can be done by skimming. \nAttendance is required and she learns everyone's names and faces. \nOne group presentation on the readings for that week, a midterm and a final. \n"
        },
        {
            "course_name": "Economics of Gender",
            "review_date": "May 06, 2012",
            "review_content": "\nThis is a very interesting class, and there is a heavy focus on discussion, though participation is not checked. The readings can be hit or miss, and some are fascinating. It was very interesting to think about how how women are expected to go on a certain life path (marriage and childcare), but that life path actually has very few long-term benefits for women.I would recommend taking this class if you are an Econ major in need of an major elective and are interested in learning about gender disparities both in the US and on a more global scale.\nProfessor Mammen is very nice, and sometimes it feels like she is spoon-feeding the material. Sometimes she seems a little bit distracted or confused, but it's never incredibly detrimental. She also somehow manages to get chalk all over herself every class. It would also be nice if she were to limit the class size to improve discussions.\n\nWorkload:\nWeekly problem sets (graded check/0)\nWeekly preparations for discussions (graded check/0)\nRequired to lead a discussion in a group of around 6-7 people, very low-key\nMidterm and a final\n"
        },
        {
            "course_name": "Economics of Gender",
            "review_date": "April 12, 2011",
            "review_content": "\nProfessor Mammen is a great teacher. She makes time for her students at the end of class, during her office hours and even in class if you really don't understand the concepts. She is funny and cares a lot about her students, she knew everyones name by the 3rd class...\nShe prepares a worksheet with definitions and concepts every class and goes through them clearly and concisely.\nReading\nThere is one textbook which is referred to quite often so worth buying or renting. The weekly readings are all on courseworks and are usually quite short. She usually gives out reading questions for the four or five readings we have each week with about one question on each reading. The reading is then discussed in class with some students presenting and class participation.\nProblem sets\ndead easy if you make the slightest effort in class. 7 in a semester and she just ticks them off, so its up to you to make sure they are correct or not.\nmidterm + final\nnot bad, final is not cumulative.\nWorkload:\nweekly reading + questions, 7 problem sets, midterm, final\n"
        },
        {
            "course_name": "Statistics for Economics",
            "review_date": "January 13, 2011",
            "review_content": "\nProfessor Mammen was a terrible teacher - she didn't know how to answer questions and would only mumble an incoherent response or wave it off saying that we would cover it \"later\" (although we rarely did). My biggest problem was that she insisted on giving us \"proofs\" on the midterm and final that we had not gone over in class and seemed impossible to do in a high-stress setting.. however, she did give you a formula sheet that basically has every formula you need so no memorization is required. Just make sure you understand the basic concepts.\nWorkload:\nWeekly problem sets that are very tedious - Professor Mammen has openly admitted that she hasn't updated the Excel instructions since she started teaching the course, so good luck finding computers that still have the old Excel. Go to the TA sessions for help (in the form of answers). Easy midterm, ok final.\n"
        },
        {
            "course_name": "Economics of Gender",
            "review_date": "May 12, 2006",
            "review_content": "\nIf you have even a slight interest in economics, this class is a waste of your time. If you would like to read myriad NYT articles describing how women make less money than men, etc. ABSOLUTELY take this class.\nThis course should NOT be listed as a 2000-level Econ course; it is at best a 1000-level Anthro or Gender-Studies class. \"Economics of Gender\" carries no prerequisites, which means you will spend the entire first class learning what \"variables\" and \"functions\" are. Seriously. Oh, and for the purposes of the class, you don't really need to know what these are anyway.\nOverall, this was perhaps the most remedial and least educational course I had the displeasure of taking during my years here. \nOn Kristin Mammen: I get the sense that she structres the multiple (useless) assignments and midterm/final in such a way that she can validate her efforts at teaching (reading through the handouts she gave us and writing down the charts and graphs on the blackboard.)\nIn summation: this class was ridiculously remedial and an overwhelming disappointment. You will put in too much work for a class from which you will gain very little, if anything. \nWorkload:\nWeekly readings w/ reading questions (fluff), weekly problem sets (half-reading questions, half-principles of econ...i.e. fluff), class presentation (ask questions to a bewildered class about the articles no one has read), midterm, final. Sample midterms and exams are posted. Attend every class, memorize all the crap she re-reads from the handouts, and just like in high school, you'll be fine.\n"
        },
        {
            "course_name": "Statistics for Economics",
            "review_date": "January 15, 2006",
            "review_content": "\ni'm not sure why there are only bad reviews of prof. mammen in here because she's really not that bad.  although the class wasn't always exciting, mammen did a very thorough job of explaining the concepts and giving example problems that we worked through in class, which were helpful to refer to for the problem sets. she was also receptive to questions, even if they didn't relate directly to the topic of the lecture.  she's an incredibly patient woman, and very willing to sit down with students outside of class for extra help on problem sets.  the midterm is really easy - exactly the same kind of problems that are on the practice midterm, the only difference being that some of the numbers have been changed.  the final was much harder, though still fair.  \nWorkload:\nweekly problem sets that take a couple hours each but aren't hard (the TA will give you the answers too if you go to recitation), easy midterm, and hard final.  a group project that is a bit tedious but not difficult.\n"
        },
        {
            "course_name": "Economics of Gender",
            "review_date": "August 24, 2005",
            "review_content": "\nProfessor Mammen was a mess - she was often ill-prepared for classes and gave vague and irrelevant answers to students' questions.  She offered very little guidance and made no effort to help students understand difficult concepts.  She never graded the problem sets, so it was impossible to know if you were on the right track.  The reading, however, was well-chosen and interesting.  A word to the wise: make sure to note ALL examples given during the lecture (even if they seem irrelevant) because they seem to find ther way onto the exams.\nWorkload:\nLots of reading, easy problem sets every week, VERY difficult mid-term and final\n"
        },
        {
            "course_name": "Statistics for Economics",
            "review_date": "December 29, 2004",
            "review_content": "\nPoor woman--always seemed tired and anxious.  She had an obvious interest in the subject but absolutely no skill in bringing that passion into the class.  Class was extremely dry and boring, even for an intro economics class.  She also seemed rather bewildered at times that she was infront of a class of students and responded to questions with extreme flustering.  \nWorkload:\nMidterm (fair), final (much harder), weekly problem sets (not bad, TA will practically give you the answers if you ask), and a group project\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "September 28, 2004",
            "review_content": "\nBeware my friends, she is a deceiving woman. This class was outrageous! She appears to be a nice, calm, and a sweet woman, but her teaching is as bad as it gets. From the start I knew that this class was a disaster. If you see her face during class (and not her back) then you are one of the lucky ones. She teaches with her lecture notes to her face and her back to the class. If asking a question, dont expect an answer too soon. She will begin by looking to the ceiling in anticipation for an answer, after a couple of moments and copious \"umms\", she will indulge you with absolute nonsense. Trust me, dont ask questions! If you take this class, then all of your future upper levels are destined for failure. If you are going to be an econ major, you need a solid foundation in micro, not a bunch of crap!\nWorkload:\nNot bad, EASY Midterm and hard Final.....weekly problem sets that she will NOT help you on! \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "September 02, 2004",
            "review_content": "\nI agree with the review above-- Pr. Mammen  is 100% rookie. The examples she gave in class had little or no correlation to the theory she was trying to explain. It almost seemed as if she had no idea/interest in what she was teaching, which made the subject much more boring/annoying than it has to be. She never seemed prepared to answer questions so try looking the answers to you questions up in your book or asking a friend for help before you ask her. \nWorkload:\nproblem sets every week (the TA was VERY helpful), midterm (hard), final (harder--great curve)\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "August 09, 2004",
            "review_content": "\nMammen is a very kind woman and seems to be very interested in economics, but she is clearly a rookie when it comes to lectures. Her classes were scattered and hard to follow and I often left class wondering what I had just scribbled in my notebook. She has trouble coming up with examples and answering questions about any topic other than the one she has prepared for. I did like how all of her examples were about women. We didn't use the book at all except for an occassional homework problem. The TA sessions were poorly attended and the midterm and final were ridiculously hard. But she must have curved the exams because my final grade was much higher than I anticipated. Overall, a nice teacher, but you have to make a huge effort to stay on track.\nWorkload:\nweekly problem sets (very long, required help from the TA almost every week), midterm, final\n"
        }
    ]
}