{
    "prof_info": [
        {
            "prof_name": "Elizabeth Kujawinski",
            "prof_id": 1115,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry II",
            "review_date": "October 23, 2004",
            "review_content": "\nDr. K is a  nice woman at times.  Other times she has mood swings and can bitch at the students for no reasons.  She, at times talks to her students as if they are 5 year olds.  She is also anal about certain things.  I liked the class but I disliked talking to her or going to her office hours.  She def. needs work on her interpersonal skills.\nWorkload:\nWeekly problem sets, 2 midterm and a final. Exams aren't too bad, its her attitude that needs a lot of work\n"
        },
        {
            "course_name": "Ecotoxicology",
            "review_date": "January 22, 2004",
            "review_content": "\nIf you are looking for a walk in the park, look elsewhere.  If you are looking for an interesting, challenging class that makes you think, take this course.  This class covers ecotoxicology from the basic chemistry level to the mechanisms of global transport of environmental contaminants.  Liz wants you to do well, and will do everything she can to help you, short of doing the thinking for you.  Her exams are the most diffcult tests I've ever taken.  However, if you are taking this class, you should be more interested in the material than your letter grade- which will turn out to be fine if you show her you are working.  She knows it if you are, and this will help you in the end.  (Over the semester I was working at about 80% capacity and I got a B.  I'm impressed)  Do your best on the problem sets, go to office hours.  By the end of the semester, they involve a lot of thought problems which you may find fun.  Also-  ask her how long of an anwer she wants for each question.  Sometimes her answer will surprise you.\nWorkload:\nBiweekly problem sets, two midterms, one literature review (6-10 pgs) of an environmental contaminant of your choice, one final.  The first mid-term was so hard she made the next midterm and the final take-homes.  She realizes she needs to work on the tests-  I would bet they are better by the time you take the exam.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "October 25, 2003",
            "review_content": "\nDr. K is one of the best professors I've had at Barnard and a really nice person as well.  Her lectures are well organized and actually make chemistry interesting.  She really seems to care that everyone understands the material and makes herself very available for help outisde of class.  The small class size was a change from G chem 1, as students were expected to participate in class.  This ended up being a good thing for me because it kept me on my toes and up to date with the reading.  While the class atmosphere was a bit warmer than G Chem 1, you still need to put the time in and work hard to do well.  Dr. K really notices who is making an effort and who isn't and if she thinks you're trying hard she'll do all she can to help you do well. A really dedicated professor!  \nWorkload:\nweekly problem sets- help session is a life saver! 2 midterms and a final.  The tests were fair but sometimes quite difficult.   Weekly lab reports- similar to G chem 1. \n"
        },
        {
            "course_name": "General Chemistry 1602",
            "review_date": "September 13, 2003",
            "review_content": "\nKujawinski's lectures are pretty straightforward.  It's really easy in the beginning and then gets progressively harder.  Her personality is really difficult to decipher, even after the semester was finished, I still didn't have her figured out.  She seems really nice and open, and then in my opinion, every once and a while tries to screw you and has a huge attitude.  I think she's pretty concerned about being a class that \"just fills the requirement\", and doesn't want to be a lot easier than G Chem 2.  She's really challenging.  The keys to success in this class are: 1) Go to office hours 2) Do the extra assigned problems that she doesn't grade.  P.S. don't expect to slide through this class, she knows EXACTLY what you're doing.\nWorkload:\nWeekly problem sets which are do-able.  Two VERY difficult midterms.  And an IMPOSSIBLE. I repeat, IMPOSSIBLE final.  \n"
        },
        {
            "course_name": "GChem 1602",
            "review_date": "December 14, 2002",
            "review_content": "\nProfessor Kujawinski is new to Barnard and an amazing person. She made chemistry for me relatively painless and actually interesting. She is a really organized lecturer and an extremely open and approachable person. She works endlessly to encourage your success in her class and unlike 1601, this class is MUCH smaller and much more personalized. It also goes at a considerably more normal pace and is more flexible in terms of the topics that need to be covered. I would highly recommend this class to anyone looking to finish a science requirement in chemistry or anyone looking to see the devotion and efforts of a great new professor. \nWorkload:\nWeekly problem sets, two midterms, and a final. All were straightforward and fair, though I can't say the exams were easy. \n"
        },
        {
            "course_name": "Ecotoxicology",
            "review_date": "December 12, 2002",
            "review_content": "\nThis was a great class taught by a dedicated and energetic professor. Liz is always available for students and gives very interesting and clear lectures even when they are mostly equreview_content. review_content sessions before each test were very helpful. She is obviously passionate about the subject and has designed a great class. I'm sure she would make a great advisor for someone interested in environmental science or biochemistry.\nWorkload:\nslightly heavier than most but appropriate: problem sets every other week or so, two midterms (one take home), a final and a short 2-5 pg research paper on a compound (grad students had to give a presentation too)\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 15, 2002",
            "review_content": "\nProf. Kujawinski (or Dr. K as she insists that you call her) was a new professor at Barnard this semester in the Environmental Science dept. - and although this was her first class she ever taught here, I found her to be extremely organized and very straightforward (i.e. understandable) in the presentation of some pretty difficult material. Miraculously, she made this class, which I had been dreading forever as the 2nd half of my lab requirement, tolerable, even [gasp] enjoyable at times! She shows a tremendous interest in the material that she teaches and is very patient with her students, even lazy non-science majors like myself. If you don't understand the material, she will go out of her way to help you and held thorough review sessions for each of the exams which definitely saved my ass (and my grade). Also, she tends to call on students randomly throughout the lecture so you'd better stay awake during that 9 a.m. lecture...\nWorkload:\nHellish but what you would expect for a 5-credit chemistry lecture + lab. Weekly problem sets that are challenging but fair, 2 midterms, final, weekly lab reports. \n"
        }
    ]
}