{
    "prof_info": [
        {
            "prof_name": "Richard Clarida",
            "prof_id": 1718,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "September 10, 2003",
            "review_content": "\nClarida isn't interesting and he is a little hung up on the fact that he recently held a fairly high government position (he once half-joked \"once you've been to one oval office signing ceremony, you've been to them all\").  However, he has a clear idea of the material he wants you to know and presents it slowly and clearly.  I don't agree with another reviewer who said he is too lazy to change the tests and too stupid to withhold them from you.  Instead, I think he has a very specific idea about which concepts he thinks are valuable and he focuses on them almost exclusively from one year to the next.   In all, a good class.  For the grade-mongers out there, the prospects of getting an A are very good.  For those concerned with the actual material, Clarida is a clear, concise instructor who leaves little room for confusion and answer questions well.\nWorkload:\nNo homework, one midterm, one final.  (summer session)\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "September 01, 2003",
            "review_content": "\nAfter one day in Professor Clarida's Intermediate Macroeconomics I believe he refered to his time at the Treasury Dept about half a dozen times.  He clearly doesn't care  much about his students, but nonetheless he is a clear lecturer.  He moves very slowly and is able to make most of the material very understandable.  While at times boring, his very dry sense of humor shines every once in a while, showing that he at least tries to make his class a little interesting.\nWorkload:\nVery easy.  No problem sets.  Midterm and final both very easy as they are based on his old exams--which he is too lazy to change and to withhold from you.  Very easy A.\n"
        }
    ]
}