{
    "prof_info": [
        {
            "prof_name": "Alexandra Horowitz",
            "prof_id": 2678,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Psychology",
            "review_date": "August 30, 2013",
            "review_content": "\nGreat class! If you are interested in psychology and have not taken AP Psych then this class is for you! She puts all the powerpoints online before the class. I would highly recommend printing these out before class and taking notes on them as nearly all her exam questions come from her lectures. Reading the textbook reinforces what you learn in lecture and a few questions (maybe 2-3 come directly from the book). So basically go to her lectures! So many people decided not to come to her class and were at a real loss wasting time taking meticulous notes when she goes over nearly everything she wants you to know. Also, if you participate often enough she will give you extra credit. So try and participate once a week or so. I found the lectures quite engaging, but I had an interest in Psychology before the class. I also enjoyed how she asks the class questions and will answer your questions in the middle of a lecture, even with such a large class. The topics covered are broad, as with most intro classes, but this way you can see which parts of psychology interest you most and can decide from there which upper-level classes to take. The experiments are fun too! If you try, you should get a pretty good grade on them. Exams aren't tricky as long as you've studied and shown up to lectures and the TA review before the final. \nWorkload:\n2 exams (midterm and final). Final is non-cumulative. Exams are 2/3 of grade.  2 experiments which are 1/3 of grade. If you participate a lot (about once a class or once a week since the lecture is so large) she will raise your overall grade by 1/2 (ex. an A- to raised to an A)\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 02, 2012",
            "review_content": "\nProf. Horowitz is very clear about her expectations for the course, and makes a worthwhile point about integrating the psychology of learning into her lectures, to encourage the most efficient manner of study as possible. As such, her lectures overlap significantly with the textbook readings and the power points that she puts on Courseworks, which, as she explains, is the most efficient manner of learning, but make it difficult for the less-than-motivated to continue coming to class. \nShe's one of the best in her field, though, so it's worth going. She is an entertaining lecturer, though, and extremely receptive to student questions.\nWorkload:\nOne multiple-choice midterm and an m-c final, both lasting about an hour, and two group psychology experiment projects. The first group project is difficult because you are assigned a random group, and she grades harshly.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "November 16, 2011",
            "review_content": "\nHonestly, I don't know what everyone is complaining about. Professor Horowitz is extremely knowledgeable and, more importantly, a great professor. Her intro to psych class is by far the best of all those offered currently. Not only is she engaging, but she literally goes over EVERYTHING necessary to do well. The work load is extremely manageable, and it is clear from her VERY HELPFUL power points what will and what will not be on the final exam. Anyone complaining is clearly just wining. Suck it up and stay awake, her class is great.\nWorkload:\nVery minimal. mid-term, final, 2 experiments, extra credit\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "November 09, 2011",
            "review_content": "\nHorrible class. I'm an upcoming psych major so I love psych and I took psych courses in the summer, but this was the worse. Her class is boring because she doesn't make the lessons interesting. I fell asleep a million times. But, she is a very helpful professor and will accommodate your schedule if you need to meet with her. She is also obviously very smart and knows how to answer questions if you have any. She's great at explaining.\nNice woman, but boring professor.\n\nWorkload:\nvery tolerable. a chapter per class or every two classes. midterm is 75 questions. a couple projects and a final. I survived\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "September 29, 2011",
            "review_content": "\nI don't know what everyone means when they say professor Horowitz is an \"amazing\" teacher. I beg to differ. If by amazing you mean monotone, zombie like and boring then she must be great. I've fallen asleep numerous times in this class and I don't even go anymore because she sucks that bad. I'd rather just read the book and teach myself. Please don't go to this class. Do yourself the favor. If you have had boring teachers all your life then by all means go and take this class. However, if you have had fun teachers that make you WANT to learn then go somewhere else.\nWorkload:\nvery manageable. \n"
        },
        {
            "course_name": "Canine Cognition",
            "review_date": "May 13, 2011",
            "review_content": "\nAlexandra Horowitz is not only brilliant as a teacher but also skilled in explaining every complex, enigmatic concept arisen in discussions. Her interest and avidity for the subject is conveyed in her lectures and reading list, never once inspiring a state of boredom in her class. I would highly recommend taking this course. \nIt's refreshing to enter a psyche class in which a textbook isn't heavily relied on, and the fact that the sole material for this class is journal articles not only serves to give students a full understanding of how the field works, but excellent practice for further psychology class reading and writings. As I mentioned before almost every reading was highly absorbing and so engrossing that it went by faster than you would expect. \nDiscussions were always great because this class, due to its specificity, is comprised of students interested in the subject of animal behavioral science, so there never was a time where Professor Horowitz had to continue rambling to fill the time. Class presentations were also fascinating, something that isn't true for a lot of courses. \nHowever, the greatest part about this course is that the field of canine cognition is one that is constantly expanding. Every class there was a new current article to talk about or a video to watch. \nSome final perks: this course only meets once a week which ensures that there really isn't class time wasted. Professor Horowitz also will let class out early usually, sometimes even 45 minutes early, instead of holding us for the sake of running the class for the full time. She also is an extremely fair grader, and if you put a lot of time and thought into your work she will reward you for your effort. \nWorkload:\nThe workload for this class is moderate. About five journal articles a week (skipping one isn't a huge deal for discussion), a weekly email of two questions from the readings to be sent to her on sunday nights, one half hour to an hour class presentation on a journal article assigned for that week and a journal of your choosing with a typed handout about both, one final paper 15-20 pages in form of an experiment proposal. \n"
        },
        {
            "course_name": "Canine Cognition",
            "review_date": "May 02, 2011",
            "review_content": "\nWhy this woman is not a gold star yet, I don't know, but this was one of my favorite classes of my Columbia career so far. \nPerhaps it was related to finally having an outlet for my self-proclaimed mild obsession with dogs, but even for the less obsessed of us out there, it was undoubtedly a valuable experience. Despite the very real danger inherent in such a small seminar filled mostly with dog-people, this was in no way a pop-psychology, \"Let's tell cute animal stories\" type of class, but rather a fascinating, academic investigation of canine behavior, domestication and cognition against a background of classic experimental psychology. We read not only dog studies, but related human, primate, and wolf studies along some evolutionary biology material during the portion of the class that looked at canine domestication and heritage. \nExcept for one or two papers that I found too philosophical and somewhat irrelevant, her choice of literature was excellent. Her lectures are interesting and paced quite well. I've had some seminar classes in the past that were too heavily lecture and often dry or too heavily discussion and thus unguided and not as useful, but Professor Horowitz strikes the elusive right balance. She also (at least seems to) actually seriously and thoughtfully consider students' comments and opinions without resorting to the somewhat coddling and mindless approval that some professors unfortunately get caught up in when trying too hard to be nice. From what I can tell, she is quite funny and personable, and her passion for the topic is clearly both immense and genuine. She is incredibly knowledgeable in the field- having published a lot on this topic and running a dog behavior laboratory, so if you want to learn this kind of thing, she is definitely the person to take it with.\nWorkload:\nweekly questions based on the readings, final paper, journal club type presentation\n"
        },
        {
            "course_name": "Canine Cognition",
            "review_date": "April 09, 2011",
            "review_content": "\nEvery dog lover should take this class. While Dr. Horowitz normally teaches intro psych and animal behavior, canine behavior is her true area of expertise and her research interest. She runs a lab that studies canine play behavior and has written a best-seller on the mind of a dog. The participation-heavy seminar involves reading 3 or 4 journal articles a week and then discussing them in class. The topics include, among other things, theories of domestication and canine evolution, comparative cognition between primates and canines, canine sensory capabilities, and human-animal interaction. She's very knowledgeable, funny, and personable. Everyone gets plenty of chances to speak and she's always receptive and interested in everyone's ideas.\nWorkload:\nModerate but enjoyable reading, 2 weekly questions/comments on reading, 1 informal presentation on a paper, 15-20 page final paper on proposed original research.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 23, 2010",
            "review_content": "\nWhat a great professor!! Hands down, my favorite class. I am a first year and found the pace of the class to be perfect - engaging and not overwhelming. I learned a great deal from both the reading in the textbook and from her lectures. I actually loved reading the textbook and found it very interesting and straightforward. Absolutely take this class from Horowitz because she loves what she does and her passion is clearly transferred to her students. \nWorkload:\nOne chapter in the textbook per week. Two group labs that are fun and helpful in understanding the material. One midterm, 75 multiple choice. One final (non-cumulative), also 75 multiple choice. Good, fair tests that pull from the textbook and lectures. \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "November 08, 2010",
            "review_content": "\nProfessor Horowitz is awesome. Her intro to psych class is engaging, fascinating, well presented, and fair. She usually assigns one chapter of reading in the Myers' Exploring Psychology (it's a pretty easy read) textbook per class, and provides lecture slides as well. During class, she lectures with the slides on powerpoint, and supplements them with her own interesting/hilarious commentary. \nIt's REALLY helpful to print out the slides before class, so you can just take notes on them when she's lecturing. Otherwise, you might find yourself scrambling to copy down everything on the slides AND everything she's saying. She's a great lecturer, but also likes to make the class somewhat of a discussion. Surprisingly, for a lecture class of about 50-60 people, she makes it work! \nOverall, Horowitz is a great teacher, clearly devoted to the subject and to teaching her students in the most practical and engaging way possible. TAKE HER CLASS. I'm a psych major and found her intro class to be a perfect segway into higher levels, but if you're only thinking about psych or might want to take some psych classes, hers is a fantastic one to start with. You'll love it. \nWorkload:\none chapter of reading for each class... not that bad\n2 exams (2/3 of your grade)\n2 group projects (1/3 of your grade)\nshe also says that stellar participation can boost your grade... once again, she is amazing.\nThe exams are all multiple choice, occasionally tricky but very fair on the whole. It's from stuff in the textbook AND stuff she talks about in class. Skipping class isn't that big of a deal, but going really helps you do well on the exams. Simply reading through her slides isn't sufficient or nearly as helpful as going to class and taking notes on the slides on what she's saying. \nThe 2 group projects are pretty fun and interesting, plus they're not that hard. She is a fair, relatively kind grader.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "September 16, 2009",
            "review_content": "\nI took Intro to Psych with Prof Horowitz last semester and it made me change my major from English to Psychology. She is an intelligent and engaging professor; always fair but also expects a lot of her students. I learned more from her in that class than I have in any other class. I highly recommend that you take this class with her, whether you want to be a Psych major, whether you need to fill a requirement, or whether you are just interested in Psychology. She is the best. \nWorkload:\nDefinitely manageable. Two experiments, midterm, and final. \n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "March 31, 2009",
            "review_content": "\nProfessor Horowitz is very sweet and very approachable. Her lectures were often semi-tedious and followed the textbook pretty closely, but she had lots of interesting examples and videos. A very low-stress course. She's always willing to help if you don't understand something or just want to talk about animals. The concepts were all very straight-forward and easy to understand.\nWorkload:\nReading was about one or two textbook chapters a week, which was often lengthy, but if you really got into it was interesting and fairly painless. The reading was really helpful for understanding the major concepts and having examples to refer back to on exams. Exams were pretty easy if you paid attention to what she emphasized in class. Animal research project which took time. Make sure you don't have to travel too far to observe your animal\n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "January 23, 2009",
            "review_content": "\nProf Horowitz is great. She has this infectious smile that keeps me awake during class (except this one specific lecture about dancing bees...embarassing because the class is relatively small). In any case, the reading is interesting and she shows videos during class! The tests are definitely doable, although there are specific examples of certain animals that she tells you to know beforehand. I would suggest going to lecture as it condenses the wordy textbook's explanation of animal mating habits and the like in a mere 1 hour and 15 minutes. Our final project was an animal study, which led me to sit in a penguin house for about 10 hours of my life. Rewarding nonetheless, as she bought donuts to our class presentations. She is wonderfully helpful, captivating, and i highly recommend this class. \nWorkload:\nDoable, 2 tests, 1 final project, weekly \"Questions\" that encourage you to think about the reading you were assigned.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 31, 2008",
            "review_content": "\nProfessor Horowitz is one of the best professors I have ever encountered during my time at Barnard. Her lectures are engaging and witty, and the powerpoint slides that are available on courseworks make it easy to follow along and make your own notes (so you're not worrying about catching every word). If you speak to her once and introduce yourself, she'll remember your name and use it when she calls on you (in my experience, rare for even a medium sized lecture class).\n I recommend her to any student interested in psychology...in fact, I think I'm catching the psychology bug because of my experience in her class. \nWorkload:\nDefinitely manageable! Midterm and final which were fair and there were review sessions and office hours for both, and two experiments in groups which were fairly graded and explained thoroughly. Also, you need to participate in psych majors' experiments, but as long as you plan ahead, you shouldn't worry about that (optional paper instead of the research participation). \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 26, 2008",
            "review_content": "\nThis professor is amazing. She is kind, humorous, and intelligent. She is willing to meet with students often, and will respond quickly to emails. I sent her a flurry of emails this past semester with a ton of specific questions and she would answer all of them quickly and fully. She is also personable, which is evident by her efforts to remember and use people's names in a lecture class. She sparked my interest in psychology, and I am now taking another psychology class next semester. I took Lindemann for a month last year (Fall '07) but I dropped it because of her disorganized teaching style and her inclination to teach far more information per class than was permitted by time. I HIGHLY recommend this professor; she is one of my favorites.\nWorkload:\nVery manageable. She assigns a chapter of the textbook for each class. Although it is not necessary for you to read, it will help you clarify and re-enforce the material covered in class. When reading, ONLY read sections she covers in class. Those uncovered will not be tested.\nAlso -- 2 experiments, midterm, and final. The final is non-cumulative :)\n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "December 20, 2008",
            "review_content": "\nDr. Horowitz is the most engaging and helpful professor I have encountered at Barnard or Columbia so far.  Although the final research project seemed daunting at first, Dr. Horowitz is quick to help students arrange visits to any zoo or aquarium in NYC and answer questions pertaining to the project (or any other animal-behavior related subject) before and after class.  She is also very accessible via email and responds to student e-mails quickly.\nHer own work on domestic dog playing behavior is fascinating, and she sometimes uses videos of her subjects (or David Attenborough videos) to illustrate concepts, which made it very easy to understand the reading and the exams.  \nHer lectures are interesting and an integral part of the course; students who skip class will be surprised by some of the examples given on exams, so go to class and pay attention!  If you do miss a class, however, you can usually access the lecture from home using iTunes.\nOverall, this was an enjoyable course that I would recommend highly to anyone with an interest in animal behavior.\nWorkload:\n2 midterms, 1 final exam, 1 PowerPoint presentation, and 1 research project, consisting of 1 poster and a 6-page paper.  \nExams were straightforward and grading was fair.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 19, 2008",
            "review_content": "\nProfessor Horowitzâ€™s class was interesting and I learned a lot of things that everyone should know something about.  Her slides were comprehensive and she is a good lecturer.  Even though the class was rather large, she always opened up the floor to studentsâ€™ questions and opinions.  Her examples were excellent and they greatly helped me remember the concepts.  Sometimes she tried to put a little bit too much information into one class lecture.  She also added interesting and usually funny videos from youtube, etc. to show different experiments.  The group experiments that we had to do were also interesting and usually had some funny element to them.  Her class was also not overwhelmingly sciencey which I appreciated.   It was a bit nuts though that you had to keep getting to her class earlier and earlier just to be sure that you would get a seat!\nWorkload:\nTwo group project experiments that are not that much work.  There are multiple choice midterm and final exams that are both fair and basically concept based.  In addition, every Intro to Psych student is required to participate in 5 hrs (10 credits) worth of others peopleâ€™s psych experiments.   Some of the experiments were time consuming and boring and others were enjoyable.  At times, it was hard to find experiments on the online site that fit my schedule.  \n\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 06, 2007",
            "review_content": "\nThis class is great if you need an extra 3 credits and enjoy sleeping late on Tuesdays and Thursdays. I stopped going to class after the midterm, then reviewed two hours for the final and ended up with an A-. Nice women, but not worth waking up at 9 am for. \nWorkload:\nEasy. 1 midterm and a final. Some experimental write-ups that are not difficult.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 07, 2006",
            "review_content": "\nWow. This class was such a mistake. \nI took this course in order to fulfill the psych major after taking other psych courses at Columbia. \nHer lectures are entirely narrative and non-scientific, and if you've taken psych before you know she's not giving you the correct definitions to the terms. I'm no scientist, but I found this irritating beyond belief. \nShe's a nice person and all, but I don't think I learned a thing. \nWorkload:\n2 out of 3 short experiment write-ups, graded very easily. bizarre/subjective multiple choice questions on the midterm. final. \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 21, 2006",
            "review_content": "\nDr. Horowitz is a witty, captivating speaker who has studied both philosophy and psychology extensively and therefore has much to contribute from both disciplines. \nHer use of clear powerpoint presentations makes note taking effortless and allows you to focus completely on her lecture without worrying about copying minutaie into a notebook. She will expose you to the wonders of the human mind and leave you feeling like you've much to bring to the rest of your studies at Columbia and life in general.\nWorkload:\nThree very enjoyable experiments to be conducted \"in the field\", a fairly extensive chapter in a well written text book due for each class, and two multiple-choice exams that aren't too difficult if you've kept up with the readings and attended classes.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "April 23, 2006",
            "review_content": "\nProf. Horowitz is great!  Her class was interesting and organized; she used powerpoint to aid her lectures and always handed us a printed slide list to follow along (VERY helpful for the midterm and final).  She used lots of examples and even occasional videos and mini experiments she tried on us in class.  The textbook was also very clear and somewhat fun to read.  Questions are always welcome during class, and she is extremely approachable afterwards or during her office hours.  I had never taken a psychology class before this and found myself pleasantly surprised at how clear her explanations were.  I highly recommend Prof. \nHorowitz to anyone, whether or not you plan to major in psych. \nWorkload:\nVery light: 3 experimental write-ups, 5 hours spent as test subject in professor experiments, midterm and final. \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 16, 2006",
            "review_content": "\nProfessor Horowitz is the reason I love psychology so much right now. She is really kind and understanding, cares about her students, and is really excited about the material she teaches. Her class is a very relaxed atmosphere, and the workload was really manageable. I would take this class just to have an experience with such a great professor. I sometimes even wanted to go to class, even though it was at 9:00 am. I definitely recommend her.\nWorkload:\nclass lectures for the midterm and the final (both all multiple choice), 4 1-2 page experiments, but only 3 are required.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 02, 2005",
            "review_content": "\nI originally took this section of Intro to Psych as a time-filler. At first, I wasn't interested at all in the subject matter and I was completely bored. Once we started going on in the material and did not have to learn about neuroscience or any other bio-related things anymore, I really enjoyed this class. She gave you a printout every day of the notes that would be needed for that class. but you still need to come because on the midterm and final she asks questions about videos that are only shown in class. \nWorkload:\nPretty light. I usually forgot I had this class when I thought about work. We have 4 mini experiments that we have to perform ourselves, with the ability to exempt ourselves from one of them. There was also a midterm and a final, which were fairly easy. Not too bad. \n"
        }
    ]
}