{
    "prof_info": [
        {
            "prof_name": "Ali Altug",
            "prof_id": 11929,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus IIS",
            "review_date": "January 18, 2015",
            "review_content": "\nCalc II is just not easy, and that's no fault of Professor Altug's. That's just what the material is like, and since there's so much of it, the class has to be fast-paced. Professor Altug gives many and very clear examples of whatever he's teaching. He goes through them superquick and often I wouldn't be able to understand them in class, but if you write them down and look at them when doing Problem Sets it'll make better sense. Professor Altug also encourages questions in class and will often stop and ask if everyone understands - but when you're in a room with highly motivated engineering students (and I am not one of them- go Barnard!), it's extremely scary to ask a question in fear you'll look stupid, so I never did.\nAlso, he does not allow homework questions during office hours which is probably because everyone would then show up. I went once, only to ask about his thoughts on possibly doing the 3-2 engineering program, and while he didn't know much about it we still had a pleasant little talk about engineering.\nExams were extremely difficult. This is what I hated most about the class, since I felt exam questions never reflected the questions given in class or on Problem Sets.\nAlso if you did have a question on homework, you would have to to the Math Help Room which was not helpful and never had TAs.\nAll in all, I actually thought I would fail this class and considered withdrawing. I failed one of the midterms, but I ended up getting a C in the class, which is a miracle. My bad grade isn't a reflection on Professor Altug, it's a reflection on my inability to to do Calc II.\nI also want to add that if you are an incoming first-year and tested out of Calc I with AP Calc AB, you really should retake Calc I here. Apparently this is common advice that I failed to receive until a week before the final.\nWorkload:\nWeekly Problem Sets 10%\n2 Midterms 22.5% each\n1 Final 45%\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "January 01, 2015",
            "review_content": "\nAli altug is a great teacher! Takes time to explain things during class and makes sure we understand class material. He gives us the option of doing web assign or textbook because he assigns enough textbook problems. He posts sample and practice exams that are very similar to the real exams!! So practice those problems!! Calc II is a struggle but prof altug made is a little easier! \nWorkload:\nWeekly homework sets \n2 midterms and a final (fair) final is a harder though \n\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "January 01, 2015",
            "review_content": "\nAli altug is a great teacher! Takes time to explain things during class and makes sure we understand class material. He gives us the option of doing web assign or textbook because he assigns enough textbook problems. He posts sample and practice exams that are very similar to the real exams!! So practice those problems!! Calc II is a struggle but prof altug made is a little easier! \nWorkload:\nWeekly homework sets \n2 midterms and a final (fair) final is a harder though \n\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 16, 2014",
            "review_content": "\nProfessor Altug is one of the BEST professors I've had at Columbia. Do not take any other Calculus II class over his. Honestly. I sat in on many other Calculus classes which my friends thought were good, but his is by far the best. I took him for Calculus I and II and he was great.\nHe gives amazing notes in class and explains everything very slowly and extremely well. His homework is very relevant, with a few somewhat tough questions at the end, but he gives you a lot of questions to choose from, and you have to submit approx. 15 each week. The homework takes around 2 hours maximum each week. \nHis exams are extremely fair! He gives hints in some questions and some bonus questions too for extra points. \nHe really really cares whether his students are learning and is extremely accommodating. He wasn't planning on using Webassign but some students wanted it so he gave them a choice to do some questions on Webassign and handwrite some, or handwrite all. \n(His class does not have Webassign compulsory, which is great!)\nYou need to study about 8 hours for the midterms if you attend the classes and do all the homework. He always posts sample midterms that are very very similar to his midterm.\nWorkload:\nLight! One problem set each week ~ 12-14 questions. \n2 midterms - 22.5% each.\nFinal - 40%.\nHomework - 15%.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 24, 2014",
            "review_content": "\nPeople are extremely biased on CULPA and you should not take everything these people say as granted. Altug is a great teacher and as long as you do most of the homeworks and try to understand them, as well as practice some questions from the textbook before tests you'll do great. He is very concerned about his students and his explanations are very clear. This class was great. As long as you aren't some slacker you'll think the same.\nWorkload:\nmedium to small. Homework sets (some are a little challenging but they're very doable). 2 midterms (fair). One final (fair as long as you practice). We got an extra credit problem to boost our midterm also!\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 23, 2014",
            "review_content": "\nJust to let  you guys know these culpa reviews are very Biased and should not be the main basis which you use to select your classes. Altug is a great teacher and makes it clear that you can let him know whether to slow down or speed up his teaching. He asks questions that help to make sure you are paying attention. As long as you practice some questions and attempt the homework making sure you understand it then you will do well. He is very lenient. He even gave a makeup for the midterm for those who wanted a better grade. His pace is perfect and explanations clear. \nWorkload:\nHomework sets written and webassign. 2 midterms (Fair). Final (fair)\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 09, 2014",
            "review_content": "\nI took this class with him last Fall. I was a freshman and did not take calc in high school. This class is ridicouslously hard for somebody who has never taken calc before (there were a good amount of people in the class who had already taken calc in HS). He is not very great at explaining things in class (he's a lot better at explaining things in office hours). Every lecture would go from extremely easy examples and then all of a sudden extremely hard examples. The homework problems were significantly harder than the material that was actually covered in class. The curve was very generous but I really did not learn anything in the class. I believe he curved in my class so that the average was a C+ (55). I should have dropped it...but I stayed and ended up with a P. \nWorkload:\naaaahhh...it took me forever to do the assigned problems every week (we did not have webassign) I believe he dropped the lowest 2 homework grades, 2 midterms + a final. Do well on the first midterm because it only gets worse from there. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 26, 2013",
            "review_content": "\nHe's a nice guy, and means well, but is not a particularly good math teacher. He teaches out of the textbook and does not clarify questions particularly well, as he will simply restate the definition or do more practice problems. That being said, my class was also incredibly shy and wouldn't ask questions, so though he didn't explain questions well, many people simply didn't ask questions and blamed him for not initially explaining topics well. Anyhow, he's a nice guy and if you take your time on the web assign and take practice midterms, an A is not that hard to get.\nWorkload:\nOne web assign problem set (10-15 questions), a few homework problems in the book, not too much. Two midterms and a final, generally pretty hard but with an extremely generous curve (a 55 average became a b/b+)\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "October 19, 2013",
            "review_content": "\nI don't know where to start... And neither does he. He goes through material like the morbidly obese goes through slices of cake (read: fast), and if you don't understand something and ask him to explain, he gives you this look like he's so surprised that you don't get it and then basically repeats what he said before verbatim. I'm generally good at picking up mathematical concepts, but his class made me feel like I was a sloth trudging through quicksand. So, I did what any person does if he/she pathetically doesn't understand the schoolwork -- I got a tutor, who graduated from Columbia with a major in physics (read: math-heavy major). My tutor? My homework made him frustrated too. MY MATH HOMEWORK FOR THIS CLASS CONFUSED A PHYSICS MAJOR WHO HAS WRITTEN MULTIPLE BOOKS ON STUDYING/ACING MATH AND SCIENCE. I couldn't find any reviews for Altug on this site when I signed up for this class, and I wish I had, so let me do all you prospective Calc I students a favor: DO NOT TAKE CALCULUS WITH ALTUG.\nWorkload:\nThree or four textbook questions a week (he makes sure that they're not ones you can check the back for), along with about fifteen Webassign questions of dubious quality.\n"
        }
    ]
}