{
    "prof_info": [
        {
            "prof_name": "Katherine Nautiyal",
            "prof_id": 12053,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "February 26, 2013",
            "review_content": "\nShe is a nice girl but she is totally unexperienced. I did not learn anything from her, only from the book. \nShe tries really hard to prepare the classes, but they turn really boring. Also, she makes up the questions to some of the answers in class.\nShe is more of a graduate student than a teacher and the department should have trained her before. I felt she was just waiting for the opportunity to tell us about the thesis project. \nIn summary, she is OK, but if you are serious about this class, choose a more experience teacher\nWorkload:\nManageable\n"
        },
        {
            "course_name": "Topics in Neurobiology and Behavior",
            "review_date": "December 15, 2012",
            "review_content": "\nTo the review about her \"rudely\" dismissing a girl who needed the class to graduate.  It wasn't so much \"rude\" as it was frank.  The requirements to get into the class is in the class directory and if the girl needs it as her seminar to graduate, she should have known that she needed to get approval before adding the course at the end of the last semester.\nThis class is not bad.  It's all student based presentations of scientific papers (about 2-3 every week for two hours) and the workload isn't terrible at all.  She gives constructive feedback on your presentation and is really nice when you make an appointment to talk to her about the presentation or paper topic.  I liked most of the discussions we had in class about what we liked or didn't like about the studies.  I think it helps you read psych papers a bit more critically.\nI'm not sure about grading, yet, since this is the first seminar course I've ever taken.  We aren't graded on the presentations, so I'm not sure how it'll turn out.\nWorkload:\n2 presentations on a scientific paper (30-45 minutes long), final paper (10-15 pages)\n"
        },
        {
            "course_name": "Topics in Neurobiology and Behavior",
            "review_date": "September 23, 2012",
            "review_content": "\nTo be perfectly honest, the comment below doesn't make any sense.  She doesn't lecture in the class and I'm pretty sure this is the first time she's taught it.  It's all student presentations and discussions.  So far the class has been great.                                                                   .\nTo be perfectly honest, the comment below doesn't make any sense.  She doesn't lecture in the class and I'm pretty sure this is the first time she's taught it.  It's all student presentations and discussions.  So far the class has been great.                                                                   .\n\nWorkload:\nnot too bad so far\n"
        },
        {
            "course_name": "Topics in Neurobiology and Behavior",
            "review_date": "September 12, 2012",
            "review_content": "\nTo be perfectly honest, I felt she was a completely horrible and unsympathetic lecturer. For starters, the second class, I remember her rudely dismissing a girl who apparently needed the class to graduate. She is extremely condescending, though there really isn't any warrant to do so, considering that I've had professors who are much more knowledgeable and down-to-earth than her. I guess that if one has nothing nice to say, one should just not say anything at all...but that wouldn't be very helpful. Workload-wise, the class was very manageable, but I'm very disappointed in the quality of her teaching. I expected so much more from a graduate psych class at Columbia. Most other professors I had in the psych department were great, but if you can, avoid her class, because it will most likely turn out to be an unsatisfying experience at best. \nWorkload:\nManageable; just keep up with the material, and you'll be fine.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "July 05, 2012",
            "review_content": "\nThis lady is seriously the best. I took Mind, Brain and Behavior with her over the summer. They've considered making that course run 9 weeks instead of 6 because there's so much information (and 6:15-9:25pm classes over the summer are not the most conducive to information absorption), but she makes it work. She's engaging and CLEAR and her pacing is perfect -- she goes at just the right speed and always knows when to stop with the information blast for an anecdote or to talk about a study so you can catch your breath. I am NOT a science person but this class was totally manageable because she is just SO good at teaching. Simple as that. I have had a ton of teachers at Columbia University over three different degrees/programs, and she is easily one of the top three best teachers I've had. Seriously, if you need to take this class, take it with her. Even if you don't need to take it!\nWorkload:\nSummer course workload (can't speak to regular school year): Midterm and a final, plus two \"self-tests\" that don't count unless your score on the self-test is better than half of your score on the midterm or final. E.g., you get a 50/50 on the first self-test, but only an 80/100 on the midterm, your midterm score becomes a 90. There's a text book and some reading, but if you pay attention in class you don't need to do it since she's so much clearer than the book and only tests on what she goes over in class. \n"
        }
    ]
}