{
    "prof_info": [
        {
            "prof_name": "Carin McLain",
            "prof_id": 1143,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 13, 2009",
            "review_content": "\nBecause of her pop quizzes it isn't always easy to do consistently well in her class, but she's honestly one of the best professors I've had at Columbia. She is really committed to helping you during her office hours with whatever questions or concerns you have about the papers you're writing for her, and I get the feeling that she genuinely cares about her students. \nWorkload:\nThere will be pop quizzes, so make sure you do almost all the reading (and/or sparknote super-thoroughly). I think she drops your worst quiz.\nMidterm. Final. Two papers per semester. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 29, 2008",
            "review_content": "\nCarin is a nice lady with good sense of humor.   She led discussions well and the course stuck to the texts so if you're looking for some lengthy talks that center on the actual syllabus material, take her class.  My only complaint is that she tends to cater to the kids who think they know everything.  On the plus side, that makes it easy to get good participation marks sense lots of the class is based on student input.  Overall, grading wasn't too bad (B+/A- average) and course work was pretty light.  Oh, and she get us 'magic lasagne' on the study sessions before finals!\nWorkload:\n2 papers per term, fair final, no midterms.  She substitutes pop quizzes for the midterm and only counts the top 5 marks (out of 7 quizzes(.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 29, 2008",
            "review_content": "\nCarin is a nice lady with good sense of humor.   She led discussions well and the course stuck to the texts so if you're looking for some lengthy talks that center on the actual syllabus material, take her class.  My only complaint is that she tends to cater to the kids who think they know everything.  On the plus side, that makes it easy to get good participation marks sense lots of the class is based on student input.  Overall, grading wasn't too bad (B+/A- average) and course work was pretty light.  Oh, and she get us 'magic lasagne' on the study sessions before finals!\nWorkload:\n2 papers per term, fair final, no midterms.  She substitutes pop quizzes for the midterm and only counts the top 5 marks (out of 7 quizzes(.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 22, 2007",
            "review_content": "\nthis class is unbearable. i am switching out. this woman is a little bipolar and she humors too many of the kids who think they know everything. you also don't ahve a midterm, btu rather a bunch of pop quizzes that take place during the semester and are added up to yield a midterm grade. \ndefinitely sucks as far as having to do all the reading. also, a midterm would ahve been more helpful so that we would have had a chance to review some of the material before the final. she did, however, make the final a bearable experience, although i will never know what i got on it since she takes a month to grade a paper, so the length of time she spends on these finals will be enormous. \nWorkload:\nlots of reading...a couple of response assignments, same stuff you'll find in any lithum class. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 25, 2002",
            "review_content": "\nSweet, warm, insightful, her class is a pleasure. Her paper topics and topics for postings are always interesting and aid the student in gaining a deeper understanding of the material. With her enthusiasm for and insight into the works, class discussion is generally illuminating. She may be nice, but since she (rightfully) expects you to actually do the readings, she's not afraid to give a pop quiz every now and then. \nWorkload:\n2 papers (5-7 pages), midterm, final, and 5 response postings. If you've read the material you'll do well on the exams. To do well on the papers, be analytical and avoid summery.\n"
        }
    ]
}