{
    "prof_info": [
        {
            "prof_name": "Carol Gluck",
            "prof_id": 501,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "World War II in History and Memory",
            "review_date": "January 09, 2013",
            "review_content": "\nI thought this class was great but I was surprised how memory-focused it was.  Professor Gluck takes the idea of remembering an event to a whole new level and most of the class is focused on the evolution of the public perception of events from WWII - for example, why do certain testimonies about war atrocities come out at one time or another?, the evolution of German memory of the Holocaust from denial to obsession, etc.\nGluck makes a special effort to present every resource possible to her students in a very sincere, engaging manner.  She even was able to view us a few newsreels that are virtually unavailable to the public, but she was able to get recordings from the French in exchange for her work on the memory of certain events in France during the war. She has us view websites in class, old TV shows, etc., but she finds war memorials and museums a little TOO interesting, which was a little monotonous to me.\nOverall this class is very interesting, but not what you might expect.  While she provides the class with a brief overview of historical events before delving into the memory of them, the class is mostly about geopolitical, social, and economic events that influence and are affected by the trajectory of the memory of WWII.\nWorkload:\nTons of reading and weekly postings that she takes special time to read and (very nicely) call people out in class to reference their ideas.  She even found out that someone plagiarized in their post and threatened that this would result in an immediate F for that person if found guilty.\nOnly one short, 5 page paper for the midterm and a reasonable, pretty standard history course final with some terms to define and essay questions.\n"
        },
        {
            "course_name": "World War II in History and Memory",
            "review_date": "May 07, 2012",
            "review_content": "\nI took this class because of all the great reviews it had but beware, there's a lot more emphasis on the theories of memory than on history itself. Maybe it was just me, maybe it was because this class happened to be at my nap time everyday, but I could not stay awake for the life of me. Professor Gluck keeps her lectures semi-interesting, throwing in made up words all the time (Gluckalytic, chronopolitics, etc.) and mentioning things that you have should have heard about in in high school but didn't. Probably because your state cut the funding for the public education system and you didn't go to school on Fridays. Seemed awesome at the time but you most likely never heard of the Nanking Massacre because of this. Anyways, the made up words are cool until it gets to final time and you realized dictionary.com has no idea what a gluckalytic is, much less chronopolitics. Despite all of this, you really learn a lot in this class--even if you're just cramming it in right before the final (as I'm doing now, sort of...by writing this review). Professor Gluck also lets all of her TAs lecture which is pretty great, most of the readings are amazing (Maus, for example), and the wide variety of material gives you perspectives on World War II that you never could have imagined. But, if your nap time is in the afternoon and you have the capability to fall asleep during class despite the fact that your professor is lecturing on the murder of 60 million people, you might want to rethink taking this class.\nWorkload:\n1 midterm essay which I had an incredibly difficult time writing but is honestly pretty interesting. Weekly readings that you should really do because you have to postings for them. Weekly discussion sections--all the TAs seemed really cool. Final exam, should be fine if you have notes and know your stuff.\n"
        },
        {
            "course_name": "World War II in History and Memory",
            "review_date": "January 04, 2005",
            "review_content": "\nThis class will not only change the way you think about history, but about politics, the media, and just about every thing else in life.  The readings are very manageable.  The majority of them are great, revealing information about major WWII events that you probably never knew.  The great part of the class is that it is very theoretical and opinion-based, not forcing you to read and memorize dates and details, but to think about the way certain events are remembered and their effects on the history of WWII.  Gluck is fantastic.  She is intelligent, engaging, and adorable!  I highly recommended this class!\nWorkload:\nNot bad at all.  About two readings for every class, which are reviewed and explained in class and your weekly discussion section.  The midterm is a medium sized paper and the final is very fair, with pretty obvious Ids and 2 essays.  \n"
        },
        {
            "course_name": "World War II in History and Memory",
            "review_date": "December 31, 2004",
            "review_content": "\nThe class was very interesting and thought provoking.  The teaching style was terrific and the readings were fun (if focused on death and destruction). The class looks at how history and memory of WWII has developed in different studies focusing on several cases: the holocaust, rape of nanking, bombing of hiroshima and nagasaki and the comfort women. It was truly enjoyable and I never wanted to miss class. I want to be Carol Gluck when I grow up. Although she is hard to see outside of class (because everyone tries to) you should take any chances to get to know her because she is great.\nWorkload:\nA 5-page take home midterm and traditional final with id's and essays.  The only annoying thing is that she doesn't give a list of the id's or essays beforehand, and because the course is so comprehensive it seems like you have to study everything.\n"
        },
        {
            "course_name": "World War II in History and Memory",
            "review_date": "December 28, 2004",
            "review_content": "\nIn class, Gluck is a fantastic lecturer, as people have said before.  She really gets you to understand the material.  However, 2 things worth noting about that.  She is somewhat disorganized, although not unduly so.  Her material is also rather repetitive.  If I hear the word \"heroic narrative\" or \"memory activism\" again, I might go and strangle her.\nGluck is also not very accessible to students.  She's happy to answer quick questions after class, but I went to her office 3 or 4 times at the designated office hours time and didn't find her once.  She never responded to emails either.  Only professor I've had so far who's been so inaccessible.\nSo my take on Gluck is kind of mixed.  Don't rush to take her classes, but don't stay away from them either.\nWorkload:\nA moderate amount of reading, take home midterm essay, and final.  Not too bad.\n"
        },
        {
            "course_name": "World War II in History and Memory",
            "review_date": "December 21, 2004",
            "review_content": "\nthis was by far the best history class i've taken at columbia (no joke)!!  gluck is a great lecturer and  the readings were incredibly interesting. the class really opened me up to a lot about wwii that i didn't know about and also how the history and memory of the war still lives on and changes today !! don't expect this class to be about each battle or the politics that led to the war or about nazism or anything.  the course looks at many different themes regarding the war from many different country's perspectives.  this course is a must!\nWorkload:\nreadings/postings each weektake home midtermfair final\n"
        },
        {
            "course_name": "World War II in History and Memory",
            "review_date": "November 16, 2004",
            "review_content": "\nCarol Gluck is a dynamic woman, but her subject is so focused, that the class can become repetative or boring. The TAs all seem to be great, which is important as the sections are mandatory. Gluck tries to incorporate film and images in every class, so that is appreciated.\nWorkload:\nMidterm is a take home paper & Final. Mandatory TA sections with mandatory on-line graded posts. Light Reading that you need to do only for the on-line post\n"
        },
        {
            "course_name": "World War II in History and Memory",
            "review_date": "September 01, 2004",
            "review_content": "\nthis was probably my favorite class in my columbia career. being an avid WWII fan, and someone who really appreciates the conflict between history and memory, this class was tailor-made for me. you couldn't ask for a better professor on the subject. she is not only knowledgable in the east asia sphere, but the entire war. every week was a different topic, and WWII is huge, and you really got a sense of the scope of the war and how it really affected the entire world. professor gluck is extremely approachable and loves to teach, despite her hectic schedule. she also knows like every professor in the world on a first name basis. she's incredible, and i'd recommend her class to anyone that has the slightest interest in the war. \nWorkload:\nweekly posting to courseworks, easy midterm, even easier final. \n"
        },
        {
            "course_name": "W3876: Ideas & Sociey in Modern Japan: 1600-Present",
            "review_date": "May 26, 2004",
            "review_content": "\nGluck is a big name, so that combined with my excitement over the syllabus for this class (see workload below) and the fact that it fulfils a List B Major Cultures requirement made me assume everything would be hunky-dory.  Unfortunately, this was not the case.  First of all, Gluck would lecture straight with no breaks for the entire class, so around 1:15-1:30 almost everyone would start to get a little antsy.  Further, from the first session to the last, she'd go on not for the 1h50m alloted for the class, but for at least 2 full hours, if not 2:10, a seemingly small difference but one that really suck when you're sitting in an uncomfortable SIPA connected desk-chair unit.  Okay, small complaint; now onto bigger ones.  Basically, the class was mixed, about half undergrads and half grads, so from the start the material was oriented more towards those with some sense of Japan's intellectual history and background than those who were just taking it to fulfill a requirement and learn a few things.  I'd taken David Lurie's [awesome] Intro to Japan Civ class the previous semester, so I picked up on some of the facts Gluck would refer to here and there, but if I hadn't -- if I'd taken an intro Chinese class, for example, since intro to Japan isn't a prereq -- I would've been pretty lost.  Also, the woman is clearly a giant in the field, and she spoke like one; unfortunately, the result was that I would drift in and out as she spoke about all sorts of things that were just too complex or detailed to follow and which seemed to be more directed at the grad students than anyone else.  (I might just be stupid, but I don't think that's it.)  The weekly 50min discussion sections were pretty much useless; my TA was earnest and cute (Federico Marcon), but you'd need a 5h discussion section to really explicate Gluck's lectures.  We generally wound up having fairly superficial conversations about fluff.  I got a pretty good grade, because the grading was lenient (as I expected it would be, since neither Gluck or Marcon are stupid and mostly knew that the undergrads were at a lower level than the grads), but I barely learned anything and was bored for most of the semester.  Gluck is continually revising the course (as evidenced by the changing title [it used to be called Intellectual History of Japan or something]), but until she can correct the balance between stultifying academic material and easier, dummy-oriented stuff, you can find a better class.\nWorkload:\nshort, weekly responses on CourseWorks / optional in-class midterm / take-home final consisting of two essays [fake autobiography & thematic]\n"
        },
        {
            "course_name": "World War II in History and Memory",
            "review_date": "January 01, 2004",
            "review_content": "\nThis was a very interesting, original, and groundbreaking class taught by one of the greatest minds in the field of history today. She is creative, involved, brilliant, and oh so approachable. Though at times Professor Gluck had a tendency to lecture, she did so passionately and from experience - any concrete facts came from the readings while she filled in all the real world details.\nWorkload:\nEasy. A medium length paper around the middle of the term (mainly your own opinions), a decent final with IDs and essays, readings for every class (you can skim/skip around as you see fit), one paragraph long response almost every week (she lets you make them up even if they're VERY late).\n"
        },
        {
            "course_name": "World War II",
            "review_date": "December 31, 1999",
            "review_content": "\nGluck's seminar was very good. She has a lot to contibute and definitely offers students the opportunity to learn how to \"write\" history. Very approachable during office hours (though you may have to wait for your turn). Doing the four reports and paper, you get to probe a little further into what often seems superficial examination of regions during the war. However, class time is often taken up listening to reports (and past reports) instead of open discussion. Gluck has the tendancy to interrupt and interject- she ends up talking a lot more than the students. Every week, the syllabus moves to a different country of region. Everyone reads the main book (a secondary source history) and different class members present on fiction pieces, documents, and memory articles. Throughout the course, Gluck has you working on your paper, coming up with a topic, writing a thesis paragraph, rewriting the paragraph, turning in a bibliography, writing an outline and finlly filling in the blanks for the paper. Still, it is a solid seminar and Gluck can be a very helpful adviser.\nWorkload:\n1 Paper 10-15 pages 4 oral presentations Weekly reading\n"
        }
    ]
}