{
    "prof_info": [
        {
            "prof_name": "Mitchell Morris",
            "prof_id": 10722,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Object-Oriented Programming and Design in Java",
            "review_date": "May 20, 2011",
            "review_content": "\nProf. Morris is perhaps the sweetest professor on campus.  He's always willing to listen to students when they voice concerns.  His teaching is pretty standard for a beginning lecturer, and he puts all of his lecture slides online (on Google Docs) so it's easy to follow along if you get lost.  I learned stuff - and yes, I could've learned more with a harder professor - but I didn't have to kill myself at all.\nWorkload:\nFirst assignment was very difficult, next 3 weren't so bad. He drops your lowest score out of 5 (in our case 4), pretty easy/standard midterm/final\n"
        },
        {
            "course_name": "Object-Oriented Programming and Design in Java",
            "review_date": "May 15, 2011",
            "review_content": "\nThis class was totally hopeless, and not because of the material but because Professor Morris taught it horribly.\nI think he is a very busy PhD student and did not have the time needed to teach an important class properly. It is really completely the department's fault for hiring him to teach this class.\nI thought this class was going to be my hardest class but it was almost my easiest. Almost half the class averaged at above 90% I think. The lectures were terrible, the slides were all taken from the book and the few times I went I always started falling asleep - Mr. Morris would just stand at the front and go on rather incoherently - I couldn't really follow him and he undoubtedly had very bad communication skills as a lecturer. I stopped going to lectures after the first 2 weeks and just read the textbook which had everything we were expected to know and did well on both the midterm and final.\nThe homeworks, except for the first one, were all trivial. They barely took me anytime and I felt that I wasn't learning anything as they didn't require any thinking at all. I definitely spent more time on my homeworks in 1004.\nTry to avoid taking classes with this professor if you can, he does a bad job of teaching whether or not it's his fault or that of the department. You also won't learn anything.\nWorkload:\nLight\n"
        },
        {
            "course_name": "Object-Oriented Programming and Design in Java",
            "review_date": "May 11, 2011",
            "review_content": "\nThe Good: Prof Morris is very nice and approachable. He is very easygoing. \nThe Bad: Despite the fact that he does put effort into the class, Prof Morris is too disorganized and not a good lecturer. He literally takes EVERYTHING from the book, so all you have to do is take the book to lecture (if you even ended up going after a week) and read the parts the Prof Morris does a really bad job of explaining. For the most part, he knew what he wanted to teach but had a very hard time trying to teach it. In addition, the assignment grades were always very very late, and overall pretty easy. Funnily enough, the course started with the hardest homework assignment and every one after that got gradually easier.  You might as well read the book on your own for all you might take away from Prof Morris class. \nIf you want to have a pleasant chat, however, he is a great guy who knows his stuff. He just doesn't know how to teach it. \nWorkload:\n5 Homework Assignments (though he ran out of time and cancelled the last one), a Midterm and a Final (which was surprisingly easier than the midterm). \n"
        },
        {
            "course_name": "Object-Oriented Programming and Design in Java",
            "review_date": "May 01, 2011",
            "review_content": "\nProf Morris cannot teach.  Sorry.  He should stick to his PhD studies.  He cannot effectively convey his thoughts or a lecture to a class.\nHe stumbles constantly and his slides are very disorganized, meaning that every lecture he will apologize for having already said this in another slide or referring to a slide he will cover 5 slides later.  His board skills are also very lackluster.  I would not hire this guy nor would I want him to teach me again.  He is too hard to follow, even though he's a native English speaker.  All of his spelling and grammar mistakes in his slides are quite distracting, too.\nAs for COMS1007, it's a fairly useful class if taught right.  Take it with Kender.  The text is OK, although Big Java, also by Horstmann, is generally more useful.\nWorkload:\nAverage.\n"
        }
    ]
}