{
    "prof_info": [
        {
            "prof_name": "Carlton Voss",
            "prof_id": 5666,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Chromatic Harmony and Counterpoint I ",
            "review_date": "December 17, 2009",
            "review_content": "\nDull, dull, dull, dull, dull. Voss has no personality and this comes across in his teaching. Everything about him is the embodiment of the word 'neutral'. He provides no incentive to come to class (attendance is not factored into your grade) and does little else in class than correct assignments. If you can keep yourself from falling asleep, you'll find that he has a very thorough knowledge of his material and presents everything clearly and effectively. He has no wit or humor and this makes every interaction with him stilted and boring. Despite his stiff demeanor, you will come to realize that he is very laid back. I don't get the impression that he cares any more about the class than his students do, which is unfortunate. He could teach a great theory class if he wanted to. Like all theory teachers, he is meticulous with his grading and pretty harsh. Even with effort, don't expect to come out of the class with anything higher than a B+.\nWorkload:\nAverage for music theory: weekly assignment, midterm, final.\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "November 05, 2009",
            "review_content": "\nI agree with the reviewer below on one point- his classes are difficult. But if you try hard and won't be devastated by a B, you really learn the subject thoroughly. If nothing else, the difficulty of the homework makes you better able to appreciate how great some composers were at counterpoint/harmony... \nI personally found that he was always willing to go over homework and to review any points that were unclear. You just have to ask, and not in a whiny, annoying way! He doesn't really do the \"compliment sandwich\" thing, and sometimes comes across as a bit harsh, but he's honest, means well and knows his stuff.\n\nWorkload:\nheavy but worthwhile\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "October 11, 2009",
            "review_content": "\nThis guy made me dislike music so much, that I switched music.  Pedantic, mean spirited, and a harsh grader with equally harsh words.  ABOID AT ALL COSTS!\nWorkload:\nVery hard. \n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint I, II",
            "review_date": "September 05, 2006",
            "review_content": "\nVoss is absolutely amazing- he really knows his shit and is very laid back and easy to get along with. He doesn't care about attendance, but is a bit of a hard grader. He's extremely educated and intelligent, and seems to know the answer to the most obscure and esoteric questions right of the top of his head, and then some. Chromatic Harmony is meant for students who love theory, analysis and composition- we spent long classes analyzing single phrases within a piece. It can get a bit boring, but I highly recommend Voss for any music class. \nWorkload:\nModerate- weekly homework assignments, a composition, a final project that is an in-class presentation of a piece that you analyze. \n"
        }
    ]
}