{
    "prof_info": [
        {
            "prof_name": "Bridgid Finn",
            "prof_id": 3270,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Cognition:Basic Processes",
            "review_date": "April 14, 2008",
            "review_content": "\nI'll keep this short. Bridgid Finn is a nice woman but a totally average professor. I didn't learn anything this semester. Nada, nothing, zip. But it wasn't hard to get a B+/A- if you stay in her good graces. \nWorkload:\nWhat's the point?\n"
        },
        {
            "course_name": "Cognition",
            "review_date": "April 02, 2008",
            "review_content": "\nThis course covers many different fields of psychology, and given that it spans so many areas, I can imagine it's pretty difficult to condense and select material to present in lectures.  Professor Finn does a decent job at this.  The textbook is a bit dense, but reading it does help tie things together.  Attending class is important, since the quizzes and exams are largely based on lectures.  The questions on the exams require good conceptual understanding of the material.  Memorizing information isn't enough to do well.  \nWorkload:\nmanageable- 3 quizzes, 1 midterm, 1 final, 10-page final paper, weekly thought question responses\n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "July 30, 2007",
            "review_content": "\nBrigid's lecture style is completely nonlinear which can make her difficult to follow. Her comments are not wholly relevant and she lacks the experience to really explain any of the key concepts in cognition or learning/memeory. Neither does she have the hard science background to answer biology or anatomy questions. In total she seems more of a compelling high school science teacher than a thought provoking university level instructor. \nThe exams she writes are taken right from quotes on her slides so if you don't remember (and can't regurgitate) the slides verbatim, you're out of luck.\nBy the second half of the semester one third of the class had dropped and another third skipped the tedious power point lectures on a regular basis.\nWorkload:\nOne 1 page discussion question weekly, two quizes, one midterm, one ten page research paper.\n"
        }
    ]
}