{
    "prof_info": [
        {
            "prof_name": "Zipora Rubin",
            "prof_id": 1018,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Hebrew: Intensive Grammer review_content",
            "review_date": "May 13, 2012",
            "review_content": "\nZippi is an excellent Hebrew instructor. She genuinely cares about her students and will make sure she is going at a level that works for the class. She teaches the material in a clear and thorough way and I felt like my grasp of the language really improved. Zippi  supplements her classes with reading Hebrew articles, which makes the material come alive. She is an amazing teacher and person and a pleasure to get to know both in and out of the classroom.  Overall, I highly recommend that you take this class if you are looking to improve your Hebrew grammar skills! \nWorkload:\nThere are frequent quizzes but they are fair and extremely helpful since they force you to stay on top of your work!\n"
        },
        {
            "course_name": "Elementary Modern Hebrew I",
            "review_date": "May 10, 2012",
            "review_content": "\nProfessor Rubin is a terrific teacher; dedicated, engaged, and friendly; as other reviewers note, she  relates in a very human way to her students; all attributes that one learns to cherish when getting up at 9 am four days a week. My own experience is that if one really wants to learn a language, the teacher needs to continue challenging you in class, nudging you gently out of comfort zones; making  sure that you do learn to speak, and listen, as well as write. Rubin did a great job I thought in gradually ramping up the level of conversation in class and the expanding the vocabulary requirements progressively, without the class for that reason becoming in any way unmanageable. She also took  time  outside of regular hours to make sure that individual students did not fall behind. All the while, she also did a great job providing supplementary readings to complement the  textbook that we used in Hebrew I, 2012, which while adequate in many ways, felt a bit like a Beta-test edition, replete with errors. In summation, ignore the horrible and ill-considered 5 year old review of Professor Rubin that unfortunately comes up first when viewing her profile on CULPA. She is a great teacher.  If you are willing to put in a decent amount of work, not at all excessive in my mind, then you will have a terrific experience with her. And you will learn Hebrew. I do hope she stays on with the department.\nWorkload:\nQuite easy in fall term, more demanding in spring, but still very reasonable.\n"
        },
        {
            "course_name": "Elementary Modern Hebrew II",
            "review_date": "May 03, 2012",
            "review_content": "\nThis was an excellent introduction to Hebrew by an outstanding teacher.  She was patient and adept at handling the different speeds and backgrounds of the students.  She also brought to life much of the material that we covered, showing us the various connections between grammar rules and formations and fitting them into a larger linguistic frame.  The presentation of material was methodical and systematic.  Her style was direct and clear, but always friendly and supportive.  We covered an impressive amount of grammar and language in a relatively short amount of time and it never felt rushed.  Moreover, she is generous with her time and always willing to meet students to go over issues and material or simply to look over written assignments individually.   It would be most beneficial to this group of students if this instructor could continue with us to provide Year 2 Hebrew.  This continuity I feel would be of serious benefit to all of us, given her familiarity with us (and our various strengths and weaknesses) and our familiarity with her teaching method.\nWorkload:\nFair and varied enough to keep it interesting.\n"
        },
        {
            "course_name": "Elementary Modern Hebrew I",
            "review_date": "January 23, 2005",
            "review_content": "\nTzippi (as she has no problems being called), was nice enough, but I must say that I have a hard time with the method of teaching they use for this language, and I DON'T LEARN BY SOMEONE YAPPING AT ME IN ANOTHER LANGUAGE REALLY QUICKLY WHILE I FURIOUSLY SCRIBBLE NOTES AND CAN BARELY GET A QUESTION IN EDGEWISE!! Others didn't seem to have such a problem with her, but by the end of semester, I was so damn frustrated and had skipped many classes, so I was not very popular with her, to say the least. Sure, I have ADD, but I felt her teaching speed for the level we were learning on was bullshit. My notes were a mess (she doesn't teach concepts/ words in anything less than complete randomness) and I found myself throwing my arms up in the air in a huge exasperated \"OY!\" most of the time. \n If you are anything like me and need a slower, more deliberate language teacher, in whose class you will have SOME time to think about the ordering of your notes as you write, then take Tamar Ben Vered's Hebrew I class instead!!!!\nWorkload:\nyaaa! don't fall behind on book exercises! final test was not easy. Get tutoring if you're not following so great, and do it early on!\n"
        },
        {
            "course_name": "Elementary Modern Hebrew I",
            "review_date": "April 09, 2002",
            "review_content": "\nGREAT! Really nice - young and hip Israeli woman... much more personable than any other option, not too strict, and not too harsh with grading or latenesses and absences. She really wants you to learn and to love the language itself and she cares about her students as PEOPLE. She'd make a really great friend.\nWorkload:\nLotsa homework and quizes and some language labs - not a lot for a language though.\n"
        }
    ]
}