{
    "prof_info": [
        {
            "prof_name": "Gerald Curtis",
            "prof_id": 1792,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Japanese Politics",
            "review_date": "January 28, 2014",
            "review_content": "\nIn short, I am very glad to have taken this class. For starters, Curtis is quite an engaging lecturer and I fairly enjoyed his anecdotes about living in Japan. You can get a lot of the required material just from going to his lecture (but do reading as they will help you in getting a better essay grade). I think a lot of this course depends on picking and choosing which readings are truly essential to the course. \nAs an established scholar in Japanese politics, he definitely know his stuff and has high but clear expectation from his students. Yes, the TA does most of the grading but Curtis goes over each paper (which my other SIPA professor did not do). The papers are not graded lightly so you still have to do a fair amount of work for an A or A-.\nFYI: The undergrads are not graded easier than the grads (trust me, I asked). I was also under the impression that the class is somewhat curved (30% A's)\n\nWorkload:\nMedium-High in terms of reading\n1 take-home midterm (pick 2 essay topics, 1000 words each)\n1 take-home final (pick 2 topics, 1500 words each)\n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "January 17, 2012",
            "review_content": "\nOne of the best courses that I have taken at Columbia University. Professor Curtis knows everything about Japan and its politics, and most importantly, its main politicians, almost all prime ministers except one since the 1970s.\nThe best thing about him as a professor is that he cares about his students and wants to interact with them to learn about them and to know them individually.And he is a personality. Wearing a pair of sunglasses when lecturing in the first two classes and talking about how big a drinking appetite he has when he returns to Japan for socializing with his informants of the Japanese community in Tokyo.\nFor the book review assignment, when students want to write something interesting that others have not written before even though the scholarly material is not enough, he encouraged them to go ahead even though the final ones might lack substantial material. He likes to see fresh new ideas, even though they might not be fully developed during his short course in Fall.\nAnd he does not like the word \"political scientist\", blaming them as second-rate economists. He likes to describe himself as an anthropologist or sociologist, just writing down the facts about history and societies, not trying to make up boring theories.\nTake this Class!\nWorkload:\nLight. One in-class midterm and one in-class final. A 10 page book review of things about Japan that can interest him and you. For Fall 2011, as we did pretty well, he even waived the final and added 2 pages requirement to the book review. How considerate!\n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "March 30, 2010",
            "review_content": "\nAlthough Professor Curtis' anecdotes can be repetitive (I don't know how many times he mentioned the importance of the Hatoyama government to not \"think out loud\"), they are still varied enough to make his lectures enjoyable. Although there were numerous complaints about his inability to show up to office hours and the disorganized nature of his lecture style, the real point of taking Curtis is to be able to listen to his experiences dealing with politicians for almost a half century. This does make it vital however, to get a good TA to discuss the readings and your final paper with, because Curtis only focuses on his own theories in class.\nFor people who want a more traditional lecture-style that focuses on concrete definitions and theories, he did bring in a guest professor who spent 75 excruciating minutes droning through the basics covered in any Intro. to Comparative Politics course. \nCurtis also insists that undergraduates are graded more leniently than the numerous graduate students, so it is fairly easy to get an A.\nWorkload:\n1 take home midterm (2 questions), 1 10 page paper on topic of choice\n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "January 06, 2010",
            "review_content": "\nI'm sorta mystified by all the glowing tributes about Curtis on this page. I've taken two classes with him, and both consisted of hearing over and over again stories that begin, \"When I was out with [Prime Minister's Name] he told me [self-aggrandizing anecdote].\" Or his infamous 'taxi story', in which he tells his students that he's in-touch with the common Japanese people because he talks to taxi drivers on the ride between Narita and his apartment in ritzy Roppongi. Nevermind that normal Japanese people take the train. \nI know it's easy to get enchanted by reputation, and i was at first as well, but upon thorough self-examination after completing his courses, I realized he had taught me next-to-nothing, except for how to assemble a reading list about 20th century Japan, which he never actually discussed in class. Even his books were disappointing. Over his 4 decade career, he's published 4 books, two of which i've read, 'logic' and 'way'. These books are extraordinarily pedantic and cumbersome, and offer very very little in the way of meta-analysis or significant insight.He's built a career on essentially being a bizarro oral historian, in which his information comes from the powerful instead of the powerless. But i think it's important to remember that access doesn't equal research, it only equals status. In fact, his cozy relationship with the LDP probably hinders his ability to see the political landscape clearly. \nIn short, this man is not a teacher, because anecdotes are not education. He's not a mentor, as numerous reports of him being an 'absentee advisor' seem to show. And as a scholar, he's built a reputation based on an admittedly impressive social network (but don't get your hopes up- he's not the type to take a scrappy youngster under his wing).\nUnfortunately, he's sorta the only game in town for Japanese politics. Still, there are bright spots on the horizon at CU. Take a class with Kay Shimizu for politics/economy or Kim Brandt for social history. They actually teach.\nWorkload:\nMidterm\nFinal\nPaper\n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "February 15, 2009",
            "review_content": "\nWhen he's not redundant he is a pretty good teacher and it's not a bad class.  However, someone needs to clear up this easy grading thing.  It's not the easiest course in the world.  According to my transcript, only 31% of students in the class got in the \"A\" range (A+, A, or A-).  That's not too high for a polisci class.  You are going to have to do a pretty decent chunk of the reading to get an A.  And you have to go to sections (if you are an undergrad).  \nIf you are interested in Japanese Politics by all means take the class, but don't assume you will get an A as reviewers below suggest.  \nWorkload:\n2 take home exams, one 10 page paper, plus sections.  \n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "July 22, 2008",
            "review_content": "\nIf you are even remotely interested in Japan or Politics - you NEED to take this class. I absolutely LOVED it. I went to every class excited about what he was going to teach us next. And like previous reviewers have mentioned, he doesn't just teach stuff that you can learn from books, he tells you about his personal experiences (of which there are many), which are probably the most interesting part of the class. He's met every important Japanese politician and can give you an insightful answer to any of your probing questions about the current situation in Japan. In addition to being a great lecturer, a fair grader, accommodating, open to taking in undergrads, he is also a brilliant scholar. He's featured on various Japanese TV shows and he has written articles in major Japanese newspapers. You need to take this class.\nWorkload:\n1 Research Paper, 1 Midterm/Final. Impossible amount of reading but all interesting - try your best.\n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "February 15, 2007",
            "review_content": "\nCurtis is my favorite lecturer in the poli sci department. The once-weekly two-hour lectures feel like a conversation with the professor even though the class has somewhere around 50 students (mostly Japanese SIPA students but there are about 15 undergrads every year). Like the previous reviews have noted, this guy knows EVERYTHING when it comes to Japanese politics. Not just superficial information you can get from a textbook (although the two books he's written on the subject are very good) but also all the backdoor stuff. You get to learn about the personalities of the various prime ministers. The informal meetings  Japanese politicans conduct at expensive Akasaka ryotei. Since this was a big election year for the ruling Liberal Democratic Party, a lot of the fall semester was spent discussing the implications of Abe's rule and what the end of the Koizumi era meant for Japan. During the second half of the semester, he changed up the syllabus because he felt our responses to the midterm displayed a lack of understanding concerning Japan's \"pacifist\" foreign policy. He's very fair. Knows his shit. Bonus is that he and his TA grade generously. I learned so much from this class and would recommend it to anyone.\nWorkload:\n1 midterm consisting of two, 7-9 page essays on assigned topics. The final is a choice between a longer (15 page) research paper or two shorter essays (pretty similar to midterm format). Curtis seems to prefer the research paper option for the final since I'm sure reading about the same thing gets really boring.\nMandatory discussion section for undergraduates (the TA took attendance but not sure if it counted for anything).\n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "December 21, 2006",
            "review_content": "\nCurtis by far is one of the best professor i have taken in columbia.  Ive experienced with many professors in the past and im pretty sure a lot of you have faced those blackboard facing professors who just read off their note sheets which will bored you to death.  Or professors that tried to be funny to keep your attention but failed to address the important things for the class.  Curtis manages to give an interesting lecture and yet keeps you a higher understanding of Japan.  He's work load is not that much actually.  A lot of reading assignments but not all is necessary to read to do well in class. \nHe grades fairly easy and some might argue that the reason why most people take his class.\nHe grades fairly lenient but i am very confident that people walked out of that class are going to learn something about Japan.\nUnlike certain classes.. you study just to know how to get an A, you read, study, and listening to his lecture because you want to... not for the grade on your transcript.\nI, myself is not a political science major.\nPrior before i took this class, i wasn't expecting much from it.. im just taking to satisfy my requirement. However, his lectures made me feel like you are sitting down with a room of people talking about politics.. Stuff you learned in his class will stay in your head... I mean isn't even be better than a professor can manage to make the class easy while still able allow students to learn a lot from it?\n Aside from that Curtis has an enormous knowledge of Japan.  There is nothing he cant answer...  Especially when i was doing research for the final exam paper, half of the sources i was reading all cited curtis works.  This shows that he really got the authority of the subject..\nI highly recommend this professor... what makes columbia an ivy league school that provides better education is because you have professors like curtis.\nWorkload:\n1 midterm 1 final, both take home paper.\nFinal is longer than the midterm but both worth 50% grade very lenient...\nyou cant really get a B or lower.. unless you dont goto class at all... \n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "January 24, 2006",
            "review_content": "\nProfessor Curtis is a great professor. He knows more about Japan than anyone in the university. He had met all but one of the last 16 Japanese Prime Ministers and provides great insight into the true operations of the country. He sometimes goes off on tangents if they relate to one of his experiences, but can answer any question you ask him. His lectures are overall interesting and he is very accessible in his office hours.\nWorkload:\nMidterm with in-class (1 hour short answers) and take home (6 pages) parts, final paper (22 pages). Some years he also includes 20 page research paper. There is 100-200 pages of reading per week and a discussion session for undergraduates.\n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "November 18, 2005",
            "review_content": "\nHoly crap this class was amazing.  First of all, this is not your normal political science class.  Curtis knows an incredibly amount about Japan, and his knowledge is not limited to political science.  Instead his lectures are filled with amazing anecdotes that gives you a great understanding of Japanese society as a whole.  I feel like I've learned so much about Japan in such a short period of time.\nIn addition, Curtis is extremely friendly and is interested in what all of his students have to say.  Not many professors teaching graduate level courses will make a point of taking just the undergrads out to dinner.  Curtis makes the effort however.\nThis is probably the best course I've taken at Columbia and I would recommend it to anyone who even has a remote interest in Japan, you won't regret it.\nWorkload:\nInteresting readings.  He is a VERY easy grader which only enhances the awesomeness of this class.\n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "December 20, 2004",
            "review_content": "\nI recommend this class to any undergrad. It is practically the only worthwhile class I have taken at Columbia; I learned a lot about Japanese Politics and consider myself very knowledgeable about the subject even though I had never taken a politics class in my life prior to this.\nThe workload is only reading, really. It's pretty heavy, but manageable. It's worth it, too, since most of it is interesting stuff. Curtis' lectures are two hours long, once a week, but vastly entertaining. This was definitely a class I did not want to miss, and everyone I talked to felt the same way.\nWorkload:\nReadings, 1 Short Paper, 1 Research Paper, 1 Exam\n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "December 18, 2004",
            "review_content": "\nRemember how the admissions people told you that coming to Columbia meant studying under the best scholars in the world? Well, Curtis is one of those scholars. His knowledge of post-WWII Japanese Politics is unparalleled and tremendously interesting. The class itself is engaging, especially when he goes off onto some sort of tangent that leaves him telling a 45 mintue story. These stories turn out to be not only informative, but some of the best parts about the class. Don't be troubled by the grad students. They're basically harmless and, in theory at least, your work is not graded on the same scale as theirs. Speaking of which, Curtis is a very lenient grader (also very helpful'approachable in office hours). I highly recommend this class to anyone even the slightest bit interested in Japan or politics.\nWorkload:\nBe prepared to live in Lehman library and read hundreds of pages per week (runs the gamut from fascinating to soul crushing). One 5-7 page \"think piece,\" one midtem (6 IDs, 2 essays that he talked about beforehand), one 3000-4000 word final paper (must cover a \"specific\" topic related to Japanese politics\").\n"
        },
        {
            "course_name": "Japanese Politics",
            "review_date": "November 18, 2003",
            "review_content": "\nProf. Curtis is the man in Japan.  He has a great deal of real life experience ranging from working on Japanese Diet Campaigns to advising LDP leaders and the PMs themselves.  He teaches from both the academic and experienced based ends of the spectrum.  As a result, the class is not boring and one really learns how Japan works and what its political system must do to adapt to changing times.  He tells a lot of great stories and definitely provides his students with a way of looking at Japan that they will not get from any other class. If you want a truly enjoyable experience and to learn in an extremely amiable envirnment from the man who wrote the book on Japanese politics, definitely, definitely take this class!!! Don't worry about the grad students, the material is extremely acessible and undergrads will have no problem doing well. Lecture is a must and the class is always in full attendence, you do not want to miss what he has to say.\nWorkload:\nWeekly readings, on par for a class of this level.  A midterm (not bad at all) and a final research paper (15 pages) with the requirement that it must be \"interesting.\"\n"
        }
    ]
}