{
    "prof_info": [
        {
            "prof_name": "Tomi Suzuki",
            "prof_id": 56,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "April 12, 2006",
            "review_content": "\nProfessor Suzuki is funny and amazing.  She really knows what she is talking about even though it is hard to understand her English at times.  This was one of the best classes I have taken this year.  There is a lot of reading that is really interesting, but you only meet once a week for two hours and its four credits.  This is an excellent list B class for the major culture requirement but it is a lot of work that is manageable.\nWorkload:\n150+ pages average per week.  250 word response each class.  One 5 minute presentation.  Two 6 page papers on the topic of your choice.  And a take home final of essays and questions on the readings.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "May 21, 2004",
            "review_content": "\nAn extremely nice and generally agreeable teacher, Suzuki will generally give a brief historical background on the book we're reading without trying too much to actually demonstrate the bearing it has on the text, then try to get the students to discuss it with her there only to act as a guide.  This worked out fairly well and made this a class I looked forward to attending.  Expect to hear the word 'interesting' uttered at least 10 times every class.\nWorkload:\nA lot of reading each week as well as an obligatory post to be made on Courseworks.  Two essays, the topics of which to be your choosing, and a final which consists of ... wait for it ... essay questions.  She's an easy grader so it's not too bad.\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "May 29, 2002",
            "review_content": "\nvery interesting professor, well versed in everything she teaches, constantly adding insight to the text. she appreciates when you participate, though is more interested in people making a few interesting comments, then constant jabbering. encourages people to write papers with a new perspective. I found her to actually be an easy grader, then again, I went to class, read, and learned. quite a difference from what most columbia students are willing to do.\nWorkload:\nlots of reading, but most is very interesting, and if you do the reading the papers and exams will be a cinch.\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "May 29, 2002",
            "review_content": "\nvery interesting professor, well versed in everything she teaches, constantly adding insight to the text. she appreciates when you participate, though is more interested in people making a few interesting comments, then constant jabbering. encourages people to write papers with a new perspective. I found her to actually be an easy grader, then again, I went to class, read, and learned. quite a difference from what most columbia students are willing to do.\nWorkload:\nlots of reading, but most is very interesting, and if you do the reading the papers and exams will be a cinch.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "December 31, 1999",
            "review_content": "\nShe's so bad that I avoided taking what seemed to be a really fascinating ealac course, just because she taught it. I feel awful saying that, but it's true, even though she's really, um... sweet. Somewhat incompetent, and often incoherent, but sweet. don't expect any titilating roundtable discussions here; though if you contribute, she'll be sure to support what you say. discussions tend to randomly meander, eventually dwindling and dying. the longest two-hours of my life were in her class.\nWorkload:\ntwo papers and an oral final. she grades a bit toughly.\n"
        }
    ]
}