{
    "prof_info": [
        {
            "prof_name": "Frederick Wherry",
            "prof_id": 12176,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Cultures, Markets & Consumption",
            "review_date": "December 25, 2012",
            "review_content": "\nAmazing. I never thought of myself as an \"econ person\" and took this class because I have a strong interest in sociology/anthropology. This class is amazing and has totally turned me on to behavioral economics. You could describe it as a lot of things - behavioral econ, economic sociology, etc - but it's too interdisciplinary of a course to call it just one thing. We go over cognitive psychology, basic econ, sociology, anthropology of markets, and more.\nA really useful class for pretty much anyone, whether you're an \"econ person\" or a social justice person or just a person interested in patterns of consumption. Very well-organized class. If you miss lecture, do the reading; if you forget to do the reading, go to lecture - in both cases, you'll be fine for the midterm/exam. (I recommend doing both  when you can, though - the readings are interesting and the lectures are great!)\nWherry is amazing. Funny, clever, engaging, and has very reasonable expectations for the class. I feel like I learned a lot without being overly taxed with pointless readings or busy work. I'm not sure if this will be in the sociology department the next time it's offered, but I'm pretty sure Wherry will be giving it again in the fall. Take it!\nWorkload:\nTwo papers (and an optional third paper if you fail the midterm). Both of the papers are VERY fun to write, and the guidelines for each are made very clear. If you follow the instructions and put in the time, you'll do well. Both the midterm and final are basically just key term identification; Wherry makes it clear which terms you're expected to know and which readings you're expected to draw examples from. If you're interested in the material, you'll do well. And it's very, very interesting material!\n"
        }
    ]
}