{
    "prof_info": [
        {
            "prof_name": "John Morrison",
            "prof_id": 9816,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Perception",
            "review_date": "December 21, 2016",
            "review_content": "\nI took his perception course, and I would definitely recommend it! I am an undergraduate so naturally it was very challenging for me, but the way Morrison presents the material is very clear and straightforward.  He is very sweet and funny, and the class is very enjoyable because it is so small and the readings are so engaging.  He's really laid back about attendance, I had to miss a few classes for medical reasons and he didn't dock my grade.  Overall it was a great class!\nWorkload:\nNothing except 1-2 readings every week (~60 pages each) and a 15-20 page essay at the end of the semester.\n"
        },
        {
            "course_name": "Introduction to Logic",
            "review_date": "June 13, 2016",
            "review_content": "\nDespite the occasional flub when reading from his slides, as well as a sometimes frustrating ambivalence about just how to relate the material (in other words, having trouble explaining certain concepts), Professor Morrison is very witty and clearly dedicated to his students' success. If you need to fulfill your Quantitative Reasoning requirement and are unsure about which class to enroll in, I do recommend taking Professor Morrison's course. Just make sure to attend, because it will really help with the tests (which are always steeped in whatever material has been discussed, with no unpleasant surprises).\nWorkload:\nSoftware-based homework problem sets due before each of three exams. If you get the problem wrong, you achieve 80% credit. If you get the problem right, you achieve 100%. You may submit each problem as many times as you wish, with only the highest score officially recorded by Professor Morrison.\nThree exams, including a non-cumulative final.\n"
        },
        {
            "course_name": "Introduction to Logic",
            "review_date": "November 26, 2013",
            "review_content": "\nOne of the BEST professor you could ever have! Funny, smart, approachable, what else could anyone ask for? Despite having two TAs, I went three times to his office hours and he was so nice! And the TAs themselves are very helpful!\nBy the way, I'm taking this course right now and I'm a freshman. It's quite easy if you keep up with the reading and homework, but more importantly, it's fun! Professor Morrison is pretty straightforward concerning the exams material, telling you exactly what you need to know to get a good grades. The class's average is quite high in the two midterms we've had, so it's not hard or confusing.\nHe's also easy on the homework: it's only 10% of the grade and you just have to submit it before the exam! but the catch is that you don't earn any credit for it. But if you submit it before next class you earn full credit.\nWorkload:\nTwo midterms and a final. Constant homework that let's you keep up with what's going on in class. Overall not much work.\n"
        },
        {
            "course_name": "Psychology and Philosophy of the Human Experience",
            "review_date": "November 09, 2013",
            "review_content": "\nDO NOT. DO NOTTTTT TAKE THIS CLASS. I was a freshman when I took this class and I am psychology major now. I can honestly say this is the worst class I will probably take in my four years. It was so disorganized, confusing, and mind-numbingly boring. Granted, the curve was gracious. But in the end, that did not make up for the stress I went through before the midterm and final. Just don't do it. Don't. DO NOT.\nWorkload:\nA midterm and final (open ended essays). Heavy reading throughout the semester that is impossible to keep up with.\n"
        },
        {
            "course_name": "Intro to Logic",
            "review_date": "November 08, 2013",
            "review_content": "\nI took this class to fulfill my QR requirement, and have no background in either philosophy, cs or math.  After everything I had read on Culpa, I thought this intro class would be quite good, even enjoyable.  Boy, was I mistaken.  All other reviews notwithstanding, this professor clearly has absolutely no interest in teaching this course currently.  This is a shame, as I had spoken directly to two of his previous students who raved about him, and can see where it would be interesting subject matter if I didn't have to literally teach it to myself with the help of a tutor (which I pay for out of my own pocket).\nThe major problem is that Professor Morrison doesn't teach.  He distributes slides before class, then posts the slides up on a projector and reads them, word for word, to the class.  When he's done reading, class is over, which usually occurs about 40 minutes early.  Class that's scheduled to last for 80 minutes usually ends in about 35-40 minutes.  While many students might think it's great to get out early, I would prefer to actually be taught the material and the methods behind doing things like proofs, not have someone read me his slides verbatim then slip out when class is barely half over.  He does ask before he concludes if anyone has any questions, but is generally met with blank stares, so takes this as meaning everyone magically absorbed the material he just read to them.\nHe does offer review time in class before each exam, which is probably the only time the classes run closer to their full scheduled time.  This is quite helpful, but it's difficult to review practice questions when you have no idea how to do a proof.  His mantra is \"to get comfortable with proofs you have to practice them about 1000 times.\"  That's terrific, but I wouldn't exactly be able to sit down at the piano to practice Chopin if I had never been taught how to read the music.\nThe TAs hold \"office hours\" 2x/week (in cafeteria lounges with loud music and TVs on the walls), and a review session prior to each exam, but are not required to attend the classes, so if you ask them a question about something that was presented in class, they have no context.\nGiven the previous reviews, I can only think there is something else the professor is currently focused on.  Upcoming tenure, publishing a book, I'm not sure, but whatever it is, his focus certainly is not on this class, and at a tuition cost per-student in excess of $4000, that's not exactly good value for my money.\nIf you have a philosophy, mathematics or cs background, you'll probably be in good shape for this class.  Anyone else, you might want to look elsewhere for a Core requirement or elective choice.\nWorkload:\nCourse grading is broken down by 3 equally weighted exams (30% each), and 10% for homework assignments.\nHomework is done via 4 software programs that come with the textbook, Language Proof & Logic, which allows a server at Stanford to grade the assignments (instead of the TAs having to grade them manually - great for them, not so much for the students).  The software is terrible, in that it is not intuitive to navigate and quite buggy; print functions don't work, submissions often result in vague error messages, etc.  Having to do the work then enter into and try to submit through these programs results in a huge time investment.  You receive almost full credit just for submitting the file, even if it's wrong (8 out of 10 points), but if you want to learn the material in the course, the homework is extremely important to do correctly. I have no problem investing hours doing my homework, but do have a problem wasting time with bad software.\nLastly, several of the more time consuming homework problems don't map to the material covered on exams, so are pretty much a time-consuming waste of time.\nThe workload and level of difficulty ramp up significantly from the first exam to the last.  \n"
        },
        {
            "course_name": "Intro to Logic",
            "review_date": "January 19, 2013",
            "review_content": "\nIf there's one word to describe Introduction to Logic with Morrison, it's straightforward. \nFirstly, let's look at the grading scheme: Three Exams, each 30%, and Homework Problems worth 10%.\nThe homework problems are from the textbook and are given 8/10 points just based on submission of an answer; this is one of those classes in which I'd assume everyone does decently well on the homework since there's little excuse to actually get a problem wrong. Homeworks are recommended to be done concurrently with lecture, but are only due before the test which covers that material, so it's possible to only submit the HWs right before those tests and get full credit.\nThe exams are heavily based on the lectures. Morrison's lectures are concise and clear, and are very focused on definitions. For example, with each new term you learn like \"tautological consequence\" you'd have a definition of the term, then examples in which it is applied in potential problems. Exams take the potential problems that are found in these lecture notes and either repeat them or expand on them. For this semester, the first two midterms had questions that were simpler than or equivalent to the practice problems, while the final featured two \"advanced\" problems that were decently difficult (even though we had received advanced practice problems).\nAll in all, this is a class in which you can undoubtedly get an A. I did not attend lectures, but just by studying all of the lecture notes & understanding the definitions, then doing all practice problems provided, found it quite easy to ace every test. I expect that people who didn't do well either:\nA) Underestimated the need to study - while logic is often intuitive, you can't take it for granted that you'll be able to solve problems. Without studying you could definitely have done poorly on the tests as doing the practice problems helped me gain an intuition on how to solve certain puzzles; also, in a logic test, you can't BS at all.\nB) Fell behind and didn't review to make it up - the entire course does build on itself so it's important to go through all the lecture notes and understand everything. People tend to do decently well on the tests, so even missing one question may bump you down a fair bit. Note that an A+ is possible but quite difficult to achieve even if you score well on everything.\nTo sum up, the ambition of this course is truly its name: it is NOT complex; for anyone who's taken Symbolic Logic, that course is way more difficult. Morrison does a good job of providing clear and helpful notes and enough studying makes an A achievable.\n\nWorkload:\n3 Exams, Homeworks Problems from the textbook which are due before each exam. Studying is very necessary but not extensive; for the midterms light studying 1-2 nights in advance (making notes out of the lecture notes + doing the HW problems & simpler practice problems) followed by cramming on the night of (doing & redoing practice problems) was good enough. All in all an easy workload, given the clarity of material.\n"
        },
        {
            "course_name": "History of Philosophy II: Aquinas to Kant",
            "review_date": "June 19, 2012",
            "review_content": "\nI highly recommend this course/professor/TA.\nFirst: the professor. Morrison is one of the nicest, smartest professors I have had so far at Columbia. He's very approachable, and if you have any questions at all you can meet with him in his office hours. He makes lots of endearing jokes (which aren't always funny. but that's why they're awesome). Also, he's so enthusiastic about everything! He really loves what he's doing, especially when we get to Spinoza (which is his favorite). \nnext: the TAs. I had Mark as a TA and he is FANTASTIC. his discussion sections were really interesting. He's so smart and explains even the toughest concepts in a way that everyone will understand. He's a very very fair grader- he wants you to do well! Meet with him in office hours to go over the paper topics and fine tune your arguments.Also the day he lectured the class confirmed that he will make an amazing professor one day.\nand finally: the class. It wasn't an easy A class. You can definitely do it, but if you go to lecture/don't read or read/don't go to lecture you'll have to work a lot harder to get that A. Trust me, trust me, it's worth it to do both. The material is interesting, and the lectures are enjoyable. It's a good way to get introduced to philosophy, or John is a great professor to have when you are finishing up your philosophy major requirements. \nWorkload:\nNot too much reading, but some of it's dense (i mean, what do you expect, it's philosophy!) You can get away with not doing the reading if you go to class, but to get everything out of the course you should do both. \n3 one page papers (single spaced, pretty much just translating a philosophers idea into clear/concise sentences) \n1 four page final paper comparing the ideas of several philosophers\nmidterm and final with 20-30 short answers (final is NOT cumulative! very doable!)\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "April 17, 2012",
            "review_content": "\nYou know its trouble when the Professor consistently sends out answer sheets containing incorrect answers.  It is not cool to assume students will take it as a joke.  The scatterbrained professor act only works so long--after that real insight and precision would be most appreciated.  This is a case of not being prepared, or just being too full of superior knowledge to condescend to us plebs until we are full initiates into the mysteries of logic.  Really, it's too bad, as this should be a challenging course, rather than a visit to the Mad Hatter's tea party! \nWorkload:\nA little annoying, but completely excessive if not properly explained.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "January 23, 2012",
            "review_content": "\nJohn Morrison teaches Intro to Logic (NOT SYMBOLIC). There were tons of GS students in this class though he told them all to get out the first day because he wanted to focus on the pleibs. ie. freshman. But they didnt and therefore the class got kind of confusing. You must go to all the lectures because you'll find it hard to understand the slides without his explanation of his examples. He makes TONS of inside jokes/examples to himself and to those in the class who watch whatever shows he watches.  I liked the class it just and him as a teacher but I think the class size may have hindered the material. Because the class is basically like geometry proofs minus the geometry it think it would have been more helpful if he had made his office hours more clear. The TA's were the ones who taught you it if you didnt get something but because its a proof that can be attacked from many different angles, it became hard to see how JoMo wanted you to articulate the proof. \nYou also have to buy a 120$ book that MUST BE NEW bc it comes with a CD that MUST BE NEW because it registers you and your answers via an internet connection. If your computer craps out frequently before class when you're doing your HW your'e screwed. You only get to drop 4 HW (you get hw everyday) and if you average above an 80 it can bring your grade up somewhat. This semester he curved all tests but the final.\nGrade Recieved: B\nWorkload:\nNot an overload but if you really want a good grade you need to spend 2 or 3 hours on the proofs via the book.\n2 or 3 tests then a final which was semi cumulative because it was math.\n"
        }
    ]
}