{
    "prof_info": [
        {
            "prof_name": "Ben O'Shaughnessy",
            "prof_id": 1948,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Topics in Biology",
            "review_date": "April 18, 2007",
            "review_content": "\nI think the review on this class deserves an update from the 2004 review.  In the 2007 version of the class, he never once read word for word from a biology textbook.  Nonetheless, the class is.....trying.  \nMy biggest issue with the class is that it is, as the previous reviewer said, billed as a general overview of various topics in biology.  It is NOT.  It is very specific in whatever aspects of biology he is into at the time.  This year, that is cell motility and division.  \nAnother thing to note is the way the course is structured, which he has learned to take care to explain in the intro class.  It is a roundtable seminar, discussing whatever papers he decides to cover, which a different student presenting that paper each week.  Usually we cover 2-3 papers a class.  The class does help to get used to critically reviewing journal articles, not just taking their claims at face value.  If your are not extremely interested in his area of interest, however, you may find yourself pretty bored with the level of detail each snippet of information is analyzed.\nOverall, it's not a bad course.  I did gain some skills from it, as I had hoped, regarding reading and discussing journal articles.  But I am bored, bored, BORED during most of the meetings, and I wouldn't wish it on anyone who wasn't extremely interested in the EXACT biology topics that he is interested in covering.\nWorkload:\n~2 assigned paper presentations a semester; the rest of the time it's just reading the papers, which will vary from 2-10 hours a week depending on how long they are and how fast you read them\n"
        },
        {
            "course_name": "Topics in Biology",
            "review_date": "May 09, 2004",
            "review_content": "\nBen O'Shaughnessy is an awful teacher.  This course is marketed as an in depth survey of biological topics of interest to scientists without a background in biology.  In truth, this course in my opinion is a chance for O'Shaughnessy to try to learn biology and to reinforce his understanding by reading to the class (largely word for word, I kid you not) from an introductory biology text for three hours a week.  This is time I will never get back, but hopefully if you read this you will save yourself the trouble.  If you do take the class, I reserve every right to say \"I told you so.\"\nWorkload:\nMinimal workload although you do have to do a couple mindless papers.  \n"
        },
        {
            "course_name": "Molecular Phenomena in Chemical Engineering (E4320)",
            "review_date": "January 16, 2004",
            "review_content": "\nProf. O'Shaughnessy creates note packets that he places on the web, and teaches more or less directly from them.  This is a good thing, in that it tells you exactly what was covered in the course, but the danger, as always, is thinking that you can slack off all semester and skim the notes before the exams (which you *cannot* do).  The course material is moderately difficult, but Prof. O'Shaughnessy does a solid job of presenting it.  \nWorkload:\n2 midterms, 1 semester-end paper (2-4 pages on a specified technical topic), final.  Weekly homeworks are only checked to be handed in, but are not graded; my impression was that they were often on a much more elementary level than the exam questions were\n"
        }
    ]
}