{
    "prof_info": [
        {
            "prof_name": "Andrea Thomas",
            "prof_id": 1529,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French I",
            "review_date": "January 29, 2005",
            "review_content": "\nAndrea's a gem.  While I've had a good experience with the French department, Andrea has been hand's down my favorite.  She's fun and interesting and nice to a fault, so that no one is afraid to attempt conversation because she's encouraging and gently correcting.  My French couldn't help but get better, and she genuinely wants to help you learn the material.  Her classes were organized and she managed to present really difficult grammar in accessible ways so that, no matter what it was, I always understood it.  She was approachable and friendly and incredibly helpful.  My class was in the worst time slot imaginable-- TRF 6:10-\n7:25-- but she made it worth it.  I can't recommend her more highly.\nWorkload:\nSizable-- four exams, workbook exercises nightly, periodic quizzes, four compositions, and a final project.  Andrea really wants you to do well, though, and because of her accessibility and helpfulness if you put the time in and make an effort you're assuredly going to do well.\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "October 19, 2003",
            "review_content": "\nAndrea is a gem. She's got a great presence in class and a sense of humor as well. Moreover, she is genuinely interested in the subject matter and her student's progress. Her classes are fast-paced, but always very engaging. Be prepared (as one other student as said) because from the start to the end of class, you will be speaking nothing but French. At the end of the term, you will be impressed with yourself about how much you've learned in Andrea's classes.\nWorkload:\nCopious. You will be expected to have read the text before class and prepared to use the vocab/grammar. Homework from the workbook every night with few exceptions. Five compositions, five quizzes, five exams, oral midterm and final. You will also write and speak in class a great deal. Everybody must participate in  Andrea's classes.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "March 28, 2003",
            "review_content": "\nAndrea is definitely a good reason to learn French. She is incredibly energetic and her personality gets the class to participate without the usually required force. Her easy-going but professional demeanor takes away your fear of making a fool out of yourself by talking like a child in another language and allows you to really experiment with speaking French. Andrea will surprise you with a new and generally pretty quirky daily activity that is aimed at getting the class to interact. She expects her students to do some preliminary studying as well as complete the assigned workbook exercises since she does not lecture the grammar and the vocabulary during class but rather applies it after only a short introduction. To make a long story short, be prepared before you go to class! All of the tests and the compositions are graded fairly; she is also very readily available outside of class in case you ever need help. Andrea will generally allow the class to participate freely, unless she feels that certain members are not really giving their part, at which point she will call on them. So, there's no way out of participation in this one. Conclusion: Hard work, but you learn French.\nWorkload:\nWorkload: High. ALL oral and written workbook exercises are done in each lesson and are assigned daily, four departmental tests, a midterm interview in groups of two with the teacher, and a departmental final. Oh, and don't forget the half-dozen compositions due throughout the semester either!\n"
        }
    ]
}