{
    "prof_info": [
        {
            "prof_name": "Edward Malefakis",
            "prof_id": 25,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 26, 2003",
            "review_content": "\nI took Contemporary Civ. w/ malefakis.  Clearly, the reviewer who cried and complained about him has no sense of humor.  CC was an outstanding experience.  Malefakis wouldn't think twice about putting you on the spot for walking in late, or making you answer for your opinions.  Any personal jabs were in good humor.  While I concede that you don't have to be the most oversensitive person to take one of his remarks the wrong way, if you see it for what it is, you can enjoy it.  What ON EARTH is wrong with a professor who won't accept half-baked, ill-reasoned generalities?  Grumpy Anti-Malefakited are just academically spoiled babies.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nHe mumbles, draws unitelligible diagrams with no pertinence to the subject matter, and is plain old mean. He believes that his opinion reigns supreme, and leaves no room for opposing reasons. He also, will degrade and belittle you in class and has been known to laugh at your ideas or just you and your clothing preference. He has had tenure for so long that he could care less about the student. Also, please avoid his History of Spain class. He displays the same inappropriate attitudes and disfunctions.\nWorkload:\nWorkload(for CC): one midterm, one final, one 8-10 pg. paper.\n"
        },
        {
            "course_name": "Modern Spain",
            "review_date": "December 31, 1999",
            "review_content": "\nHe mumbles, draws unitelligible diagrams with no pertinence to the subject matter, and is plain old mean. He has had tenure for so long that he could care less about the student. He displays a full range of inappropriate attitudes and disfunctions.\n"
        },
        {
            "course_name": "Modern Spain",
            "review_date": "December 31, 1999",
            "review_content": "\nHe mumbles, draws unitelligible diagrams with no pertinence to the subject matter, and is plain old mean. He has had tenure for so long that he could care less about the student. He displays a full range of inappropriate attitudes and disfunctions.\n"
        },
        {
            "course_name": "Modern Spain",
            "review_date": "December 31, 1999",
            "review_content": "\nNot the best lecturer, but he knows what he is talking about. He is going to retire in a year or so, and it shows. Don't expect him to dote on you. However, if you want to learn about Spain, take the class, and make sure to do the readings, for they are an effective, almost necessary, complement to the sometimes disorganized lectures. TA was a helpful, knowledgeable fellow. He deserved more credit than he got.\nWorkload:\nBetween 120-200 pgs a week. If you do the some of the reading and listen in class, the midterm and final are a breeze. One 7-9 page paper, which is fairly (read easily) graded.\n"
        },
        {
            "course_name": "Modern Spain",
            "review_date": "December 31, 1999",
            "review_content": "\nAll the other reviews of this course are right on the money. He's stdogy, largely disinterested, and has a gift for putting down his students (\"that's a good question; we really can't get into that, though\"). On a few rare occasions, he does get incredibly turned on by the material, and he becomes the best there is. Otherwise, bring a pillow.\nWorkload:\n1200 page course pack (buy it for the 20 relevant pages you're going to end up reading, and use the rest for scrap), 5 books (read them -- tests are pretty much exclusively based on them), midterm, final, paper (7-9p.)\n"
        }
    ]
}