{
    "prof_info": [
        {
            "prof_name": "Murat Eyuboglu",
            "prof_id": 1642,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "August 18, 2010",
            "review_content": "\nIf you are so fortunate as to be enrolled in Murat's section, congratulations! You will get an A.  There aren't really any deadlines or assignment requirements outside of paper length and staying (very very roughly) on topic.  And, if you're like me, then you also walk out of the class not being entirely ignorant of major advancements in music history.  I actually feel like I learned things without having to bend over backbards, jump through hoops and shit my pants when I get an assignment.  If only every Columbia class were so glorious as this.\nWorkload:\n2 papers, a couple concert reports, and in your free time you should stop into his office hours.  He's a really cool guy, actually.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 04, 2010",
            "review_content": "\nProfessor Eyuboglu is simply great!!! Very intelligent, understanding, approachable. He made the class interesting and fun. He was very good with providing all the necessary information needed to prepare for the assignments/exams. The part about not returning the papers didn't bother me too much because as long as you write what is asked of you to write, you'll get a good grade. Just ask questions if you have them and do the work and you will be fine. \nWorkload:\n2 quizzes, 2 exams, 2 concert reports.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 28, 2009",
            "review_content": "\nMurat is a great guy and a good teacher. The class was pretty boring for the first month or so, but that is mostly due to how uninteresting the subject matter is. The latter part of the course, with Mahler (Murat's specialty) and more modern stuff is much much more interesting. The exams are incredibly fair, and Murat makes sure everyone knows exactly what to prepare for. The workload is light. It is at 9:00am so obviously class participation wasnt great but Murat made it totally bearable. For a while during the semester Murat didnt give any grades, saying things like \"its hard to quantify concert reports\" and then in the end I think everyone pretty much did fine. \nWorkload:\nlight. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 13, 2009",
            "review_content": "\nMurat is such a fantastic guy. Registering for or petitioning to get into Music Hum classes is basically a game of luck, and you are very lucky if you end up with Murat. He really cares about music and about his students, and he's very knowledgeable about all genres. Don't be intimidated by the music IDs on the quizzes and the exams -- Murat definitely goes out of his way to be as straightforward as possible, and if you study and go to class, they'll be easy. From what I understand, the workload is light compared to other Music Hum sections. Whether you're a music person or not, whether you just wanted to fulfill the requirement or whether you wanted to actually learn something, you'll come away from the class knowing more -- though there's a chance that you still won't know how to pronounce his name by the end of the semester.\nWorkload:\n2 quizzes, midterm, final, 2 concert reports, attendance. Minimal reading each week (< 10 pages usually)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 15, 2008",
            "review_content": "\nThis section was awesome.  Murat was a very chill professor who was energetic and animated during the 9 AM class.  Our TA, Alex, was also fantastic.  Between him and Murat they clearly answered any question that the class posed.  \nI am a musician, so I probably had an easier time with the material than other students might have.  But, it was very clearly presented throughout the term and even though there were a few awkward jumps between eras, I found that the general sampling of music given was good.  Murat moves a bit slowly through the material, but it all works out in the end.  The grading seemed REALLY generous in my class.  Overall, if this is an undesirable class that you simply want to get over, I'd suggest this section, because Murat is awesome and the grading is easy.  However, if you want to be intellectually stimulated, this might not be the section for you; we seldom delved deeply enough into the works or the times to have meaningful discussion.\nWorkload:\n2 concert reports (1 from a required concert, 1 from a concert of your choice) \n2 quizzes (We only had 1 because we lost a lecture to a fire alarm; we wrote a short paper instead; both are fairly straightforward if you pay attention in lecture/read the book)\nMidterm and Final (Similar to quizzes)\nParticipation (Come to class and raise your hand)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 15, 2008",
            "review_content": "\nThis section was awesome.  Murat was a very chill professor who was energetic and animated during the 9 AM class.  Our TA, Alex, was also fantastic.  Between him and Murat they clearly answered any question that the class posed.  \nI am a musician, so I probably had an easier time with the material than other students might have.  But, it was very clearly presented throughout the term and even though there were a few awkward jumps between eras, I found that the general sampling of music given was good.  Murat moves a bit slowly through the material, but it all works out in the end.  The grading seemed REALLY generous in my class.  Overall, if this is an undesirable class that you simply want to get over, I'd suggest this section, because Murat is awesome and the grading is easy.  However, if you want to be intellectually stimulated, this might not be the section for you; we seldom delved deeply enough into the works or the times to have meaningful discussion.\nWorkload:\n2 concert reports (1 from a required concert, 1 from a concert of your choice) \n2 quizzes (We only had 1 because we lost a lecture to a fire alarm; we wrote a short paper instead; both are fairly straightforward if you pay attention in lecture/read the book)\nMidterm and Final (Similar to quizzes)\nParticipation (Come to class and raise your hand)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 19, 2003",
            "review_content": "\nA nice man and an easy teacher.  His quizzes and papers are easier as is the grades.  He's a substitute teacher so don't expect a high level of Music Hum instructor, but if you're like most students, Music Hum is one of those undesirable requirements you have to fulfill.  The class is very boring, especially at 9 am when I wished I was sleeping, and Murat did nothing to liven it up, but you can't really blame him, that's just Music Hum.\nWorkload:\nEasy.  Reading is not necessary.  Three quizzes (very easy) and a midterm and final (also very easy).  Just memorize your notes from class about each piece on the quiz and you'll be fine; he tries to make detailed, in-depth questions but just jot down whatever your notes say.  2 4-pg papers, graded lightly.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 19, 2003",
            "review_content": "\nIf you know relatively nothing about music and want to take care of the music hum requirement in the easiest way possible, this is exactly the teacher for you. He was funny, friendly, reasonable, and I learned a lot from him because he is an actual professor, not a TA (although most TA's are not bad themselves). Taking music hum at 9 in the morning with Murat was well worth it. He usually teaches as a replacement, but if you find out he's available, take his class in a heartbeat. \nWorkload:\nAt first, the thought of having to take 3 quizzes, a midterm, a final, in addition to writing a concert report and a 4 page letter was a bit offputting, but don't worry, all of these things are much easier than they sound. Although quizzes, midterm, and final are pretty detailed, I (as well as everyone else) managed to ace them without ever opening up the textbook. Just pay careful attention in class and you're set to get an A. I wish all Columbia classes were this easy. \n"
        }
    ]
}