{
    "prof_info": [
        {
            "prof_name": "Linda Sohl",
            "prof_id": 3489,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "August 29, 2008",
            "review_content": "\nLinda Sohl is possibly the most uninteresting and unenthusiastic teacher I have ever had in my entire life. \nTo top that off, she knew little more than the students about topics addressed in Frontiers; consequently, she could do very little to help us on the weekly assignments. \nWhen we had questions about the lectures, she would either look the questions up online the night before or ask her colleagues, and then waste an hour and a half of class time with lengthy explanations to each question which we could have just googled ourselves. Sohl took little interest in our work as students and we didn't receive some papers back until long after the midterm, even after repeated requests. She was a lazy grader--\nDivided the class into 4 groups for a major project and failed 2 of them because she decided she didn't need to bother with considering consistent error in mathematical calculations. The midterms took her nearly two months to grade, which is completely unacceptable.\nOur entire class went into the final ludicrously unprepared. \nLinda Sohl is a nice lady and a god-awful teacher. Avoid her at all costs.\nWorkload:\nNormal weekly WIA assignments; fairly short in-class assignments for discussion sections; an extra-credit paper; two projects which Sohl graded so unfairly that we asked never to do anything like them again. At least she obliged.\n"
        },
        {
            "course_name": "Climate System",
            "review_date": "January 06, 2008",
            "review_content": "\nEasy class. Very boring. Well intentioned, bland teaching that is not well coordinated. Long labs. It's hard to get a good grade because the classes and homeworks are 90% useless. You really have to be a trooper to pick out that 10%.\nIt's a fundamentally bad idea to have three experts split up an intro level class. They sometimes overlap, sometimes lack cohesiveness,  and just generally don't have enough time in front of a class to get their stuff together.\nWorkload:\nweekly homework, weekly labs, two midterms and a final. lots of time, not a lot of thought. At least your brain doesn't get tired.\n"
        }
    ]
}