{
    "prof_info": [
        {
            "prof_name": "Claire Elise Hazen",
            "prof_id": 1015,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "December 29, 2016",
            "review_content": "\nProf. Hazen: 9.5/10 Amazing professor. I skipped lab twice and made it up on a different day, it was so cool and unmessy... like on the first time I did it, she literally said, it's ok, the navy won't come looking for you if you don't attend lab on the right day! and then laughed in her own sweet manner. She's also so passionately proud that we still use and breed the same flies that Thomas Hunt Morgan (yes, THE THOMAS HUNT MORGAN, discoverer of sex-linked genes) and claims that our lab was also THG's lab. So that was so cute. The -0.5 was bc of her subsonic voice. sad. \nThe class\n-------\nPig dissections: 6.5/10 If you've never dissected before, probably lower... but I always just tell myself that I should pretend I know what I'm doing and I should be fine. and I did. I also registered for this class after the first week of labs, so she was really flexible with Office hours and everything like it was so easy to catch up and do 'relatively' well on the practical exam. The practical was hard though. The avergae is usually 140/200. I got a 161 and my TA said I should expect an A. cool. A lot of the parts on the practical tests the views though, so if you're used to seeing the hyoid bone on the buccal area, dorsal or ventral, you might be tested on how it looks like after a saggital cut. The most painful part of the practical is the histology bc she'd give you a slide and ask you whats the pointer pointing at, and then what's 7 oclock of that, 4 oclock and 11 oclock of that... like yo i have 90 seconds in this station pls calm down.\nLabs: 4.5/10? Yuck, ew. Pls take it out. Like abs no point in doing them. They're boring and such a drag. Or maybe switch the class like first half should be the labs and the last half is the pig, cause the pig is fun. the labs are weird and annoying and her post lab questions are a DRAG. they're dry, useless and annoying, like WHYYYYYY DO I HAVE TO DO THIS AGAIN!!!! type of thing. Students say it's hard the way TA's grade them but I got a 97 and 96 on the two we were assigned, just by BS-ing my way through it and pretending I know what I'm doing. \nWorkload:\nSee detailed review\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "April 22, 2015",
            "review_content": "\n   I found the experiments and dissections to be interesting, but hated the lab reports and felt they were huge waste of time and our TA's grading was harsh. I didn't feel that I learned anything more about Biololgy than I did from my intro course,  I just spent allot of time doing calculations and trying to figure out how to make interesting pictures of plasmids on my computer.  As someone who wasn't fond of the class I can say that the professor is probably one of the nicest I've had at columbia and made it allot less painful. I recommend taking it in the summer when it won't interfere with other classes. The lab reports are very time consuming and, of course, are heavy right before finals. If you have a cool TA, this class will be much better for you. But you're not going to find that out until it's too late anyway. \nWorkload:\nIf you think you'll have 15-20 hours a week of free time around your orgs-bio finals go for it, but otherwise you should take it in the summer. You don't need Bio Lecture, you'll be fine jumping right into the lab. \n"
        },
        {
            "course_name": "Contemporary Biology Lab",
            "review_date": "August 26, 2013",
            "review_content": "\nThis class was interesting. The pig dissection in the beginning is my biggest complaint because many people have never dissect anything before, myself included, and I was struggling to make the proper incisions. In the end I mistook my male pig for a female, cut its premature mating organ in two, and made a mess of his insides Poor little thing.\n\nThe TA's only give demonstrations once, and Hazen will speak in the front in a rather low voice during lectures, so you should move to the front. \nThe labs are very specific in format so make sure you read all the directions clearly or you will be disappointed in your grade. \nThe practical (midterm) is very difficult unless you go to office hours to go over the demonstrations and anatomy. \nThe final is pretty straightforward, practically a copy of the posted practice final. If you get 90's on your labs, do around the average on the practical and did the practice final in full, you should no doubt get an A!\nOh, and Ms. Hazen is one of the nicest instructors you will ever find...EVER.\n \nWorkload:\nThe labs should take at least 5 hours to do each. Studying is needed mainly for the practical and the final, but the final is only written and is not cumulative.\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "June 03, 2013",
            "review_content": "\nWow! This class was amazing. I am surprised she does not have a gold nugget yet. She is very nice; I remember people in the class calling her the anti-mowshowitz. Before the pig dissection, there is little to no work and it is just memorization of the pig parts. We really only had thee labs and one of them was just answering a bunch of genetic questions that she had explained how to do in class. One piece of advice is to really pay attention to her in-class lectures, as EVERYTHING is explained there. If you just meet the average on most of the assignments (maybe a little above), you are probably going to receive an A, since I did below on the practical and most likely the final, but above on the labs and received an A. Just bug your TA's for some of the answers to the post-lab stuff and lab reports and you should be fine. \nWorkload:\nJust keep up with the pig practical. Spend TIME on the lab reports, reading all of the guidelines and pay attention to the little details. \n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "August 03, 2012",
            "review_content": "\nI though this class was great, largely due to Professor Hazen's cheerfulness and thoroughness in teaching the material. I've worked in a bio lab before, and many people recommend not taking this class if you have. But I have no regrets. This class gave me a very nice overview in different bio fields by introducing different experiments (from a pig dissection to a fly experiment to basic molecular biology vector work).\nDon't worry if you don't do so well on the pig practical. I got around a C on it, but ended up getting an A in the class in the end. Be meticulous with your lab reports. The final is very similar to the practice final, so if you understand that, you should be fine! Oh, and I would also advise you to take notes during her lectures-- all of the answers for the quiz are usually given during this time!\nWorkload:\nPig practical, final, 3 lab reports, a couple of in class quizzes, some group questions turned in for a grade. Go to review sessions. For the pig practical, go to TA sessions preferably in the beginning of the semester (closer to the midterm, those sessions are incredibly crowded).\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "December 20, 2011",
            "review_content": "\nI loved Lise.  I am always amazed by how cheerful and good humored she is, and by how friendly she is.  She is so approachable and honestly so great- I can understand why an undergrad would want to TA her class since she is so nice.\nThe labs were interesting, and in hindsight the pig dissection was fun (studying for the practical was stressful though, but somehow that midterm that had material from the entire first half of the course only counted for 20% of the grade).\nMy gripes:  There was no direction in the class.  Pretty much, as soon as you got to class, you could start dissecting your pig.  Because the second half of the semester was done in groups, you could not start until everyone was there.  Every class started about 20-30 minutes late habitually, which was honestly so annoying and made me wonder why I bothered to show up to class on time.  Both the midterm and the final started late, which was frustrating too.  I was also with all postbaccs who need to nitpick everything and take their sweet time, so things that should have taken 25 minutes tops took over an hour.  Never before has a 4 hour lab class actually lasted for 4 hours every single session!\nYou're reading this because you're pre-med, so you have to take this class anyway.  Come to class on time, listen to Lise when she speaks and take copious notes when she does so because she gives all the answers to the lab report questions, and try to make friends with the kids in your class since you're gonna be there for 4 hours a day a week anyway.  Also, be nice to your TAs since they grade your papers and can bump your grade at the conclusion on the class.\nWorkload:\nMidterm, final, 3 lab reports, some questions, a couple in class quizzes.  Make sure you go to the review sessions for the exams or you won't do well.\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "August 29, 2011",
            "review_content": "\nAs a post0bacc in the summer session, this was a very enjoyable class. Not a blow-off by any means. You have a lot of work, but it is so interesting for most students that the investment of time is fun. I highly recommend the summer session, but I could see it being really useful during Bio I. \nIf you start off working hard the course will pay off. And the Professor Hazen doesn't curve but grades on your own merits. \nTry peppermint oil under your nose during the pig portion as it really does stink. And buy all the texts asap.\nStudy hard for the pig exam - it's doable, but you need to spend the time in the lab.\n\nWorkload:\nAs a summer course it is almost a full-time gig on its own. But worth it as yours is the only section.\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "January 18, 2011",
            "review_content": "\nBest class I've had at Columbia, wish I could take it again and skip orgo lab!\nNicest professor ever.  Really.\nPretty much everything has been said, except: for lab reports, make sure you go to your TA's office hours and find out exactly what they want to see on the reports.  They grade using a checklist, so find out what's on that list!  Also, TA's are mostly undergrads, so if you disagree with any exam or quiz grading (also done with a checklist), go directly to Professor Hazen and she'll probably add points if your answer is correct but not exactly what the TA's were looking for.\nIt should be a fairly stress free class.  If you can't hear, move.  If you don't do well on the pig exam, relax, it really doesn't count for much overall.  You will learn a lot and it will be the first real taste of medically-related material for many people.\nWorkload:\n4-5 hours for pig parts.  3 labs, each 30 minutes prep plus 4-5 hour report.  2-3 hour fly report, 30 minute yeast report, 3-4 hours final prep.\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "April 05, 2010",
            "review_content": "\nLise is an amazing person. She is extremely nice and positive at all times. People should really learn from her. She is very knowledgeable and amazing at what she does. SHE deserves a GOLD nugget. Lise is extremely clear on her lectures and is somewhat organized. She is smiling all the time and is willing to answer even the worst questions you can possibly come up of. AMAZING A++\nOn the other hand... some of her TAs are horrible. DO NOT take your lab section with a novice TA or an arrogant TA. There are some of those this semester and definitely AVOID AVOID AVOID. Ask Lise if your TA is bad.\nWorkload:\nHeavy\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "June 04, 2009",
            "review_content": "\nElise is a wonderful person, she's probably one of the nicest people you'll ever meet in your life.  The lab isn't too bad either and the TAs were also very friendly and easy to work with.  The lab is really divided into two parts: part 1 is the pre-midterm pig dissection and part 2 is the post-midterm experiments on DNA and Flies.\nDoing well in the class requires work (Don't underestimate the amount of work you need to put in for this) but it's easy to do as long as you're willing to put in the time (Unlike Mowshowitz).  The midterm requires you to memorize all the body parts of the pig (Including all the veins, arteries, ducts, organs, some muscles, some bones, etc.) plus be familiar with some histology slides.  To do well in the pig exam (The midterm) you should go to office hours frequently especially the two weeks before the exam.  There's no way you'll remember everything while you dissect the pig the first time.  The main learning is in office hours.  I honestly can't imagine how someone could do well in the class without going to office hours.  While in office hours, learn everything cold.  You shouldn't need more than 5-6 seconds to identify anything you need to know.  If you're unsure about something ask the TA to go over it again and again until you nail it down.  The TAs can get tricky and show you some of the parts you learned from different angles on the test.  You really should know everything so well that you can immediately identify a part upside down, sideways, or from any other angle.\nDoing well in the second half is a bit easier.  You just have to come to class having read the lab manual.  Doing well in the lab reports also requires going to office hours but not as much as the first half.  Basically make sure what you're doing is correct.  Go to different office hours, ask different TAs until you're 100% sure the answer you have is correct.  Nothing too difficult.\nFinal is easy as long as you follow through all the labs knowing exactly what you're doing.  Final is basically a review of the experiments you did.  A 1 day review is all you need as long as you did well in all the lab reports.\nThe lab can be taken either semester.  I think taking it first semester will help out with Mowshowitz bio but taking it second semester will make the lab itself easier because you already know almost all of the concepts from first semester bio.\nWorkload:\nFirst half: Nothing is required but you should go to office hours frequently.  Go as often as you need until you know everything cold.  Otherwise you'll find the midterm very brutal.\nSecond half: 3 lab reports, some questions you need to answer, and 1 data analysis.  Each one takes about 5-10 hours to complete (Including office hour time) depending on the assignment and how well you know what you're doing.  Start early.\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "December 10, 2008",
            "review_content": "\nDo not listen to the biology department, take this class first semester. It coincides nicely with Mow. bio and helps reinforces the concepts. Lise is a super-sweet lady, but try to sit in the first row because she speaks very quietly. She is really accomodating and flexible with due dates. The pig test is hard but not worth much. Dissecting is fun once you get over the smell. Overall class atmosphere very relazed and fun. Lab reports take forever to do: key to doing well is to have somebody from the previous year's report as a model (don't copy, obviously, but see what they are looking for to help you get the hang of it).\nWorkload:\nduring the pig section, nothing literally (nobody reads the book), during the rest, hideously long lab reports\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "May 09, 2007",
            "review_content": "\nThis class makes you think more in depth about some of the topics that are covered in the intro bio class (C2005/\n2006).  The pig dissection part requires you to learn a lot about anatomy, while the experiments go over modern techniques such as gel elecrophoresis, restriction enzymes, recombination, genetics, etc.  It is required for Pre-Meds (there are some other options, but this is the most common one), so you probably have to take this course.  It is not hard, but the TA's can be very very picky when grading.  If you use the wrong verb, points may be taken off.  Arguing doesn't really help either.  The trick to doing well is to be extremely thorough.  No detail is too small.  The lab reports take very long so do not leave them to the night before lab.  Also, the  pig does not count as much as you would think, so don't stress over it.  You get no grade for how well you did the dissection, only for the exam which is pure memorization.  Lise Hazen is very sweet and nice.  She is always willing to help and knows the material very well.  She is really goofy at times and just starts laughing at herself in the middle of sentences.  It is much better than Gen Chem Lab.\nWorkload:\nPig Dissection/Exam, 4 Lab Reports with additional sets of questions, Final Exam (on experiments not pig).  It's not bad for a 3 credit course.\n"
        },
        {
            "course_name": "Bio Lab",
            "review_date": "April 06, 2007",
            "review_content": "\nThis is truly one of the funnest classes at Columbia, if you like histology, dissection, and growing yeast and bacteria.  I loved it!  I  also LOVED Lise Hazen.  She's really welcoming and has a great personality.  I think she makes this class a lot of fun.\nIt's true this class is not extremely on the organized side of things... but if you prefer classes to be a little more relaxed (if, for instance, you find yourself at times describing other lab classes as \"anal\"), it may be *just* what you're looking for.  \nLastly, as far as lab reports go, I wouldn't worry about not understanding what's expected too much.  First, everyone gets full credit for their flow chart, so just relax and write whatever you want for that.  Second, you get to rewrite one lab report.  So, if you misunderstand what's expected for the first lab report, you can shift your approach for the others and rewrite the first.  No problem.  \nJust enjoy the class, because it is meant to be fun, if also somewhat demanding (which only makes it more enjoyable...).  Take a deep breath and relax.\nWorkload:\nFine.  There is a lot of work, especially if you want to do well on the pig test.  But it's really mostly fun, so the time goes by quickly.\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "March 08, 2007",
            "review_content": "\nThis is one of the most badly organized and ill taught classes I have ever taken. It is really infuriating. Hazen hardly does anything. And for all her sweet smiles and soft-spokenness, I could just kill her. The 15 minute lectures at the beginning of class are they only time in our FOUR HOUR class that anything is actually taught. But, of course, if you're not sitting in the first row so that you can actually hear what she says, and if you can't write and draw and learn everything she says as she says it, you're screwed, since no notes or hand outs are given out or posted online. The TAs are even more incompetent and really serve no purpose what so ever except. Their only function appears to be to act inconvenienced and haughty every time you ask a question. I'm sorry I interrupted your (PAYED) sitting on your ass socializing time, I was under the impression that you were here to help me learn bio lab technique.\nThe practical pig exam was BRUTAL and perhaps the hardest thing I've ever taken. The lab reports don't seem too difficult, except they give hardly any indication of what they expect from us or how they're going to grade it. We have to hand in \"flow charts\" at the beginning of each new lab. This seems to me to be a retarded concept as the procedures are written up for us. Am I supposed to include \"1. Clean bench with ethanol\" to this procedure? that doesn't seem very professional. Of course, again, I have no idea what they expect from us. \nFor all my complaining though, I feel as if nothing is every going to be changed, since everyone does well anyway (or so I'm told right now... I hope this ends up being true). Also, you have to remember that the class is filled with irritating pre-med students who devote their whole beings without complaining to doing well even if the professors are no help to us. \nI guess you have to take this class if you are pre-med, so there's no way to avoid taking the class even after reading this evaluation. However, if there is someone of importance or power reading this, who has the ability to change Bio Lab, please do so. I think we Columbia pre-med students have the right to be taught and to learn. This should not be just another one of those classes that everyone tries to do as well as possible in by bullshitting. But, that's what it is right now, bullshit.\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "January 17, 2005",
            "review_content": "\nLise is a genuinely nice person and rumor has it that she grades very generously. \nYou don't have a choice of professor, and your Bio Lab grade doesn't matter much for med school, but her class is full of maddening aggravations.  She doesn't return student emails.  She puts the content on the course website, and that content is posted late, with several errors, and is of a bare bones nature.  Assignment due dates shift like the desert sand, and are poorly announced.  Lise should ask an undergrad to program the website and should post the entire lab book online from the outset rather than posting each week's lab manual online days/hours prior to the lab.\nLise is generous to a fault, and allows TA's to return written lab reports about 2 weeks after they're turned in.  Lise doesn't lecture often, and when she does, she speaks too softly and doesn't give handouts.  Her lectures could be greatly improved by putting what she draws and says on a HANDOUT - otherwise students are left frantically copying in 5 mins what she previoulsly drew on the blackboard in 15 mins.  I can see no reason for the lack of handouts other than that their preparation would require effort.\nMy biggest issue with Lise is that I feel she is not giving Columbia the professional effort it deserves.  Students get the feeling that her job is a terrible imposition on her personal life.  She rarely lectures; classes are a disorganized chaos of students not knowing what materials to pick up; materials aren't arranged clearly at the front of the room; she doesn't speak much during labs to clarify things; and she doesn't grade labs herself.  I'm not sure what exactly she is needed for, as many weeks she wasn't even in the classroom during the entire 4-hr lab period.  She was late for her office hours, as were her TA's, and no one was held to account.  That is unprofessional behavior, yet students are so smitten with her \"sweetness\" and her \"A's for everyone\" credo, they're unmotivated to demand more effort from her.\nFor the pig exam, many pig organs/veins/etc were unclearly flagged and microscopes were poorly setup.  Questions were unclearly worded.  It was extremely unprofessional!\nAfter the pig exam, you are never again told where you stand in relation to the class gradewise, provided a mean or standard deviation.\nWorkload:\nPig exam  - 16%.  Four lab writeups - each about 15% (Introduction should be 1 1/2 pages long, but no one will tell you that until AFTER you turn the first report in).  Final exam - 20%.\n"
        },
        {
            "course_name": "Bio Lab",
            "review_date": "January 02, 2005",
            "review_content": "\nI agree with all the previous reviews - the woman is the nicest prof i've even had who'll give her soul to help you.  So sweet!  My only complaint with her is that she takes forever to grade!  And i mean forever!  We didn't get our first lab report back until after we submitted the second one.  She feels very bad about it, and keeps telling you to come back tomorrow, which you do, and they are still not done.   But the woman is so sincerely sweet and caring, that you can't help but not get mad at her.  She really is a wonderful person.  The pig is fun!  The other labs are not as fun, but definitely better then chem labs.  The atmosphere in the class is very relaxed.  You don't even feel like you're in class.  Everyone is chatting and having a good time.  Also, the TAs can make or break your experience.  Make sure you do not have David Mandell as your TA.  He is absolutely horrible!  In my opinion he's on a powertrip, out to get everyone.  And what's worse, he doesn't know his stuff!  You ask him a question, and he sometimes just says I don't know, and at other times gives you the wrong answer.  What's more, he's a very picky grader.  Just stay away from his sections.  But once again, Lise is just marvelous.  I absolutely love that woman, as does everyone in the class.\nWorkload:\nWhen you're doing the pig, there's no outside work at all.  Technically you're expected to read the Pig Book before class, but basically no one does it and just reads it during class as they're dissecting.  Although, when i was studying for the practical, i regretted not having read it, because it would probably make studying easier.  Also, go to open lab hours and review sessions before the practical because those help a lot.  After the pig, there are three lab reports which are hard and take a really long time to do, so those are really the only pain in the ass of the class.  There is also one genetics problem set, which are fine.  The good thing is that Lise goes over most of the questions in class, so you basically have most of the answers before you start.  Then there's also a final, which is hard but fun.  Yes, I said fun.  The questions are basically logic questions that get you thinking, and its really satisfying if you get them.  She posts a sample final which basically has the identical questions, just different numbers and a few small changes here and there.  So that's really the only way to study.  Read over the lab manuals, and do the practice final, and u'll be fine.\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "April 11, 2004",
            "review_content": "\nLise is a really nice person and a very good teacher. She is always willing to help out students, and is extremely accomodating if you need to take an exam early or late, etc. The class is really fun and you will learn a ton. I suggest taking it first semester, while you are in the fall semester of Intro to Molecular Bio (C2005), because the material from each class fits together nicely, and both classes are a little bit easier as a result of it.\nWorkload:\nNot gonna lie- lab reports take hours and hours of work. But, do a careful and thorough job and you'll get a good grade. The pig exam is pure memorization- nothing to be afraid of. Just make sure to go in and practice identifying all of the structures during the open hours before the exams, because its a lot more useful than just using the pictures in the book. All in all, a great class. Premeds, you'll enjoy this, I promise.\n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "February 11, 2004",
            "review_content": "\nShe's fine. Nice woman. Although very vague at the beginning of course about grading and what things are worth. So you panic if you screw up the pig mid term. As it turns out the pig is worth less than you would've thought. But she doesn't tell you that. She never returns emails or voicemails. But she dresses very nicely.\nWorkload:\nThe course involves a lot of work. The write ups (which are four) are a minimum of 7-10 hours each. Then there's a mid-term on a dissected pig, which involves a lot of memorization. Finally, there is final. Yes this is no blow off lab. There's work involved unfortunately.\n"
        },
        {
            "course_name": "Bio Lab",
            "review_date": "January 04, 2004",
            "review_content": "\nInsanely nice, insanely generous with grades. The TAÂ’s can be bossy and insensitive, but Lise will help you with absolutely everything. She wants you to do well, and isnÂ’t the typical science teacher out to abuse your pre-med career. DonÂ’t get the night section! (Thurs. 7:30-11:30) Â– even if thatÂ’s when you function best Â– all the 40 year olds selling their souls to become doctors opt for that one, and itÂ’s really a drag being there the whole time with post-bacs. \n\nWorkload:\nPractical exam (getting the pig smell off yourself is the hardest part!), a final exam on all the labs, and the lab reports themselves. A bit of reading. \n"
        },
        {
            "course_name": "Contemporary Biology Laboratory",
            "review_date": "April 09, 2002",
            "review_content": "\nGreat teacher. She's a real character too. The class is very relaxed. She gives pretty much the entire class an A- so don't stress if you do bad on the test. There is a decent amount of work invovled, but none of it is hard. Three Lab Reports, a final, and a practical exam.\n"
        }
    ]
}