{
    "prof_info": [
        {
            "prof_name": "Karen Vrotsos",
            "prof_id": 3423,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "First year english",
            "review_date": "August 29, 2008",
            "review_content": "\nI have to admit that at first I had some trouble with Karen Vrotsos and her high expectations and unsympathetic grading style. By the end of the class, however, I realized how much her demands helped me grow as a writer. Even though Legacy is a weird class because some sections are easier than others, in the end I was glad that she was one of the more demanding professors. She really pushed me to think hard about my ideas, to stop bullshiting in my writing, and to really formulate meaningful arguments. My confidence in writing increased dramatically, and I owe it all to her. So if you get placed in her class, try not to freak out about her long reading assignments and challenging paper topics. Just go with it and you'll be surprised how much you'll learn. After all, you're in college and that's what you're paying for!\nWorkload:\nfour 3-6 page papers, one 6-7 page research paper and revision, long weekly reading assignments and one super short in class presentation.\n"
        },
        {
            "course_name": "First year english",
            "review_date": "April 08, 2008",
            "review_content": "\nI just spent the past half hour trying to see if this professor's address was listed so I could send a bunch of pizzas to her home, as well as assorted other varieties of delivery.\nThat is how angry I am with Karen Vrotsos. She is flighty, unorganized, and assumes that everyone is going to write their papers the night before it is due. Granted, most people do. But when you've already written your paper several days earlier only to have her the DAY BEFORE tell you how it should be re-written, you get a smidge angry. And want to send pizzas. \nLegacy at Barnard was praised as being one of the amazing classes that Barnard is proud to offer and that might change your view on your academic experiences.\nIt has changed my view on academic experiences, and has made me want to kick those academic experiences some place that it really hurts. \nThe reading was good enough, but the way Karen Vrotsos presented the material was boring, annoying, and made me swear out loud once exiting the classroom.\nPlease do not take her as a teacher. Legacy on its own is probably perfectly fine, but she is awful. Not one person in my class has enjoyed it and each one of us say daily how bad of a teacher she is.\nWorkload:\nA 5-8 page essay do every other week and a lot of reading for each class. The essays themselves are not bad, but she makes them due on Fridays and at odd times when you'd rather not be writing an essay.\n"
        }
    ]
}