{
    "prof_info": [
        {
            "prof_name": "Mae Ngai",
            "prof_id": 3399,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Immigrants in American History and Life",
            "review_date": "January 06, 2011",
            "review_content": "\nI thought this class was really good. Professor Ngai is a really interesting and insightful lecturer, and her book \"Impossible Subjects\" is an absolute must-read. The lectures are fast-paced and she doesn't post her slides online so take good notes. I thought the course was really well planned-out in terms of readings and subject matter; it starts with transatlantic migrations (including slaves) in the 17th century and ends with contemporary immigrant labor regimes under globalization. The course focuses especially on legal regulations and their effects on race relations, labor regimes, gender and family dynamics, etcetera. Most of the readings are secondary literature (books, articles, etc) but we also read immigrant diaries and court decisions, and watched three films (Gangs of NY, Gentleman's Agreement, El Norte). Reading load was heavy but manageable. \nI disagree with the previous reviewer about her being condescending. She's a bit brusque and no-nonsense but honestly, the class is well worth-it; she's also pretty funny, though definitely sarcastic. I would say that she's not engaged (as in she doesn't care about you as an individual student) but she's engaging (she wants you to learn). The hardest part of the class was the midterm, which was 2 essays and 10 IDs in just over an hour; final is the same format but most people learned the hard way how to manage your time. Also, readings and lecture topics are not the same so you should do both if you want to do well. \nIf you have any interest in U.S. or immigration history, take this class. Professor Ngai will challenge your preconceptions about both. And if you don't take it, read her book!!\nWorkload:\nMedium to heavy. \n- Reading load was on the heavy side, usually over 300 pages a week but you're not expected to know details in depth.\n- Midterm and final are both in class so time management is key but they are not too difficult if you're keeping up with lectures and readings. \n- 2 five-page papers: 1 primary source analysis, 1 museum exhibit review. very doable. \n"
        },
        {
            "course_name": "Immigrants in American History and Life",
            "review_date": "December 30, 2010",
            "review_content": "\nWhen I read the reviews that said that Mae Ngai is cold, I thought it wouldn't matter in a lecture class. Her aloofness, however, affects the way that she runs the class and relates to her students. She is unwilling to hear the views of others, does not respond to emails, and has such a clear agenda in class that it makes it hard to listen to her seriously. This is immigration history taught with a huge bias, which became clearer as the semester progressed.\nBesides this, Ngai's class is certainly the most poorely run class that I have ever been in. The TAs did not send out guidelines for the papers--for which they encouraged us to send in drafts--even when it was due the next week. They, and Ngai, did not respond to emails, and when they did, it was not in a timely fashion at all. One week, they assigned over two hundred pages of reading, plus a two hour-long movie--with a paper due the following Monday. The midterm assignment consisted of 2 essays and 10 IDs, all in 75 minutes. Despite the insanity of this assignment, Ngai had the gall to tell our class that our midterms were \"not too hot.\" \nThe second half of this class can hardly be called a history class. It's just a platform for Ngai to talk about current events and the present status of foreign countries. Last time I checked, this wasn't a class in the polisci/econ/sociology department. At the end of the semester, Ngai launched into a description of the role of Univision and Televisia, and how they demonstrate a transnational culture. This was more a topic in current events/media than it was American history. \nNgai is not interested in any opinions that do not align with her own, and she regularly veered off topic to discuss matters that were not part of the course syllabus. I have taken a ton of history classes at Columbia, and despite receiving a perfectly fine grade at the end of the semester, this class was just not worth it. It was one of the least enjoyable courses I have taken during my time here, and certainly my most disappointing experience with the otherwise excellent history department. \nWorkload:\nTons of reading--generally about 250 pages, sometimes that plus reading that was missed the week before, or a movie; in-class midterm, in-class final, 4-5 page paper on a primary source handed out in class; 4-5 page paper analyzing a cultural museum in NY--I don't think the TAs even knew what to do with this amorphous assignment \n"
        },
        {
            "course_name": "The American Pacific",
            "review_date": "July 20, 2009",
            "review_content": "\nI need to differ with the other reviewers about Prof. Ngai.\nI found her to be the most snide, condescending,  and non-engaging instructor I have yet encountered at Columbia. She clearly plays favorites, and deals with comments from students in the course of discussion by smirking, through ridicule, making since comments or just disapproving facial gestures.\nShe seemed to be totally non-involved in the Course, which is difficult in a room of 10 students. In fact, she seemed eager to get the two hours over with so she could leave.\nIt is a pity in an otherwise stellar Department that Prof.  Ngai maintains such a low level of discourse. \nWorkload:\nFair amount of reading, but totally pointless weekly Coursework postings, as well as a short paper and a long final paper.\n"
        },
        {
            "course_name": "Colonization/Decolonization",
            "review_date": "February 11, 2009",
            "review_content": "\nNgai just created this class as part of the new program for Comp Ethnic Studies, and it is really fantastic. She stimulates great discussions, poses challenging questions, really makes you consider and think about the material, and brings to light issues that you might never have thought about before. she knows a ton about all the material, and what she didn't know, Prof Lomnitz did, since they co-taught the class.\nThe readings are almost all primary documents, which is hard at first, but allows you to really make opinions for yourself and have interesting discussions about the first-hand sources and accounts. ngai has high standards and is very technical and academic sometimes, but her intelligence is inspiring and her expectations are not totally unreasonable.\ni highly recommend this course, though the reading is heavy and the papers are graded sort of harshly, it is worth it in the end because you'll learn a lot and probably get a pretty good grade since there is no midterm or final and you don't have to memorize anything.\nWorkload:\na ton of reading since it was a seminar, movies outside of class, four papers throughout the semester. no midterm, no final.\n"
        },
        {
            "course_name": "U.S. in the Progressive Era",
            "review_date": "March 26, 2008",
            "review_content": "\nProfessor Ngai is reserved but brilliant. She's famous too. We went on a class trip to the New York City Tenement Museum and our tour guide recognized her [she's a big wig in the field of Asian-American studies] and he started sweating bullets; I think she found it pretty funny. That anecdote aside, she's a bit of a tough nut to crack. I feel Ngai kept a lot of the class at arms length but picked a few students [all female] that she lavished attention on. But in spite of this, she is great at leading discussions and I often looked forward to going to the class. While the Progressive Era is not really her specialty, she did a good job teaching it and I would absolutely take that class over again if I could.\nWorkload:\nIts a lot of reading, but all history seminars are like that. \nWe each had to do a presentation on one of the books, two 5 page analyses of the sources we read, and a standard 15-20 page research paper. I think that if you genuinely put effort into the class [participation to her is important] and your paper you will do well.\n"
        },
        {
            "course_name": "Asian American History",
            "review_date": "November 07, 2007",
            "review_content": "\nThe class mainly focuses on the Chinese and Japanese immigrant experiences. We kind of glossed over the Philippines, Korea and  Indonesians. We do read one book about Philippino nurses but this reading was not incorporated into the lecture at all. The class covers Chinese Exclusion, Japanese Internment and how these cases relate to contemporary immigration issues.\nIn general, Ngai's lectures tend to emphasize legal history as Mae Ngai thinks of herself first and foremost as a legal historical. In this class, you are expected to memorize all the court cases, laws and acts related to Asian Americans in the United States. \nI do want to point out that I had been looking forward to taking her class since last year, but it is definitely not what I had expected. Though, I think that Mae Ngai is a brilliant historian, there is an awkwardness about her that makes her seem unapproachable. Outside of class, she seemed distant and not that interested in her students. But, the TA for the class, Melissa, was approachable, friendly and quite knowledgeable on the subject matter.  \nOverall, I am enjoying the class and would recommend it to anyone interested in Asian American studies or American immigration history. It is an important chapter of both Chinese and American history and certainly worth studying.\nWorkload:\nNot too heavy.Two short essays: 15% eachMidterm exam: 25%Final exam: 30%Discussion section: 15%\nShe does not give out IDs or essays before the exams. However, as long as you focus on the legal history, you will do fine.\nThis class IS NOT an easy A.\n"
        }
    ]
}