{
    "prof_info": [
        {
            "prof_name": "Miyuki Fukai",
            "prof_id": 2421,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Japanese I",
            "review_date": "January 18, 2006",
            "review_content": "\nMiyuki Fukai is one of the best Japanese teachers there is.  She is definitely the best first year one I've experienced. \n(Because of scheduling troubles, I've actually had a class with three out of the four).  Fukai-Sensei originally studied the application of computers to learning.  As such, her classes are powerpoint-based.  You might think, What?  Powerpoint in a language class?  Well, she does it EXTREMELY well.  Because she doesn't have to spend time writing or drawing, the class has little wasted time.  The utility of the projector means you get much more reading practice then you would in other classes.  And, because she can use real pictures, (say, of Japanese road signs) you have a much more diverse learning experience.  Fukai is extremely lively, and I ALWAYS left class with a smile on my face, no matter how hard the material was.\nShe is extremely nice, but never sacrifices your learning.  If you forget to bring a homework, which happens since there is a lot of paper, there is no penalty if you bring it later that day.  If you correct your homeworks, she gives some credit back to recognize your effort.\nHowever, Fukai-Sensei's best quality is her classroom style.  Always energetic and lively, I looked forward to this class every day.  She constantly engages everyone, so you have to speak the language.  It's not all drills, however.  She makes sure to keep the class as conversational as possible.\nIn short, if you can work your schedule, take her class.  Even if you only study the language for a term, it will be worth it, if just to see that there are classes at Columbia that are inspiring and fun.\nWorkload:\nPretty standard for first-year japanese.  Quizzes almost every day.  Expect to burn through a LOT of flashcards because there is a lot of vocabulary.  Also expect to spend more than an hour a day studying.  Tests weren't too bad, she helped prepare for them well.  Daily homeworks really helped me learn.\n"
        },
        {
            "course_name": "Elementary Japanese B",
            "review_date": "January 16, 2005",
            "review_content": "\nI really enjoyed Fukai Sensei's class.  She is young and has a sense of humor, which means that class discussions can get entertaining considering that your japanese vocabulary is smaller than a five year old's.  However, this does not mean that Fukai Sensei does not take teaching very seriously.  She is exceptionally well prepared for class and stays very close to the syllabus.  At times we would run through the drills she had prepared a few minutes early, yet she always managed to make good use of classtime by coming up with a new exercise on the spot to dril us with. Though she is more than willing to help if you are having trouble, don't expect a break just because you're lazy.  Overall, Fukai sensei is very competent teacher who manages to keep her sense of humor while putting as much work into the class as she expects you to put into it.  \nWorkload:\nSame as other Japanese classes.  Quizzes every day, midterm, a final essay, and a final.  Expect to do around an hour or more per class, plus another 45 minutes if there's a language laboratory due (there's one per lesson).  \n"
        }
    ]
}