{
    "prof_info": [
        {
            "prof_name": "Julie Crawford",
            "prof_id": 461,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Milton",
            "review_date": "May 02, 2016",
            "review_content": "\nProfessor Crawford is by far my favorite professor thus far at my time here! She's incredibly brilliant and reads each poem in so many different contexts (historical, religious, etc.). Each way of reading and interpreting the poem or piece of prose is correct...and she makes you truly believe that. I used it to allow for a free flow of ideas. Never once has my book been written in as much as I did for this class. \nShe makes class so enjoyable by her sheer excitement for the material. \nShe has a ton of office hours that I used to both help my understanding of the material and to just talk to Professor Crawford about anything and everything.\nShe also gives a lot of great feedback on my essays. \nWorkload:\nLight readings for a 3000-level English class, one 4 page paper, 5 page paper, 7-9 final paper, final\n"
        },
        {
            "course_name": "Milton",
            "review_date": "January 09, 2013",
            "review_content": "\nJulie is one of the best professors to take English classes with at Columbia, especially if you're still trying to figure your way out in the major. She is energetic, kind, and always helpful -- she assumes you might not know exactly what you're doing and is always willing to work with you. She does expect a decent amount from her students, but she gives you back a lot in return--she holds lots of office hours, fairly outlines her expectations for papers, and knows each and every student's name. \nMilton is one of her harder classes, but it is a worthwhile experience and a good way to fulfill your pre-1800s requirement. You will do a lot of reading. You will have to grapple with hard concepts and some history. But Julie makes it worthwhile at the end. You get to read all of Paradise Lost. \nWorkload:\nthree papers (two shorter ones & one term paper) and a final exam with quote IDs, place/people etc. IDs, and an essay that you know the topic for before, reading for every class (sometimes light, like a few poems, usually a book of Paradise Lost or a prose work)\n"
        },
        {
            "course_name": "Milton",
            "review_date": "May 27, 2011",
            "review_content": "\nTake a look at how many likes and dislikes the previous comments have had. Yes, Crawford is energetic, conversational, and \"cool.\" Yes, she loves Milton. Yes, you will probably love Milton when you read him (but probably not as a result of Crawford). No, she is not the greatest lecturer at Columbia or in the English department. Definitely don't take her class if you're a senior. You will be disappointed and come to agree with a previous reviewer's assessment of Crawford as an \"intellectual lightweight.\" This is an English class on Milton that has a final exam instead of a final paper and does not demand more than 9 pages of writing in total from you for the entire semester. She tries to make a 50 person lecture into a discussion by throwing out leading questions and throwing back all responses that weren't what she was fishing for. If you're looking for an English class to challenge you and develop your critical reading and writing skills, this is not the one to take. If you are looking for a class that will hold you semi-accountable for actually making it through Paradise Lost, Crawford's lecture is serviceable. \nWorkload:\nreading 2 books of PL a week, one 3-4 page paper, one 5 page paper, one final\n"
        },
        {
            "course_name": "English Literature 1600-1660",
            "review_date": "May 20, 2010",
            "review_content": "\nProfessor Crawford is great. She's an entertaining lecturer who makes it fun to be present in class. She obviously loves what she studies, and she seems to genuinely like her students. She appreciates insightful comments from her students, and doesn't make anyone feel inferior if they're not brilliant. If you plan your assignments in advance and ask for her advice, she'll be generous with the information that she shares with you. She has the class do three shorter assignments, in which you practice \"skills\" such as close reading, using the OED, and conducting primary research on EEBO. I personally found it all very useful, especially when you get to the final paper and feel that you have a lot to draw from. Prof Crawford's not an easy grader, but if you work hard, you'll do well and will appreciate her copious comments on your papers. Also, she will yell at the class if she feels they haven't prepared adequately, so do the reading. It's worth it anyway. Who wouldn't love Donne, Herbert, Jonson, Shakespeare, and Milton (to name just a few)? This is overall a great foundational course with a great teacher. \nWorkload:\nFairly light reading (mostly poetry readings plus one play). Three short papers (2-4pp) and one longer paper (8-10pp). An easy final with ID's. Make sure that you attend lecture. She'll know if you're not there. \n"
        },
        {
            "course_name": "Feminist Texts I",
            "review_date": "January 08, 2005",
            "review_content": "\nAbsolutely hands-down the single best professor I've had at Columbia.  I don't want to overstate my case and make this another polarized review people totally discount, but damnit, Julie Crawford will teach you shit.  I concede that part of the reason I like her so much is because her academic interests are particularly compatible with mine; nonetheless, there's little subjective about a professor who delivers engaging and witty lectures, stimuates provocative class discussion, and begs students to attend office hours.  I'd recommend taking her up on that plea: she's one of the most approachable professors I've ever met, and takes as much time as she has to discuss papers or really anything else that's on your mind.  She's a damn tough grader, but can be counted upon to provide insightful and helpful comments on papers, no matter what grade you receive.  Some claim she prefers female students or feminist topics; I'd attribute those claims to those who are intimidated by unfamiliarily feminist people and topics (or--gasp--lesbians).  She's not going to make any apologies for her political-ideological standing, but I've seen her be a lot more accomodating than she needs to be to those who disagree with her (i.e. the token obnoxious Republican who \"participates\" incessantly).  Seriously, take a class with her and decide for yourself.  I guarantee you'll learn something\nWorkload:\nThree short (2 pp) papers, one longer (6-10 pp) final paper, one totally reasonable midterm.  Don't scoff at or blow off the shorter papers: she takes concision and conviction in an argument seriously and her assignments are well-considered and interesting.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2004",
            "review_content": "\nJulie Crawford is a good teacher in my opinion.  She makes boring dead Greek people actually seem interesting.  The class is pretty much interactive lecture interspersed with group excercises.    If you're a shy person then it's possible to open up cuz Julie's an approachable person. She is available 2 times a week for office hours which I found very helpful.  Some people have said that she disregards their ideas but I didn't really have any problems. Overall an awesome teacher.\nWorkload:\nReading every night. You should definitely do the reading if you're not a brilliant writer.  Although certain people in the class never did the reading and did just fine.  Essays every other week and a midterm (which i bombed) and a final.\n"
        },
        {
            "course_name": "Feminist Texts I",
            "review_date": "June 18, 2003",
            "review_content": "\nIf I were a competent poet, I'd write a sonnet to her teaching style.  Julie Crawford ran one of the most engaging discussion classes I've ever been in, even in spite of a few aggressively stupid class members.  She was so engaged with the readings -- if we faltered in class she'd pick out a part and connect it to modern life, or she'd jump in with some handy background info --and she got genuinely excited in a lot of the discussions, as did everyone in the class with some sort of political consciousness.  Even the less feminist-oriented English students who took the class because of Crawford had fun, and the readings are awesome all-around.  Take this class if you care about feminist theory and practice, and take it with Crawford if you want a fun and dedicated teacher.  (ps -- don't be afraid, boys, this reviewer is a boy and had a fantastic class)\nWorkload:\nOne short (5-7ish) paper, one long (10-15ish) paper, some research for the latter.  A book per week or so, and bear in mind that some discussions will run over.  You present once per term.  Fair, even generous, grading.\n"
        },
        {
            "course_name": "Milton",
            "review_date": "May 29, 2003",
            "review_content": "\nA very nice lady, but something of an intellectual lightweight.  One of her good lectures does some decent close reading, points out some interesting parallel constructions between Books 3 and 9 of Paradise Lost, for example, and analyzes the use of the word \"fancie\" in Milton.  Moreover, she feels comfortable saying something like, \"So what the fuck is Milton doing here?\" in front of the class, which makes you feel good because, you know, the professor's bein' all cool.  This is all well and good, and I would have been extremely impressed by it when I was a freshman.  But I came to realize that what she does with a text is extremely hollow -- she will make you learn some things about Milton, but she will NOT develop your ability to read, interpret, and think about texts.  As the semester went on, her leading-questions style became more and more agonizing.  \"What the fuck is Milton doing here?\" was intended to launch us on a quest toward a particular answer she already knew -- not a genuine call for discussion.  This is infuriating and did not help me think profound things about Milton.  By the end of the class, I couldn't stand her teaching, and felt that I would have gotten more out of Milton if I had read Paradise Lost and some critical essays about it myself.\nWorkload:\nEssays and poems for a month, then Paradise Lost for the rest of the term.  I couldn't get into the essays and poems and I feel strongly that they should be dropped from the course.  There are two 4-5 page papers, which bespeaks the extremely low level of intellectual achievement that she expects from the class -- so if that's what you want to give, this might be a good class for you, but I actually wanted to learn, and she really didn't want to challenge me to do so.  No midterm.  Standard undergraduate English dept. final -- IDs, passage analysis, an essay.\n"
        },
        {
            "course_name": "Milton",
            "review_date": "May 12, 2003",
            "review_content": "\nOh, she'll make you love Milton by the end of it. Prof. Crawford is such a great professor! Not only is she insightful, but she is enthusiastic about the material as well. Do take a class with her, any class, if you can. Milton, by nature, presents a challenge. But a worthwhile one. She'll teach you how to read a passage in depth and fall in love with English all over again... \n"
        },
        {
            "course_name": "Feminist Texts I",
            "review_date": "April 30, 2003",
            "review_content": "\nProfessor Crawford is simply one of the greatest resources Columbia has to offer its students.  I am so amazed at the reviews that portray her class negatively, that I can only wonder how much class the authors of those reviews actually attended.  In any event, to any student who is serious about the study of English Literature, or about the study of Feminism (an intellectual pursuit that cannot be responsibly dismissed as easily as some of these reviews imply) will find any of her classes to be simply a revelation.  If you are looking for easy classes, then I would suggest you look elsewhere - unlike some reviewers, I say this not as a complaint or warning, but as an enticement to the student and a compliment to the teacher.  in addition to all of the above, Professor Crawford is a warm and kind person to ALL of her students, and she makes attempts to reach out to ALL of her students.\nWorkload:\nThe readings are substantial, but always worth it, and the papers are never longer than 10 pages, usually much shorter.  Not to insult those who claim she's a \"hard\" grader, but good and bad papers are rewarded appropriately.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 16, 2003",
            "review_content": "\nI liked the discussion in this class, and i think professor crawford knew her stuff.  however, I agree that she played favorites and her grading was based upon who she liked.   I received terrible grades on my papers (though I was receiving A's in L&R; at the same time), and when I went to see her she was not helpful.  If you like interesting class discussion, then I would recommend this class but be forewarned that this class could kill your GPA.  She clearly knows her stuff, but I still don't think this class is worth taking.\nWorkload:\nMidterm was difficult, harder than most.  papers graded very harshly.\n"
        },
        {
            "course_name": "English Lit: 1600-1640",
            "review_date": "January 20, 2003",
            "review_content": "\nI have to say that this class confused the hell out of me.  Professor Crawford is, as many of the other reviewers have said, very into Renaissance Lit.  And she does make an effort to create interesting lectures.  However, every lecture essentially consisted of Professor Crawford doing a close reading of the pieces we read, and providing some background information enabling us to \"get\" the references in the material.  This resulted in a rather disjointed lecture without even a hint of a unifying theme.  Thus, when I sat down to write the short 3-page essays we were assigned, I found I had no real idea of what Professor Crawford was looking for.  At the end of the class, I felt that I'd learned a lot of facts, but had little conception of underlying themes and ideas.  Don't suffer through that kind of thing if you don't have to.  Sit through an initial class or two and if the spark isn't there, get out.\nWorkload:\n3 short papers, a midterm, and a long (8-10 pg) final paper.  No final exam.\n"
        },
        {
            "course_name": "Literature in the Age of the Revolution 1600-1640",
            "review_date": "January 19, 2003",
            "review_content": "\nNo one can deny that Julie is passionate about what she teaches.  She is funny, eccentric, and she has an obscene store of knowledge about the English renaissance.  But don't let this fool you.  She is an ardent feminist, and good for her.  NOT good for you, though, since she teaches nearly every class from a tunnel-visioned feminist's point-of-view.  I don't think anyone in our class would have disagreed with Julie's arguments about the rights of women in 1600-1640, (and my absolute favorite day of class was when she came out to us all on Halloween) but WHO THE HELL DOESN'T ALREADY KNOW THAT WOMEN WERE TREATED LIKE SHIT BACK THEN?\nThere is more to literature than gender struggle.  I swear to christ, there's so much more...\nAnd this self-proclaimed radical and champion of the has-been underdog shamelessly gets off on cracking her academic whip.  She is an impossible grader.  She asks obscure but pointed questions to which no one who cannot hear her own labyrenthine internal monologue could respond, and she makes a monstrous, self-aggrandizing show of ignoring opinions different than her own.  \n\nWorkload:\nThree 2-3 page papers, and a final 8-12 page research paper.  Midterm.  No final.  Plenty of reading--some poetry and hundreds of pages of second-hand texts that you will barely touch on in class.\n"
        },
        {
            "course_name": "English Literature 1600-1660",
            "review_date": "April 28, 2002",
            "review_content": "\nThere hardly seems a need to add my praise to the heap, but I can't resist because I really learned so much from Prof. Crawford. If you are an English major (or thinking of being an English major, or like English, or hate English...), you should definitely take a class with her. She teaches you to be a careful, contientious and attentive reader, and to consider the import of your arguments. In addition, she is one of the few profs. I have had who has really respects their students' intellect and ideas; she will take you seriously. Finally, I came away from her class with a more thorough knowledge of Jacobean literature (both of the high-brow sort, and of popular pamphlets and the like) than I have gained from any other class on any other period. \nWorkload:\n3 short papers (2-3) pages on really interesting topics which use different approaches to literary analysis, one long paper of around 10 pages. My year she had a midterm and a final, but I hear that she does not do that every year. I know it sounds like a lot of work, but it's worth it.\n"
        },
        {
            "course_name": "English Literature 1600-1660",
            "review_date": "January 16, 2002",
            "review_content": "\nJulie Crawford taught me to love English. Her enthusiasm is contagious, and she runs discussions in lectures well, although she does tend to run out of time for students to ask questions at the end. The papers she assigned were entertaining and not too hard. Three papers in different directions (close reading, primary research, and critical research, I think) culminated in one paper at the end which incorporated all elements. Julie is appealing, friendly, helpful, and the least snobby professor I've ever met. Her class incorporated a certain amount of feminist theory, but that the main focus always remained on the poetry and plays themselves.\nWorkload:\nThree short papers, a quiz, and a final paper. Reading is moderate.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 11, 2001",
            "review_content": "\nThe Bottom Line? I hated her. You may think she is great by reading the other reviews, but she isn't. If you don't hate essay writing yet she will make you hate it. Her questions were so retarded I had to switch classes half way through the year. I read every word of all the texts, but I was not one of her favorites so I did worse than most of the classes. If she loves you, you will do fine...... but if she hates you, you are guaranteed no higher than a B, and 4 points of B doesn't exactly help you when most people who take Lit Hum have teachers that give nothing less than a B+.\nWorkload:\nTOOOOOOOOO MUCH.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 09, 2001",
            "review_content": "\nHighly recommended, and probably one of the best teachers you can take Lit Hum with. She assigns more essays than any other Lit Hum teacher I know, but you WILL benefit from her class. The essay topics she assigns are unconventional and open-ended, which force you to actually think about the texts (and make the essays somewhat fun to write). If you've studied any of the books before, be prepared for an alternative interpretation, cause she's got her own ideas about every text, and knows more than enough to back up her stand. The only fault I could find was with respect to time management - in both semesters of Lit Hum that I took with her, we ended up running late toward the end of semester and rushed through the last few books.\nWorkload:\n4 Essays (3-5 pages), Study Guide for one book, Midterm, Final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 06, 2001",
            "review_content": "\nI agree with most of what everyone else said. Professor Crawford is a great teacher. I always left class with a much better understanding of the text than I had when I went in. She knows what she's talking about and you will definitely benefit from her knowledge. I disagree with the suggestion that she doesn't tolerate opposing views; say something different or interesting and back it up, and she'll be happy to listen. She will teach you to read closely and analytically. Personally, Professor Crawford is enthusiastic and interesting. She definitely makes an effort to get to know her students. However, she often runs the class more like a highly interactive lecture than a true discussion. Students are definitely involved (there's also a lot of small-group work), but she leads the class discussion. Overall, though, I think there are more pros than cons to her style. She's organized, and the class is interesting. She does expect a lot of you, but you'll learn a lot and enjoy Lit-Hum.\nWorkload:\n4 shorter papers (2-3 pages), a study guide for one text that is copied for everyone in the class (helpful for midterm/final if everyone does a good job), midterm (that's a little more challenging than that of some other sections) and a final. Her grading can be difficult, but it's fair, and you'll be well-prepared for the department final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 06, 2001",
            "review_content": "\nI agree with most of what everyone else said. Professor Crawford is a great teacher. I always left class with a much better understanding of the text than I had when I went in. She knows what she's talking about and you will definitely benefit from her knowledge. I disagree with the suggestion that she doesn't tolerate opposing views; say something different or interesting and back it up, and she'll be happy to listen. She will teach you to read closely and analytically. Personally, Professor Crawford is enthusiastic and interesting. She definitely makes an effort to get to know her students. However, she often runs the class more like a highly interactive lecture than a true discussion. Students are definitely involved (there's also a lot of small-group work), but she leads the class discussion. Overall, though, I think there are more pros than cons to her style. She's organized, and the class is interesting. She does expect a lot of you, but you'll learn a lot and enjoy Lit-Hum.\nWorkload:\n4 shorter papers (2-3 pages), a study guide for one text that is copied for everyone in the class (helpful for midterm/final if everyone does a good job), midterm (that's a little more challenging than that of some other sections) and a final. Her grading can be difficult, but it's fair, and you'll be well-prepared for the department final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 06, 2001",
            "review_content": "\nI agree with most of what everyone else said. Professor Crawford is a great teacher. I always left class with a much better understanding of the text than I had when I went in. She knows what she's talking about and you will definitely benefit from her knowledge. I disagree with the suggestion that she doesn't tolerate opposing views; say something different or interesting and back it up, and she'll be happy to listen. She will teach you to read closely and analytically. Personally, Professor Crawford is enthusiastic and interesting. She definitely makes an effort to get to know her students. However, she often runs the class more like a highly interactive lecture than a true discussion. Students are definitely involved (there's also a lot of small-group work), but she leads the class discussion. Overall, though, I think there are more pros than cons to her style. She's organized, and the class is interesting. She does expect a lot of you, but you'll learn a lot and enjoy Lit-Hum.\nWorkload:\n4 shorter papers (2-3 pages), a study guide for one text that is copied for everyone in the class (helpful for midterm/final if everyone does a good job), midterm (that's a little more challenging than that of some other sections) and a final. Her grading can be difficult, but it's fair, and you'll be well-prepared for the department final.\n"
        }
    ]
}