{
    "prof_info": [
        {
            "prof_name": "Kellie Jones",
            "prof_id": 3484,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Puerto Rican History 1898-Present, Migration and Community: the Latino Experience, Latinos in New York",
            "review_date": "March 18, 2013",
            "review_content": "\nI've never left a review on CULPA, but Kellie Jones inspired me. She is without a doubt the worst teacher I had in four years at Columbia. She taught a class on Latin American Art. Her lectures were dry, and failed to bring any of the enthusiasm or joy that the work deserved. I left the class each day feeling like she never actually said anything of substance. I was very disappointed by her class. \nWorkload:\ntwo papers. nada.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 10, 2009",
            "review_content": "\nIf you're just trying to get the Core requirements out of the way, count yourself lucky if you get Professor Jones for Art Hum. It was easily the easiest class I've ever taken, with almost no work at all outside of the time commitment of going to class and going to the museum trips, although the weekly response papers are pretty tedious. It's safe to say that you're never really required to remember anything for this class. You'll learn a bit about art and how to analyze art, but I suspect that there are other Art Hum classes where a lot more effort is required but where you would get a lot more out of it.\nWorkload:\nA couple of easy papers, a few museum trips, weekly response papers, attendance, group presentation. No midterm, no final.\n"
        },
        {
            "course_name": "20th and 21st Century African American Artists",
            "review_date": "August 17, 2008",
            "review_content": "\nProf. Jones knows her modern and contemporary art.  Her power-point lectures and accompanying formal analyses are well-planned and explained.  At first I thought that her lectures were a little too basic, but after some time in the course, I realized that their accessibility helped me understand some finer points about the art.  The course survey's African American artwork beginning at the turn of the 19th century into the 21st, contextualing the works within larger national, global, and diasporic art scenes (not to be taken lightly when considering the way Africana Studies are marginalized within academe.)  She is well-connected in the art world (she partied with Basquiat in the 1980s; now she studies him), and she also brings in interesting and relevant guest lecturers--two of which I noticed were both her former students and artists in residence at the Studio Museum of Harlem.  Dr. Jones is a sharp scholar who has the respect of her colleaguesand her students.\nWorkload:\nManageable:\nWiki-project, 3 Page Formal Analysis, Mid-term, Final.  Be sure to do well on the exams.\n"
        }
    ]
}