{
    "prof_info": [
        {
            "prof_name": "Michael Swellander",
            "prof_id": 11757,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Conversation German II",
            "review_date": "December 23, 2014",
            "review_content": "\nMichael is a really good teacher, and made a great effort to engage us in conversation, both in large and smaller groups. He asked us at the start of the semester which topics we'd like to talk about, then followed through and came up with interesting activites for us for each one. I was impressed by how clearly he explained new concepts, and how enjoyable the class was (even when energy was low and no one really wanted to speak German).\nI took this in conjunction with Intermediate German I, and speaking German in some context every day really improved my skills over the course of the semester. Grammar is not the focus of this class, and if you want every German sentence you create to have the correct word order, this won't help you. However, if you're looking for more general ease with the language, this is a great and relatively easy 2 points. \nWorkload:\ntwo vocab lists, some little assignments to prepare for the next class\n"
        },
        {
            "course_name": "Elementary German I",
            "review_date": "April 24, 2013",
            "review_content": "\nI decided to write this review because there are no other reviews written for Michael, which is a shame because he is definitely one of the best language teachers at Columbia.  He is extremely enthusiastic and energetic, especially for presenting such a basic topic, which is mostly about grammar.  This is definitely a perk because it wakes you up.  Furthermore, he is pretty good about participation, speaking in German during class and making sure everyone understands his German, and explaining things clearly (though grammar is one of those things you can learn from a book just as well).  The one downside is that vocabulary doesn't seem to be emphasized during the course or the tests, and it is possible to get through the entire course without learning much vocabulary, which is a shame.  Also, he's very understanding and reasonable about grading for tests, HW, and assignments.  \nWorkload:\nStandard workload for german, about 3 hours a week if you're in a rush.\n"
        }
    ]
}