{
    "prof_info": [
        {
            "prof_name": "William Worthen",
            "prof_id": 3992,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Theatre History I",
            "review_date": "May 05, 2011",
            "review_content": "\nProfessor WB Worthen is a really terrific teacher who inspires you to engage with all the aspects of theatre, and analyze how performances work to make artistic meaning. \nHis classes are mainly lecture based, with him doing most of the speaking and the entire class feverishly attempting to write down his exact words. The lectures always have a very strong focus on a single element of a play or production that then can be used to discuss other plays or other concerns, which helps you first get a grasp on some of the complicated epistemological/artistic concerns he is interested in (illocution, embodiment, authenticity, and many more), and then you are expected to apply them on your own to other work. \nSome people complained about how fast he spoke in Theatre History, but I found the pace to be more about the train of thought than every point that got him there. If you don't understand things, Prof. Worthen is super accessible (especially for the head of a department) through e-mail or at his office hours.  Though he is a lecturer, he always asks questions and genuinely responds to questions and comments. He appreciates class participation. \nSomething that I especially appreciate about WB's classes is that he is always bringing in topics of conversation from NYC performances, always wants to hear what people \"saw over the weekend,\" and generally encourages people to go see and critique shows out in the city. The fact that he is teaching heavily historical and critical classes, but remains a passionate consumer of contemporary theatre makes the material he teaches all the more relevant and important.  \nAnyone who is interested in performance, literature, or art criticism should definitely leap at the chance to take a class taught by Professor Worthen. \nWorkload:\n2 papers, 1 final for the courses I took. The first paper is generally shorter and pointed (ie has a very specific topic that everyone has to address), while for the second, longer paper you choose your own topic, which he has to approve. He grades fairly, but expects high quality thought in your paper. Definitely favors content over structure/pretty writing. \nReading load is moderate but manageable. Maximum is a long play and 2-3 critical/background readings per week. \n"
        },
        {
            "course_name": "Modern Drama",
            "review_date": "April 02, 2010",
            "review_content": "\nThere is simply no one out there that compares to William Worthen. He is the authority on all things Modern Drama AND Shakespeare; his own writings weigh the two. His passion in the classroom will keep you engaged from the moment he enters to the moment he realizes that class time is up (you will not be noticing the clock at all during his class). His lectures are incredibly coherent and he uses no notes to facilitate them. He simply knows the texts inside and out, can pull quotes from nearly anything off the top of his mind, and his discussions of the plays are illuminating. He does not recite cliches but his ideas and opinions are based in a lifetime of devotion to the study of theater. He is a brilliant and charismatic man and one should seize the opportunity to take a class with him.\nWorkload:\nTwo papers and a final. Contrary to what the other reviewer has said about grading, I felt that Worthen was a fair grader and gave me many suggestions. He wants to see you in dialogue with the texts, not plot summaries. One Broadway play (discounted tickets). Very do-able, but not a blow-off class. You need to enjoy the Modern stage.\n"
        },
        {
            "course_name": "Theatre History I",
            "review_date": "February 12, 2010",
            "review_content": "\nProfessor Worthen is first and foremost passionate about theatre and he has the gift of teaching in that he can spark that passion in his students. And that is the difference between a good and a great professor. I found myself fascinated by the plays, the artists, even the theory part behind performance studies. Many things he taught have changed my perception of live performance and theatre to the better. He is also brilliant, witty, funny, and always prepared to the nines. Watch him when the computer doesn't live up to his level of perfection and you will get a performance by the master himself. It also needs be mentioned that Professor Worthen absolutely ALWAYS LISTENS to everyone's comments, and he truly 'hears' the students. Being at Barnard, he has shown a respect for the woman's perspective that some professors at Columbia might want to live up to. He is also not afraid to stand up for people, popular or not, if he believes they have earned it. All in all, if you are passionate about theatre, acting, performance studies, or literature in general, you will walk away from his class convinced that you chose the right major!!!\nPS: He loathes the Romantic Poets. So go ahead and quote Keats and you'll see that he'll cringe but still give you a fair grade. He truly has negative capability, q.e.d.\nWorkload:\nA lot. 2 essays, rather difficult topics. If you don't have a theatre background, I recommend taking another class in that field first, otherwise it might prove hard.\nOne final, also rather heavy, but he grades extremely fairly. And he knows if you've done the work or not.\n"
        },
        {
            "course_name": "Modern Drama",
            "review_date": "August 27, 2009",
            "review_content": "\nProfessor Worthen is simply an extraordinary human. Not only is he utterly brilliant, but he is outrageously funny and kind as well. His energy is contagious and engaging and makes for an all-round enjoyable classroom experience.\nHowever, while I would love to have coffee, sit, and chat with Professor Worthen, I would question taking another class with him. As a casual theatre-goer with no previous classroom experience with theatre history, I felt lost for much of the class. Throughout his lectures Professor Worthen, in all of his radiant brilliance, constantly made casual references to playwrights, actors, theatrical technique, movements, etc. that were way over my head. This is a warning to anyone unstudied in theatre that while a prerequisite is not stated for the course, a working knowledge of theatre history is expected.\nThe course was well organized, but aside from having read some really great plays, I barely managed to scrape through the class with a B and my knowledge of Modern Drama is now minimal at best. \nWARNING: Your entire grade in the class is based on two essays (one short, one long), the final test, and minimal class participation. Worthen is a tough grader and there are no opportunites to make up your grade if you do poorly on one of the assignments. Also, if you don't do all or most of the reading, you will be very sorry by the end because EVERYTHING that was ever discussed in the lectures is fair game on the final including the identification of specific quotations that might have only been mentioned breifly.\nWorkload:\nQuite a few plays and essays to read. The plays are enjoyable, the essays tedious and the workload sporadic. Some days you find yourself with little or no reading and some reading assignments are very nearly impossible to complete in the amount of time given. Two essays (one short, one long) and  a final.\nWARNING: Your entire grade in the class is based on the two essays, the final test, and minimal class participation. Worthen is a tough grader, doesn't give much feedback, and there are no opportunites to make up your grade if you do poorly on one of the assignments. Also if you don't do all or most of the reading you will be very sorry by the end because EVERYTHING that was ever discussed in class is fair game on the final including the identification of specific quotations. Notes on the lectures are essential to studying for the final.\n"
        }
    ]
}