{
    "prof_info": [
        {
            "prof_name": "Anne Nelson",
            "prof_id": 5092,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "New Media and Development Communication",
            "review_date": "December 22, 2013",
            "review_content": "\nThe professor justifies taking this course. She's a fascinating person with lots of fascinating stories and experiences of all kinds (war journalist, author, and playwright), a member of CFR and moving in some very interesting circles when it comes to development and tech, and she is not at all shy about making introductions for students. \nThat said, this year the class itself was a mixed bag. It wasn't bad, but it felt like it was missing out on its potential, given its focus and interesting assignments. It felt like 80% of the discussion was actually about the (speculative) drawbacks of how we use technology in the *developed* world. The discussion of application to international development was very limited. Near the end of the semester we had some fascinating readings on the use of tech in development, but never seemed to get around to discussing them. Most of what we talked about tracked things like \"is Google making us stupid.\" Particularly frustrating when one of the best readings was written by the prof herself about the use, success, and failures of tech in the Haiti earthquake aftermath-- which somehow never really made it onto the discussion agenda. I think we spent the day comparing how often people in the class logged onto Facebook and how that made them feel.\nAlso, while I still recommend the professor, her grasp of current ICT is a bit limited. At one point I think when she was trying to show something to the class, she asked us \"which Google we needed to go to to get to Spanish-language Wikipedia\" (o.O). Her perspective on tech is definitely one of a skeptical outsider, which is valuable, just as long as you're aware of that going in.\nWorkload:\nUnorthodox. Not a heavy workload exactly, but a decent amount of reading, and around 8 interesting written assignments based off of experiences like editing a Wikipedia page or forgoing all use of tech for 24 hours. Some of the writing assignments feel a bit odd (for example, reading an entire book and then writing a one-page \"reaction\"). Final project is a group research project that you post to a wiki rather than a tradition paper. Past years' projects are still online and some make for interesting reading, especially those that com from multilingual backgrounds and who can access foreign-language data. \n"
        }
    ]
}