{
    "prof_info": [
        {
            "prof_name": "Jo Phelan",
            "prof_id": 3076,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Stigma & Discrimination",
            "review_date": "December 10, 2011",
            "review_content": "\nOverall, I'd recommend this class as one of the better sociology seminars. Phelan covers many aspects of stigma, especially the theoretical underpinnings. The class approaches many types of stigma, including disabilities, sexual orientation, and mental health, so you don't have to suffer from white guilt week after week, if you're worried about that. She makes you post about the readings on before each class, which means that everyone has actually done the readings before the discussion and has stuff to say.\nBy the end it does get a little repetitive, but after this semester I feel like I have a pretty thorough understanding of stigma and discrimination. And the class was pretty painless, and sometimes really interesting, along the way.\nWorkload:\nEasy. two-page weekly responses, one \"stigma in the news\" presentation, and a 10-12 page journal article, draft proposal, or write-up on an experiment involving stigma. \n"
        },
        {
            "course_name": "Stigma & Discrimination",
            "review_date": "January 06, 2009",
            "review_content": "\nI was so astonished at how crucial an intellectual role Prof. Phelan played in the research of stigma and discrimination in the psychology and mental health fields. While it seems natural that professors will assign readings that reference themselves, the sheer number of scholars and researchers who have their research based off Prof. Phelan and her partner Bruce Link surely indicates her position in the field. If you want to learn about the cutting edge stuff going on in psychosocial research today, you will want to talk to her. That said, it was hard to get myself motivated to go to class. For the first half of the semester, Prof Phelan's lesson plans rarely included the readings because she was teaching larger theoretical frameworks that encompassed the readings. For some strange reason we didn't really read any of the originators of these theories (except Goffman), we read research articles that illustrated how the theoretical frameworks can be proven in other contexts. Towards the end there was a greater meld of readings and lectures, but by then you'd been forced to read the articles anyway for the midterm. Prof. Phelan is very quiet, not the most charismatic lecturer by far and sometimes it does get very very slow as she works through her info-packed powerpoints. And also because the class is open to grad students and other divisions, you tend to get alot of older GS students who have alot of great things to say about their experiences (though not relevant all the time) who do not connect at all with those obnoxious CC kids who are all fire and brimstone but little substance. (Disclaimer: I'm a CC kid too, a quiet CC kid.) In a class titled Stigma and Discrimination, especially held during the Obama elections, you get alot of chaff and not that many insights - and Prof. Phelan only barely manages to hold her own during the \"discussions\". \nWorkload:\nWay too easy for a 3000 level class. Midterm and final were 8 and 6 ID questions requiring 1.5 blue book page answers and one 12 page research paper. Class attendance not compulsory, I attended barely more than half of the class and still got an A. \n"
        },
        {
            "course_name": "Stigma & Discrimination",
            "review_date": "September 12, 2007",
            "review_content": "\nI couldn't disagree with the first review more! Professor Phelan and is a caring and super smart instructor. She responded to my emails and was very willing to answer questions. The class was far more interesting than I had expected. She is one of the only sociology professors I have had who really lives up to the \"objective\" viewpoint a sociologist is supposed to practice. The class opened my eyes to new ways of thinking about things, the discussion was expertly guided, and the readings were stimulating. We dealt with issues that normally people think of there only being two perspectives on: theirs and the wrong one (such as affirmative action). Professor Phelan was able to take the class a level up, and look at the issue in a third, more objective way and in the broader context of all the issues we had discussed. The field study was an enlightened assignment and I ended up learning more than I do writing most papers. Don't take this class if you're wedded to preconceptions about what stigma and discrimination mean.\nWorkload:\nOpen note midterm and final, field study paper 10 pgs. reasonable volume of reading.\n"
        },
        {
            "course_name": "Stigma & Discrimination",
            "review_date": "December 16, 2006",
            "review_content": "\nReally lame-a$$ teacher who doesn't teach well, never\nresponds to e-mails and thinks the world of herself.\nAvoid at all costs!!!\n\n"
        }
    ]
}