{
    "prof_info": [
        {
            "prof_name": "Doug Williamson",
            "prof_id": 2405,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "GIS (Geographic Information Systems)",
            "review_date": "January 07, 2005",
            "review_content": "\nDoug is a down-to-earth, dedicated guy, who is one of the world authorities on everything GIS.  His lectures were a bit of a snooze, as he readily admitted, so he was very lenient on attendance (as in, only half the class would regularly show up, and he posted lecture notes online).  The main reason to go to lectures, besides socializing with every other Urban Studies major who realized that this course was the most painless way to fulfill the dreaded Â“CÂ” requirement, was that Doug would give helpful hints about how to approach the bi-weekly assignments.  Feel free to show up late, as Doug himself did many a time, and make sure to bring a crossword puzzle with you just in case.\nThe assignments were pretty straightforward, if you didnÂ’t lose your patience with what can be a very frustrating program.  But, if you ever had a question about anything (anything!), you could always email Doug, and you would have a prompt and helpful response sometime around 5am the next day when he wakes up.  I have never had a professor be more accessible by email: I think he sleeps with a Blackberry under his pillow. \nThe only thing that you should buy for this class is a sample version of GIS, if youÂ’d like to work at home.  Although Doug put a few other books on the syllabus, they were quickly forgotten by everybody.\nThis course was in how to use a computer program, so I donÂ’t really understand why there were lectures in the first place.  The class really should be taught as a lab, where every student gets a seat at a computer.  Unfortunately, there were something like 30 people in this course, even though there were only about 10 computers, which only worked half the time.  Given this awkward arrangement (imagine giving a lecture course on say, karate, or woodworking) Doug did a great job of steering this ship of half-interested students. \nThe most important thing to Doug is that you learn how to use this (very powerful and pretty cool) program.  If you can get yourself even a little bit excited about learning GIS, Doug will be there to help you every step of the way.\nWorkload:\nAbout 5 semi-weekly take-home assignments, a midterm (which doug himself described as \"cake\"), a group project, and a take-home final\n"
        }
    ]
}