{
    "prof_info": [
        {
            "prof_name": "Michael Skelly",
            "prof_id": 138,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Piano Instruction",
            "review_date": "December 21, 2016",
            "review_content": "\nWanted to add a more recent review, just to reiterate what other people have said (many years ago) -- Prof. Skelly is one of the best parts of Columbia and everything that a good music instructor should be. He doesn't demand too much, since he knows that people have limited access to pianos for practicing, not to mention a ton of other priorities, so he encourages you to go at your own pace and learn pieces that matter to you, but he always keeps you motivated to improve. He is supportive and encouraging and genuinely cares about his students, and if you take lessons with him for more than a semester, you will be grateful to have him as a point of constancy in the turbulent Columbia community. He strikes a good balance between technical and interpretative instruction, and lets you go in any direction you want with the pieces (learning something beyond your level just for the fun of it is okay with him). Overall, a great musical experience without too much pressure but a lot of rewards.\nWorkload:\nWhatever you put into it. He doesn't expect virtuosity -- basically you can practice however much you want and he will adapt his expectations to that, which I think is fair, since we aren't at a conservatory\n"
        },
        {
            "course_name": "Intermediate Piano Instruction",
            "review_date": "December 09, 2010",
            "review_content": "\nProfessor Skelly is really nice and nurturing. He is not too demanding but he seems pleased when you put in a lot of effort and slightly disappointed when you don't. He's a genuinely pleasant person and a pleasure to work with for half an hour a week. I wish I were better at piano so I could have the hour long lesson. You will get an A every semester if you just put in practice time and show consistent improvement.\nWorkload:\nCompletely up to you\n"
        },
        {
            "course_name": "Piano",
            "review_date": "December 13, 2007",
            "review_content": "\nHe is the most amazing piano teacher I've ever had- he's just such a nice guy, and always has very interesting insights into the pieces you're playing. He puts very little pressure on you, but I enjoy lessons with him so much that I practice an hour or more every day anyway, so that I can get as much as possible out of the half-hour lesson. \nWorkload:\nas much as you want it to be\n"
        },
        {
            "course_name": "Piano Lessons",
            "review_date": "May 11, 2007",
            "review_content": "\nI could not have imagined a more pleasant pianistic experience than the one I had under Michael Skelly my first year here.  I arrived in New York bright-eyed and bushy-tailed about the music department and the music community, which I later found respectively sucked balls and did not exist.  Throughout the semester, then, Michael acted as an anchor of sorts, reaffirming my faith in humanity and music pedagogy through our weekly chats and lessons.\nI disagree with the review that says Skelly is too lax; outside of a competitive, conservatory setting, this is how piano should be taught, with a laissez-faire approach that emphasizes the student's individuality in his or her interpretation.  His goal is to excite you, and to that end lessons are largely self-directed, as is your musical oeuvre: you can pick your own pieces and work on them for as long as you want; if you're not enjoying your studies, then it's your own fault.  By the end of the year, guided by Michael's huge yet adroit fingers, I had learned two tough Beethoven sonatas and made a good friend, which is more than I can say for some other classes I've taken here.\nMy only quibble is that the technical instruction was a little limited, which is a blessing because technical Nazis belong elsewhere, but a curse because having the notes solidly in your fingers is so empowering.  Other professors would do well, though, to emulate Michael's friendly and nurturing style.\nWorkload:\nYou get out what you put in.  Declare a major in \"music\" so you can reap the benefits of free hour-long lessons.\n"
        },
        {
            "course_name": "Piano Lessons",
            "review_date": "January 10, 2007",
            "review_content": "\nPersonally, I did not find Skelly to be that great of a teacher at all. He seems to think that a piece is completed simply because the notes and the rhythm are fine, without pressing further into the more musical aspects of the piece. Simply because I don't wish to become a piano virtuouso does not mean that I wish to produce mediocre music! Much more was expected of me from my previous instructor.\nSomething else that I disliked was his constant questioning of what I believed the piece should sound like- as though I were the master! He was definitely not as good as my piano teacher in high school, and I was very disappointed with the level of instruction given to piano students at Columbia University. \nAlso- 30 minutes a week is certainly NOT enough time to achieve pretty much anything. \nWorkload:\nYou have to practice, but it's as though he doesn't expect you to do so very much. \n"
        },
        {
            "course_name": "Elementary Piano Instruction II",
            "review_date": "May 16, 2005",
            "review_content": "\nMichael Skelly is probably the most amazing musical instructor I have had in my lifetime, and after playing four instruments I have had more than my fair share. Not only did I actually want to practice for the first time in my life, he really helped me to improve. But be warned: you can't just sleep through the semester and expect an easy A. He takes his job seriously, and although he is a lot of fun and very supportive, he expects you to put in the time to really practice. A lot of people want lessons, and I get the feeling that he isn't into wasting his time. If you are willing to commit to learning the instrument, though, you will get a gigantic amount out of these lessons, especially as a beginner. \nWorkload:\nPractice time for beginners probably entails at least half an hour five to six days a week if not more. \n"
        },
        {
            "course_name": "Advanced Piano Instruction",
            "review_date": "May 16, 2004",
            "review_content": "\nSkelly is very cool! Most of the class you actually talk about your piece than actually play it, and amazingly enough, it helps greatly! You can work on anything you want, even if it is way too difficult for you. For instance, my dream is to play Rachmaninoff's 3rd Concerto, so even though I'm not quite good enough to play it, Skelly encourages me and we make a lot of progress.\n"
        },
        {
            "course_name": "Piano Lessons",
            "review_date": "November 03, 2003",
            "review_content": "\nYeah, Skelly is just a great guy.  This is my third year taking lessons with him, and I've really learned a lot from him.  He allows the students to be pretty independent as far as repetoire goes, but he also has good suggestions if you don't know what you want to play.  He's pretty positive, but he's also able to criticize you and point out things you're doing wrong without it making it seem like he's questioning your worth as a human being.  He realises that for most piano students at Columbia, the piano is something we love and take seriously, but it's never going to be the only thing or the most important thing in our lives.  As a music major, but not a virtuoso pianist, this was the exact attitude I needed in a teacher.    \nWorkload:\nWell, you have to practice.  Not three hours a day or anything, but probably at least 5-7 hours a week, if you're taking hour-long lessons.  \n"
        },
        {
            "course_name": "Piano Instruction",
            "review_date": "September 24, 2003",
            "review_content": "\nA amazing teacher and pianist.  If you get an opportunity to hear him play, go - he's unbelievable.  If you take lessons with him continuously throughout your time here, you'll develop a great friendship with him as well.\nWorkload:\nAs long as you progress, there's nothing to worry about.\n"
        },
        {
            "course_name": "Piano Instruction",
            "review_date": "December 31, 1999",
            "review_content": "\nHe's kind, and a good teacher; doesn't put on excessive pressure at all. Grades are likely to go up with time: Grades based on your progress, and not what level you start out on. No exams. Workload depends on your level. Must practice every day to keep up with what is expected, though.\n"
        }
    ]
}