{
    "prof_info": [
        {
            "prof_name": "Benjamin Breyer",
            "prof_id": 4574,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "November 29, 2016",
            "review_content": "\nIf you're wondering whether or not to take a class with Professor Breyer DO IT. Just do it. He is one of the kindest professors I have ever met and genuinely cares about his students to a degree that I have yet to see in any other professor. I had Prof. Breyer for First Year Seminar at Barnard and, thanks to him, I feel much more comfortable in a seminar setting and in writing college-level essays. He is encouraging but also honest and gives good guidance, and if you have any questions or are just plain confused, Breyer is always willing to meet with you for as long or as often as you need. I think that some people are put off by his somewhat awkward demeanor, but, in my opinion, that just makes him all the more genuine and approachable. And, if nothing else, he has some pretty crazy and hilarious life stories that are 100% worth your time. I feel very lucky to have had Professor Breyer, especially in my first year, and would recommend him to everyone. \n\nWorkload:\nPretty fair. There are a decent amount of readings and 2 essays as well as a research project, but everything is definitely manageable. Also, if you have personal stuff going on or are just completely overwhelmed with work, Breyer is usually willing to make adjustments as necessary. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 12, 2014",
            "review_content": "\nI went into this class with mixed feelings and expectations, because I had poor English teachers in high school. Professor Breyer met these mixed expectations.\nThe books for his class were moderately interesting, but there truly was a lot of reading, and a lot of writing. We had two five page essays and one ten page research paper, along with weekly short papers on the books we were reading. As long as you raised your hand to speak once in a blue moon you wouldn't get called out to speak against your will for participation points.\nProfessor Breyer himself I am ambivalent about. Did I emerge from his class a better writer? Yes. The writing fellows especially helped. Professor Breyer was more than willing to meet with someone one-on-one and give feedback. However, he also seemed incredibly awkward around people, and constantly talked very quietly - even when we asked him to speak up. He also never made eye contact with anyone. \nOverall not a bad course (complete with field trips out of your own free time) but I wouldn't go out of my way to take this class.\nWorkload:\nLots of reading, moderately heavy on writing\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 08, 2009",
            "review_content": "\nAll in all, I was pretty pleased with Ben as a UW instructor.  He definitely made it a priority to meet with his students before handing in each paper (which I really advise that you do) and basically tells you what you should do to improve on it.  That being said, if you do what he asks it shouldn't be too difficult to get some form of an A in the end.  In class he acts serious but does joke around more near the end of the semester.  In conclusion, he's a nice guy who cares about his students.  \nWorkload:\nLots and lots of reading, but you can get by with only doing some of it.  He assigns weekly homework usually in the form of short essays but none of it counts towards your final grade.  That being said, you should still do it because in the very end he can use that to either lower or raise your grade by 1/3 of a letter grade.  Four essays, with multiple drafts inbetween.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 27, 2008",
            "review_content": "\nCount yourself very lucky if you get Ben for U. Writing.  Although he seems to make every effort to come off as a no-nonsense hard ass in the first few classes (he told us that if we missed more than two class periods he would lower our final grade by 1/3 of a grade, and he let us know that we should expect lots of homework and a serious time commitment), you'll soon realize that its all an and that he's actually an incredibly understanding and nice guy.  Ben really wants his students to do well, and he is eager to meet with his students about their papers as much as possible and willing to give students extensions when they feel overwhelmed with work.  Ben is also an excellent teacher and he will teach you to appreciate complex essays and will make you a better writer than you ever thought you could be.  While many freshmen complain that U. Writing is difficult and tedious class, my experience in Ben's class was great. \nWorkload:\nPretty light for U. Writing.  All that Ben counts for your grade are the 4 final essay grades - drafts and other homework assignments don't count.  However, drafts are really important since he helps you a lot when you take them seriously and Ben announces in the first class that if you regularly don't do the homework then he will lower your final grade.  Its hard to imagine anyone getting worse than a B- and its totally possible to get an A if you make sure that you show him at least one complete draft before the final and you make all the changes he wants you to make for the final.\n"
        }
    ]
}