{
    "prof_info": [
        {
            "prof_name": "Dorian Goldfeld",
            "prof_id": 497,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "Analytic Number Theory",
            "review_date": "May 18, 2015",
            "review_content": "\nDorian Goldfeld is a great guy! He's one of Columbia's most accomplished math professors, and that definitely bleeds through into the class. Often he'll prove things in non-standard ways that's he's encountered over the course of his career that are a little nicer than the regular way. One time he showed us a proof for a theorem that he made (and published) by himself, which was far shorter than the regular one. Having said this, some technical stuff will go over your heard. I wouldn't say he races through the material, but he's definitely not slow. This man is so comfortable with the material that he does pretty involved integrals and change-of-variables in a single step.\nThe first part of the course goes over the historical proof of the prime number theorem, and in the process covers an extraordinary amount of mathematical machinery, filled to the brim with incredible tricks I wouldn't have thought of in a million years. I wish at the end he gave a birds-eye view of the theorem we spent so long proving, so I could remember exactly how it all fit together. I think it got pretty myopic at points, but I can't say I didn't learn a lot in the process.\nAfter the first part of the course I was a litte disillusioned because I felt that I knew a bunch of scattered techniques without feeling I understood the subject from the ground-up. This was remedied in the second part of the course, which was primarily focused on modular forms. I gotta admit, I really liked those modular forms. There was definitely an understandable component to them, even if the results got a little crazy at times.\nThe problem sets were actually pretty good. They were all 4 problems long and took over a day or two to complete, but not too much more. I had a really hard time with the first one because I had no idea what analysis was, but after that I was able to attack them with confidence. You'll DEFINITELY need to take good notes in able to do these problems, as they often require a result proved in class. The last problem set was the best, you got to prove a few results that looked like complete black-magic, and all on your own!\nThe final was reasonable. It too used things proved in class (and how they were proved). It was a take-home final over the weekend that lasted 24 hours. The class was very small, all filled with bright kids who understood mostly everything, and they all got good grades from what I hear. Goldfeld isn't a grade monster. \nThe only prereq for the class is complex variables, but if you know all about the residue theorem and some facts about holomorphic / meromorphic functions, you'll be okay. Furthermore, I think a general mathematical interest is good to have, as he uses some group theory and linear algebra that aren't technically pre-reqs. Having said all this, the class is mostly self-contained.\nAlso, a word must be said for Goldfeld the man. He laughs a lot while teaching, and is generally very friendly and lighthearted. He talked to me on a few occasions, and genuinely seemed invested in having his students understanding the material. Sometimes he tells great anecdotes about himself or other mathematicians that bring a great character to the material.\nI would definitely recommend this class, or any upper-level class taught by Goldfeld. I think this was a relatively painless and fascinating introduction to Analytic Number Theory, which has become a vast branch of math. You learn a lot of landmark results, and break a lot of ground into the subject. I can read wikipedia articles about the subject matter and understand almost all of it.\n10/10\nWorkload:\n4 problem sets (60%), 1 take home final (40%)\n"
        },
        {
            "course_name": "Making, Breaking Codes",
            "review_date": "May 08, 2012",
            "review_content": "\nSolid class. Dorian isn't necessarily the friendliest or warmest professor, but he does a good job of explaining some fairly complicated concepts and is fairly reasonable. The class covers cryptography and coding theory and the math behind them -- they're fairly interesting topics. He stresses this in the first class and he's right: the class is much harder than the first week or two would make it seem. The first few topics you cover are pretty easy and then things really take off. The sense I get, however, is that it's still easier than most upper-level math classes, though it's not a walk in the park by any means.\nOne huge plus is that Dorian reviews the material a lot. In addition to the review sessions he gives before the second midterm and the final, he starts off each class by reviewing everything he taught in the previous class. This can be a bit tiresome if you're on top of everything, but it's great if you ever miss a class or just feel like you've fallen behind. He also writes an insane amount of notes on the board.\nWorkload:\nWeekly problem sets (usually 6-7 problems) + 2 midterms + final\n"
        },
        {
            "course_name": "Making, Breaking Codes",
            "review_date": "May 19, 2008",
            "review_content": "\nDorian Goldfeld is, simply put, the love of my math-life.  His class is possibly the best math class I've ever taken.  For the most part, he does a great job of explaining everything.  His tests seemed to cover the material in a pretty fair manner, and the grades were curved.  A lot.\nWorkload:\nWeekly homework; 2 mid-terms\n"
        },
        {
            "course_name": "Making, Breaking Codes",
            "review_date": "May 18, 2008",
            "review_content": "\nThis class is probably one of the easier higher level math courses offered at Columbia.  Number theory isn't a prereq for Codes, and it only crept up a couple of times during the course, and definitely won't ruin your chances of getting a good grade here.  Prof Goldfeld writes a copious amount of notes on the board--literally every word he says--which is great when you're falling asleep during some of the less stimulating portions of the lecture.  The material is different though and will take some getting used to; just make sure to read the text, and understand the homeworks.  Aside from the disproportionate number of grad students taking the course, it's not that bad.\nWorkload:\nWeekly homework assignments.1 midterm, 1 final.\n"
        },
        {
            "course_name": "Number Theory and Cryptography",
            "review_date": "December 24, 2006",
            "review_content": "\nProfessor Goldfeld is a mild but engaging professor.  This class was always the fastest hour and fifteen minute class of my Tuesday or Thursday.  His classes are usually all about proving theorems that are either very important or just very interesting to him.  He tries to involve the class as much as possible and seems to really care that you understand what's going on.  Some of the homework problems will make you rip your hair out because you can't see the proof, but most of them aren't bad at all.  Exams are difficult but fair.  Our midterm happened to be a particularly tough one but he saw that a lot of people struggled with it and in turn tried to give the final more of a spread of material.  He's a brilliant guy and he makes his class really interesting by showing you the applications of a field that many people wouldn't consider very real-world applicable.  Good class, and one of the easier advanced classes in the math department.\nWorkload:\nWeekly problem sets (5 problems each) that will take you a half hour if you're really smart, or a couple of hours if you're like me and you need a while to crack the proofs; one midterm and a standard final\n"
        },
        {
            "course_name": "Combinatorial Number Theory",
            "review_date": "May 12, 2006",
            "review_content": "\nThis is the most relaxing math class that I have ever had at Columbia.  You feel that you really can just be yourself and not suppressed by tons of definitions, lemmas and theorems that are shooting out from a fire hose.   Because the stuff is so effortlessly taught and learnt.  \nWe only had three homework sets.   As a result, we have more motivation and more interest for the material and therefore more memory retained :)\nThe professor speaks in a very calm pace, which is extremely non-intimidating.  You have plenty of time to absorb the meanings of the definitions before the statements of the theorems.  \nOther attractions:  There is a class dinner (which I unfortunately had to miss) that I heard was great; a genuine friendly feeling among classmates rather than competitiveness; a 15 minute presentation in lieu of midterm (there is nothing better than this :) and even better than all the above (pardon my inconsistency on what is the best) is the danger of being inspired!!!\nIn this class, you will feel that math is not combing through tangled hair in a rush, which might make you look neat but how tedious and painful that is, nor is it a race to satisfy some weekly deadlines, and especially not a practice for law school.  Instead, you will have fun.  \nWorkload:\nmild, but potentially heavy if you are inspired\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "April 13, 2005",
            "review_content": "\nHe's a pretty standard math teacher, though not so engaging with the lectures. The tests given are slightly on the difficult side, though entirely doable if you know the stuff. The biggest thing I had a problem with is webworks, though its really such a small part of your final grade.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "April 13, 2005",
            "review_content": "\nHe's a pretty standard math teacher, though not so engaging with the lectures. The tests given are slightly on the difficult side, though entirely doable if you know the stuff. The biggest thing I had a problem with is webworks, though its really such a small part of your final grade.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 27, 2004",
            "review_content": "\nWhat can I say?  I chose him because he was the only prof available that spoke English.  I ended up not going to class, so it didn't matter anyway.  As far as math professors go, he was an alright guy, and if you need to go to class to learn the materia, he explains things pretty well. .  The second midterm and especially the final are hard to study for; they're insane \"trick\" questions.  You don't have to get them all, though, to get an A; he curves to a B on the tests, no matter how bad the students do.  Why oh why do Calc II professors have to give Webworks?  I hate them so.  In fact, one time I spent hours trying to figure out a single problem, only to find out later that the problem was messed up!\nWorkload:\nInfernal Webworks (10%); weekly problem sets (2-6 problems)(10%); 2 in-class midterms (20% each); in-class final (40%)\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 25, 2004",
            "review_content": "\nGoldfeld speaks fluent English and I hear that that is a rarity in the Math department.  I have no idea how to rate Goldfeld compared to other math teachers, but just be prepared to come to class, take notes, and then come back to your room and teach yourself the material.  The examples done in class are way easier than those on the homework.  However, if you do all of the assigned work, you should be very prepared for the test.  The tests are harder, but, then again, everything is curved. Goldfeld is a nice guy though and very willing to meet up and help you.  \nIf you're going to take Calc II (it's hard!), take it with Goldfeld. The class is doable if you make it a priority.\nWorkload:\n10% Homework (two problems for every section), Practice Problems (do not need to be turned in, but do them to understand the material!),10% Webworks (harder, but not too bad).\n20 % Midterm 1: Integral Stuff\n20% Midterm 2: Series Stuff\n40% Final: Integrals, Series, Taylor Series, Exponential Growth. \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 16, 2004",
            "review_content": "\nFunny, entertaining (the infamous laugh), nice, approachable, willing to help, clear lectures, good curve on midterms (just be sure to study the book, not webworks), speaks English perfectly, highly recommended! \nWorkload:\na lot of webworks in the beginning of the semester, decent amount of bookwork (the last two problems in every section), midterm with about 5-6 questions\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "May 16, 2004",
            "review_content": "\nDorian has a...different sense of humor. You laugh because he says some pretty funny stuff, but also sometimes just because of the face he makes. He gives a LOT of notes, which are very helpful. You can understand him perfectly, which is a rare case in the math department here. His exams are challenging yet very straightforward. Study a lot and you'll get an A.\nWorkload:\nWeekly homework (both written and Webwork, each 10%), 2 midterms (each 20%), final (40%)\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "May 13, 2004",
            "review_content": "\nFunny little man who is a decent teacher.  Sometimes he likes to go into tangents, and doesnt always explain things that well, but overall...a good teacher.  I mean, at least his English is understandable.\nWorkload:\nWeekly hw, weekly webworks, three midterms and a final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 20, 2003",
            "review_content": "\nNot bad at all.  His lectures are clear and straightforward, though his examples in class are much much easier than those you see on the midterms and final exams.  Also, he sometimes goes pretty slowly, so you don't cover the homework material during class, effectively forcing you to teach yourself.  The workload's not too bad, homework each week, 2 midterms, 1 final.  However, the webworks sometimes takes forever depending on the week.  For the most part, a pretty good teacher.  Plus, he can speak English, which is saying something.\nWorkload:\nHomework each week (written and webwork), 2 midterms, 1 final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 17, 2003",
            "review_content": "\nOverall, a pretty good professor. He explains the material well and fairly methodically, sometimes too methodically perhaps but he made sure we understood. Some complaints\n1. His examples in class are nothing like the exams or the HW in terms of level of difficulty - they're deceivingly easy\n2. Sometimes, because he went so slowly, he would make us do HW problems over topics we hadn't covered.\nHowever, on the upside, he's quirky and nerdy, always nervously snickering at something unfunny, so he's always amusing if nothing else. Seriously though, I think he's a pretty good choice in the Math Department. \nWorkload:\nMidterms might be harder than other sections but not too bad. HW and WW are standard.\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "October 24, 2003",
            "review_content": "\nI might as well weigh in on the positive side. I liked Dr. Goldfeld a lot. I don't really care that he was not the most charismatic math teacher I've ever had. I don't care that he did not inspire me to become a math major--You can't expect that from every professor. What distinguishes Dr. Goldfeld is that he is clear and to the point, as many other reviewers have pointed out.  I don't even care that he f***ed up some of the computations (he NEVER used a calculator), or didn't always complete them after there was absolutely no mystery left about what you had to do to finish the problem. For example, he would sometimes just set up the definite integral and leave it at that, saying, \"I will not finish this computation because it is elementary.\" It WAS elementary. Anyone who had done the previous semester of calc could do the integral. It would just be a waste of time to keep going on with it. So I actually appreciated that he would move on to more substantial stuff. I would agree with other reviewers that his tests were neither too easy nor too diffiicult, but fair overall. In any case, he would curve to a B+ median grade. The homework was definitely substantial, and could take anywhere from 5 to 10 hours per week, but I got used to it. It was a necessary evil. Without doing a lot of problems, there's no way to really get a handle on mutli-variable and vector calculus. I also want to add that I totally agree with what the other reviewer said about going to the lectures when he gets to Complex Analysis because the textbook was totally useless. Solid prof.\nWorkload:\nthe other reviews sum it up pretty well. medium to large homework assignments. 3 Midterms 1 of which is dropped, and a final.\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "September 04, 2003",
            "review_content": "\nA very straightfoward teacher.  He explained the material in very simple terms, illustrating concepts clearly with numerous examples.  So clearly, that it sometimes seemed as if he was teaching to freshmen in highschool.  In some ways this might not be the best thing for grades as the class managed to do very well on his midterms (A range was 40/50 on 2 of the mditerms and 45/50 on one).  He also allowed the entire class to use calculators on the final and on the midterms.  Professor Goldfeld  is a good choice for IIIS/IVA. \nWorkload:\n3 midterms lowest one dropped.  Weekly homework that is graded and a final.   His grading system consisted of adding the scores of the two highest midterms and making this represent 50 percent of your grade.  Final was 40%. Homework was 10%.  He curved the final total out of 100%, despite giving grade ranges for each midterm.\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "September 03, 2003",
            "review_content": "\nProf. Goldfeld is an awful professor. When doing problems on the board, he did all the computation in his head so it was virtually impossible to follow. He mocked people who asked \"stupid\" questions, when they were often concepts he had failed to explain. If I asked him a question after class, he yelled to speak to the TAs or go to the math help room. Not once was he willing to help me himself.\nDon't expect a syllabus online.  You'll have to rely on a random and inaccurate syllabus from a different prof.  \"His\" practice exams were nearly impossible to find and were not at all similar to his exams.  All in all, his lack of care for students and teaching made for a semester of absolute misery.\nWorkload:\nhomework once a week- average length problem sets. 3 midterms, lowest one is dropped.\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "September 03, 2003",
            "review_content": "\nI cannot BELIEVE that anyone would write a negative review of this sweet, quiet man.  Professor Goldfeld may not be brimming with energy and hype, but he knows his mathematics and comes across as an affable, albeit absent-minded, grandfatherly type.  Okay, so he could use an extra dose of coffee in the mornings.  Don't crucify him for it!\nAnd, yes - he IS a cutie.  In an unconventional way.  His voice - his scratchy New York accent - is the logical compelement of his face.  He has very sweet eyes; appearances don't deceive in this case.\nWorkload:\nTypical calculus class.  Not too bad, but you have to put in the time and effort.\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "May 20, 2003",
            "review_content": "\nHe is definately a good professor.  He teaches in a very straightforward way, and gives a lot of (easy) examples in class which make the material seem easy.  You can learn everything by just reading the book and not going to class, but the material will seem easier if you goto lectures.  I definately suggest going to class when you learn complex numbers because the online \"book\" is corny, dumb, and doesn't explain stuff well.  Tests are pretty straightforward and there's very few surprizes.  He drops the lowest of the 3 tests.  I would definately recommend choosing him for math.\nWorkload:\nfinal, 3 straightforward (but not too easy) tests, and he drops the lowest test.  Homework takes a while and he actually grades it.\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "May 18, 2003",
            "review_content": "\nDorian Goldfeld is completely uninspirational. If you love math and want to get excited about it, Dorian is not for you. However, for the rest of us, he gets the job done. His explanations are as simple as he could make them. He goes over the necessary problem solving techniques and, for the most part, leaves it at that. He probably prooves roughly half or maybe a little more of the theorems that are the content of the course. If you want to get through Calculus relatively painlessly, I think he's a good choice: the tests are fair and the lectures don't leave you feeling lost. Sitting through the lectures can be painful, though, because Dorian Goldfeld doesn't seem to care at all. He will make extremely simple mistakes in his lecture, but they are so obvious most in the class notice and quickly correct him. Another downside to his style is that he doesn't put in the effort to finish many computations. Finally, although I can't describe exactly why, Dorian Goldfeld is a cutie.\nWorkload:\nWeekly homework (10ish challenging problems of which a couple are randomly selected for grading), 3 fair Midterms (one dropped), and a representative final.\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "May 13, 2003",
            "review_content": "\nI picked this class thinking to myself, \"Anyone named Dorian must be wonderful.\"  My logic proved ridiculous.  He gives long and challenging homeworks which end up being only 10% of your grade and a whole lot of effort.  His lectures are incoherent because he makes a ton of errors which he covers up by saying, \"Well, this should be equal to that previous thing.\"   A friend of mine went to his office hours once and he said, \"I thought the door was locked.\" It's your office hour!  His tests aren't impossible but the class content is difficult, you'd be better off with a good teacher.    \nWorkload:\nWeekly homeworks assignments which are pretty hard.  Three (3) midterms - lowest grade is dropped; final.\n"
        },
        {
            "course_name": "Number Theory and Cryptography",
            "review_date": "December 31, 1999",
            "review_content": "\nYes, he is one of the authors of that awful textbook some of us used for Calculus 2S and 3S. In person, though, it's a whole other story. He is definitely one of the better professors in the math department. He has a way of making hard proofs easy to understand. He also does a lot of examples which helps further understanding. There are 3 midterms (lowest grade is dropped) that count for 60% and a final which counts for 40%. Homework is assigned and graded but it only counts if your grade is borderline. The tests are not that hard, but he grades them carefully and does not give any partial credit for bs proofs. The final is also not that difficult. The only downside is that he sometimes doesn't prepare lectures and messes up in class which leads to long pauses. But the class had a lot more upsides than downsides and it is definitely recommended. \nWorkload:\nA homework a week and they become quite difficult towards the end. The tests are easy. \n"
        }
    ]
}