{
    "prof_info": [
        {
            "prof_name": "Chloe Bulinski",
            "prof_id": 7496,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Cell Biology",
            "review_date": "January 08, 2014",
            "review_content": "\nDr. Bulinski, in many ways, is the quintessential absentminded professor. \nAvoid this course:\n-If you want a class that's highly structured\n-If your background in molecular/cellular biology is weak. Although she is very approachable and helpful one-on-one, Dr. Bulinski is not going to spoonfeed and babysit you\nLet me state the obvious: Organization isn't Dr. Bulinski's forte. \n-Expect opaque grading. The class is supposedly curved to a B-/C+, but Dr. Bulinski never made it clear how she grades. (She once emailed us to say that she wants \"everyone\" to get at least a B, which makes no sense in light of her curve.)\n-In a class of 30-40 people (with 3 TAs), exams take >2 weeks to get graded and come back in multiple pieces. The staples in your exams get taken apart, but they don't get put back together.\n-Practice exams are riddled with typos. Dr. Bulinski once said that she made it \"intentionally\" vague to promote critical thinking.\n-Don't expect to get your graded article writeups back.\nDespite its disorganization, Bulinski's Cell Biology is a class well worth taking. In fact, this may have been one of my favorite biology classes at Columbia, particularly because the subject matter is so incredibly integral to a career in medicine. Cell biology offers a very intricate glimpse at the molecular mechanisms underlying cell motility, transport, and growth (and how disease processes-most namely, cancer-can cause the cell's structures and functions to go haywire). In addition, Dr. Bulinski generally does an good job linking basic cell biology principles to cutting-edge clinical and basic science research in the field. In short, this is a very good class for premeds.\nYes, Dr. Bulinski can be hard to follow during lecture, and a lot of people despise her teaching style (she refuses to post PowerPoint slides until after class). But overall I found her to be a very engaging and articulate professor who welcomes questions in class, and there consequently was a lot of teacher-student interaction in our section (particularly since we had a small class). Especially when you compare her to other professors in the biology department (cough, Heicklen, D-Mow), I found Dr. Bulinski to be one of the most approachable, passionate, and engaging instructors that I've had at Columbia. \nWorkload:\n4 exams (some parts of which you may not get back). 3 article writeups (a short paragraph for undergraduates, which you will probably not get back). I'm not sure how the curve works, but I scored in the low-mid eighties on most of my tests and got an A overall.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "January 08, 2014",
            "review_content": "\nThere's some truth in the previous comments about the lecture content, I wouldn't say they were completely fair either. Prof. Bulinski is actually a very patient, nice, and funny instructor. I think if you're too sensitive she can come off as brusque because she doesn't go out of her way to baby students. She teaches as if she were still lecturing at a public school, which is to say she doesn't go out of her way to make students feel fluffy by inflating grades. But if you actually take time to learn the stuff she's trying to teach you her course is actually very rewarding and pretty interesting.\nYes, you need to show up to every class, because she covers lots of stuff in class that's not in the textbooks. Also, if you don't show up to class, the slides that shes posts will most likely look like gobbledygoop to you.\nNo, you cannot zone out in class because the slides include only about half of the information she is teaching.  Bring a tape recorder.\nYes, you should probably do the readings. But there is a new textbook since the old reviews and the readings are no longer entire chapters.\nAll in all, this class isn't awful. There was a previous review about Prof. Bulinski being mean and condescending. I have no idea what that was about. She's actually one of the nicest, most available professors I've met at Columbia. Her TAs are also super pleasant and responsive over email.\nFinally, contrary to what was noted in previous reviews, grades in Prof. Bulinski's class are indeed put on a curve and assigned letter grades. She curves the mean grade to a B-\nThat's not a typo; there is a minus sign there. But I mean, were you really planning on getting into medical school by being average?\nWorkload:\n3 Midterms & 1 Final weighted equally, one of which you can drop.\nOne-page-long short papers done in class after research paper discussion led TAs. (three papers are discussed over the semester)\nLong paper which counts as a fourth midterm if you are taking the course as a grad student.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "January 07, 2014",
            "review_content": "\nI took Professor Bulinski's Cell Bio class last semester and it was by far the worst class I have taken at Columbia (including all Core and Biology department classes). As a senior I had no choice but to take this class and I would not wish it onto anyone.  \nAs mentioned in previous reviews, Bulinski's lectures are fragmented and difficult to follow as she refers to dozens of experiments as well as molecular biology and bio-chemistry assuming students already have prior in-depth knowledge of the material. After the second midterm I wised up and brought in my own recording device to every class, but after listening and re-listening to every lecture I still couldn't piece apart relevant information for the tests. Dr. Millers lectures were soooo much more put together and engaging.\nOne of the biggest problems of the course is that there isn't any way to practice the information that Bulinsky gives you. No homework, and even typos and missing questions in the practice exams. All but one of the TAs were completely useless in teaching, and it took forever to get the entire test and grade returned (3 weeks after taking the midterm, the same was true for the final). Some graders would give partial credit for correct answers that are not specific while some would give no credit. I got about the mean for every midterm and ended up with a solid B. I'm just glad to be done with the class\n\nWorkload:\n4 midterms ( noncumulative but extremely long and wordy, choose 8/10 problems to answer) lowest one dropped, + 3 x 1 paragraph future experiments on scientific articles discussed in class\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "January 07, 2014",
            "review_content": "\n1) The grading for the class is frustratingly unclear and hand-wavy. The most detailed thing that she said about grading was \"I've never gotten any complaints about final grades.\" The mean midterm grades were somewhere between a 67-73, with low grades extremely low (less than a 50) and high grades not very high (89-ish).  Prof. Bulinski said that the mean would be around a C+/B-, which scared just about everyone in the class.  That being said, I got a few points above the mean for every test (about 3 points), and I got a much MUCH higher grade that a B-. Therefore, I'm not sure what is going on in the grading, but it's definitely good. There's no way I'm complaining about my grade - I'm ecstatic! (especially since I thought that I'd be getting a B-).  Moral of the story: don't worry about your grade, because Prof. Bulinski is not as harsh of a grader as she portrays herself! \n2) Absolutely go to office hours, especially if you are unclear about something!  Prof. Bulinski is much better at clarifying material in a one-on-one setting. (tip: make sure that you record every lecture and then listen to them while studying for the non-cumulative midterms! Prof. Bulinski teaches concepts quickly during lecture, so it is easy to miss important details. Also, don't skip any lectures if you can help it... listening to lectures without know which slide Prof. Bulinski is talking about can be very confusing)\nTake-away message: Prof. Bulinski will scare you with her grading scale, but in the end, she takes really good care  of you (and your grade).  She is a really nice, approachable, and knowledgeable professor who is very patient when explaining confusing concepts.  I learned a ton about microtubules and microfilaments in cell cycle/adhesion. Take the class! It is stressful at times, but the lectures are filled with bad/funny puns and memorable analogies (i.e. the processive horse), making the class pretty good for a upper biology class.\nWorkload:\nI took this as an undergrad, so: 4 midterms, lowest 1 dropped, plus participation and 3 reading responses on \"future experimentation\" that was basically 10/10. No recitation, no homework. \n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "November 14, 2011",
            "review_content": "\nSo I realize this is the day before the registration deadline and it might be too late for some. But AVOID THIS CLASS AT ALL COSTS. Professor Bulinski was originally responsible for teaching only part of the course and Prof. Miller for the other. Now Prof. Bulinski is teaching the whole semester which has just been an ongoing nightmare. Her lectures consist of over 50 slides that contain images from the book and random sentence fragments that may or may not have something to do with what she is talking about. She doesn't post the lectures online before class which makes taking notes impossible because she motors through the material without giving you a chance to write even half of the information down. During lecture, she randomly refers to experiments that she explains on the board. In combination, this material that she mentioned in passing during class and the information on the board are included on the exams (4 before the final) and God forbid you zoned out for a brief second or had to miss class for an emergency, you have no way of getting this information - other than getting another student's notes - and are therefore screwed for the exam. Another fun part of the exam is that the questions are contingent on you getting the very first part right. If you are unable to decipher her cryptic \"clues\" and don't get it right, you get the entire page wrong. Great. \nWorkload:\nFour exams + Final. She claims there is no curve. Discussion of relevant articles before (almost) every exam with a short paragraph handed in at the end of class (easy 3/3). No discussion section, no homework.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "January 09, 2010",
            "review_content": "\nI was very frustrated with this class this semester, mostly due to Dr. Bulinski's poor teaching style. In addition to not specifying page numbers (seriously, \"parts of chapter 16\" is not a real reading assignment), she was an incredibly disorganized lecturer. Her slides containing experiments were not labeled (apparently, she hates labeling graphs), and her explanations were very spotty. Often, she would remember something she had forgot to mention and skip back several slides to make a point. Her disorganization made the lectures hard to follow. At one point, she suggested that while studying for a midterm, we should try to figure out why a certain slide is in the presentation. To be quite honest, I often couldn't figure out her organizational logic, even though I understood the information presented. I never followed her \"three slide rule\" (i.e., you have to know something if it shows up on at least three slides). The good thing was that she did post the slides after the lectures. The bad? Unless you took meticulous notes (and it was hard to do when she's such a disorganized lecturer), it was still difficult to understand many of the slides.\nDr. Miller was a much, much better lecturer. All her slides were labeled and the lectures easy to follow. They mostly came straight out of the book (another bonus: she assigns specific page numbers!), so even if you missed something during her mileaminutelecturing, you could easily look it up in the book. \nHowever, Dr. Miller's portion of the class was more problem-based. She assigned homework problems that were straight out of the problem book, and her exams were more of the same. In this regard, I'd say Miller is \"harder.\" Bulinski's exams depended more on memorization. She asked a lot of true/false/explain and compare/contrast questions. In addition, she liked asking open-ended questions about possible experiments to verify some finding or another, and as long as you put something reasonable, you got partial credit. (I'd say her actual exams are close to her practice exams.) On the other hand, Miller asked a lot of very involved questions that were more in Mowshowitz's style. They required actual application. \nWorkload:\nI was in the same class as the 1/3/10 reviewer, but I took the class as an undergrad, so the workload was a little different. The major difference was that the three \"discussion\" papers for undergrads were one-paragraph assignments on possible future experiments, and they were only worth 10% of the final grade. Also, we could drop any one of the four exams, including the non-cumulative final (which was essentially a fourth midterm). On exams, we got a choice of which questions to answer (usually 8/10). \nFinally, expect the reading to be heavy, since most chapters are 70+ pages. Only Dr. Miller assigns practice problems for homework. \n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "January 03, 2010",
            "review_content": "\nBefore I delve in, two notes on the class:\n-It is ridiculous to even attempt teaching Cell Biology in just one semester, so when I say that the material was flown through in class, it is not meant to reflect poorly on the professors - it is necessary in order to cover the syllabus in half the time needed.\n-Yes, I said professors. The first half of the course is taught by Professor Bulinski (Jeanette Chloe Bulinski; not sure why there are two listings for her, so I tagged both), and the second half is taught by Professor Miller. (On the occasion of Professor Milled having a child the time I took the class, the split was 2/3-1/3, so where the syllabus divides in a typical experience may differ.) There are differences in their styles, which will be detailed shortly.\nAs said earlier, Professor Bulinski teaches the earlier part of the course, which in my case consisted of the cytoskeleton, the cell cycle, and the development of cancer. I always felt that being stuck with teaching the cytoskeleton for an extended period of time means that you drew the short end of the stick, and the lectures on it strengthened my belief. In any case, Professor Bulinski teaches in the dual Powerpoint-Blackboard method; each slide has a diagram, or some experiment results, or a few bullet points while she explains it in rapid detail, and from time to time she will pick up the chalk and sketch out an important and relevant experiment on the blackboard. The slides will get posted on Courseworks, but those alone will be useless - you need to listen to lecture to make any sense of it; besides, if it's on the blackboard, it's not gonna be on Courseworks, and it's almost guaranteed to be on the exam. During the lecture, she speaks very quickly and sometimes it is hard to make out what she is saying, which does not help when what she says is far more important than what is on the screen (especially when her laptop was guaranteed to crash at least once per lecture). She usually drops in a few jokes each lecture, but often they are corny, and even when they weren't, they were wasted on a class full of humorless pre-meds; I think she got a bit peeved that barely anyone laughed by the end of her section of the course. Speaking of peeves, one of mine was her textbook readings: she would only list the chapters (100 page long mammoths) to read for each lecture rather than the relevant sections, saying that we were adults and could figure out the 15-20 pages that were relevant; for the record, we couldn't. Towards the end, she didn't bother even telling us what to look at in the textbooks. I never went to her office hours, which may have been to my detriment; I suspect she would have been a lot clearer when she wasn't on a 85 minute timer (her classes typically ran over by 10 minutes to squeeze in everything).\nProfessor Miller ended up teaching the organelle systems of the cell and the stuff that comes with it, such as vesicle transport. She uses both Powerpoint and Blackboard as well, though she tends to only include more diagram and fewer text slides. She also speaks very quickly in order to try and get through the material in time, but for some reason or another, I make out what she was saying more clearly. For some reason, it felt that the lectures were going a little more slowly and in depth; it felt like we were getting a bit more of the big picture and could tie one slide to the one five down the road in the Powerpoint rather than being crammed with a new cell cycle cyclin every thirty seconds. Either that or the fact that I could make out more of what she was saying or that her subjects were just easier, but in either case, I understood more from her part of the course than I did from Professor Bulinski's. It also helped that she would list the relevant pages in the textbook at the end of each lecture to read for the next class. Strangely enough, it was not unusual for her to end before her 75 minutes were up.\nThree times over the course of the semester, there will be a paper discussion. The TA will email you a paper a few days before, you come in having read it, and part of the class the TA gives a Powerpoint explaining the paper and part of the class you write down further experiments you would conduct. Sometimes the Powerpoint takes up the entire class, so start thinking - and writing - while it is still going. The sum of the three paper discussion grades counts as a non-droppable exam, and there is always a question on the paper on the exam that follows it.\nAs has been noted in other reviews, the exams are tough, as they tend to be experiment-based. Often, the format is that the experiment is explained and the results are given; you would match the results with the experimental conditions; explain those results; explain what would happen if one of the conditions changed; set up an experiment to test something further. They are big on setting up your own experiment to test something further. Typically you are allowed to skip at least one question, so at least you get to pick your poison. The format is the same regardless of the professor, they give you an hour forty to take the exam, and you need it. However, you will probably not take it, as you have a class right after it and those extra 25 minutes are during it. This was especially frustrating during the final: the registrar had given us 9:00-12:00 and the exam was going to be only two hours. Now, the logical thing to have done was to make it 10:00-12:00, but instead it was 10:30-12:30. Another professor showed up to set up for the next exam in the room while we were taking the test. Also, people had finals back-to-back and had to leave early. I have no idea why they did it that way. Also, maybe it was just the schedule this year, but the exam cutoffs for material were absurd; we would always end up doing the first lecture on the next unit right before the exam...and it would be on the exam. It was like they forgot to sync the syllabus with the exams.\nNow that I have blathered on too long, here is the skinny: you are going to need to show up to class. Every one of them. They will speak very fast since there is too much material to teach in one semester, but try to take down as many notes as possible (I am one of those people who take maybe a line and a half for other courses, and even I had to take down a full page of cramped writing at a minimum). If they put it up on the chalkboard, copy it down word-for-word, diagram-for-diagram because it will be on the exam. If you fall behind you will not be able to catch up - I was sick for the last quarter of the semester, and I missed half the lectures in that span, and when I took the exam for it, I did not know the answer to a single question. In summary, it was not a bad class - some parts of it were genuinely interesting, especially in the second half - but I wish they had the time to actually explain what the frack was going on and tie it together rather than bulldoze through the material.\nWorkload:\n4 exams including the final, all covering a quarter of the course; lowest of the non-final exams is dropped. 3 paper discussions to be submitted at the end of the discussion class; sum of the grades counts as a non-droppable exam. Showing up and paying attention to the lectures is necessary if you want to pass. Textbook reading assignments are vague in the first half, useful but not vital in the second half.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "December 20, 2008",
            "review_content": "\nThere are 2 instructors for this class:\nProf. Chloe Bulinski:\n- funny professor, engaging, but not very clear or organized. Material is interesting, but poorly structured, so you might want to make sure to organize the information from class and from the book more clearly.\n- talks mostly about cytoskeleton and cell division/cancer\nProf. Elizabeth Miller\n- also funny; engaging, clear and organized, but not too much detail.\nBoth professors go through the material quite fast, so make sure to keep up with the pace of the class or you'll fall behind quickly.\nAlso, both professors write exams with an emphasis on critical thinking, not on memorization or reproducing the textbook. Questions are something like: \"Here is this experiment, and its results. Explain what the results mean, and what that would suggest about how stuff works in that particular part of the cell.\" This basically requires you to be able to judge the results and infer information from them, and then explain what that means, based on what you already know about how different molecules work and the information you learned in class or from the textbook.\nFinally, there's no mandatory attendance, but obviously it helps to go to class, because it makes learning the material much easier and faster.\nWorkload:\n4 exams, equally weighted, non-cumulative, one gets dropped (including final). 3 paper discussions, with small paragraph assignment.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "December 27, 2007",
            "review_content": "\nI was shocked to read the negative reviews of Dr. Bulinski.  Although tough, I think she may be one of the best professors at Columbia.  This can be a very difficult class, and I can see how students angry with their grades might take it out on the professor.  I took Cell Biology a few semesters ago.  This course is taught by two professors, each teaching one half of the semester.  I found Dr. Bulinski to be not only a good lecturer, but the kind of professor that can keep you awake while studying microtubules early in the morning.  She was also extremely helpful in office hours.  I met with her at least a few times, where she answered my questions and was very patient when I did not understand a certain topic.  You have to read the book and use it as a guide to understand the lecture slides.  The reading is dense and time consuming and if you wait until the last minute, your test score will reflect this.  I think the grading is very fair.  Overall, I would absolutely recommend this class.  It is not easy, but do not be afraid to consult the professors after class in office hours.  By the way--you need to know your chemistry and have a strong background in biology, if not, you will most likely struggle in this class.          \nWorkload:\n4 exams, drop the lowest score.  Lots of reading in the textbook--it may not seem like much at first, but once you get reading, you will see that it is.  \n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "July 03, 2007",
            "review_content": "\nB-O-R-I-N-G.\nInsufferably so.\nShe's nice and all, but life is way too short to waste morning after morning sitting through class after class as she methodically reads through powerpoint after powerpoint about enzyme after enzyme after enzyme after enzyme after enzyme after enzyme. \nAfter enzyme.\n\nWorkload:\nAnd her tests are hard, so if you want a good grade you're going to have to go through all those boring slides (crammed with way too much information to be clear, by the way) over and over again on your own. \n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "January 06, 2007",
            "review_content": "\nThe worst professor i have ever come by in my 4 years at CU. \nChloe thinks that she is lecturing at the med school and so expects a high level of understanding. She brings up slides that not only are NOT from the book, but are actually from her own experiments on cytoskeletal filaments, which means they are not labelled. if you can't write down what she says in the speed of light, you can't study the slides for an exam. \nshe EXPECTS everyone to know what each experimental technique entails (and considering that most of us were first-semester juniors with a background consisting of two semesters of the intro bio sequence, how on earth could we know how all these work??). \nexams are IMPOSSIBLE. they are badly written, and ask extremely theoretical questions based on experimentation (for instance, she gives you tables with filaments and different agents you could add to them -from fluorescent antibodies to polymerization bloking proteins. and right when you say AHA! i read this in the book! i can asnwer it. NO, she will add weird circumstances under which these experiments happen and you will end up getting 0 points out of 10 for each question.)\noverall she can't be reached during office hours, and even if you are lucky enough to get to her, she will be condescending and mean. \nTHANK GOD for liz miller. she is fantastic and a great relief to what seems to be a terrible class. chloe's part is in itself boring (Extracellular matrix and cytoskeleton) but she made a great effort to make it even worse. liz's part is interesting and she is such a great lecturer and person overall, that if you do take this class, you will at least be happy with the second part. liz uses figures from the book and really spends time to explain each slide.\ni studied like crazy for this class and got a C+ in both of chloe's tests and when liz came, the same studying got me an A- in both exams! shows something...\nWorkload:\n4 midterms (2 for chloe and 2 for liz--last one is the final, non cummulative) 2 TA meetings where you discuss experimental papers. heavy reading, but the book is well written and self-explanatory. expect to read approx. 100 pages per lecture. it's not so much a matter of memorizing, ather than understanding. \n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "May 08, 2006",
            "review_content": "\nNow that Liz Miller teaches the first half of the course, tables have turned. No longer is Dr. Bulinski's the enjoyable part of the course; rather, it has been an annoyance and a disappointment. \nMaybe she was once a good teacher (as the older reviews suggest), but that is certainly a thing of the past. Her lectures were difficult if not impossible to follow, and her tests are not challenging--they're just poorly written. It's hard to understand what she's talking asking, and she took 5 points off my friend's test when he labeled a drawing in the margin instead of directly on it, saying that he might be intending to \"label nothing.\" Her exams are full of typos (\"antibody\" instead of \"protein,\" etc.). \nShe makes terrible jokes and gives stupid analogies (like a horse with a feed sack attached to its face is like a processive motor protein???). She spends more time explaining the names of the experiments she cites in lecture than explaining the experiments themselves. \nAlmost everything I learned I got from the textbook rather than from her lectures. \nShe won't give students access to the powerpoints before lecture, which means that you can't take notes directly on the slides. It also means that her lecture is even harder than normal to follow when the projector doesn't work. \nShe changed the time of the final exam from 9 to 10:30 and didn't actually e-mail the class: she just posted it on Courseworks, so about half the class showed up at 9, not realizing the time had been changed. When she did show up, she didn't even have enough copies of the exam for everyone, so she had to print more. \nShe seems like a nice person, and I want to like her, but I just can't. \n\nWorkload:\n2 of the classes' 4 total exams are hers; each of the 4 counts equally and 1 of those may be dropped. More time required with the textbook than with the first half of the course. 3 papers for graduate students only. \n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "September 01, 2005",
            "review_content": "\nMinden's half and hers were like night and day.  She was a good lecturer and cared about students.  She was not up to speed with the courseworks undergrad vs. graduate student system, and her graduate students were left to get the notes via other means besides courseworks (undergraduate sources).  It took her a week or sometimes two to post her power point lectures after she gave them.  Her tests were difficult but the questions were designed well.  The exam and practice exams were very useful to enrich learning process.\nHomework, reading, and lecture correspondence details were often overlooked which was frustrating.\nWorkload:\n4 exams, 2 Minden's, 2 Bulinski's --drop one.  Reading was extensive, 20-40 pages of dense text.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "May 15, 2005",
            "review_content": "\nShe is a med school professor who missed undergrads.  Her teaching is completely opposite of Prof Minden's, and it's almost like taking two different classes when Prof Bulinski took over.  She is constantly putting things into the bigger picture by applying real life examples and analogies that make class almost exciting to go to.  She is engaging and fun. Although, her tests are harder than Minden's, she curved them up to be equivalent to Minden's means on her tests which was really sweet.  \nWorkload:\n4 exams, drop one..two are hers, two are Minden's\n"
        }
    ]
}