{
    "prof_info": [
        {
            "prof_name": "Roger Anderson",
            "prof_id": 1789,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Planet Earth ",
            "review_date": "June 24, 2008",
            "review_content": "\nPlanet Earth with Roger Anderson is a wonderful class for non-science majors. It's all about the big ideas, not nitty gritty calculations. Prof. Anderson is obviously passionate and incredibly knowledgeable in his field. He lectures one day per week, and on the other day you do group activities. \nI highly recommend this class and Prof. Anderson in general. \nWorkload:\nLight. Readings every week that are quizzed on in class (the quizzes are brief, and generously graded), midterm, final, term paper. no homework. \n"
        },
        {
            "course_name": "Planet Earth ",
            "review_date": "April 17, 2007",
            "review_content": "\nFirst of all, ignore the previous reviews about this class. I was hesitant in the beginning to take it because of those reviews and they both turned out to be false.\nAs of now, this course is very well-structured. There are 2 textbooks, one of which was written by professor Anderson (free to download from CourseWorks) and another one is Blue Planet by Skinner. Every week starts with a 2 question 10 minute quiz on the readings - one question from the current week's reading and another one on the previous week's reading (sounds bad, but it actually makes you keep up with the readings + the questions are not really tricky). Then there is a lecture, which is rather interesting and informative. Anderson does his best at explaining stuff that science-challenged people like myself have a hard time understanding. Jot down everything he says, even when it sounds obvious and stupid. Most of what he said in class showed up on the exams. (Consider one of the questions on the midterm: \"How do you make life in a lab?\") The second class of the week is a group activity class: students get divided into groups of 3-4 and do something cool like breaking Mars chocolate bars to see how planet tectonics and mountains can produce oil :-)\nThe midterm & final are lecture-heavy and you are only responsible for the stuff that we discuss in class. The Skinner book gets rather technical, but you do not have to know all the facts from it, my advice is to study Anderson's book.\nAnderson's sense of humor is weird, but for some reason likable. \nThe TA for this class was Abby Spieler and she was awesome - very helpful inside and outside the class and just a great person.\nOverall, great class for those who want to satisfy the science requirement and have some fun. \nWorkload:\nWeekly quizes on readings; 4-page research proposal due by the end of the semester; in-class midterm; in-class final and a \"field\" trip to the Museum of Natural History \n"
        },
        {
            "course_name": "Intro to earth science",
            "review_date": "December 24, 2003",
            "review_content": "\nThe  first review is entirely correct.   I also never knew what  to study.  You try to take notes in class but he says nothing important.  The final and midterm are very diffcult,  you must use all the information which you have learned in class plus your own analysis.  Although I would go into the midterm knowing nothing about what he wanted i came  out with a very high grade.  My best advice when it comes to his section of a test...bullshit you whoel way throug...you will find yourself entirely suprised to get full credit fro an answer that you did not know.  An addditional note is tat anderson teaches this calsss with another senior professor named mutter who is extremly systemic.  Also in some ways it si not nessary for you to coem to class but in other ways it is.  One's grade is evaluated entirely on the  midter and final.  Attendance is never taken.  The pluses of this class is that you are being taught bya  senior professor.  the negatives is taht it is very easy to not want to attend classes and fall behind i the reading.\n"
        },
        {
            "course_name": "Intro to Environmental Science",
            "review_date": "November 18, 2003",
            "review_content": "\nCompletely confusing. i always left the class as clueless as when I first came in and although he would joke about this fact.  I found it annoying because I did not know what or how to study.  At times he can be interesting and in a sarcastic way funny but it was really hard to study for the exams based on what he taught in class and there really is no text book that is imperative for you to read.\nWorkload:\nmidterm, final, possibly 2 quizzes. all inshort answer form but still fairly challenging and not easy.\n"
        }
    ]
}