{
    "prof_info": [
        {
            "prof_name": "Joanna Scutts",
            "prof_id": 2623,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 13, 2011",
            "review_content": "\nI had Joanna for LitHum both semesters, and while I agree with many of the other reviews that she is extremely nice, I disagree with many of the past reviews about her ability to lead a class. Her discussions were extremely dull, and often never required anyone to do the reading. She never told students when they were wrong, and often led discussions in a manner in which she would talk for 15 minutes, and then let students ramble on for 30 minutes unchecked. This would then repeat throughout the entire dull hour and 15 minutes.\nShe is undoubtedly nice, and undoubtedly works very hard to help us to understand the material, but the class is very dull, and I felt that I missed out on the amazing LitHum experience that many speak of. Her analyses and commentary on many of the texts was very generic, and things were never really brought full circle, in my mind at least. \nOn a separate note, with grading, Joanna's class was extremely unorganized, and we as students, often never knew what we were getting. She grades unfairly, subjectively, and gives little explanation for her grades. You can go to discuss things with her, and even persuade her that the points she made on your paper were somewhat moot, but she is offensively stubborn, and almost condescending to the point of arrogance. Her grading system is largely unfair, as it rounds everything to whole number points, and she is very inflexible with any change of grade.\nIf you are looking for an enjoyable and enlightening LitHum Experience, I do not recommend taking Ms. Scutt's class. If you are looking for a class in which you can fairly easily obtain a B+ or A- while being bored out of your mind, look no further. \nWorkload:\ntwo 7-page papers each semester, midterm, final. Midterm and Final are generic lithum tests (ID's, passage analyses, essays)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 16, 2011",
            "review_content": "\nOkay look, she's very nice and intelligent but her class was like pulling teeth. It might have just been my section, but it was really difficult to get through those 2 hours.  She's also a harsh grader and scales everything out of the percent of your total grade it's worth.  For example, our discussion essays are 5% of our grade and therefore graded out of 5 points. You either get a 5/5 100% (rare), 4/5 80% (attainable), or a 3/5 60% (likely).  \nI don't really see why she has a nugget, yes her understanding of the material is thorough but her ability to excite discussion was pitiful and awkward. \nWorkload:\nSecond Semester:\n2 presentations with 3pg response essays, 2 med/long essays, midterm and final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 19, 2011",
            "review_content": "\nI took Lit Hum with Joanna for the whole year, and I'm very thankful that I did. She's a bit of an awkward discussion leader, but she's brilliant. She knows so much about the literature, is a highly observant reader that draws attention to details that can easily be skimmed over, and she wants her students to succeed. She helped change how I think in a way that I thought the Core couldn't. I actually am a more critical reader, writer, and thinker because of her. Class can seem a bit dry at times - she's not the most animated teacher. However, I wouldn't have traded this experience. I know that my next three years at Columbia will be shaped by what she taught me.\nWorkload:\nFirst Semester - Three 3-page response papers (5% each), Two discussion leading sessions (5% each), Midterm (15%), Final comparative paper (3 texts) 8-10 pages (25%), Final Exam (35%)\nSecond Semester - Two 3-page response papers (5% each), Two discussion leading sessions (5% each), Midterm (15%), Two 5-7 page comparative papers (2 texts) (15% each), Final Exam (35%)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2011",
            "review_content": "\nHere's the Deal:\nShe is a nice teacher and always has time available to answer questions. However, lecture is very dry and boring. It isn't ever surprising to see at least one person falling asleep in class. She does not encourage participation at all, and answers your question with another question (most of the time). However, if you take out time to go to her office hours you will get an idea in what she wants to see in your writing. She always has time to see her students which is a plus. Overall recommended, but warning : she is a harsh grader. \nWorkload:\n3 response papers (2-3 pages), 1 long paper (8-10 pages), 1 midterm and a final. Midterm was challenging and she is an overall harsh grader. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 06, 2006",
            "review_content": "\nI liked Joanna a lot. She was respectful, friendly, funny, and serious at the same time. Her comments on papers were very helpful, and she also understood that the design of the University Writing course was terrible, and therefore sympathized with us, if only inadvertently. She was a very fair grader and definitely tried to make the course a little easier on us. Her workshopping methods allowed the students in the class to interact with each other and also with her. She was also very accesisble.\nIf you got placed into Joanna's section, consider yourself lucky.\n\nWorkload:\nStandard uWriting course load, minus one draft for each paper (other sections must complete two roughs, whereas Joanna only requires one).\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 03, 2006",
            "review_content": "\nJoanna was friendly and helpful. She wrote detailed comments on your paper or met with you in person for each essay. She only had her students do one draft of each essay where others require two. Not a bad professor at all especially when compared to those of friends, and she even brought us cookies the last day of class. We workshopped essays in class instead of at home. She had a pretty formulaic system of workshopping\nWorkload:\nFour essays of length between 1200 and 3000 words, and three short exercises for each essay. There is one small close reading and one group presentation, and of course, there are outside readings.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 24, 2005",
            "review_content": "\nUniversity Writing could not have been better without Joanna. She is a grad student at the English and Literature Dept and is an extremely  helpful, and serious teacher. Don't be scared off by her cold outside - she is indeed very understanding and acceptive to new ideas. I am an ESL student and she was very patient in helping me wiht drafts and language problems. If you have her in your university writing class, you should be glad for she is always well prepared and nice to you if you are treating this class seriously.\nWorkload:\nMore or less the same as other u writing classes. 3 short essays and 1 collaborative research paper. Readings are really helpful as references in the essays.\n"
        }
    ]
}