{
    "prof_info": [
        {
            "prof_name": "Gray Tuttle",
            "prof_id": 3151,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to East Asian Civilization: Tibet",
            "review_date": "May 14, 2016",
            "review_content": "\nProf. Tuttle is so nice and approachable, not snobbish at all despite his impressive credentials and track record.  The class isn't terribly easy, but it's doable if you do the work and if you take advantage of office hours. His lectures are a little hard to follow at times, and the readings are dense, so you'll definitely want some time to devote to this class. That said, he is a very generous grader.  \nWorkload:\nLots of reading, weekly discussion posts, midterm paper, map quiz, object bio multi-media project, final project or exam (you have the choice). \n"
        },
        {
            "course_name": "20th Century Tibetan History",
            "review_date": "December 23, 2009",
            "review_content": "\nProfessor Tuttle is the absolute best professor I have had at Columbia.  He is very laid-back and approachable, which is remarkable, especially at a university like Columbia.  He genuinely seeks to instill a greater understanding of Tibet in a historical and modern context, and does so without imposing his own bias.  About 75% of our class was of Asian descent, the vast majority being Chinese students and national minorities.  Given this class composition, the course and the discussion could have taken several bad turns at times, but Professor Tuttle de-politicized it which was key.  He encourages students to criticize his book and addresses the critiques, helping to build our understanding.  A leader in his field and a great guy, couldn't ask for a better professor. \nWorkload:\nWeekly extended postings, one time leading discussion, and a midterm and final paper (two parts) based on Tibetan biographies/autobiographies\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Tibet",
            "review_date": "January 16, 2007",
            "review_content": "\nHe's very nice, very fair about grading. His lectures are kind of confusing, but at test-time he gives you a list of terms/\nessays to outline in advance; you realize you've learned a lot more than you thought. Professor Tuttle is completely unpretentious and definitely extremely knowledgable in his field; at the same time, he's really eager to learn what others think about Tibet and about their travels there. He ends every lecture (often early) with time for the class to respond and ask questions. He is flexible; when the class was pretty confused about the paper assignment, he devoted extra time to outlining what he expected and extended the deadline a full week!\nWorkload:\ntwo essays based on primary sources (intimidating with the tough reading but nicely graded), midterm, final, weekly posting with discussion section (just do this, it will really boost your grade). You should probably go to lecture every once in a while, but everyday attendance is not necessary if you keep up w/ reading.\n"
        }
    ]
}