{
    "prof_info": [
        {
            "prof_name": "Jeffrey Sachs",
            "prof_id": 2735,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Challenges of Sustainable Development",
            "review_date": "May 06, 2014",
            "review_content": "\nUnfortunately, Sachs is more like a guest speaker who comes in once a week, and does not seem to even be aware of what is happening the rest of the time. He lectures on topics that are nowhere near his field of expertise (such as biodiversity), simply repeating, but much more inaccurately, what experts in the field are teaching in Science for Sustainable Development. \nSachs is completely ineffective as an undergraduate professor, allowing the TAs to suffer with economic theory which they find nearly impossible to teach in the time available. The problem sets had errors that confused the TAs and which made some questions impossible to resolve.  Worst of all, the midterm was simply canceled because Sachs could not care to modify his two-year-old exam, and students complained that others had 'cheated' off last year's midterm.\nIn summary, this class was certainly the worst I have taken so far, as it is terribly structured, extremely stressful, and in all ways disappointing, as everyone looked forward to studying with Jeffrey Sachs.\n\nWorkload:\n4 Problem sets (40%); Midterm (actually 2, because one got canceled) (25%); Final (35%).\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "April 18, 2014",
            "review_content": "\nI didn't like Challenges of Sus Dev. Jeffrey Sachs only lectures on Mondays. Wednesday classes are taught by a TA that will literally put you to sleep (no seriously, it's early in the morning and people fall asleep). Sachs' lectures are basically him droning on about his personal opinions. We basically talk about the same stuff we always do in sustainable development, and it's really all very repetitive. \nThe midterm was a total fiasco. Average was 62!! Finally for some reason it got cancelled and have to write a paper instead. I highly encourage doing the problem sets in group, because they are ridiculous and you will tear your hair out if you are trying to do it on your own and you're not an Econ major. \n\nWorkload:\n4 problem sets, one midterm or paper, one final. Grading feels like it's random\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "April 05, 2014",
            "review_content": "\nThis course is not what they tell you it is. On Mondays Prof. Sachs, will probably arrive late and start giving his lecture from a powerpoint. Then on Wednesdays, the main TA, will read another presentation, on a completely different topic and mostly Econ material. \nIt's like taking two courses for 3 credits. They say there are no prerequisites, but that is a lie, if you have no Econ background there is no way you can do the problem sets by yourself. All the problem sets are completely Econ based, making you do excel spreadsheets and interpret graphs. \nWorkload:\n4 problem sets. \n1 midterm\n1 final \n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "May 17, 2011",
            "review_content": "\nGreat professor. Clearly brilliant, and a pretty engaging lecturer. I have mixed feelings about the class though. I thought that it would've been much more useful to have Econ as a prerequisite, because we wasted a lot of time going over the theory behind his ideas instead of his ideas themselves. Moreover, for someone who hasn't or isn't concurrently taking Econ, McCord and Sachs aren't as practiced explaining the basics, making graphs seem a lot more complicated than they would be if you got the same information in Principles. It's a great class and Common Wealth and Sachs are great tools, and Sustainable Development is an increasingly interesting subject, so take the class, just know that it's not as perfect as a class with Professor Sachs could be. \nWorkload:\n3 fairly difficult problem sets, and midterm and final that are almost entirely based on lectures\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "May 18, 2010",
            "review_content": "\nWell, I wouldn't dissuade anyone who's interested from taking this class, but I do have mixed feelings.  This is, of course, a survey course, covering economic development as well as environmental issues, and considering the huge range of material available, I think the course does a decent job.  Be prepared to be introduced to some really interesting economic models (very straightforward) but Sachs will never acknowledge the discrepancies between the models and the real world.\nAbout half the lectures are indeed given by Jeffrey (who's incredibly performative and persuasive) and the other half are given by his mini-me, Gordon McCord.  Gordon should receive credit as a professor for this class, but of course in Sach's shadow he never does.  Gordon tried admirably to engage students by asking questions, but unfortunately his serious demeanor meant he only ever shot students down.  \nDon't worry, this isn't a math-intensive class, but I WOULD recommend some economic background.  I took this class concurrently with Principles of Economics, without which I think I would have struggled a bit.\nWorkload:\nOn a week-to-week basis, essentially zero.  I never did the readings, because honestly there are just too many and you're not expected to recall that material.  If you attend lectures, you get the gist.  Three problem sets (very doable, if you've gone to lecture or looked at seminar slides) a midterm, and a final.  These tests are reasonable, about half written essays and half modeling.  Also some IDs that are hit or miss, but the whole class seems to be graded on a reasonable curve.\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "June 12, 2008",
            "review_content": "\nProfessor Sachs gives good lectures, but this is still the worst class I've ever taken at Columbia. His lectures don't make up for the fact that his TAs are awful (mine never even came to class), the readings are irrelevant (he goves over all the important things in there anyway), the problem sets are poorly worded (so the TAs send out four follow-up emails trying to clarify them), and the exams and mind-numbing (the miterm literally required us to memorize and recite a list of numbers). The mean grade on the midterm was a 65%, and they still said they wouldn't curve them (though I suspect at the end, they did). Unless you want to spend four months learning about fish and malaria, skip this class. Instead, just go to one of the dozen guest lectures Sachs gives on campus -- they boil this entire class down to 1.5 hours, which is really all the time it deserves anyway.\nWorkload:\nYou don't actually have to do the readings. 3 problem sets, an inane midterm, and a final.\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "April 14, 2008",
            "review_content": "\nON THE PROFESSOR:\nProf. Sachs is an academic celebrity. He is both eloquent and profound in his talks. \nON THE LECTURES:\nThe range of topics is very wide--including issues like poverty in Africa, fisheries management, and other things of that nature. \nA few of the lectures include a lot of economics and math.\nON THE OTHER PEOPLE:\nThe class has what I assume are ~140 students. I believe there is a wide range of types of students here--both age-wise and experience-wise.\nON THE MIDTERM:\nI took the midterm and thought it was pretty good--not perfect at all, but good. Unfortunately, I got something in the low 60s and the average was a whopping 62.7 out of 100. \nOTHER\n-The powerpoints are posted online. \n-Professor Sachs did not always teach the class. One time I believe he missed a class because he was in Sudan. But overall his attendance is very very good.\n-There is a section with a TA\n\nWorkload:\n-Absurdist amounts of reading. A typical thing was a 350 page or so reading for the next class. This discouraged me from even opening the books, as I knew I wouldn't get anywhere if that was the goal. \n-The first problem set was very hard for me.\nI've still got to do the second one. I believe there are 3 overall.\nThere is a little simulation game which they'll probably use more heavily in future classes. Kind of like SimCity for an African Village. \nSo I guess it's TOO MUCH READING + PROBLEM SETS + SIMVILLAGE + MIDTERM + FINAL.  \n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "January 16, 2007",
            "review_content": "\nThis class was hands-down one of the most fascinating I have taken at Columbia. Professor Sachs is one of the most organized, engaging (at 8:45 a.m. too), passionate professors I have had.  He uses slides for every lecture that truly supplement and illustrate the material he is discussing.  He covers every conceivable topic in sustainable development, and it is obvious that he genuinely wants students to understand and appreciate the extent of the problems of poverty.\nHe has a great lecture style, and even in a class of 200 + students at 9 a.m., was willing to ask questions to the class and joke with us instead of simply lecturing AT us.\nThis class was so informative, and the T.A.s did a great job of keeping everyone up to pace with some of the trickier concepts.\nThere really isn't anything I can think of that I found problematic with the course.\nYou end the semester with a whole set of tools to conquer so many of the problems of developing countries.\nWorkload:\n3 problem sets, a midterm and a final. Lot's of reading, but if you love the topic then it is all fascinating.\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "May 07, 2006",
            "review_content": "\nDr. Jeffrey Sachs was a pretty good professor. He wrote the Book on ending poverty, and the charm of his 8:30AM class was well-compensated for by his smooth slides and practiced presentations, taken directly from his myriad speeches around the world on the topic. And the slides were quite repetitive. (Though the Professor never once managed to finish all the slides he prepared for each class)The Professor took a whole semester to cover what could have been covered in three or four weeks. Nevertheless, it was a very enjoyable experience, and a solid first run-through - he called our class his \"maiden voyage\" - I learned a lot. If anything, this class helped me figure out what other classes to take (and not take) if I want to pursue humanitarian work in development. The class sprawled all over the field of SusDev, lightly touching on multiple  disciplines: demonstrating the Solow Model of Macroeconomics, the Hadley Cells of Climate Systems, the Millenium Development Goals of the UN, a dozen two-to-three-letter codes for all the Earth's climate zones, spreadsheets, country case studies, a couple of slides for each environmental hazard, some essays to write at home and on the final, a few words on governance and corruption (or rather geography), a few words on economic incentives, and before you knew it the class was over. I definitely came out of the class feeling like I didn't learn very much about anything in depth. But seeing as it's an introductory-level class, it definitely serves its purpose of attracting students to the field: Sustainable Development IS Sexy, and it's Sachs who made it so.\nWorkload:\nPretty light: only three somewhat tedious excel-based problem sets, each a ridiculous 10% of your grade; an easy final exam with IDs and very general essay questions (40%); and a \"policy brief\" final paper (30%) for which all the sources are provided by the TAs. The TAs had the heaviest workload of anyone. My TA, Lily Parshall, was inspiring.\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "April 03, 2006",
            "review_content": "\nThis course is really interesting, but don't expect to get some quality face time in with Professor Sachs anytime during the semester.  Like the previous reviewer said, Jeffrey Sachs really doesn't have time to be teaching a class, classes were frequently cancelled and he was still often late at 8:45 am.  However, Sachs is a great lecturer, if he comes, and the TAs were pretty cool and helpful.  If you did the reading, it was really interesting, but it wasn't necessary for the course.  The course should be a little bit more structured next year, maybe the midterm won't be cancelled.  But a general problem seemed to be that the TA's ran the show and Sachs really only dealt with the lecture, he definitely didn't hold office hours or grade any exams, so essentially how the course was structured was left up to three grad students who had never taught a course.   Despite these issues, the course is great for people interested in sustainable development and covers a broad number of topics from water scarcity to malaria.  The course is broken up into a development part which basically covers why poor regions of the world are poor and how Sachs plans to fix that problem and a sustainable part which deals with the environmental problems the world is facing.   Overall, a course I recommend and even if you're not a morning person, Sachs is entertaining enough to keep you up as long as you can make it to class.  \nWorkload:\nfinal (reasonable) and final paper (long but research sources given to you) and three problem sets (Excel oriented) and lots of reading you don't really have to do\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "January 17, 2006",
            "review_content": "\nSachs is a wonderful lecturer, and this course draws top-of-the-line SIPA TA's, but the syllabus is excessively basic due to Sachs' desire that the class be all-inclusive.  The information on development is great, and the environmental science is helpful, if a bit basic.  The economics is attempted without Calculus, and is therefore tedious and useless.  At times, the course definitely seems to obscure the fact that Sachs is giving only his opinion, and one that is certainly not shared by a majority of the field on many issues--his positions on agriculture and fossil fuels are particularly questionable, though he leave no room for debate on these points in class.  Since Sachs is a powerful economist in UN circles, he draws on experience in international politics to flavour his lectures.  The class is wonderfully informative and interesting, but should not be considered a definitive resource on the issues of development and environmental sustainability.\nWorkload:\nVery light throughout the semester.  No one actually does all of the readings.  At the very end, the workload switches to heavy as Sachs assigns both a final paper and a final exam.\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "January 04, 2006",
            "review_content": "\nThis is a survey class taught by one of Columbia's superstar profs, Jeff Sachs.  The class definately covered \"the challenges of sustainable development.\"  Part I of the course is titled \"Intro to Economic Development\" and we covered basics an econ major might know. As for me, a non-econ major, I found the information useful and was glad to finally understand the statistics later covered in class.  Part II is titled \"Economic Geography.\"  This part covers ecology, climate change, and economic/development trends related to geography. Part III is titled \"Sustainable Development.\" We talked about population trends, over-harvesting, air/water pollution, energy depletion, etc.  \nSince he is a frequent lecturer outside the classroom, his lectures in the classroom were clear and readily-understandable.  Sachs uses a lot of statistics and pictures to illustrate his points.  \nConsidering this is the first class Sachs has taught to undergrads, I am sure that next year's class will be better structured.  In addition to restructuring the class, it would also be better if the class were titled \"Intro to the challenges....\" since it is an INTRO class. \nWorkload:\n3 Problem Sets, 1 Final Paper, 1 Final Exam.  \nThe problem sets and exam require studying; the final paper was very open and didn't require much research. \n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "January 02, 2006",
            "review_content": "\nI wouldn't be so quick as to write off taking this class as the previous reviewer.  Granted, there are a lot of problems with the course, but I think that it was more than worthwhile in the end.\nThe biggest issue is that Dr. Sachs clearly does not have time to be teaching a class--he's a busy guy, and this is reflected in the 8:45am start time (and he was still always late).  The strange thing is, I rarely found myself falling asleep, even though I'm definitely not a morning person.  Dr. Sachs has a way of getting you to pay attention, even if you're running on empty.  And because all the lectures are posted, you can really just sit back and listen.\nThe course itself was far from organized, but I think this is largely due to the fact that it is something that has never been undertaken before.  Without a textbook, there is nothing to frame the course, and I think that Sachs realized that we were kind of drifting aimlessly at the end of October and tried to draw us back on track.  \nThe reading list for the class is absurd--thousands upon thousands of pages--and made worse by the fact that the books were never discussed in either lecture or section.  It was ultimately completely unnecessary to read them at all--even Sachs' own book seemed superfluous.  This is my biggest complaint, as it would have been nice to have some short, focused reading to frame the lectures instead of being told \"Read Guns, Germs and Steel by next Wednesday.\"  Oh, ok.\nBut because the reading isn't necessary, the workload isn't bad.  How could it be in a class where 70% of your grade is determined within one week in December?  The problem sets were for the most part fair, even if the policy brief paper was terribly explained and really made very little sense.  Fair final, even if you have to write until your hands bleed.\nUltimately, I would recommend this class, especially for people legitimately interested in the topic who may not have had a chance to take a lot of economics.  To spend a full month on economics models at the beginning seems a bit unnecessary, but the meat of the course is truly fascinating, even if there is too much of it to cover in one semester.  And the TAs were awesome (even though it is a cruel punishment for every recitation to be at 8:45am on Friday).  Hopefully, Dr. Sachs will take a step back and plan the course differently for next year, but the fact remains that taking a course with this man is an opportunity that you can't get anywhere else, and one that should not be passed up.  I'll wear my sustainable development t-shirt with pride.\nWorkload:\nPsets are Excel-based and frustrating beyond words, but will ruin a total of three nights for you, so not so bad.  If you can write a decent paper or essay, you'll be fine.  And unless things change, don't bother buying any book but his own.\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "December 21, 2005",
            "review_content": "\nThis is the most disappointing class I've ever taken.\nThat's a pretty heavy statement to make right off the bat, so I guess I'd better qualify it. I had a lot of hope for this class. Dr. Sachs is everyone's favorite rockstar professor on campus, the man who promised to end poverty in 25 years, who could bring the UN into the 21st century, who, despite screwing up in Russia, seemed contrite and eager to work with people ranging from Angelina \"are those lips sustainable?\" Jolie to farmers in Malawi. Plus, I was getting up at 8:45 AM on Monday and Wednesday for the lectures with a discussion section on Friday at the same time.\nI wanted to like this class. I stuck it out even when I felt disappointed by the first few lectures (and found out that I had not missed anything by sleeping through one). I slogged through the inane problem sets. I believed Jeffrey Sachs when he told us over and over again about all these problems such as hunger, climate change, abuse of resources, and energy shortages.\nSo what's the problem? Honestly, while I think Dr. Sachs is probably a good guy out to really help the world, he's a terrible professor and lecturer. If this is the front that he presents to the United Nations, I have little doubt that his Millenium Development Goals will fail as miserably as his dye job.\nLet's start with the structure of the lectures themselves. They started out well enough, sure. He laid out what he viewed to be the major issues. He said how he was going to go about explaining them. But as he got into the meat of the course (each of the specific \"Challenges\" of Sustainable Development), he would inevitably run out of time long before his PowerPoint slides were even halfway done. Sometimes he would click halfheartedly through them, past graphs displaying statistics he did not discuss and pictures of starving children, before saying \"and we'll pick up there next time,\" or, more depressingly, \"and next time we'll discuss the possible solutions to these problems.\" Why's that a depressing ending? Because more often than not, we didn't discuss the possible solutions. We touched only briefly on his Millenium Villages in Africa, funded by private philanthropists and the government of Japan (not, peculiarly, the United Nations, although nobody called him on it), but certainly paused to make snarky comments about George W. Bush. He made it very clear that he thought the Iraq War was about oil exclusively, that George W. Bush would not return his calls, and that George W. Bush was in general a horrible human being. Look, I don't much like the man, either, Dr. Sachs, but have you seen the demographics at this university? You're preaching to the choir, here.\nUnfortunately, \"preaching to the choir\" seemed to be the name of the game for this course. Dr. Sachs harped constantly (and, yes, at times very eloquently) on the problems that plague our modern world but left precious little time to talk about how he would specifically implement solutions to the problem. It's all well and good to say you'll bring the infection rate of malaria down from 30 cases per person infected to less than one through mosquito nets and repellant, but how, exactly, will you accomplish this feat? Bill Gates is more forthcoming than Dr. Sachs on this matter, and he is not teaching a credit-bearing course. We know about the problems in this world, Dr. Sachs. That's why we're taking your course. We know about climate change, and about pandemic diseases, and about the scarcity of oil. Like you, most of us read the paper, or at least, unlike most world leaders, have a rudimentary grasp of the issues. You don't have to talk down to us. We want to know how to solve these problems, or at least what your best guess is on how to do it. Instead, you sauntered lazily through generalities, graphs, and pictures of dying Africans before bidding us farewell.\nThe TAs for this course tried to help matters. They gave sections tailor-made to solving the problem sets. They talked about specific issues. Sometimes they even went so far as to actually propose solutions to problems. We, the students, responded by walking all over them. They were not the famous Jeffrey Sachs, and many treated them like crap as a result. It was startling, at times downright offensive, to see about a quarter of the people there get up and leave in the middle of the section once they were convinced that the review of the grade-bearing elements were over. Kudos to them for enduring it stoically. I only wish they'd stood up to us, and to Dr. Sachs, and actually provided us with some hard answers, but it was clear that they regarded his lectures and the overall makeup of the course with as much disdain as the rest of us.\nI have no doubt that Jeffrey Sachs wants to solve the world's problems. But in this course of vagueries, concepts that anyone who reads the paper on a semi-regularly basis already understands, and maddening ineptitude, I came to not only disrespect the man but also the policies and worldview he came to represent. Congratulations, Dr. Sachs, you've turned me off to the tangled web of bureaucracy that is the United Nations, an institute I've been taught to believe in for all my life. You've convinced me only that your plans, while noble-minded, are doomed, and you've proved that despite your cute little cult of personality (yes, some star-struck freshmen did turn up to the final in \"Jeffrey Sachs Is My Homeboy\" t-shirts), you're not deserving of the title of \"professor\" if you can't actually \"profess\" anything worthwhile to your students. \nI'll close by paraphrasing your final words to us on a cold Monday in winter. \"I hope you all find a solution to these problems, because they will have a significant impact on your lives and the lives of your children.\" What a send-off. What a class. \nDo yourself a favor. Avoid this course like the pandemic plague the professor will only vaguely mention to you.\nWorkload:\nThree problem sets (moderately difficult, but the TA sections explain everything) worth 10% each for a total of 30%; a 12-page final paper designed as a \"policy brief\" (poorly explained) worth 30%; and a long, dry final exam (3 \"essay questions\" of varying lengths, a moderately difficult but low-point ID section, and two questions dealing with \"growth models\" that almost approach math before shying away) worth 40% for a total of 100% a waste of your time.\n"
        },
        {
            "course_name": "The Challenge of Sustainable Development",
            "review_date": "December 18, 2005",
            "review_content": "\nA thorough survey of the numerous issues that influence the public and private challenges facing developing countries. Prof. Sachs has a very polished style from his numerous years on the front-lines of policy debate and presentations. This is the first year that he has taught the class and the syllabus as well as the focus of the class drifted from time to time. All told one could not want more from a    pilot episode that will surely become a staple elective of frosh and out-going seniors alike.  \nWorkload:\n3 problem sets (Excel-oriented). 1 12-page policy proposal. 1 final. \n"
        }
    ]
}