{
    "prof_info": [
        {
            "prof_name": "Yechiam Yemini",
            "prof_id": 51,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Computer Networks",
            "review_date": "April 21, 2011",
            "review_content": "\nNice guy, ABSOLUTELY THE WORST PROFESSOR I'VE HAD AT COLUMBIA.\nLectures are extremely dry. He talks in a slow mumble that is impossible to hear. Youmust constantly ask him to speak up where he usually replies \"I'll try but I have a soft voice.\"\nExams are ok if you can manage to get something out of his lectures.\nOk here's the biggie, HOMEWORK ASSIGNMENTS ARE CRYPTIC\nWritten homework assignments usually contain material that he sneaks in his lectures in the last 5 minutes. His assignments are unclear and leave you dumbfounded as to what you are supposed to produce, usually a very lengthy Q/A on his website follows with frustrated students probing explanations as to what the assignment actually means.\nProgramming assignments are impossible unless you are not taking any other classes and have done extensive network programming before. Yechiam Yemini does not go so far as to talk about programming in class. EVER. Unless you've already done it you don't have a shot at the programming assignments, which are just as cryptic as the written assignments. Also be ready to drop some cash on a CLIC account if you don't have one, all assignments are submitted via virtual machines on CLIC. Deadlines are also very short, usually about 10 days for extremely high involvement work\nI really wanted to like this class, the topic is important and the class deserves a better professor. Wait for Dan Rubenstein or someone else to teach it before you take it. \nWriting this review is making me physically upset.\nOther than that, he seems like a really nice guy and I don't think he means to cause heartache. The poor sucker just can't teach (or talk loudly for that matter) and makes everything harder than it needs to be.\nWorkload:\n3-4 written assignments, 2-3 programming assignment, midterm and final. The exams are fine but the homework makes this class absolutely frustrating\nOh yea I need to clarify. He does not write is own exams (thankfully). The midterm he gave was a Rubenstein test. Yemini admitted to it and Rubenstein's name was on the test.\n"
        },
        {
            "course_name": "Computational Genomics",
            "review_date": "April 19, 2007",
            "review_content": "\nHe's one of the worst prof I've ever had.\nHis lecture is very dry and he doesn't seem\nto really care much about students.\nWorkload:\nOne research project. 2 extra credit assignment\n"
        },
        {
            "course_name": "Computer Networks",
            "review_date": "May 19, 2004",
            "review_content": "\nI liked Professor Yemini a lot, and I feel like I learned a lot in his class. He clearly has a great depth of knowledge in the field, his digressions are good, and he's very personable and approachable.\nSome things to be prepared for, though:\n* His lecturing style is very dry, delivered in a low rumble. I was really interested in the material and was able to look past this to some extent, but it was sometimes hard to keep my mind from wandering. It also meant that much of the class wasn't all that strongly engaged, which de-energized the room.\n* The lectures were fairly applicable to the exams, but weren't all that helpful for the homework assignments. This, in combination with their dryness, plus the online availibility of lecture notes, is probably what caused most of the class to stop going to lecture starting about 1/3 of the way through the semester. This de-energized the classroom further.\n* Professor Yemini tries to make the initial assignments harder and the assignments later in the semester easier; his feeling is most C.S. classes operate in the opposite manner, and it's nice to counterbalance that. This isn't a bad philosophy.\n* There's a definite effort to make the homework assignments and the exam questions non-cliched and interesting. The results of this are a bit hit-and-miss, though. In the first programming assignment, for example, it was very difficult to divine what the project was supposed to do based on the specification. Others in the class spent hours upon hours spinning their wheels until they understood; I settled for a lower grade on that assignment. The second programming assignment, an RMI MUD server (with a reasonably constrained world-state to keep track of), in contrast, was a lot more fun.\nWorkload:\n2 programming assignments, 3-4 non-programming assignments, an open-book, open-notes midterm, and a similarly open final. The midterm in particular it's best to study for as if the exam isn't open-book, though, as you won't have much time to look things up.\n"
        },
        {
            "course_name": "Computer Networks",
            "review_date": "May 01, 2003",
            "review_content": "\nHe can be a little dry, but this guy is one of the nicest professors I have come across. If you go to his office hours, he's really interested in helping you, and listens to your feedback. The workload is manageable. \n"
        },
        {
            "course_name": "Computer Networks",
            "review_date": "December 31, 1999",
            "review_content": "\nYemini has been at Columbia for a while and it shows -- boring lectures. Most people are used to his accent by the sixth week of classes, or so. It looks like he's ready to burst into full mid-life crisis any day now, so buyer beware. About the texts: they're about $300 total, but only the Stevens Unix text is essential, the others are mostly helpful for exams. Programming assignments are challenging but do-able. Programming teams are formed at random, so start scheming, or bring your rabbit's feet.\n"
        },
        {
            "course_name": "Computer Networks",
            "review_date": "December 31, 1999",
            "review_content": "\none of the most important and well tought courses in the computer science department. yemini blends a tremendous body of knowledge and experience with a visiion that is always looking at whats ahead. he's going to make you work. however, unlike the typical theoretical only courses within the c.s. department, what you learn is going to be re-usable for a good time to come. in various positions, i've had to troubleshoot tcp/ip issues and create entire fault tolerant network protocols. this course was the basis of a career\nWorkload:\nfirst project is heavy duty. project complexity wanes over time.\n"
        }
    ]
}