{
    "prof_info": [
        {
            "prof_name": "Yuan-Yuan Meng",
            "prof_id": 319,
            "total_reviews": 33
        }
    ],
    "reviews": [
        {
            "course_name": "CHNS G4015-G4016 Readings in Modern Chinese",
            "review_date": "December 13, 2012",
            "review_content": "\nIt's called \"Readings in Modern Chinese.\"  As Meng explains on the first day, that's because the purpose of the class is to instruct you in reading Chinese, and you will acquire a lot of vocabulary that you will be able to recognize when you encounter them, but--again, as Meng tells you on the first day--not necessarily be able to use in your own speaking or writing.  You will not work much on your tones or on speaking in this class, because that's not really the purpose of the class.  I had to shift my expectations of what a language class is for this one, but I'm glad I did because if you need what she's offering, you'll see the value in it.  And as a result, it can be a lot more fun than lower-level classes at Columbia.  The class is very focused on vocabulary acquisition.  So you will not be endlessly writing sentences to practice grammar patterns.  Nor will you have to sit through excruciating powerpoint presentations by your classmates. She knows what she's doing.\nWorkload:\nQuite manageable.  Daily dictation and weekly writing assignments.\n"
        },
        {
            "course_name": "CHNS G4015-G4016 Readings in Modern Chinese",
            "review_date": "November 13, 2012",
            "review_content": "\nMeng Laoshi is excellent. She is dedicated to making class as useful as it can be for her students, and since she trains other Chinese she has a good background in the pedagogy of second language acquisition. The readings she chooses are fascinating - as someone from Taiwan, she has strong opinions on the CCP, and that makes advanced classes all the more interesting. Don't be intimidated by her demeanor - she is in fact very friendly and approachable, and reasonable when it comes to homework. I appreciate all the time she puts into class preparation and she does her best to make discussions engaging. \nWorkload:\nIt's a Chinese class. Be prepared to prep for the tingxies every night, but it's nothing to lose sleep over.\n"
        },
        {
            "course_name": "Media Chinese",
            "review_date": "May 14, 2012",
            "review_content": "\nLike so many others, it seems, I'm writing this review as much in response to the other posters I've read on this page as I am for the sake of providing (hopefully) helpful recommendations for future generations. I can see why the former student/current Chinese teacher was not totally satisfied with his/her Meng experience, but at the same time I can see why others have completely committed to drinking the Kool-Aid and singing her praises. For the sake of saving you time, let me say right now that I like Meng and think she is a very good teacher. If you're willing to do the majority of the legwork (w/r/t skill building, oral drilling, and grammar review) on your own, I highly recommend taking Media Chinese. If you want/need to be in a class where the majority of the class time will be spent improving your fundamentals, you may want to find another class (though if you're taking Media there probably aren't many classes left for you). I'll provide a more detailed explanation below. You can skip the middle paragraph and go the the last one if this is too long. I just want to provide some insight into my thought process. \nThe only real problem I have with Media Chinese has more to do with the nature of Chinese language instruction at Columbia in general than with the class itself. As the current teacher points out, there isn't enough time devoted to drilling fundamentals. It is unfortunate and self-evident that our pronunciation, tones, and grammar still suck after four years of guided study. We can point fingers at the Chinese department as a whole, but I think that this would be a mistake. The reality is that, unless we're heritage speakers who've lied our ways into an N track class, we will only speak Chinese during lecture time. For the most part, we won't put in the hours of mindless drilling that are needed to develop any real facility with the language. We have our reasons; we're all busy and we're all trying our best. All the same, this lack of effort on the student's part really hinders the teacher's ability to develop any substantial language skill in her students. What does this mean? It means that, regardless of how the classes are structured, our tones, grammar, and pronunciation will continue to suck. We just don't speak enough Chinese for it to be any other way and in order to change this we need an overhaul of our own lives in addition to anything at the departmental level. It's not all bad; for the most part, our ability to comprehend the language improves over time. Unfortunately, our ability to string together grammatically correct Chinese sentences with any semblance of fluency remains undeveloped. If you want to work everything, you're going to need more than four or five hours of class time a week. The students have to sit in their room and drill themselves until they pass out. As a student, I know that's not going to happen. As such, I have to reassess my own expectations of a Chinese course. I think some Chinese teachers recognize that we're not doing independent drilling and attempt to counteract this by devoting class time to skill building. This is perfectly reasonable, if somewhat boring; in the early years, where classes can be quite large, you end up spending most of your time daydreaming. Others, like Meng, have elected to teach with the faith that her students will pick up some of the slack on their own time. Meng loads this course up with stuff to work your comprehension. You'll get better at reading and listening, but not necessarily at speaking or writing. If you read the articles over and over, like she tells you to, you will improve, but the majority of us do not. And the majority of you will not. Her syllabus either reflects naivity on her part or simply a grim acceptance of the hand she's been dealt. Either way, I can't fault her for the fact that you only meet for four hours a week. \nMeng is very thoughtful and does put a great deal of effort into teaching. She provides meticulous critiques of your weekly writing assignments, which may be the most useful part of the entire course. She will lead you to water, but she cannot make you drink. Take advantage of her motivation and ask her questions. Just don't expect the course to fix all of your problems. You're going to have to go to PIB or Taida if you want perfect Mandarin. She deserves a silver nugget at the very least. \nWorkload:\nDaily dictations, weekly writing assignments, three unit tests, one oral presentation, one oral midterm, final (oral + written)\nThis is not a tough class by any stretch of the imagination. You just have to be willing to put in the time. As Xunzi once wrote, \"Without dull and determined effort, there can be no great achievement.\"\n"
        },
        {
            "course_name": "Media Chinese",
            "review_date": "January 21, 2012",
            "review_content": "\nMeng Laoshi is hands down the best teacher I've studied with while at Columbia. She completely changed the way I think about the Chinese language, and her \"chunking\" teaching method genuinely works. She emphasizes word collocation, and breaks down the article assigned into small groups of words to be tested on the daily tingxie. At first this method of learning may seem strange or even difficult, but you soon realize how much it helps your Chinese reading comprehension and writing abilities. I have only taken Media Chinese with Meng, but the class really revolutionized how I think about China's social and political policies, China's position in the modern world, and the Chinese language. Meng tells it like it is. She never gives you meaningless busy work, and she cares about students' opinions. The class is primarily discussion-based, so make sure you have an opinion and know how to share it. My grammar also significantly improved under her direction. She's the only Chinese teacher whose course material actually matters outside of the academic setting, and I highly recommend taking her class.\nWorkload:\nDaily tingxie, weekly writing assignments pertaining to an article or movie/documentary, approximately 4 big tests spread throughout the semester, one presentation on a topic of your choice. The tests are tough, but if you thoroughly study, you should be fine. She always lets you know exactly what to study- there are never any surprises on the tests.\n"
        },
        {
            "course_name": "CHNS G4015-G4016 Readings in Modern Chinese",
            "review_date": "January 22, 2011",
            "review_content": "\nProfessor Meng is one of the most quirkiest and well organized teachers I've met in Columbia. Also, she truly cares about her students. She is concerned about their well being and makes an effort to truly get to know and empathize with each. Her readings are challenging but nothing impossible. Her clear sense of direction coupled with her meticulous word sheets provides enough guidance in and of themselves, but her clear instruction leaves room for no nonsense. Also, the readings expose you to parts of Chinese culture you would never have encountered from real authors and real political texts (instead of edited textbook material) If you take this class, you'll learn a lot. Just do your work and speak out.\nWorkload:\nFour to five tests spread out, one of which you can drop as well as regular tingxie and three to five essays, few short homework assignments.\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "July 09, 2010",
            "review_content": "\nI studied with Meng Laoshi as an undergraduate (1st year Chinese) and later as a graduate student (4th year Chinese, aka \"Readings in Modern Chinese\") at Columbia.  This was a while ago (2002 and 2007), though I feel, given the stubbornness of Meng's general character, this review will still be relevant today.  I've never been moved to write a review for CULPA, but I'm so alarmed by the reviews here of Meng (how positive they are), and I care deeply about studying Chinese, I felt compelled to write something.\nI also believe I write from a perspective of useful retrospection and relative objectivity.  Students have various intense axes to grind - or total adulation - with or for Meng Laoshi, but it's been years since I've seen or spoken to her, and I feel neither in particular.  I've also studied Chinese for many years and speak from some experience.  I've studied at the following institutions and have had countless Chinese instructors - Princeton in Beijing, Middlebury Chinese School, ICLP in Taiwan, and IUP in Beijing, in addition to Columbia - and have attained total fluency in the language.  I am now currently an assistant professor of Chinese literature and teach Chinese language courses.  Finally, I am a non-heritage speaker of Chinese who started \"at zero\" about ten years ago.\nI don't think Meng is a good Chinese language teacher and I don't think you should study Chinese with her.  When I was at Columbia, there were a number of other outstanding, superior teachers, and I suspect there are still are, and I would recommend working with one of them instead.\nMeng is an interesting, if not vain, person who has a rather large personality (and I mean this as a compliment), but while these are qualities that make for an enjoyable person to speak to (in English), they are very bad for language instruction.  Further, she is quite adept at flattering her students (engaging with them in heated discussions about X or Y topic) and making them feel smart or intellectually challenged (as the positive comments here on CULPA attest to), which are also not good for a language class. \nMy point is this: learning a language, particularly at the introductory levels offered at Columbia (and believe me, up to even Chinese 5 at Columbia is introductory level, you are nowhere near \"fluent\"), is a mechanical, cognitive process, not an intellectual endeavor.  Language class should be fun and interesting, but it should focus on skill development, not intellectual discussion.  No one on this board wants to hear this, but it's the truth: you need to spend several years mastering the basics of the language before you can even begin to have an intellectual conversation in Chinese.  Chinese 1-4, if not beyond, should prepare you for this goal, not be the end in of itself.  Go take a class at BeiDa after completing Chinese 4 at Columbia, and tell me you can even engage your Chinese classmates at even the most rudimentary intellectual or academic level.\nHere is where Meng falls short.  Class is all about her.  She speaks too much English in class and during office hours because she is fond of doing so.  Instruction should be mostly in Chinese, even when it's over the heads of the student, to acclimate she or he to the sound of constant Chinese.  She is full of interesting anecdotes about her life, which can be quite riveting, but it takes away time from the single purpose of Chinese class: speaking and hearing Chinese.  She loves to engage her students in serious, heated contemporary issues, such as the \"Taiwan wenti,\" and students might love this, but this is more for her benefit, not yours.  You should be spending your precious class time drilling on spoken patterns and improving your tones.  \nLet me not be misunderstood here: Chinese class should not be boring.  But you should have no illusions about how hard it is to learn the language for real, and the total rigor of instruction it requires to develop anywhere approaching actual fluency.  Ask your friends who study Chinese at Chicago or Princeton.  At these far better programs, in my opinion, they spend years drilling and rigorously developing basic skills.  And it pays off - these students sound great in Chinese and have real fluency.\nMeng is flattering her students by making them think they are receiving a quality, demanding Chinese language education when they are not.  You're not anywhere near as good she makes you think are or makes you think you will be.  Don't wait until you spend an extended period of time in China taking classes in Chinese to discover this.  Study with someone else, and if possible, another program in general.  Finally, let me say I totally enjoyed my classes with Meng and still find her an utterly charming, likable, engaging person.  I just didn't really learn any Chinese from her.  \nWorkload:\nFine.\n"
        },
        {
            "course_name": "CHNS G4015-G4016 Readings in Modern Chinese",
            "review_date": "September 10, 2009",
            "review_content": "\nI have had Meng for two years running now, and while I've had a lot of outstanding teachers at Columbia, she outstrips them all.  Leaving aside, for the time being, the ferocious devotion she inspires in her students (we loved her so much we asked her to help us create a new 5th year-level class, Media Chinese, so that we might not have to be parted from her), she simply works harder for you than any other professor I've encountered here.  It doesn't hurt that she can be hilarious in class, either--though she will bust your ass if you don't do the work.  She is immune to BS--you simply cannot get it by her, and if you try, she will smack you down in front of the whole class.  \nIt is worth noting, I suppose, her inclination towards non-native speakers.  She does not teach W-level Chinese, and while she does not bar native speakers, they sometimes have trouble in her class, largely because of her outspoken contempt for the PRC government.  Nor is she a big fan of the ROC either, though--she is very political, but even here, she has one extremely rare quality--she is absolutely receptive to argument.  Not even in that aggravating \"you have the right to your wrong opinion\" sort of way, that speaks in tones of contempt and disdain.  She actually listens, and trusts in the intellect of her students.  We argued with her all semester, and never once complained that she was unfair, condescending, or superior, as professors so often are.  Instead, arguments were absolutely stimulating, fascinating, and passionate.  \nBasically, if you want to learn real Chinese you study with Meng. \nWorkload:\nOne of the things that is most prodigious about her is that while the workload is heavy, it is never just busywork.  Everything she makes you do is emphatically useful and constructive.  You will not be doing rote exercises--even her rewrites of essays are useful.\nQuizzes every class, 4-5 tests, one sometimes dropped, occasional essays with handwritten rewrite, and a hefty but doable reading load.  Oral midterm and final.  The final is so miraculously designed that you will actually feel like you're learning as you do it, and you'll be done in about an hour and a half.\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "April 29, 2006",
            "review_content": "\nI'm basically just writing this review in response to whoever was ignorant enough to say Meng teaches as if she's a Communist in China or whatever it was. Yes Meng and the department does expect people to memorize, but hello! If you're trying to learn a language, don't you think it's pretty darn important to know some vocabulary? Meng is a GREAT, AWESOME, FANTASTIC professor so pay attention to the reviews that make sense. You have to work hard in her class but it's definitely manageable. She's the best and I really wish I could have taken more classes with her. \nWorkload:\nFair for a 5-credit class - you need to know your stuff but she'll help you every step of the way until you do.\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "April 05, 2006",
            "review_content": "\nIf you have no prior background in Chinese, you will take Meng laoshi's class and get your ass kicked.  This is a good thing.  This woman is dead, dead serious about the Chinese language, and her classes are a labor of love - for her, and hopefully for you too.  Like any rigorous training experience, exhaustion will yield to pleasant surprise at how much your language has improved. In fourth-year, she made the textbook herself with rich and fascinating readings that are way, way too hard for the average student; however, they are perfectly suited to her teaching style, which combines mastery of English, Chinese, and patience to make students fully understand the finer points of vocabulary despite the difficulty.  If there was ever a good way to have the linguistic shit kicked out of you - as Chinese so often feels like to those with no prior experience - this is definitely it.  Only take Meng laoshi if you really care about learning the language - if you don't, you'll be wasting both her time and yours.\nWorkload:\nquizzes, tests, little essays, all meticulously graded with ass-kicking standards of excellence\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "April 05, 2006",
            "review_content": "\nIf you have no prior background in Chinese, you will take Meng laoshi's class and get your ass kicked.  This is a good thing.  This woman is dead, dead serious about the Chinese language, and her classes are a labor of love - for her, and hopefully for you too.  Like any rigorous training experience, exhaustion will yield to pleasant surprise at how much your language has improved. In fourth-year, she made the textbook herself with rich and fascinating readings that are way, way too hard for the average student; however, they are perfectly suited to her teaching style, which combines mastery of English, Chinese, and patience to make students fully understand the finer points of vocabulary despite the difficulty.  If there was ever a good way to have the linguistic shit kicked out of you - as Chinese so often feels like to those with no prior experience - this is definitely it.  Only take Meng laoshi if you really care about learning the language - if you don't, you'll be wasting both her time and yours.\nWorkload:\nquizzes, tests, little essays, all meticulously graded with ass-kicking standards of excellence\n"
        },
        {
            "course_name": "Intermediate Chinese I (N)",
            "review_date": "December 21, 2005",
            "review_content": "\nOK, I usually cringe at students who gush on and on about professors who, in reality, are not that great because they have flaws that are not mentioned in the reviews. Having said that, I really believe that Meng laoshi is the BEST PROFESSOR I'VE HAD SO FAR. I honestly don't understand why she is not a gold nugget. She belongs on that list, with her knack for presenting material in a clear and concise way, her patience with students who ask mutiple consecutive questions, and her supremely nice personality. Her mastery with the English language, plus the fact that she has no detectable accent, makes learning so much easier. Not only that, she's also immersed in American culture, which means that you get a kick out of her anecdotes, like the time she described to the class an episode of Sex and the City. Hilarious!\nAside from being an effective and engaging professor, she is also very understanding towards students. If ever you feel like you need an extension, she will grant it to you without hesitation, as long as the request is reasonable. For instance, I couldn't make an oral presentation to the class on the day it was assigned because I was stressed about work in my other classes. She totally understood and scheduled an individual appointment for me to do the presentation. In general, she's always available outside of class and always manages to find ways to meet with students even when she's very busy. It's great to know that you have a supportive professor. \nThere's something that confuses me, though. On the first day of class, she presented herself as this really strict teacher that OVER-assigns work, when, in fact, she's very reasonable. I figure that she likes to do this every year to scare away slackers. In reality, she's tolerant of slackers, but you get more out of class and you won't have to study very hard for the final if you do the work. THIS IS A HIGHLY RECOMMENDED CLASS.\n"
        },
        {
            "course_name": "Readings for Modern Chinese (4W)",
            "review_date": "August 31, 2005",
            "review_content": "\nWhile I felt I was getting a lot out of Meng laoshi's class during the semester, it was only this past summer, while studying abroad, that I realized just how much I gained from her Readings course. I found that I recalled the vast majority of the vocab, sentence patterns, idiomatic expressions, and even folk similies (xiehouyu) that we learned, and -- more importantly -- could put them to use. This included a good sense for the nuances of terms and usage and finer shades of meaning. That is, what we learned we learned well. I came out of the course with an active command of the material, which to me is key; I want to build on what I learn, not constantly relearn it owing to never really having grasped it. The course amounted to something of a turning point in my study of Chinese, I dare say, in that by the end of the two semesters of Readings I found I could make out and appreciate the structure and logic, use of metaphor, and rhetorical styles and choices present in a variety of writings in Chinese. Very cool. Meng's detailed analysis of the essays as pieces of composition is to be credited for this. \nMuch of this has to do with the textbooks we used for the course, which I thought were terrific. A unique feature of the texts is their analysis of usage (verb collocation, etc.) and numerous sample sentences and phrasings. Few textbooks offer something like this. Credit goes to Meng on this count, as the texts are both her creation; she knows them inside out. Their only shortcoming might be the slightly limited scope of topics covered by the essays they contain. I didn't mind this, but some people might. (eg, not much related to economics, history, health)\nA possible downside of the class, depending on how you look at it, is that it gives heavy emphasis to reading skills. This shouldn't catch anyone off guard really, as the course title suggests this empahsis. But still I could feel myself and others sometimes in want of more discussion. Meng picked up on this, to her credit, and adjusted the course to a certain extent while not compromising the reading component. Class can sometimes be a little slow, but this is exactly what made possible the depth and detail that for me proved most valuable; others might be restless depending on their goals. It should be noted that Meng has high expectations and/or standards -- a good thing, if you're up for it, as she holds herself to similarly high standards. She is excellent about communicating these expectations and gives detailed study guides in advance of each test; these, and the tests, did a good deal to reinforce the materials for me, though they are a bit of work. I think this is definitely a course where what you put in is what you get out.\n\nWorkload:\nFairly heavy. Quizzes on vocab most every class. Three to four tests per semester plus final. A few papers in Chinese. Sometimes an oral report or two, plus miscellaneous exercises.\n"
        },
        {
            "course_name": "Chinese 4N",
            "review_date": "January 13, 2005",
            "review_content": "\nI was blown away by Meng Laoshi's class.  I've had 3 other Chinese professors at Columbia and none of them come close.  When I say blown away, I sorta mean like blown away, and you don't even know that you're being blown away.  The method is pretty standard--daily vocab quizes, newspaper readings, short readings from famous Chinese authors.  But it's really the little things--she's rigorous, assigning a fair amount of vocab each class, when you do essays she spends a lot of time correcting mistakes, when you learn new words she drills them with lots of phrases so you know what the word means, not just the English translation of a word.  Doesn't sound that impressive right?  It didn't really seem that way while I was taking the class either, except that whenever I reflected on how much I was learning and how quickly I was learning, I just felt like any other Chinese class was a real waste of time.\nOne other thing is Meng Laoshi keeps class pretty entertaining too.  Sometimes she starts on these rants that turn into these stories of a relative or of a past student or of Chinese/American politics.  Being that she's Taiwanese, it's understandable that she has this chip on her shoulder (she's pretty funny whenever she talks about so it's light-hearted) about Chinese propaganda and how they always talk about invading Taiwan and how they pretend Taiwan is a part of China.  Anyways, couple of students (from China obviously so they should not be in the N class) might be offended, though they have no right to be.\nWorkload:\nYou're in fourth year buddy.  Quizes every class, probably 100 words a week.  Generous in dropping the lowest couple of scores.  3 Tests during the semester and she drops the lowest.  Final.  Class is very focused on written Chinese, which is a bit disappointing, but class passes by so fast, I don't know how it'd be possible to fit more speaking in.\n"
        },
        {
            "course_name": "Readings for Modern Chinese (4W)",
            "review_date": "January 01, 2005",
            "review_content": "\nMeng Laoshi is fiercely witty.  She meticulously plans and cares for her course and her students.  She sustains the entire Chinese department.  She is an excellent teacher--I recommend studying Chinese with her at any level.  \nWorkload:\ndaily dictation quizes, regular homework, 3 tests, an oral presentation, 2 essays, and a final.  \n"
        },
        {
            "course_name": "Intermediate Chinese I (N)",
            "review_date": "December 29, 2004",
            "review_content": "\nMeng laoshi is a great professor. She may try to be intimidating at first, but she is very easy going if you are willing to work hard. Not only did we successfully learn the material, but we also had lots of fun during classes. She really cares about her students and wants them to do well. She is very understanding about students' workloads around midterms and finals, and may be more relaxed about dictations and homework. I'm not trying to give the impression that she is totally lax, but as long as you work hard, spend time doing the work,  and treat the course with respect, she will return this respect to her students. \nWorkload:\nHeavy as expected; dictations almost everyday, exams every 2 chapters, oral midterm and final, one in-class oral presentation, listening exercises, written and reading assignments, around 2 essays, a long written final\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "August 19, 2004",
            "review_content": "\nMan I don't know where this latest \"Meng is only good for kids with background\" idea is coming from...   First of all kids with Mandarin background are supposed to be taking the W track and thus won't be in her N classes at all.  Secondly, I am as white and unchinese as possible but I love Meng Laoshi and after two more years of Chinese, including a summer in Beijing, she is still the best teacher I've had.  The only people who her class would not be good for is people who don't want to put in the effort required to learn a notoriously difficult language (2-3 hrs per day, 4 days/week).  She is different from most columbia professors in that she doesn't try to make whining students feel like it is all her fault and not their fault for slacking, but she's perfectly reasonable in her expectations and i and my other non-chinese co-students had great fun with her and developed a very strong base of chinese.  \n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "August 05, 2004",
            "review_content": "\nReviews of Meng Laoshi seem to fall into the category of either 'Meng hater' or \"Meng lover' which can be confusing for someone reading these posts.  My opinion is that there are three different types of student who take this first-year language class, and depending on which one you fit in, you will definitely either love or hate Meng Laoshi.  I'll give you my spin on these types, and hopefully you can figure out if she is the right teacher for you.  Because it's important, and will totally determine your chinese learning experience.  \nThree types of people enroll in this class: (1) kids who grew up with chinese in the house, and can speak either a lot of a little, but can't read (2) kids who already know another Asian language, such as Korean, and (3) kids who are totally new to Chinese, and have no background in either (1) or (2).\nIf you belong to category 3, and I want to make this very clear, you will learn 3-4 times slower than the kids in the first two groups.  Language teachers and linguistics have shown this, and it just makes sense.  This shouldn't be a reason to get discouraged or not want to study chinese -  in fact, you'll work harder, improve faster than the other kids, and will get more excited about the language.  Also, as someone who has already completed 2nd year Chinese, I can say if you work hard and stick with it, you'll be kicking those other kids' ass by the end of 2nd year, which I am now.\nSo, what is important about first year, if you belong to group (3), is a teacher who understands the different backgrounds of students, and someone who will help you not feel frustrated or stupid, because you are OF COURSE learning slower than the kids with either family backgrounds or another Asian language background.  This is REALLY important, because especially in the first year, everything will be so new, you'll often feel like you can't do it, if all these other kids are seemingly finding it so incredibly easy.  THIS IS NORMAL and you shouldn't give up, because a year's worth of hard work will make up the difference.  Also, if you study hard, you can definitely earn an A, even with the other kids' having a great advantage.  It's no a curved grade class - just do your work and you'll be totally fine.\nAs for Meng: Meng is the embodiment of the teacher who only is interested in her students who already have some background in Chinese or another Asian language, and will make the students who don't have this feel inadequate and dumb.  In fact, this is so idiotic because one's background has no bearing on one's intelligence.  I simply cannot understand why Meng favors the students who simply already can either read characters or speak Chinese; the only explanation is that she is an easily frustrated and lazy teacher, who doesn't want to help students who actually need it.  \nExamples: in class, she will often cut off a struggling student, regardless of how hard they are trying, and ask a student who already knows how to speak chinese, to read a passage.  Invariably she will call on a student that she, for instance, SPEAKS TO IN CHINESE after class, and a student who so clearly grew up with Chinese in the house, often speaking it.  Also, once we wrote essays for a homework assignment, and Meng read a section from a particularly good one, praising its \"fluency\" and naturalness.  Now, this is fine, except for the fact that this student already is fluent in chinese, and thus, will not find it hard to write an essay that is idiomatically correct when he or she has grown up with it.  Meng made the rest of us feel inadequate because we couldn't do this - but frankly, after only 9 WEEKS of class, it would have been impossible for any of the rest of us to write a fluent essay.  Obviously.\nMeng simply doesn't register these differences.  She simply does not account for different backgrounds, which again, I feel is beyond idiotic.\nBut again, none of this should keep you from studying chinese if you fall into category (3).  Just don't do it with Meng - there are MANY other teachers who teach Chinese 1, who treat all students the same, and go out of their way to help students who are struggling with the inevitable problem of learning a new script language, if you are coming to it totally new.  You will not feel stupid or inadequate - rather you will work hard, because your teacher will show you that it's the only way to learn the langauge.  \nFinally, if you do fall into category of (1) or (2), I'd watch out also.  You might get rather complacent with your advatnage, and bask too much in Meng's glowing praise of you, which is something you have only earned through either accident of birth or accident of former study.  You may get lazy and not work hard enough.  I can say, now in Chinese 3, all of those kids are paying now, having fallen behind kids like me, who struggled first year and got flustered by Meng Laoshi, but now am doing far better than the kids who grew up with it.  Meng will make you feel smart when you haven't earned it, and may in fact keep you from working hard enough to get good at the language.  You'll pay later if you fall into this situation Meng creates.  \n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "May 16, 2004",
            "review_content": "\nMeng might be nice to those kids that are already fluent in Chinese, seeming to issue them wonderful little secret comments in Chinese, that are well beyond the scope of the class, but to everybody else--people that actually try to challenge themselves and learn something new in college--in my opinion she's rude, belittling and impatient.  This is especially true if you are struggling with the class.  She simply refuses to clarify any grammar rules or sentence structure in English, even outside of the classroom.  And she complements said refusals with wonderful pearls of wisdom such as: \"maybe should you study more,\" and \"maybe should try easier language.\"     \nWorkload:\ndaily vocab quizes, several other quizzes covering 1-3 chapters and oral and written midterm and final\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 27, 2003",
            "review_content": "\nMeng Laoshi is a really great teacher who I would highly highly highly recommend! She is aggressive with getting everyone in the class to participate, and encourages all of us to share little bits of our lives so all the students learn a lot about each other over the course of the semester.  Meng also tries to use Chinese as often as possible -- intermingled with her English sentences, telling us stories about herself -- so that it is very simple to pick up a good handful of extra vocabulary.  She repeatedly drills to make sure we grasp the material well.  Most importantly, Meng is the one who makes up the homework sheets and tests (including the final!) so it is very beneficial to have her during the term.\nWorkload:\nDaily quizzes on characters/pinyin/English translation. It is difficult, but hey, it's a five credit course, what do you expect? The tests are very easy if you know your stuff though -- I think most people get in the nineties. \n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 20, 2003",
            "review_content": "\nShe is amazing.  I took this class my first semester as a freshman and was definitely intimidated for the first couple weeks.  BUT, staying in the class was the best thing I did all semester.  She makes coming to class enjoyable... she is really in tune with her students and tries to keep thins exciting for them.  (She even admits to reading CULPA- what a smart lady!)  The class is hard, but it's the type of thing where whatever you put in is multiplied by Meng laoshi's teaching genius.\nWorkload:\nouch.  expect to spend at least an hour on characters every night (though she recommends at least 2)  listening is important, but the good thing is some kid put all of the language labs stuff online (thechanhouse.com/chinese) so you dont actually have to make the trek over to Lewisohn.  the beginning of the semester starts with pinyin sound quizzes which i completely bombed and then moves into translation... this isnt a class you can skip though, there's a quiz everyday (i think we went maybe 3 days without one the entire semester) and she crams alot of info into each class... lets face it though, it's chinese... you can't honestly expect it to be easy!\n"
        },
        {
            "course_name": "4th year Chinese",
            "review_date": "December 15, 2003",
            "review_content": "\nMeng laoshi is definitely open approachable despite what the other reviewers might say. She may seem a bit stand-offish at first but the class became really fun and the readings are by no means tradtional (which made the class even more interesting and fun).  If you're here to learn Chinese then Meng laoshi is one of the best teachers to have! Bottom line: she is awesome!\nWorkload:\nReasonable. what do you expect from a language class, no work?\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "November 18, 2003",
            "review_content": "\nok DON\"T listen to the other reviewers, Meng Laoshi is AMAZING!!!   She is somewhat prim and certainly expects a lot of work from her students, but the payoff is more than worth it- I'm in intermediate Chinese now and Meng's former students are MUCH better prepared than most of the other students in the class.  \nShe presents material very clearly and is a bottomless well of enthusiasm and support for her students...   many times I have gone to ask her a question in her office and ended up talking to her for an hour about any number of things related or unrelated to chinese.  \nI don't know what the other reviewers were thinking, maybe they meant to review a different professor...  Meng is an exciting, fun, and extremely effective way to learn Chinese.  In addtion her classes develop a real sense of community; many of us still greet eachother in chinese on college walk.  \n"
        },
        {
            "course_name": "4th year Chinese",
            "review_date": "November 02, 2003",
            "review_content": "\nThe mark of a truly great teacher is the ability to be adaptive to the learning needs of students. Meng, on the other hand, is a one-dimensional instructor who seems to mostly relies on cruelty and strong-arm tactics. Meng in my opinion firmly believes that all learning experiences should be unpleasant and miserable. My advice: Leave this class.\nWorkload:\nan insane amount of work that should be worth 10 credits\n"
        },
        {
            "course_name": "4th year Chinese",
            "review_date": "October 25, 2003",
            "review_content": "\nI have studied Chinese (with Liu Lening), Spanish, Arabic, Korean, Indonesian, Persian, Japanese, and German in the classroom and she is the best teacher I have had the pleasure of working for. She does not stroke one's ego, so in that sense she may have been the perfect teacher of the Victorian era. Unfortunately, there are a fair number of students in the classroom now with fragile \"New Age\" egos who require constant affirmation by mother figures. Meng Laoshi does not meet this expectation, which is why one can expect to find one or two wounded egos griping about being neglected in each of her classes. She is zealously committed to pedagogy and pedagogy alone; this leads her to expect the same committment from students, an expectation which is also not always met. This fierce committment to pedagogy indeed lends her a more formal persona than students are used to in 2003: she resists the easy praise and buddy-buddy approach less hard working teachers often resort to to make students like them. She wants to be followed more than she wants to be liked, an independence which inevitably provokes fury among students used to being pandered to. She does smile, but it is a smile earned by your hard work -- the only thing she respects. Does this make her \"curt\"? I suppose so. People with a chip on their shoulders about strong women or a need for a best buddy will not enjoy her class; people interested in learning Chinese (including some \"useless\" information in the words of one reviewer -- a sign of lack of creativity, in my mind -- everything is potentially useful) will suffer, learn, and enjoy. They will enjoy not because they were coddled but because they learned. Her classes are the marine corps of Chinese language at Columbia: the few, the proud, the most motivated.  In other classes, one may expect to sit around chatting pleasantly about current events, smiling, doing no drills, taking no quizzes, and remembering nothing a year later.  I cannot recall a single chengyu from the year I spent with Liu, whereas I remember a score of chengyu from her class. A \"nice guy\" who indeed is \"hip\"(I am not sure the educational value of hipness) enough to wear black (someone please remind me why lack of color is considered cool) and smile at the girls, he demands nothing and gives nothing. Meng Laoshi demands all and gives all. Because of her I can now read newspapers in Chinese. She is for the goal-oriented, not the ego-oriented. There is a number of angry harpies and rejected stalkers who over the years have sought to take her down a notch in the rumor mill for disappointing their  egos: but she refuses to bend, and this is to her credit.  \nWorkload:\nrather heavy -- but with a grad student workload i was able to do it.\n"
        },
        {
            "course_name": "4th year Chinese",
            "review_date": "October 25, 2003",
            "review_content": "\nI have studied Chinese (with Liu Lening), Spanish, Arabic, Korean, Indonesian, Persian, Japanese, and German in the classroom and she is the best teacher I have had the pleasure of working for. She does not stroke one's ego, so in that sense she may have been the perfect teacher of the Victorian era. Unfortunately, there are a fair number of students in the classroom now with fragile \"New Age\" egos who require constant affirmation by mother figures. Meng Laoshi does not meet this expectation, which is why one can expect to find one or two wounded egos griping about being neglected in each of her classes. She is zealously committed to pedagogy and pedagogy alone; this leads her to expect the same committment from students, an expectation which is also not always met. This fierce committment to pedagogy indeed lends her a more formal persona than students are used to in 2003: she resists the easy praise and buddy-buddy approach less hard working teachers often resort to to make students like them. She wants to be followed more than she wants to be liked, an independence which inevitably provokes fury among students used to being pandered to. She does smile, but it is a smile earned by your hard work -- the only thing she respects. Does this make her \"curt\"? I suppose so. People with a chip on their shoulders about strong women or a need for a best buddy will not enjoy her class; people interested in learning Chinese (including some \"useless\" information in the words of one reviewer -- a sign of lack of creativity, in my mind -- everything is potentially useful) will suffer, learn, and enjoy. They will enjoy not because they were coddled but because they learned. Her classes are the marine corps of Chinese language at Columbia: the few, the proud, the most motivated.  In other classes, one may expect to sit around chatting pleasantly about current events, smiling, doing no drills, taking no quizzes, and remembering nothing a year later.  I cannot recall a single chengyu from the year I spent with Liu, whereas I remember a score of chengyu from her class. A \"nice guy\" who indeed is \"hip\"(I am not sure the educational value of hipness) enough to wear black (someone please remind me why lack of color is considered cool) and smile at the girls, he demands nothing and gives nothing. Meng Laoshi demands all and gives all. Because of her I can now read newspapers in Chinese. She is for the goal-oriented, not the ego-oriented. There is a number of angry harpies and rejected stalkers who over the years have sought to take her down a notch in the rumor mill for disappointing their  egos: but she refuses to bend, and this is to her credit.  \nWorkload:\nrather heavy -- but with a grad student workload i was able to do it.\n"
        },
        {
            "course_name": "First-year Chinese",
            "review_date": "September 08, 2003",
            "review_content": "\nmeng laoshi is undoubtedly a good teacher in techincal terms. HOWEVER, in my opinion she tends to bring  personal frustrations into the classroom, embodied in nasty remarks on various issues, and general antipathy . when you are not liked by her, she shows it to you in more than one way.\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "August 21, 2003",
            "review_content": "\nMeng laoshi is not only the best Chinese teacher I've ever had (and I've had many), but she's also the best instructor I've had at Columbia and one of the best I've ever had anywhere.  This is my advice for beginners: If you're serious about learning the language, take here Beginning Chinese class!  She acts very tough (even mean) the first couple of weeks to scare away those who aren't serious.  However, she actually has a heart of gold.  Her classes were fun, engaging and challenging.  I'm a pretty lazy student, but with her, I learned the language despite myself.  She is one of the few faculty members at Columbia who takes a genuine interest in her students.  She is extemely supportive and encouraging and always makes time for her students.  Through her enthusiasm and confidence in me, she was single-handedly responsible for making me love the Chinese language and continue so far in my studies of it.  Don't miss out on an opportunity to study with her - I only wish I had more!\nWorkload:\nShort daily assignments.  Occassional major assignments.  \n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "May 20, 2003",
            "review_content": "\nMeng Laoshi is one of the best teachers I've ever had.  When I first entered her class in the fall, I was very intimidated by her.  She seemed very strict and intense.  However, that was just a facade.  I guess she just wanted to make sure all the students taking the class really wanted and be there and would be willing to put in the effort.  The beginning of the second semester, when new students joined our class, she told them that she was very tough.  She scared a handful of them away but all those who stayed with her had a great time the rest of the year.  But that scarey side of her quickly faded.  She is strict because she wants all her students to learn chinese and to do well.  She is truely dedicated, making extra handouts and review sheets for us.  All her students can vouch that she really enjoys teaching and puts a lot of effort into her students.  She has a great style of teaching, engaging us in personal conversations while using grammar patterns that we need to learn.  Thus, it doesn't seem like drilling and force learning, more like conversing and getting to know one another.  However, don't expect not to work.  First semester quizzes are not that tough since the vocabulary and grammar structures are still fairly simple. However, second semester, the work gets tougher.  But the format is still the same.  Everyday I looked forward to attending Chinese class with Meng Laoshi.  But it really helps if your class gets a long well and has great chemistry! \nWorkload:\nModerate.  Written homework is weekly but there are daily quizes involving vocabulary.  Sometimes there's dictation and you have to write the character, ping yin, and meaning or just plain sentence translation from english to chinese.  \n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 05, 2002",
            "review_content": "\nMeng Laoshi is said to be one of the best teachers of chinese and i think that is true. When she came into the classroom the first time this semester, she started counting us in Chinese and repeated this procedure at the beginning of every lesson, which is why i didnt have to learn the numbers once we got there. strangely, she gave this habit up aftter the lesson with the numbers. very natural teaching style, you can pick up a lot if you want to. english is one of her second lan guages, which is sometimes very entertainin g.. she is very funny and encourages you to be creative. sometimes students act out some scene from the textbook, but she sometimes doesnt follow the prompt on purpose, which is great b/c you have to improvise in chinese... oh, yeah- she thinks she is strict: quiz every day, but you only have to translate from chinese to english, n ot the other way around. overall, an excellent teacher and definitely the right choice if you wish to learn chinese.\nWorkload:\ndevote about one hour a day and go to the l ab! ting ba..\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "January 16, 2002",
            "review_content": "\nA great teacher. If you put in the work you will definitely do well. But i would not recommend this class if you are not willing to put in the 1-2 hours every day. But if you are looking to learn chinese, Meng is the teacher you want.\nWorkload:\nHeavy... Quizzes almost everyday, homework once or twice a week, 5 exams, final. Lots of difficult memorization.\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 15, 2001",
            "review_content": "\nMeng Laoshi is a good, disciplined, structured teacher. She expects her students to work and if you if you don't, you can expect to fall maddeningly behind. She is a little intimidating and impatient with students and answering their questions, but offsets this by a good sense of humor. It's a good course to learn first year Chinese.\nWorkload:\nSmall quiz on characters/pinyin every day. Supposed to listen to the tapes every night. 6 tests, all fairly easy. 2 Oral exams. Final.\n"
        },
        {
            "course_name": "CHNS G4015-G4016 Readings in Modern Chinese",
            "review_date": "December 31, 1999",
            "review_content": "\nThis class is pretty notorious but notorious for the wrong reasons. Meng laoshi is from Taiwan, and you can really tell this by her bias. It's definitely a ton of work and in my opinion, a lot of it is useless work. So much of the vocabulary we learn is impractical. Also expect to devote a disproportianate amount of time on news articles. If you're into anything else, this class isn't for you. Although, I hear Sobelman's class is even lousier. You should just go on ahead to 5th year Chinese with Liu laoshi (awesome guy) and skip 4th year-you'll save yourself a lot of headaches.\n"
        },
        {
            "course_name": "CHNS G4015-G4016 Readings in Modern Chinese",
            "review_date": "December 31, 1999",
            "review_content": "\nI took this class as an undergraduate. At the beginning of the year, I had to pick between Sobelman and Meng's sections, and I picked Meng's because it looked a lot more structured and also because I would learn a lot more in Meng's class. Meng laoshi's class is very intense, and you'll definitely need to devote the time to memorize characters for tingshie and for homework. I recommend the class if you've got the time and energy. The tests are killers.\n"
        }
    ]
}