{
    "prof_info": [
        {
            "prof_name": "Susan Sacks",
            "prof_id": 863,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Adolescent Psychology",
            "review_date": "May 04, 2016",
            "review_content": "\nProfessor Sacks is incredible. She is patient, intelligent, fair, engaging, knowledgeable, and generally wonderful. She has high expectations and doesn't tolerate students who do not put time into the course, but she is also extremely understanding. She is super encouraging.\nProfessor Sacks has office hours and values the time you spend in them. She will talk through difficult or confusing topics, help you generate new ideas, and will encourage you to pursue research on topics of interest to you. She values learning for the sake of learning and will always be understanding if you have extra questions. She puts a lot of preparation and effort into the course, and expects students to do the same.\nThis course is excellent. You will focus a lot on female adolescent psychology and will cover many dimensions of adolescent development.\nWorkload:\nYou can get away with not doing some readings, but you should only take this course if you're genuinely interested in the topic. Doing the readings is worth it.\n2 observations or interviews and write-up about each, approx. 5 pages each\nWeekly, substantial reading\nFinal research paper, approx. 20 pages\n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "January 04, 2009",
            "review_content": "\nThe class, while not seeming to be a lot of work, can be extremely educational if you actually do the readings. Sure, you can get by without doing them and you'll still learn a decent amount, but if you're actually interested in pursuing a career in education, you should probably do them. The class revolves mostly around class discussion with occasional classes focusing on specific theories and methods.\nSince we're learning about ideal classroom and teaching methods, Sacks works to employ these methods. The style ends up being pretty different from the usual college course but that works well if you're into a somewhat looser teaching style. The class ends up being enjoyable to go to and it's really great to be able to take a break and relax while you're in a class, while still managing to learn in the process.\nWorkload:\n2 classroom observations - advice: schedule these and get them done asap\n1 paper/project on the the topic of your choice, with a 10 minute in class presentation\n1 take home final\n1 short summarization of an article presented to the class\nweekly readings from textbook and various articles\n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "December 31, 2008",
            "review_content": "\nOverall, this class was interesting, especially for people going into the education field, where this class is required for elementary education. It was an easy one at that; there was no way for Professor Sacks to hold us accountable for the readings, except in the case of one pop quiz, which she agreed was unfair but was only done to prove a point to the class, not really penalize us. Sacks tried to make this more of a discussion class where we could talk about our experiences in our education and hopefully apply it to our own teaching endeavors. Very little actual work for the class, besides the two classroom observations and the final case study, which were fine and actually helped us uncover a lot of things about what's important to each of us in the teaching field.\nWorkload:\ntwo teacher observations with a classmate and two respective papers written, and a final case study.\n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "November 28, 2007",
            "review_content": "\nThis is a good class to take if you are at all interested in education...but if you are looking for a true psychology course, you might want to take something else.  Sacks is a really nice woman (unless you inadvertantly get on her bad side) and she is not really a tough grader; most people got either a B or an A on everything.  You need to participate a lot but you don't necessarily need to do the reading (except for the final case study).  Overall, the class is very interesting and does not really require too much work.\nWorkload:\nno exams; two 7 page school observations (1 elementary, 1 secondary which can be VERY difficult to schedule unless you already have connections so start scheduling early), one final research project with an independent fieldwork component and a mini-presentation, a short presenation on a journal article, and a take home final exam; class participation/discussion is a must\n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "January 04, 2005",
            "review_content": "\nProf. Sacks is a very knowledgable woman.  A lot of class participation is expected but not draged out of you.  It was a nice, relaxing environment, where she would bring candy, or cookies every now and then.  Most of the students enjoyed the class a lot. Definitely recommend it\nWorkload:\n2 class room observations (which can be annoying to schedule and travel to the schools but managable) a final project, and a final case study.  At times it just seems like never ending papers due for this class b/c there is always something do.  Also a small presentation on a article she gives out (not bad at all).  \n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "December 20, 2004",
            "review_content": "\nI found Professor Sacks' class to be thought provoking and fun.  She's very traditional, and she has so much to offer.  Her class is very much like a seminar and Prof. Sacks loves class participation.  I found it to be a very relaxed and enjoyable class!   \nWorkload:\n2 classroom observations, 1 final, 1 project.  \n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "January 03, 2004",
            "review_content": "\nNot too hard a class, but lots of 3rd-grade level nonsense.  The first 3/4 of the semester Sacks was off-task for at least the first half of the lecture passing out potential (volunteer) tutoring and teacher's aides jobs and snacks galore (even though she said that food was the worst reward to give to a class of students).  Sacks isn't mean, perse, but she has made nasty comments to many a classmate.  The individual projects could be either fun or a pain in the butt depending on what resources you had - she never informed many students that you cannot really go into NYC classrooms to conduct experiments.  Classroom observations (1 elementary, 1 secondary) were fine albeit time consuming and hard to schedule and the writeups were not bad if you know exactly what she's looking for.  Nevertheless, she thinks she's more influential in the NYC public school community and that we can get into classrooms with ease which was clearly not the case.  Also - if you want a good grade be sure to go to an All-Women's school - she seems to love that more than anything!  As far as the in-class \"seminars\" as she would call them - we ended up coloring, writing stuff out on newsprint paper, drawing with crayons, and talking about our \"personal experiences\" in 5th grade - half our life ago.  It seemed more like a therapy session than a psych class.  Also, the documents she hands out are rediculously outdated.  She plays favorites and is feminist (she thinks that girls are oppressed by boys in the classroom and therefore they should be separated; okay, well she does teach at Barnard).  But if you manage to go to class, sign the attendance sheet, dig out your feelings about that bully who pushed you in the mud at recess when you were nine, and eat some of her cookies, you'll get a good grade.  Also, if you take Carol Dweck's class at the same time - you're golden.\nWorkload:\n2 observations; 1 take-home final (case study - the first chance to be REALLY creative); individual project (8-10 pages requiring hands-on research).  Not a tough grader.  \n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "December 18, 2003",
            "review_content": "\nIt was like sitting through a really bad middle school class. After class everyone would walk out and swear not to come back the next day... and a lot of them didn't... so she started taking attendance. It was really disappointing seeing as she was teaching potential teachers... and her teaching was so horrific. No patience, no tact, no organization... lots of poo.\n\nWorkload:\nNot so bad... what other people have said is true: 2 observations 6-8 pages each, you have to go to one h.s. and on elementary for an hour each and observe then write a report.\na take home final case study and a term-long research project/experiment. plus one in-class 5 minute presentation on an article. \nlots of nonsense.\n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "March 04, 2002",
            "review_content": "\nIf you like being treated like a child, educational psych is the course for you. Professor Sacks runs a lecture that feels at times like an elementary school art class (Get into groups, kids! Here are some markers and oaktag!) or like a group therapy session for unresolved middle school traumas. I left each day feeling embarassed and idiotic, and most importantly, completely underwhelmed by Prof. Sacks' knowledge of education and ability to convey that knowledge to prospective teachers. A completely frustrating waste of time.\nWorkload:\nFar too much for a 3 point course: two classroom observations and a research project, not to mention the nitpicky add-ons that aren't even on the syllabus. One plus: You don't need to do any of the reading or even pay much attention to the lectures, which includes 40 minutes of administrative nonsense every day. \n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "December 21, 2001",
            "review_content": "\nHmmm...One of those classes where you'll either hate it or love it. It's very much run like a seminar class. There is no concrete syllabus, even though she insists on following it. Many days, she'll have students present articles and then it turns out into a class discussion instead of having her lecture. It also takes her about 20 minutes every class to get \"administrative\" matters settled. She's very resourceful and is head of the Barnard education department. However, she's known to play favorites and that can be a pain. The workload isn't terrible, they're actually pretty fun if you're into Education and learning. But they can require a good amount of time if you realy want everything to be perfect. I still recommend this class.\nWorkload:\nNo midterm, no final. 2 Class Observations (like papers, 5-7 pages long after visiting schools in NYC), 1 term project (10 page research paper and presentation), 1 take-home final (case study that is pretty long and somewhat difficult but definitely manageable).\n"
        }
    ]
}