{
    "prof_info": [
        {
            "prof_name": "Musa Gurnis",
            "prof_id": 3583,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 13, 2010",
            "review_content": "\nIf you are looking for an breezy, easy, conventional, glory glory to the great books, kind of Lit Hum class, Musa Gurnis is not for you. She's one of the toughest, most earnest and most bad ass teachers I've ever had. She teaches with a bit of background on each author but the work in class is on your shoulders. As a gifted bullshiter myself, I would urge any other student with similar talents to drop your bad habits asap. They will not aid you in this class. Bring in good things to say every time. She gives good feedback, she's smart as a whip but most importantly she cares. You'll write better, think better, and 20 years after college, you will realize that it is teachers like Musa that you remember.\nWorkload:\nStandard Lit Hum (large) with a few interesting changes here and there. One test paper (1-2 pages)  and 2 real papers (6-8 pages) each semester.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 03, 2010",
            "review_content": "\nMusa really is a great teacher.  Her reading load is relatively demanding, and she definitely expects quality from the papers you turn in to her, but I feel like she helped to make me a better writer.  She also really put her all into reading the texts and into coming into class prepared for discussion and prepared to provide us with useful things for the mid-term and final.  She was somewhat intimidating at first and I absolutely know other students who had it much easier in Lit Hum, but I enjoyed her class as a whole. \nShe really looks for in depth analysis of texts in the papers that you hand in, but if you're stuck with what you want to write about she is very helpful in helping you clarify your own ideas to yourself.  She is a hard grader, only one A I believe in the class and 2 or 3 A-s I got a B+ first semester and most likely second semester. It was a hard class to get an A, but once you figure out what she wants the class goes more smoothly.\nWorkload:\n2 papers a semester.  Mid term and Final. Possible presentation? was 1 in the first semester.  Class goes smoothly if you actually read the texts.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 11, 2009",
            "review_content": "\nI agree entirely with the previous reviewer.  I didn't have so much of a problem with Musa at the beginning of the semester as some others did, but she was admittedly very demanding.  But, like the previous poster, Musa definitely helped me do some of my best academic writing yet.  She helped me to write essays that I was proud of in the end.  What more could you ask for in a UW teacher?  She creates her own syllabus, containing as little as possible of the stock UW \"academic navel-gazing\" (her words) that are the essays most other UW classes read.  Musa emphasized close reading and, moreover, paying deep attention to what we were writing, how we were saying it, what the implications of our conclusions were.  By the end of the semester we were all getting along very well and the class really felt like a cohesive, comfortable group. \nIf you're lucky enough to have Musa as a teacher, rejoice!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 22, 2008",
            "review_content": "\nIt's cliche, but Musa really taught me how to write. At first I really hated her, along with most of the class, because she is really abrupt and extremely demanding. However, this pushed me to work harder and to write more drafts and she actually was responsible for the best work I think I've ever done. She's really into \"close-reading\" things, and so we had some classes where we would just analyze pop culture like music videos or shows, and give them relevance I'd never even previously considered. The UW curriculum is ridiculous, and Musa does. not. do. it. That's right. She simply requires that you write four essays -- they don't have stupid names like 'lens' or 'conversation' or whatever, and she doesn't limit you to a random set of readings. I got to choose the topic and set of readings for each essay that I wrote, and in addition to knowing the Stacks like the back of my hand, I was really proud of the results. She's a great writer, and she really helped me learn how to write. So. .  . if she teaches UW again, take her class.\nWorkload:\nSelf-directed readings, obviously a lot of writing. 500 word responses each class, a million drafts per essay, four essays in total. Lots of writing but not necessary the hardest writing in the world.\n"
        }
    ]
}