{
    "prof_info": [
        {
            "prof_name": "David Weiss-Halivni",
            "prof_id": 1646,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Jewish Liturgy",
            "review_date": "November 15, 2004",
            "review_content": "\n\nProfessor Halivni is the cutest man ever. That said, he is also a brilliant and well-respected scholar who has forgotten more about Jewish law than I will ever know. His class can be boring if you don't make an attempt to stay involved and awake, but he is very receptive to questions and always gives well informed and interesting answers. \nProfessor Halivni may not remember your name, but he definitely notices students presence (or absence) and sometimes comments on it, he also requests that if you see him on the street that you say hi. \nI enjoyed his class, the open-ended nature of the paper topic and the experience in general. As he is retiring soon, I would suggest taking a class with him soon, even if you don't love it he is one of those people that you have to at least speak to once.\nWorkload:\nOne 15-page paper at the end, just do it, any effort gets an A-.\n"
        },
        {
            "course_name": "Jewish Family Law",
            "review_date": "September 03, 2003",
            "review_content": "\nAlthough at times a bit of a snooze, professor Halivni is so nice, but brilliant at the same time.  He is a genius and a famous scholar, even if it isn't apparent from his teaching style.  Since your one assignment is not based on what you learn in class, paying attention is entirely up to you, but it's worth trying.   I thought the class was worthwhile and would definitely take another with him! \nWorkload:\nNO WORK! just one 15 page paper on any topic due anytime you want (even till January!)  \n"
        },
        {
            "course_name": "Jewish Family Law",
            "review_date": "September 02, 2003",
            "review_content": "\nProfessor Weiss-Halivni is a brilliant man who should be commended for his command of Jewish Scripture. BUT he is getting somewhat older and that is obvious in his teaching. His classes are boring and have no connection to one another. If you did not go to day school or yeshiva, the lectures can be difficult to follow. Although the TAs are very helpful, Halivni has trouble understanding the non-Orthodox student. If you have a personal interest in studying scripture on your own, this is a good class to take because of the final 15-20 page paper but don't expect any help from him. He assigns this one grade because he believes in learning for the love of learning, but it ends up making the paper a pretty stressful experience\nWorkload:\nOne 15-20 page paper where you are pretty much on your own.\n"
        },
        {
            "course_name": "Jewish Family Law",
            "review_date": "May 20, 2003",
            "review_content": "\nOne of the easiest classes ever!!!!!!    Professor Halivni is a Godsend (no pun intended).  He really doesn't demand much from his undergrads (which is kind of sad, because the class runs on a high-school level and can make the class seem a bit tedious at times),  but he is really REALLY brilliant. The class might not reflect his genius, but talk to him after class and you'll see.    Although attendance is sort of mandatory, you don't need to pay attention unless you want to (because there are no tests and the paper doesn't have to be on something we covered in class). But if you want a class that isn't at all demanding, than TAKE THIS CLASS.  He is also a wonderful, sweet man, who should teach a class on his life experiences, because that would be MUCH more captivating.   One recommendation though: Drink LOTS of caffeine before (and during) the class!   \nWorkload:\none 15 page paper due ANY time you want (included a month after school is over) \"Just get it to me before you graduate.\"\n"
        }
    ]
}