{
    "prof_info": [
        {
            "prof_name": "Natasha Davis",
            "prof_id": 12769,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Archaeology and Africa",
            "review_date": "December 20, 2013",
            "review_content": "\n\"Now on to the real issue: I have never heard any prejudiced language from the TAs in this course, from either Natasha or Mark. Throwing out incendiary remarks is more than childish. It's hard to imagine that the person who penned the review is indeed, as they claim, a junior. They sound more like a scorned middle schooler who is out for revenge.\"\n...I'm not sure where this reviewer was the whole semester. This class was a total nightmare and the attitudes of the TAs absolutely appalling. I agree with all reviews posted thus far except the one mentioned above. As for calling the comments of one reviewer \"incendiary\", I would note that the comments made by the TAs were far more incendiary than anything else I've heard at Columbia so far.\nI only disagree with the other reviews in that I do believe I actually learned one or two things this class. Yes, it made complicated issues far too simplistic and yes, some totally ridiculous comments were made, but the map of Africa quiz and the midterm paper really broadened my knowledge of the continent. That said, I probably could have learned the same amount (if not more) after an hour on sporcle or a single trip to the Museum for African Art.\nZoe was wonderful but I don't think she shines in such an intro-level class. It seemed like she didn't know how to deal with some of the ludicrously uninformed (and often downright racist) comments made in class -- not that that's entirely her fault; I'm not sure I'd know what to say to a Columbia student who still thought all African religion was \"voodoo\" either.\nWorkload:\nThe readings were useless and far too long, but as I said above, I did enjoy the midterm paper and quizzes.\n"
        }
    ]
}