{
    "prof_info": [
        {
            "prof_name": "Ruben Gonzalez",
            "prof_id": 4143,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry II",
            "review_date": "November 12, 2013",
            "review_content": "\nI really enjoyed taking Gen Chem 2 with Professor Gonzalez. I would definitely recommend taking his class to anyone who is deciding between chemistry courses. He is extremely organized, clear, and concise. All of the lecture notes are on powerpoint slides, which are posted before class. He was extremely helpful answering questions both in class and in office hours as well.\nI felt like there was more material covered in Gen Chem 2 compared to Gen Chem 1 so it was important to keep up with the material. That being said, Professor Gonzalez definitely made the material interesting and enjoyable. You definitely have to work hard to earn a good grade. The lectures were great enforcement to the textbook readings. \nIf you read the textbook, go to lecture, do the problems in the back of the book, and ESPECIALLY the assigned OWL problems then there is no reason you should't get a good grade.It seemed like the difficult exam problems were similar to some of the OWL problems. \nThere were weekly quizzes in recitation, but studying for them helped keep me on top of the material. They definitely paid off when the exams came around. \n\nWorkload:\n- Owl problems (optional but highly recommended)\n- 8 recitation quizzes (lowest 2 dropped) \n-3 midterms \n-1 final  \nYou drop the lowest 20% (either midterm, quizzes, or part of final) \n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 24, 2013",
            "review_content": "\nI came from Parkin's class which was a great experience compared to this class. Don't think you can get away with just going to the lectures. I made that mreview_content. review_content review review the practice problems, the quizzes, and reach out to your TA's. I had Lea and she was honestly a life saver. I can't say I appreciate the professors' teaching style. Both are a lot of derivations and not a lot of showing how to actually solve the problems that would be asked on the exams and quizzes. Lea helped to summarize things and get concepts down. I disliked this class especially more since it was an early morning class. I found most lectures to be dry but I found Kaufman's slides to be especially more helpful. Gonzalez's tests were nasty hard. \ni suppose it could be worse but it also could be a lot better. \nWorkload:\nOptional homework by chapter. \n3 exams spread out evenly throughout semester. (all fairly difficult I found)\n1 Final (I got pretty much slaugreview_content on this. review_content everything to do fair) \n8 Quizzes, 2 dropped. Quiz composite is equivalent of 1 exam. \n1 equivalent is dropped. \n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 20, 2013",
            "review_content": "\nThis class is a drag, but possible to push through. Kaufman and Gonzalez are both excellent lecturers who have a great grasp of the material, which doesn't seem too hard at first when you are talking about the ideal gas law. Unfortunately, the exams are insane. Recitation can be helpful to understanding the material, but the quizzes always contain curveballs that require extensive preparation from questions in the book or assumptions that aren't spelled out for you. Many of the quizzes had an average of about 1.5/3. OWL questions are somewhat helpful in preparing for exams/quizzes. Be prepared for questions on exams that TAs even have some trouble solving. Gonzalez's tests in particular offer a particular brand of cruelty that makes you question taking the course itself. Several questions on Gonzalez's exams are trick questions that throw you off completely, and on other questions you have no idea which principles to apply or how to set up an equation. This is particularly true when studying acid base equilibria and titrations. Read the textbook or seek out other resources if you want to gain a better understanding of the material, (though Gonzalez takes his lectures from Zumdahl itself) but don't stress too much about this course because the exams and quizzes are difficult for everybody. Do all the practice problems on OWL and many problems in the book, and you'll do at least the average (or better) on exams and quizzes. The class is curved to a B/B-. \nTAs are hit or miss. I had Lea Benkoski, she was pretty good at explaining material but said we needed to study more when we only got 1/3 on her impossible quizzes. She expected us to have the background and experience of upper level chemistry students who studied in France, as she did. I think quizzes were the same in every recitation.\nGood luck.\nWorkload:\n8 recitation quizzes throughout the semester, 2 are dropped. (Very difficult, out of 3 points)\n3 exams consisting of 20 multiple choice questions. Average was around 12/20 on the first exam (gas laws, vapor pressure, Henderson Hasselbach) 10/20 on the second midterm (titration, acids and bases, pH, buffers) and 13/20 on the third exam (thermo, rate laws, kinetics).\nThe final is ridiculous, out of 40 questions, which you have 3 hours to complete.\nThe lowest 20% is dropped (half of the final, one of the exams, or all of the quizzes)\nI got the average or slightly above on the 2/3 exams, 1 std. deviation below on another exam, average on quizzes, dropped half of the final, and got a B-. \n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 19, 2013",
            "review_content": "\nComing from David Reichman's Gen Chem I class, this class was very organized and well-run. Professor Kaufman taught the first half of the semester, and her lectures were clear and presented along with comprehensive slides that were posted prior to each class. She handled questions well, she was nice, and she wanted to make sure we understood everything. Professor Gonzalez took over for the second half of the semester, and his slides were the exact same format as Professor Kaufman's, so the class did not feel disjointed even though the professor changed. Like Kaufman, Gonzalez presented clearly and was very open to questions. Overall, I'd say both professors gave me a positive in-class experience.\nEach of their lectures were interspersed with iClicker questions designed to keep us engaged and to make sure we were understanding the material. I found that they were helpful, and if my mind was drifting away from chem, the questions would help refocus me. They weren't too hard, and you could talk about them with your neighbors. Plus, if you get 50% or more correct and you happen to be one of the top 3 people in your grade range, you get bumped up to the higher grade. (i.e. if you had the second highest B+ in the class, that would become an A-)\nHonestly, coming to the lectures was not enough to do well in the class. That said, the trick to doing well was *not* reading the textbook. Instead, the key was to do as many practice problems as possible. Both professors posted problems on OWL, and I did nearly every problem that they posted. I would do the relevant problems before each recitation quiz, and then I would do any remaining and relevant OWL problems before each midterm. Many of the questions on the exam that people thought were difficult were actually very similar to an OWL problem or two, so I found that doing the homework (even though it was technically ungraded) really helped me do well in the class. Note that you really need to know your stuff for the midterms, but if you know how to do all the OWL problems, it will ensure that you know your stuff.\nOverall, I had a very positive experience in this class. Sure, there were a handful of deceptive problems on each exam, but they don't make or break you, and they separate the men from the boys (or, to be politically correct, the adults from the kids). Pay attention, do plenty of practice problems, and you should be fine.\nWorkload:\n-8 quizzes, lowest 2 dropped (20% total)\n-3 midterms (20% each)\n-1 final (40% each)\nThat adds up to 120%, so you can drop the lowest 20%, whether that be a midterm, all of your quizzes, or your final can only count for 20% instead of 40%.\nWorkload was heavy. I spent multiple hours before my recitation doing practice problems, and then I studied a ton the day before each exam. Studying for the quizzes each week meant that I didn't need to study more than a day or two before each midterm. I highly recommend keeping up with the material!\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 18, 2013",
            "review_content": "\nThe reviews for this course are mostly accurate, but don't let them scare you. The key is persistence. The exams are very hard with averages in the 50 to 65 range, there's not much of an opportunity for extra credit, and they curve to a B-/B. You will think the exams are unreasonable, but it just takes a lot of practice to be able to think through the problems the right way. Read the questions carefully and understand what they're asking you to do. Think of it like learning a language: do a little bit of work every day and eventually it will start to come naturally. It's best to start consistent practice right off the bat, but even if you have a bad start and mess up the first couple of exams, you can still do it. I got scores very close to the mean for all three midterms, but I buckled down and committed to practicing and I did really well on the final and ended up with an A-. Success is possible. Don't get discouraged. Keep trying. \nWorkload:\n8 recitation quizzes, 3 midterms, 1 final, worst exam equivalent dropped. Do the optional OWL homework because you need the practice!\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 07, 2013",
            "review_content": "\nThis class, especially if you are coming from Gen Chem I with Parkin, is harsh. Be prepared for a splash of cold water!\nIn Gen Chem I, I was able to pull of an A with barely any studying; however, Gen Chem II with Kaufman and Gonzalez is a completely different story. First of all, the recitation quizzes in this class (with TA Nevette Bailey Chandler) were HORRIBLE. The quizzes ranged from incredibly hard (averages of 1.0-1.5 out of 3) to deceptively easy. \nSecondly, the midterms are much harder. The first midterm covers material taught by Kaufman and is harder but pretty straightforward. The other 2 midterms (Acid Base / Thermo) are based mainly on Gonzalez lectures. The Acid Base midterm has an average of 50 and was very tricky. The thermo midterm is not as bad, but still pretty hard.\nKaufman and Gonzalez are both decent lecturers (very based on the textbook); however, Gonzalez has a penchant for creating tricky, deceptive questions. He even says so directly. \nYou definitely have to work your butt off in this class doing problems and reading from the textbook. \nWorkload:\nHeavy. Weekly recitation quizzes (8 of them, you drop 2). 3 midterms. You drop a 100 point equivalent. Final. Optional HW (for good and bad...)\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 05, 2013",
            "review_content": "\nHonestly, don't take this class. Just don't. See if you can get another professor. If you can't don't even bother going to lectures because you won't learn anything there. Read the book and you'll learn more. Sure, there's \"extra credit\" if you go to lectures and answer half the clicker questions right, but that only applies to a maximum 20 people in the class because it will only count if you are in the top three of your particular grade band. Then and only then can you get bumped up 1/3 of a grade. This policy only adds to the sense of competition the instructors seem to encourage between classmates.\nThe tests are designed to trip you up. They are demoralizing and disheartening and make you hate chemistry. This has been by far my least favorite class at Columbia. I took a 4000 level class in the same semester, and felt that this 1000 level course was harder. This class is simply unreasonable.\nWorkload:\nMostly studying: weekly quizzes in recitation sections, 3 exams, and a final. There are 120 possible percentage points, but the lowest 20 percent gets dropped.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "February 14, 2013",
            "review_content": "\nThis class was not only brutal it was also insanely useless. It's co-taught by Gonzalez and Bursten, who I've heard was only a visiting professor? Not sure since I can't seem to find him anywhere else.\nProfessors:\nI learned next to nothing, mostly because Gonzalez is neither a good teacher nor is he particularly interested in motivating students to do well. His lectures consist of reading off of PP slides filled with material taken verbatim from the Zumdahl book, which means if you find Zumdahl confusing Gonzalez ain't gonna make it any better. He doesn't work out any problems on the board; he literally just reiterates the steps in the textbook. He peppers his lecture with supposedly engaging clicker questions but really they're a waste of time since most people don't know what the hell is going on since he doesn't actually teach the material. The clicker questions are supposed to help bump you up but that's only if you're one of the top 3 at the cut-off, which means the rest of the people are SOL.\nTo make matters worse he tried to feed us this inane lie about the chem department enacting a policy that prevents professors from posting exam answers online. Consequently, the only way to get answers for practice exams (which ultimately do NOT help you study for the exams since those p.exams were written by a different professor) Gonzalez hosted these ridiculously timed review sessions (read: day before exam) where TA's (Gonzalez was always MIA for his own review sessions go figure) did nothing but put the exams up on projectors and then waited for us to scribble everything down. Everyone pretty much whipped out their iphones, androids and iPads and started taking pictures after we realized the TAs were only going to let us have five minutes per page.\nThis \"department policy\", my friends, is pure and utter BS. Beer's class not only got their exam answers, they got them days before the exam. Moreover the O-chem I and II professors released the answers to their exams days before as well!\nBursten is by far the better lecturer. He's passionate, engaging and he did a TON of practice problems on the board which meant most people did better on his exam even if it was insanely difficult. I'd prefer to have him teach the entire course than to split it between the two of them. Bursten also used clicker questions (those were a doozy but then again it is thermo).\nExam:\nHard. Tricky. Confusing. That's pretty much all there is to it. Gonzalez was obsessed--OBSESSED--with trick questions. He admitted so himself. He seemed inordinately pleased when the average dropped to around the 50s; he told us this is where the average is supposed to be. Say what now? His exams were so difficult, the TAs who mock took them, struggled. My TA at one point just told us to try our best and to stop stressing because most of the questions are designed for people who had studied the same material before in-depth (i.e. AP chem peeps).\nI honestly wish I'd taken Beer's class. I saw his exams. They were straightforward and made sense. Their averages were in the 70s which is appropriate for a G.Chem II class. My friends in his class had less stress; they couldn't figure out why I was running around the chem building like a headless chicken until I showed them one of Gonzalez's exams. That set them straight.\nWorkload:\nLooks minimal but really you should be hustlin'. 24/7. The class is curved to a B/B+ so getting an A-/A means bending over backwards so you can touch your tongue to your elbow. There are assigned problems that are nothing like the exam. The assigned problems ask you 2+2. Gonzalez asks you for the meaning of life. One thing I'd recommend is picking up another chem textbook (Zumdahl is pretty bad in terms of G.Chem books) of higher difficulty and working through it with some friends. Either that or chill out for the semester and ultimately walk out with a B-/B.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 16, 2012",
            "review_content": "\nI was in the joint General Chemistry II section with Gonzalez and Bursten. I can't find Bursten on CULPA, so I'll just review him here, too.\nGonzalez is a pretty good lecturer; much better than the lecturer I had for General Chemistry I, who will go unnamed. He's very knowledgable and his teaching style just jived with me -- he presents material in a very clear way. He can be a bit dry at times, but there are worse things an introductory chemistry professor could be. He uses iClickers, which I love because it really tests your learning. He also only puts up iClicker questions and answers in class, so actually show up to lecture!\nBursten is just the cutest guy ever. He simply loves chemistry, and is always excited to do labs and demos. The format of his lectures is very similar to Gonzalez (i.e. iClickers, PowerPoint, etc.), but he can be a bit more confusing. I liked Gonzalez's teaching style better, but I thought Bursten's lectures were more exciting. So it's a double edge sword.\nI would definitely recommend this class for General Chemistry, though. I think as far as General Chemistry teachers go at Columbia, they're pretty good!\nWorkload:\nNo homework, just optional assignments (but do them, they're very helpful)\nWeekly quizzes (difficulty variable depending on TA)\n3 Exams (HARD. Curved to a B+, and the average is generally 50%)\n1 Final (HARD. Grading same as exams)\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 12, 2012",
            "review_content": "\nGonzalez taught the first half of Gen Chem II, Bursten the second half.\nGonzalez:  Sucks as a lecturer.\nBursten:  Good lecturer.\nClass: Pretty much every exam (3 midterms, 1 final) had 50% or lower averages.  The TA's couldn't even get full scores.  It was beyond ridiculous; the test questions are much much harder than anything covered by anyone whether the professors or the TAs or the assigned problems.  Most people straight up guessed on 1/4-1/2 of each test. Clicker questions which are stupid and a waste of time/money b/c only the top 3 students in a letter grade get bumped up if they answer correctly 50% of the clicker questions.  \nBoth profs refused to release the answers for practice exams/actual exams.  They created special exam review sessions where it was crowded with people trying to copy down every question/answer and \nAvoid these professors if you can.  Everyone dumps on Beer, but at least his tests/grading is fair.  \nWorkload:\nAssigned problem uncollected/graded.  Quizzes in recitation session.  3 midterms, 1 exam. One midterm/quizzes grade dropped.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 08, 2012",
            "review_content": "\nRuben Gonzalez is one of the toughest professors. He doesn't go beyond what the book says to explain the material more clearly. \nHe is a nice person but unfortunately as a student he does not give you the impression that he wants you to succeed. Almost everyone in the class was looking for better ways to study for his exams but every time his exams were surprisingly difficult and not at all in the same style as the quizzes or assignments or study problems from the book. Therefore it made it very hard to stay motivated to do well in his class since he didn't seem to want us to by making the exams close to impossible and not properly preparing us fir them. Average on our exams were 50s and lower.\nHe had 20 questions on the exams and 40 on the final. Every single question is challenging and was not the same style question of difficulty than anything we've seen throughout the semester.\nHe did not seem to want to help us do better...making every question \" tricky\" which he thought was a good learning experience.   \nWorkload:\n3 exams (one can be dropped) , one final, assignments that are nit graded, weekly quizzes\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 07, 2012",
            "review_content": "\nThis semester, C1404 was co-taught by Professor Gonzalez and Professor Bursten.  Professor Gonzalez taught everything up to Thermodynamics (roughly 2/3 of the material for General Chemistry II), and then handed things over to Professor Bursten for Thermodynamics and Chemical Kinetics.  \nI found the first 2 months of lecture very frustrating.  Professor Gonzalez puts very little effort into enhancing the material presented in Zumdahl.  He takes his slide show presentations DIRECTLY from the textbook, including worked out examples and graphs.  This makes his presentation redundant for anyone who bothers reading the book before class.  If something doesn't make sense in Zumdahl, it won't make sense in lecture.  Professor Gonzalez incorporates 1-2 clicker questions into class, and even the promise of a grade bump dependent on your clicker use wasn't enough to fill the seats of this 10:30am lecture.  In order to obtain solutions/an answer key for practice exams or midterms, you were required to attend office hours.  This was supposedly a policy enacted to encourage students to engage with the material, although several days before the final exam the head of the Chemistry Department said this policy had been enacted to prevent \"exam stocking\" by the frats.  Mysteriously, this section of Chemistry was the only section for which this policy was enforced.  \nProfessor Bursten was a game changer for the last month of Chemistry.  He taught occasionally as a substitute during the first two months, and then taught the remainder of the course (~4 weeks) following the 2nd exam.  Professor Bursten came to class full of energy, with slides that looked nothing like the material in Zumdahl (I think he authored his own textbook a few years back).  Demonstrations were plentiful, and he worked a lot of problems out on the board.  This is probably why Thermodynamics \"sticks\" better in my mind: step-by-step problem solving during class, as opposed to following along on a powerpoint.  However, just because he's an excellent lecture doesn't mean he is an easy professor.  His clicker questions were challenging, and the questions he contributed to the exams could tie your brain in knots.  However, I found it easier (and more pleasant) to learn from someone who clearly put a lot of effort into preparing for class and was eager to see students succeed.  It was too late in the semester to see any appreciable difference in attendance, but those of us who were regulars in morning lecture appreciated Professor Bursten's enthusiasm.\nIn sum, I think the Chemistry Department has some work to do in order to improve this course.  The course should be taught by one professor throughout the entire term, splitting the course between two completely different teaching styles is frustrating for both students and professors.  There should also be a department-wide policy about the use of practice exams/past exams.  It doesn't seem fair that the evening class (taught by Dr. Beer) was permitted to work from old exams, but this new policy was enforced for the Bursten/Gonzalez sections. \n\nWorkload:\nHeavy workload.  3 Midterms (1 equivalent each), 8 Quizzes (1 equivalent, lowest two scores dropped), 1 Final Exam (2 equivalents); lowest equivalent dropped\nPrepare to work, work, work.  The quizzes are tricky, with an average around 1.5 pts (out of maximum 3).  Exam scores were decent for the 1st exam (mean ~65), then took a nose dive for acids/bases and thermodynamics (mean ~50 for each).    \n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 17, 2011",
            "review_content": "\nFirst off, Prof. Kaufman â€“To me, she seemed like a good professor at first; sheâ€™s quite eloquent in lecture and her PowerPoint slides are aesthetically pleasing. Well, thatâ€™s before you realize that Prof. Kaufman appears to be lecturing from some sort of script that eloquently regurgitates the Zumdahl textbook. I can understand why some people like her lecture style. Sheâ€™s super clear and concise about everything thatâ€™s on her script. \nTry asking her a question about the class material that asks about the â€œWHY,â€\u009d as opposed to simply the â€œWHAT.â€\u009d She seemed dumbfounded by questions asked by students that threw her off the script. Thatâ€™s not to suggest she doesnâ€™t know the answer to the questions that students posed to her. She was just very, very insecure in her teaching abilities and had difficulty conveying chemical principles (outside her script) to her audience. I agree with the previous review that Prof. Kaufman seemed standoff-ish at times, and she was quite unhelpful and awkward at office hours, where she struggled to tackle Zumdahl textbook problems on the spot. On the bright side, Prof. Kaufman did many demonstrations (which were more interesting than her teaching), used iClickers to attempt to engage the class, baked fudge for the class, and had a dog in her office, which relieved the awkwardness of her office hours and her very weak teaching skills. \nNext up, Prof. Gonzalez â€“ He seemed to be more confident in his teaching abilities and his ability to convey chemical concepts to the class, and I thought he was the better professor.. Unlike Prof. Kaufman, Prof. Gonzalez was able to answer studentsâ€™ questions and address their concerns / confusion with the course material extremely wellâ€¦that is, IF you choose to ask him a question. Heâ€™s quite helpful in office hours and heâ€™s a very friendly guy who has a clear command of the subject matter. \nNow hereâ€™s the problem. This guy, despite being a rising research star and his vast knowledge of the topics that we covered, made little to no effort to engage the class. Like Prof. Kaufman, Prof. Gonzalezâ€™s lectures regurgitated Zumdahl, went over the same exact examples from the Zumdahl textbook, and, as previous reviewers suggested, his slides were peppered with typos. He did few demonstrations, started teaching with iClickers but seemed to have forgotten about them by the end of the semester, and spoke in a very, slow deliberate way that made the class quite boring. I found it pathetic how little he seemed to care about the class. If he put some more effort into teaching, he could really make a very good chemistry professor. \nI got an A for the class. While this class is co-taught by Prof. Gonzalez and Prof. Kaufman, we should add a third professor (the best one of the three) to that list: Steven Zumdahl. My recommendation is to study from Zumdahl and do as many practice problems with the solutions manual as you can. Mastering the Zumdahl questions will help you prepare for the curveballs on Kaufmanâ€™s tests. Test averages were fairly low for the midterms (~70 M/T 1, ~50-60 M/T 2, ~60-70 M/T 3). Quiz averages were atrocious (~1-2 out of 3 points for each quiz). So do work hard, beat the curve, and best of luck. You have a lot of independent studying to do. \n\nWorkload:\n3 midterms, 8 quizzes (lowest two dropped) that count for a midterm, 1 final (counts for two midterms). Lowest midterm equivalent dropped. You need at least 1 standard deviation above the mean to get an A- (thatâ€™s roughly a 90 on the first test, 75 on the second, 80 on the third). To get an A, youâ€™ll need to score well above one standard deviation. \n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "August 30, 2009",
            "review_content": "\nI had a split semester with Gonzalez and Kaufman.  It was his first time instructing here and he taught the second part of Thermodynamics.  I agree his slides were flawed nearly every lecture, but then again so were Valentini's and he is the head of the department and arguably a genius.  I'm not so concerned with algebra mistakes.  My concern lies in the instructor's ability to engage students in order to present the material they are tested on.  Gonzalez does just that.  He doesn't stray from the material too much in theoretical discussions, although some may enjoy that; he gears his lectures directly to the subject matter and leaves ample office hour time for those who may have deeper questions.  He seems to take his examples directly from the book.  He has a friendly demeanor and stays after every class to answer questions.  \nWorkload:\nThere could have been more example questions and theoretical questions to work out every week.  The workload was much less than I expected leaving me plenty of time to study reserve books but more time wondering what might be on the tests.  \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 16, 2009",
            "review_content": "\nIt's hard for me to know where to begin talking about Gonzalez. He is so incredibly awful, from his poor lecture slides (full of typos) to his poor lecture delivery (monotonically reading it off the slides) to his lack of email responses (two days before the midterm he emailed us telling us not to email him as he had gotten too many messages and didn't have time to respond). Honestly, this guy is the single worst professor I've had at Columbia, and I don't say that because of my grade -- I got an A. \nPerhaps if his lectures were actually decent, I would have been more forgiving. But he literally took them right from the book (as in, copied it directly onto the Powerpoint), and STILL managed to make mathematical errors. Moreover, he didn't even manage to deliver them with enthusiasm and excitement. And I can think of only two demos he did in an entire 6 weeks he taught (he team taught with Kaufman). When I did this material in AP Chemistry, it was interesting and logical. When I did it with him, it was boring and illogical. A \"good\" day would have 40% of the class show up. This is the kind of person who should be kept far away from a classroom. \nIf you have an option, stay away from this guy. It's not that he's that hard; he's just that mediocre. \nWorkload:\nStandard GenChem II -- weekly quizzes, three midterms and a final with either all the quizzes, one midterm, or half the final dropped. Problem with him is not the workload but the teaching (or lack thereof). \n"
        }
    ]
}