{
    "prof_info": [
        {
            "prof_name": "Robert King",
            "prof_id": 12504,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "American Film History After 1990",
            "review_date": "December 15, 2013",
            "review_content": "\nThis was an incredibly enjoyable class. The lecture was thorough and engaging. Professor King was the type of guy who is passionate (and even tickled?) about the subject he's teaching. He's extremely intelligent and funny. I sat down for the first class, where he proceeded to bash the horrible 2013 blockbusters. And, as this is a current history course, he alters his lectures, adding details of what is happening today in context to what we're studying. For example, he referenced Gravity, which had just come out, and Breaking Bad's finale.\nWe also have a pretty awesome syllabus. We have a good mix of \"greatest hits\" movies, like Jurassic Park, independent movies, like \"Happiness,\" and critically acclaimed movies, like There Will Be Blood, and everything in between. All of them fit into a historical argument. It wasn't just a random smattering of films.\nTake this class if you can!\nWorkload:\nReally not bad. Readings (usually about 50 pages) + discussion each week. Short and long paper and a final exam.\n"
        },
        {
            "course_name": "American Film History After 1990",
            "review_date": "December 08, 2013",
            "review_content": "\nI took American Film History After 1990 as a 'fun' class, a way to complete my schedule with something that didn't sound too difficult. The course wasn't super heavy on work, but it was also way more interesting than I anticipated. Professor King is a great lecturer and very knowledgeable about the economic pressures guiding modern film. Lectures focused on the impact of technological advancements and the economics of film industry, though we did also talk about the theory behind pastiche, mumblecore, historical film, etc. \nOverall, the class was an enlightening look at the industry influences behind trends in contemporary cinema. Professor King clearly loves film - both highbrow and lowbrow - and made every topic interesting, accessible and enjoyable. \nAlso, we got to watch Jurassic Park in class.\nWorkload:\nWeekly short discussion board posting, one 5-6 page paper, one final 10 page historical research paper on a topic of choice, in-class exam\n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "December 04, 2012",
            "review_content": "\nI found Professor King's class to be a really painless way to get the introductory film course over with.  He is definitely very knowledgeable about film history and theory and makes the lecture as engaging/entertaining as he can, considering the class itself is nearly 4 hours long.  My main complaint about the class is obviously the length, but with film classes that's something you have to deal with. Overall I would highly recommend taking the intro course with him if he teaches it again (I'm pretty sure this is his first time teaching it at Columbia at least).\nWorkload:\nWeekly readings that you don't really need to do, except maybe the film criticism articles.  He covers most of what you need to know in lecture.\nno midterm\n2 papers, one is a shot by shot analysis and the other is a contextual critical analysis. Pretty painless.\nDiscussion section participation. Basically just talk in class and post in the discussion group on courseworks and you'll be fine.\nFinal, which he gave a study guide for.\nOverall pretty easy, I think it would be really difficult to fail this course and definitely possible to get an A if you put the effort in on the essays.\n"
        }
    ]
}