{
    "prof_info": [
        {
            "prof_name": "Colin Webster",
            "prof_id": 9648,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Greek I",
            "review_date": "May 24, 2010",
            "review_content": "\nColin is a fantastic instructor. Without a doubt the best language instructor I have ever had (and I've taken *a lot* of language courses). He is also by far the most demanding language instructor I have ever had. We had to read the book on our own -- he made his own lessons for the material covered, and his own worksheets. That's a good thing, since we learned the same material from two perspectives. But it doubles the work for us.\nAncient Greek requires *tons* of memorization, and Colin tries to show us patters (and drills them into us) so that we can reduce our workload a bit. He also makes quizzes and exams very predictable, so we know exactly what to make sure we've memorized. Otherwise, it would just be too much.\nThe only negative was that we didn't get a chance to do much translating from actual Greek -- we almost always [with one exception] skipped over the selections from Plato, etc., in the textbook, and we never got a chance to do some \"real\" translating at the end. Much of that was because we had to cancel several class periods [snowstorms, illness (once)] didn't have enough time. At least we got through the whole textbook, which apparently isn't always the case. He mentioned that he really wanted us to get our feet wet with some translating, and was sorry we were not able to -- so it shouldn't be a problem with future classes unless you also have several classes cancelled due to weather, etc.\nBottom line: With Colin as your instructor, you'll have to work a lot, but it will be very rewarding. The slighly increased workload [every Ancient Greek instructor will make you work] will be more than made up for with the significantly increased understanding of the language.\nWorkload:\nAncient Greek is an amazingly difficult language. I had no clue what I was in for when I registered for this course. Memorization up the wazoo. It's ridiculous. You need to put in work before every class and keep up, or else it's just going to be harder. A minimum of 2 hrs spent on homework per class, plus a quiz every week (so that's an hour of studying). Plus reading the assigned sections from the chapters on our own (1/2 hour). Plus memorizing the forms and the vocab (1 hr). Add it all up, and it's completely ridiculous!! \nThe homeworks are turned in once a week, but we go over the homework in class the other times so you have to do it -- otherwise, you'll look like a fool when you're called on (although Colin tries not to embarrass you too much when you struggle, he'll make you do the assigned translation on the spot -- which is pretty damned tough).\n\n"
        }
    ]
}