{
    "prof_info": [
        {
            "prof_name": "Maria Feng",
            "prof_id": 12732,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Engineering Mechanics",
            "review_date": "December 05, 2014",
            "review_content": "\nThis course was one of the worst courses I've taken at Columbia thus far. That being said, it is mandatory for several engineering tracks, so you might just have to muddle through. If possible, take it with a different professor. Professor Feng made the course much more complicated than it needed to be. \nProfessor Feng would consistently mislabel variables and make other problematic errors during lecture. When students would point out these mistakes, she would often stare at the board for several minutes in utter confusion.  Sometimes, she would just glaze over the mistake and quickly move on to the next example. Professor Feng also spends very little time explaining the fundamental material and instead spends a majority of each class going through examples. The lecture quality was so poor that attendance dropped sharply after the first few weeks of class.\n\nWorkload:\nThere are 12 problem sets, none of which can be dropped. They are not consistently due on the same day of the week every week, which can be difficult to keep track of.  Twice during the semester, two problem sets were due within a week of each other (once was during the final week of classes).  \nYour grade is determined as follows:\nHomework: 20%\nMidterm 1: 20%\nMidterm 2: 20%\nFinal: 40% \n"
        },
        {
            "course_name": "Engineering Mechanics",
            "review_date": "December 11, 2013",
            "review_content": "\nThis professor is very nice and well intentioned, but a terrible teacher. I (along with most of my friends) stopped going to her class after the first midterm. \nWhen she solves a practice problem, she will mislabel a certain variable, plug a wrong value, or write a wrong formula, then a student will raise their hand to correct her. When she calls on her student, they explain the mistake to her in a perfectly logical manner, then Feng will say how that explanation is wrong and proceed to attempt to solve the problem. Feng will then suddenly realize her mistake, spend a few minutes thinking to herself about what went wrong, and then make the correction the student correctly pointed out 5 minutes earlier. Episodes like this make the class soooo frustrating.\nHer lectures are largely unhelpful. I hear a different professor teaches this class in the spring, but I also hear since he is actually good at teaching, he makes the material a bit harder. Choose your poison.\nWorkload:\nPretty easy in my opinion. I know some people who struggle with this class, and I imagine this a result of never mastering introductory mechanics, not mastering calc iii, or just not knowing how to apply formulas to solve problems. However, the class reviews basically everything you need to know from calc and from physics, so being behind in those topics (like I was!) won't really hurt you.\nI honestly found this class waaay easier than physics 1601, many of the psets would have only 5 problems. Unlike in introductory physics, this class gives problems types that are solved in class or in the book.\nSo Each week I would skip class, spend an hour or two reading the book, then 2-3 hours working the psets. The midterms weren't that hard (I actually found them kinda fun since the questions were interesting) I don't expect the final to be terribly difficult.\n"
        }
    ]
}