{
    "prof_info": [
        {
            "prof_name": "Rashid Khalidi",
            "prof_id": 2085,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "December 17, 2016",
            "review_content": "\nThis guy is my God. \nHe is just a fantastic lecturer and honestly a very calm yet passionate man who has extensive knowledge and experience of the Middle East. Sure, his views can be slightly biased but you have to understand where he is coming from... just read his wiki page and you'll see what I'm saying. Also, as someone who is highly influential in historical discourse, he definitely takes time to listen to your questions and respond to them thoughtfully. His lectures, although at 8:40am, are great. Very engaging if you really wanna know about this part of the region that has been misinterpreted significantly. His rare but golden criticisms of certain political leaders are legendary and his family ties are impressive too (his uncle was the frigging mayor of Jerusalem, like wtf man) \n1 midterm \n1 final\nBoth were essays. Not bad. \nBut a LOT of readings - no one did everything though. \nWorkload:\n20% participation\n30% midterm \n50% final \n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "December 23, 2014",
            "review_content": "\nI would agree with a lot of the reviews below - Khalidi is a good lecturer, and I feel that my knowledge of the Middle East is much expanded, though I admittedly was woefully uninformed before. \nThe readings are valuable and interesting, but they are very broad and we practically never touch a primary source. The readings for the 20th century were quite unchronological, which got pretty confusing at times. Itwas kind of hard to work things through in discussion section because there was so much information in the readings for a single week (and my TA wasn't great at encouraging participation). I recognize that these are structural issues of a course spanning so many centuries though. \nKhalidi says at the beginning of the course that he's really not interested in grades/testing, and that's true. However, I think the TA's are unnecessarily harsh with grading on the extremely broad essay questions that constitute the midterm and final. \nWorkload:\nabout 8 very fat books, read over the course of the semester. 2 5page essays for the midterm, 2 6page essays for the final\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "August 07, 2014",
            "review_content": "\nAs someone who came to Columbia partly to study under Professor Khalidi, I must say that I am really dissapointed with his teaching style, and as I revisit it, his scholarship.\nThe second point is important because Professor Khalidi has quite high regard for his own work: he assigned Sowing Crisis in its entirely, and felt the need to lecture from the text verbatim.  \nThe lectures are not bad until you realize that they contain nothing unmentioned in the texts.  The generally high quality of assigned texts is the best part of this course, and the required reading list is supplemented by an extensive bibliography pointing to specialized texts on various subtopics.  Though I learned much by reading some of these, I learned almost nothing from the lectures.  Despite being a fairly diligent student I just couldn't bear to keep attending monotonous and unoriginal lectures by the time midterms began.\nThe TA discussions will obviously vary based on class and the TA him/herself.  I had Susanna Ferguson who attempted to start interesting discussions but was prevented from doing so by the fact that basically no one read.  Seeing as the lectures were uninteresting, on the whole this made for rather dull discussions which primarily consisted of Susanna summarizing the week's readings.  \nAs for Professor Khalidi himself: I was really appalled when I went to meet with him and he had the temerity to advise that I read him as an objective source.  When one asks a scholar for reading recommendations, one would expect reference to leading authors in the field other than the scholar with whom one is speaking.  I have read most of his work but find that this arrogance is reflected in the tone of his texts (\"as I will demonstrate\" \"as I have shown here\" etc., etc.) as well as his lectures -- just reading his books out loud.\nFor someone who is not familiar with the history and geopolitics of the region this course can serve as a good introduction.  But anyone looking for a rewarding learning experience or a brillant lecturer, let alone in-depth knowledge of the region, ought to turn elsewhere.  \n\nWorkload:\nMidterm essays on two of three very simple and broad topics, total of 10 pp.\nFinal paper in a similar format, two essays adding up to 12pp.\n100-300 pages a week of basic texts designed for people unfamiliar with Middle East history.  \n"
        },
        {
            "course_name": "CONSTITUTION AND DEMOCRACY IN THE MIDDLE EAST",
            "review_date": "May 08, 2014",
            "review_content": "\nHISTW4705, CONSTITUTION AND DEMOCRACY IN THE MIDDLE EAST\nProfessor Khalidi's teaching method is excellent. He was organized with his discussion of the material, and he struck a balance between lecturing on context, discussing the readings, and engaging his students. He never failed to answer our questions completely, and always addressed any comments or concerns we had.\nProfessor Khalidi was very clear about the assignments from the beginning of the semester, and the syllabus was straightforward: class participation, one 25 page paper, it outline, and a presentation. Professor Khalidi organized the presentation schedule very early in the semester, and let us know all the due dates by the 2nd week of class. It was also very nice of him to remind us to work on our outlines and papers through out the semester.\nIn my opinion, there are not any significant ways that this class could improve. The overall quality of the class depends on three things: the professor, the group of students, and the readings. As I've already covered, Professor Khalidi was excellent. As it is a seminar reserved for seniors, the students were engaged. As for the readings, they were clearly chosen with great care and were relevant as well as enlightening. \nI especially appreciated how Professor Khalidi always took a moment to relate the material we were discussing to current events in the Arab world. It was also very thoughtful of him to intervene in the presentations when class participation was at a low. There are also many good things to be said about the progression of the course -- it seemed continuous on both a thematic and a temporal level, so it was easy to follow the discussion and move from one reading to the next. If it matters, I especially appreciated the Tareq Ramadan reading.\n*He deserves a gold nugget\nWorkload:\nFair amount of reading for a senior seminar; one 25 pg paper due; one in class presentation where you led the discussion on the readings; the outline of the paper is due first week of March. Very fair\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "December 15, 2013",
            "review_content": "\nI feel strange about this class - it has a lot of different things going for it. The material is interesting and very relevant. I felt embarrassingly underinformed about the region and left with a fairly good base of (very important) knowledge. Khalidi's lectures are engaging and he is clearly very passionate about the material. Still, because of certain structural issues with the course, I can't really recommend this course to anyone.\nThree major problems I had with this course:\n- In lecture, we were taught to treat things with a certain amount of subtlety - \"The Middle East is made up of different countries with different histories\" \"Political Islam can take many different forms\".  But then we it came time for the midterm and final, we were presented with ridiculously broad questions you couldn't even write a PhD thesis on - \"What happened between Europe and the Middle East during the 19th century (talk about economic, political, social changes)?\"  - 5 pages. \"What's going on with oil in the Middle East after WWII?\" - 6 pages. My instructor berated people for not having clear theses when it was evident that there was no way to tackle these issues without purposefully leaving a great deal of material out. \n- For that matter, TA sections were not just bad - they were disastrous. My TA was unacceptably unprepared and almost incoherent in my section and I received my midterm grade nearly a month after my friend received hers. The same friend told me that her TA instructed them not to use the lecture material in their midterm/final responses because \"he didn't attend the lectures\". Another friend showed me a hilariously supercilious email her TA sent her section. A really good discussion section could have been truly helpful - Khalidi's lectures give you a basic framework but don't detail many specific events (they also lagged the readings by quite a bit) and the readings don't always match up with each other. Unfortunately, my section was useless.\n- I am not a history major and it appears a very intelligent person below has detailed their own reservations in that regard. I will say this though: the readings felt strange to me. They are extremely synthetic texts, you will never really deal with a primary source document in this class. Again, the person below speaks better to this than I can - but as a non-history major, I felt that I was never really thinking throughout this course since I had spent the entire semester effectively \"taking someone's word\" for vast swaths of history.  Again, this makes writing papers complicated - since the best you ever can do is just to recapitulate someone else's reading and say \"Well, Rogan says that this happened.\"\n\nWorkload:\nMidterm and final, TA section participation.\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "July 02, 2011",
            "review_content": "\nThis is a caution to anyone considering this course. Note, it is not meant to deter students from enrolling in it. Altogether, I think it was a valuable class that I do not regret taking. The point of what follows is to offer constructive criticism and to make sure that students have some helpful expectations and mindsets before they go in.\nOne of the problems in many of the History department's regional surveys -- history of the modern middle east, the modern Caribbean, etc - is that to square the breadth of the subject matter with the time constraints of a lecture course, instructors tend to prefer secondary survey texts over primary documents. This can happen to reading lists and to lectures. In a class with a more focused topic, many lecturers scatter primary materials to demonstrate the process of writing history and the idea that history is a continuing argument. In regional classes, lectures tend to be more like an oral textbook, simply providing the narrative that the lecturer prefers. For those considering Khalidi's course, be advised that it leans very heavily towards the \"secondary\" side of the spectrum. The reading list was exclusively secondary texts, and the lectures were exclusively his narrative. \nWhy does this matter? For one thing, the appeal of a history course on the Middle East is that it could enlighten very difficult political conflicts that are rooted in blurry and challenged readings of the region's past. The problem I had with Khalidi's lectures, and with several of the texts he chose, is not that they were one-sided (history is an argument and the writers will inevitably land on a side), but that they so insistently failed to attend to the other side. Khalidi (and Rogan and Gelvin, who are the principal textbook authors on the syllabus) are very good at assertion. Khalidi's content presentation is impressively incisive, but also, on occasion, disputatious. And a common vibe I felt - and explicitly observed in others leaving the room - was confusion about whether we had just witnessed a history class or a polemical diatribe. Very rarely would you encounter -- in either the texts or lectures -- phrases like, \"one might reply that,\" or \"to this view some have objected that,\" or \"those who disagree with me on this issue point to the...\" or, \"this is just my view; if you want to compare it with a different one, you could read....\" Without these nods to the bare existence of disagreement, of the fact that Khalidi's is just one of many perspectives, one feels more inclined to ask, \"how is he so sure?\" and one cannot help wondering if such a confident aura of certainty has any relation to Khalidi's active engagement in the politics of the region right now as a commentator. This is not to say that these engagements are wrong or inappropriate, but only that a professional historian should be sensitive to the challenges they can pose to impartial research and teaching. \nI am sure that admirers of Khalidi who read the last sentence will respond something like this: \"No historian is objective; objective history is a myth; and you are faulting him for not doing something that is impossible for any historian.\" I would concede the first two of these points, but not the third. I am not faulting Khalidi for not being objective nor am I saying that fully unbiased history is possible. But that is is not the issue. The question is whether, admitting that we will never completely suppress our biases and interests when we do history, we *still try* to be impartial, conscious of multiple perspectives, and sensitive to the dangers our own interests may pose to our view of the past. This is the sensitivity I deeply missed in Khalidi's course, all of its many merits and his own eloquence, passion, and erudition notwithstanding. \nHow can this be addressed? First, Professor Khalidi could add uniquely controversial primary documents to the syllabus, and advise students to read these documents before they read the secondary interpretations of them. In lectures, he might spend five minutes showing that the documents have been read and used in more than one way. Second, in each lecture, he could spend five minutes pointing out one alternative interpretation to the narrative he had presented, and explain why he had rejected it. Third, he could more explicitly map his \"suggested reading list\" and the texts that he writes on the board during class to point out perspectives that substantially differ with his own. Fourth, he could emphasize explicitly - say it out loud - that his is one view among many and that students should actively question that view. One might object that the breadth of material in a class on the entire Middle East does not permit these indulgences; there is too much to cover. First, as it is, the class still does not cover all the material and a course this broad will never cover \"all\" the material. Moreover, the gains to students' critical thinking, sympathy for opponent, and mindset about history which these changes can bring, will dwarf the benefit of a few extra factual details here and there. I believe that the best history courses do not teach facts and events, but how to deal with them critically. If you enroll in Khalidi's course, I suggest trying as hard as you can to make it such a course.  \nWorkload:\nMidterm, final, weekly section postings. Midterm and final are tough because you have to write very big topics into four page essays. \n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 19, 2011",
            "review_content": "\nIf you are interested in the Middle East, I highly recommend this class. \nProf. Khalidi is a wealth of knowledge, a great lecturer and a wonderful teacher. Beginning from the 18th century Ottoman Empire to the recent war in Iraq this class covers the political, social, economic, legal, and cultural modern history of Egypt, Turkey, Iran, Iran, Saudi Arabia, Yemen, Palestine, Israel, Syria, Lebanon and more. Its a lot of information, but totally worth it. \nGo to the lectures. The reading can be overwhelming, but Prof. Khalidi is very good at unpacking the material to make it comprehensible and entertaining. His classes are big and discussion sections are mandatory, so choose your TA wisely, since your grade completely depends on your TA.  \n\nWorkload:\nA lot of reading, but you do not have do it all. 20% discussion section; 30% take-home midterm; 50% take-home final. Both the midterm and final consist of answering 2 questions in 5-6 pages. \n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 14, 2011",
            "review_content": "\nIf you are interested in the historical roots of issues in the Middle East as well as events in the Middle East today, you owe it to yourself to take this class. \nThe first half of the course is taken up by the history of the late Ottoman Empire, which doesn't seem all that relevant to the modern Middle East, but stick with it. In many cases, the Ottomans are more relevant to modern issues than they may seem at first. After the midterm, the course moves slowly toward the present. Khalidi often gets bogged down in issues of Nationalism and the Mandate system. Don't get me wrong, these are important and very relevant to the Middle East today but I would have preferred if Khalidi had covered more of the things in the assigned readings in lecture. To Khalidi's credit, at the end of each lecture he leaves 15 or so minutes for people to ask questions either on the lecture material or on events in the Middle East today such as the \"Arab Spring.\" We ended up talking a lot about current events in the Middle East. Khalidi has mentioned that he will continue this practice in the future.\nKhalidi himself is an excellent lecturer at the top of his field. As other reviewers have noted, he sometimes pontificates about the news media and their horribly inadequate coverage of pretty much everything in the Middle East. Most people in the room probably agree with him, so he's basically preaching to the choir. I enjoyed going to class when I could drag myself out of bed at 9 AM. You can get away with not going to class sometimes so long as you do the readings, but you'll want to go to class as much as you can.\nAs for the readings, they are hit or miss. Some are fascinating, like Rogan's The Arabs. Others are incredibly dry and border on irrelevant (I'm looking at you, Modern Middle East Reader). Sometimes the readings basically repeat themselves so you don't always have to do them.\nThe worst aspect of this class by far is the required once-weekly 50 minute discussion section. I rarely had questions (readings and lectures explain things pretty well). I was never really sure what I was supposed to get out of it. Still it was only a minor annoyance \nThis was easily one of the most interesting classes I have ever taken at Columbia. It is easily one of the best Global Core classes out there.\nWorkload:\nVery little. 150 pages or so of reading a week, sometimes less. Easy to keep up with. Take-home midterm and final. Midterm is 6 pages (you get 4 days), Final is 12 (you get a week). Grading seems to depend on how mean your T.A. feels that day.  \n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 14, 2011",
            "review_content": "\nKhalidi's class was throughly enjoyable and I learned a lot. I didn't know very much about the Middle East before I took this class, and now I feel solid about my knowledge about the region. Khalidi is a great lecturer, but he does go off on tangents and ramblings about certain issues. He can spend what feels like fifteen minutes emphasizing one point. It was also interesting to hear what he thought about the Arab revolutions and how he incorporated that with what he was lecturing about during the Spring 2011 semester. I honestly would not mind taking the course again in the Fall just to see how his opinion and events may have changed. Khalidi is also willing to talk with you outside of class to go over material that you didn't understand or even just talk about current events, so definitely take up the opportunity to do so!\nFor section, Omar had us write weekly discussion posts that he called reaction papers for the readings, and for that reason, I did the readings. Maybe you could get away with not doing the readings, but to me, it seemed like something that would be difficult to write if one had not done the readings. But otherwise, Omar was good about summarizing the readings and we usually had interesting discussions about events relating to Middle East as well as our opinions.\nWorkload:\nReadings, take home midterm and final.\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 20, 2008",
            "review_content": "\nKhalidi repeats himself a lot and often becomes visually frustrated in class since this topic is so often misunderstood and even distorted within American culture. That said, his lectures easily kept my attention, though they didn't cover that much material. The readings cover a lot more, though if you don't do them you will not be entirely lost since Khalidi makes very clear his focus during the course -- his pro-Palestinian stance and his insistence that pundits on the news have no idea what they are talking about. By the end of the class you will probably agree with him about everything; otherwise you probably came in agreeing with him without even knowing it. He's an excellent professor. And his class is easy, informative, and highly relevant to not only the world we live in today but also the studies of any history major.  \nWorkload:\nAverage amount of reading, probably about 150-200 pages a week, but you only have to do about half of it since two of the books say the exact same thing. One midterm, consisting of two 3-4 page essays, and a final consisting of two 4-5 page essays. Discussion section. Easy easy easy\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "June 05, 2007",
            "review_content": "\nThis class was good but not great.  I took the class with no knowledge whatsoever of the history of the Middle East, and left with a relatively better understanding and an inspiration to learn more.  Some of the material was thrilling, helping you to connect modern-day political and cultural situations with the historical background of the Middle East.  Other parts was less interesting and/or not fully explained (for example, I left the class with almost no understanding whatsoever of the Iranian Revolution, although it was supposedly covered in the class).  The lectures were hit or miss, and the fact that they were at 9:10 didnÂ’t help (though Khalidi acknowledged at the beginning of the semester that he would have changed the time if possible).  I think a lot depended on your TAÂ—\nmy section was a complete joke and added nothing whatsoever to the class, while I often heard that other TAs led difficult discussions and had really hard grading standards.  Fortunately, the midterm and the final were both take-home which was helpful both understanding- and grade-wise.  Overall, if youÂ’re interested in the subject and can hack an early start time or some dry-ish lectures, IÂ’d recommend it for an overview of the topic.  If youÂ’re passionate already about issues facing the Middle East, perhaps take a seminar that will provide you with a less general curriculum and a more stimulating discussion.\nWorkload:\nTake-home midterm and final that are easy to do well on if you just work.\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 13, 2007",
            "review_content": "\nThis class was very ordinary and unexciting. Khalidi is a decent lecturer, and he is even eloquent sometimes, but overall he never really presented any kind of unique perspective. Most of the readings were very weak--more what you'd expect in a PolySci class rather than in a history class--and its pretty clear that Khalidi didn't put much time into organizing a really great reading list. Overall, pretty boring and uninspiring and not even particularly informative. On the plus side, its an easy A.\nWorkload:\nVery Light, even if you do all the reading.\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "June 05, 2006",
            "review_content": "\nAwesome professor with a level head and the best knowledge on the region and the current issues. \nON THE OTHER HAND......Make sure you pick your TA wisely. This will dictate your grade.  Take the stance of bashing the us government, capitalism, and the military  will score really well with the TAs ---If you write your midterm and final papers on topics and people which are vital to present day issues and you wont do that well.\nWorkload:\n6-8pg midterm8-10pg final - all graded by your TA\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 14, 2006",
            "review_content": "\nKhalidi is hands down one of the best professors at Columbia. He is an incredibley engaging lecturer, making his large lecture class really interesting. I learned alot. His seminar was also good times. He's smart, he's interesting, and he's a cool guy. Take anything with him. He's great!\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 13, 2006",
            "review_content": "\nI found this class to be extremely overrated and quite possibly the worst history class that I've taken at Columbia.  First off, the reading was pretty bad - rather than us learning about issues in the modern middle east, all of the books were reactions to the issues so we had no overarching book that provided background.  Note, though, that the reading list changed from last year when everyone gave him solid reviews.  Khalidi as a person clearly has some major ego issues.  He started what seemed like every class by telling us how ignorant we were (because we don't read every f***ing newspaper on the planet).  Fine, we're ignorant because we don't read every local paper produced in the Middle East, but if he really cares so much about that then that should have been our reading and not the crap that he assigned.  Furthermore, the books too kept going on and on about how ignorant the West is with rash overgeneralizations.  Another pet peeve was that every class started about 5 minutes late and then went over about 10 minutes while he opened it up to questions - which were always stupid ones asked by grad students who wanted to pat themselves on the back (and they have their mandatory section with Khalidi, so the questions could have waited).  Meanwhile, the class after us was waiting outside impatiently and causing traffic congestion, since it is in the big auditorium in IAB.\nThe lectures were informative at best, he was never very engaging.  Discussion sections were a waste of time.  I am usually a fan of these sections but all of the TAs for this class seemed to have major chips on their shoulders... \nmost of my friends had TAs other than mine and all of them felt like they weren't helping reinforce what we learned but rather tried to drive their own agenda home.  Also, since there was only a take-home midterm and take-home final, you never really reinforced what you were learning like you would if there was another paper or two.\nThe Modern Middle East is such an interesting and relevant subject, so it really sucks that the course could not be good.  I think that most students signed up for it because they had genuine interest in the subject (even though it is a Major Cultures course) but I was so taken aback by everything that I just lost all interest.\nI know this review sounds uber-bitter, but I did quite well in the course and still hated it.  Khalidi needs to get a lot humbler if he wants to relate to undergrads, spend more time teaching rather than denouncing us, and hire TAs that actually give a crap.\nWorkload:\nTake-home midterm (2 essays, 3-4 pages each) and take-home final (2 essays, 4-5 pages each).  Take forever to get graded.  Weekly discussion section.  About 150-200 pages of reading a week.  Don't be fooled by the take-home exams - the questions are extremely vague/general yet the TAs want specific answers... and on the final one of the questions was simply regurgitating Khalid's book.  No joke.\n"
        },
        {
            "course_name": "Orientalism and the Historiography of the Other",
            "review_date": "June 16, 2005",
            "review_content": "\nA brilliant class from a brilliant man. I have never seen a professor so deftly steer a conversation to include all sides of a debate and all aspects of a problem than Prof. Khalidi in this course. i don't know if he's still teaching it, but if so, take it. The books we read were provocative and interesting, and Khalidi cracked them open with ease. The only problem I had with his class was his reliance on student presentations - a common tactic in high level history seminars - which I hate in all forms. What do I care what you have to say? I dont - but I do like listening to Khalidi. Take this class.\nWorkload:\nRelatively heavy, with a 10 pager, a 20 pager, two or three presentations. The work can be fun if you invest in it.\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 13, 2005",
            "review_content": "\nIt sounds like Khalidi might be going to Princeton, but if he stays, and you want to take an intro course to the middle east, take this one--just amke sure george isn't your TA.  Khalidi is not the best prof i've ever had, but in the field, he's definitely leaps and bounds ahead of everyone else.  He moves slowly, repeats himself, and spends way too much time on the ottoman empire.I didn't love this class, but I'm glad i took it.\nWorkload:\nbunch of reading you don't really have to do, section, 5-7 page midterm, 8-10 page final.\n"
        },
        {
            "course_name": "Orientalism and the Historiography of the Other",
            "review_date": "August 30, 2004",
            "review_content": "\nProfessor Khalidi is an academic superstar and one of the world's leading modern Middle Eastern historians. Take advantage of his arrival at Columbia and take any class you can with him- there is no better professor to engage with on the Israeli-Palestinian conflict, Arab nationalism or Middle Eastern history. His seminar explored how history is written cross-culturally and had a remarkable book list. We explored Said's Orientalism, various historians/anthropologists who engage in the power/knowledge discourse and the perceptions of 'others' throughout history. Most of the course was student presentations, which fluctuated between well prepared and enlightening conversations as well as some disappointing let downs, a result of poor student preperation. Khalidi's perspective is remarkable, and his academic integrity is first class. Not one divisive issue was polemicized, and all topics were subject to rigorous academic debate. Regardless of his outside engagements and responsibilities, Khalidi made himself available at office hours and was extremely helpful and friendly on an array of issues. He is a passionate intellectual and a first class professor, and we could all use a little of his scholarship to get to the heart of the mess we find ourselves in when it comes to that region of the world.   \nWorkload:\n1 monograph a week, 2-3 oral presentations/discussions by groups of 2-4, 10 page review paper of three books from his booklist, 20 page historiography paper, no final. All graded with high expectations- don't disappoint him and you will succeed.  \n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 12, 2004",
            "review_content": "\nI took this class the first semester Khalidi taught at Columbia - Spring 04. \nKhalidi is an excellent lecturer (although at times he has a tendency to go out on fifteen minute tangents). This class will give you a great historical perspective of the region - from Ottoman times up to the present. He also provides you with background in Arabic intellectual and political culture which was both interesting and useful. Besides being very knowledgeable and honest about many potentially inflammatory topics, Khalidi's knowledge about the Middle East is truly world class. He lived in Beirut in the 1970's, is Palestinian, and has met some historic figures in person. Take this class it is well worth it. The required reading is very reasonable - One big thick book, three smaller ones and a handful of essays. If you want more he provides an exstensive list of optional reading.\nMy one complaint concerning this class was that my discussion section met about four times, so there wasn't much opportunity to process information. \nWorkload:\nMidterm and Final Essay. Both consisting of two five-page essays each. \n"
        }
    ]
}