{
    "prof_info": [
        {
            "prof_name": "Christopher Anderson",
            "prof_id": 3081,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 11, 2008",
            "review_content": "\nAfter a rough first semester CC swiftly became not only my favourite but also probably the most rewarding class of my Columbia experience.  While for the first half of the semester we followed the texts in a chronological order, by the second semester this was no longer the case.  Chris was a genius with his ordering of the texts, somehow all those dead white men really came to life.  Plus Chris stimulated some great conversation and class debate, this is the man if you want a really stimulating CC experience, no one else I know could get his class that riled up and excited at 9am.\nWorkload:\na few short papers midterm and final and two longer papers at the end of each semester, both self guided and great fun if you are willing to put the work in.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 18, 2006",
            "review_content": "\nChristopher Anderson is, succinctly, a gem of the core.  He's a grad student, but his teaching style surpasses many of the professors here.  He is excellent at leading discussions - he never feeds his opinions and makes everyone think, but still guides us to the topics (if not necessarily the answers) he had in mind.  He's passionate about the books we read (especially Hobbes), which transfers to the class.  I remember there was one day that we get so caught up in a topic that we spent the entire two-hour period discussing seven pages of Aristotle, and it was fantastic.  The class atmosphere is relaxed, comfortable, and safe for expression of opinions and disagreements.  What he lacks in experience and decades of expertise in the texts he more than makes up for in teaching style and classroom discussion.  HIGHLY recommended.\nWorkload:\nStandard for CC: 4 short response papers, one 5-7 pager, one 7-9 pager, midterm and final.  Reading assignments are generally shorter than for other classes but expect to go into detail.  Also expect wacky essay questions, his midterm essay has become a mini-legend.\n"
        }
    ]
}