{
    "prof_info": [
        {
            "prof_name": "Jeffrey Milarsky",
            "prof_id": 1375,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Conducting Music of Our Time",
            "review_date": "April 13, 2011",
            "review_content": "\nJeffrey Milarsky very possibly is the best professor I've had thus far. Constantly enthusiastic and inspiring, he brings out the best in those he leads and teaches. \nIn the classroom, he adopts a policy which centers more on how much you put into the class--as a previous reviewer said, the more you put into it, the more you'll get out. This is not at all to say that he's a passive educator. He's extremely willing to help and more than happy to encourage personal initiative and educational exploration---great qualities in a professor, in my opinion. \nAside from his exemplary teaching ability, Professor Milarsky demonstrates a deep understanding of music itself, especially in terms of the composer at hand. Further, he has demonstrated a strong understanding of instruments in the orchestra, their functions, and their compositional roles, and uses this knowledge to more deeply connect with both the musicians in his orchestra and those he teaches in the classroom. His conducting technique is impeccable--clear and yet extremely expressive--and his podium style is both authoritative and kind. As an orchestral musician myself, I've developed a deep respect for Professor Milarsky's ability to be a diplomat on the podium: encouraging rather than tyrannical.\nWhether you are thinking about taking his conducting class or joining the CU Orchestra, I'd highly recommend taking a class with this man, especially if you're a music major or concentrator. I'd go so far as to say that Professor Milarsky deserves a golden nugget on this website.\nWorkload:\nConducting class: depends on how much you want to get out of it. For my class, he expected us to learn a new variation of a piece every few weeks. A final conducting project at the end. \n"
        },
        {
            "course_name": "Conducting Music of Our Time",
            "review_date": "April 08, 2010",
            "review_content": "\nTake this class.\nYou will get out of it exactly the amount that you put in...you can show up totally unprepared, conduct, and get away just fine (conducting in the most basic sense is not terribly difficult and Jeff is a very easy-going, laid-back guy), but you won't get much out of it.  OR, you can really put in effort, study the scores, prepare exhaustively, come in, conduct, and get really fantastic feedback (and improve a lot as a result).\nNo matter what you do, it's a great opportunity.  All musicians should know how to conduct, and this is the only class at Columbia that lets you stand up in front of a pair of instrumentalists and do just that.  It's a great environment, especially if you've never conducted before - Jeff is very encouraging, very forthcoming with both compliments and constructive criticism, totally understanding of the fact that most of the students have never led a rehearsal before, and the whole situation is very relaxed and positive.  The students are enthusiastic about the work as a result, the pianists are really high-quality, Jeff is always excited to see what you've prepared and what you're doing, and everyone is happy to be there.\nThis is without a doubt the best class in the music department, and it's my favorite so far at Columbia.  You will regret it if you do not take it.\nWorkload:\nLight.  There's usually a pre-test at the beginning of the term (just to see where you stand in terms of vocabulary, etc.) and the possibility of a similar music-vocab quiz around midterm time.  The final consists of you conducting something that you worked on that semester.  There are readings, which are basically optional but very helpful if you do them.  Participation is really everything in the end.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 19, 2004",
            "review_content": "\nMilarsky is one of the best professors I have ever had. He is a passionate, lively and energetic person who communicates the subject matter really well. Music Hum. is a broad course that covers history of music chronologically from the middle-ages to nowadays. It might be hard to enjoy if the professor is not good. As an Econ major I feared this class was going to be a waste of time, but instead I discovered a passion for classic music. If I wasn't a senior I would have majored in music as well. Being around passionate people is what makes Columbia so special and professors Milarsky is one of them; his comments are original and interesting and he managed to get our brainpower even at 9AM. If you hang out in the back of the class he wonÂ’t ask you anything but youÂ’ll get into it anyway. He is also easy-going and open-minded and interacts a lot with the students while accepting every opinion.\nWe also had a great TA who plays violin and we had the school's Chorus sing for us. We saw one opera (Carmen) and the professor invited us to a really modern percussion concert he conducted. It was a really entertaining class on top of being culturally fulfilling and intellectually stimulating. I highly recommend Milarsky if he teaches Music Hum. again.\n\nWorkload:\nEasy. One midterm, one final, and one concert report (short paper), some listening in the music library, readings in the book before class. You'll need to attend at least one concert (you can go with your friends).\n"
        },
        {
            "course_name": "Conducting Music of Our Time",
            "review_date": "May 07, 2003",
            "review_content": "\nHmmm. I really enjoyed this class, because I had just about no experience as a conductor, and I enjoy exploring all aspects of the music world.  However, I have to admit that this is a *very* easy class. There are no written assignments or tests; you just have to come to class prepared to conduct portions of the assigned pieces (and basically all you absolutely have to know in order to do that is the time signature of each piece).  Nonetheless, the course is probably a good experience for any performer, because it forces you to get up in front of your peers.  Also, Milarsky's the nicest guy in the world -- it's definitely worth going to his office hour.\nWorkload:\nLight.\n"
        },
        {
            "course_name": "Stravinsky and Instrumentation",
            "review_date": "January 20, 2003",
            "review_content": "\nA really sweet shmoozy guy, but incapable of imparting anything useful. Is passionate and knowledgeable abour certain subjects, but on a very shallow level. Also frequently speaks non-sensically. Classes are a joke academically, so if you want to be challenged, take your brain someplace else. If you want to sleep through class or skip entirely, this is a safe, easy A.\nWorkload:\nAnywhere from one 2-page paper to two 2-page papers. Like a bad imitation of rigorous higher education.\n"
        },
        {
            "course_name": "Instrumentation",
            "review_date": "December 23, 2002",
            "review_content": "\neasy-going, relaxed, knows his stuff. passionate, even at 9 am. My favorite was when he gave us his critique on Eminem's movie. Take something with this guy--you'll enjoy.\nWorkload:\none quiz (yes, thats it)\n"
        }
    ]
}