{
    "prof_info": [
        {
            "prof_name": "Corinne Low",
            "prof_id": 12590,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "January 06, 2013",
            "review_content": "\nTake her for Econometrics if you can. Everything was manageable, she explained her everything pretty well. If anything look to the slides. She didnt rely on the slides til the very end, which at that point you breezed past most of the material on it to get to the examples. Many TAs so just shop around til you find whatever works for you. If you hated stats, the class is not much of a nightmare because you use a software (Stata) that does all the calculations for you. You just need to interpret the coefficients which the problem sets help you get used to and are explicitly explained in class. The lengths of the problem sets vary but are helpful and are easy points. Most of the class gets 9-10 out of 10 on them. She drops the lowest problem set. If you do the problem sets, study for the midterm for at least a day, you can get the average (which she puts around 70-75). She also gives 2 practice midterms. The midterm and final do take all of the time to complete. For the final, if you attend the review session, she tells you exactly what you need to study. Everything was fair. The final focuses on the material after the midterm and is only cumulative in the fact that you still need to know how to interpret coefficients and data.\nCorinne is a great TA, her review sessions and recitations were definitely helpful as she went over the important things and what the professor will most likely focus on.\nAttend recitations because they tell you the commands needed for Stata and how to get the results you want.\n\nWorkload:\n9 problem Sets, 1 Midterm, 1 Final\nFinal is at least 60%. The rest of the grade is determined by the highest between the final and the problem sets, and the final and the midterm. So there is a potential for it to count for 100% if you didnt do so well on the midterm and psets.\n"
        }
    ]
}