{
    "prof_info": [
        {
            "prof_name": "Pauline Yu",
            "prof_id": 2831,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Tang Poetry",
            "review_date": "December 27, 2007",
            "review_content": "\n\na really great prof if you're interested in the subject matter (I was). She knows the works in and out; if you're, say, an EALAC grad student fluent in Chinese, she will help you find the original so you can read those instead. If you know nothing about Tang poetry, like me, she knows the best translations and gives reading about the basics of Tang poetry and problems in translation. Even though I can only read a little Chinese, I felt that I gained a really good understanding of Tang poetry and the differences between translations and the original. She puts tons of related books on reserve so if you have extra time you can read even more poems. The class is pretty diverse- EALAC PhD candidates, SIPA/MBA students as well as CC students. Prof Yu makes sure that everyone learns from the class, and helps guide discussions. I learned a lot from my classmates too.\n\n\nWorkload:\nnot bad at all; the class is once a week and you get to discuss poems for two hours. 2 (originally 3, she cancelled one) short papers about specific poems (3-4 pages), one longer final paper (5-6 pages) that is a bit broader in scope. 50-70 pages of reading a week (sometimes more, sometimes less, but many of these pages had three-line poems on them); you don't really HAVE to do the readings (but you should if you're in this class), one 10 minute presentation on a supplementary reading.\n\n"
        },
        {
            "course_name": "Introduction to the History of Chinese Literature (Beginnings to 900)",
            "review_date": "January 17, 2006",
            "review_content": "\n\nThis class was a quite dry, I must admit, but it is helpful for people interested in majoring in Chinese literature.  The class offers a broad scope of literature, so it is good as a survey course.  Each class starts with 1 or 2 people \"presenting,\" which basically is their own interpretation of the reading and facilitating discussion.  Maybe it was just my class that was quiet, but just give your two cents during the class, and you've participated. Professor Yu then continues to delve into authors' background while much of the class remains silent.  Not a bad class to take for an easy seminar, if you're not afraid of being bored.  Professor Yu is a sweet lady, but the class was just not that riveting for me.\n\n\nWorkload:\nonce a week seminar, not too much reading ~50 pages a week, participation.  one posting on the week that you facilitate discussion/present.\nUndergrads: 2 papers, 5-7 pages (35% each).  Grads: Analytical paper (30%): 6-8 pages, Research paper (50%): 20 pages\nReading not totally necessary.  Easy grader.\n\n"
        }
    ]
}