{
    "prof_info": [
        {
            "prof_name": "Niels Ostbye",
            "prof_id": 137,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Piano",
            "review_date": "April 30, 2011",
            "review_content": "\nTake this course!!  Professor Ostbye is a wonderful man and piano teacher!  His conversation is charming, and his approach to teaching piano is methodical and organized without being painful, and encouraging without being stressful.    I already could read music (I played violin and viola for 13 years), so folk songs were an enjoyable and instructive way to learn piano.  Playing the piano has begun to reveal mysteries about music to me that I never could have figured out on a string instrument!  I certainly hope to continue my lessons next semester!  I absolutely recommend this class, even if just for casual interest!  \nWorkload:\nAs a beginner, we spent much of the time working on folk songs.  I don't know how he grades, but it doesn't really matter to me--I learned and enjoyed!\n"
        },
        {
            "course_name": "Piano Lessons",
            "review_date": "December 16, 2007",
            "review_content": "\nIf you ever played piano competitively before and were used to rigorous instruction, be ready for a humongous drop in pace.  At first, I was frustrated because I wanted somebody who was more demanding and would give me more challenging pieces instead of putting a Bach prelude in my hand and putting what I was currently learning (from my previous teacher) on hold.  I wanted to be able to perform and the pace seemed so slow that at times, I almost thought it was a waste of time.\nBut, the more lessons you take from Niels, the more that you realize that there are a few basics about music that you wouldn't have looked twice at before and that going slowly is actually beneficial.  Things also started to look up when I finally finished the Bach stage (which is personal preference, because as much as Niels tries, I will never fully appreciate Bach.  It's personal).  I started the semester feeling like I had fallen back a few levels to realizing that I learned more from Niels about music than from many of my previous instructors who focused more on getting a piece ready for competition than the actual history and musicality of the work.\nHe was also generous enough to find time to give me hour-long lessons, which I am incredibly grateful for.\nBasically, if you're looking for a hard-pushing teacher that will have you constantly preparing for performance, you should probably look somewhere else.  But, if you're looking for an easy-going guy who likes to discuss many things and will teach you an incredible amount about the history of a composer or the foundations of music - Niels Ostbye is a great choice.\nWorkload:\nIt really depends on you and how fast you want to go.  I went from practicing 2-3 hours a day to 1 hour every so often.  He will never yell at you and is generally understanding that the workload you're getting from other classes is ridiculous.\n"
        },
        {
            "course_name": "Piano Instruction",
            "review_date": "December 10, 2005",
            "review_content": "\nI thought I was a decent pianist, but after taking from Niels I was proven wrong.  Niels was patient and supportive every step of the way.   I practiced every day, yet I still didn't sound as good in my lessons as I did\nat home.  However, Neils never, not once, was condescending or berating.   He encouraged me to\ncontinue, even though I got frustrated.  Best of all, he\nshowed me a better technique.  We spent the  entire term  working on legatto.  What a difference it has made in my overall playing ability.  I can't thank him enough. \nBest of all, Niels is a sincere, compassionate, and genuine chap.  The gentlest of gentlemen.   He is that rare instructor that you cant wait to see every week.  He\nmakes your college experience worthwhile.  Take\npiano from him!\nhim\n \nWorkload:\nYou get out of it what you put into it.  Practice half and hour to an hour a day and you should be ok.  \n"
        },
        {
            "course_name": "Piano (beginner)",
            "review_date": "December 20, 2004",
            "review_content": "\nOne of those rare people that brightens your life.  We inevitably spend at least twenty of the thirty minute lesson just talking. Sometimes neither of us touches the keys the whole time. We discuss traveling, philosophy, history, music, whatever. Ostbye is brilliant, charming, kind, funny.\nAnd when it comes to actually teaching piano, he's patient, methodical, and motivating. All he wants from you is that you enjoy playing and that you play SLOW. He uses Bartok's Mikrokosmos for beginners, which is such a good way to learn that you can afford to spend the whole lesson talking. The Mikrokosmos practically teaches itself.\nWorkload:\nAs a beginner, I practice for about 20-40 minutes every night. Finding a free practice room can be a problem (in both senses of \"free\": unoccupied and free of charge).\n"
        },
        {
            "course_name": "Piano",
            "review_date": "May 21, 2004",
            "review_content": "\nNiels is a gem of a professor: he teaches you the piano according to what you want from the course, all the while the both of you sharing your philosophies and interpretations of music and how you see it intermingled with art in life. Not to sound too technical though, it is with great pleasure that I anticipate going to my piano classes with Niels. This class has served as a smooth balance to an otherwise heavy academic and active social life at Columbia. My only regret is that as a non-music major, I cannot take a  full hour of class. I highly recommend Niels as a piano professor. He is attentive, and he may likely inspire you to discover pleasure in music that you may not have experienced before.\nWorkload:\nThe course is catered to students who enjoy playing the piano, obviously. If you do, a few hours of weekly practice suffice. Other reviewers have mentioned that Niels may grade on the tough side. I cannot say that I agree, as I got an A, but I really enjoyed his class.\n"
        },
        {
            "course_name": "Intermediate Piano Instruction",
            "review_date": "December 25, 2002",
            "review_content": "\ngives really easy pieces and won't push you at all. tough grader but you have no idea what you're being graded on.\nWorkload:\nhalf hr lesson once a week, practice when you can.\n"
        },
        {
            "course_name": "intro to piano",
            "review_date": "September 24, 2002",
            "review_content": "\nhe's a wonderful piano teacher!! i dont' really know what the other teachers are like but this teacher has so many interesting stories and philosophies on life. he's a very gentle old man from norway that really enjoys the piano. \nWorkload:\nwhatever you want. \n"
        },
        {
            "course_name": "Introduction to Piano",
            "review_date": "August 11, 2002",
            "review_content": "\nAn excellent piano teacher, who unlike most others, is more concerned with what the student wants to learn for the term.\nWorkload:\nEntirely up to the student.\n"
        },
        {
            "course_name": "Introduction to Piano",
            "review_date": "August 11, 2002",
            "review_content": "\nAn excellent piano teacher, who unlike most others, is more concerned with what the student wants to learn for the term.\nWorkload:\nEntirely up to the student.\n"
        },
        {
            "course_name": "Piano Instruction",
            "review_date": "December 05, 2001",
            "review_content": "\nHe's an excellent teacher and he's got great stories to tell. Definitely one of the better instructors here.\nWorkload:\nThe workload is determined entirely by the student.\n"
        },
        {
            "course_name": "Piano Instruction",
            "review_date": "December 31, 1999",
            "review_content": "\nA very charming guy who is also an incredible piano teacher. Often disorganized, and bears a notable resemblance to Gargamel, but the good far outweighs the bad. The student really determines the speed and intensity of lessons.\nWorkload:\nstudent's choice; fair grader.\n"
        }
    ]
}