{
    "prof_info": [
        {
            "prof_name": "David Yerkes",
            "prof_id": 84,
            "total_reviews": 41
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 09, 2018",
            "review_content": "\nthe very best person, teacher and instructor you will ever encounter. Just wait and see!!\nWorkload:\nextremely light, no required readings, easy midterm, gives the prompt in advance. No one really knows how he grades the final, but don't worry, don't really need to study, just write something, and you will be fine. ! Amazing amazing amazing.!!!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 17, 2018",
            "review_content": "\nYerkes is a savage! You are not going to learn any Lit Hum with him, and that's fine, in my opinion. You don't need to open the books, unless you really want to read. I read as much as possible, but obviously 13 books a semester, is not very possible. Instead, Yerkes' approach, and his essays (he assigned 6) are 150-200 words, of something NEW and interesting. Focus on a word, an image something extremely specific, and do a \"close reading\", explain its significance. Ironically, you'll get a lot more out of this than doing the entire readings. Although he only assigned 6 \"essays\" during the semester, maybe forcing yourself to do one per book will prepare you for the final.\nRegarding exams, midterm is basically the same as the close reading essays we do, in which you take two texts and compare and contrast a very small aspect. Final, is the department final, which no one yet understands how he grades. He made it extremely clear that he doesn't care about the passage IDs. He doesn't care whether the identification is correct or false, and in fact doesn't even look at the answer sheet given by the core. Instead, he wants a good analysis. The remainder of the exam aligns nicely with the coursework he gives, especially the passage analysis essay, and the 3 novel essay -- as all the mini essays done gear you for this. Just go over the few essays you've written, and you'll be fine. All he wants, is something new, and interesting. Don't give him any of the AP high school bs, he sees right through it. Don't use fancy vocab either. As long as he likes the first line or two (in which you must present a clear argument), he'll probably stop reading your essay and give you an A or an A+.\nConsider yourself blessed if you get Yerkes. Easy A, easy 4 credits. \nJust don't take advantage of him. He is really cool, go to office hours, get to know him. Awesome guy, cares about his students, writes AMAZING letters of rec, though don't get offended as he does not recall names. \nWorkload:\ntypical lit hum stuff, no books added or cut.\n1 midterm (easy, in class essay, compare two books),\n1 department final (no one is sure how he grades...).\na bunch of mini essays, 100-200 word analysis. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 01, 2013",
            "review_content": "\nNote: This is (supposedly) his last time teaching Lit Hum, but much of this applies to his other classes.\nThis isn't your grandpa's Lit Hum. Unlike most, Yerkes spends a lot less time on the broad themes of the books and often goes line by line analyzing the language and style certain key passages. We would often spend an entire class on one page. Although this sounds painful, it really isn't - classes usually end a half hour early, and there's no real penalty for spacing out when he starts talking about gerunds. He often brings up background information about the books, and more importantly, allows for dissenting opinions and criticism of the books, as long as it was meaningful (ie. not \"God was really mean in Job!\"). Since he didn't force everyone to participate, I think a good third of the class said next to nothing all semester. I think in the end this had a positive impact on the quality of discussion and led to some genuine insights.\nThere were no readings added or cut out, but because of the way the class is structured, such as him telling us the essay topics before the midterms, and the extremely narrow scope of the paper, you can get away with doing maybe 10% as long as you have the writing skill to back yourself up, and still get an A/A-. As a result he can seem pretty unfair, since time devoted to reading doesn't necessarily correlate to a higher grade, so if you do all the reading and want to be rewarded for that, you're probably better off switching into another section. Some people find his pop culture references, bashing of other Ivies, and ego grating, but he tones it down as the semester goes on, since he intentionally tries to get people to drop the class early on to have a more intimate group that's more open-minded about his idiosyncratic teaching style. Overall, I'd say give him a shot - there's a reason he has such a cult following among humanities majors.\nWorkload:\nShort writing assignment or essay draft every 2-3 weeks culminating in a 5-8 page final paper, which isn't too bad, basically the equivalent of the third U Writing progression. The paper topic is pretty specific to the point of being inane though, so don't expect to get away with the typical broad, sweeping generalizations. Three exams where he tells you the essay prompts - no IDs, graded relatively lightly (average B+/A-). Overall less work than other sections (no quizzes or courseworks responses). Final counts for about 10% of your grade.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 03, 2012",
            "review_content": "\nIt's been three years since I took Yerkes' lit hum class, and as I near the end my time at Columbia, I find myself reflecting on the truly great experiences.  Yerkes' class was inspiring and memorable.\nThe man takes no shit, and he'll tell you it.  Columbia needs more no-nonsense people like Dave leading classes.  Your writing will improve, and you will think hard about the texts you read and about the choices you make here at school.\nTo Yerkes, it's not about doing a great volume of work--it's about doing quality work.  As he told us: \"take as few classes as possible.\"  That's why he assigns papers with low word counts, and that's why we never made it past the first page of a text.\nIf his class doesn't appeal to you, you ought to reconsider, and if it still doesn't appeal to you, you ought to leave that slot for another student who doesn't know yet what he/she is missing.  This was, indeed, the single best class I took at Columbia.\nWorkload:\nStandard reading, several 1-3 page papers, in-class midterm, and course-wide final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 19, 2012",
            "review_content": "\nI am so glad I was in Yerkes' class.  Like many have said below, it is like no other section, and when it comes to Lit Hum classes, not being normal is generally a good thing.  We were not subjected to a grad student working her way through the discovery of how she wants to teach.  We did not have to write responses on Courseworks or take reading quizzes to prove that we had a superficial understanding of what we read.  Instead, we didn't read, and worked from there, which led to a surprisingly interesting class.\nAs much as I loved it, I can think of a lot of reasons why you might not want to take this section.  As I said, it is not really Lit Hum.  For the most part, you will not discuss themes or plots or images.  The usual class was at least 75% Yerkes talking, with at least 75% of that being things completely unrelated to what we \"read.\"  When we did open the books, it was almost exclusively to look at the first page alone and trying to understand very specific word usage (Major Note: Yerkes' field is English Language, not English).  \nIf you're really into the idea of Lit Hum as it is presented by the admissions officers or tour guides, this probably isn't the class for you.  Yerkes hates Lit Hum as it exists now.  He correctly says that college students today cannot be expected to read a dozen books a semester and actually understand them, that we either try to read them, but do it so quickly we don't gain anything, or do not read them at all.  His solution would be to read one or two books over the course of the semester, but really read them and dig deep into them, rather than frantically hopping through the entire Western canon.\nThe class is built around the idea that you don't know anything, that anything anyone says has to be justified logically from the ground up.  Yerkes clearly hates when people use words they learned in AP English, because simply saying something is an example of synecdoche is meaningless if you don't know what the word is; he would much rather have you say exactly what synecdoche means and never use the word itself.  It is incredibly common for someone to begin talking and immediately be shot down for having an unclear idea or making a generalization that isn't true.  You are forced to think and speak precisely (using too many words is a cardinal sin), justifying everything you say with logic instead of your knowledge of AP vocab words.\nThere is so much more to say about this class, but I think there are definitely plenty of reviews below that pretty accurately sum up Yerkes and what he's about.  I can very honestly say that I loved this class and have no idea what I'll do in CC next year with a non-Yerkes teacher.  Even though we did not do Lit Hum the Lit Hum way, I still think we learned more about how to think than any other class did.\nWorkload:\nWildly inconsistent.  First semester was a handful of papers, each 1000 words with topics that your friends in other sections will laugh at.  We had a couple in-class writing days, but if I remember right, some weren't graded.  Midterm (similar to the in-class writing days) and coursewide final.  Second semester, instead of a handful of papers, we worked the whole semester on one 750-word paper (crazy), turning in some prelim work over the course of the semester.  We had FOUR in-class writing days, but no midterm, and the coursewide final.  Don't necessarily expect any of this to be the same in the future.  Oh yeah, and the readings.  I think the general trend was to do a good bit of the reading first semester (by and by, they're short enough to manage), but completely give up by second semester (I didn't read a single one, and by the end of the semester didn't even Sparknotes them anymore). I got A's both semester using this method.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2011",
            "review_content": "\nI suppose all of you will find yourselves drawn to Yerkes because you don't want to do the reading, and you do want a good grade. Well, then, you probably won't be disappointed, because he doesn't mandate that you do the reading--although when you don't do the reading you relinquish any control over your grade--and gives pretty good grades. The other posters are right about his non-sequitur-heavy class discussions that touch on NBC's comedy lineup, Matthew Arnold, and the Yankees more often than, say, Ovid. But who's Ovid anyway? It's a tolerable, and easy, class, especially if you don't want to do the reading.\nBut I think some of the kids in my class, certainly, were too cynical and allowed some of Yerkes' actually valuable lessons to drift in one ear and out the other. That is to say: you're wasting a spot in the class if you just want a gut course.\nYeah, the man might look checked-out, but he really isn't. Not in the least. He will press you to come up with original ideas, and maybe, just maybe, you'll realize that whatever academic malaise you've had in the past comes from parroting plot summaries. Seriously: I write good English papers now. And good history papers, all of them with original ideas that took me more than five minutes to come up with.\nAnd that's the lesson you get in Yerkes' class, even if you don't read any of the books. You'll learn to think, to come up with original, good ideas, and you'll question a bunch of stuff you thought you knew. Which, if you learn anything in this class, you'll find to be much more important and meaningful than knowing exactly what Iphigeneia morphed into. I think it was Tina Fey, maybe?\nWorkload:\nA few papers, a few in-class essays each semester. Assignments always make you think, although they never catch you off-guard. You don't have to do the reading, but you may want to keep up with it just to prevent finals week anxiety.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2011",
            "review_content": "\nThe negative review two reviews down is understandable. However, it was written at the beginning of the Fall semester, and Yerkes gets much better over time. He does go on tangents, he does often make fun of us (but only because he knows you can take it; if you can't, he won't be surprised when you leave), he does tend to rip apart our first essays of the semester, and he does pretty much think he's always right. But come on, the guy has been here for 35 years--he's seen and accomplished a lot.\nOn the other hand, in addition to what the previous reviewer said, Yerkes actually understands us as college students. He knows that even if he gives us a month to do a paper, we probably won't start it until the day before, and tries to prevent that by assigning an in-class draft. He put up a fight this semester to cut down the LitHum syllabus to 6 books, because he agrees it's way too much reading, which inevitably leads to cheating (sorry 2015, it didn't work). He spots the usual BS in an instant, and makes you be specific, clear, and concise. He actually values participation highly, and tries to push people to speak. \nAnother good thing is that if you get one or two bad grades, it doesn't proportionally bring down your grade for the class. He's fairly nice about grading in the end.\nIn short, he's an unorthodox teacher, but you can actually get a lot out of this class, just by listening to what he has to say. If not, well, the workload's relatively light.  \nWorkload:\nHe's not strict about reading the books; if he goes over them, it's about specific passages, or the first few lines (that said, try to read them anyway for the final). Second semester: a few papers (1000 words max), a couple in-class essays, midterm=in-class essay (not the usual format), final=same as other sections. Participating helps. For first semester, refer below. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 28, 2011",
            "review_content": "\nWords cannot describe how amazing David Yerkes is. Disregard all the comments below on him being disrespectful, as he is clearly engaging and truly listens to people if they are making an interesting point. There are no stupid questions but rather stupid people. Yerkes really makes his students think, choosing to concentrate on academic skills that will benefit students long after they forget all of the useless plot summaries from the dozen or so books on the syllabus. He not only deserves a silver nugget, but he should have a gold nugget. I honestly believe that my writing has improved substantially because of the focus and clarity that Yerkes rightfully demands from his students. Overall, he is an incredible and quirky instructor, that leaves his students to read at their own pace, but cares immensely for them. Besides this, he is hilarious, often bringing up crazy topics that really turn an useless class into one of the best english experiences I have had in a long time. \nWorkload:\nFew in class short stories, Midterm, Final, two or three (500 word) essays on topic of choice. Cuts books from syllabus. \n"
        },
        {
            "course_name": "Lit Hum/General Studies",
            "review_date": "November 11, 2010",
            "review_content": "\nHere is a teacher that will teach you how to really read a book, and how to really write a paper. It's not about regurgitating what the book says, it's about really taking the time to THINK. Will he pick on you? Yes. Will he read your paper aloud and mark it up inwith his red pen? Yes. But he won't say your name out loud. Will he go on long, pretty funny, tangents? Yes, he will. But I honestly believe that this method of teaching is better than if a teacher let their students spew bullshit. He cuts you off because what you're saying doesn't make any sense. If it does, and if you say it clearly and succintly, he'll let you finish your point. If you want to say mindless bull for the rest of your life, skip out on having him as a teacher. But, if you want to become a better speaker or writer, take Yerkes' LitHum class.\nWorkload:\n6 little papers (100 words max)\n3 big papers (1000 words max, 4 weeks to write each of them)\nin-class essay for the midterm, you know the topic of the essay two weeks before\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 15, 2010",
            "review_content": "\nI have never had a teacher as disrespectful as Yerkes. \nHe doesn't care at all what any of his students are saying (even though he claims that he takes us more seriously than anyone will ever take us in out whole lives), loves the sound of his own voice, and interrupts and nitpicks at anything anyone says until they don't want to speak anymore. He goes on endless tangents after (or in the middle of) every comment a student makes, most of which have absolutely nothing to do with anything anyone is talking about and are sometimes even semi-insulting to the speaker themselves. \nHe has no respect for the text either, constantly mocking the author and characters and, whether intentionally or not, acts as if nothing we read is really that great or important anyway. He constantly belittles and condescends to not only his students who are attempting to participate in \"class discussion\" (which is usually nothing more than him self-indulgently commenting on the half-made comments of his students and repeatedly coming to the conclusion that the original observation doesn't really matter or make sense) as well as the authors of the books that are supposed to change our lives.\nIf you want to do minimal work and stay silent with barely any problem take this class. But prepare to be picked on.\nWorkload:\nIt is pretty light compared to the other Lit Hum classes.\n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "December 24, 2009",
            "review_content": "\nI agree with the review below this one. While Yerkes is by no means a pleasant--or even an organized--man, there are significant up sides to the course and the man teaching it. First is the workload. Our exam's cancelled and there were only three short written assignments, all in all very manageable. Of the six courses I'm taking, Yerkes' hardly feels like a course.\nNow I do not recommend the course for someone who wants a broad overview of the history of the English language. Yerkes likes to skip around, pick on minute topics he's interested in, etc. By the last class, we only got as far as Shakespeare's sonnets. I myself knew a little about the topic, so I was able to benefit from Yerkes' insights. His ideas, abrasive though they may be, challenged how I view this field greatly. For example, I learned that Chaucer had no long vowels or iambic pentameter, there are many things about Shakespeare's language that scholars still do not understand, manuscripts aren't the easiest thing to browse through, and so on.\nLastly I want to give those considering his course a headsup. This man is very picky about what he wants to read. What he likes to read is anything that's not BS, anything with substance, an idea. Not that it's a bad thing. Throughout the semester Yerkes gave me a newfound appreciation of clarity and brevity.\nI'll end by saying that David taught me a lot about life, and man's place in the universe, and writing and shit...oh and I did learn something about that history of the English language.\nWorkload:\nLike I said, extremely light. Hardly any work on most weaks. Some reading that you'll soon realize you can do without. A typical assignment should take no more than one or two hours. You mostly go to class listening to Yerkes pontificating on a topic or tangent of interest to him. Grading can be erratic though, but I hear he rarely gives below a B-.\n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "December 22, 2009",
            "review_content": "\nNo bullshit. \nYerkes cuts the games and calls a lot of the whole act for what it is. This can seem abrasive but I  (without realizing it before) had been waiting the whole of my schooling for someone to sit there and tell me to cut the crap. Yerkes will hold you accountable for what you say and what you write. \nTo be really cliche but true, you will get out of the class what you put into it. The paper assignments have the ability to transform old ways of writing, thinking, and arguing, or you could throw something together the night before, though Yerkes will probably call you on it, read it to the class, and call you naive (*no names in the read-aloud but they can be amusing).  In sum, for me it really was one of the best courses I've taken at Columbia. \nWorkload:\nDepends on how much work you put into the assignments - entirely at your discretion but I would advise giving them time. It could make this course one of the few that you actually learn something lasting from. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 12, 2009",
            "review_content": "\nThe general consensus is--Yerkes is INSANE!!!\nThis is a fun class, in that most of the class discussions are about 30-rock, how we are all NAIVE, how words don't mean what we think they mean, and people no one has heard of who Yerkes thinks are really cool.\nAs has been said before--this class isn't Lit Hum--you don't really discuss the books at all, and what does get said is mostly developed in class by reading the relevant passages. No diagrams, vocab, history, context, or anything. If you don't read the books, you can get A'son all the papers and the midterm (I did) if you have good ideas (you know what those are, right?) and can articulate them CLEARLY. This is Yerkes' major goal--short and sweet, make your point and get out writing (opposite of U Writing). He does not suffer bullshit.\nAll in all, Yerkes uses the books as a jumping off point for tangential discussions such as manuscript errors, translation, OED, 30 rock, english language, novelists, etc.\nTowards the end of the semester he starts repeating himself (only after registration) making you regret reregistering.\nIf you don't mind being bored most of the time (no discussions, just him talking), got for it---easy class.\nWorkload:\nAmazingly light--a few papers (all t bullshit, you can get an A.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 20, 2009",
            "review_content": "\nLet's not mince words here; Yerkes is batsh*t insane. This is no hyperbole, people; the man is 3 ideas short of full on Asperger. A very \"unique\" mind...You'll see. \nThis is no traditional Lit Hum class. You don't have to talk for participation points (or at all, really), there are no Coursework postings, and perhaps most importantly: YOU DON'T DISCUSS THE BOOKS. It's the most baffling, initially awesome, thing ever. \nYou come into class with an 'idea' you had to prepare for discussion beforehand. Someone generally volunteers theirs and Yerkes just goes....OFF. He will talk about anything and everything going from tangent to tangent for about 80 minutes (short classes).  And then you're done. That's it. \nHe has a background in language so 90% of all academic discussions go into hyperfocus- analyzing one sentence/paragraph for the duration. And it's just him talking about celtic roots, old English and the likes. You get about one handout a week and it's....basically just paper for doodles (photocopies of old texts, Bewulf, etc to follow along).\nThe rest of the non-academic time (which is a lot) is divided into discussion of TV shows (30 rock to be precise), more tangents, and...arguments (actual 40-minute arguments with one student) about how college is useless and how we should go straight into the real world from HS. Yeah. With a few good gems for thought here and there (his approach to essays is to cut the verbose BS and basically the anti-UW. It's a good thing to know). \nYou get to know the people in class pretty well. A few stand-outs, lots of inside jokes, etc....It's a VERY leisurely class.\nSo during class you will generally alter from laughing to zoning out the window with your tongue out. No in-betweens really.\nTHE PROBLEM:\nYou're not gonna have any incentive to read the books. None whatsoever.  You don't discuss them, you're not graded on them, so more than likely your energy will go to other classes. It's around finals you'll realize how fucked you are.\nEveryone else has pages and pages of notes, theories, concepts and observations on every book while you have jack (and having done nothing in class, you won't be able to recognize the passages on the exam from in-class readings alone). No review session, no practice, no mention of the exam whatsoever. Even if you're the most honorable student ever Sparknotes WILL become a part of your vocabulary.\nThe good news is that he grades it himself and even if you fail on paper (you have to be pretty daft not to be able to BS the passage analysis and essays) you won't fail the class. You just won't excel at it. In the end, it's a bit frustrating that you have very little theoretical knowledge of these books whereas everyone else knows them back-and-forth.\nSo bottom line: GREAT, extremely painless class to take IF you're gonna keep up with the reading on your own for the exam. It's hard but trust me you need to do it for the A- it doesn't give you anything in the class itself.\nA bit of a gamble for Freshmen I'd say. May want to stick to a traditional teacher for the first semester and enjoy this self-teaching vacation later in the Spring. \nWorkload:\nIt depends on his mood.\nIt's not mentioned in the course outline. No grade breakdown is given. \nYou'll get notices ahead of time for very short essays (600 words). Two or three.\nHe got sick of our writing (openly saying that he couldn't finish reading them- often stopping at the 2nd paragraph in markings) and canceled in-class essays in favor of....fictional short stories. Come to class and write a short story. Really. Anything you want.\nHe also canceled our midterm. For funsies. Gotta love Yerkes. \n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "February 11, 2008",
            "review_content": "\nSTAY AWAY. Terrible. I have no words (no thanks to Yerkes for improving my vocabulary) to describe my frustration in this class and with this detestable man. I am actually dropping the class because it is such an incredible waste of time. Any major worth her salt could do this work gagged, blindfolded, and asleep (which I nearly was in every single session). I thought I would get some insight into how language changes, how words are formed, and how things work, maybe some theoretical background; instead, I got Yerkes being an ass for an hour and a half while using that entire class period explaining how to look something up on the online OED. He thinks he knows more than anyone about anything and he is wrong, wrong, wrong. But what really did it for me was when he ridiculed Seamus Heaney's translation of Beowulf. If you don't know poetry, don't talk to me about language.\nWorkload:\nVery light with very stupid assignments sprinkled in.\n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "August 16, 2007",
            "review_content": "\nAs the other reviews will show, he can be a very polarizing professor. Some people love him and speak in class on a regular basis. Many others didn't even show up. Yerkes spends the period speaking coherently on one subject of the English Language but there was very little structure in his lectures or for the subject matter of the class. \nThe papers are really the only basis for your grade in the class. This can be frustrating: the papers have an abstract topic and he deliberately withholds any and all guidance on the papers. Mostly, he told us he just wanted us to \"think\"; no research, no regurgitating information in class. It's very arbritrary. No matter how thorough your paper is, it's really impossible to say what grade you'll get on it. \nAll in all, not a terrible class. Almost no reading, which is nice for an Enlgish major. But you've got to be able to write well, and work with very little help from the lectures or readings. \nWorkload:\nPapers, lots and lots of papers. Reading is completely optional and not particularly heavy. \n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "May 09, 2007",
            "review_content": "\nNEVER TAKE A CLASS WITH DAVID YERKES. This class was the bane of my semester. There was no syllabus. He had no lesson plan. The topics we discussed in class had no relation to the course description. I actually did not think it was possible to learn so little in a class. And I don't buy his pretentious claim that he was teaching us \"to think\": all classes should do that, but you first need some MATERIAL to work with.\nHis contempt for undergraduates is painfully obvious. The assignments were on the scale of linguistics thesis projects. He was basically so full of himself and so unwilling to have patience for us that he put practically no effort into teaching the class, and we learned correspondingly little. If you ever think of taking a class with David Yerkes because the course title looks interesting... please, please, at all costs, don't. This class was a sinister waste of time.\nI don't understand those people who think he's \"brilliant.\" They must like having absolutely NO structure or substance in their classes.\nWorkload:\nIn the beginning, he told us there would be a short paper every week and three exams... but because the syllabus was literally a blank piece of paper, he cancelled two of the exams, made up the first few writing assignments on the spot, and turned the rest of the small papers into two gigantic investigations of the technical aspects of Shakespeare and Chaucer. I spent 60 hours on the first of those alone.\nBy the end of the semester I couldn't bring myself to listen in lecture, as he dedicated this time to railing against the few authors he sort of assigned us to read. But if you don't go to lecture, you might miss a giant 60-hour assignment.\n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "May 09, 2007",
            "review_content": "\nNEVER TAKE A CLASS WITH DAVID YERKES. This class was the bane of my semester. There was no syllabus. He had no lesson plan. The topics we discussed in class had no relation to the course description. I actually did not think it was possible to learn so little in a class. And I don't buy his pretentious claim that he was teaching us \"to think\": all classes should do that, but you first need some MATERIAL to work with.\nHis contempt for undergraduates is painfully obvious. The assignments were on the scale of linguistics thesis projects. He was basically so full of himself and so unwilling to have patience for us that he put practically no effort into teaching the class, and we learned correspondingly little. If you ever think of taking a class with David Yerkes because the course title looks interesting... please, please, at all costs, don't. This class was a sinister waste of time.\nI don't understand those people who think he's \"brilliant.\" They must like having absolutely NO structure or substance in their classes.\nWorkload:\nIn the beginning, he told us there would be a short paper every week and three exams... but because the syllabus was literally a blank piece of paper, he cancelled two of the exams, made up the first few writing assignments on the spot, and turned the rest of the small papers into two gigantic investigations of the technical aspects of Shakespeare and Chaucer. I spent 60 hours on the first of those alone.\nBy the end of the semester I couldn't bring myself to listen in lecture, as he dedicated this time to railing against the few authors he sort of assigned us to read. But if you don't go to lecture, you might miss a giant 60-hour assignment.\n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "February 01, 2007",
            "review_content": "\nYerkes is out of his mind.  Papers every two weeks, arbitrary grading, unfunny pontification blended with generalized and sweeping statements he knows nothing about, and quirky old school ranting.  He says he wants you to think, but what he wants are lemmings.\nWorkload:\nInsane 1200 word papers every two weeks with no expectations or direction that leads to frustration and pain.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 12, 2006",
            "review_content": "\nYerkes is amazing.  You will not discuss the books, but it will be one of the best classes you take.  Don't worry about failing the final, he grades it and no one fails.  You don't even need to go to class if you don't want, but you won't want to miss his ridiculous  discussions.  Certainly one of the best professors at Columbia.    \nWorkload:\nMisterm (ours was cancelled), final, three papers (3 pages max.)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 12, 2005",
            "review_content": "\nI really don't know how to start this...Yerkes is everything said in the previous reviews and more...he is the most complicated creature ever. I really can't tell you how he became a professor. He constantly complains about how we write bullshit papers so he wrote on the same topic he assigned and handed copies to the class encouraging us to critique it. The problem is that we never got a word in because he smack it down believing that he was right in every instance....long story short, I showed this paper to my friends and they thought a student wrote it because it was SUCH bullshit! I never read for class but still got an A. Class is entertaining you don't have to read nor participate because Yerkes does most of the talking. You don't even have to show up every single time although you might miss out on a prize...I won a dollar for answering a question correctly. Overall this is an easy class to pass. And Yerkes' class is packed because its easy not because he is a genius. \nWorkload:\nFew papers throughout the semester. About one every two weeks, midterm (which he writes--he might even let the class pick the questions, piece of cake!), final \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 24, 2005",
            "review_content": "\nEXCELLENT class, charismatic and crazy man, and you walk away learning alot about how to think and write simple no bullshit papers. I agree with the other reviewer about how he reminds me the reason I went to college in the first place. Yerkes doesn't put emphasis at all on the contents of  the actual texts but on how to apply thinking. He is an absolute genius! too bad he doesn't teach CC\nWorkload:\n1-3 page papers twice a week on anything. don't really have to read the books since not really discussed too much in class. just sit back and enjoy\n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "April 06, 2004",
            "review_content": "\nyerkes is a brilliant man who takes no bullshit. he encourages his students to explore the abilities of their minds -- not their abilities to furiously scribble incoherent notes for two hours. his class is as stimulating as it is entertaining. the material is exciting, and he is absolutely engrossing, but without taking himself too seriously. he knows that learning is supposed to be enjoyable. \nsimply, yerkes reminds me of why i wanted to go to college in the first place. \nWorkload:\nas much or as little as you choose to make it. yerkes isn't going to force you to do anything. he respects his students enough to give them the freedom to make their own choices, and not to coddle them. as a result, you'll find that you WANT not only to do the work, but to go above and beyond his expectations. \n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "April 06, 2004",
            "review_content": "\nyerkes is a brilliant man who takes no bullshit. he encourages his students to explore the abilities of their minds -- not their abilities to furiously scribble incoherent notes for two hours. his class is as stimulating as it is entertaining. the material is exciting, and he is absolutely engrossing, but without taking himself too seriously. he knows that learning is supposed to be enjoyable. \nsimply, yerkes reminds me of why i wanted to go to college in the first place. \nWorkload:\nas much or as little as you choose to make it. yerkes isn't going to force you to do anything. he respects his students enough to give them the freedom to make their own choices, and not to coddle them. as a result, you'll find that you WANT not only to do the work, but to go above and beyond his expectations. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 18, 2003",
            "review_content": "\nThe man seems insane at first but you get used to him and although you really never discuss the books in class, you do learn other valuable lessons and most importantly HOW TO THINK.  He grades the midterm and final, so basically even though you write completely different papers for him than you would another teacher, he grades it so it doesn't matter.  His papers do require a bit of time even though they are short.\nWorkload:\nModerate: a 1-2 page paper every two weeks and midterm and final\n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "October 19, 2003",
            "review_content": "\nFlat out awesome. No pressure of grades here, just the pleasure of learning.\n"
        },
        {
            "course_name": "Intro to the Major",
            "review_date": "April 22, 2003",
            "review_content": "\nthe guy is brilliant. his gift for language is impressive--expect to write contemporary standard american english prose translations of shakespearean sonnets. also expect to lose every single argument ever brought up--he is convinced he is always right and there's no way to change it. yes, he's a cocky s.o.b. but again, he is funny as sh*t. expect to be amused and occassionally bored (to tears man, to tears!!!) as he often spends a solid hour on one sentence. you can come in stoned, just make sure you've done the reading, know whamean?\n"
        },
        {
            "course_name": "History of the American Language",
            "review_date": "May 28, 2002",
            "review_content": "\nI hesitate to even call this a course because it had no topic, no content, and really did not even require attendance. Lacking a syllabus and constructed totally of Yerkes' random comments, this course was a complete waste of time. He assigned 2 books, one of which he never talked about one. The other was used as a tool for Yerkes to talk about what a poorly written book it was and what an idiot the author was. In my opinion, Yerkes is, at best, a mean man, but more likely he suffers from some kind of diagnosable personality disorder. His grading was wildly inconsistent and had nothing to do with the quality of the work. He had his amusing moments, but mostly he was a total jerk. This man is a prime example of why professors should not be given tenure. He might be a good scholar, but he should be kept in a padded cell away from students. Now that the theory req. for the major doesn't exist, there is absolutely no reason for anyone to subject themselves to this torturous \"course.\" \nWorkload:\nA few in-class quizes(no studying required), several 2 pg. papers, and a final paper. Don't bother with the reading.\n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "May 12, 2002",
            "review_content": "\nFirst, a warning - I took this class many years ago (I'm an alumna who stopped in to see how my favorite professors are holding up), and so my information may be out of date and less useful. But I doubt it. Other reviewers are correct, you either love Yerkes or hate him, and you either find his lectures hilarious and illuminating or abusive and disorganized. In the interests of full disclosure, I loved him, and found this course very interesting and useful. He definitely appeals to a hard-core geeky element in the English language and literature crowd, and I would recommend the course (and taking it seriously) highly for anyone with an interest in doing work in Old or Middle English. However, for those indicating that he is a soft grader and that this is a lightweight, gut course, be warned - he is well aware that it is considered so, and every few years he gets fed up with people coasting through his class and turns on them. What this course actually teaches, for those who want to know, is the Oxford medieval literature graduate-level philology curriculum. I only realized this when I sat down to take the philology qualifying exam myself and discovered that it was a David Yerkes final. (And, based on this is course even more than my graduate tutorials in the subject, I did very well thank you, and thank you Prof. Yerkes.) \nWorkload:\nLight, as I recall. \n"
        },
        {
            "course_name": "History of the American Language",
            "review_date": "May 05, 2002",
            "review_content": "\nIf you like academic structure, don't take this class. Yerkes apparently does not believe in syllabi, and neither does he believe in having an overarching theme or direction for the course. His lectures, if they can be called that, are occasionally amusing but very anecdotal and disorganized, and he is often downright rude to people who ask questions or make comments. His grading is unpredictable, although he tends to focus on content rather than style, which can be either a very good thing or a very bad thing.\nWorkload:\nIn-class exams (no studying required), a few short papers, final five-page paper entitled \"The American Language.\" \n"
        },
        {
            "course_name": "Intro to the Major",
            "review_date": "May 02, 2002",
            "review_content": "\nWell, the other reviews are pretty true: you either love him or you hate him. Personally, I spent most of the semester unbelievably frustrated and angry - there's no structure to the course and he often gives student work vague grades - my favorite being the \"No Grade\" which means that he thinks that your paper wasn't deserving of a grade. Albeit it doesn't hurt you, but it is frustrating if you're the type of student to actually care. All of the classes are spent moving from topic to random topic - one day you'll spend an hour discussing where to put in quotes and another you'll be comparing the size and flow of different American rivers. Make sense? Not to me. But by midway through the semester I learned how to relax and let it go and enjoy the absurdity of it all.\nWorkload:\nA few 2-page writing assignments and 1 4-pager, plus some poems to read and 2 HUGE novels . . . but there's not too much accountability when there's no midterm or final and class discussions are about anything but literature!\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "April 23, 2002",
            "review_content": "\nCocky S.O.B., but absolutely hilarious. keep your mouth shut in class and watch him rip everyone else up. he's full of trivial knowledge and obviously is extremely well-read. not overly concerned with grades - seems like one of those anti-established education types (he mocks the college admission process constantly and always laughs at the 'importance' of gpa's.) likes to give out lots of \"n.g.'s\" (no grade) instead of anything lower than B-. in other words, he'll tear your first few essays to shreds, but won't really penalize you. yerkes recognizes that there's nothing that he really has to cover, so his discussions are based primarily on digressions that have little to do with the reading. you can get away with not reading the novels if you BS well enough, but you might like them. in general, class atmosphere is pleasant and relaxed for everyone except the person yerkes is making fun of. its a light class, worth taking if for no other reason than to be entertained. \nWorkload:\nshort (1-2 pg) essays every couple weeks, no tests at all. reading includes some poetry, shakespearean sonnets, and two novels (both very long): vanity fair and an american tragedy. \n"
        },
        {
            "course_name": "History of the American Language",
            "review_date": "April 23, 2002",
            "review_content": "\nHands down the worst class I've taken at Columbia. If you think a professor's job is to teach, avoid Yerkes at all costs. He has no lesson plan, no outline, no conceivable notion of organization and very rarely anything interesting to say. This is not a ling course, nor an English course, nor a history course. I'd classify it as a nothing course.\nWorkload:\nPeriodic in classes, final paper \"on anything pertaining to the American Language.\" thanks champ.\n"
        },
        {
            "course_name": "History of the American Language",
            "review_date": "April 23, 2002",
            "review_content": "\nHands down the worst class I've taken at Columbia. If you think a professor's job is to teach, avoid Yerkes at all costs. He has no lesson plan, no outline, no conceivable notion of organization and very rarely anything interesting to say. This is not a ling course, nor an English course, nor a history course. I'd classify it as a nothing course.\nWorkload:\nPeriodic in classes, final paper \"on anything pertaining to the American Language.\" thanks champ.\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "November 16, 2001",
            "review_content": "\nThis is a \"note to self\" course. After it's over, you say, \"Note to self: Don't take any more Yerkes classes.\" The most annoying thing about all this is that you either get a review saying how great he is, and i took this class based on one such review, or you get somebody, or many people, who says, \"Yerkes is a jerk.\" He is a jerk. Unless you are spectacularly good looking or naturally brilliant, you probably won't be getting an A from him. He once called a kid in my class \"the handsomest man in the world\" when making up a sample sentence during one of the many painstakingly boring grammar discussions. He is also bad-comment happy, so you'll find yourself getting C- comments, but a B for a grade, with no real explanation. He's full of hypocrisy, telling you that he really just wants you to \"be clear,\" but then dismissing your clear paper as \"too superficial and obvious.\" He'll run you around in circles while you try to figure out exactly what it is that he wants, but there is no CLEAR answer, which is a pain in the ass. He also wrote a few sample papers that he might have handed in, which we later picked apart as a class, which you might think would give you a better idea as to what to give him, but it only confused me more. I think i'm pulling a steady B from him, and i don't understand how anyone can call his class \"easy\" because it's the most emotionally exhausting and aggravating class I've ever taken in my life (with the notable exception of Joseph Massad's Israeli and Palestinian politics and societies, but that was still more educational and more pleasant than this). Yerkes really made me question becoming an english major; if this is the intro, i'd hate to see what the major actually is. don't pick him . . .\nWorkload:\nprose renderings of poems, a few 2 page papers, a few in class essay quizzes, not too much reading, and a final 6 page paper.\n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "May 10, 2001",
            "review_content": "\nA comical man. Alternatingly grumpy and cheerful, abrasive and sunny, you never know what's going to happen. I don't think he necessarily does either ... Be warned: History of the English Language is neither a History nor an English language course. Actually, Yerkes's goal seemed to be to train us to do low-level linguistic analyses on our own. That is, if he actually had a goal at all...\nWorkload:\nIght in-class exams which require no studying. Yes, that means that 25% of the class meetings are used to take exams. \n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "May 10, 2001",
            "review_content": "\nA comical man. Alternatingly grumpy and cheerful, abrasive and sunny, you never know what's going to happen. I don't think he necessarily does either ... Be warned: History of the English Language is neither a History nor an English language course. Actually, Yerkes's goal seemed to be to train us to do low-level linguistic analyses on our own. That is, if he actually had a goal at all...\nWorkload:\nIght in-class exams which require no studying. Yes, that means that 25% of the class meetings are used to take exams. \n"
        },
        {
            "course_name": "History of the English Language",
            "review_date": "May 10, 2001",
            "review_content": "\nA comical man. Alternatingly grumpy and cheerful, abrasive and sunny, you never know what's going to happen. I don't think he necessarily does either ... Be warned: History of the English Language is neither a History nor an English language course. Actually, Yerkes's goal seemed to be to train us to do low-level linguistic analyses on our own. That is, if he actually had a goal at all...\nWorkload:\nIght in-class exams which require no studying. Yes, that means that 25% of the class meetings are used to take exams. \n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "December 31, 1999",
            "review_content": "\nHis lectures vary wildly from terribly boring to engaging, though classes where he spends most of the time talking tend to lean toward the former. We spent one entire class discussing a misplaced comma and an uncapitalized 'i' in Great Expectations. The best classes were actually those that he spent sitting on the floor in the corner of the class, letting the students lead the discussion. Is often hilarious and talks a lot about his interesting career. Offers students money, which can be interpreted as hilarious or somewhat insulting. Not a difficult grader, but hard to predict. Though I mostly enjoyed the class, I feel that it was not an apt \"intro to english\" class. The topics discussed barely scratched the surface of the works assigned and I often left class feeling a bit cheated.\nWorkload:\nMostly easy. Some VERY short papers (2 pages), a couple poetry translations, and one 10 page paper. Only 3 books to read, only 2 discussed. Grades easy, if you don't rub him the wrong way.\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "December 31, 1999",
            "review_content": "\nIntro to the Major with Prof. Yerkes filled me with existential confusion--and not in the good way, either. Whether this was a factor of the class or of the professor, I'm not sure, but I have a sneaking suspicion that people in other sections had a far clearer sense of purpose and were happier people for it. What the hell was that class *for*? I have no idea. Prof. Yerkes is a fun and funny guy, although in class I often felt like he was trying to trick us, somehow. I definitely didn't get the impression that he thought we were anywhere near his level of native erudition. But he does tell good anecdotes.\nWorkload:\nPretty easy, although assignments sometimes had weird, seemingly arbitrary parameters that were nevertheless Very Very Important. A few very short papers, a few translations of poems (I thought they were mind-numbingly easy, but we spent *days* going over them), and an 8-10 page final paper (we got final grades so fast that I'm not entirely sure he read them). No mid-term or final.\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "December 31, 1999",
            "review_content": "\nYerkes is entertaining and frustrating at the same time. Above all he is weird, weird, weird. If you, for some reason, actually need to be introduced to the english major, do not take his section. If you are looking for a diversion, go ahead. His antics usually make up for the infuriatingly boring digressions that often occur. He WILL spend whole classes discussing punctuation and grammar. But then if you feel that you can really write, you might win one of the numerous cash prizes/bribes that he hands out as motivation (?) - from $5 to $50! The reading is fairly light...a few photocopied handouts, a few poems, and then two novels. The entire last month's class meetings are optional (most people showed up anyway) and consisted of him sitting, possibly sleeping, in the corner while the class discussed. This would go on until he would get bored and arbitrarily end the class. He's can be a tough grader at first, but doesn't count the first assignments - as many as the first three of four of them. There is a final paper, but he may or may not read them - honestly, i brought him a draft and he told me i didn't even need to finish it. Overall, an easy way to fulfill a stupid requirement for english majors.\nWorkload:\nSeveral short (1-3) page papers, one 8-10 pg. final paper, no exams.\n"
        }
    ]
}