{
    "prof_info": [
        {
            "prof_name": "Ian Halim",
            "prof_id": 3192,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 07, 2011",
            "review_content": "\nAs a person, Ian is incredibly nice. He genuinely cares about the students, and won't hesitate to sit with you after class to go over the material/go over your essay topics. He also answers emails/questions with extremely detailed responses. \nIan invites everyone to coffee after the Course-wide Lecture, and dinner at the end of semester (at Symposium). \nI think Ian is probably one of the better CC Professors out there. The workload isn't too heavy, and the class discussions are usually pretty interesting. I feel like as a non-humanities major, I was able to learn a lot from this class that will stick with me in the future. \n\nWorkload:\nLess than the usual CC class. 2 Essays, Midterm, Final\n"
        },
        {
            "course_name": "Elementary Latin I",
            "review_date": "May 19, 2007",
            "review_content": "\nIan's a fantastic teacher, extraordinarily patient and a very good communicator.  He really cares about the students and is ready via email or during his office hours to answer any question no matter how mundane.  He's also a lenient grader; he recognizes how difficult these language courses are and he gives his students every break he can.\nAbout the only thing I can say in the negative is that he is relatively inexperienced.  He is a teaching fellow and at times seemed to be adjusting to his position as much as we were as students to ours.  This is to be expected from a teaching fellow though and as such he is one of the better ones I've had.\nWorkload:\nHeavy, extremely heavy.  I don't think this has anything to do with Ian though; its the nature of the beast known as Latin.\n"
        },
        {
            "course_name": "Elementary Latin I",
            "review_date": "February 14, 2007",
            "review_content": "\nWhen things get out of hand in class, Ian, standing proudly before his disciples like a Roman emperor, gesturing as if delivering a great decree, orders everyone to \"decrease the mirth.\"\nFor it is difficult in this class not to be mirthful. In Ian's class, you will read of wretched slaves in futile love and women who seize men with swords. You will dress up as a famous Roman during Halloween and address the class in Latin. \nThat said (and partially because of it), Ian is, especially academically speaking, one of the best teachers I've ever had. No other teacher will go through your every homework with such thoroughness and painstaking care, correcting every mistake every time you make it. Even those who loathe Latin will admit that Ian is extremely thorough--in teaching, grading, evaluating, answering questions. And while his class plan is often right in the textbook, go to class for the rigorous practice and for Ian, for you are privileged to bear witness to Ian's life--every moment of it is epic. \nThe class can be difficult sometimes, but always engaging. Don't expect to learn to say \"How are you?\" and \"My name is so and so.\" You'll instead learn the vocabulary of war, death, treachery, poetry. Deal with it or just go fall upon a sword. This isn't French. \nTake this class. Latin is a challenging and impressive language, one that will shed light on all others, and Ian--well who am I to speak of Ian? Let the great poets of years  to come shower him with praises. \nWorkload:\nWeekly quizzes, 5-10 sentences to translate with real readings toward the end of the second  semester. Two fair midterms, a fair final. Generous with grading. Plenty of Extra Credit. \n"
        }
    ]
}