{
    "prof_info": [
        {
            "prof_name": "Elliott Cairns",
            "prof_id": 12935,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 25, 2014",
            "review_content": "\nA rather average experience, with one major exception: the assignments. \nElliott is nice, approachable, and generally enthusiastic. He's a graduate student and it's clear he's new to teaching, but mostly in a good way. His selection is heavily biased toward the romantic period: we spent as much time on the Romantics as the Baroque and Classical combined. The beginning and end of the course were disappointing, as we started with an \"elements\" overview that taught us little more than what \"homophonic\" means, and finished with three full sessions of watching \"2001: A Space Odyssey\" (including one after classes ended). In addition, there are a session, evening viewing, Met outing and long paper all dedicated to Puccini's \"La Boheme\", so if you- like me- don't like the opera too much, too bad.\nThe real problem with the class, though, was the assignments. There was an (ungraded) assignment for every class, involving things like \"charting\" pieces, identifying certain shifts in the piece, etc. They aren't bad in and of themselves, but they were very time consuming, and the consequence was that we heard relatively little music and spent most of the time writing about the pieces. Which is quite a shame. \nIn addition, there are a midterm (IDs, short questions), final (IDs, short questions, essay), short paper (3 pages) and long paper (6 pages on La Boheme). None of them are hard or overly long individually, but all together (what with the assignments every class) they make for a lot of work and studying for a 3-credit core class, especially considering how little music we actually hear. \nAll in all, not a bad class as such, and hopefully he'll change things around, but far from perfect. \nWorkload:\nParticipation: 20%\nAssignments: 10%\nMidterm (IDs, short questions): 15%\nFinal (IDs, short questions, essay): 20%\nShort paper (3 pages): 15%\nLong paper (6 pages on La Boheme): 20%\n"
        }
    ]
}