{
    "prof_info": [
        {
            "prof_name": "Oran Moked",
            "prof_id": 2279,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 10, 2009",
            "review_content": "\nExcellent experience with Oran. Class was intense intellectually but the atmosphere was relaxed if that makes sense. Good discussions, a lot of useful input and comments from the prof, but allowing everyone to speak up if they wanted to. Highlight was the reading/study guides he gave in the second semester before each class to help us focus on the key issues (makes a difference when you're trying to get through 50 pages of Rousseau and don't know where to even start). Another highlight: incredibly detailed comments on papers. If he thinks you're wrong or unclear about something he really tries to explain to you how and why, and most important what you could do to improve next time. My favorite class this year, no doubt about it. \nWorkload:\nTwo papers + two exams in the first semester. Three papers (no exams) in the second semester. Plus weekly responses. Every now and then he'd spice it up with something different, like asking everyone to prepare for a debate (not as intimidating as it sounds). Oh, and I thought he was a fair grader (I was happy, anyway).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 07, 2009",
            "review_content": "\nOran Moked is an awesome professor. He's very knowledgeable and well versed in the material, energetic, and so organized. He presented this difficult subject matter in a clear way that wasn't too simple or patronizing. He put a lot of effort into grading and for each paper he gave back very detailed comments with a summary of my arguments' strengths and weaknesses and how the arguments could be improved. It was really nice of him to take the papers so seriously and I feel it'll help me write stronger papers in the future. Go Oran you rock.\nWorkload:\nCC means a lot of reading, but for some of the classes he pared it down. One midterm, one final (not too hard), two papers. For one paper he let us choose our own topics, which was great. Plus short weekly responses to the readings.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 05, 2009",
            "review_content": "\nOran is great. I have been at Columbia for a year and a half but never before had a teacher that helped his students to the same extent. He really goes out of his way to help make the material comprehensible, even though some of it is damn hard. His demeanor is pleasant and unassuming, and he also made every effort to be available and accommodating. I really liked the way he connected between different philosophers and drew out the relationships between them and their responses to each other. Great experience overall.\nWorkload:\nTwo exams (open-book), two papers, very short responses on courseworks. Fair grader, not too easy not to harsh.\n"
        },
        {
            "course_name": "Aesthetics and Ethics",
            "review_date": "January 19, 2005",
            "review_content": "\nI was surprised to read the previous harsh review. Oran was a good\nTA. I actually requsted to transfer to his group midway through the\nterm (I was initially assigned to another TA) after hearing good\nthings about him from another student in his group. His discussion\nsessions were well-organized and interesting for the most part, and\nmy conversations with him during office hours were especially\nhelpful. He was also very generous with his time. He did seem a\nlittle inexperienced as a discussion leader, but nothing too bad.\n"
        },
        {
            "course_name": "Aesthetics and Ethics",
            "review_date": "December 20, 2004",
            "review_content": "\nI hate to be harsh on a TA, but I have to say that having Oran Moked for an otherwise incredible class was a disheartening, frustrating experience. He's probably a smart guy, but he can't express himself coherently and can't lead a discussion. He is absent-minded and confusing. Knowing that he and not Professor Goehr would be reading my papers was just depressing. \n"
        }
    ]
}