{
    "prof_info": [
        {
            "prof_name": "Lisa Trever",
            "prof_id": 13669,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Pre-Columbian Art & Architecture",
            "review_date": "October 22, 2020",
            "review_content": "\nAMAZING. Just amazing. Words cannot describe the amount of respect and admiration I have for Professor Trever. Taking \"Pre-Columbian Art and Architecture\" was easily one of the best decisions I have made in my college career. Professor Trever is always available, and truly makes you feel worthwhile. We aren't just random students to her - she makes a clear effort to get to know her students, and will call students by their names, even when the class is 70+ strong. It's professors like these who help you recognize your worth, even in small ways, at this institution.\nWorkload:\nReadings are not too long -- discussion every Wednesday in class. The midterm and final can accumulate a lot of images and terms, but is completely manageable if you pay attention in class and retain some of that information. Two (?) short papers that were close looking analyses of works at a local museum. Overall, not that much outside homework -- most of the material is focused in-class.\n"
        },
        {
            "course_name": "Pre-Columbian Art & Architecture",
            "review_date": "April 08, 2019",
            "review_content": "\nI *really* loved this class! Professor Trever is a brilliant educator and truly an expert in her field, who also understands the kind of workload students are under and really knows how to maintain students engaged. The readings are really helpful, I don't think I had a reading that I was not interested in. Professor Trever presents many perspectives and on Wednesdays many people would participate in the informal discussions in the last 15 min of class. \nProfessor Trever is not the type of professor who leaves everything to the TAs and just comes to class to give a lecture, she arrives early and stays after class if students have any questions, and she is really flexible if you cannot come to office hours. This was probably my favorite class in my two years here.\nTake ANY class with her!\nWorkload:\n1 2-3 page visual analysis essay\n1 6-7 page research essay\nWeekly discussion posts about assigned readings\n"
        }
    ]
}