{
    "prof_info": [
        {
            "prof_name": "Amy Offner",
            "prof_id": 2964,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Economic History of Latin America",
            "review_date": "December 27, 2008",
            "review_content": "\nShe's a very thorough TA, but I think she was a little hard on us.  I really tried hard to respond intelligently to the questions she asked, but sometimes they were just too hard, especially on Friday morning.  It's not that she's a bad person, she's just a lot smarter than most of us and she doesn't hide it.  I would say go with an easier TA if you have the option, but I think if you really want a challenge, go with Amy.  \nWorkload:\nDo the reading every week because she'll grill you with questions.\n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "October 28, 2006",
            "review_content": "\nThe first review was a bit harsh and unnecessary, true. The truth is, when you've got multiple TA's to choose from, you'd be better off choosing someone else. It's not that Amy's terrible, but why settle for her section when you could be in Ben Soskis's section, for example? Not mean, just somewhat unpleasant.\nWorkload:\nThe usual, same as other TA's\n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "July 28, 2006",
            "review_content": "\nI don't really understand why people feel the need to be anonymously vicious on culpa. So please just disregard the previous review. Unlike most grad students, Amy sincerely cares about the course material, the class and her students. She asked thoughtful questions and forces you to dig into the texts. Clearly, a lot of thought goes into her sections. When I asked her for feedback or advice, she was always helpful. Once, she stayed forty minutes after section (which was, tragically, at 8:00 on Wednesday night) to answer my questions and talk about my interests. Yes, she was intense, but face it, this is Columbia, we're all intense, and I would rather have a teacher who cares passionately about paternalism, abolitionism and Jacksonian democracy than a grad student who is totally blah. If you get Amy, you're lucky.\n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "June 21, 2006",
            "review_content": "\nShe's extremely intense, and seems to have had a difficult life, for which she vents her frustation in section.\nHer attempts at humor are really painful as well. School is hard enough, if there is any possible way to get out of this class then do it.\n"
        }
    ]
}