{
    "prof_info": [
        {
            "prof_name": "Robert Thomas",
            "prof_id": 2474,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "American Civilization Since the Civil War",
            "review_date": "May 20, 2006",
            "review_content": "\nI really don't think the previous reviewers have been very fair. Robert was not THAT bad. I thought that our discussion sections were quite interesting, especially because he worked hard to connect the historic material to current events. I will agree that yes, he is an annoying grader, but I think that he is suffering the most. For instance for one of our small \"spark\" assignments (basically a 5 paragraph essay meant to \"spark\" a class discussion on courseworks) he spent 3 sigle-spaced typed pages making comments, on a 1 page assignment I really spent 10 minutes on. \nIf you didnt know how to write a basic history essay coming into this class, you'll leave knowing how. If you already knew, then good for you but it is an important skill that no, NOT everyone in the class knew from day 1. So be patient when he takes 30 minutes explaining how to connect topic sentences to your thesis, it just might come in handy on the final. \nOveral, I think Robert is a decent guy who really knows the material. \n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 20, 2005",
            "review_content": "\nThe guy is self-obsessed, condescending, and way too sure that he knows what he's doing. The discussions always stayed shallow, and he chose favorites at the beginning of the semester, treating them as if they knew way more than the rest of the class (which didn't seem to be true). His grading is ridiculous--he doesn't take off for basic understanding or structure of essays, but rather for things like comma misplacement. As the previous reviewer indicated, he treated us like 7th graders just learning how to write essays, which was pretty aggravating. Much of discussion was taken up by his strict expectations of essay structure, his suggestions for study strategies (basically, predict what the test will be and write the essays at home), and his recommendations for actually taking the test (bring food, bring earplugs, etc.). I felt like I was in a Kaplan SAT course. Horrible TA who while not necessarily is going to turn you off to history, may very well turn you off to writing essays in general. \nWorkload:\nReasonable reading, weekly reading responses posted online, midterm, final, 10-12 page paper. \n"
        },
        {
            "course_name": "American Civilization to the Civil War",
            "review_date": "March 19, 2005",
            "review_content": "\nBy the end of the semester my discussion group would spend time both before and after discussions complaining about Thomas non stop. If you get this TA I would actually try to switch out, no matter how convenient the time is for you.  I wanted to be a history major and he was one thing that really turned me off to it.  He actually also made me extremely uncomfortable; he is on a power trip on many levels from his grading techniques to his basic relationships with students, which for me was bordering on unwanted flirtation. I got Bs on all my papers and he would MAKE me meet with him, then later changed my grades to As.  He's also not that intelligent to begin with and he's just ridiculously egotistical and power hungry.  Loves to hear himself talk, loves it when students are wrong, loves to give bad grades.  Try not to have him, but if you do you could probably prostitute yourself for a better grade!\nWorkload:\nresponse once a week, you can miss a few. Ton of reading for the class in general, but this didnt really add much to it. \n"
        },
        {
            "course_name": "American Civilization to the Civil War",
            "review_date": "December 19, 2004",
            "review_content": "\nRobert is the type of TA who can make or break a class experience, and in this case he breaks it. If you get stuck in his discussion section, he ends up grading every paper (there are 3) and your final exam, but don't think you can get away with handing in an A paper to this guy. Basically, he gives you a rigid outline of how a proper has to be written. in fact we spend most of our discussion sections talking about the structure of a good essay- consisting of a summary paragraph, thesis and supporting evidence- which is all fine, but every single topic sentence of every paragraph MUST relate back to \"key words\" in the summary paragraph. \nI feel like this is more like an English composition class than History, and he treats us as if we are eighth graders just beginning to write essays for school. As a history major i have written plenty of essays before, and i feel that i would have gotten all A's throughout the term if a different TA had been grading them. \nBasically, i thougth this class was going to be easy if you put in work, but i put in tons of work and got B's all the way through. Don't sign up for this class if there is a chance that Robert will be your TA\nWorkload:\nThree five page papers on books that are extremely boring, 1 final. BORING material, boring class. not an easy A either\n"
        }
    ]
}