{
    "prof_info": [
        {
            "prof_name": "Miriam Hoffman",
            "prof_id": 523,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate II",
            "review_date": "April 16, 2007",
            "review_content": "\nProfessor Hoffman is an extraordinary instructor. She will not only teach you Yiddish but she will also impart to you a real sense of the culture that inspired Yiddish. She is truly special.\nWorkload:\nHomework assignments and final.\n"
        },
        {
            "course_name": "Elementary Yiddish I",
            "review_date": "November 28, 2005",
            "review_content": "\nHave you studied another foreign language? If you're expecting a rigorous presentation with lots of coverage of grammar and frequent quizzes and tests, this class will be disappointing. There are no quizzes or tests, and Prof. Hoffman (in her own words) \"hates grammar,\" which becomes evident when her elucidation of rules winds up delucidating them. But if you're a motivated student, you can get a handle on grammar from the textbook, which is systematic and clear.\nThe other reviews are spot-on. She's the archetypal Jewish grandmother (more so than my own), and the class is fun and lightweight. It feels a whole lot like Hebrew School did when I was a kid: singing songs, learning the language without being hit over the head with grammar, and the teachers not feeling totally like authority figures.\nWorkload:\nTo get an A: light. To make an effort to learn the language: medium.\n"
        },
        {
            "course_name": "YIDDISH- ELEMENTARY",
            "review_date": "June 07, 2005",
            "review_content": "\nProf Hoffman is great. She is the sweetest little lady and so much fun in class. She starts the class off with a song and sometimes, if you're lucky, she'll tell you a story from her childhood. Also, ask her to bring in articles she writes for the Yiddish Forward and she'll read it outloud in class. \nWorkload:\nlight homework, no midterm, take home final\n"
        },
        {
            "course_name": "Introductory Yiddish I",
            "review_date": "January 03, 2005",
            "review_content": "\nProfessor Hoffman was great.  She was, as others have said, like your Jewish grandmother.  Beyond that, she was always willing to help and make sure that people understood material.  As an added bonus, the workload was light.\nWorkload:\nOccasional exercises from textbooks, take home final, no midterm.\n"
        },
        {
            "course_name": "Elementary Yiddish I",
            "review_date": "January 21, 2003",
            "review_content": "\nI agree with everyone - take this class!  Immersion in the Yiddish language is entirely possible through song, story, and conversation.  And Miriam makes sure that the culture that brought Yiddish to its greatest is not left behind.  \nWorkload:\nHomeworks (once or twice a week), 5 Yiddish movies to watch and review (you are given the entire semester to do so -- have a party with your classmates), take home final\n"
        },
        {
            "course_name": "Elementary Yiddish I",
            "review_date": "December 15, 2002",
            "review_content": "\nProfessor Hoffman is a great professor.  She is a typical Jewish grandmother type, and her class is really fun.  You actually learn the language, but you do it through singing songs and reading stories.    \nWorkload:\nnot at all bad-some short hw's, 5 movie reviews, and a take-home final\n"
        },
        {
            "course_name": "Elementary Yiddish I",
            "review_date": "January 17, 2002",
            "review_content": "\n!!!TAKE THIS CLASS!!! Miriam is easily the best teacher I've had so far. We open each class (meets 3 times a week instead of 5 like other first year languages), with a new Yiddish song. We spend about 20 minutes each class learning the words and the music. She brings in a recording of it and we all sing it together. We also read stories on culture and life. Very little grammar and whatever we do go through is easy to understand. She tells us stories of her life which are incredibly interesting. (Born in the Gulag, travelled West hitting every major country it seems before getting to the US. Was in Poland during the beginning of WWII). We went to see a Yiddish rock musical she wrote (yes, a Yiddish rock musical). She even went to a student's home and made latkes for us on the last day of class. If you're not Jewish, you're going to have some problems with the class but it should still be very interesting. You'll have so much fun singing the songs and saying strange phrases and curses, all with an easy A. TAKE THIS CLASS.\nWorkload:\nBarely any. A few homeworks now and then (basic conjugations or sentence making) and technically she collects them but she doesn't count it against you if you miss a couple. She does put good comments on them. A lot of in class work (reading, writing, speaking). NO TESTS NO QUIZZES. The only major grade is participation (don't worry about that, she loves you all) and the final (take home, you have a week to do it but she gives it out when the class still meets. She encourages the class to work together, gives examples for each section, helps us out with questions. 4 pages long...) Basically, an easy A and you'll love the class and the language/culture.\n"
        },
        {
            "course_name": "Elementary Yiddish I",
            "review_date": "December 31, 1999",
            "review_content": "\nTAKE THIS CLASS! If you have any interest in learning a slightly more off-the-beaten-path language such as Yiddish, go for it! You'll get way more personal attention from the prof as well as an enthusiastic class that actually wants to be there, instead of just fulfilling some requiremement. Plus Hoffman opens the day with a song and spends a lot of time telling you entertaining stories about her life. What more could you want? She's the bubbie you always wanted. Grammar lectures can get boring, but that's standard for any language class.\nWorkload:\nno midterm, take home final. Most homework is covered in class the day before it's due.\n"
        }
    ]
}