{
    "prof_info": [
        {
            "prof_name": "James Hannaham",
            "prof_id": 12257,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Beginning Fiction Writing",
            "review_date": "March 18, 2014",
            "review_content": "\nThe course had so much promise (brilliant syllabus). But Hannaham was utterly deficient in the classroom. One might quote him giving us free reign with our drills because \"this is art\"--and yet he was a stickler for archaic rules. Though I understand the impulse in a beginners' workshop to set guidelines, he did so in a disturbingly black and white way. It was hard to take him seriously after his wide-sweeping generalizations and restrictions in regard to grammar, style, and even content (no \"be\" verbs, no science fiction), especially in the context of creative writing, which, hopefully, lends for some subjectivity. Disturbing, on the same note, is anyone who can grade creative writing on a 5-point scale, based on what he personally deems to be \"effort\"--seems arbitrary to me, but maybe that's normal procedure. Most of all, he fostered a particularly negative workshop environment (all criticism, few suggestions). That air was icy! Though productive at times, it certainly wasn't supportive, and I know others felt the same. Just because a workshop doesn't throw around rainbows and compliments, doesn't mean it has to be cold. All this said, on paper Mr. Hannaham was insightful and meticulous--good editor, despite his being the worst teacher I've had at Columbia. But I suppose that's to be expected from a sundowning 45-year-old adjunct who got his MFA in the 80s.\nWorkload:\nDrills every week were actually very helpful. I would steal the syllabus and run!\n"
        },
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "April 11, 2013",
            "review_content": "\nProfessor Hannaham is one of those professors you secretly wish would tell the class \"Just call me James,\" but never, ever will. He definitely is of the mindset that experience makes the writer, and therefore everyone in this class has a lot to learn. He's not pretentious - just extremely sassy and not afraid to correct bad habits, which is a good thing as long as you're somewhat confident in your writing ability. This is honestly one of the best classes I've taken at Columbia so far, just because of the open, honest environment James was able to create within the class. I was a bit disappointed that we never had to revise one of our stories or do any shorter exercises, so the entire class grade was just based on 2 stories (an easy A, if you put in a minimal amount of effort). However, both from James' comments and reading so many other young writers' work, you will be able to get a lot out of this class as long as you put a lot in\nWorkload:\n2 stories (10-15 pages each) over the course of the semester, as well as weekly responses to the two stories submitted by your classmates. Also, supposedly, weekly reading, but it's never mentioned in class.\n"
        },
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "January 10, 2013",
            "review_content": "\nAlthough not outright unpleasant, and actually quite funny in person, James doesn't have a whole lot of insightful comments to make about your writing because as far as I can tell, he doesn't have any interest in the craft of writing itself. Intermediate Fiction was entirely directed by the class (with James poking his head in at awkward moments) but not in the productive sense. There was a required packet of reading that was never once opened, and he scores the two submissions \"like the AP,\" (that is to say out of 5) based on whatever internal logic he comes up with. If you are literate, Intermediate Fiction with him is a guaranteed A, but you will come out having learned next to nothing about fiction. He will give brief explanations of the very basics if he is absolutely forced, but at this level one should already know the difference between first person and third person without having to be told. He's a nice guy, just not the greatest teacher.\nWorkload:\nTwo graded workshop submissions that could be anywhere from 5 to 20 pages. Comments on everyone else's piece each week, which he collected but never looked at. Towards the end, I stopped handing them in to him to see if he would notice and I still came out with an A, which says that participation in the discussion is probably his main method of grading.\n"
        },
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "November 09, 2012",
            "review_content": "\nJames Hannaham is incredible.  You're lucky to be in his writing class.  He's a really intuitive reviewer of fiction work and quickly gets a grasp for who your voice is and tries to work with you in that context.  The first day of classes, he very quickly establishes the tone of the room: a community of writers who should be comfortable opening up and being genuine with each other, because their writing's about to get real and people have to feel comfortable discussing their work.  He's funny and nice and snarky and honestly just a great guy.  TAKE THIS CLASS.  You'll immediately get close to your peers and will find that it is a warm and academically challenging environment.  Seriously, I can't believe how lucky I am to be in this class.\nWorkload:\nfor intermediate fiction, 2 submissions over the course of the semester for workshop.\n"
        }
    ]
}