{
    "prof_info": [
        {
            "prof_name": "Stanislaw Wellisz",
            "prof_id": 370,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Economic Development",
            "review_date": "May 08, 2005",
            "review_content": "\nI think Wellisz is possibly the worst professor in the economics department. His lectures are unorganized, rambling, and unclear. At one point in his life, he clearly knew economics--he still may--but he is not able to communicate it in an interesting or effective way. He used vague and unclear powerpoint slides which did little to add structure to obscenely boring lectures. He covered topics VERY vaguely in class, and then expected you to know them in detail on the exams... which was particularly ridiculous because some of what we studied was not adequately explained in the textbook. The sad thing about this is that the subject matter (economic development) is potentially really interesting.\nThe biggest problem with this class is that the homework  and exams bore surprisingly little relationship to what we read or talked about in class. The exam was graded pretty harshly, and the final definetely asked a question or two that we barely touched on in class, the book, or anywhere... I advise you to stay away from his Economic Development class at ALL costs. It was an unpleasant, boring experience. Even if you are a good econ student, I guarantee that you will lose interest. Seriously, just stay away from this class; I am warning you.  It was by far my worst experience in the columbia economics department. \nWorkload:\n5 problem sets (20%), midterm (30%), final (50%). \n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "January 02, 2005",
            "review_content": "\nAlthough Prof. Wellisz is a very nice, and at times a funny man, he really should retire.  Classes, as people have noted before, are very boring and, I found, very difficult to stay awake in.  Things that he mentions in class are not very enlightening, and oftentimes one has heard them before in many other classes, such as game theory and macro economics, or simply by reading the newspaper every now and then.  That is why the class is particularly easy.  A few of the readings are very good; however, most are absolutely dreadful.  The reading list is really overwhelming, but don't let it be.  Skip all equations, anything that looks like a technical argument, and simply focus on the basic overview arguments (i.e., first and last few paragraphs of each paper).  For our class, he posted his notes online which may or may not be helpful.  If you attend class and are able to stay awake and focused on what he says, you may learn a few things and will have to cram a lot less.  However, it is really not necessary that you attend this class at all, except for exams--and many people didn't.  If you can learn things on your own fairly easily, it's probably a better use of your time to do the same, and never set foot in the class unless compelled by a test.\nWorkload:\nTwo exams.  Not particularly difficult.\n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "December 24, 2004",
            "review_content": "\nYes, professor Wellisz is a old man. But you will learn A LOT from him if you attend his lectures and listen to them carefully.  He has many interesting and funny experiences in political economy, having worked for governments in many different countries.  I would recommend this course for people looking for econ class with little math. \nWorkload:\nLight. No homework, but a lot of reading. Midterm 33% Finals 67%\n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "December 24, 2004",
            "review_content": "\nYes, professor Wellisz is a old man. But you will learn A LOT from him if you attend his lectures and listen to them carefully.  He has many interesting and funny experiences in political economy, having worked for governments in many different countries.  I would recommend this course for people looking for econ class with little math. \nWorkload:\nLight. No homework, but a lot of reading. Midterm 33% Finals 67%\n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "January 05, 2004",
            "review_content": "\nProf. Wellisz presents the material in a straigt forward manner.  Although he occasionaly provides mathematical proofs in class, you are not required to know it for the exams. He has a great depth of knowledge concerning the subject and makes the class interesting with real life examples of the subject matter. Prof. Wellisz is very approachable outside of class. The one problem with the class was that there was no text book and so it can be a little difficult to review for exams if you didn't go to a class.\nWorkload:\nLots of reading, but you don't have to do all of it. Midterm and final- not an easy A class.\n"
        },
        {
            "course_name": "Economic Development",
            "review_date": "May 19, 2003",
            "review_content": "\nAttending Prof. Wellisz's class is definitely a key point to this class. He has extensive knowledge and experience with economic development. You can get away without doing much of the reading by taking notes in class (if you can decipher all the handwriting), but the textbook is good source for this class.\nWorkload:\nMidterm and Final- (weighted 1/3 and 2/3)\n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "April 16, 2003",
            "review_content": "\nProfessor Wellisz is old.  But if you can hear what he's saying during class, you'll definitely learn a lot.  He introduces relevant and interesting material and presents in a clear and concise manner.  I learned a lot from this course and would recommend it to people at all interested in political economy.  The nice part is that although this is an econ class, formulas and long calculations are not necessary on exams.  Just know the graphs and the reasoning behind the various theories, and you're all set.  Professor Wellisz also encourages students to talk to him during his office hours, though sometimes I think he needs to turn up his hearing aid. I highly recommend this class.\nWorkload:\nA lot of reading, which seems even longer because it's dense econ articles.  However, wellisz basically presents the material in class, so you can get by with just skimming the reading. midterm, final, and optional paper (to raise your grade).  Seems like most people got A-'s or B+'s because the grading was at the whim of the TA.  Do most of the reading and you should be fine.\n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "December 31, 1999",
            "review_content": "\nYes, he is a dinosour, but he is very intelligent one. This is a really interesting class that actually begins to give you an idea why you are studying economics - besides getting a nice job and Goldman Sachs after you graduate. The readings are difficult but interesting but you can get by without them.\nWorkload:\n1 midterm, 1 final, both short essay based. You don't need much math here, though it can help.\n"
        }
    ]
}