{
    "prof_info": [
        {
            "prof_name": "Roderick Cooke",
            "prof_id": 3025,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French I",
            "review_date": "January 14, 2008",
            "review_content": "\nRod is a really nice guy who truly seems to want his students to succeed. He'll go over the same concept a hundred times if the students in the class don't understand it (which is sometimes helpful, and sometimes really annoying) and hardly ever gets frustrated. I learned a lot of grammar and vocab in this class from studying for the tests, which were based mainly off our textbook, but the class conversation often slipped into English, which I think probably hurt the potential to improve our conversational french. My main complaint is that nearly every day we did these inane exercises in the textbook (which even Rod seemed to think were stupid) that I think were a waste of time. Other than that, I liked this class and I would highly recommend Rod as a professor.\nWorkload:\nNot too bad- occasional quizzes, 5 tests, 5 short compositions and a (surprisingly difficult) final exam. Rod is a fair grader and will generally give you the benefit of the doubt if you have a test or two that isn't as good as your others.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "January 05, 2007",
            "review_content": "\nSimply the man.  Once you \"get\" his sense of humor he is absolutely hilarious and the nicest guy you could ask for.  His mother was French so he's been speaking it from birth and knows what he is talking about.  He is serious about helping his student learn French and lay a solid foundation, is a more than fair grader, and will quite often break out into English (very awesome British English that is) when needed.  If you get Rod, consider yourself extremely lucky.\nWorkload:\nNot too bad.  5 compositions, 4 tests, oral exam, oral presentation, and a final (all the French classes are the same).  I didn't open the workbook once outside of class and got an \"A\", but then again, I took a little French in high school.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 13, 2006",
            "review_content": "\nVery capable in the French language, as it his native language (even though he is from England), however, it would be hard to tell that from his classes, since he rarely speaks French.  A very down to earth guy, who we rarely stumped with translations (even for some of the weirdest requests).  Didn't encourage students to answer questions in French, which made speaking in French an odd thing to do.  If you're looking to get through your language requirement with an easy grade, than I would recommend Rod, but if you're looking to actually learn the language, a classroom with more immersion would be more beneficial.\nWorkload:\nStandardized French I workload -- Weekly quizzes, 4 tests, 5 compositions, oral test and presentation -- however, he is very relaxed about it, quizzes aren't too tough, compositions have very laidback deadlines, and he helps you with any question you have\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "November 12, 2006",
            "review_content": "\nNo complaints.  young british guy with a strange but enjoyable sense of humor.  nice.  makes pretty easy quizzes.  flexible.  grew up in a french-speaking part of england so he knows his shit.  dont be intimidated by his army-print pants.\nWorkload:\nfive compositions over the course of the semester and studying for tests/quizzes.  no need to do the nightly assignments, they're never checked and we do some of them in class after they were assigned as hw.\n"
        }
    ]
}