{
    "prof_info": [
        {
            "prof_name": "Jeffrey Brown",
            "prof_id": 4583,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 06, 2012",
            "review_content": "\nI'm a science major and LitHum was hands down my favorite class freshman year. Obviously all LitHum classes are a lot of work and Jeff really expects the entire class to do all the reading but it's worth it in the end. It'll help you stay awake for what might at first seem like a really tangential discussion but end up being completely mindblowing. He is undeniably extremely smart, funny in a kind of awkward but genuine way and humble (even though people might not think so immediately). Also, he makes a HUGE effort to get to know his students and make the class work. He met with us at least twice for 20 minutes individually in order to discuss our own progress, concerns, or suggestions for the class and tries really hard to implement anything we recommend. He plans a ton to make the class informative but also interactive and discussion based. Also if you have any type of concerns, he's super nice about coming in to see him during office hours or through email. And just to top off all that dedication, following every single essay we wrote, Jeff wrote an entire single-spaced page filled with things that we did well in our essay, but also things that need to be worked on. I'm not sure about other people, but Jeff was super specific about what he wanted me to work on throughout the year, and really helped and pushed me to do it throughout both semesters either through his 900 word emails or his lengthy office hours discussions. He also gave midterm reviews and finals reviews (with food!) for us and it was decently helpful though pretty long. Finally, like the other people said, go to the trips he plans! He'll be upset if you don't and they're definitely an experience that you won't forget. We were his first LitHum class so there were some kinks, but I think almost all of us (if not all of us) were incredibly sad that we couldn't have him again for CC.\nWorkload:\nFirst semester: 3 papers, midterm, final, weekly discussion posts (~200-400 words, not graded but required--he reads every single one of them and uses them in discussion), small extra credit paper that bumped your lowest essay grade up a notch, class participation counts for some small percent as well\nSecond semester: 2 papers, 1 group presentation (I think everyone did well), midterm, final, weekly discussion posts (same requirements), class participation\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 04, 2012",
            "review_content": "\nJeff is awesome. He adds things to the syllabus that add so much to the curriculum. Do yourself a favor: go on all of his weird excursions, because they're helpful, unforgettable, and really bring the class together. He is enthusiastic, funny, and really knows what he's doing, and by the end of the year, the entire class loved him. I really feel like I learned a lot in Lit Hum, and not everyone leaves freshman year feeling that way. \nWorkload:\n3 papers or 2 papers and a presentation, weekly discussion posts, and the required reading. Also optional but highly encouraged field trips\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 24, 2012",
            "review_content": "\nJeff really is great. I'm afraid we might be building him up too much, but it's all genuine enthusiasm. We really love him! He's funny, excited, young, well-read, approachable, witty, and willing to make fun of himself. He makes you want to do the reading because you don't want to disappoint him. He pushes everyone in class and doesn't let anyone get away with a half-baked generalization. Bottom line: if you get Jeff, you're a lucky duck, and your friends will soon be jealous of you. \nWorkload:\nweekly discussion posts (2-3 paragraphs), required lit hum reading, 3 papers first semester, 2 papers and a presentation second semester. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 26, 2012",
            "review_content": "\nJeff is truly an amazing teacher. If you find yourself registered in his class, don't even think about switching. His undoubted passion for literature coupled with an astonishing brilliance makes for a challenging yet rewarding experience. If you want to take lit hum, go through the motions, and put it behind you after freshman year, then don't take his class. But if you want your lit hum experience to help shape you as a person, a writer, and a thinker (as Columbia hopes), then Jeff is your guy. His youthful energy and witty humor will make the most boring classes a positive experience, and his high expectations for you will motivate you in new ways. He is always trying to improve as a teacher, so he is very approachable and open to suggestions or revisions to the class structure. Almost every class, we rush through the last 10 minutes to cover his lesson plan because he gets so immersed in discussion along the way. Do yourself a favor, and take lit hum with Jeff Brown. He loves the material and truly cares about his students. \nWorkload:\nstandard department syllabus reading schedule, but open for revision. 3 papers, and a weekly discussion post. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 31, 2011",
            "review_content": "\nJeff is such a fantastic teacher who truly cares about his students. He brings such enthusiasm to the works we discuss and provides for a very interesting and fun discussion. He is such an awesome teacher who will really help you develop your close reading skills as well as your writing skills. He's young, but brilliant and such an inspiring professor. If you land him for your first year, you are a lucky kid. Also, he's a very fair grader.\nWorkload:\nWeekly readings that are very manageable. 3 essays - a 3 page, 5 page, and 6 page paper. Midterm and Final.\n"
        }
    ]
}