{
    "prof_info": [
        {
            "prof_name": "Erik Gray",
            "prof_id": 2468,
            "total_reviews": 31
        }
    ],
    "reviews": [
        {
            "course_name": "Romantic Poetry ",
            "review_date": "September 28, 2017",
            "review_content": "\nI don't get it. At all. Cards on the table: my primary interest in literature (and the aesthetic more generally) is as a source of singular insight into an historical moment. This should not be mistaken for a vulgar \"sociology of literature\"--e.g., the literary critic who mines Pere Goriot for historical tidbits about the Bourbon Restoration in France. The insight the aesthetic gives us is much richer than this! Primarily, I think, because the aesthetic has to do, above all else, with form. I don't feel like elaborating my theoretical position here...but I only mention this to show that even I, a person whom some might derisively call a theoryhead, am interested, at the end of the day, in intense attention to the aesthetic aspects of a given text. Even when teachers shy away from the historical, the theoretical, etc., I can still find something incredibly useful (and interesting!) in a good elaboration of a writer's aesthetic choices, or a situating of this writer through genre, etc. \nErik Gray is thoroughly underwhelming even on this account. I really want to talk to the people who wrote the reviews below. Are they just easily impressed SEAS students? (Hope this doesn't come off as rude. Last semester, I was really impressed by a rather basic elaboration of Einstein's theory of relativity in an astronomy class. My friend, a physics major, probably wouldn't be. Nothing wrong with that. Our levels of specialization differ.) Or are they English majors who have been told so many times that Gray is the best professor in this department that they can only experience his class through, ahem, gray-tinted glasses? I really don't know! I'm so curious. \nComing out of his Wordsworth lectures, the only impression I have of this monumental poet is that he was obsessed with childhood and nature. (THESE ARE FIGURES. THEY'RE FIGURES. I mean, yes, Wordsworth did really like nature, but this obsession gives way onto a more interesting and complex ideological position. This isn't even contentious or my particular viewpoint! Read any basic Wordsworth criticism and you'll see what I'm talking about. The love poems of the metaphysical poets are not really about love. This is a basic point.) \nAlso, this is me just being petty now, but I hate the way he reads poetry aloud. It's so affected and precious and \"poet-y\". I don't know how to articulate this but it cheapens the poetry for me. Yes, poetry has its musical aspect, but that music can be teased out without this hammy reading of \"The Lamb\". But, like I say, this is a minor quibble.\nMost of his lectures lapse into vague, humanist language filtered through the \"concerns\" (scare quotes b/c they're not actual concerns) of these poets. Wordsworth is, like, you know, innocence is good, but, in time, you'll gain more from experience than innocence. Gee, that's a nice thought. Makes you think, huh? Wordsworth spent his entire life working on the Prelude and this is what he's reduced to. Pathetic.\nWhy am I so heated about this, you ask? Well, I find it embarrassing. I really do. I'd be embarrassed to have a friend sit in on this class and think, wow, this is what you do? This is what you study? Second, I was in a great class on Romantic Poetry with Ross Hamilton before this but had to switch out due to scheduling conflicts. I figured, everyone goes on about this Gray guy, I really like Blake and Wordsworth, I'll just hop on over to his section. Such a mistake. Such a mistake. This class makes me depressed. I go in and I can feel myself dissociating seven ways to Sunday because I am so overwhelmed by this intense feeling of dread stemming from the fact that I'm spending good time and good money to hear someone give this...Romantic Poetry TED talk. \nMaybe he will get better. I doubt it. \nUnless you're the kind of person who subscribes to this literature-cum-therapy view (e.g., it's important to read poetry because it can teach us how to lead better lives!, it can teach us about ourselves!, etc.), then this class really isn't for you. Even if you ARE interested in that (it's okay if you are, I think no serious English student should be, but for the dabbler, why not), there are people who do it much better. I'm not a big fan of Edward Mendelson, but at least HE does some actually interesting close readings even while subscribing to this kind of view.\nHow do I petition CULPA to remove this professor's gold nugget? I saw the person below talk about how this class is not for those interested in the \"sociological take on literature\" or whatever, more for the l'art pour l'art crowd, but it's not even good aestheticism! \n\nWorkload:\nVery light. Very few poems assigned each week. Two papers, one w/ a minimum of 1500 words, the other w/ a minimum of 2000 words. \n"
        },
        {
            "course_name": "Romantic Poetry ",
            "review_date": "February 12, 2017",
            "review_content": "\nThis man doesn't deserve a gold nugget. He deserves his own special nugget category of the finest, rarest, most powerful metal in the world. This was one of the best classes I've ever taken at Columbia, and he was one of the most compelling professors I've ever had. I'm absolutely indifferent towards poetry, yet Erik Gray made me relish it in ways I never thought possible. He's excellent at making the poems you read not only accessible, but more importantly, relevant.\nHis lectures are incredible. While questions are limited to the last 10-15 minutes, his lectures are so good that I didn't even want any discussion because I just wanted to hear him speak. They're arranged so clearly that at the end, everything comes full circle and you see how every point he makes fit into each other. He doesn't waste a single word. He doesn't veer into ambiguous, abstract concepts, nor does he get caught up in the nitty gritty details. I have never been so mind-blown so repeatedly in a class but this one. He has such an impressive way of phrasing his points in such an unexpected but intuitive manner, that when you hear them you can't help but immediately go \"yes, I know exactly what you mean, I just didn't know how to put it into words\" i.e., his opening line about grandmas and sex. It's mentioned somewhere in Bwog, look it up. He's also hilarious, has great comedic timing, and his passion and enchantment with the Romantics is infectious. I looked forward to this class every single day.\nI don't care what you study at this school, I don't care if you even go to this school; you need to trek up the 7 floors of Hamilton to listen to this man speak. Even for one lecture, because that's really all you need to get hooked. Erik Gray is indeed a god. I admit I totally sip the Kool-Aid, but that's because this Kool-Aid is probably the best and most justified Kool-Aid you'll ever drink at Columbia.\nWorkload:\nReadings: Several poems are assigned for each class, but you only really need to do the ones he cover in class.\nMidterm/Discussion Section (15%): I personally chose the midterm, which I preferred since that meant Gray himself graded my papers, rather than the TAs. Basically a shorter version of the final.\n2 papers (30%, 35%): Not difficult, you can pick a topic he provides or your own.\nFinal (20%): IDs, passage analysis, essay drawing upon themes & works of various poets. Also not difficult if you've been going to class & paying attention (which for this class, is the default). IDs are only on poems he's gone over in class, and he always gives you line numbers during class anyway. For the latter 2 portions, you should have a good understanding of the main Romanticism themes, but again not difficult to remember if you've been paying attention.\n\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "February 04, 2017",
            "review_content": "\nProfessor Gray has profound insight into poetry.  He communicates that insight in lectures which are fascinating, illuminating, and beautifully crafted.  Each point is elucidated clearly and flows logically out of the previous point and into the next point, so that the listener is transported by the argument.  By the end of the lecture, a poem or poems have been unfolded for the listener, made more accessible, more meaningful, and more deeply moving.\nMany people stand outside the door of the world of poetry, wishing to cross the threshold but unable to do so without guidance; Professor Gray opens the door and invites his students to enter.\nProfessor Gray’s lectures are a work of art.  To listen is to be moved.\n\nWorkload:\nStandard\n"
        },
        {
            "course_name": "Literary Texts, Critical Methods",
            "review_date": "October 05, 2016",
            "review_content": "\nProfessor Gray is well-spoken, well-researched, impeccably organized and illuminating. That said, don't take his class if you are one of those readers interested in sociology and theory. I thought his lectures were really boring even though I knew they were very high-quality and probably interesting for students more interested in the \"pure\" literary and \"aesthetic's sake\" approaches to literature.\nWorkload:\nstandard\n"
        },
        {
            "course_name": "Victorian Literature",
            "review_date": "August 06, 2015",
            "review_content": "\nI'm going to agree with the person who wrote that Gray is the most overrated professor in the department. The fact that he has a gold nugget baffles me. \nIs he brilliant? Yes. But is he also THE WORST? Yes. \nWhy?\nHe picks favorites. He grades harshly. And he always thinks that he is the smartest person in the room. \nEnough said. \n\nWorkload:\nManageable. \n"
        },
        {
            "course_name": "Romantic Poetry ",
            "review_date": "April 17, 2015",
            "review_content": "\nProf. Gray is amazing! I only took this course to fill in a slot and didn't have much expectations. He made me love this period in poetry! His class is the following. He gets on the podium and does his thing. He reads and explains the poem in amazing details making each and every poem special. Some poems are less then a page long others are a bit longer. Take the class! \nWorkload:\nNot heavy. Even if you do not read a poem he will go over them all so you'll leave the class understanding everything. \n"
        },
        {
            "course_name": "Romantic Poetry ",
            "review_date": "January 01, 2015",
            "review_content": "\nProf Gray is the most overrated teacher i've ever encountered. The course was fine. nothing life changing. Shiv Subramaniam was the best TA ever though. Take it if you want. Again though i'll stress that Gray is pretty average. \nWorkload:\nreadings for class. 2 papers. a final exam. Awesomely light. \n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "August 22, 2013",
            "review_content": "\nI don't love poetry but do love Erik Gray and I have mixed feelings about the course. On the one hand, the lectures were incredible. Gray is a great lecturer and knows his shit about poetry, so lectures were smooth, well-organized, and I felt like I really got a sense of each poet's style/focuses. I can't sing enough praises about Gray, and that alone is making me seriously consider taking Romantic Poetry the next time he teaches it. I've written a previous review on Gray for a different class espousing the virtues of his lecturing, so I don't want anyone to think I don't like him or that this is a negative review.\nThat said, there are a couple things that didn't quite work for me with this course.\n(1) I generally prefer more interactive courses. Sometimes I had trouble concentrating on the lecture, especially since even though Gray sounds wonderful reading poetry, I still don't really understand it. (which brings me to...)\n(2) As I said I don't love poetry. I find it pretty hard to understand, and I think the idea that poems can be \"interpreted however you want\" or whatever is pretty bullshit but at the same time find it pretty difficult to figure out what the poet is really getting at. Gray's lectures do a great job of illuminating the poetry and connecting a poet's different works. But there's no way I could really do that on my own, nor am I taught to (this is strictly a poetry class in that you read poetry and you learn about those poets and works, it doesn't cover at all poetry analysis, nor did I expect it to). Maybe I'm the only one who feels this way, but this made the final harder because we were supposed to bring our own analysis of the poetry (this makes a lot of sense for papers imo, but in a timed setting I just didn't have the time to pore over the text).\n(3) I thought the discussions weren't that beneficial. I wish I hadn't taken one. At the beginning of the semester you get a choice of signing up for a section or taking a midterm, and I thought the section would be more fun and more insightful. The section was OK, but I didn't feel like I was learning more than I had in lecture, a lot of times I felt like we were just re-covering stuff already said. The discussion posts (required, every other week for our section, half the class switched off each week) felt like they were written for the sake of it, and I never bothered reading other people's posts nor were we encouraged to. I guess that's a lot of discussion sections' posts, but it just felt like a waste of time. The TAs seemed pretty cool but that doesn't mean the discussion sections were helpful, and the final review they did was a complete waste of time. Now all this would be fine, except...\n(4) I felt that the grading was pretty arbitrary. I got a much lower grade than I was expecting -- it's understandable to get a low(er) grade but I felt blindsided by it, like somehow I wasn't aware I wasn't performing well the entire semester. I spoke a decent amount in discussion considering it was only 50 minutes, and always kept up with the posts/made deadlines/etc. I'm sure it wasn't meant to be a grade booster but still ... I think taking a midterm could possibly have served me better.  Same goes for the final ... I studied my ass off for the exam because a big portion of it was IDs and IDing poetry, a lot of which sounds fairly similar if you don't know each poet's nuances, and I'm fairly certain I got all of them right, and that my explications/essays were decent, for a 3-hour exam that I could have definitely used an extra half hour or hour on. \nCase in point: my friend who was pass/failing the class, skipped lectures regularly, and did most of the reading during reading week got the same grade I did. I'm obviously bitter (so you should take this review with a grain of salt), but I still don't have a clear idea of how I could have done better in the class. \nI'd still recommend this course for anyone interested in the material (the lectures are pretty phenomenal), but maybe PDF it or skip the discussion b/c Gray doesn't seem to have a great track record of TAs (the other class I took with him, the TAs were awful). Also a word of advice, the IDs on the final were mainly from lecture so make sure to note every passage Gray discusses. Otherwise when you're studying for the final you won't even know where to begin with IDs.\nWorkload:\nTwo essays, 30% and 35%, the second is a bit longer\nMidterm or discussion section (15%)\nFinal exam (20%) which was IDs, passage explication, and then essays. The final was a lot for three hours. I think the midterm was formatted similarly though I didn't take it.\n"
        },
        {
            "course_name": "Literary Texts, Critical Methods",
            "review_date": "November 05, 2012",
            "review_content": "\nBecause this class is half lecture and half seminar it can be a mixed bag, so watch out.\nFirst, the lecture part: this is basically the Intro. class for English majors, the department will usually assign someone good to teach the course.\n-Erik Gray is excellent, awesome, and fantastic.  If you have the opportunity to take this class with him, do yourself a favor!-\nI also found the material to be interesting in itself, and found that I actually became much better at analyzing texts and writing literature essays.  If you're not an English major, but want to learn more about textual analysis or schools of literary criticism, this might be a good class to take...\nMight, I say, because of the seminar.  Although I think that English majors should try to take this class as soon as they can, if you get a bad discussion section leader, get out.  I can't speak for other TAs, but mine was, to say the least, uninspiring.-GODAWFUL-\nahrm\nThere was a remarkable difference between how much i looked forward to going to Gray's lectures and how much I looked forward to going to recitation (unless I wanted to nap, in which case I was cool with it).  I can quite confidently say that nobody wanted to go to class, just about none of the extra postmodern-feminist-queer theory reading were remotely entertaining, and hearing the discussion was painful.  I gained nothing useful from that seminar.  And to top it all off, there was very little essay feedback, and they were toughly graded (I wouldn't mind this if she gave us good feedback or helped us during her office hours, but she just didn't give a damn).\nVerdict: Please remember that this class is 4 credits and make sure your TA is good/cares about the class.  Don't let a bad one put a damper on an otherwise nice class!\nWorkload:\n3 shorter papers, ungraded, and 3 longer and graded essays, increasing from 1800 words to 2200.  Weekly readings on criticism, plus 1 play and 1 novel.  Nothing to sweat over, as long as your TA is fair and helpful when it comes to the essays.\n"
        },
        {
            "course_name": "Literary Texts, Critical Methods",
            "review_date": "May 20, 2012",
            "review_content": "\nCan't say much that hasn't already been said, but I'll add my two cents in. \nErik Gray is WONDERFUL! Such a great professor, and you can tell he truly truly loves teaching. He always stays after lecture to see if anyone wants to talk one on one and is super nice during office hours. He gave me some input on future courses to take and just talking with him after going to his lecture each week was just exciting. \nHis lectures are, put simply, a joy. I don't know how to describe them except that they're insightful and lucid, and you leave each one blown away. The reading is manageable but sometimes can be dense, but when you get to class and he starts explaining it in the context of the text we're talking about everything just suddenly makes sense.\nHis specialty is, of course, poetry. I am someone who has shied away from poetry for my whole life. However, he has definitely changed that--I will definitely be taking a poetry course or two in the future and I feel like I am actually excited to read and analyze poetry. His passion is truly captivating and he does a wonderful job with this \"intro\" class of sorts, guiding students to begin to analyze poetry and the texts. \nHe also makes cute jokes in lecture (like designing the entire course around Hamlet before realizing that would be a terrible idea) and always makes me laugh. I feel like I've really learned a lot more about the texts also (Hamlet and Pride and Prejudice) despite having read them a couple times before. Gray and his lectures are definitely what made me decide to be an English major for sure. Will definitely be taking more of Gray's classes in the future.\nThe seminar was much less enjoyable. It was fine and the discussions could be really interesting, but two hours is just way too much especially on a Thursday. The conversation would definitely get slow at some points and I felt like I got a lot less out of it. But I don't really think that can be helped much, that's more a critique of the course structure/seminar leader than the professor.\nWorkload:\nThree units - Poetry, Drama (Hamlet), Novel (Pride and Prejudice + another text)\n3 ungraded short papers (750 words) on poetry to ease you in\n2 graded short papers (I forget how long, maybe 1200 words? not long at all) on poetry, 5% each\npoetry paper 20% (7-8 pages)\ndrama paper 25% (7-8 pages)\nnovel paper 25% (7-8 pages)\nseminar participation 20%\nreading every week for lecture, sometimes for seminar (both the text itself and analysis/methods readings)\nan extra novel to read after Pride and Prejudice, your seminar leader picks\n"
        },
        {
            "course_name": "Romantic Poetry ",
            "review_date": "December 09, 2011",
            "review_content": "\nMy fellow Columbians and Barnardians,\nI write this review with the utmost honesty and passion. Let me begin by saying that Erik Gray is the best thing to happen to this world since Kraft mac and cheese; if you do not enjoy mac and cheese then conjure up an image of the one thing you love most in the world and I promise you-- Gray is BETTER. I love this man, he is the smartest human being I have ever had the privilege of encountering on this earth. In fact, I would literally marry him if he would have me. If he is married, then his wife is the luckiest. Anyway, I do not even know how to begin to discuss the greatness and perfection that is Erik Gray. If I could, I would listen to him speak all day long every day about anything he wanted to say. He is simply brilliant. I could sit here and write essays for days about all the reasons why he is the consummate professor and human being. There is no reason why anyone in the world should hesitate to take this course. You know when you are younger and watch movies about that amazing, once in a lifetime professor, well, say hello to Erik Gray, the only difference is that he is even better in real life. Erik Gray is THE single most inspiring, incredible, intellectual and effective professor that I have ever encountered in four years of attending this university. He is immaculate. I am tearful at the moment thinking about this course being over. There are no words that could ever manage to scratch the surface of all of his amazingness, so I will try my hardest to make some of it clear in this review by including some of my course evaluation:\n On effectiveness: Erik Gray could probably teach algebra to a class of 5th graders-- my point in saying this is to clarify how articulate and deep his thinking is about what he knows and how he manages to pass it on to others. He could teach anything and I would listen, hinging on every single word. His execution is beyond belief-- the way he phrases his sentences, his emphasis on things he loves, and his demeanor make you just squirm in your seat in excitement; even his pauses speak volumes. When he reads a line of poetry and places his hand over his heart with a sigh, I melt; that is the personification of real life intensity and passion. Professor Gray is the best thing that ever happened to this English department. I truly, very very very sincerely, believe that every professor at Columbia University owes it to himself to sit in on one of Gray's lectures (I dare someone to do that and try not to be coming back for more!) Same goes for students. He is the quintessential inspiring once in a lifetime professor that everyone enters college wishing to experience. Erik Gray's lectures are oozing with passion and humor and deep knowledge. It is simply impossible to not want to know every single thing he talks about. I feel so disappointed that this class is over and if I wasn't a senior, I would spend the remainder of my college career taking anything and everything he taught. Effective does not even begin to express his teaching, the word does him no justice. If I had to describe Erik Gray's teaching in one word-- I could NEVER, because he is more than words, his teaching is a beautiful sublime experience. You can't get more passionate than he is about Romantic Poetry.\nBest part of the course:Everything was the best in this course. Not to make a grand generalization, but actually every single thing. The organization was perfect, the teaching was inspiring and the overall combination left me always craving more. Professor Gray's enthusiasm is wildly contagious. He is the sweetest man I have ever witnessed. He reveals works in every possible light, twisting and turning each word until we get the last possible drop of juice that it has to offer us.\nProfessor Gray is the greatest inspiration. I will hold this class in my heart for as long as I live. It is professors like Erik Gray that make us strive for more, not only academically, but in life. I have always considered myself passionate about my career goals and future, but still, I hope that the day will come when I can be as devoted as Erik Gray to anything. \nOn a separate note, it is really hard to get up to the 6th floor of Hamilton by foot...this is no matter when it comes to the end result of experiencing Erik Gray's class. I would walk up infinite steps to reach this end point. It is like a journey in the darkness and pain, as if climbing mount Olympus, in the end finding the ultimate deity waiting: ERIK GRAY\n * Last thing- This man seriously deserves an award or something. Anyone reading this review from the department or the university-- SERIOUSLY, he NEEDS some kind of award or recognition. He is a diamond. \nI realize that this review is intense, but the man deserves all the credit. I have never spoken to him after class, but I hear he is nice and down to earth. The fact that all this can come just from my observations of him during lecture means something.\n(P.S. To everyone in the course who could not spell his name correctly by the last week, it is GRAY not to be confused with GREY, he is a God and deserves this recognition. Thanks!)\n\nWorkload:\nTotally reasonable. Light to moderate reading, no midterm if you attend recitations which are fun. Final seems pretty daunting at this point because how can one reach Gray's level of perfection? Two papers which are a breeze because Gray provides so much incredible info and analysis in lecture that it is impossible to not be mulling over what you learned for days and days after and come up with your own essays even when he provides prompts. Take this class, the work just pales in comparison to the gain, it is NOTHING compared to what you leave with.\n"
        },
        {
            "course_name": "Romantic Poetry ",
            "review_date": "August 22, 2011",
            "review_content": "\nErik Gray is, quite simply, brilliant. \nAnother professor in the English department told me that Gray \"spends more time on lectures than any professor I know.\" It shows. Gray's lectures are perfectly paced, intriguing, and insightful as all hell. \nLit Crit discussion sections can get pretty tedious (especially if you've had an introduction to lit crit in the pastâ€”it really is an intro class) but the course is structured well across the board, and you'll end up with a solid foundation for the major. Expect fascinating lectures.\nRomantic Poetry is a revelation. Professor Gray's at his best here (Romantic poetry=his specialty) and the insanely awesome analyses he does for poems are only part of the package. He's positively gleeful at many points in the classâ€”I'm remembering one of his \"Don Juan\" lectures in particularâ€”and he integrates historo-contextual and biographical information into the lectures in ways that make their relevance absolutely clear. \nSeriously, take whatever you can with this man. Erik Gray is a god.\nWorkload:\nTwo essays, midterm (which you get to skip if you do a TA'd discussion section), final. Light to moderate reading. Fair grading. \n"
        },
        {
            "course_name": "Romantic Poetry ",
            "review_date": "December 13, 2010",
            "review_content": "\nListening to Erik Gray lecture is a beautiful experience. Take this class and let his words wash over you.\nHe covers the big 6 of Romantic Poetry with eloquence and love. Yes, he reads his lectures, but each is so meticulously prepared and reasoned that you really wouldn't want it any other way. He so clearly loves the material and when he gets especially excited you can't help but be too. His passing resemblance to Bill Nye the Science Guy doesn't hurt.\n\nWorkload:\n2 papers, optional discussion section (if you attend, you get to skip the midterm), final exam\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "September 02, 2010",
            "review_content": "\nI worked hard and found it impossible to earn above a B+ on anything and the TA did all my grading, writing incomprehensible comments. However, the class is well worth it, because Erik Gray is a fantastic lecturer and Victorian Poetry, while mostly uninteresting, has some priceless gems worth treasuring. I was inspired to \"write\" the following, after my friend Stephen urged me to take the class:\n---------------------------------------------------------------\nMy first thought was, he lied in every word,\nThat junior Stephen, with malicious eye\nAt his counsel, should I turn aside\nInto that ominous class which, all agree,\nHides the Gray Tower. Yet acquiescingly\nI registered as he suggested\nFor, what with my Universe-ity-wide wandering,\nWhat with my search drawn out thro' weeks, my hope\nDwindled into a ghost\nAs when a sick man very near to finals\nSeems learnÃ©d indeed, and feels begin and end\nThe tears, takes farewell of each class friend.\nWhile some discuss if near the other tests\nBe schedule enough for this, and when a day\nSuits best for quaffing thâ€™ adderall away,\nI had so long suffered in this quest,\nAnd all the doubt was now---would it be meet?\nSo, quiet as despair, I turned from him,\nThat fateful Blair, into the class he pointed, with\nhis two fateful Gray tomes heâ€™d lent my only vim.\nBut no sooner was I fairly found\nPledged to the plan, after a month or two,\nSuch starved ignoble TAing! nothing throve:\nFor sense---as well expect a borogove!\nYou'd think; a written commentâ€™d been a treasure-trove.\nNo! penury, inertness and grimace,\nIn some strange sort, were the TAâ€™s portion. ``What\nâ€œwork does your metaphor do,'' wrote he peevishly,\n``Synthesizing your close readings into a tightly constructed:\n``argument is your next task!â€\u009d\nBut suddently, there they stood, ranged along the desks,\nTo view the last of him, a living frame\nFor one more picture! in a sheet of flame\nDauntless the final exam to my pen I set,\nAnd wrote, \"Childe Chou to the Gray Tower came.''\n\nWorkload:\nDecent - mid-term, final, several essays. Not a huge volume of reading.\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "June 11, 2010",
            "review_content": "\nJust wanted to add to what most other reviews have said. Professor Gray is an absolutely fantastic lecturer, genuinely funny in a very nerdy/academic way, and is really cool in office hours. I get the feeling he grades fairly harshly on writing. However, it helps to pay a lot of attention to his style of analysis early on in the course (first two or three classes), and try to start looking at the poems that way, with really close attention to detail, repeated sounds, syntax, etc. I mean, that's expected in every poetry class, I suppose, but Professor Gray seems to put particular emphasis on finding the meaning in very specific, somewhat technical details. That's not the only way to get a good grade, but it definitely helps. Class is always worthwhile, but that's not the only reason to go; a good amount of the points on the final are basically \"did you show up to class\" points. I believe on both the midterm and the final, each of the passage IDs come from one of the passages we spent a significant amount of time on in class. So while you will have to study, as long as you take good notes, it shouldn't be too hard to remember the poems, and say some basic things about how the passage relates to the themes of the poem and of the poet. Really, Professor Gray covers everything you need for a full score on a passage ID in class, and the passage ID part is largely a test to see if you showed up and you remember the general themes of what Prof. Gray said in class.\nSo, yeah, if you like poetry, there's basically no reason to not take this class, unless you really, really, really hate all of the Victorians... and even still, you might want to come to the first couple of lectures to see if Erik Gray can change your mind.\nWorkload:\nTwo papers, midterm, final. Midterm and final are fairly difficult, but not exceptionally hard.\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "May 18, 2010",
            "review_content": "\nDo you love poetry? I mean, do you really get-off on it? Because if you don't, you should slap yourself right now for even looking up this class. Everyone else is correct, Erik Grey is a quirky, funny, engaging lecturer, and he cares about his students-- but while you can feel good until you are blue in the face, it won't stop you from getting hammered come grading time. Don't bother reading further unless either A) You really don't know much about poetry but the class sounds interesting, or B) You feel some misguided need to defend Erik Gray and Victorian Poetry from the silly rantings of a philistine, in which case, you know which orifice you can jam your protest in. There are a million reviews that give VP and Grey a post-final handy, so somebody had to be the bad guy. This is for the A group.\n(For the record, I am a Poli-Sci major, ordinarily I receive grades in the A/B+ range, not familiar with poetry, and I'm not an overachiever. I took this class because it came highly recommended as an \"amazing\" class by what I thought was a friend, but who must have been a sadist.)\nI felt robbed for my experience, and here is why: Instead of enjoying the material, I could only focus on the fact that nothing I produced bested a 79 in a curve-less course. The papers were graded arbitrarily, I am wholly convinced. A friend who is an English major, and ordinarily earns A-/A grades, and who spent most of the term telling me that I was the problem and not the class, found himself staring at low 80s, and couldn't figure out why. As for the exams, they consisted of identifying 150yo texts of which you were asked to determine title and author from about 4-8 lines of text. You can explicate all you want that you believe that it is a certain poem, by a certain poet, with certain meaning, but if you get the title and author wrong, you are done. 0 points. 0. \nThat's not to say that if you are really into this stuff that you can't do well. Indeed, several students pulled down A range grades. They were the ones that sat in class, transfixed, nodding their heads in a Southern Baptist, \"You Tell 'em, Preacher!\" manner while listening to a lecture about what a 100 years-dead man felt about his ugly wife (seriously, have you googled Barret Browning? That alone should discredit the genre.)\nNow, before anyone gets their Victorian chastity-panties in a bunch, let me be the first to admit the following: I'm mad because I got a poor grade, not because the class is terrible.\nHOWEVER, if you aren't a poetry fanatic, and you are thinking of taking this course because,\"It looks interesting,\" consider yourself fully briefed by someone who was once like you, but is now a shell of a man who thrives on modernity and hates the past.\nWorkload:\nIt's exactly as everyone else says. Two essays (30%,35%), midterm (15%) final (20%) containing IDs from lecture and short essays on chosen passages. Don't even think about reading these poems ahead of time without Spark Noting them, unless you are already accustomed to the format and subject.\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "May 10, 2010",
            "review_content": "\nA highly entertaining lecturer. What you would expect from an English course: readings, two essays, midterms and finals. Not too hard to get a B/B+, but you have to be really comfortable with essays to get that A. If you come to class and take notes, you will do fine. If you are the type to skip class, beware. Exams rely a lot on what was gone over in lecture. One last caveat - he lectures almost the whole time, generally leaving only the last 10 minutes for questions, so this is not a very interactive class. However, he does care about the students, and if you take the time to go to his office hours or tend to ask questions, he will get to know you and remember your name.\nWorkload:\nTwo essays (30%,35%), midterm (15%) final (20%) containing IDs from lecture and short essays on chosen passages. Reading is generally pretty light, but can a little long some weeks.\n"
        },
        {
            "course_name": "Romantic Poetry ",
            "review_date": "December 31, 2009",
            "review_content": "\nI came into this class a little wary of the 1500-page textbook and of poetry in general, but after a couple of weeks I fell in love with the class -- it was definitely the best lecture that I've ever taken at Columbia, and Professor Gray is my favorite professor of all time. Professor Gray is a brilliant lecturer and incredibly knowledgeable. He's also accessible (even though the class is a large lecture, students still have the opportunity to talk to him personally) and even a little funny (his nerdy jokes during lecture are kind of endearing). I came away with a really thorough knowledge of the poets that we studied in detail, and I learned how to write better papers as well.\nWorkload:\nTwo papers; midterm exam or weekly recitation; final exam. Light reading for each class. Everything is more than fair/manageable.\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "November 29, 2009",
            "review_content": "\nErik Gray is a consummate lecture-based teacher. He's phenomenal at it, and he infuses his talks with so much enthusiasm that it is pretty much impossible not to get excited about the material he's teaching you. I took Romantic Poetry and Victorian Poetry with him and only skipped lectures in cases of true emergencies. For one, they were the highlight of my day, so it never felt like a hassle to come to class. I left every class with a smile on my face. For another, they were the entire basis of the midterm and the final. He literally gave us the important passages from the readings and told us everything we needed to know about them in order to write good IDs on the tests. This was great when my workload was bad and I couldn't do the reading. I just showed up for lecture, got his cliff notes versions, and was set. However, if I missed a class, I had to scramble to get someone else's notes or else I went into the tests feeling really unprepared to write on the material I'd missed. So be ready to go to class, pay attention, and take good notes. Luckily, his lectures are so fun, interesting, and engaging that this is a really easy thing to do. He reserves some time at the end of each class for discussion, but it always felt like a let-down after his brilliant commentary. However, he really encourages original analysis in his papers, so it's a good idea to throw your ideas out there just to see if your thoughts surprise him or get a good reaction. That's usually a sign that you've stumbled onto a good paper topic. Overall, Professor Grey is a brilliant English professor, and what he taught me about analyzing poetry has had tons of crossover value in my other English classes. I'd recommend his classes to even the most wary of poetry readers.\nWorkload:\nA midterm and a final (both ~10 IDs and 1-2 short essays). If you took good notes in class, you just need to study them, and you are golden. Two papers (one 1500-1700 words, the other 2000-2200 words), both very doable and fairly graded, especially if you tried something interesting with your thesis. The amount of work you need to put into the class to get a good grade is nothing in comparison to the amount of knowledge and entertainment you will receive just by showing up twice a week.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 09, 2009",
            "review_content": "\nOur first day of class, Gray compared us to freshly hatched birds - something about Columbia thinking Lit Hum would give us a good first impression. It wasn't condescending, and I couldn't ask for much of a better first impression than Gray. He is sort of lanky and dorky in the way that he loves literature so much (esp. ancient Latin/Greek and Milton), but also very funny, confident, worldly, and in touch. It's a little disappointing that he doesn't let students get close enough to be friends (I think), but he did share random things, like his obsessions with Gwyneth Paltrow and the 'lovely and talented Giovanna' from the Met. He facilitated a well-paced discussion, encouraged everyone, and gave useful feedback. One thing you might not like is he grades so that everyone 'improves' over time. I had one patronizing incident with him, but wouldn't call it a general problem. Wish I could take another course with Gray, but I'm not interested in Romantic Poetry. Also, he bakes.\nWorkload:\n3 essays first term, 2 second (midterm and final of course)\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "September 06, 2009",
            "review_content": "\nI loved this class.  Erik gave the clearest, most organized lectures ever and they were truly insightful and engaging.  This course challenged me while still being enjoyable and without assigning a completely overwhelming workload (which basically means it was perfect). I think it's also taught in a way that's accessible to non English majors as it doesn't require or assume a background in literary criticism and theory.   \nMy one complaint is that the mini-discussion at the end of each class (only 10 minutes) was often stilted, but that's a minor issue.\nTake it!  You'll be glad you did.\nWorkload:\nAn in class midterm and final (IDs, passage analysis, short essays), two papers (1500-1700 words or so for the first, 2000 or so words for the second).  Grading is fair. \n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "May 19, 2009",
            "review_content": "\nPhenomenal professor. He's brilliant but doesn't rub it in your face. Though he reads his lectures out loud, he's terrific at it and always brings in a little humor. The lectures are insightful, well-organized, and coherent. It's clear that he put a lot of thought into structuring the class the way he did because the lectures themselves follow a very logical order, and when reviewing the material, you can clearly see how major themes evolved over time. And he really does have the perfect academic sense of humor. It's sometimes a little corny but always adorably so. \nHe allows a lot of freedom on the papers. He provides many different paper topics for each paper but encourages you to use them as starting points. You can always do something totally different. The exams (midterm and final) are incredibly fair as long as you attend the lectures, since all the IDs come from class material (but you'll rarely be tempted to skip because, again, he's a phenomenal lecturer).\nAnd even though this is a lecture, he always leaves time at the end for questions and comments. Sometimes it gets a little awkward when no one has anything to say, but no one's ever pressured into saying anything. I imagine that Romantic Poetry is just as good, but I'm glad I took Victorian Poetry first because it's half the size of Romantic Poetry. \nDo yourself a favor and take a class with him. You won't regret it.\nWorkload:\nA couple of poems for each class, and the syllabus tells you which poems will be discussed, so you can always skip the non-essential poems. He's very good about sticking to the syllabus. Two papers (5-6 pages, 6-7 pages) with flexible paper topics. Very reasonable midterm and final (the final only has IDs from the second half of the class).\n"
        },
        {
            "course_name": "Sonnets & Elegies",
            "review_date": "May 15, 2009",
            "review_content": "\nErik Gray is the type of professor who makes coming to a school like this worthwhile. He's never bored me. He's too busy either saying wicked smart things about the excellent poems on the syllabus or making a witty joke. He grades papers very quickly yet manages to fill up the back page with solid comments. Take whatever he teaches.\nWorkload:\nCouple of papers and weekly responses.\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "April 10, 2008",
            "review_content": "\nErik Gray is an unbelievable professor. He is articulate, passionate about the material, creative, and, in a word, excellent. He has a fantastic academic sense of humor, he is slightly self-deprecating, and very approachable. He made Victorian Poetry interesting and exciting. Take any class with him.\nWorkload:\nMedium, the exams are hard though so do the reading and take notes in class.\n"
        },
        {
            "course_name": "Romantic Poetry ",
            "review_date": "January 02, 2007",
            "review_content": "\nI love this man. Seriously. He's the best professor I've had at Columbia, and he got me totally hooked on Romantic poetry. His enthusiasm and passion for the material are obvious, and his lectures are always witty, clear, and well-structured. He is very sympathetic in dealing with students, his grading is fair and informative (his comments actually helped me to improve as a writer), and he makes the course accessible to all students, no matter their backgrounds in poetry. I raved about him almost every day to my friends, and I would take another class with him in a heartbeat. If you are curious about studying poetry, it doesn't get any better than a course with Erik Gray. You owe it to yourself to take one. \nWorkload:\nLight to moderate readings for each class, two 5-8ish page papers, a midterm, and a final (all graded very fairly). \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 16, 2006",
            "review_content": "\nI had Professor Gray for the entire year, and I am very glad I did.  He was a great professor who easily facilitated class discussion.  Although students spent the majority of the class talking, he would ask directing questions or clarify important points as they came up, or supply them if they didn't.  He would have us examine certain passages in depth and offer his interpretation before opening it up to the class.  This offered for concerte notes for students while still opening the floor for alternative ideas.  He always made sure everyone understood the actual plot first before delving into the underlying meaning.  This meant you could always follow along with the conversation even if you found the book confusing.\nAnother plus about his class if that he thought it was only worthwhile to read the relavent parts of a text, rather than ask us to read an entire book and then not discuss most of it.  This meant there was less reading and a more focused discussion for each text.\nProfessor Gray was also very helpful in office hours when it came time to write papers.  He would discuss your topic with you and help guide you to saying something meaningful.\nAll around a great professor.\nWorkload:\nModerate.\nTypical Lit Hum reading; although he may cut out some of the superfluous parts of larger texts.\nThree papers per semester of increasing length (4-5, 5-6, 6-7).\nEverything was completely managable, and he was very approachable for help.\n"
        },
        {
            "course_name": "Romantic Poetry ",
            "review_date": "April 28, 2006",
            "review_content": "\nEven after reading the other glowing reviews, I don't think this man has been done justice. Most importantly, he is HILARIOUS. Prof. Gray has the perfect academic sense of humor, where he can share a laugh with students about incredibly esoteric and pedantic bits of works (e.g. who the hell knows what \"the everlasting universe of things\" means?), but never do so at the expense of the material. I can't remember a question he was asked that he didn't answer objectively and brilliantly, whilst also making me giggle like a school girl. He is shameless about the sincere delight he takes in the work and is nothing if not available for students at all hours of the day. Discussions are great and he will entertain every comment while being perfectly happy to put an extemporaneous speaker in their place. If I thought he was available, I would plead with him to leave his job and become my personal sensei. Best professor I've had at Columbia, cold.\nWorkload:\nLight. Reading every week with brief responses (which helps a lot for the class). Three papers 6-7 pages. No midterm, no final. \n"
        },
        {
            "course_name": "Romantic Texts I: Blake, Wordsworth, Coleridge",
            "review_date": "January 16, 2006",
            "review_content": "\nProfessor Gray is an extremely polished scholar.  He knows his poetry cold (even has a lot of it memorized) and his seminar was quite enjoyable and intellectually stimulating.  He is passionate about his subject matter, making the class a very wonderful one for his students as well.  I thoroughly enjoyed taking his class -- it is extremely comprehensive as it comes to reading nearly the entire body of poetry written by Blake, Wordsworth and Coleridge.  He's also very down to earth and cool.  I can't say enough great things about him.\nWorkload:\nA good amount of poetry reading and weekly email responses.  Three papers (between 6-8 pages in length).\n"
        },
        {
            "course_name": "Romantic Poetry: Byron, Shelley, Keats",
            "review_date": "August 03, 2005",
            "review_content": "\nProf. Gray made my last semester.  Ok, I am a huge lover of Romantic poetry, so I was predisposed to like his class, but I was impressed by his ability to teach a course that is engaging and challenging but not overwhelming or intimidating. He is young, but he knows his stuff cold, and he seems genuinely interested in what his students have to say. In terms of his comments on papers:  second best feedback in my whole English major career from a prof.  (best was from Anne Lake Prescott, who I think would get along excellently with Prof. Gray). His comments on each paper actually helped me write the next, and not just in that 'oh, that's what this teacher likes, so I'll throw in a couple of those in the next one' way.  He really helped me write better papers.  Plus, this guy is just zany and wonderful: we toasted Keats on the day of his death, and actually tried to 'burst joy's grape against (our) palate(s) fine\" when reading Shelley. I mean, a Professor reading Shelley's famous line with a grape in his mouth? Hilarious. There is nothing awesomer in your last semester than discussing  poetry in an atmosphere of equally enthusiastic people, which he does his utmost to foster.\nWorkload:\nWeekly reading response, tons o reading (but so good!) and 3 papers 6-7 pp each.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 20, 2005",
            "review_content": "\nGreat Professor! I actually transferred to Prof. Gray's class second semester, and he is much much better than my previous one. Prof. Gray is easygoing, very lenient in terms of extensions, never gives pop quizzes on the readings, and is very open to different ideas during discussions. I would definitely recommend taking Lit Hum with him. He is not an easy grader; you must go the extra mile in order to get an A in his class. However, he is a capable professor and the effort will be well worth it.\nWorkload:\nThe assigned readings, two papers, 6-8 pgs each, midterm, final. He said that he assigned a bit more this year, but will try to reduce the amount of reading in the future.\n"
        },
        {
            "course_name": "Romantic Poetry ",
            "review_date": "March 09, 2005",
            "review_content": "\nProf. Gray is very nice, articulate, funny, and passionate about Romantic poetry. Discussions are both stimulating and informative, despite some pretty knotty material. As he knows most students in the class are second semester seniors, he seems pretty laidback, but does expect thoughtful weekly responses to the readings. The material is enjoyable to read, and Prof. Gray does a great job balancing class discussion and lecture. Perhaps most importantly, he really seems like he cares and wants you to come away with an appreciation of these richly constructed texts. All in all, I'd definitely recommend this professor to others. \nWorkload:\nWeekly readings as well as postings via email, 3 papers (6-7 pages). \n"
        }
    ]
}