{
    "prof_info": [
        {
            "prof_name": "Felice Beneduce",
            "prof_id": 10909,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Italian",
            "review_date": "November 18, 2013",
            "review_content": "\nFelice is easily the best Italian teacher at Columbia. Anyone who takes his class can tell you that. He is one of those teachers that you actually want to work hard for. Every single class is exciting and interesting. When you mess up he always is there to help you without making you feel bad for making a mistake. Additionally, he makes the somewhat boring exercises that are mandatory from the Italian Department a blast. If you take any course with Felice, you will not regret it. \nWorkload:\n3 presentations and some compositions \n"
        },
        {
            "course_name": "Elementary Italian I and II",
            "review_date": "June 06, 2013",
            "review_content": "\nFelice is one the top professors I've had at Columbia. I took Elementary Italian I and II as a senior, and I wish I had Felice earlier on in my Columbia experience. He really cares about making sure that his students are learning. You could see Felice get excited when we were figuring something out. As previous reviews have stated, his course may be difficult for some at times, but I learned a lot and always felt like the work was fair and manageable - I wouldn't want any less work. I also found it really interesting that Felice assigned a video project as a culmination of the composition assignments. Students must use either One True Media, or iMovie. I haven't had any other class at Columbia where technology was integrated into the work. I should also mention that Felice responds to emails very quickly. Not that you should ask for help last minute, but he's very understanding. Felice truly cares about being a professor and I'd recommend anyone serious about learning Italian to take his class. If I could rate Professors 1-5 stars, Felice would receive a 5, without a doubt.\nWorkload:\nWorkbook & Lab book chapters due bi-weekly along with a quiz, 3 compositions, midterm, video project, final\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 10, 2013",
            "review_content": "\nFelice is a fantastic professor! Every lecture is very clear and he is more than happy to help if you don't understand anything. Class is always very engaging, and there are quite a few power points that involve Simpsons characters. He is a professor very dedicated in making sure his students understand the material. On a weeknight there is never more than 10-15min of homework, anything that is time consuming at all is designed to be done on weekends. Overall, Elementary Italian was a solid class and I learned quite a bit of Italian. \nWorkload:\nWorkbook/Lab book sections due bi-weekly, bi-weekly quizes (lowest one dropped), midterm, small video project, and a final \n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "December 24, 2010",
            "review_content": "\nI really like Prof. Beneduce. No doubt about it: he's a tough teacher, and he expects a lot from his students in terms of serious commitment to Italian. However, the class definitely acclimated to his style over time, and I think that we all grew to like him as the semester went on. The class format is pretty standard (students talk most of the class and get called on at random) but everyone, including the teacher, was pretty comfortable when others made mistakes. There are biweekly compositions that you get two shots at doing, and the final grade averages your original with the re-write. In addition, there are homework assignments almost every evening, which were tough at first but became easier as I learned more Italian. The only really hard part of the class were the midterm and quizzes, which were graded pretty harshly and resulted in many B/B+s. I'm not sure how the final was graded but it was definitely easier having a full three hours to complete it. Also make sure to attend his review sessions before the midterm/final because a lot of what's discussed shows up on the exams.\nBottom line, you will learn a ton of Italian in this class. I'd recommend Prof. Beneduce for students who are really excited about the language; otherwise, it might just seem like a ton of busy work.  \nWorkload:\nTextbook exercises for HW, lots of participation, four quizzes, six or seven compositions, midterm, group presentation on a region of Italy, final\n"
        }
    ]
}