{
    "prof_info": [
        {
            "prof_name": "Irene Sanpietro",
            "prof_id": 4183,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 24, 2015",
            "review_content": "\nOne of the worst professors I have had at Columbia. Her discussions were always disorganized. She strayed so far from the text which made it difficult to follow her logic. When students attempted to challenge or questions one of her views, she would never seem to be receptive to these comments. \nThe biggest problem with her class was her harsh grading. When you go in for feedback, she destroys your essay without acknowledging anything that you are saying. If you essay disagrees with her views on the text, don't expect to get a good grade. Her comments on the essay were not helpful. She likes to use a lot fancy phrases like the reviewer below described, but these comments never help you improve as a writer. \nAvoid this class at all cost. There are so many better CC professors out there. \n \nWorkload:\n3 essays, participation, and one ten minute presentation. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 16, 2011",
            "review_content": "\nHonestly the most amazing cc experience I could ever ask for. Irene is so dedicated to the course and always comes prepared. Even a 9 AM in a Pupin dungeon didn't stifle how much I enjoyed this class. I highly recommend Irene for her dedication, availability, and fairness. I think the best indication of a cc professor's quality is the amount of students who choose to stay in the course the second semester: almost all of my class stuck with the 9 AM in order to stay in Irene's class. Irene is always available to meet on an individual basis to discuss papers, thoughts on the works, and pretty much anything else you could want to talk to her about. This woman is BRILLIANT, just listening to her in depth knowledge of each the works was a learning experience for me. She also made sure to facilitate group discussion and bring in bagels from time to time for class breakfasts! Ask anyone in her course this year and I am pretty positive they will agree with me. HIGHLY RECOMMEND!!!  \nWorkload:\n2 essays, a final exercise (take home, supposed to take 3 hrs) and participation each make up 25% of the grade. Irene will challenge you to improve your writing but allows for rewrites so grading is as fair as it could possibly be.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 14, 2011",
            "review_content": "\nI had Irene Sanpietro for Contemporary Civilizations during 2010-2011. I was really taken aback by Irene. At the very beginning, she seemed like a timid, naive, uncertain instructor, albeit one who knew her classics very well. Throughout the semester, however, she continued to surprise: despite being well-versed in the topic she was studying in grad school, her \"philosophy\" made no sense, and she showed herself to be one of those TAs who love to throw out phrases like \"thought experiment\" and \"forced binary\" without really clarifying up any of the material. Sometimes it seemed like she just liked to hear herself talk.\nWhen it came to grading, I saw the real anomaly. In papers of professed short length, she said that she wanted depth and breadth, factors extremely difficult to balance in the long run. I never got a sense that the prompts were clear, and grading suffered as a result. The comments were just like the style of the class: lots of fancy phrases, not much substance.\nIn short, Irene is a beautiful, engaging young woman with a very interesting story and perspective, but not really a valuable CC professor.\nWorkload:\nTwo papers per semester (8-10 pages), take-home final.\n"
        }
    ]
}