{
    "prof_info": [
        {
            "prof_name": "Diego Saldana",
            "prof_id": 12564,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Probability and Statistical Inference",
            "review_date": "December 24, 2012",
            "review_content": "\nAs an undergraduate who took this class for practical reasons, I can say this: if you are not excellent at either statistics or rigorous math, expect a low grade in Davis' class (in the B/B+ range if you work hard). This is particularly painful because it's a six-credit class. That being said, if what is important to you is to understand the material thoroughly, and you're willing to suffer a little and get a low grade- take this class. \nProf. Davis is an excellent lecturer. He teaches more or less out of the book, but is very clear and his examples are great. He also covers an unimaginable amount of material- partly by filling every minute of his three-hour lectures, and often going 5-10 minutes overtime (which can be exasperating, but I appreciate the fact that he's giving his students their money's worth). So after this class, you'll definitely feel that you've learned a ton. \nIt should also be said that Prof. Davis is very nice and approachable. He has a kind of dry humor that may sound like a put-down, but he really wants his students to do well and was open to ideas. \nIn this section (not sure if this is always true), indeed the vast majority (around 65/70 I'd estimate) were grad students in statistics, which definitely threw off the curve and made it very hard to get anywhere near the average on tests (not to mention homeworks, where the average was probably in the high 90s). So you're really on your own in this class: you can't count on the curve. The curve itself is generous- I think the lower bound for the class is a B-, even with horrendous scores- but the effect is to more or less set you in the B range. \nHomeworks were due every class, which was very difficult for the Thursday class. Usually the homework was around 30% easy questions, 30% straightforward but needs some working out, and 30% hard. If you go to the TA's office hours, though, you shold be able to do it all. \nThe midterms and final were very tough, but more because the material is hard than due to Prof. Davis' own questions, which often relied on things straight out of the book.\nOne final note on the TA, Diego: He is amazing, really the perfect TA. He was unbelievably helpful, often answering questions by email and once discussing something over his lunch break. He knows the material back and forth and always tries to make sure you understand the process. He's nice and also gives tips for how to do well in the class. No matter what course you take, if Diego's the TA- it's your gain. \nWorkload:\n20% HW for every class, difficult to do perfectly but not unreasonable or overly time-consuming. \n20% each for two midterms: very tough, but if you know the problems from the book it doesn't have to be too bad. \n40% final: wasn't too bad, but it covered so much material it was impossible to be on top of everything. \n"
        }
    ]
}