{
    "prof_info": [
        {
            "prof_name": "Charles Walls",
            "prof_id": 576,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 15, 2007",
            "review_content": "\nCharles was definitely a smart guy--he knew what he was talking about with every book. He was always open to discussion; in fact, that was the entire extent of the class. He rarely, rarely lectured (I can remember twice), but he often veered the discussion into the points he wished to cover. However, I often left the discussion feeling as though I learned what other freshmen thought, not what he felt as though we should know. On the papers, he was a hard grader, and he graded mostly on content rather than writing. I didn't understand what he wanted us to write until he said, \"I don't want you to write about what you know. Write about what you don't know.\" So basically, if you want to survive, get a lot of creativity and read the books thoroughly. All in all, a nice guy, very funny and smart, if a little crazy.\nWorkload:\nThree papers (two 3-4 pgs, one 5-6) but he extended the deadlines. Easy midterm, standard final. Daily response every day was manageable and you HAVE to do the reading in this class, but he gives you plenty of time.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 02, 2006",
            "review_content": "\nCharles is by far the best Professor I have had at Columbia.  He's laid back but at the same time serious about the readings.  He never gives you more than what is necessary.  Charles  is always available for extra help and is particularly critical of rough drafts so what you turn in (if you follow his instructions) is a damn good paper.  His grading is fair.  Of the two papers, he is hard on the first but VERY easy on the second.  So if you get a B or B+ on the first paper, don't be discouraged, you will get an A on the second paper for the same quality.  If you can, go to him for help, he notices people who work hard but doesn't hold it against students who can't make it.  Overall, absolutley amazing.\nWorkload:\n2 papers, midterm, & Final.  Daily responses which he casually checks off.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 02, 2005",
            "review_content": "\nCharles has his strengths. He is nice and relaxed, which generally makes class discussion smooth. He doesn't necessarily try to get everyone to talk, but most people do at least once a week because of the atmosphere in the class. If he doesn't understand what a person says, or thinks that others might not, he will ask you to clarify, and he does this often. My main issue with the class was that it was a little too relaxed for me. I understand that, as an intro English course for first years, it should be relaxed and not be taken too seriously, but I would've liked some sort of class structure. In the second semester of the class, he got up in front of the board once, and that was my favorite class. He usually has a few notes scribbled on a piece of paper and lets the class wander through those points and its own, and this is his method of structure. If you don't want a rigorous and exciting examination of the books, take Charles's class. If you do, steer clear.\nWorkload:\nDaily Response, Two 6 page papers (His best aspect as a teacher is his paper grading. If you don't care about what you're writing, you won't get a good grade.) Easy midterm (IDs), Standard final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 24, 2005",
            "review_content": "\nSo, this year, after an innumerable number of years trying to finish his thesis, Charles Walls switched to teaching Lit Hum. Reading the comments from his University Writing (formerly Logic And Rhetoric) days, I guess a few of them are valid - he does smirk frequently, and you get that sense that he takes this far less seriously than anyone else. On the other hand, you'll learn a fair amount in his course if you keep an open mind. The comments from previous users seem to be the typical complaints from kids who try to make more out of this than it really is - this is a Freshman intro English course, and if you fuss and wail or try to suck up, he will slap you down sooner or later. I felt pretty adrift the first month or so, wondering \"what does this guy want out of us?\" before realizing you really just need to loosen up and thing'll be much easier.\nAs for the material, He's clearly got a view of the books that's his own (he hammers down the evolution of the power of language throughout the semester and never lets up) but is more than willing to listen to your opinions. Come to class prepared to talk, and don't bullshit your way through it unless you're a damn good bullshit artist, because he has read these books, as much of a slacker as he claims to be.\nHe let us have class outside on warm days, was very friendly with all of us, tried to get everyone talking, was a very fair grader and in general was a good guy. Hopefully one day he'll finish his thesis and get some sort of high-paying mystery job.\nWorkload:\nA \"written response\" every class (a one-question and a short paragraph comment), easy-as-hell midterm, two moderately difficult papers (he will read your first page and give you input if you give it to him a few days before it's due), the standard boilerplate Lit Hum final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 23, 2005",
            "review_content": "\nCharles is a good Lit Hum teacher and he has the capacity to be better by your own determination. He is a hard grader on the papers but there are only two and he's not going to screw you over. He's also a very smart guy and though he sometimes seems to not be putting the effort in, it is excused for his more general gregarious nature.\nWorkload:\nTwo 6 page papers a midterm and a final\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 17, 2002",
            "review_content": "\nThere are a few teachers who make L&R; really great for their students. Mr. Walls is not one of them. However, while there may be two or three sections that will be more enjoyable than his, there will also be about forty that are a lot worse. His grades on individual essays are sort of random, but over all, if you do decent work you should get a B+. It's still L&R;, and therefore about as much fun as tooth extraction, but he will at least have the uncommon decency to make it like anesthetized tooth extraction. You can do a hell of a lot worse for L&R; teachers. \nWorkload:\nSame number of essays as other L&R; teachers, but he usually makes them shorter and less confusing, stupid and needlessly difficult..\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 05, 2002",
            "review_content": "\nI actually enjoyed this class. the essays were interesting but not that difficult and walls really does try to make it as painless as possible. i did not find him arrogant; he has a great sense of humor (especially if you sass him) and he never tried to belittle a student. he also paces a lot and makes fantastic comtemplative faces.\nWorkload:\nlight. short papers, you can use an outline for the midterm and final, he is an easy grader.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 24, 2002",
            "review_content": "\nHe's kind of a chump, but not too bad. His comments on papers are legitimate, and he can be helpful. If you're in his section, don't worry, it'll be fine. His facial expressions really keep the class interesting. \nWorkload:\nTwo short papers a week, same as every other L + R class. His grading is a little harsh, but i guess it forces you to try. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 05, 2002",
            "review_content": "\nMr. Walls is definitely an arrogant and pompous teacher, if not person. There are times when his smirks at your questions make you both angry and mortified. Still, it is clear that he understands the somewhat ridiculous nature of l&R; and his assigments, however, annoying they are, do get you to think. Overall, he probably does a better job getting you to recognize consistent problems with your writing style than many other l&r; teachers.\nWorkload:\none paper per week, usually 1.5-2 pages, but one of his papers probably takes as long as two regular l&R; papers. Grading varies greatly, and is sometimes, it seems, done by whim. Still, i think pretty much everyone in the class ends up doing well. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 17, 2002",
            "review_content": "\nCharles A. Walls' teaching style has changed. In fall 2001, he actually did a good job teaching L&R.; He worked just as hard as the students did, thinking up interesting and thought provoking assignments (this is unusual for L&R;). Papers are generally two pages long and are due weekly. However, expect to spend a lot of time trying to understand the assignment and trying to write something meaningful (he expects this). Hopefully, Charles Walls will continue to teach this well in the future.\nWorkload:\nEasy midterm and final. Hard papers due weekly.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 08, 2001",
            "review_content": "\nSwitch sections. Logic and Rhetoric blows, but it especially blows with Charles Walls. He makes it quite clear at the beginning that he doesn't want to be teaching logic and rhetoric. Because of this, Walls often is condescending and patronizing. I started out the class getting decent grades, but then my grades went down every single paper. I think by the end I was getting D+'s. Nonetheless, the grading doesn't matter... I think the majority of the class ended up with a B+.\nWorkload:\nOne-page papers... easy midterm and final.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 06, 2001",
            "review_content": "\nThough you may hate to sit through class sometimes becasue he is devoid of a sense of humour you can tell that Mr. Walls does not want to be there any more than you do. He frequently lets you go way early and his assignments are weekly/biweekly never more than 3 pages. You will not learn anything but he is an easy grader. I never got anyhting below a B+ and for L and R that's great. He probably is a nice guy, just not in class.\nWorkload:\nLight.\n"
        }
    ]
}