{
    "prof_info": [
        {
            "prof_name": "Sidney   Nakahodo",
            "prof_id": 13643,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Political, Social, and Economic Development of Brazil I",
            "review_date": "December 26, 2018",
            "review_content": "\nI took Political, Social, and Economic Development of Brazil as an Economics major and with an interest in international affairs, particularly in emerging and developing economies. Within the first month, I was sure that I had made a bad choice in choosing this class.\n\nI commend the professor for inviting prominent political and economic figures from Brazil to engage the class but the course material, what we expected and the execution, class after class, was out of sync and chaotic. If your interest is to meet popular figures from Brazil in a small and crowded classroom, then you are up for a show every two weeks. If it is to receive a pity grade, I recommend this class. If you are accustomed to getting easy A's while barely putting in any effort in group work, you are up for a treat. If you plan on taking the sequel of the course, the professor is your best friend. However, if you are driven and ready to learn, look somewhere else. \nThis is an extremely mediocre class with mediocre expectations. Going into this class, I was hoping that we would spend more time having deep and engaging conversations around economic and political issues in Brazil and while we did touched on topics that I believed were important to the speakers, I was left dull and confused after most classes. There was just no substance. Besides the language barrier of some of the speakers, I did enjoy some classes. The professor however, was very inconsistent in his lecture were bare and ineffectual. He did not seem very knowledgeable on a lot of topics and slurred his way throughout most of the sessions. Instructions for assignments were not clear and concise and he did not provide feedback for assignments submitted earlier in the semester until the very last week of class. He is very selective on what emails he responds to, he hardly responds and constantly cancels office hours. It is difficult to schedule meetings with him. \nThere is so much more that we could have achieved in this class, but there is nothing memorable it. \n\nWorkload:\nClass attendance and informed participation (15% of the grade)\nA 600 to 800-word Op-ed (25% of the grade)\nA 2,000-word team project proposal addressing any of the topics of the course, subject to instructor's approval (15% of the grade)\nAn 8,000-word team project addressing a concrete problem (45% of the grade)\n"
        }
    ]
}