{
    "prof_info": [
        {
            "prof_name": "Christina Viereck-Hunter",
            "prof_id": 8429,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "September 10, 2009",
            "review_content": "\nI felt immensely fortunate to have Christina Hunter for Art Hum.  Her lectures were elucidating and detailed, and she didn't waste time digressing on tangents and useless questions like \"what IS art\" (something I find annoying about Core classes).  She was very clear about what she wanted us to know, and while she does focus on essay writing, I felt I learned quite a lot about how to analyze and write about art from taking her class--she was very open to giving feedback on drafts and encouraged office hour attendance.  Christina's rich background in art and her subtle sense of humor made my 9am class completely worthwhile.\nWorkload:\nQuiz on architecture, two seven-page papers, standard Art Hum final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 05, 2009",
            "review_content": "\nChristina is one of the few actual professors who does this class, and she really knows her stuff. I was surprised by how much I got out of the class, and how much I actually enjoyed it. She was often silly and funny, be really engaged the class in an intelligent discussion. She was always encouraging students to give her drafts, come by office hours, and talk with her, which I should have done before one of my papers since I took it in the completely wrong direction (though she still gave me a lenient grade for what I did do and I was able to make it up on the final). Since you have to take Art Hum, I would recommend her if you want to actually get something out of the class.\nWorkload:\nreadings that were completely optional, 2 papers (6-8 pages), one quiz, one standard Art Hum final (slide identification and comparison)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 19, 2007",
            "review_content": "\nDefinitely a good choice for Art Hum.  Despite my respect for it, I don't ever expect to get into a good Core class knowing that the spectrum of the quality of instructors is quite spread.  Prof. Hunter makes Art Hum painless.  She is quirky and funny, even though the lectures can still be a bit of a bore.  Any art enthusiast will like her class and it is certainly endurable for others.  You can't ask for a better art hum professor (I'm not saying she's the best, but since you must choose at random for art hum, you can't complain if you get her).  The workload is light, but you still learn about what you need to know.  Basically, you'll get out of this course what Columbia hopes all students get out of art hum.  She trains you well enough in formal analysis and the history behind the artists and their works.  You can take as much or as little as you like from this class while still having a good experience.\nWorkload:\nLight.  All the readings are optional, and are for your own personal interest; they aren't necessary for the exams or assignments.  Three 3-5 page essays concerning architecture, sculpture, and painting - a breeze if you have little trouble with creative writing/formal analysis.  The midterm is 20 one-minute slide IDs (a pain) and three short comparisons.  The final was 5 fifteen-minute comparisons, which were all painting IDs from the second half of the semester.  Trips to the MMA and MoMA are mandatory, but are flexible.\n"
        }
    ]
}