{
    "prof_info": [
        {
            "prof_name": "Samuel Pluta",
            "prof_id": 3575,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 19, 2013",
            "review_content": "\nThe best class I have ever taken at Columbia. I wish that I took this class with Sam sooner and learned how to actually listen. You'll be exposed to new types of music you've never heard before and never thought existed (while your friends are still concentrating on classical music). At first, you'll find it weird and then you'll grow to love it. \nSam really cares about what his students should actually take from the course - \"I just want you guys to learn how to listen.\" He won't drone you on remembering music, dates, composers, but rather teach you techniques to actively listen, to hear those nuances you didn't hear before. You will apply this whenever you see a movie and hear the film music and whenever you're jogging and you realize \"wow I never heard that sound before.\"\nThanks Sam for teaching me how to listen and give the most relaxed yet interesting class ever.\nWorkload:\nSemi-weekly write-ups that shouldn't take more than half an hour. A take-home midterm and final. 2 concert reports. The grading isn't strict and depends on your effort and enjoyment of the assignment.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "September 15, 2009",
            "review_content": "\nSigh, Sam Pluta. Music Hum went from a class I was initially dreading to a course that I became really excited about every time I went to class. After hearing horror stories about other MH teachers, I was worried but there wasn't a single piece of music that sucked or that was boring. Sam worked to make sure we were constantly engaged with the material and never meant for the class to be anything but fun. He spent the last weeks of the class focusing on music he really loves: electronic music, film sounds, and free jazz/noise. He taught us a dance for the Tennessee Waltz, he made jokes, told us funny stories, and played Phil Collins for us. He was incredibly chill and I STILL feel like I learned more about the works we listened to than I would have in a \"serious\" environment. Sam wanted us to engage with the music as listeners and to pick up the nuances and subtleties of each piece and after the course ended, I realized that I had. I also really liked that Sam tried to get everyone to express their own tastes and he encouraged people to bring in samples of music.\nMy only complaint is that we did not need to buy the textbook ($100 and I barely opened the damn thing).\nWorkload:\nTwo concert reports, take home midterm and final (short papers) and listening test (VERY EASY if you keep up during the semester)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 21, 2008",
            "review_content": "\nOn the very first day of class, Sam set the tone for the entire year. He stated that \"this class is meant to be fun, and if at any point it isn't fun, please let me know.\" He gets it. When students take core classes like Music Hum, chances are that they don't have any plans to make a career out of music or art or the Frontiers of Science. Rather, the teacher should treat the class as an opportunity to instill a basic love of the subject in each of his or her students and demonstrate the majesty and breadth of what is out there. Sam did this like no teacher I've had at Columbia has. He didn't make us memorize sonata form (he did go over it) or the exact dates famous composers died...rather he spent his time and energy breaking down his favorite individual pieces of music, revealing sides that casual listeners wouldn't recognize. For our concert reports, he encouraged us to go out and sample the experimental and electronic music that he loves. I was introduced to a vast amount of \"modern\" music that I'd never even heard of coming in, and now continue listening to and enjoying even though the class is over. Personally, he's a brilliant person and complete riot: We LOL'd over and over again every class. Sam has inspired me to continue my musical education at Columbia: I'm taking Fundamentals of Western Music next semester and might even end up concentrating in Music. I've had a lot of wonderful teachers at Columbia, but Sam has been the best I've had so far.\nWorkload:\nNightly listening assignments, occasional writing assignments, two concert reports, midterm and final. You will enjoy them all.\n"
        }
    ]
}