{
    "prof_info": [
        {
            "prof_name": "Jayne Hildebrand",
            "prof_id": 13674,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "The Victorian Age in Literature: The Novel",
            "review_date": "April 07, 2021",
            "review_content": "\nI love Prof Hildebrand! I already had an interest in the literature from this era, and she really helped me develop a solid grounding in it. We read Jane Eyre, A Christmas Carol, North and South, The Mill on the Floss, and Tess of the D'Urbervilles -- all great. My class was really talkative, and even though the course is billed as a lecture, she splits it between lecturing and discussion. Lots of close-reading passages as well. She's super helpful in office hours, as well as funny and kind; didn't find her to be a difficult grader either. \nWorkload:\nAround ~100 pages of reading per class, sometimes a little less. One 4-5 page paper, one 5-6 page paper, discussion posts every so often, take-home final.  \n"
        },
        {
            "course_name": "Critical Writing",
            "review_date": "December 17, 2020",
            "review_content": "\nAMAZING. An absolutely incredible professor—so kind, understanding, thoughtful, creative, and also funny! Genuinely funny! She made us all laugh multiple times throughout this semester with her wit (and over Zoom nonetheless!) Definitely one of the highlights of this very challenging virtual semester. I would honestly recommend any class with her. She turned Critical Writing from a mandatory ho-hum class to an absolute joy. I highly, highly recommend this course with this professor.\nWorkload:\n1 discussion post per week.\n1 mini-essay (3ish pages) \n4 full-length essays (approx. 7 pages) \nProbably around 100 pages of reading per week (10-20 pages of research/theory, 50-75 pages of fiction)\n\n"
        },
        {
            "course_name": "BC1201 First-Year English; BC3260 The Victorian Age in Literature",
            "review_date": "April 15, 2019",
            "review_content": "\nShe's a new professor but she's honestly the sweetest person in the world. She learned all of our names in a lecture class within the first few days of class, which is ridiculously impressive. She got her PhD from Columbia in May 2018 so she's completely understanding of the BC/CU student experience and she's even lurking in buy/sell/memes. Would highly recommend any class with her! Heads up though: she expects and requires *everyone* to participate, seminar-style, even in lecture classes. Grading is as expected, she seems to mostly hand out A-/B+ grades on papers but with extremely detailed and helpful comments\nWorkload:\nVery reasonable. Light readings for an English lit class\n"
        }
    ]
}