{
    "prof_info": [
        {
            "prof_name": "Paul Kockelman",
            "prof_id": 1837,
            "total_reviews": 28
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "April 18, 2012",
            "review_content": "\nThis class was challenging, but very rewarding. The concepts seemed beyond an introductory level, but Professor Kockelman is very clear and very knowledgeable. However, it is difficult to judge what your final grade will be, so be wary your progress. Professor Kockelman was moderately interactive, though most of the material was beyond the discussion capabilities of the students. I was very challenged by this course, and ended up with a B+ after completing all the homework assignments and working very hard on the final paper and exam.\nWorkload:\nOne reading and one page summary per class. The readings range in length from 30 minutes to an hour and a half of reading.\n"
        },
        {
            "course_name": "Functional Linguistics",
            "review_date": "June 14, 2011",
            "review_content": "\nI can't disagree with the previous review more.  What a complete disaster.\nThe class was a small, 15-20 person seminar.  Kockelman probably only knew half of the names of students in the class - classes consisted of Kockelman's rambling lectures that were rarely interrupted by student participation.  Kockelman only knew the names of the kids who went to office hours - office hours that were extremely inflexible, occurring for 2 hours once a week after class (often still canceled) and no other time possible.  I'm sorry, but my idea of a seminar is a class where a professor makes some kind of effort to get to know his/her students.  None of my emails asking for different office hours or asking simple homework questions were responded to.\nAnd sure, his mannerisms are definitely amusing, and he does indeed know and understand Q'eq'chi and however many other languages and that certainly makes him a capable linguist. But for the dense material covered, Kockelman was an incapable professor - it was nearly impossible to follow along and comprehend everything in a 2 hour span in a small classroom while I listened to Kockelman's head spin.\nAnd I have to STRONGLY disagree with the part where the previous reviewer says you should take this an elective.  You should NOT take this as an elective.  The readings, although on the surface seemed straight forward and short, were excrutiatingly dense and difficult to understand.  Whenever a problem set was assigned, it generally was a marathon of redundant exercises that still ate up many hours.  This ate into the grades for my other classes.  (don't think this is a requirement for linguistics concentrators, either)\nSo, after coming to these sad conclusions 2/3rd through the semester, I P/F'd the class, cut most of the rest, and stopped giving in homework.  And guess what.  I got an A-.  Yes, an A- in a seminar where I missed at least 5 classes, gave in maybe half of the problem sets, and guarantee that the professor needed Columbia's Facebook to put a face to my name (and I don't even know if that helped).\nI can't imagine that he even checked the homeworks, although rumor was that he left them outside his office.  Apparently the entire class was based on a final exam that I spent ~2 hours studying for.  The tragedy to all of this was that the subject matter was really, really interesting.\nWorkload:\nlong weekly readings, approx biweekly problem sets\n"
        },
        {
            "course_name": "Functional Linguistics",
            "review_date": "May 14, 2011",
            "review_content": "\nI can't speak enough to what a wonderful professor Paul Kockelman was. At the very beginning of the semester, I admit that I found it difficult to take him seriously. He has a very playful picture on the departmental website, and dressed down for the class. He jokes a lot, and has a few peculiar mannerisms, like his laugh [which is adorable]. As he proved to us as the weeks went on, though, he really knows his linguistics and his methods extremely well, and knows how to dissect a reading for a class.\nThe class covers a functional (not theoretical) approach to language from the very beginning, in terms of scale and of chronology. You begin with Bloomfield's form-classes, the founding work of this branch, and examining parts of language from micro to macro. Morpheme>word>clause, etc. An excellent aspect of Kockelman's teaching style is that he constantly recaps what has already been discussed in class, as well as how it fits into the general schema for what you should be learning from the class. It's very cohesive and well-designed, and shows in the style of seminar. \nKockelman's knowledge of Q'eqchi' is also astounding- he really has a mastery of many Native American languages as well as traditional European ones. It gives a definite sense of reality to the course, something regrettably lacking in other linguistics courses. \nIn short, TAKE Kockelman. Doesn't matter if it's for your linguistics major, an elective, or for nothing at all. It will change how you think about your words and language in general.\nWorkload:\nProblem sets weekly (in the reading).\n"
        },
        {
            "course_name": "V1009 Introduction to Language and Culture",
            "review_date": "December 21, 2010",
            "review_content": "\nThe structure of the class was totally changed this semester, definitely for the better. The reviews under this one seem to be fair depictions of what I'd heard prior to taking the class, and I have to say, I was a little terrified going in to this semester. However, the class ended up being amazing. I have learned more in this class than in any other Intro Anthro class I've taken, and been exposed to theorists and modes of analysis that I'd never even heard of (I'm a junior majoring in Anthropology). \nThe class was limited enrollment this semester, which allowed Professor Kockelman room to engage with the students frequently and lecture to a smaller class. He started off the class by warning everyone that some people would get Bs, and if they were scared of that, they shouldn't take it. After the first week, I found I was growing more and more comfortable with the classical linguistic analysts he exposed us to, and was able to recognize their work in contemporary articles he assigned too. He did a great job explaining the very difficult concepts and was always open to questions (however, it did take him a while to notice that hands were raised, sometimes). \nI have to say, the class was a really great experience: challenging and totally worth it. Professor Kockelman was seriously interested in what we had to say and made sure to engage with us more so than it seems he's done in the past. \nWorkload:\n1 or 2 articles a week (1 per class), a midterm paper, a final paper \n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "December 10, 2009",
            "review_content": "\nI am a linguistics major, and I took this class after reading all of the reviews that said \"oh this would be fine if I were a linguistics major but I'm an anthro major and it was ridiculous.\" Well, let me just tell you: It's still ridiculous, even if you're a linguistics major. WTF was going ON in that class?! I still don't know, and I took it in Fall '08. My other two linguistics major friends liked it, so maybe it was just me, I don't know. \nThis class sucked. The lectures were interesting enough but very difficult to take notes for. The readings were not so great, but that is often a problem with linguistics readings, although I will say his were more incomprehensible than most. The midterm and final were...weird. I got an A- on the midterm and had hardly done anything, no studying, nothing. The final came, I actually tried and studied and...I ended up with a B- in the course. WTF. \nAlso, he's not an accesible professor. Like at all. Do not email him. Ever. He won't respond, or if he does it will be like 3 weeks later.\nI took this class after taking Functional Linguistics with him the semester before. That class made SO MUCH MORE SENSE. I highly recommend it, even without taking this class beforehand it was infinitely better. Also, the final was easy and that's basically all the work for that class. Although, I personally wouldn't take a class with Paul Kockelman if I could help it. If you're interested in linguistics, I highly HIGHLY recommend Professors Alan Timberlake of Boris Gasparov in his stead. That is all.\nWorkload:\nReadings which aren't really helpful, a midterm and a final that are crazy.\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "September 22, 2009",
            "review_content": "\ni'm an anthro major, and i have to say, not the best intro class to take. the concepts are difficult to grasp, because, to me at least, it requires a certain type of crazy, acrobatic thinking. Kockelman is a great thinker in this respect. it's obvious that he knows his stuff. but his approach to presenting it is a little difficult to follow. he talks fast and writes really small. that said, however, he's sometimes really funny in lecture. \none problem i had, beyond not really learning a thing in this class, was the exams. kockelman himself said not to worry, make the cheat sheets, and don't even bother reading from the course packet. interestingly enough, details from the readings were on the exam. and the cheat sheet doesn't matter in the end, because you'll just spend half the exam time looking back and forth from the test paper to the cheat sheet, perplexed with what is in front of you.\nWorkload:\nthere are only two exams, so every point counts. he says you shouldn't do the reading, yet some of it is quite relevant for the tests. read semiotic stance, his article, which is helpful. \n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "April 24, 2009",
            "review_content": "\nTaking this class was the biggest mistake of my life. I could not follow his lectures; 1) he speaks at an incredibly quick pace making note taking extremely difficult, 2) he writes on the board at random with zero forethought and uses microscopic lettering (back row anyone?).\nReadings are incredibly dense and he doesn't know how to lecture for non-linguistics majors (dude this is an introductory course so no one cares if you can speak 100 languages if you can't lecture worth a damn in English!!)\nThe exams are cryptic and there is little to no chance of redemption if you bomb the midterm (as he does not give extra credit or any other assignments that can buffer your final grade).\nPreserve your GPA and save yourself from this guaranteed nightmare!!! An abstract and detached professor awaits you if you decide become a hero!\nWorkload:\nNone. Tons of reading. 1 Midterm (40%), 1 Final (40%) and an imaginary (20% for classroom participation... don't count on it!)\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "December 31, 2008",
            "review_content": "\nafter i got out of the midterm, i was kind of pissed at some of the below reviews on culpa, which made the class seem a lot easier than it is. i am an anthro major, not specifically interested in linguistics, and i found this course to be very challenging, and i struggled trying to understand it when preparing for the tests. it is easy to lose yourself in the lecture, not really paying attention to the material, as it is kind of hard to grasp (but interesting, nonetheless). paul is a really funny guy, who was so interesting to listen to. the problem i had, however, was that he made it seem like the tests would be easy (and we were allowed cheat sheets), but i felt betrayed when the tests came. Contrary to some below reviews, it is very necessary to do many of the readings, especially the ones he mentions in lectures. i made that mistake on the midterm. they help, as i found that when i sat down to study, his lectures were all over the place and i actually had a hard time comprehending my notes, as there was little sequence. I don't not recommend this class, however, but be forewarned.\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "December 17, 2008",
            "review_content": "\nPaul Kockelman is a good professor.  The fact that he delivers lectures without notes or powerpoints is amazing. (and the lectures are organized)  With that said, DO NOT take this class for exposure to anthro.  I took this class thinking it would help me decide if anthro was right for me, and it's basically a linguistics class.  Sometimes I understood the material, other times I felt like he could've been speaking a different language.  If you do have experience with anthro and/or linguistics DEFINITELY take this class.  Paul is very entertaining and engaging. I had a lot of laughs in this class, and I did walk away with concepts. He doesn't just lecture.  He opens up room for questions.  Do what the other reviewers say and GO TO LECTURES! It's a good class,-- if it's in your field of interest.  \nWorkload:\nreading that can be confusing and dense (don't stress over reading it, just pay attention to authors b/c he refers to them on the exams), midterm and final both with 1pg d-sided notes, no papers.\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "December 17, 2008",
            "review_content": "\nTo preface this review, I want to say that I actually love Paul Kockelman.  With that being said, this class is NOT easy by any means.  Concepts are extremely abstract and difficult to understand, but if you really try, you can get a lot out of the class.  Apparently people get by with just studying lecture notes and without doing the readings, however to do well on the tests (which are NOT easy like other reviews have said) you have to do at least some of the readings.  This class is about connecting and applying abstract ideas, not just spitting back material.  This class was definitely one of my favorite this semester, but it is not an easy A.  Make sure you know what you are getting yourself into when you sign up.\nWorkload:\nLots of Readings (necessary, unlike some of the other reviews have said), Midterm, Final\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "January 19, 2006",
            "review_content": "\nKockelman is great! He is a very strange man, but in a good way.  He has random thougths and acts out what he is talking about. But these are some of the reasons why it was intersting.  His lectures were always interesting, relevant, and necessary.  I did one or two readings at the beginning and stopped because they at times had very little to do with the lectures.  Everything that was on the test was in his lectures-so go to class and take good notes.  They are entertaining anyways so why not?! The material was ok but its worth it just for him.  \nWorkload:\na midterm and a final both with notes-both doable\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "January 16, 2006",
            "review_content": "\nI enjoyed this class, and I especially recommend you take it if you need it for the barnard requirement. I'm a science person, but I still found the lecture's interesting.  You don't need to do the readings at all, but you must attend the lectures and pay attention.  Study your notes a few days before the exams and you'll do well.  He even lets you bring in 1 double sided page of notes to the exams, so that really helps.  It's a easy to fair class, that's interesting, doesn't require any reading outside of the class, with a cool professor. \nBut, you shouldn't take it if you want to take a true anthropology class, to me it felt like more of just a linguistics class. \nWorkload:\nMidterm (alittle too long, i ran out of time...) and final each with a sheet of notes. Very fair exams. All short answer. \n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "October 23, 2005",
            "review_content": "\nWords cannot express how wonderful this man is.  Neither can they express how many girls have developed crushes over his detailed explanations of semiotics, the theoreticians he quotes verbatim from memory, and his kind bespectacled gaze that treats each and every student question as if it brings up some valuable point he otherwise might have let fall by the wayside.  Paul Kockelman has the remarkable power to transform what could be an utterly dry and technical subject into a series of enthralling lectures, which he delivers entirely without notes in an utterly organized fashion.  They are only interrupted by the occasional question and the times when he paces into the furthest corner of the room and leans silently into it, his eyes flickering left and right as if reading some invisible text.  He refuses to cap classes, so keep going even if the registrar tells you it's full.  Ten or fifteen people every lecture end up without desks and have to sit on the floor in the front, but it's entirely okay--you're then all the closer to swoon up at him.\nWorkload:\nDon't bother reading; he does a much better job of explaining everything in class.\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "July 10, 2005",
            "review_content": "\nI cannot say enough about the clarity, enthusiasm, and care with which Prof.  Kockelman delivers lectures/seminars/discussions at office hours (go if only to gawk at his bookshelf). Language and Culture will probably be oversubscribed and half of the students either won't care/won't work. Pay attention in class and do the readings - you stand to gain a ton from this class (particularly his readings of saussure/vygotsky/goffman). I would recommend taking this (or another lower level class) before a seminar, both to get used to his style and also because there will be a lot of crossover in the classes (presumably this holds for the agent,person, subject, self course as well). Labour, Exchange, Measurement and Value is a graduate seminar with a lot of reading which is totally worth it, again provided you are willing to work yer arse off. That said, Paul is also one of the more outgoing and friendly professors i have had at my time here, and has saved me on more than one occaision when that nasty awkward silence filled the room...incredibly fun guy, unbelievably clear and measured thinker, and a great teacher. Its rare to see such enthusiasm...\nWorkload:\nAs much reading as you can handle - there is a lot to do if you do it all (particularly the seminar) but its not absolutely required...Language and Culture is primarily articles/excerpts from books. \n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "February 07, 2005",
            "review_content": "\nThis class should be renamed \"language,\" because it  has absolutely nothing to do with a study of culture. Paul gets an E for effort in his attempt to make the unbearable content of this class interesting, but at it's core the class is a bunch of meaningless linguistics shite that has little or nothing to do with anthropology. The readings are very close to philosophy readings in the sense that no one can bring themselves to understand or care about them.  The material of the course consists of memorizing a random collection of linguistic terms and then reciting them upon command for the exams. The Grading is determined entirely by the double threat TA's.   The few classes that the TA's tried to teach while Paul was away were  train wrecks.  Some reviews claim that Paul and his class \"rock.\" I have no idea what this class rocks, it was awful.  It should also be noted that in my opinion Paul is awkwardly passive aggresive ,but he is quite approachable and helpful in person. If you're looking for an introductory course for anthropology, this isn't it.   \nWorkload:\nreadings that are never read, midterm, final, threats of pop quizzes that never  \n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "January 04, 2005",
            "review_content": "\nThe first couple days of pk's class terrified me, and I dilgently shlepped down to the 80s to pick up the course packet and spent hours attempting to decipher the readings. I quickly realized that the readings were completely unnecessary, and all you have to do is show up to class and a few days before the midterm and final start reviewing your notes and make sure you have some idea of what's going on. for the midterm/final you definitley have to understand the concepts, but as long as you show up to class everyday and are remotely intelligent, you'll be fine. If you only come half the time and memorize your friend's notes to fill in the empty spots, you won't do well. you really don't have to do any outside work, so just make sure to show up everyday and not fall asleep. the man walks into class everyday with a different food or drink, whether it be espresso in an old Poland Springs bottle or blueberry yogurt. HIs mannerisms are bizarre, but in a most endearing sense. you'll probably walk out of class scratching your head wondering what in the world just happened during the past hour and fifteen minutes, and this feeling will remain for a couple weeks. then pk will randomly come to class, spend ten minutes reviewing, and everything will magically make sense. I thought I didn't learn a thing, but I mysteriously find myself constantly referencing the concepts we discussed. good class to take if you like linguistics and/or human interaction, not if you're looking to learn a little about basic anthro. \nWorkload:\nreading you ABSOLUTELY do NOT need to do, two pop quizzes  (the second of which never happened), and a reasonable midterm and final that will merely test your understanding of the concepts. \n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "January 02, 2005",
            "review_content": "\nPaul is a fascinating guy!  His knowledge and energy are astounding.  He came to class every morning equipped only with a tall glass of some radioactive-colored juice and proceeded to give lecturers straight from his brilliant noodle.  Content-wise, the course changed the way I think, truly.  This is one of those classes that gives you a whole new perspective and, as Paul would say, an entire meta-language for thinking about language and how we use it.  This stuff will seriously take over your brain and be infinitely useful in all your other classes.  As for the man, well, he's nothing short of genius and entertaining to boot.  So whatever you do, take this class before you graduate and enjoy every second of it! \nWorkload:\nAbout 20 pages of really interesting reading from the course pack for each class.  One midterm and one final, both fair (although it's really impossible to test on this sort of material, so don't expect an opportunity to really strut your stuff on the exams.  They're pretty basic, disappointingly)\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "January 01, 2005",
            "review_content": "\nPaul is an amazing professor. He does a great job of posing questions and drawing comparisons that link the course content to other disciplines and life in general. His style of lecturing is very personable and although I have never spoken to him at office hours, I feel as though if I ever needed to, he would be very easy to talk to. \n  It took me a couple weeks before I really got into the course and to appreciate all of it, but I would definitely recommend it to anyone who wants an introduction to language in the cultural anthropological context. \nWorkload:\nLots of readings that get more interesting as the course moves along. One midterm, one final. He said that there would be 2 pop quizzes on the syllabus but we only had one and I think he may get rid of them, or at least announce them before hand...Not bad at all, just keep up with readings.( Paul is also very good at pointing out what you need to know from each of the readings in his lectures, so attendance is key)\n"
        },
        {
            "course_name": "Agent, Person, Subject, Self",
            "review_date": "December 30, 2004",
            "review_content": "\nHonestly, Kockelman is the best professor I've ever had at Columbia.  The man is brillant, funny, and very approachable.  If you are interested in language and capable of thinking outside the box, this is a professor you don't want to miss.  He explains very complicated concepts in a clear manner, and had changed the way I look at the world.  From Language and Culture to Agent, Person, Subject, Self, Kockelman shines as a linguist and an anthropologist.\nMy number one suggestion for those of you who take his classes: go sit down and visit with him!  He is incredibly personal and helpful outside of the classroom.  He can listen to ramblings and unclear ideas and help you formulate a clear thought process.  Even if you just want to talk to him in general, I promise you he has read something on your topic of interest.\nI can't say enough good things about this man.  His examples in class are hilarious.  From getting on the floor and imitating a dog's tools and affordances, to quotes like \"Freedom! Democracy! Driftwood!\" or a random poem about a ruedebbega he keeps you on your toes with great humorous moments.\nWorkload:\nThere is a great deal of reading for the class, some drab, some really interesting.  However, you don't HAVE to do ALL the reading.  We wrote two papers comparing two of the readings- the best thing to do is talk to him about the paper topics.  He knows his stuff, so make sure you know yours.  Otherwise, this is one of those classes where you care less about the grade and more about what you're really learning.  \n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "December 27, 2004",
            "review_content": "\nI'll make this short and clear.  He's a brilliant, eccentrically funny professor.  He's a lenient grader, although he comes off as pretty scary at the begireview_content  review_content your notes and you'll do well in his class.  There's an extra-credit problem on the final, for God's sake!  The material is pretty interesting as well, so you'll probably WANT to review.\nHighly recommended professor.  What he taught in this class changed my world-view.\nWorkload:\nNOTHING! Only a 4-problem midterm and a 4-problem final.  There were supposed to be 2 pop quizzes worth 10% of the grade.  He only gave one, and later said that the quiz \"could only help you.\"\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "December 22, 2004",
            "review_content": "\nThe class was a very interesting lecture that I think would have worked much better as a small seminar.  Paul is a hilarious & intelligent speaker, but classtime went to explaining the main ideas of the readings rather than engaging with them or discussing their anthropological significance.  I felt like a lot of people in the class were disappointed that it was not a straight-up anthro class but  instead more like a survey course in linguistics.  So be warned!  That said, I thoroughly enjoyed the class, feel like I learned a lot, & was very impressed by Paul's obvious enthusiasm for the subject.  Hence: a wonderful professor but the class structure could be improved -- and it would be nice if Columbia or Barnard offered futher, more in-depth courses in the material touched upon in this intro.\nWorkload:\nWeekly readings that are totally unnecessary (you are only tested on what Paul says in class) and often seemingly unconnected to the lectures.  Amazingly easy midterm and final, both of which Paul then scales.\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "December 19, 2004",
            "review_content": "\nHaving had Professor Kockelman last year and just recently deciding upon anthropology as my major, I've found myself a bit more serious and knowledgeable about the anthropology field this semester. Looking back on Kockelman's class, I've come to realize that it was a VERY good class to take if you're at all interested in anthropology.  That being said, I believe that this class should NOT be an introductory course as it incorporates a wide range of diverse and almost random mixture of cultures and societies to concentrate on.  And it's hard to grasp the essence of all of these societies, concepts, and specific key components of each varying language/communication system- esp. for first years and anthro.-first-timers.  I took it my first semester freshman yr having only a vague idea of what anthropology even was and unfortunately threw myself into a very detailed and seemingly-confusing course.  However, the course material IS very interesting (having gone over again this semester) and useful if you keep your focus and by all means- MEET WITH THE PROF!  He is an incredibly nice and sweet individual who is completely fascinated with his subject.  His passion for the content and his intelligence (he was actually a physics major at stanford/ucla- i forget which one) might even spark an interest in ya'!\nWorkload:\nLoads of reading (which is characterisitic of most anthro. courses) & although you don't have to read everything you will need to make sure you know key ideas from each reading.  Hard to retain the info sometimes.\n"
        },
        {
            "course_name": "Agent, Person, Subject, Self",
            "review_date": "December 13, 2004",
            "review_content": "\nprof kockelman is enlightening, entertaining and enthusiastic. he delivers brilliant lectures in a very lucid fashion and always goes above and beyond the readings, synthesizing the material in a new and usually fascinating way. the class is fantastic- it is the best class i have taken, and paul is the ideal professor. \ndo whatever you can to take this class with him\nWorkload:\nheavy readings- they are very interesting, but they needn't all be done to do well in class. the grade consists of participation and 2 essays ( 5 and 10 pages respectively).\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "November 16, 2004",
            "review_content": "\n   I am currently in this class as well, however I disagree with some of the points made by the previous review. If you want to learn something completely new, something completely unexpected that you would never have thought of in a million years, this class is far from DULL . Every thing I have learned in this class has blown me away. This is what college is for!\n    The work load is not too heavy, but the reading is dense, especially in the beginning but don't lose hope! At first i was literally reading the passages three times because it seemed to be in a different language. This said,  Prof. kockleman really hits the important points in the lecture and breaks up these readings that ramble on for fifteen pages into about three sentences. He also tells you specific things to note about the reading ahead of time, so that you are not completely frustrated or bogged down. \n    Prof. Kockleman is very entertaining and engaging, very passionate about his subject and about teaching you this material. He is also approachable, always addressing the class of about 120 with a \"hey gang!\" , and willing to answer any question in class (no matter how stupid it seems to the rest of the audience).\n    As to falling asleep in class, well thats your own problem. I wouldnt recommend it because you will miss a lot. Besides it is fairly difficult to fall asleep when you are engaged and interested in the material and paying attention. \n    The only complaint about this class were the TA's. There were three that so far have only taught twice and it seems that only one of them knows what is going on. The second cannot speak English very well and doesn't speak loudly enough which is a shame bc the first day I sat in the back and was very annoyed but the next day I sat in the front and he actually had really good points and examples. The last just acted annoyed with us all the time when we asked her to speak up bc she mumbled the entire time. \n   Beacuse of this class, I want to be an Anthro major or at least a minor!!! I cannot promise you will like this class, obviously the previous review did not. Like any class and professor it is a matter of personal preference. But look at how many good reviews there are and then how many negative ones, and hopefully if you take the class you will not be disappointed.\nWorkload:\n   Very dense reading at first- dont let it scare you! It definately gets better. You can get away without doing all of it bc the prof goes over  it in a much more conprehensible style. This said, when it is time for the midterm, you will want to have at least have known who said what and be able to reference them. \n   Be careful of the pop quizes!! The prof went out of town for a week. The first class the TA's taught was completely boring (the first and only  time so far I fell asleep) so a lot of ppl skipped the second class. But !danger! there was a pop quiz on the in-class notes from that lecture. So just watch out, there are two per semester and they are collectively 20% of the grade.\n   I can't speak about the final yet, I havent had it, but the midterm was tidily comprehensive and very very fair even though I didnt do very well on it. Really know the concepts inside and out. It is really like learning another language. There is a lot of material, but its incredibly fascinating!! My floormate and I are constantly saying how much we love it and how we cannot beleive the stuff we a learning. It is truly exciting! \n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "November 06, 2004",
            "review_content": "\nPlease don't listen to the other reviews of this class.\nI was fooled by them when I chose to take this class, which I am currently taking.  I entered it considering an athro or lingustics minor and now I refuse to take another anthro or linguistics class ever again.\nDon't get me wrong, Paul is a fairly engaging and very knowledgeable professor.  The examples he comes up with are ingenious and I always marvel at them.  However, the class is DULL, DULL, DULL.  The readings are beyond tedious and I end up never doing them because every time I try I am immediately bored to tears.  A lot of them, especially those in the beginning, are impossibly convoluted.\nFortunately, Paul goes over the main points of the readings (and the things that are on the midterm/final), which is helpful because lecture notes & study groups are somewhat sufficient in studying for the midterm/final, which are difficult.  But lecture notes are hard to come by because you will mostly likely fall asleep in class (a fairly large portion does so).  I'm not sure if it's the 10:35 start time, or just the awful material, but it's not a good situation.\nI had high hopes for this class, but now I can't wait til it's over.\nWorkload:\n20-30 page reading per class (usually difficult, but not really necessary unless you somehow like this class), a comprehensive but not that difficult midterm, final that I can't comment on yet\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "December 10, 2003",
            "review_content": "\nThis is by far the most fascinating class I've ever taken- and Paul Kockelman is absolutely the icing on the cake. The man is brilliant and hilarious and completely approachable. If you get the opportunity to take a class with Paul, consider yourself blessed because you will come out of every class feeling incredibly inspired. When I began, I was interested in Linguistics. Now I'm completely inspired to major in it.\nWorkload:\nTotally fair- about 20 pages of reading (one article) per class (and you will WANT to read them), a midterm and a final (both in-class and hard, but generously graded)\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "December 08, 2003",
            "review_content": "\nHands down Paul is the best professor suited for this job! Just recently discovered and hired by Barnard, he engages the class lucidly in the work through his eccentric and humorous examples and mannerisms. As for the class work itself, it is only doing the readings, and even if you don't read them before class or perhaps ever (scanning works to but the readings happen to be so fascinating you'll WANT to read them!) you will be perfectly fine because Paul points out exactly what is important from them! Also, he incorporates examples from his own dissertation with the Q'eqchi Mayans and it is amazingly engaging and interesting, while he is also known to go off on how important some features of speech are, compares it to the importance of our hands and then bites the projector ilustrating how those are important! It's hilarious!! Now just go out right now and register for this class, you will be incredibly happy that you did! Linguistic Anthropology rocks!\nWorkload:\nReading for each lecture, Midterm and Final (both in class) - he gives you amazing breakdowns on review sheets for each one! and thats it!\n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "December 07, 2003",
            "review_content": "\nProfessor Kockelman is completely fantastic. His lectures are almost always engaging and clear, but his eccentric mannerisms and hilarious anecdotes are what really make his class so enjoyable. He is very friendly, approachable, and responsive to students' questions. Professor Kockelman provides helpful study guides for both of his exams, and is quite good at covering all important parts of the readings in his lectures. I plan to take as many courses from him as I possibly can, as he is intelligent, interesting, helpful, and entirely delightful.\nWorkload:\n2 exams (midterm and in-class final) that require you to answer 3 of 5 multi-part questions in short answer format, about 30 pages of pretty dense reading per class\n"
        }
    ]
}