{
    "prof_info": [
        {
            "prof_name": "Ashley Nail",
            "prof_id": 10952,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 20, 2014",
            "review_content": "\nMusic Hum with Ashley Nail was a dream. Ashley is an AMAZING teacher, and probably one of the best instructors I have ever had at Columbia, even being a grad student. She consistently made the class fun, both for people with extensive music experience and for people with none.\nShe really knows how to explain things in a way that make sense and in a way that you will remember and be able to talk about for years to come. She made sure all of us could make small contributions to the class discussions, and she introduced us to all sorts of cool music that was off the syllabus, as well, which was really neat. Her offbeat humor and cat lady jokes made waking up for 8:40 class totally worth it.\nShe did her lectures so well and also prepared us so explicitly for all of the assessments that if you kept up with the readings enough you could get great grades on all of the quizzes and papers. She also had all of the readings photocopied and put on Courseworks, so we didn’t even have to buy the textbook, which was great.\nI’m so glad I got put in Ashley’s section. It was the greatest Music Hum experience I think I could have hoped for, and I would consider anyone who gets into it really lucky.\nWorkload:\n20-30 pages of reading per week\n8 short quizzes based on readings\n5 short papers (1-2 pages)\nFinal\nNO Midterm\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 21, 2012",
            "review_content": "\nAshley was hands down one of the best teachers I have ever had. In all my time at Columbia, as well as in high school, middle school, primary school and yes, even Kindergarten. She brought tremendous enthusiasm to the class, an incredibly contagious enthusiasm that showed in her lectures, homework, grading and exams. I loved going to class because of her great personality. She made me laugh every single class period, while at the same time amazing and enthralling me with the syllabus pieces and her knowledge of them. She was insanely structured, which made the class easy to follow and extremely accessible. I loved music humanities, and Ashley made it an experience that will stay with me until death. \nWorkload:\n10 Quizzes (Not hard at all if you follow her study guides), 1 Final (A lot of writing but extremely fair and easy to study for), Extra Credit problem set, No midterm. Really great class to take it easy while at the same time learning a ton. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 01, 2012",
            "review_content": "\nAshley is amazing.  She puts a lot of time into preparing for the class, and has genuine enthusiasm for helping people understand the basics.  For example, she takes the time to photocopy the textbook so that you don't have to waste your money on it.  She gives quizzes once a week or so with review sheets so even when I felt lost (I have no music background) all I had to do was focus on those directions and I was more than fine.\nShe brings energy and appreciates participation.  I made myself raise my hand at least once a week so she knew I was giving an effort.  I know that I didn't bring a whole lot to the discussion, because some of the other students had a much larger working knowledge of music, but Ashley made it clear that she wanted us to comment when we could.\nI've heard from friends that they've not had the same pleasant experience as me with this class in particular so I'm grateful I had Ashley.\nWorkload:\n10 quizzes, two small papers, midterm, final.  She tells you exactly what to study for, so it's pretty stress free.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "September 07, 2011",
            "review_content": "\nAshley is hilarious. She is well organized - has the whole course mapped out from day 1 including softball quizzes (with quiz review sheets). The grading rubric makes it easy to do well without overly relying on the final exam. She can move quickly if the music nerds take over, but if you're like me and weren't forced to master the piano at age 2 then just speak up and she'll dumb it back down. All semester, I had other friends complaining about music hum, while I was actually looking forward to her class/personality. She's a really bright lady. AND - no need to buy the textbook - everything you need to read she has xeroxed and added digitally to courseworks. You can't choose art/music hum teachers, so if you get her, consider yourself lucky.\nWorkload:\nEasy - light reading with quizzes about once a week. 2 4-page papers, final exam, plus an option for extra credit\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 11, 2011",
            "review_content": "\nFantastic. She is a brilliant professor and one of the more passionate ones I have ever had. She is very organized and is always willing to meet with a student to discuss works, genres, and composers. Definitely take this class. She makes music humanities as pain-less as possible. Her love of the course will undoubtedly infect you. TAKE HER CLASS.\n8 quizzes on the readings or pieces. No midterm. Cumulative final exam on 7 known works and 3 unknown. Two concert reports (3-4 pages) and a final paper comparing two settings of a poem. Easy and straightforward. HIGHLY RECOMMENDED!! \nWorkload:\nLight\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 21, 2010",
            "review_content": "\nAshley is a great professor. She makes Music Hum no sweat - not that other professor's make it too stressful.  But she's very clear about what she expects her students to know and what she wants her students to get out of the class. In the end, her students do end up knowing a lot about music and getting a lot out of the class.  \nAt first she may seem a bit awkward in front of the class, but she's actually just quirky clarinetist and a lot more on the ball than one initially might assume.  She really knows her stuff - especially 20th century music and is clear about the genres she likes and doesn't like.  She's equally enamored of the older stuff and that passion often translates to her students.  When she's unsure of herself or unable to answer a question, she'll admit it.  But her knowledge is pretty extensive so that doesn't happen too much.\nAll in all she's a really sweet professor who's out there to make music hum as enjoyable for her students as possible - and in that she definitely succeeds.\nWorkload:\neasy.  weekly quizzes instead of a midterm.  three papers and a final. all very fairly graded. \n"
        }
    ]
}