{
    "prof_info": [
        {
            "prof_name": "Sharon Fulton",
            "prof_id": 2991,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Literature Humanities",
            "review_date": "August 19, 2014",
            "review_content": "\nSharon is a wonderful Lit Hum instructor. She's a little quirky, but super passionate and knowledgeable about the material, and she really cares about her students. She's definitely a hard grader, but she also provides a lot of constructive feedback and is really easily accessible for office hours and meetings. Though she follows the Lit Hum syllabus exactly, I always found the discussions she led to be interesting and thought-provoking. She also organizes some unique (and really interesting) activities like talking about contemporary court cases while studying Montaigne and reenacting scenes from To The Lighthouse. \nIn short, if you're looking for an easy-A Lit Hum, this is not the class for you. However if you want a really solid Lit Hum experience, and are willing to put in time and effort you can have a really great Core experience with Sharon. \n\nWorkload:\nStandard Lit Hum readings, 2 papers per semester (with the option to rewrite the first), passage analysis pop quizzes (first semester), a 20 minute presentation (second semester), midterm, final\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 31, 2007",
            "review_content": "\nSharon is definitely fair. At times she can be frustrating as her directions can be vague; however, I think this is as much the fault of the assignments as it is her's. The concenpt of the \"lens essay\" confused most everyone. She is very accessible and it's definitely wise to take advantage of her. She definitely likes to see her feedback in your revisions (which she is super generous about). Write the best rough drafts you can, because it makes life easier when the final deadline comes around. The more you write, the more feedback Sharon writes. She's quirky but good. And she gives out extra excused absences. Three for free.\nWorkload:\nShe assigns the standard essays that all UW classes get, but she's really good about giving deadlines for multiple drafts and revisions. She's also flexible with deadlines because, as a student, she knows how crazy certain points of the semester can be.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 14, 2006",
            "review_content": "\nShe's a nice person, although a bit of a hard grader. I did enjoy my class, because she did a good job of leading discussions and assigning reasonable projects and whatnot. \nGiven the nature of the class, she did a good job. UW is pretty useless and I'm pretty glad she was my teacher and not someone worse. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 20, 2006",
            "review_content": "\nShe's a nerd and chances are that you are too. So, there shoudln't be any clashing of ideals. She teaches to material exactly as she was instructed to. Nothing fancing and extra complicated is added. She's not memorable, but she's very nice and she will be respectful of all your questions and comments. Also, she could potentialy make you a better writer. Her comments on papers is fantastic and you'll find that any revision is going to be waaaay better.   She's helpful and sweet. That's all there is.\nWorkload:\nSame workload as all the other classes. Not bad. A few long essays that have to be revised until you turn 78, but I'd say that's standard.\n"
        }
    ]
}