{
    "prof_info": [
        {
            "prof_name": "Oliver Simons",
            "prof_id": 12632,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Survey of German Literature: 18th Century",
            "review_date": "April 30, 2015",
            "review_content": "\nTAKE HIS CLASS!!!! He is one of nicest, most adorable professors I've ever encountered. Whether you need to discuss your paper, find a topic for your presentation, or simply have someone there when you panic... he'll always be there. Seeing Oliver Simons always brightens up my day (no, it isn't creepy,he just has one of those personalities). But don't be mistaken, he is INCREDIBLY knowledgeable! You will thoroughly enjoy his class AND learn a lot!  \nWorkload:\nmanagable \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 31, 2013",
            "review_content": "\nFor someone who has never taught CC, Oliver was so good. I can honestly say that this semester of CC was one of the most important classes of my education. Ever. Also what was really nice was that Oliver is super low-key so you don't have a lot of writing assignments, but you learn a lot. \nJust a heads up though, he is not the biggest fan of any of the British writers, so you barely discuss them, but he loves the Germans (he's German so go figure). But this isn't a bad thing at all, because He knows Kant like the back of his hand, has really interesting things to say Marx, and Nietzsche is a great class too. and he's also really knowledgeable about the French writers so Rousseau, and Foucault are great classes too.\nOverall, I'm super impressed how great this class was for Oliver never teaching CC before and I figure in the future he's only going to get better. As of now he's about a bronze nugget (if those existed), but he can definitely be silver in the future. Also he's probably going to teach more texts that he likes in the future so the class will get even better.\nWorkload:\nVery minimal.3 short 2 page papers, no midterm (!!!!), close reading final which is fine. Very low stress.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 16, 2013",
            "review_content": "\nAbsolutely AMAZING! This was Professor Simons's (or, as the rest of the students in our class affectionately called him in passing, Oliver) first time teaching Contemporary Civilization, and he made it the best experience possible. Having had an amazing Literature Humanities experience with an outstanding professor, I was certain that my time in CC couldn't possibly be any better. After this semester, I can confidently say that CC with Professor Simons was my favorite class all year. First of all, he is this extremely friendly and adorable (absolutely adorable!) man from Germany with the most endearing German accent. He puts everyone at ease with his demeanor and always says encouraging things about everyone's commentary, even if they may not actually be particularly coherent or, well, relevant. However, Oliver will always trying to find something useful or worth discussing from everyone's points. While he was oblivious to his own charm, it was very apparent that he was extremely intelligent. Before every session, he would contextualize the texts we read within the framework of writings by other philosophers and theorists, explaining how these theorists' approaches could be used to explain, understand, and historicize the text at hand.  He brought in examples by different philosophers, including Saussure, Lacan, Adorno, Herder, Kant (of which he is an expert!), Foucault, and...too many to list! I got so much out of the experience- learning not only about the authors that we read but also many other contributors to the field of philosophy. Every class with Oliver was engaging and enlightening, and I left every session more enthusiastic about the next. Now, at the end of the semester, I am filled with overwhelming nostalgia for the semester that I just completed. Seriously, Oliver is smart, kind, and engaging, and, if you ever have the fortune to have this man teach your course (even if it may not be CC), you should definitely take it!  \nWorkload:\n30% Papers, 30% Participation, no midterm and a 40% final. All of which are EXTREMELY manageable. There were three two page papers, one of which was a sort of pre-exam practice in which he gave us a passage to analyze in order to prepare for the final exam which was a similar format. There was also an optional 4th paper for people who were not satisfied with their grades on the first two papers. One final- passage analysis/close reading for two different passages, of which you can choose from 6- three from one 17th/18th century philosophy and another from 19th/20th century philosophy. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 02, 2013",
            "review_content": "\nFor someone who has never taught a CC class ever, he is so good. As of now I would give him a bronze nugget if that even existed. He gives really interesting insight to text with his constant use of the linguistic structures that are in many of the CC texts. Also he is super nice and approachable and really wants his students to learn. I know that he's going to become a better CC professor as he keeps teaching the class (as I hope that he does). \nWorkload:\nreadings are really manageable; no midterm, small response papers which are very manageable. Final is 2 close readings passages, and the passages you choose are from a selection of 6 readings. Overall, I think this is one of the few times I can say that I had a manageable amount of work from a class and learned a lot as well. And at Columbia, I feel like that rarely happens.\n"
        }
    ]
}