{
    "prof_info": [
        {
            "prof_name": "Aimee Ng",
            "prof_id": 3942,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "June 02, 2014",
            "review_content": "\nIf you choose into her section, you need to do whatever you can to stay in it!\nAimee Ng is one of the most engaging professors I have ever had in three years at Columbia.  She really takes advantage of the small class size to encourage an open discussion.  She is an extremely articulate and talented educator.  There were times where I wanted to applaud her at the end of a class because it was just that fantastic.  You will really walk out of every class feeling like you have learned something new that you could then explain to someone else.\nThe workload is very light.  Besides the paper, we only had two out of class assignments.  One was to read an article about the Parthenon sculptures, and another was to watch a documentary on Bernini in lieu of a class that she couldn't make (we didn't have to write anything).\nShe breaks the paper (about a painting in NYC of your choice) down into several assignments, which ensures that you don't do everything at the last minute.  As part of this, you do a 4-minute oral presentation on your painting/paper topic.  You are required to visit your painting once or twice, but this helps with the assignments.\nShe is very clear about the contents of the exams, which are graded fairly.  Instead of memorizing dates, you memorize the period/style (eg. Renaissance, Cubism, etc).  Studying for the exams was easier than expected because you end up retaining so much from her engaging classes.\nPlease take her class!\nWorkload:\n1 midterm, 1 paper, final exam\nour grade breakdown was the same as that in the 1/6/14 review\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 08, 2014",
            "review_content": "\nAimee is a great professor. She knows what she's talking about, and has a very enjoyable personality - jokes a lot, adds in personal informative commentary on artworks, etc. The material is interesting, and she does make her own adjustments to the main syllabus. Her class is also founded on student contributions, so don't be afraid to talk and add in your own thoughtful commentary; she will usually be very supportive of what you say (as art hum is a subjective course). The light workload is also definitely a big plus; no readings, only one class museum trip, and one personal trip for the big essay. As long as you engage and take notes in class, you should be set! Anyone whose attracted to women should beware though, as Aimee is extremely hot and I have found myself unable to concentrate sometimes due to my imaginations. Overall, great class, highly recommended professor!\nWorkload:\nLight; just midterm, final, 2 short writing assignments, and a final paper.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 06, 2014",
            "review_content": "\nI love Aimee Ng.\nShe's really young -- she got her Ph.D. in Italian Renaissance Art at Columbia in 2012, but she inspired me to at least appreciate something about each period. She's extremely well-spoken and delivers each lecture with passion. As someone who had absolutely no art background prior to this class, I feel like I got a really solid overview of art history. \nEvery assignment in the class revolves around a semester-long project: you pick a painting that currently resides in NYC very early in the semester. Then, along the semester, you'll turn in a 1-2 page description of your painting, 1-2 page analysis of your painting, a 1 page thesis/outline of your final paper, and a 5-8 page final paper. \nMidterm and final have IDs (she makes you memorize PERIODS, not years, which is incredibly helpful) and comparison questions. I don't know about grade distribution yet, but I got an A just by paying attention in class and only applying myself right before the midterm and final exams.\nOne of the best classes I've taken at Columbia (definitely the best Core class).\nAlso she's really attractive bye.\nWorkload:\nAttendance and participation 23% \n2 short ungraded writing assignments 2% -- you get credit just for turning them in\nPaper Outline 5% \nOral Presentation 10% \n5-8 page final paper 30% \nEasy midterm exam 10% \nEasy final exam 20% \nNo readings. No textbook. No nothing. Everything you need for this class comes from her mouth or from the painting you choose at the Met or the MoMA.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 04, 2014",
            "review_content": "\n  The funnest course I have had at Columbia so far (as \"fun\" as a class can be)! Personally, I have never had any prior exposure to art history apart from museum tours on family vacations. But that was not an issue in this class. Professor Ng does not bore you with too many details. Her classes are basically a series of slide shows of artworks, each of which she says two or three basic and interesting facts about, and is very open to a discussion in class. There is no reading. She makes her lesson seem more like a class chat rather than a lecture cause she is open to all opinions. Also, she is very witty and humorous and always grasps your attention with amusing anecdotes about the painter and or artwork. Finally, she is very organized and provides you with clear guidelines on how to go about answering your papers and essay questions etc - and is always available to help in case you need further clarification. I definitely recommend you take this class with professor Ng, if you can! \n\nWorkload:\n midterm 10%, final 20%, (she explains what types of questions will be on the tests far in advance so you will be prepared), two small assignments (each worth 1% which will help get your thoughts organized towards your paper), an outline of your final paper 5%, an in class presentation of the artwork of your final paper 10%, one paper on an artwork of your choice 30%, in class participation 23%\n"
        }
    ]
}