{
    "prof_info": [
        {
            "prof_name": "Lorraine Minnite",
            "prof_id": 945,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Political Participation and Democracy",
            "review_date": "January 09, 2007",
            "review_content": "\nThis coll. is often overlooked (my class had 7 people), but it is worthwhile.  It was kind of awkward because Professor Minnite often lectures rather than encouraging discussion.  However, when we had discussions, they were usually very good and often only vaguely related (if at all) to the reading.  The reading can be a little annoying, but Minnite likes to divide up so not everybody has to read all of it.  You do have to write a 2 page response on each week's reading, which is not graded.  I tried to do most of the reading for each week but usually did not, either because of time constraints or problems with getting the one copy of the book on reserve.  However, this did not seem to impact my responses.  The paper is 25-30 pages, but I found it to be very doable.  Minnite is always there for you in office hours to talk to you about your research.  \nWorkload:\n2 page responses on weekly reading25-30 page research paper\n"
        },
        {
            "course_name": "Political Participation and Democracy",
            "review_date": "January 09, 2007",
            "review_content": "\nThis coll. is often overlooked (my class had 7 people), but it is worthwhile.  It was kind of awkward because Professor Minnite often lectures rather than encouraging discussion.  However, when we had discussions, they were usually very good and often only vaguely related (if at all) to the reading.  The reading can be a little annoying, but Minnite likes to divide up so not everybody has to read all of it.  You do have to write a 2 page response on each week's reading, which is not graded.  I tried to do most of the reading for each week but usually did not, either because of time constraints or problems with getting the one copy of the book on reserve.  However, this did not seem to impact my responses.  The paper is 25-30 pages, but I found it to be very doable.  Minnite is always there for you in office hours to talk to you about your research.  \nWorkload:\n2 page responses on weekly reading25-30 page research paper\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "January 09, 2006",
            "review_content": "\nI thought she was a great introductory professor.  She is always willing to meet outside of class.  Fair grader.  The reading became crammed at the end because we were so behind, probably my top critique.  She tried to incorporate class dicussion and bring in relevant current topics but we had so much to cover that it was difficult to stay on task, too.  I would take another class with her.\nWorkload:\na midterm, final, 1 8-10 pg paper, reading light in beginning so feel kind of thrown off when it is all thrown at you at the end of the semester\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "August 25, 2004",
            "review_content": "\nI can't imagine a better senior seminar. There were only four people in the section, and we worked incredibly well together. We met every week despite not having to, and Minnite was more than willing to take the time to work with all of us at all times, even while she is technically on sabbatical. She was incredibly supportive and gave wonderful feedback. Writing a thesis can be daunting but with Minnite it's still a process, but one that you feel more comfortable in. She breaks the process down into managable pieces. And her incredible accessibility and honest interest in your topic cannot be matched. She is simply the best when it comes to this, and I cannot recommend her enough. Get into her seminar if you possibly can. I guarantee you'll have a great thesis experience.\nWorkload:\nit's a thesis class. figure it out. \n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "May 07, 2003",
            "review_content": "\nProfessor Minnite is a very sweet person, and is always willing to help out if you need to clarify any issues or ask questions. While her lectures can be boring (and you will likely see the attendance drop exponentially over time), she is extremely smart and knowledgeable. I learned a great deal, but the readings were lengthy and it was hard to keep up (but not always necessary :-D). In general, if you are looking for a way to fulfill a requirement, I recommend the class. \nWorkload:\nThree papers on various topics, and a take-home final (paper). Very easy grader, no problems here!\n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "March 26, 2003",
            "review_content": "\nIf you're interested in urban affairs, this is a solid course. If you're not into it, you'll have difficulty staying awake. No matter; Professor Minnite has a great deal of expertise in the subject area, and brings in plenty of engaging guest speakers, particularly for a 9 am class. Her lectures vary from interesting to less so, but the guests make up for it, and she is singlehandedly the most approachable person on the entire campus.\nWorkload:\n10-page paper, midterm, final. Nothing unusual. Lots of reading; just don't do it all.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "January 11, 2003",
            "review_content": "\nI took this class at 9am and never fell asleep, andeven often took notes. So that should say enough about that class. If you have this class as a requirement, take it with Minitte, it's certainly bearable and even enjoyable at times. She's very nice and available to her students.\nWorkload:\nlight. 3 papers, they are classic american politics so just look in any other poly sci book and i guarantee there's a chapter on the paper topic. one Position paper on some current political issue. Never once did the reading, except for the papers. \n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "December 05, 2002",
            "review_content": "\nMinnite brought in great, fun, challenging guest speakers who are the experts and practitioners in their fields. Her lectures, while dull at times, were clear and well organized. Yes, she assigns tons of reading, but it's not all necessary. Learn the game and you won't be reading more than an article a week. She's brilliant.\nWorkload:\nNot bad if you can learn how to pick and choose. \n"
        },
        {
            "course_name": "Political Participation and Democracy",
            "review_date": "March 15, 2002",
            "review_content": "\nProfessor Minnite can be extremely dry, and sometimes you wonder if you are learning anything at all. But she will bend over backward if you ask for any help and she knows her stuff. Really, she's just a bit socially awkward (okay, really awkward) and, it seems, has a slight confidence problem when she lectures, which means she reverts to a boring monotone that you just want to tune out when she doesn't feel like the class is responding. I didn't think the reading was impossible compared to some of the other poli sci professors at this school, but she definitely believes in packing it in. You have to work but like another reviewer said, there's something to be said for skimming. And I don't think she can be completely blamed for the way the discussions went - certain students were intent on getting their points across, and I think she was quite aware of this, but didn't want to interfere too much. She cares a lot, and is incredibly nice, (one of my favorite professors at this school in terms of personal qualities) but almost doesn't seem to have grown into her teaching skin. I definitely think the class will improve with time, this was her first time teaching a colloquia and again, just seemed really awkward and almost uncomfortable. But make no mistake, the class was often boring as hell. \nWorkload:\none 25 page paper, weekly postings to a cubboard, a ten minute presentation (really informal) and basically a book a week. \n"
        },
        {
            "course_name": "First Year Seminar: Urban Myths",
            "review_date": "February 20, 2002",
            "review_content": "\nREAD THIS FIRST!! I can see where the other reviewers are coming from. Upon initial inspection, she has a very dry, sometimes boring personality. Minnite is often way too serious for her own good, but if you give her a chance you'll see that it's just her defense mechanism to avoid her OUT-OF-CLASSROOM LONLINESS! We asked her why there were no field trips, she said it was because last year nobody showed up for her. (tear!) This year people showed up and she seemed to genuinely be happy and her heart softened. (tear!) If Minnite is making breakthroughs in her social health, so can you by giving her a chance. She knows her stuff. \nWorkload:\nregular movie screenings (she pops for food sometimes), long syllabus but easy to BS your way through short papers. Two longer essays serve as midterm and final.\n"
        },
        {
            "course_name": "Colloquium On Political Participation and Democracy",
            "review_date": "January 26, 2002",
            "review_content": "\nI was disheartened to read the previous reviews, since I didn't find it to be such a bad class! It's a lot different from your typical meat-and-potato lectures, though. Sure, the reading was VERY unneccessarily long, and sometimes too case-specific, but the syllabus is structured so that each week concentrates on a certain topic like civil rights, voting, or women's issues. If you skim the books (and I mean quickly skim), you will be able to throw your two cents to the CUBboard and in class. And while there were certainly people who liked to promote their own platforms, it's kinda inevitable at Columbia, and makes it more like \"celebrity death match\" with the sparring sides. Discussion is lively at least. A definite perk is that Minnite is very nice, approachable, and helpful. If you do the reading, keep up with your research, and make an effort, you will be nicely compensated. Only problem is that you have absolutely no idea of your grade until, well, you see it in December. The course grade is basically your paper and the class presentation of it.\nWorkload:\n25 pg. research paper on topic of your choice at the end of semester; brief class presentation of paper; MUCHO reading (a book a week, with a CUBboard posting on it due the night before). Most of it's interesting, but skim skim skim.\n"
        },
        {
            "course_name": "Colloquium On Political Participation and Democracy",
            "review_date": "December 19, 2001",
            "review_content": "\nWhat a bad seminar. Ridiculous number of pages assigned per week (try around 400+), which are then basically useless in class discussion. Class discussions usually touch upon the basic theme of the book (or books for that matter). Worse yet, there is sometimes no class discussion, as the Prof can spend a full hour lecturing about something perhaps somehow related. Discussions often would be launching pad for promoting personal agendas. The organization and grading of this class could also be far better. There are many parts to be handed in when writing the big paper and none were individually graded. This means that you have no f^&*ing idea what your grade is or where you stand in the class until you see your transcript. However, the teacher is nice as a person.\nWorkload:\nWeekly online postings. 25 pager (with thesis, bibliography, outline and roughdraft required steps in writing it)\n"
        },
        {
            "course_name": "Colloquium On Political Participation and Democracy",
            "review_date": "December 19, 2001",
            "review_content": "\nI have only one thing to comment on this course. On the first day when she handed out the syllabus with a book or two assigned for each week, I asked her what pages she wanted us to read and if she would tell us the week before since she hadnt put in on the actual sheet of paper. She replied in all sincerity, all of the book!\nWorkload:\nHundreds or worthless pages every week.\n"
        }
    ]
}