{
    "prof_info": [
        {
            "prof_name": "Lee Hadbavny",
            "prof_id": 2519,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 30, 2007",
            "review_content": "\nI ABSOLULTELY LOVED CC BECAUSE I TOOK IT WITH LEE!!! I thought that he did a great job of encouraging discussion, and he asked great questions that provoked thought.  He explained the books excellently, and I really took a lot away from the class.  I'm surprised that people were bored in CC with Lee; I thought he made the texts as interesting as possible.  He never really lectured, but he would lead the discussion in such a way that students could come to conclusions themselves (but he would make it clear what the right answers were so you are set for midterm/final purposes).  I never thought that I would be interested in CC, but I really think that Lee made the books relevant and fascinating, making CC my favorite class that I have taken at Columbia so far.  Lee is also really approachable if you have any questions or concerns. He's definitely an easy grader, and the midterms and finals are easy to do well on, too.  You don't have to do the reading to do well in the class either (I tried to read as many of the books as I could but at Columbia time is always limited as we all know...so I ended up skipping a couple completely and reading select sections from others), but reading the books definitely makes your experince in the class better. \nIf you take good notes in class, you will be set to write papers for Lee and do well on his midterms and finals. \nAlso, he will meet with you about your paper topic ahead of time, and he accepts outlines of papers ahead of time too, which allows you to basically have your paper approved before you start. I would say most people in the class ended up with B+ or A-'s for not too much work, and you could get an A by putting more time into your papers/speaking in the discussion in class.  I had a much better experience with CC than any of my friends, too. \nDEFINITELY take CC with Lee!!!\nWorkload:\ntwo discussion questions before every class (easy to do), two papers a semester, midterm, final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 06, 2007",
            "review_content": "\nhe was an okay/easy grader, but his classes are far from stimulating. it is painful for me to sit through. i would take his class if you can because, as many goal oriented cu students are, the grade is more important than the class. if you want to have a passion for philosophy, take another class, but beware because culpa can be wrong as it was in the case for a friend of mine, and your class can be stimulating but way harder than others\nWorkload:\nnot that bad. very few people do the reading. read sparknotes so that you dont want to pull your hair out during class\n"
        },
        {
            "course_name": "The Scientific Revolution in Western Europe 1500-1750",
            "review_date": "May 08, 2005",
            "review_content": "\nLee is a good TA.  He always made himself available to students, and responded to emails promptly.   Although this class fell outside his specialty, his knowledge of the subject made his sections interesting and worthwhile.   He does demand fairly sharp writing skills in order to award the cherished solid A.\nWorkload:\n2 Papers, Midterm & Final.\n"
        }
    ]
}