{
    "prof_info": [
        {
            "prof_name": "Mateo Cruz",
            "prof_id": 12046,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Organizational Psychology",
            "review_date": "April 28, 2016",
            "review_content": "\nTake this class! Honestly, this was the best class I've ever taken at Columbia. Professor Cruz truly organizes the class in a way that allows you to learn more about your learning style. He showed that he genuinely cared about the well-being and personal growth of each and every student in the class. If you keep up with the assignments, there is no reason why you can't do well. He is a generous grader, so grades shouldn't be an issue if you put in the work. If you do take this class though, I recommend not coming in with the mindset of just getting a good grade. You'll get so much more out of the experience if you come in genuinely wanting to learn, instead of just being focused on how many points you have. \nI was truly blown away at the end of the course. He gave a heartfelt speech that really tied together everything we learned. I never thought I would ever take a course that would make me cry for a reason that wasn't related to grades, but Professor Cruz proved me wrong. \nMy only regret is not going to his office hours to get to know him more as a person. \nWorkload:\ngroup projects and an individual case analysis\n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "January 22, 2014",
            "review_content": "\nThis is literally the best class I have taken in my four years at Columbia. Worth every minute I spent learning the material, working on assignments, and meeting with Mateo. If you have the option to take this class, you absolutely should. The two reviews below are accurate 100%: The material is interesting and relevant to life after graduation. Lectures are organized and class expectations are very clear. Mateo's personal interest in every student is strong and he's willing to set up meetings to discuss not only classwork, but future career paths, and life in general. I can't say much else that hasn't already been said, except that I hope Mateo gets a gold nugget soon: he deserves it.\nWorkload:\n2 position papers on lecture relevant topics\nreadings for every class; you can get away with not doing most of them, but there are a few that are really important (you'll get it, he mentions them over and over)\nmidterm and final\na ton of small group projects\n2 group case studies\n1 individual case study\n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "December 12, 2013",
            "review_content": "\nMateo is probably one of the best teachers I've had at Columbia and one of the few who really left me speechless by the end of the semester. His final lecture is incredibly touching and really changed how I think about college and life as a whole.\nHe is incredibly organized and invested in the class. He uses data, examples, and personal anecdotes to really drive points home and is clearly comfortable explaining the material. HIs office hours are AWESOME and he will literally counsel you through life.\nThe material itself is also really interesting. As someone who took this for the Business concentration, this was the best elective choice by far. I'm not a huge psych person, but this was an actually practical application of psych with many real world uses. You will learn a lot.\nOur TA was also very funny and helpful. Shoutout to Ari\nAnother thing I loved about this class was the incorporation of group work. He really uses the class to make you look introspectively to how you perform in a team. You might get a shitty team which will make your semester hard, but it's a great introduction into real world team work.\nTake this class, you won't regret it. You also probably won't get it if you're not a senior\nWorkload:\nWrite two position papers, he counts the better one for a grade\nFair midterm and final\nLots of group work and case work\n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "May 06, 2013",
            "review_content": "\nI have to leave a review for Mateo just to express how completely awesome he is. Even though I am afraid that if more people hear how fantastic his class is, there will be too much competition to get in (it was already a lot this semester, like 80 people tried to get in and he can only take 35-40). The class is at a weird time (I didn't get to eat dinner twice a week, which was annoying)- but after trying it on the first day I knew I had to be there. And it was absolutely worth it.\nAny good things you hear about Mateo are well-deserved. He puts his full effort into the class, always looking like he is happy to be there and like he really enjoys teaching. I have never seen a professor care this much about his students and wanting them to really learn and be challenged, to do well (grade-wise), AND for them to be happy and not too stressed. AND he wants them to do well in their careers and their lives and wants to help them get there. Yeah, other professors care too, but sometimes its more like they care in theory, or only for the students who reach out and go to office hours. For Mateo, it's a whole 'nother level, he sincerely cares about everyone and their individual backgrounds and needs and concerns and will help them directly so that they can do well both in the course and in their careers.\nHe meets with students outside class and has a regular meeting for all his students (all=including from previous semesters and other colleges if they still want to come! and some do!) to talk about careers and life. I know some students in this class changed their perspectives on what they want to do with their lives and careers after learning from Mateo. He treats everyone as an individual and is considerate of their needs. He puts in a ton of time and effort to give every student individualized feedback on how they are doing and how they can improve.\nNow that I've established that Mateo is awesome, I should also say that the class itself is great. We covered industrial and organizational psychology- the history of the field and the major concepts, and how they are useful in the real world. Everything in the class was practical and applied- what we did is also what we were learning. For example, to learn about the 4 different styles of job design, four groups had to do a task under different conditions (packing bags of candy) and then report on how it felt and what the pros and cons were that they experienced. (and the whole class got to eat the candy afterwards.) To learn about different types of groups in organizations, we did group work ourselves to see how it plays out. Another really cool topic we covered was group dynamics and the way people fill the roles the group demands of them, it seriously changed the way I look at myself and other people whenever I am in a group interacting with others.\nEvery class was different and no single class involved doing only one thing throughout the whole time- the course was a mix of lecture, activities, sometimes watching a movie clip to analyze something in it, and even time to work on our group homework projects when we needed it.\nThe coolest thing ever is how Mateo takes things personally, not just assigning it for the students- he asks for student feedback on how he can improve the class, writes it all down, and then actually incorporates it into his teaching. I have never seen anyone else do that, more professors should! In fact, I wish Mateo could give classes in how to teach to the rest of the professors in this school!\nOrganizational Psychology is a much more fascinating topic than I expected, I don't think I would have liked it as much with any other teacher. It could so easily have been dry or abstract, but thanks to Mateo, even though I don't plan on becoming an organizational consultant, and even if I don't remember all the exact terms for everything, I know I will use the concepts in my life and future career, whatever I end up doing. I highly recommend taking this class.\nWorkload:\nMidterm and final. Choose 2 of 4 topics for \"position papers\" in which you make an 2 page argument on the assigned topic based on the research that's been done. Individual case analysis (you choose your example) and group analysis of a case with recommendations for solving the problems (a written report based on industrial-psych theory and later on, a presentation on the same case from the perspective of the organizational-psych part of the course). Attendance and participation count too.\nAs I write this up, it sounds like there are a lot of different projects- but in reality you get a lot of time in class to work on things and if your group manages its time well it's not a big deal. Honestly, doing work for Mateo makes you WANT to do the homework and do a good job because he wants to see you do well! And it's not busywork, you're learning from it, but in a different style than most classes in this school. The only assignments that caused me any stress whatsoever are the midterm and final- the rest is all kinda fun actually.\n"
        }
    ]
}