{
    "prof_info": [
        {
            "prof_name": "Bobbi Mitchell",
            "prof_id": 2063,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Issues in Education",
            "review_date": "January 03, 2005",
            "review_content": "\nAn excellent teacher! This was my favorite teacher and class in all of college. Too bad I don't go to Barnard and am not in the education program. Prof Mitchell was very approachable and was always available for her students. She encouraged class discussion and creativeness in presentations. She shared her experiences in teaching but invited students to share experiences and opinions and didn't seem to think she had all the answers. And she actually took the time to learn all of our names. In addition, Bobbi Mitchell let us choose the topics that the class would cover. Grading was fair. The class only met once a week and pretty much only education lovers were enrolled. You can't beat a class like this!\nWorkload:\nThe workload may sound like a lot, but it really wasn't. There's a 3-5-page response paper to a journal article, a 15-20-page paper at the end of the semester, and a group presentation. In addition, there are weekly 1-page response papers to the reading, which isn't much. She gave the same amount of credit to people with 2-sentence responses as those who turned in 3 paragraph responses, as long as you showed that you thought about the topic.\n"
        },
        {
            "course_name": "Contemporary Issues, Methods of Ed.",
            "review_date": "January 02, 2005",
            "review_content": "\nProfessor Mitchell is a smart, likeable, and helpful professor.  Her classes are very free-form and not at all rigorous in a classic sense, but she does challenge students to think critically about education and what we can do as future teachers to improve it.  She is personable and I don't believe that she has \"favorites,\" rather, she loves personable students who make the effort to connect with her, participate in class, be creative, etc.  Most importantly, she is the most supportive professor I've ever encountered.  Student teaching and working in schools in the Methods course is an emotional journey as much as an intellectual one, and she takes a personal interest in being there for her students along the way.  She loves to say, \"I'm tougher than I look!\" but it's not true - she's a sweet woman who, yes, won't sugar-coat everything for you, but will bring cookies to class and come to bat for you whenever you need it.\nWorkload:\nNot as much as it seems - Methods required a 20-page or so research paper, but on any topic you wanted with as much internet research as you liked - not hard at all and actually enjoyable.  Overall, the workload in the Ed program is never ever overwhelming so long as you don't let all of the little assignments build up til the end of the semester.\n"
        },
        {
            "course_name": "Methods of elem school teaching",
            "review_date": "May 06, 2004",
            "review_content": "\nProfessor mitchell is a nice lady, but chooses favorites. Class isnt exactly productive or informative- but not awful- think coffee talk. \nWorkload:\neasy A- lots of little assignments, no midterm or final\n"
        }
    ]
}