{
    "prof_info": [
        {
            "prof_name": "Jonathan Robinson-Appels",
            "prof_id": 4547,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Comic Theater: From Shakespeare to New York",
            "review_date": "May 14, 2016",
            "review_content": "\nIf you want an easy A, this is your class.  The workload is very light and the grading is very generous- he basically promises everyone an A at the beginning of the class. You'll see some theater, which is fun, and read some funny lit. The only thing that annoyed me was Prof. Robinson-Appels himself. Although he's hilarious, he's also so technophobic that he won't answer calls or emails. He also basically said \"no\" to me when I asked to meet outside of class. But maybe it was because it would be a waste of both of our times since I was going to get an A anyway....\nWorkload:\nLight- a skit with a group, attending a couple plays, reading some plays/books and writing a presentation about them and a final paper\n"
        },
        {
            "course_name": "Comic Theater: From Shakespeare to New York",
            "review_date": "August 08, 2012",
            "review_content": "\nI was fortunate enough to get a last minute e-mail about this class and invited to take it to supplement my interests in creative writing. That being said, I did not take Professor Robinson-Appels' during the school year (yet) and have only been with him over the summer-- a much more relaxed environment. Nonetheless, the class itself was fun, though I would probably say a bit of a joke. We were all guaranteed As as long as we handed in a paper by the last day of class, and we had 5 free absences in a biweekly 6-week course (so 5/12 classes). On Mondays we would have a lecture, and on Wednesdays, we either saw a show or went to a gallery, though we did cancel class a few times, and the fourth of July fell out on the first Wednesday. So... I guess in the end we had 4 classes, 3 shows and one party, and we could still miss up to 5 and get an A. \nI digress. \nIt's true that he does have a problem with computers, but that's specific to computers. He doesn't like texting in his class only in that no teacher likes texting in their class. He is not sensitive to iPhones, iPods or other phones. \nJonathan created the because he used to teach a summer course on tragedy but felt that it was too sad. He wanted to laugh and see stand-up comedy, so he decided to make this class. Basically, it's whatever the students want it to be. Want to focus more on the philosophy of comedy? He'll tailor the schedule to you. Want to focus on how to write comedy? He'll give you a specific project and wave your essay. Want to focus on Shakespeare's comedies or ignore them completely and only study Greek classics? He's got you covered. We, the students, choose the plays to attend and veto any books from the syllabus that we dislike (there were two that we all agreed were too heavy for a comedy class). We wound up seeing Clybourne Park, Sister Act and ASSSSCAT. On our first Wednesday class, we went to look at various art galleries to see if we could find humor in art. \nLike I said, the class can be extremely easy. We had a (maximum) five minute presentation on a book/play we read where we had to pick a scene, read it and explain why it was funny (or not). These presentations lasted for two days, and no one actually had to read anyone else's book, so out of all the assigned readings, we only needed to actually read Lysistrata. We also had a final paper due in font size 14. To quote Jonathan, \"That's huge! That's poster-board sized! You can do that, it's nothing!\" While there were some students stressing themselves out reading every single text cover to cover, I certainly did not do that and never feared I'd suffer any consequence for it. I wouldn't say the class was not worth my time, because 1) I got an A and 2) I had a lot of fun. I didn't actually learn anything new, but it was a good excuse to read things I would not have otherwise and to see shows when I'm usually busy. \nFor those of you actually looking for a study to comedy, I'm not sure that I would recommend this class, at least not yet (it's still being reworked). On one hand, it's the only one of its type offered at Columbia-- especially during the summer. On the other hand, there isn't much studying. For those of you looking for a fun class to supplement your courses or help your grade, I would strongly recommend this class. \nWorkload:\nLittle to nonexistent. One presentation, five minutes maximum, on a play from the reading list with two academic quotes about it or the author. (Just the quotes, not your commentary on them. Just the quotes.) One final paper, 10 pages, font size 14 on anything at all you can think to write about as long as you can connect it to class, OR same length, a creative writing piece on anything your heart desires. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 24, 2010",
            "review_content": "\nFor the sake of all future classes, if you get this professor, SWITCH OUT! This man does not teach Lit Hum! \nUnfortunately, I, like many of my fellow classmates who read the last review, foolishly did not transfer out of his class. This man piles on the reading during class, forcing you to read several more \"literary texts\" throughout the semester than actually necessary. Ironically, I don't exaggerate when I say that it has likely been DECADES since he has read any of the books we're supposed to read in Lit Hum. He admits that he rarely ever reads a book from cover to cover, and will literally spend 1 hour reading two paragraphs while talking about the philosophers Marcel Proust and Ludwig Wittgenstein. His Lit Hum class is not about the actual Lit Hum books, but more about what he's completely comfortable with: Proust and Wittgenstein. \nIn addition, his papers are graded with little explanation as to why you received the grade you received. The amount of work you put into this class has NO correlation with the grade you receive. \nIn case you're still not convinced you should transfer out, here are some of the things he has said during class:\nStudent: Professor, what exactly are you looking for in a paper, just so I can know for the next one.\nRobinson-Appels: Do you speak a second language?\nStudent: Um, yes?\nRobinson-Appels: Well, that's probably why. You see, often, people who speak a second language tend to think slower. Not your fault, of course, but those who speak a second language tend not to have as much depth of thought\nScene: Robinson-Appels and student are talking about the student's paper ---\nRobinson-Appels: Do you study physics? \nStudent (an Econ major): No...\nRobinson-Appels: Hmmm....\nAnd finally, he does not use computers and will not allow laptops in class at all (So say good-bye to your opportunity to register for classes if you have a registration time during his class period...). He claims to have \"electromagnetic sensitivity,\" a \"condition\" you can read about here: http://en.wikipedia.org/wiki/Electromagnetic_hypersensitivity. So in case you're wondering how he checks his e-mail, he doesn't. He does not hold any office hours either, so you have to call him and see if he picks up.\nWorkload:\n2 Papers, arbitrarily graded.\nMidterm & Final ---he doesn't care about how you do on them... he doesn't even look at the final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 17, 2009",
            "review_content": "\nProfessor Robinson-Appels is probably one of the most intelligent people I have ever met. That being said, he does not speak human. He has received multiple scholarships of the highest degree and is way too smart to be teaching the core. The class was basically a course in anthropological discussion of ancient Greece, with a (loose) basis in the texts we read. It is full of lively intellectual discussion. It is a clear departure from the boring passage microanalysis offered by other LitHum professors. Most of the class was spent arguing about extremely abstract concepts, and talking about how all of this discussion (as well as any analysis of these ancient texts) was basically moot because the texts have been changed so much over time that it's impossible to predict what the author really meant. I would highly recommend him.\nWorkload:\nTwo papers, and the final, plus two presentations that include handouts to the class and reference to a scholarly source. Nothing AT ALL. I didn't read any of the books and still got by.\n"
        }
    ]
}