{
    "prof_info": [
        {
            "prof_name": "Aled Roberts",
            "prof_id": 13061,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "UWriting",
            "review_date": "May 23, 2016",
            "review_content": "\nI think this was Aled's last semester teaching UWriting, so really just take this as a warning for any future classes he may teach (lit hum? Oh God).\nThe other review is pretty dead on. Aled is charming, smart, funny, etc. Everyone loved his accent. I loved going to this class every day just because the discussions were so interesting. He chose very nontraditional data science readings, which I found to be really interesting but also very hard to write about. The class discussions didn't help clear them up, and it certainly didn't help that he would get distracted every 5 minutes and go off on tangents about films, Eurovision, his family, how much of a mess he is, etc. \nHis biggest fault, imo, is that he tends to be very nice when looking at drafts but is absolutely savage when grading the final paper. For my first two papers, he wrote very nice comments on my drafts and I took those to mean that I was heading in the right direction. I fixed all the small mistakes he mentioned and took in the account bigger problems and tried to address those as well. You'd think doing that would get you in the A-range, but that really just brings you to a B+ most of the time. When grading the final draft, it seemed like he'd always be addressing problems which he never brought up before. It was so, so frustrating when he seemed to give the impression that he liked our papers at first but wouldn't really give helpful criticism until it was too late. For my P3, I completely ignored his comments on my drafts (which, as usual, just told me that I was heading in the right direction!) and rewrote the entire paper at one point because I personally didn't like how it was turning out, and ended up doing much better on my P3 than both my P1 and P2. \nSome advice: go to his office hours and argue with him. Ask which arguments sound weakest - he'll probably tell you - then ask him why they sound weak. Just argue with him a lot, and he'll usually drop lots of hints towards where he'd actually like to see you go with the paper. When talking face to face, he's usually better about giving out actual criticism, and I found that by arguing with him a lot I could figure out where my paper actually needed improvement. Bonus: he's really funny and super nice. Even for students who couldn't make his normal office hours, he was always super flexible about finding other times to meet with them. \nAled was also notoriously slow with returning everything because he's ~sooo~ busy. He used to give us a writing exercise (usually a short response to a reading) due every class, but only returned about half of them and eventually just stopped assigning them halfway through the semester. Every single major deadline (a draft or final paper) was pushed back at least once, but usually more than once. I think we ended up turning in our P3s over 2 weeks later than originally assigned, and our P4 and radical revisions were straight up due during finals week. Our P2s were returned over a month after they were due. Some assignments were just never assigned, or would be assigned them abandoned partway through them. You can tell that Aled doesn't care much about how UW is supposed to be structured - my friend straight up didn't use the seed text, was hundreds of words over the word limit, and used too many sources in her P3, and he seemed to be completely fine with it. \nDespite his faults, Aled also made the class incredibly enjoyable. It was my favorite class this semester. Just stick through the frustrations and it will definitely be worth it. You might have to work a bit harder than students in other sections, but if you just put some effort into harassing him, you can get a lot out of his class. \nWorkload:\nP1 - 20%\nP2 - 25%\nP3 - 35%\nP4 - 20%\n"
        },
        {
            "course_name": "UWriting",
            "review_date": "January 03, 2015",
            "review_content": "\nUWRITING - DATA SCIENCE\nLong Story Short:\nTake the class if you want to be entertained in class, and have a lot of time to devote to UWriting to make your progressions excellent because he is stingy with A'sreview_contentl review_content:\nIf you take UWriting with Aled, you will most certainly have a love/hate relationship with the class. In class, his Welsh accent is charming and discussions are interesting. However, he tends to stray outside of the normal Data Science texts and chooses articles that are cyborg focused or just very hard to grasp which can be very annoying because he does not clear them up well in class leaving you screwed when it comes to incorporating them into your writing. When it comes to the progressions, it seems as if he didn't have a full grasp of what was to be expected of the progressions. In other UWriting classes, professors had a clear structure of what was to be expected from their essays (some even outlining what every paragraph should look like). You will not find that in Aled's class. He will leave you to go out and figure out how your progression should be formed. Sometimes you will crash and burn miserably and other times you will hit it out of the park. He takes the longest time to get feedback on drafts back to you (if ever) which is a pain if you want to try to finish a progression early. When you finally get feedback back, do not celebrate too quickly if he left you positive comments! If you simply improve on those, you'll most likely end up with a B or B+ on the progression. Note: If you are writing on a tricky topic and decide to meet with him, you will most likely end up more confused than before you talked to him. Be smart- choose an easy topic that you can write about well because he grades pretty harshly. \n\nWorkload:\n5-40 pg articles to read and respond to almost every class. (1-2 page responses)\n4 Progressions. (Exploratory Draft, Formal Draft, Final Draft)\n\n"
        }
    ]
}