{
    "prof_info": [
        {
            "prof_name": "Lisa Northrop",
            "prof_id": 1376,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Yoga",
            "review_date": "March 28, 2007",
            "review_content": "\nBoth Lisa and her class are fun.  She never pushes students beyond their limits, but works with them to make sure they get the most out of the class.  Taking yoga in the morning was a great way to start out my day.  Lisa allows you to miss three classes (missing four gets you an F) and factors in lates, but you will want to be in class anyway.  During exam times she even spends full classes focussing on relaxation.  Hers is a true joy of a phys. ed. class!\n"
        },
        {
            "course_name": "beginning yoga",
            "review_date": "May 03, 2006",
            "review_content": "\nShe's really nice but can be anal about putting away the mats and props to her specifications. She is an excellent yoga instructor, and if you've never taken yoga before, you'll be fine in this course. She's pretty hardcore about attendance and lateness too...\nWorkload:\nn/a\n"
        },
        {
            "course_name": "Beginners Yoga",
            "review_date": "December 12, 2004",
            "review_content": "\nShe's awesome, very understanding and guides the beginners into the ideology of yoga rather than the physical aspect of it alone.  I loved going to her class because she encouraged us to achieve goals without pushing our own limits, and it was extremely relaxing and rejuvenating.  She is an excellent teacher, I now feel confident in going to other yoga classes.\nWorkload:\ngo to class...?\n"
        },
        {
            "course_name": "Yoga",
            "review_date": "April 21, 2004",
            "review_content": "\nShe's fun, very knowledgeable, funny, and cares.  Very enjoyable class, with real attention paid to accomadating both students with no knowledge and students with a lot of knowledge. And she makes everyone feel comfortable.  I took the class a second time just because I enjoyed it, even though I'd already finished the P.E. requirement.  Take anything with her.\n"
        },
        {
            "course_name": "Yoga Exercise",
            "review_date": "January 05, 2004",
            "review_content": "\nTake a class with Lisa!  She's really, really nice and she really knows her stuff.  At first, I thought the yoga class might be too simple (I have taken other ones) but in fact it was a nice pace and she challenged everyone to really work on doing the poses correctly.  Her knowledge of both yoga and Western sports medicine made her suggestions really worth listening to.\n"
        },
        {
            "course_name": "Step Aerobics",
            "review_date": "December 23, 2002",
            "review_content": "\nEven though she only teaches part-time, take a gym class with her!! She gets really into the workout and motivates everyone to just try their hardest even if they are really lazy.   Unlike a previous teacher I had who criticized every move you made if it wasn't perfect, Lisa made sure everyone was doing ok during the whole class.  I didn't feel like I got the most intense workout ever, but it was a great way to finish my gym requirement.\nWorkload:\nYou get 4 absences like in any other Barnard phys. ed. class, and she's really good at keeping you up to date to make sure that you pass!\n"
        }
    ]
}