{
    "prof_info": [
        {
            "prof_name": "Ilia Karatsoreos",
            "prof_id": 11012,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "May 20, 2011",
            "review_content": "\nReally nice and solid professor that explains the material pretty well, even for those just trying to complete their science requirement. However, there is a lot of memorizing that accompanies this class, as the exams are pretty simple questions involving fill in the blank key terms, multiple choice, and true/false. Buying the book is pointless as long as you write down what he says in class about the different images/pictures that are shown in the powerpoints, because these always come back to the test. ie, write down what a graph tells you, what the image is of, or the experiment's design/conclusion. \n\nWorkload:\nThe class is a lot of memorization, I would recommend making computer flash cards as you attend lectures, so when the exams are coming up you will already have them all made and can just review all the bold terms and associated brain regions. 3 exams, 1 final; drops lowest exam, and the final is like 85% questions from old exams, so make sure to review them when he posts them near the end of the semester. Also, do the self tests and experiments for a lot of extra credit, the self tests take 2 minutes and you need only 5 of them. \n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "May 17, 2011",
            "review_content": "\nI wouldn't go so far as to give the rave review the past reviewer gave, but I would agree that Dr. K is probably one of the nicest, most caring professors that I have had at Columbia. He really does care about all of the students in the class doing well in the class and enjoying the class. The slides of the class that Dr. K puts together are extremely helpful... you don't even have to read the textbook. \nWith that said, there's only so much you could do about the VERY dry material. Yes, Dr. K has a few funny anecdotes during class that he'll sometimes tell, but for a lot of people, that's not enough from keeping one from dozing off. Quite honestly, you could probably skip class, just read the slides, and still get away with getting an A (I did...). \nMaybe I'm just not that into anatomy, but the subject matter of the class is A LOT drier than that of Science of Psych, just because so much of this is based on anatomy. If you're an engineer looking for a non-tech or a CC student looking to fulfill a science requirement, you should definitely take Science of Psych over this.\n\nWorkload:\n3 Midterms (drop lowest score), 1 final worth 40%, Extra credit from Self-Quizzes and from doing Voluntary Psych Experiments\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "May 11, 2011",
            "review_content": "\nAn excellent course. Dr. K clearly wants his students to succeed. Lectures are all pretty standard powerpoint presentations, but he explains all of terms and concepts clearly and posts slides on courseworks before and after lecture. Answers emails promptly and always has TAs offer review sessions before every exam. Attendance isn't taken, but it's easy to get lost if you don't show up for the lectures. Don't let the subject matter intimidate you: yes, it's technically neuroscience, but he makes it learnable, interesting, and (relatively) easy to understand. Altogether one of the best classes I've taken at Columbia. \nWorkload:\nNo homework except to study. 3 exams (each worth 30%--he drops the lowest one, so two of them are worth 60%) and one final worth 40%. Opportunities for extra credit with volunteering for experiments and taking very short online self-quizzes. Totally manageable.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 12, 2010",
            "review_content": "\nSuch a great and interesting class!!! Lectures were interesting, accessible and easy to follow. The syllabus is well structured and this class is designed for Psych majors and non-science students as well. Overall the work load is not demanding; simply go to class, take notes, read the text (optional), and do well on the exams. As long as you understood the bold terms and main ideas, the exam were not difficult (multiple choice and fill-ins key terms). It is not difficult to score in the A range in this class. Overall, Dr. K is a great lecturer and answer emails and questions promptly. Highly recommend this class for science requirement and psychology major! Take this class before it is not longer offered.\nWorkload:\nExams and finals (all same format), and extra credit that can boost your grade from B+ to A- (and so forth)\n"
        }
    ]
}