{
    "prof_info": [
        {
            "prof_name": "David Macklovitch",
            "prof_id": 1893,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French I",
            "review_date": "May 01, 2011",
            "review_content": "\nI really liked how he forced everyone in the class to participate by calling on people at random; knowing that paying attention and participating was an absolute necessity in the class kept me involved, engaged, and prepared for class at all times. He frequently used humor and his considerable knowledge of language and grammar to enhance the teaching of the material in the book. He was also consistently available during office hours despite what we all knew to be a busy schedule and promptly replied to emails, albeit a bit tersely.\nParticipation is definitely a big part of this class. If you don't like speaking up or being faced with occasional interrogative questioning, don't take it.\nWorkload:\nGrammar exercises from the workbook before each class, usually about 30 min. of work. Four simple 1 page compositions, 4 quizzes (the lowest score is dropped), 1 midterm and 1 final. There were some tricks on the exams, but in general he would repeat how he was insulting our intelligence, as he believed them to be so easy. This was not necessarily true.\n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "April 04, 2011",
            "review_content": "\nProfessor Macklovitch is not a very nice person. He has a very too cool for school attitude that is really annoying to deal with. When you ask a question that he thinks is stupid he tells you it's stupid and then sort of half-heartedly gives an answer and if you still don't understand he just sort of stands there and says something like i don't know what else to say. Where his real strength lies is with reading french literature, you can tell he really loves it. Unfortuantely the class is about 80% grammar and 20% literature. I decided to take his class becuase he got some amazing reviews here but they almost all ended with, \"he's so hot so i might be biased\". So if you want a hot professor take him, but if you want to feel like your professor cares about teaching you, or cares about anything besides his very tight pants find someone else. \nWorkload:\nNot too bad, workbook stuff for every class but the answers are all in the back of the book. quizzes every two or three weeks that aren't that hard. four compositions that are graded pretty harshly but you get to revise them. you read a play that is difficult if you're vocab sucks. one midterm and one final but you always do a practice one before it which is basically what you'll get when you sit down.\n"
        },
        {
            "course_name": "Major Literary Works since 1800",
            "review_date": "January 18, 2009",
            "review_content": "\nHands down the best teacher I've ever had.  Probably in my life.  He related the material very well.  My entire knowledge of French lit and modern history is thanks to him.  \nWorkload:\nYou have to work..but it's worth it!\n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "August 04, 2008",
            "review_content": "\nFrench Elementary II was an incredible and eye opening experience into the rich world of France.  I am now an avid Francophile and now am inspired to read every single piece of literature ever written in the French language.  \nI only say this because Dave is hot.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "May 09, 2006",
            "review_content": "\nDavid is literally the coolest, hipest dude I have ever met.  Anyway, the class was pretty good, although he does randomly call on people, so you have to do the work.  He's a pretty good teacher though.\nWorkload:\nHomework every day.\n"
        },
        {
            "course_name": "Intermediate French Conversation I",
            "review_date": "December 21, 2004",
            "review_content": "\nI don't have much to add to David's other reviews, except to stress his capability to teach Columbians a thing or two about how to dress.  I'd show up for every class just to see what shoes (always bangin') he was wearing.  Yes, he wears YSL, but he's got the Francophone chops to make it work.  Engaging he is, f'real.  David brings out the conversationalist in each person.  Oh, and he's smoother than any person on the planet, so don't think you can hide in the back.  He also catches the nuances of pronunciation, but always corrects without making one feel stupid.  My only complaint: he's too nice to cut off presentations that run way over the 5- or 10-minute limit. \nWorkload:\noccaisional vocabulary quizzes, occaisional reading assignments, 5-\nminute \"reportage\", 10-minute \"expose\", final interview.  no sweat.\n"
        },
        {
            "course_name": "Intermediate Conversation",
            "review_date": "November 18, 2004",
            "review_content": "\nDavid is young, energetic, knowledgable, and unbearably hip.  He obviously loves to teach and loves engaging every student, and since its a conversation class, you HAVE to participate.  Even if you show up at his class hung over, with two midterms looming over your head, and you just found out that your significant other cheated on you with your best friend, it would be near impossible not to crack a smile during his class. He loves to be the actor and bring humor to every discussion. Oh yeah, and there will inevitably be a gaggle of girls in the class swooning over his tousled hair and French charm.  No one else but David could pull off a crushed blue velvet jacket with YSL jeans and pink sneakers. \nWorkload:\nOccasional short readings and quizzes, one 5 minute and one 10 minute presentation, a final interview. \n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "September 05, 2004",
            "review_content": "\ndaveed was the best teacher! i had him for both elem 1 and 2 and her really challenged his students but helped them out. although we had to meet 5 days a week he made it entertaining. he is canadian and he is a native french speaker so he is also very familiar with the culture. if he ever noticed you struggling he would do anything to try and help you and was very available to meet outside of class. anyway, he was the best teacher ive ever had and i want him to teach me french for the rest of my life\nWorkload:\nnothing that you cant pull off, a few tests, some worksheets or workbook assignments but no major projects.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 23, 2003",
            "review_content": "\nI'll admit when I first saw this man I doubted his ability to teach.  A man pushing on 25 and a peculiar fashion sense couldn't possibly teach a class full of near contemporaries, right?  Wrong.  I learned more French in 16 weeks with this man than I had in 3 years of French in high school.  He is a great motivator, introducing new content each and every day.  The pace of the class could be rather intimidating (study is a must every night), but taking a class with this man from Montreal was quite rewarding.\nWorkload:\nUsual language junk.  4 departmental tests (some fair some confusing), 5 compositions (rewrite raises grade by increment), 1 midterm interview (no big deal), 1 presentation (graded extremely generously), departmental final (with some confusing parts)\n"
        }
    ]
}