{
    "prof_info": [
        {
            "prof_name": "Herbert Roseman",
            "prof_id": 2734,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 10, 2014",
            "review_content": "\nThis man has no business teaching. It is admirable that he decided to pursue a degree in philosophy after a long career, but the man has no skill in teaching. He has no idea how to lead a discussion, so he stands at the front of the room talking at you for most of the class. On occasion, he will ask questions, which come across as semi-rhetorical. He doesn't seem to care what your opinion actually is as he'll spend a long time arguing with you if your opinion differs from his. This serves as somewhat of a disincentive to participating. \nHis knowledge of the course material is spotty at best. He knows quite a bit about Plato, but that's it. His knowledge of the religious texts is pathetic. Students would correct him. In classic Herbert fashion, he'd disagree. They'd then open their Bible and read from the text, proving him wrong. Even then, he wouldn't even admit that he'd messed up. The man is too arrogant and self-important to be a good teacher. \nWith respect to the work, there are four papers, a midterm, and a final. He is an easy grader on the papers. However, he grades the midterm in an extremely petty fashion. And instead of doing a passage ID, he uses \"terms\" sometimes from the book but often inane terms used in lecture that don't always occur in the book. He doesn't much like to give partial credit, so even if you're mostly right expect to hemorrhage points. The final was the same format as the midterm. \nI don't like to be so negative, but Herbert is bad teacher. He isn't even mediocre. It seems that he teaches just to hear himself talk. He doesn't really care about the students; he'll never learn your name. He won't inspire you at all. He won't even inspire you to do the reading. It's optional as he talks the whole time. I wanted to enjoy this course. I've heard a lot of good things about CC, but you won't get that kind of experience in this class. \nIf you enjoy forcing yourself to stay awake for this mind numbing course taught only at 9AM (what a treat!), stick around. If you value your time and want to learn something in CC, find a different teacher. \nWorkload:\nFour papers, midterm, and final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 11, 2013",
            "review_content": "\nThe review below really says it all. Though this class has come to be somewhat of an \"easy A\" for me, I have learned absolutely nothing from sitting in class. I have fallen asleep in 99% of his lectures, and all the \"learning\" I have done for CC has taken place on my own, outside the classroom. \nIt's quite sad, actually, because Professor Roseman is a really sweet guy. He knows some texts much better than others, which subsequently means that we learn some texts much better than others. (I think) that he cares about his students and he most definitely cares about the philosophy that he teaches -unfortunately, though, this doesn't translate into students actually learning anything.\nI am only staying in his section second semester so that I do not need to worry about my CC grade on top of all my other classes -this is quite sad, seeing as people talk about CC as being life-changing. With Professor Roseman, it's definitely not.\nWorkload:\n2 4-5 page papers, and 2 5-6 page papers. 5-6 prompts are given per essay, and he will gladly meet with you outside of class or email with you to discuss your paper. His grading is not harsh AT ALL. 1 midterm and 1 final -beware that his \"text IDs\" are identifying terms or themes from works, not passages. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 16, 2012",
            "review_content": "\nIf you feel like sitting in a class of roughly 15 people where the teacher doesn't know your name, unsuccessfully tries to stimulate conversation, and consistently tells you that there is only one way to consider every author, then sign up for Herbert Roseman's section of Contemporary Civilization. It becomes clear early on that he lacks a thorough understanding of many of the major texts that we read yet he defends his every opinion to the death. A terrible lecturer, \"HBR\" tries to 'spice up' his vapid discussions by sharply banging his fists on the table and constantly moving from the whiteboard to his chair, which he awkwardly straddles for the majority of the class. For a fraction of the amount of time, you could just read wikipedia summaries of each book and probably get the same if not more content than you would get by going to his lecture. Herb's greatest downfall is his ability to speak publicly, which makes the readings even harder to understand. I'm not sure if he succeeded all semester in connecting two sentences without stumbling over his words, or fully explaining an idea without digression. Though he is somewhat of an easy grader when it comes to essays, he assigns four 5-6 page papers and challenges himself to come up with worse essay topics in each of the subsequent essay assignments. Most of his essay questions are not only so far removed from the texts but also can be answered with a simple \"yes\" or \"no.\"\nProbably the only upside to being in his class is that since he doesn't know anyone's name he never takes attendance. Though you can get away with more than a few skips, you are often left wondering how he distributes participation grades at the end of the semester, which he says count for 20% of your grade. Other than that, if you choose to sign up for HBR's section, you can look forward to hearing mediocre interpretations about some of the best known works of philosophy in between short anecdotes involving his dogs and self-proclaimed 'glory days' when he worked on Wall Street.\nWorkload:\nfour 5-6 page papers, midterm and final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 05, 2011",
            "review_content": "\nI was initially attracted to this course because of the reviews that Herb is an easy grader. This has turned out to be relatively true yet Herb has also proven to be very intellectually stimulating and his class has really been enjoyable. In my mind, this is the best of both worlds. \nWhile what the previous reviewer is correct in that only half of class participates or comes, I think s/he is wrong that this is Herb's fault. I am pretty confident in saying that this reflects more on the class: it is a 9am class and thus 60% of the kids are athletes, which seems to be correlated with them not really doing the reading (not all of them... but it is a pretty noticeable pattern). In fact, I think Herb is pretty generous: he doesn't take off for skipping class. However, last semester, he did comment that the grades were bi-modal (40% As, 20% Bs, and 40% Cs) and reflected pretty directly those who showed up and those who didn't. But, as someone who participates, I actually really enjoy the fact that we have a 10 person class--it really allows us to have good conversations and an intimate environment. \nI actually really like that Herb allows the class--because this is really what he does--to focus on just a few salient elements of each text. It isn't that he isn't doing justice to the books; in fact, I would argue, that he is actually doing more justice to the texts this way. Instead of getting bogged down in the tiny details, we really wind up isolating the most important themes and arguments for the texts. It it doing this--just what the reviewer below didn't like--that really allows one to walk away from CC and say \"oh, that is a Millian concept,\" which is the whole point of the course. \nFinally, he is just a hilarious guy. He doesn't mind getting a little off subject--to tell you about his dog or his wife--and doesn't mind speaking his mind. For example, Herb is clearly a little bit of a libertarian (although he never comes out and says it) and doesn't mind questioning the assumptions of (what I assume) are fellow liberal students. I actually quite enjoy this. \nReally and truly Herb is the best core teacher I've had at Columbia. Affable, brilliant, self-effacing, and funny he is truly fun and enlightening to be around. He isn't out to crucify you--frequently remarks that he knows most students don't do the reading--but if you don't do ANY of the readings you of course will be screwed. That being said, this class does make you think and does help you understand these classic. \nWorkload:\nAs others have said, 4 5pp papers, mid-term, and final. One paper grade drops (yep!).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 26, 2010",
            "review_content": "\nHerb Roseman is a nice man, but not the ideal section leader. He starts off each class with a short lecture which is nothing remarkable. Then he tries to start a discussion about something related to the reading. There are a few issues with his attempts though:\n(1) They are often unsuccessful\n(2) When they are successful, it's always the same four or five students giving their opinion -- Seriously, half the class NEVER participates and people regularly just don't show up.\n(3) He tries to start general philosophic discussions, but they're often not really related to the books. For example, we've had a discussion about whether or not we have free will at least four times this semester, when it's often just tangentially related to the readings at best.\nThere also seem to be no repercussions to not doing the reading. He would never call anyone out on it and it's very very easy to BS your way through a discussion since they're not very focused on the readings themselves.\nBasically, in each text he has a few ideas which he is interested in and will harp on them over and over again. Those usually end up being the main topics tested on the midterm and final, so again, doing the reading is not essential. For many of the texts I feel like I came away having learned almost nothing besides for a few random ideas.\nAnother big problem with Herb is that he is really not interested or knowledgeable about the religious texts (as he often admits), and those make up a significant portion of the first semester syllabus. His inability to create discussion is heightened when he doesn't know the material himself.\nOn the plus side, he will make time to meet with you outside of class and will often tell you what to write about for your essay. In addition, he is a fun guy and will generate an amusing discussion every once in a while. Finally, I only had him for the fall semester and I could see him being better with the spring semester texts (more philosophy, less religion). Based on my experiences alone though, I think he is a professor to avoid.\nWorkload:\nFour essays, a midterms, and a final. The four essays are more than most sections, but there's no weekly responses or anything like that and you can definitely get away without doing the readings, so it kind of evens out.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 09, 2006",
            "review_content": "\nthe concepts can be difficult to understand initially because Prof. Rosman's explanations are not very thorough. His comments are helpful and make sense, but do not make monumental improvements to your writing. Success in the class is almost guaranteed, as long as you write the papers. the other busy work is not entirely necessary, if you read the first page or so, you're usually set for the assignment.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 20, 2005",
            "review_content": "\nDon't take UW with Prof Roseman if you want to improve your writing; take it for the A.  He's a nice guy.  He'll meet with you about your papers, and take your comments into consideration while grading.  But don't expect him to actually tell you how to write better.  He advised me to make my writing less formulaic, which was an absolutely valid criticism, yet he was unable to give me any advice on how to do so.  He merely told me that his writing had the same problem, so he couldn't help me.  On the plus side, however, he's a VERY generous grader; he told us we'd have to work to get less than a B.  Overall, not recommended--we all have to take this class, at least get something out of it.\nWorkload:\nThe usual UW workload--4 papers of varying length.  Generously graded.\n"
        }
    ]
}