{
    "prof_info": [
        {
            "prof_name": "Emanuele Gerratana",
            "prof_id": 5065,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Economic Analysis for International & Public Affairs I",
            "review_date": "December 22, 2013",
            "review_content": "\nProfessor Gerratana wins teaching awards for a damn fine reason. He rocks at his job. Prior to taking his course, I had absolutely no interest in or particular respect for classical economics as it is taught today. I even tried to study over the summer and test out of the class so I wouldn't have to take any. But Gerratana was so good that I came to every single lecture and discussion section. Excellent stage presence and of course grasp of the material. He also makes these bizarre but hilarious jokes and uses funny examples that stick with you. A bunch of us kept running logs of quotes from his lectures that we'd love to post, but don't because we don't want to get him in trouble. Even in a class of 250+ students, he leads all  20-30 person discussion sections himself and tries to get to know every student by name. He clearly cares very much about students and their success. A great guy, and a great teacher. My only complaint is that since he is a native Italian rather than a native English speaker, he occasionally makes language mistakes in written tests and assignments that might throw you off a bit. These are rare, and if English is your first language, you'll be able to understand what he means when it counts.\nNow, for those of you who are deciding between Econ 4200 and 6400, my take is pretty simple: if you're moderately confident in your algebra skills and know some very basic calculus (how to take simple derivatives), take 6400. There is less homework (to compensate for the higher degree of difficulty) and you'll be allowed into more classes later. Don't be scared off by people saying you need to know multi-variable calculus. You don't, really. Just pay attention in SIPA math camp the day they teach partial derivatives (sounds scary, actually very simple) and you'll be fine.\nIf you are not confident in your algebra skills, the 6400 homework and tests will be too confusing for you to enjoy the lectures. Take 4200, whose professor also has an excellent reputation (though not as funny, clearly a good teacher and very nice). There's more work that will take you more time, but it's at an easier level.\nWorkload:\n7-8 group problem sets (graded on a check/check minus/check plus scale-- you will always get check unless it's perfect you're you're completely off), a five minute presentation, an occasional reading, and two three-hour blue book exams (mid term and final). Class average on tests is usually in the 70s, grades obviously curved to SIPA's usual standards.\n"
        }
    ]
}