{
    "prof_info": [
        {
            "prof_name": "Juan Alvarez",
            "prof_id": 6344,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Hispanic Cultures II",
            "review_date": "September 24, 2013",
            "review_content": "\nJuan Alvarez is a fantastic teacher. I highly recommend him. Spanish 3350 (Hispanic Cultures II) rushes through over 500 years of the history of Spain and Latin America which was fascinating to me. Alvarez emphasizes readings, discussion and the provocative thoughts students are able to present in a written form. He is incredibly knowledable and never boring as he has a good sense of humor and allow students to do group work and presentations. His feedback on papers and tests is highly thoughtful and often suggests a new route into the understanding of the topic. I left the class with a transformed view of the world around me and Latin America in general.\nJuan Alvarez is by far one of the best professor I have ever had.\nWorkload:\nThe course itself is a lot of work, and Juan always expects a full effort, and more than it is required, but doable if you are passionate about it.  7 compositions (1 per chapter covered) of 300 words each (with 1 rewrites), and 3 exams with no final. \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 24, 2013",
            "review_content": "\nI took Spanish Intermediate II, and got an easy A in the class. He's a great teacher, good sense of humor, and wants you to do well as long as you put effort into your work. \nClass was varied: read fictional and nonfictional texts, did grammar exercises, watched movies (2 or 3 times throughout the semester), sometimes listened to audio recordings to practice listening comprehension, had conversations, etc. Emphasis was put on improving all skills: reading, speaking, listening. \nI honestly thought it was a relaxed class, and not stressful at all. Everything was clearly assigned on CW: tests and essays no less than a week before they were due. Juan is also a fair grader. Although he grades the first drafts of your essays, he always requires you to revise them -- students almost always get a higher grade on the second draft.\nJuan cares about motivation in class, and willingness to learn and grow. He's easy-going so long as you study the material and put a normal amount of effort into the class.\nWorkload:\nungraded grammar problems and occasional readings (max of 40 min per class meeting), 3 two-page essays on interesting topics, midterm (easy), final (easy: a oral presentation)\n"
        },
        {
            "course_name": "Intro to the Study of Hispanic Cultures",
            "review_date": "January 10, 2011",
            "review_content": "\nTerrible course but good guy.  The readings kill you they are so dull and the discussions in class are therefore...non existent.  Juan tried to make it better but there really is so much you can do with the material given.  Don't waste your time with this course.\nAnd because this review must be longer (or so CULPA tells me) We all just watched the clock tick by.  We had small discussions to go over the text, which mostly included people figuring out what the readings said...oh wait they all said the same thing: that some people were and continue to be oppressed, identity is a complicated thing, and latin america plays some role in the discussion (at least half the texts were translated from english or french to spanish)\nWorkload:\neasy but annoying homework for each class, short readings, 3 essays with 2 drafts, final paper.\n"
        }
    ]
}