{
    "prof_info": [
        {
            "prof_name": "Edward Park",
            "prof_id": 6558,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "December 26, 2008",
            "review_content": "\nEd Park is a very nice person. He's also a careful and considerate reader. With time, he will be a very good teacher. As it was, he was okay. The only writing assignments we had were two stories, plus the weekly feedback for the other writers in the class, though the feedback was never collected. As the semester went on he got progressively better at directing the in-class workshops, but there were many times when the discussion would stall on a minor or irrelevant point (for example a couple of times a first chapter for a novel was submitted and several people thought it was a short story, in an effort to accommodate their idiocy, Professor Park would lead part of the discussion towards how the chapter read as a short story...completely unhelpful for the budding novelists in our group). Workshopping is an indispensable part of becoming a good writer. It is often easier to recognize the mistakes in other stories that we make in our own. Even more indispensable than workshopping is actually writing, something I would like to have done more of in a creative writing clas. I wanted to write more than just my two stories. I wanted some directed exercises designed to practice a specific aspect of writing, or some assignments to help break us out of our comfort zones, or anything really. Some readings would have been helpful as well. There were a couple of quick articles that he gave us, but they felt incidental to the course, more like an afterthought. The real mystery about this course was the grading. I assume that the two stories I turned in were in some way responsible for my grade, but I honestly have no idea. In the syllabus it says that participation is important, but how does he judge participation? Some more concrete feedback regarding how I was fulfilling the requirements of the course would have been helpful. Basically, I have no idea how this course was graded. I liked Professor Park. In the one on one conference he gave extremely helpful feedback and advice. I just think he needs to get a little more experience under his belt and provide some more structure to his class.\nWorkload:\nLight. 2 stories with no strict length requirements. Weekly written feedback (2 paragraphs per story) which many people started to skip once they realized it wasn't being collected or graded by the professor.\n"
        }
    ]
}