{
    "prof_info": [
        {
            "prof_name": "Emily Shortslef",
            "prof_id": 10773,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 13, 2013",
            "review_content": "\nEmily is absolutely fantastic. She impressed me from day one with her knowledge of the texts in addition to her sincere interest in anything she didn't know already. If someone brought up something that was especially interesting, she would take a moment to just acknowledge that, and then move on to her own point. She is very open to many different interpretations of the texts, which is refreshing within a class that could very easily get very boring. \nEmily varied her class structure, usually with some lecture component and discussion. Sometimes she threw in group work (in which she provided us with questions that were relevant and easy to discuss) and these open discussions where she would just let us lead the class and see where that took us with our own ideas; later, she would bring these back in her own discussion. She made sure to talk about the important things that everyone should know about the books, but also asked us what we wanted to talk about. \nAs far as grading, I think she's a pretty fair grader. She gives good feedback on essays, and on mine she included specific places where I could improve for my next essay. I find that specificity very useful. She also did draft meetings or paper idea meetings, which were useful in figuring out what she was looking for while also expanding our own ideas. \nShe also arranged for us to bring snacks each class, which was so nice for a 4-6 class. I would recommend her to anyone - I legitimately felt very prepared for the final and I enjoyed this class - my favorite! \nWorkload:\nTypical Lit hum - readings, 3 papers, midterm and final. Daily short writing quizzes, maybe about 5 minutes each, but pretty straightforward if you read the material. The quizzes left a lot of room for different sorts of answers, so it didn't feel like you were screwed if you forgot one part of the text. Weekly wiki posts that didn't take more than 10 minutes and were easy to come up with topics for.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 18, 2013",
            "review_content": "\nI disagree with the other review. Emily is a fine teacher. The workload is incredibly reasonable, with the same reading any Lit Hum class would be required to do and the wiki-spaces assignments is not even checked for a grade. \nI missed a few classes and she was very generous with making up the lost participation. She's very understanding as a teacher and accommodating. \nShe also organized for us to have snacks everyday in class. Literally nothing to complain about, unless you hate Lit Hum in general, but the content of the course standardized throughout the department and really doesn't reflect on her own preferences. \nWould definitely recommend her if anyone has to switch sections.\n\nWorkload:\n3 papers, reasonable reading. Completely manageable. \n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "October 20, 2013",
            "review_content": "\nBasic Uppity Grad student. Nice as a person and very interested in the subject. \nIt may be as a result of how young she is, but she doesn't offer much to your understanding of the books. \nShe made us use wikispaces every week to write close readings of things pertaining to the book we were on, but nothing was really gained by this. \nHer class is very similar to the typical bullshit you probably did sophomore year in highschool. Useless busy work, no real insight. Easily my least favorite class. \n\nWorkload:\nlots of reading( true for all of lit hum though) and weekly close readings. \n\n"
        }
    ]
}