{
    "prof_info": [
        {
            "prof_name": "Liam Paninski",
            "prof_id": 2731,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Probability and Statistical Inference",
            "review_date": "December 22, 2010",
            "review_content": "\nThink long and hard before taking this class. Not because it's bad, but because it requires a serious commitment of your time and effort. This class is really two classes in one -- it covers two semesters of material (all of 3105/4105 and all of 3107/4107) plus the classes are 2hr 45min twice a week. Also, it's impossible to get ahead of your work, because there's always another problem set due in just a few days (see the workload below). Of course, it's also worth six credits, so you'll be rewarded for your efforts, especially if you can pull off a good grade. But just appreciate how long you'll be spending in each class and doing problem sets and just generally doing probability/statistics.\nIn addition, IMO, the fact that this class goes at double-speed makes it more than twice as difficult. For example, if you were to ever miss a class or ever be unfocused during class, you're suddenly way behind. Furthermore, there's less time to let the often difficult concepts sink in before you've moved onto concepts which build on top of those concepts. If you're confused about anything, going to office hours is very important, otherwise you may stuck behind for a while.\nTwo other important details to realize about the class:\n(1) It's almost entirely master's students, many of them getting master's in statistics. So the people in this class are bound to be pretty smart and you can't really count on much of a curve.\n(2) It's fairly theoretical and proof-based. So it may be an an adjustment if you're not used to that type of course. Very few of the problem set questions or the exam questions were purely computational.\nAs far as Liam himself is concerned, I have a generally positive review. First of all, he's definitely a nice guy, and really does want people to come to his office hours. Second of all, he's very relaxed, especially as a lecturer, which can sometimes make it a little tough to focus for such a long time, but it also makes it a far more pleasant experience overall. Finally, he always gives a break at the halfway point in class, and more often than not finishes class early, sometimes even by a half hour.\nI think he does a decent, but not spectacular job of teaching the material. He admitted on the first day that he's not as strong at probability (and especially combinatorics) as he is at statistics and I think that I may have, in fact, found things a bit clearer in the second half of the course. He goes at a pretty reasonable pace and always stopped to ask if there were any questions. One major flaw of his was that he sometimes kept things too abstract and failed to give more concrete examples to help clarify things. Additionally, though he repeatedly tried to get the class to participate, he usually failed, and classes ended up being almost entirely lectures. However, the fact is, this stuff is difficult and yet in the end, most students seemed to get it. I found that I ended up teaching myself some stuff from the textbook, but most of my understanding of the material came from the lectures. In particular, I sometimes found that Liam helped me get what was going on conceptually while the textbook helped with the actual steps that needed to be done (though the textbook wasn't great -- it may be worthwhile to use other statistics textbooks to supplement it).\nOverall, I'd say you should take this class if you are either very into probability/statistics or need to get the statistics requirements very difficult.  If you don't fit into one of these two categories, you may be better off taking 3105/4105 and then 3107/4107. If you've settled on taking 4109, Liam is a solid choice.\nWorkload:\nProblem sets due EVERY SINGLE CLASS. That's right, every Monday and every Wednesday. They're usually around ten questions from the textbook, some of which are pretty straightforward, some of which can be pretty challenging. The problem sets won't play such a big role in your final grade though.  It's really about the midterm which covers all of probability and the final which covers all of statistics (it's not cumulative). They were  both eight questions and were tough but not impossible.\n"
        },
        {
            "course_name": "Probability",
            "review_date": "December 27, 2006",
            "review_content": "\nNice guy but boring class. Basically he spends the whole class doing proofs and working out calculations.  He give good examples, where everyone figures out in the first 5 min how to set up and solve it, but then he goes on for 15 min solving tedious calculations.  He should just skip to the answer.  I took as an undergrad a probability course which I think helped me alot, thus this class was fairly easy for me. I think those who took this class as an intro to probability theory had a very difficult time.  I hate the Ross book we used.  It uses examples to teach, not proofs, which is something I don't like (others might like it though).  Also, I feel that the book got pretty useless by the later chapters (almost as if Ross was tired of writing it)\nWorkload:\nHW every 2 weeks or so (6 or 7 total)  In class midterm with note sheet (format is select 5 out of aprox 10 problems to complete), in class final with note sheet (select 8 out of 20 problems to complete)\n"
        },
        {
            "course_name": "Linear Regression Models",
            "review_date": "May 07, 2006",
            "review_content": "\nProf. Paninski is friendly and laid back.  However, I spent the whole time lost in the class because I don't feel like there was enough explanation of the theories, examples were just done, and in all fairness, he did try to see if everyone was clear, but his problem is that instead of explaining the method and how to think about a certain problem, he just does it in class.  So I ended up understanding what he was doing and not understanding why he was doing it.  The material was really hard, the homework was hard, everything about the class was hard, and if you couldn't make it to the recitations or the office hours (as was my situation) you ended up lost the whole semester.  Piece of advice: Don't take the class unless you absolutely need it!  I need it for my major (I'm a stat major), and it was ridiculous...\nWorkload:\nweekly problem sets, 1 midterm, final\n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "December 19, 2005",
            "review_content": "\nFlippin hard material!  Before you read this, be aware that I am an undergrad who was forced to take this class because i couldnt fit anything else in my schedule.  Most people in this class were bschool and stats masters, so I am speaking from an undergrad perspective (therefore others may have found the course easier than I did).\nProfessor Paninski is a cool guy, very laid back and friendly.  I think this was his first time teaching as well.  \nThe course material was quite difficult and I had a hard time following him.  The theme of the class was \"oh, well if you see my mistake, let me know\" or \"ya, well it looks something like that.\"  Anyone who takes math classes knows these statements tend to pop up.  I felt they popped up a little to often in this class, usually to the point that it was hard for me to grasp what was right and what was wrong.\nThe real problem with his teaching style is something alot of teachers have, he sets the bar way too high.  He doesn't do any examples of the theories taught in class, leaving students to fend for themselves.  The homework problems were explained by teh TA, and if you miss recitation you will be clueless (as i was) on all of them.\nWorkload:\nmidterm, 2 quizes, weekly hw, final\n"
        }
    ]
}