{
    "prof_info": [
        {
            "prof_name": "Kirsten Ellicson",
            "prof_id": 3006,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 14, 2009",
            "review_content": "\nYes, Lit. Hum. with Kirsten started out awkward and not all too engaging but that shouldn't be a judgment on a year long class.  As soon as the class settled in a bit, and especially 2nd semester, the classroom atmosphere became very comfortable and interesting.  Kirsten definitely is a smart and thought provoking teacher who was always willing to consider and discuss our ideas as well as those she brought up. She was also very helpful with essay topics and further discussion during her office hours.  If you give her a chance, I think you'll find she's a great instructor who genuinely cares about her students.  \nWorkload:\nTwo 5-7 page essays and a few other small and generally easy summaries and passage analysis type assignments.  Exams were very doable with some studying.  Generally easier than the average Lit. Hum. section from what I gather.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 22, 2008",
            "review_content": "\nProfessor Ellicson was so nice (particularly in grading) but was easily frazzled during discussion, generally making class awkwardly silent. Whenever discussions were started, Kirsten just seemed a little overwhelmed by the lack of structure. It wasn't too bad overall... we had a lot less work than many of the other lit hum sections.\nWorkload:\n2 essays, 5-7 pages double spaced. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 01, 2008",
            "review_content": "\nKirsten is so nice and I always felt bad because she always appeared so nervous. As an individual, it's obvious that she is very intelligent but was not the best at encouraging discussion or making anything we read sound meaningful. She graded generously; you really had to do nothing to get a terrible grade.\nWorkload:\nI'd recommend doing the reading, but it's not necessary if you can do the two essays without it. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 29, 2008",
            "review_content": "\nKirsten as a person is extremely nice. However, when teaching the class she is nervous and ill prepared. The class got behind in reading because we would often have to spend another day on each book. Kirsten was often heard saying I'll have to do more research and talk about that later. It was extremely painful sitting through discussion because no one had anything to say and it was all extremely disjointed with no guiding principles. The grading would have been fair except considering she did not offer anything to say and couldn't explain things and neither could the students, the standards shouldn't have been so high.\nWorkload:\nTwo papers (5 to 7 pages). Midterm w/ ids. Final w/ ids. \n"
        },
        {
            "course_name": "French Elementary II, accelerated 6 weeks",
            "review_date": "September 08, 2006",
            "review_content": "\nI like Professor Ellicson very much. However, our class had a rough start. Many of the exams were confusing because they were often worded akwardly and contained many typos. At first she seemed disorganized, and a bit inexperienced (If I sound harsh, it's just because my last professor, Samuel Skippon, was an exceptionally wonderful and efficient teacher). Though the beginning of class was a bit rough, it got better. She was always available outside of class to help. Also, her teaching style seemed to improve dramatically as the semester progressed. She was extremely kind. She often bought us delicious french treats to share with the class and her favorite french music. I definitely like her as a person, and I could tell she cared about her students. She also later loosened up with the grades to make up for the confusing exams. \nWorkload:\nvery heavy, due to the accelerated content of the course. \nAbout 2 chapters, one test and one quiz a week. \n"
        }
    ]
}