{
    "prof_info": [
        {
            "prof_name": "Robert S. Thomas",
            "prof_id": 2292,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 16, 2015",
            "review_content": "\nRobert's a nice enough guy, and he seemed to try quite hard to be engaging. Unfortunately, our class wasn't nearly as engaged as he (or most of us) would have liked. Discussions were rather bleak, with a few people dominating most of the conversation.\nRobert himself is a fairly pleasant guy, but I think many students found him to be intimidating or something. If you get him, he's not the worst Lit Hum instructor, but nor is he the best.\nWorkload:\nPretty fair grading, with a heavy weight (~40%) on Attendance, Participation and Quizzes (One quiz per text, but you don't have to do all of them). Other than that, he has a take home midterm, (which sounds nice, but receives slightly harsher grading) and a final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 25, 2013",
            "review_content": "\nPretty much agree word for word with what the previous reviewer wrote. The only thing that I would have to add is that as a history buff, Robert likes to connect the reading with relevant real-world events that are either current or in the past. He often (almost every class) brings an article from the New York Times or other news source and asks us to connect it to the readings. This is a double-edged sword, since the poli-sci/history majors and more humanities-oriented people of the class tend to dominate the discussion, but at the same time it is nice to relate the ancient CC texts to topics that are relevant to us today. I recommend reading up on the news regularly if you are going to attend his class because sometimes knowledge of the text in its own context isn't always enough. Overall though, Robert is a solid professor for CC.\nWorkload:\nWhat the previous reviewer wrote. We both took the class during the same semester.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 03, 2013",
            "review_content": "\nNicest professor ever. Even though I'm not a big fan of the CC material, I really like him as a prof. Take CC with him if you can. Our class had some pretty lively discussions (I wasn't exactly a big contributor to these discussions but that's probably because I'm not very on top of the readings. As far as I can tell, some people get VERY into the discussions.) This semester, he gave us a take home midterm AND a take home final. I don't know of too many columbia professors who would do that. He's also a very fair grader. Pending the final, I'm expecting an A- or B+.\nWorkload:\n2 essays, 1 take home midterm, 1 take home final, a few take home quizzes\nyou also have to serve as a presenter and online discussion leader once during the semester\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 23, 2012",
            "review_content": "\nI thought Robert was a very good section leader for CC. As far as I could tell he seemed quite familiar with all the texts we read and was able to get pretty good discussions going, while also summarizing the important facts from the readings. I approve of the fact that he gave those overviews before really starting the class discussions, this way avoiding some of the more awkward silences. We had very informative review sessions for both midterms and both finals, and for the essays we always had a choice between three topics. Overall, I'd recommend you to take this class with Robert if you are in his section. \nWorkload:\nWeekly courseworks posting, two essays (5-7 and 8-10 pages), midterm and final \n"
        }
    ]
}