{
    "prof_info": [
        {
            "prof_name": "Katherine Dacey",
            "prof_id": 1432,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "April 26, 2007",
            "review_content": "\nI must strongly disagree with the other reviews. I write this before my final, so my objective judgment does not get clouded by the grade I receive. If you have Katherine for Music Hum, consider yourself damn lucky. I have never had a professor who gives so much effort. She provides you with most of the sources for the papers, so you do not have to spend much time on research. She reviews drafts, is very approachable, answers all emails super fast. \nKatherine has a very dry and refreshing sense of humor - a rarity among professors. Yes, she is not very happy when folks come late - but she is right, it is disturbing. \nBut she brings donuts and coffee to motivate everyone to come on time! She shows movies, operas, even Monthy Python sketch about Beethoven, does everything to make the class interesting. Come on! And I (who has no music background) learned a lot in her class, and even started to love opera and jazz (I know, I would have not  believed that either)\nThank God I stayed in her class. I would highly recommend Prof. Dacey.\n\nWorkload:\nEasy. Weekly readings 20-30 pages,some great music listening assignments, several spread out written assignments throughout the semester, so you have a lot of possibilities to improve if you screw up on one or two. \nOne concert report, take home midterm, in class final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 26, 2007",
            "review_content": "\nI must strongly disagree with the other reviews. I write this before my final, so my objective judgment does not get clouded by the grade I receive. If you have Katherine for Music Hum, consider yourself damn lucky. I have never had a professor who gives so much effort. She provides you with most of the sources for the papers, so you do not have to spend much time on research. She reviews drafts, is very approachable, answers all emails super fast. \nKatherine has a very dry and refreshing sense of humor - a rarity among professors. Yes, she is not very happy when folks come late - but she is right, it is disturbing. \nBut she brings donuts and coffee to motivate everyone to come on time! She shows movies, operas, even Monthy Python sketch about Beethoven, does everything to make the class interesting. Come on! And I (who has no music background) learned a lot in her class, and even started to love opera and jazz (I know, I would have not  believed that either)\nThank God I stayed in her class. I would highly recommend Prof. Dacey.\n\nWorkload:\nEasy. Weekly readings 20-30 pages,some great music listening assignments, several spread out written assignments throughout the semester, so you have a lot of possibilities to improve if you screw up on one or two. \nOne concert report, take home midterm, in class final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 30, 2003",
            "review_content": "\nI had Kate Dacey for Music Hum.  On the first day she passed out a musical knowledge assesment sheet.  I debated whether or not to divulge that I had been playing music since a young age.  I was truthful on the assesment sheet and Kate Dacey irrationally assumed that my ability to read music had granted me a wealth of musical history knowledge.  Since I had never had musical history, this was a  false assumption, but she graded me according to this assumption.  If you find yourself in her class, pretend you've never heard what a piano, an opera, or bad teacher is.  By the end, I assure you'll understand all three.\n\nWorkload:\nReading for every class.  Some of the reading is in the Music Library reserves (which is a pain).\nShe made me get a book for a project that was only at the Lincoln Center Library.  I was the only student who had to do this. \n2 or three papers/projects   \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 15, 2003",
            "review_content": "\nIf on the first day of the semester you find out that the name of your instructor is Katherine 'Kate' Dacey, then do as follows. Run! Do not pass GO, Do not collect $200, just RUN. And you'll thank me. If Core Classes are like academic roulette, then getting her section is playing with the chambers full. Excessive you might be thinking. Actually I think I'm being nice. More than two unexcused abecenses constitutes 2 points off your final grade per absence. Her lecturing style is boring. She had to give out candy to keep us awake. This class managed to kill what little appreciation for classical music I had prior to taking it.\nWorkload:\nQuiz every class. Concert review (3-5 pages) that has very ambigious requirements.  Final paper (6-8 pages). a midterm and a final.\n"
        }
    ]
}