{
    "prof_info": [
        {
            "prof_name": "Jennifer Nash",
            "prof_id": 9500,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 18, 2009",
            "review_content": "\nShe taught Contemporary Civilization this fall semester, and she was an excellent teacher (it was her first time teaching in Columbia!). She struck the right balance between being challenging enough that you felt you were growing and at the same time veryapproachable, friendly and laidback (she'd sometimes bring cookies in or poke fun at people). I went to her office hours a few times to talk about the class (she solicited my feedback on the class) but also about life in general. I felt comfortable talking about nearly everything with her, even if I knew she'd disagree, because she respected whatever I had to say. \nHer style of leading discussions, and she really emphasized discussion, is thus: She'd often go around asking everyone to come up with a question they had from the reading. After synthesizing the questions into a few broad questions that targeted the core of the text, she'd pose them to the class, making sure we addressed it and bracketing any tangents for later on. She rarely gave her input (I'd actually appreciate more input on her pat), and often would highlight someone's comment and ask the class how they felt about it, whether they agreed or disagreed. If she noticed someone disagreeing with another person, she would call them both out on it and got them to work out their disagreements. Critical peer engagement, and not just a random therapy session where people throw out their comments and feelings, was key for her. Furthermore, the content of the discussion was generally centered on major themes in the text or throughout the course. Historical context or literary analysis was definitely not the focus of the class (which, for me, is relieving). \nShe gives detailed feedback on my papers and challenging but fair grading. Organization/clarity as well as expansion of all ideas (including factoring in counter arguments) is key for her. If you misspell something, don't sweat it too much - she understands the time-pressure. \nShe won't be teaching CC, I believe anymore. Her focus is on Gender Studies and Black Feminism and all that jazz. It's not my field, but I'm certainly tempted to take one of her classes given her thoughtful, respectful approach to different ideas and critical engagement of them. \nWorkload:\n3 8-10 page papers, one midterm (half IDs, the other half short answers), one final (3 in-class essays). She'd occasionally pare down the workload if many students reflected that it was too much. \n"
        }
    ]
}