{
    "prof_info": [
        {
            "prof_name": "Laura Weber",
            "prof_id": 894,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 07, 2005",
            "review_content": "\nThe reviews that say she hates kids in the class is way too harsh. The workload was pretty easy, if you do most of the reading you will be fine. She grades harshly only at the beginning of the semester to get the students to try harder and ends up 'forgetting' your first paper if you don't do well and she is always very understanding when it comes to extensions. Although the class discussions were usually student driven, they were mostly interesting. If you don't do any reading, never talk and write bad papers she might not like you as much as kids who try harder, but she doesn't hate anyone. If you even put in a little effort you will be happy with your grade. \nWorkload:\nSame as below\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 17, 2005",
            "review_content": "\nI have no qualms with Laura and have enjoyed her class much more than I expected (I came to Columbia expecting Lit Hum to be a year of terrible eat-your-peas type education, and it has turned out to be great). The class discussions are often dominated by a select group, yes, but that is hardly her fault. Many kids in the class seem to be afraid to speak up for fear of being drowned out by the other folks in the class, but to force these kids to talk would probably do more harm than good to the class discussion. I was not one that participated a lot in class, but I felt like I got a lot out of listening to the back and forth between Laura and the students who did a lot of talking.\nI can see where people are coming from with the \"favorites\" thing, though I would doubt that it is as severe as it is made out to be in the other reviews. I definitely wouldn't say she \"hates\" any student in the class. I made A's on most of my papers, the midterm and the final, so I would assume that I am a \"favored\" student, but as I said before I didn't participate much at all in the class and still did very well. That doesn't really flow with the logic of some of these other reviewers. It's always seemed to me like those who were irritated with the grades they received have more of a reason to search for some underlying bias against them, which may or may not really exist. I personally have not angrily compared my work with that of other students in the class for some sort of verification that I am on par with them in terms of skill or intelligence. So take what you hear from them with a healthy skepticism, but also know that since I managed to succeed in the class I am probably more reluctant to speak out against her. She does not intentionally choose students to pick on.\nI should say that I had hoped that there would be a little more big-picture contextual type instruction in the class. The discussion always seemed to focus on minute details instead of broader messages, and her pre-discussion introductions usually focus on the translation of a word or group of words that somehow pertain to the work. Most of what I learned I learned just from reading the books.\nWorkload:\nPer semester: Several 2-pagers, one 4-6 pager, long midterm, standardized LH final, standard LH readings\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 06, 2005",
            "review_content": "\nLaura was fine.  We had way too many papers of very short length, which made it hard to prove a point in the amount of room given; therefore, it was really hard to get an A on a paper.  She's also a pretty tough grader, thus making success even more difficult.\nI agree with the other two people who said that she chose favorites--a couple of my classmates asked me to read their papers, and then told me their grades afterward; given that one of these students was considered a \"favorite\" and another was not (and I myself was not), I saw a definite discrepancy in grading, where the \"favored\" student received very high grades on papers that I thought weren't so great.  If you participate a lot in class (it's not especially important to bring up extremely original ideas, nor is it to do so in your paper--repeating what was said in class seemed to work), then you're probably going to have an easier time getting an A in this class.  Good luck!\nWorkload:\n5 papers (4 2 pages, 1 5-6 page), midterm (TOO LONG!), final, provocations for each class (a couple sentences about the text)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 18, 2004",
            "review_content": "\nshe is a bad professor. in my opinion laura has her class divided into the students that she likes and hates. Trust me if you take you will understand this. if she likes you than you should have a good grade but if she does not then, you will get a bad grade. This has happened to 5 distinct members in my class, so i would recommend that you stay away!\nWorkload:\ndaily provocations-a question, 4 essays, mid-term, and a final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 10, 2004",
            "review_content": "\nLaura Weber...nice person...I hated the class though. First person to get a D in lit hum would be me after having her...switched as soon as I could. She's nice and all (as long as she likes you). She seems to have her  favorites...the ones who interrupt, talk their asses off, and never shut up. She is a classics major so grading is hard...never got an A on any of her essays. Oh yeah...midterm...horribly long and no matter how much you write...never A worthy\nWorkload:\nShort provocations, paper after each book, long midterm, final\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 11, 2002",
            "review_content": "\nThis was definitely a great class as far as logic and rhetoric classes go. LW is charming, friendly, sweet, and very approachable. She looks really young and can be easily confused for one of the students. I'm so glad I had her and escaped the horror that l&r; classes usually inspire. This was actually one of my favorite classes this semester. Considering that it was mostly guys, lectures were very often centered on sex, which was definitely fun. Many times, we would get side tracked by heated debates between students on various subjects from Toys R Us to literature. Her comments on essays are very helpful and the grading is fair. But she's definitely a pleasure to have as a teacher. She is not on a power trip, out to fail all her students, like many other l&r; teachers. She seemed to sincerely enjoy teaching us, and told us that on many occasions. Too bad she will not be teaching l&r; anymore. Oh yeah, and she threw us a party on the last day of class with real food that she supplied. \nWorkload:\nUsual l&r; workload\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 13, 2002",
            "review_content": "\nMs. Weber walked into class on the first day of classes and I could immediately discern that this was her first time teaching the course. She was quiet and unassuming. But as the year progressed her shyness dwindled and her knowledge of writing broke through. It wasn't the ideal section of L&R;, but it wasn't even close to some of the horror stories I've heard. Laura thought up interesting assignments that followed the L&R; guidelines behind them. She always offered a lot of good comments when she returned a paper and the grading was tough but fair. A really good paper gets an A and a bad one will get a C. The one detraction was that classtime was often dull or boring. Her use of student writing and making the students criticize it was done fairly well, but her lecturing on grammar and structure wasn't done as well.\nWorkload:\nThe typical L&R; with short paper twice a week for the first half of the semester. In the second half longer papers were due once a week including revisions.\n"
        }
    ]
}