{
    "prof_info": [
        {
            "prof_name": "Jay Deshpande",
            "prof_id": 10782,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "March 28, 2012",
            "review_content": "\nJay was a wonderful teacher who was able to bring lots of energy and enthusiasm to our 9:00am class. Although he usually expected just enough participation and engagement for it to be annoying, his teaching method was generally good. He focuses not on the detailed level of writing, but more on the overall structure, clarity of argument, and use of external sources. Moreover, his comments can sometimes seem frustrating or arbitrary, but after time I came to realize how truly spot on his comments always were. I'll admit that I had come from a high school with an extremely rigorous English program which graded at or above Jay's expectations consistently for years, so I had been prepared (in fact, Jay went to the same high school with the same writing program, and his mother still teaches there!). However, I'll concede that his standards might be tough (though not unreasonable) for any student who does not already have solid writing skills. For me, it was not difficult to get a solid A in the class, and I'm sure that any student that feels as if their English preparation in high school was adequate can do the same. I would definitely recommend Jay to anyone who can get him, not only because he is an excellent teacher  but also because he just a awesome person. \nWorkload:\nThree major essays, many small miscellaneous assignments, lots of readings (do these well, especially since they're not too long usually!). \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 02, 2012",
            "review_content": "\nJay is an overall good guy. He is very passionate about writing poetry and loves the structures of various essays. He is a fair grader for the most part. He has a tendency to be very opinionated and unfortunately sometimes it comes through in his grading. Best find out what his point of view is on the writing subject, and agree with him. Once he makes up his mind, you can't change it, don't try. In his UW class his word (opinions) are law. Expect a B. \nWorkload:\n3 main papers, lots of little assignments (not for grade), participation/attendance required \n"
        }
    ]
}