{
    "prof_info": [
        {
            "prof_name": "Mark Strand",
            "prof_id": 3310,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Studies in Poetry: the Autobiographical Poem",
            "review_date": "December 15, 2010",
            "review_content": "\nObviously, Mark Strand is an incredible poet (one of my favorites), but he is also a wonderful seminar leader. He clearly cares very deeply about the poets he assigned, and his passion was infectious. He also has incredibly insights into each poem, and his observations are always really interesting. Usually he is able to provide personal anecdotes as well--something very few professors would be capable of. \nBasically, this seminar, The Autobiographical Poem, consisted of a lot of wonderful readings (Wordsworth, Whitman, Lowell, Berryman, and Bishop) followed by an engaging round-table discussion with an accomplished poet; for an English major--or for an aspiring poet, it doesn't get much better. Professor Strand could tell us what it was like to do a reading with Lowell or what Bishop thought about certain poems. This is an unparalleled opportunity to gain a more personal awareness of these poets, and this seminar has been one of my favorite courses at Columbia.\nThe best part was hearing his own thoughts about poetics and composition. Sometimes he would give advice for aspiring poets, too, and that was really wonderful.\nWorkload:\nAs I've already said, the readings really couldn't be much better, and we wrote a really interesting paper and gave presentations on other poets thinking about the self. If you like reading and discussing poetry, it's pretty light--maybe a slim book of poems each week, one 6-8 page paper, and two 5-minute presentations on a poem you like\n"
        },
        {
            "course_name": "Whitman, Neruda, Pessoa seminar",
            "review_date": "December 22, 2007",
            "review_content": "\nMark Strand is a big deal and he knows it. I'm not sure that he thinks poetry is something that can be taught so the class tended to devolve in to people picking poems they liked and reading them aloud. The best was when Mark Strand would just read us stuff that he liked for almost the entire time. Also sometimes he would start making up a poem in the middle of class with a little bit of a smirk on his face- I think he knew everyone loved it. Although I'm not sure I learned too much from this course Mark Strand is pretty cool.\nWorkload:\ntwo papers - 5 page in the middle of the term and 2-3 pages for the final. He's a pretty easy grader\n"
        },
        {
            "course_name": "Whitman, Neruda, Pessoa seminar",
            "review_date": "December 22, 2007",
            "review_content": "\nMark Strand is a big deal and he knows it. I'm not sure that he thinks poetry is something that can be taught so the class tended to devolve in to people picking poems they liked and reading them aloud. The best was when Mark Strand would just read us stuff that he liked for almost the entire time. Also sometimes he would start making up a poem in the middle of class with a little bit of a smirk on his face- I think he knew everyone loved it. Although I'm not sure I learned too much from this course Mark Strand is pretty cool.\nWorkload:\ntwo papers - 5 page in the middle of the term and 2-3 pages for the final. He's a pretty easy grader\n"
        },
        {
            "course_name": "Advanced Poetry Workshop",
            "review_date": "November 11, 2007",
            "review_content": "\nHe is an amazing teacher (and poet, of course). I entered his class as a burnt-out writing student, stuck in a rut with the feeling that everything I wrote would be the same as everything I had written before. But as soon as he started teaching, I realized I had never actually been TAUGHT to write before, and Mark Strand would do just that. Just because he's amazing, though, and his class improved my poetry so much, doesn't mean I didn't feel like a total failure throughout the semester. He's very good at making you feel like everything you write is worth nothing. Oh, and he's a tough grader.\nWorkload:\none (very hard) exercise every week (they aren't really complete poems), NO final portfolio\n"
        }
    ]
}