{
    "prof_info": [
        {
            "prof_name": "Chris Moffett",
            "prof_id": 12929,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Philosophy of Education",
            "review_date": "May 22, 2014",
            "review_content": "\nThis is for PHIL V2100 (Philosophy of Education). Prof. Moffett offered great guidance, innovative thinking and helped facilitate really eye-opening conversation during every class session. Each class was centered around the specific reading required for that day, but we were in no way limited to solely talking about the text. We were were allowed to pull in from other readings, personal experiences and observations, random tangents, etc. In fact, there were times where several of us didn't do the reading, but had no problem contributing significantly to discussion. Each class I learned something new. On top of that, Prof. Moffett was very laid back. He let us define what things like \"class discussion\" or a \"philosophy paper\" meant to us. He truly allowed us to have more agency than what is common at Columbia in what our teaching and learning would consist of. We read works by Paulo Friere, John Dewey, Jacques Ranciere, Sophocles, Plato, etc. so were engaged with prolific ideas constantly, and at times some of the readings (like one on the birth of Athena) seemed unrelated, but at the end, almost all of us had epiphanies realizing how connected everything was. If you'd like a relaxed yet rewarding discussion-based class, I suggest you take one with Prof. Moffett. My final grade was in the A-range and I believe most people did really well unless they missed an inexcusable number of classes. \nWorkload:\nParticipation (but very relaxed...you'll want to participate because the discussions are so interesting and appealing to nearly everyone), one 5-page philosophy paper on your personal personal educational experience/theory, a teaching session on one of the readings with a couple other people, one 7-9 page concept paper on one of the readings/philosophers, and a presentation on something educationally related (a concept, method, study, etc.) that we did not talk about. This could be integrated into your concept paper. \n"
        }
    ]
}