{
    "prof_info": [
        {
            "prof_name": "Janet Lee",
            "prof_id": 10794,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 30, 2016",
            "review_content": "\nJanet Min Lee was the best professor I could have had for my first literature class at Columbia!! She makes class fun, engaging and educational and if you take notes during class (the Greek terms, the ideas we discuss, and her hilarious diagrams/cartoons on the board), then you will do well. I got an A- mainly because I am not the best writer, but I was able to ace the midterms and final. Overall, Janet is a fair grader and excellent professor. Take her both semesters! You will not regret it!\nWorkload:\n2 Papers\n2 Midterms\n1 Final\nWeekly posts on Discussion Board\n"
        },
        {
            "course_name": "Lit Hum",
            "review_date": "April 19, 2016",
            "review_content": "\nEverything the person below said is pretty much completely on point. Janet is amazing. She teaches very clearly and focuses on the parts of the texts that are important and interesting. She lesson plans very well and almost always makes sure that we arrive at a *light-bulb moment* conclusion without making you feel too over guided. On top of that she is sweet. smart and funny. Our class had a great dynamic and she often felt more like a friend than a professor. If its any indication the whole class stayed for the second semester.\nWhile the class is not strictly easy, it is also not overly hard. The workload/prof demand is enough to make you learn and appreciate Lit Hum without hating it.\nWorkload:\n3 papers first semester, 2 the second - First one is still 2-3 pages and lightly weighted.They ramp up quickly but if you go to her office hours she is very helpful in restructuring and coming up with ideas. The only important thing is to go with an idea/ SPECIFIC passages already in mind. She won't look over drafts though but there's always the writing centre.\n-Wiki post - You have to do a wikipost before each class on the reading, basically a couple sentences on an online forum (no word count, get to miss two)\n-Invocation and study guide - You sign up for a class and for that class you have to present and invocation (can be very short, most do just show youtube clips). You also have to take notes and make a study guide for that class. It's kind of tedious but the whole class is very grateful come final/midterm season and that way you don't need to make/beg/steal all the study guides yourself.\n-Readings - Janet normally drops a (shorter) text\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 30, 2014",
            "review_content": "\nJanet ROCKS! She was hands down one of my favorite professors during my first semester at Columbia, and the best English professor I've ever had. She's a fashionable, petite, cynically funny woman - you WILL fall in love with her within the first couple of weeks of class. She does a fantastic job of making sure that we analyze the themes of the texts that we read - this sounds like something all lithum teachers should obviously do, but many of my friends have complained that their teachers focus on less helpful things in terms of preparing for midterm/final exams (like learning a bunch of Greek word roots?!). In general, I feel like she really pushes us to strive for deep and complex analyses of the texts - she demands this on the analytical essays you will write and although it may be difficult to achieve her expected level of analysis, she forces and motivates you to improve your writing which is indeed the best thing a teacher can do. She always keeps class interesting and shows her interest in and passion for literature: she has no inhibitions about pointing out all the sexual jokes/references in Lysistrata; she acknowledges the driest/most cumbersome portions of the texts we read (the catalogue of ships in the Iliad, the choruses in the Greek plays, ALL of Herodotus and Thucydides) - but at the same time has the skill and will to show us the beauty and complexity even in these least palatable and seemingly useless passages; she makes a real effort (but doesn't take out unreasonably huge chunks of class time) to get to know her students personally and ask how we're doing in general, etc., and she studied at Columbia herself, so she understands all the toils (both related and non-related to LitHum) that we're going through.\nShe is not an \"easy\" teacher, she will want you to participate daily in class and contribute to discussions in some way (but she's even pretty reasonable about this - she explicitly states that she counts reading passages out loud as participation), and she will want to see you put in effort into writing your essays (GO TO OFFICE HOURS one week before every essay deadline), but if you want to learn a lot and truly enjoy LitHum in spite of the overwhelming workload, you must take Janet's class.\nWorkload:\n- 3 papers --> I really appreciate that she made the first paper only 2-3 pages, and used this as a sort of testing of the waters for both her and us as students to be able to see what aspects of our analytical writing should be improved; when you go to her office hours you should come with a thesis/argument prepared, but even if you don't she will amazingly work with you to create one! basically, go to office hours for each paper no matter what!\n- presentations: each student each semester must make a 15 minute presentation on one of the texts/sections of the texts, it's really convenient that she creates a schedule at the beginning of the semester and allows us to sign up for whatever text we want to present on; some lithum teachers make you prepare for a presentation for every single class and randomly picks a name out of a hat to determine the presenter of the day --> BLECH\n- readings: I don't think any comment on the volume of readings is really necessary. If don't know the answer to this already, you might consider transferring to a different college.\n"
        }
    ]
}