{
    "prof_info": [
        {
            "prof_name": "Mary Monroe",
            "prof_id": 2430,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Organ Instruction",
            "review_date": "March 27, 2006",
            "review_content": "\nFor me organ instruction from Mary Monroe was the best class I've ever taken at Columbia. Mary has an amazing insight in the personalities of her students, so contrary to many other music teachers, she really, really knows what to do to inspire you and turn you into some kind of organist before you know it. Yes, she definitely expects you to practice, but frankly I love doing it, as it's always clear what the purpose of an exercise is and you get results quickly. In comparison to some serious conservatory professors, Mary is really an outstanding pedagogue. \n"
        },
        {
            "course_name": "Organ",
            "review_date": "January 18, 2005",
            "review_content": "\nYes, well, Mary Monroe. Hard taskmaster and takes no nonsense from her students. You might find yourself leaving the lessons shaking. \nThat said, however, you cannot help but feel you are in very capable hands. She is exceptionally knowledgeable, and will iron out any problems instantly. Lessons are bi-weekly so you have plenty of time to practise... and God help you if you don't. \nWhen you get to know this remarkable lady better, you realise that she actually has a warm and friendly personality--it's just that in lessons she is professional and straightforward. None of her expectations are unreasonable, and if you work with her seriously, you will make steady and solid progress.\nShe's also the only Organ teacher at Columbia, so if you're reading this review in the hopes of finding an alternative, you're wasting your time... but you might find it useful if you're a pianist thinking of giving the organ a try. On balance, I do recommend her, but be warned: don't mess with her, and don't take organ if you're not really serious.\nWorkload:\nYou HAVE to practise if you want to survive this course. This can be annoying given the way the Chapel handles the organ practice facilities. But it's not too difficult and you can find a rhythm pretty easily. You have two weeks as well between lessons, which gives you plenty of flexibility. And for all her iron-willed strictness, Mary Monroe is actually a generous grader.\n"
        }
    ]
}