{
    "prof_info": [
        {
            "prof_name": "Deborah Vischak",
            "prof_id": 3148,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 01, 2007",
            "review_content": "\nI agree strongly with the previous review. Prof  Vischak is great, and I strongly recommend taking Art Hum with her if possible.\nA typical class consisted of coming in, seeing showing a slideshow of 10 to 20 slides of whatever era's art we were working on. Lots of comparisons to previous artists we looked at. The discussion went smoothly, and Prof Vischak did a great job getting people to join in to the conversation, which was generally very interesting and engaging.\nThe field trips were a lot of fun. Though it could be painful to roll out of bed and get to the Met on a saturday morning, she made it worth your while.\nThis class has given me an interest in and appreciation for art that I completely lacked previously.\nWorkload:\nweekly readings... fairly time consuming to do in their entirety, but usually skimming was all that was necessary, if that.\nUnfortunately most of the assignments were to get a book from the reserves and read a chapter, which can be tedious. But the readings were nonetheless interesting and useful, though sometimes unnecessary to understand the material.\nThe three papers are short, like 3-4 pages. they are really more about getting you to go see an art work in person than actually writing a brilliant argument.\nOverall a fairly light homework load.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 14, 2007",
            "review_content": "\nWonderful.  Professor Vischak's frank commentary, dry sense of humor and considerable knowledge of and interest in the pieces we looked at made my first experience with art history a very good one.  Her personal area of interest is ancient Egypt, which sadly doesn't feature in the Art Hum syllabus, but she slipped in a few pieces during the first half of the course which made for really interesting comparisons.\nThe best part of the class, not surprisingly, was the discussion, and she was great at giving people opportunities to speak [and occasionally, when the situation called for it, tactfully getting them to stop speaking].  I learned a lot about art, and about history.  Thanks, Professor Vischak - cocktail party conversations, here I come.\nWorkload:\nStandard for Art Hum - lots of reading, but most of it wasn't necessary (although I'm sure I would've learned more if I'd read it.  But sometimes sleep is necessary).  She let us know when it was really important to read an article, and all the ones she recommended were fascinating and really helpful in understanding the art.\n"
        }
    ]
}