{
    "prof_info": [
        {
            "prof_name": "Natasa Sesum",
            "prof_id": 2629,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus IV",
            "review_date": "December 31, 2007",
            "review_content": "\nProfessor Sesum is Serbian so her pronunciation of certain mathematical terms may not be what you're used to but that doesn't get in the way of her doing a clear and efficient job in explaining the material.\nShe pretty much follows the book so it is quite possible to read the book in place of going to class. However, she frequently uses problems she solves in class on her midterms so at least go to class the day before the midterm which is usually a review session.\nWorkload:\nOne eight-question homework assignment each week, two non-cumulative midterms and one cumulative final exam.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "June 07, 2007",
            "review_content": "\nI took Sesum in the Fall and I found her to be the best math professor I have had at Columbia.  Her accept is not strong although she does speak softly if you're sitting in the back.  That doesn't matter, though, because she clearly writes out each step and figure on the board for you to copy down so my notes were fantastic. I pretty much just studied my notes when reviewing for tests and homework although the book does a fair job of showing some examples when doing the problem sets.  The sets themselves are not that hard and I usually finished them in less than 2 hours.  The midterm and final were more than fair as they covered the key concepts only.  I feel I have a strong grasp of Calc III.  Overall good course and good professor.\nWorkload:\nWeekly problem sets (1-2 hours), 2 midterms (Easy), Final (Fair)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "March 20, 2007",
            "review_content": "\nProfessor Sesum was truly excellent. In fact, reading some of these negative comments about her actually pisses me off. \nTaking Calc IV now, I appreciate her even more, because I see that all the things she stressed, including a few of the proofs we were encouraged to learn, were really important. \nThis was simply a no bullshit class. She covered a lot of material, and her tests were definitely challenging, but then she didn't go out of her way to throw all kinds of curveballs at you.\nWorkload:\nThe weekly homeworks took me about 6-8 hours each. She also gave suggested problems (with answers at back of book) which I found very helpful to do before the test.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 16, 2006",
            "review_content": "\nThis class was super easy, but only because she's a great professor.  She puts great notes on the board - clear and concise.  She's also really nice and helpful if you decided to go to her office hours.\nWorkload:\nMostly weekly homeworks, which weren't bad at all, 2 midterms and a final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "May 28, 2006",
            "review_content": "\nNatasa is very fair, very smart, and very nice. When it comes to her teaching ability, however, she is mediocre at best. She is, however, very approachable and wants to give you a good grade.\nWorkload:\nNot too bad. Problem set once a week. 2 Midterms and a Final. Final is same difficulty level as Midterms, just longer. Tests are fairly tough, but very doable.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "March 20, 2006",
            "review_content": "\nSo here's the thing, Prof Sesum is a nice person and she's very smart. The problem is that she works way too quickly. When you ask her to slow down, she will but even that is too fast. The class is still copying down example 1 while she's almost done with example 2. She just tends to skip writing down little steps which isn't a big deal if you've been doing this for a long time but for someone who isn't a math major but just likes calculus and likes writing down all the little steps, this can get confusing. Overall, you really need to know your stuff to sit through her class and keep up with what she's doing. \nWorkload:\nWeekly HW due every week (10 problems), 2 midterms, 1 final...Definitely read the textbook (It sounds weird but if you aren't clear of what's going on in class the text can help you understand it A LOT better) -- Make use of the math help room !!\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 18, 2006",
            "review_content": "\nProfessor Sesum is a nice person, but not the greatest teacher.  When explaining a problem she tends to list the steps, but never explain WHY you should take them.  A typical explaination will sound like 'and then this happens and then this happens and then this happens and we get the answer\".  She tends to wisper into the board in a medium accent, and it is hard to read what she writes on the board.  In brief, I recommend trying to find another calc professor.\nWorkload:\nOne assignment a week that will take two or three hours to do.  It is a mix of useful questions and useless and impossible proofs.  Two midterms and a final; hard tests with good curves.  You can read the specific grade breakdown from other reviews. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 05, 2006",
            "review_content": "\nProfessor Sesum is absolutely wonderful, she's really nice and helpful during office hours...she's also very fair with the grading. She responds within minutes of having sent an email. You MUST sit within the first 3 rows of the class to hear what she is saying, she speaks good english. The problem sets aren't that bad, and neither are the midterms. I thought i bombed the final but i actually got 7/9 problems and I ended up with an A-\nWorkload:\nweekly problem sets, 2 midterms and a final. good teacher, def. take this class\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 26, 2005",
            "review_content": "\nAt first I did not like Ms. Sesum but by the end of the semester I thought she was a very good teacher. Be sure to sit in the front of the class. Sometimes she has a tendency to speak softly but she learned to project her voice more effectively throughout the semester. \nIn high school I had only taken Calc AB so I only had knowledge of Calculus I material but the class was manageable. She always asks the class if we are aware of prerequisite material and if we did not remember she would quickly rehash the material for us. She goes over the methods to solve problems very well though at times the proofs for all the equations were tedious to listen to (luckily she didn't make us derive any of them on the midterms or final!).\nWorkload:\nModerate to Heavy (depending on your mathematical apptitude). Weekly problem Sets. 2 Midterms. 1 Final. All exams could be completed in the time alloted.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 17, 2005",
            "review_content": "\nThough Sesum is a perfectly nice person, I honestly think her teaching boarders on awful. I took Calculus in high school, and so in the beginning of the class, when we were covering material I was already familiar with, things were fine. However, when it came to teaching new material, the class took a serious nose dive. Our entire class did poorly on the second midterm, but in her defense, she does curve the exam grades. She moves too quickly when she is trying to explain things, and tries to cover too much in one class period. Often the examples she did in class were so different from the homework problems that they didn't really help. If you ask her a question, she will do her best to answer it, but she doesn't generally ask for questions so you have to be really forceful about asking. Her office hours were at 7 pm which was really inconvenient for most people, and there were always a lot of people there, so someitmes it was much too difficult to get individual attention. However, if you do make an effort to go to office hours every week and get to know her, she can be very helpful. But it shouldn't require that much extra effort to get a teacher to help you. The exams were always much more difficult than any of us expected them to be, or than she led us to believe they would be. The course description says that this class is meant for people who have never taken Calc before, but if that's your situtaion, I would steer clear of this class. Even if you have taken Calc before, prepare to teach yourself whatever you don't already know or to hire a tutor, because those are the only ways to do really well in this class.\nWorkload:\nHomework every week worth 20% of the grade, but graded really harshly by TAs. No webwork. Two midterms worth 20% each and a comprehensive final work 40%. The work was managable, but count on spending a good bit of time in the math help room if you want to  consistantly do well on the homework. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 08, 2005",
            "review_content": "\nIf you had Calc BC in high school, you have nothing to worry about.  Professor Sesum is nice, but soft-spoken and she writes lightly, so sit in the front if you can.  She has a slight accent, but her English is excellent and completely understandable.  She's also very approachable and willing to help and re-explain stuff on the boards.  In addition, she does a review session in class before every midterm and final, so you get a sense of what she'll ask on the exams.  \nWorkload:\nWeekly problem sets (fair, but harshly graded by the TA), 2 easy midterms if you've done all the homework and some practice problems, and 1 final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 07, 2005",
            "review_content": "\nNatasa Sesum is really a sweet lady and I'd recommend her as a multivariable calc teacher to anyone! This course is really straightforward and predictable, just like a calculus course should be. She covers the multivariable stuff comprehensively, but I suspect that's because she speaks without pausing and writes faster than anyone I have ever seen! Unless you can understand new concepts on-the-spot, you should probably skim over relevant sections before class. Prof Sesum has an accent and can be a bit soft-spoken, but once you get used to it, it's no big deal. A bit about the Psets: if you do them, and if you make an effort to understand the ones that you couldn't solve (ie: by going to office hours), you'll do well on the exams. Also, make sure you write down equations & show your work on the tests!!!!! Prof Sesum is an exceedingly fair grader, so if you add or integrate something wrong, she'll still give you most of the points, provided you ask nicely and aren't an indignant jerk about it.\nWorkload:\nNot bad ... Weekly P-sets (~7-13 probs, 10pts each)... Psets and 2 midterms worth 20%, 20%, and 20%... a final worth 40%\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 19, 2005",
            "review_content": "\nThis class was amazing and everything that I expected. Not only did Natasa clearly explain concepts that were foreign to us, she presented challenging psets and exam problems. It is true, she expects you to know your calculus I material and if you do the homework earlier in the week, lectures become more understandable. Overall, Natasa is a very nice lady and does a great job in presenting the material. The only bad part about her teaching is that she writes SO FAST. I remember the first day, I couldn't believe how much material we covered in one lecture. If you copy everything she writes, its a good 6-7 pages of notes per lecture. Study your ass off for the exams though, they are tough. but they should be... it is calc 3, its not supposed to be THAT easy. Also, I am in college, not engineering, so I am going to say that college students can do as well as engineering students in this class if they enjoy math/put a lot of effort.\nWorkload:\nPsets every week, there are always one or two questions in the psets which are impossible, two midterms, final. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 18, 2005",
            "review_content": "\nGreat prof., she speaks quietly, but if you sit close enough that shouldn't be a problem. She explains things very systematically: she'll write out all of the steps and if she skips some and you don't understand she will go back and elaborate, and, like the other reviewer said, she doesn't waste your time with useless proofs. I had to take this class as a prereq for an econ course and I really hate math, but I found it quite painless \nWorkload:\nweekly hw assignments, not too hard, like the other reviewer said, they take about an hour or 2, and they are graded rather harshly by a TA but this doesn't have anything to do with Natasa. 2 midterms - second one was a little harder than the first, but both are straightforward, and if you do the work and pay attention in class you should do fine, and a final (40% of your grade)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 13, 2005",
            "review_content": "\nNatasas is a very nice woman. But if you are going to take her Cal III class, you must have taught yourself the material before taking this class, because she expects you to know it.\nI am an Applied math student, and I really like her class. However like the other person said, it is true that the engineering and applied math students do really do well in this class because they already (emphasize on ALREADY) know a lot about and love Calculus. \nIf you are trying to learn from her, then you are in the wrong class, because you wont. you will only end up getting a C or a D. In fact, when you look at the exam results on her website, you will notice some people getting Fs.\nTake this class at YOUR OWN RISK!!\nWorkload:\nproblems sets every week (about 10 questions) two midterms and a comprehensive final. GOOD LUCK!!\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 13, 2005",
            "review_content": "\nNatasas is a very nice woman. But if you are going to take her Cal III class, you must have taught yourself the material before taking this class, because she expects you to know it.\nI am an Applied math student, and I really like her class. However like the other person said, it is true that the engineering and applied math students do really do well in this class because they already (emphasize on ALREADY) know a lot about and love Calculus. \nIf you are trying to learn from her, then you are in the wrong class, because you wont. you will only end up getting a C or a D. In fact, when you look at the exam results on her website, you will notice some people getting Fs.\nTake this class at YOUR OWN RISK!!\nWorkload:\nproblems sets every week (about 10 questions) two midterms and a comprehensive final. GOOD LUCK!!\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 11, 2005",
            "review_content": "\nIf you are an engineering student, then this class is a breeze. If not, you are not going to do well in this class. The other day, a frustrated (non-engineering) student made the following comment: \"If only it was possible for the professor to split the class into two sections. One for the engineering students and the other for non engineering\".\nShe expects you to understand what she's going to teach before you come to class. Her exams require physics, analytic and conceptual answers. Some of the questions will leave NASA mathematicians scratching their heads. Even some of the TAs at the Barnard Help room were at a loss as to some of the PSet questions.\nIt is a good thing that she will curve the class, if not...\nWorkload:\nweekly Psets, two exams and one final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "October 29, 2005",
            "review_content": "\nI took calc AB in high school so i wasn't expecting for the class to be too challenging. and it really isn't. natasa's a nice woman, a bit robotic-sounding and she has a bit of an accent but it's definitely easy to understand her. she talks very quietly though so it's important to get a seat at the front. \nshe goes over everything very quickly, b/c i think she knows that most of the people in class have already taken calculus. from start to finish, the class is nonstop notes, which kind of sucks. everyday i have at least 3 sheets of looseleaf used up. she does problems differently than how some people learned in highschool and writes in mathematical notations, but it's easy to pic up. And at least she doesn't load us down with proof after proof like some other teacher's do.\nshe's actually a very nice woman, she'll say hi to you when you see her outside of class (that is, if you go). some people think missing her class isn't really a big deal, lots of people leave after handing in the homework, but a lot of the questions she gives on midterms come straight from the notes. if you're going to miss, just make sure you get the notes from someone else because in her class, it's important to take good notes and to review them. i have no problems with the class or the teacher at all. she made calculus painless. and what's best? NO PROBLEM SETS\nshe has a website: http://www.math.columbia.edu/~natasas/calculusI.html\nWorkload:\nhw: 20%. (we get one homework a week, usually only a dozen questions, it only takes an hour, if that, to do them. you can get up to ten points per problem. she doesn't understand the whole \"problem sets\" thing so she doesn't assign them which is a huge plus. her TA with the RED PEN is nothing short of BRUTAL with grading of the homework. everyone in the class hates that one.) midterm 1: 20% (it wasn't bad at all, 5 multi-part questions w/partial credit. most people got A's or b's and her curve is EXTREMELY generous). midterm 2: 20% (haven't taken this yet, but it's next week) final 40%. \nher tests have no huge surprises. it's a straightforward class. do your homework and go to class and you'll do fine\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "October 29, 2005",
            "review_content": "\nI took calc AB in high school so i wasn't expecting for the class to be too challenging. and it really isn't. natasa's a nice woman, a bit robotic-sounding and she has a bit of an accent but it's definitely easy to understand her. she talks very quietly though so it's important to get a seat at the front. \nshe goes over everything very quickly, b/c i think she knows that most of the people in class have already taken calculus. from start to finish, the class is nonstop notes, which kind of sucks. everyday i have at least 3 sheets of looseleaf used up. she does problems differently than how some people learned in highschool and writes in mathematical notations, but it's easy to pic up. And at least she doesn't load us down with proof after proof like some other teacher's do.\nshe's actually a very nice woman, she'll say hi to you when you see her outside of class (that is, if you go). some people think missing her class isn't really a big deal, lots of people leave after handing in the homework, but a lot of the questions she gives on midterms come straight from the notes. if you're going to miss, just make sure you get the notes from someone else because in her class, it's important to take good notes and to review them. i have no problems with the class or the teacher at all. she made calculus painless. and what's best? NO PROBLEM SETS\nshe has a website: http://www.math.columbia.edu/~natasas/calculusI.html\nWorkload:\nhw: 20%. (we get one homework a week, usually only a dozen questions, it only takes an hour, if that, to do them. you can get up to ten points per problem. she doesn't understand the whole \"problem sets\" thing so she doesn't assign them which is a huge plus. her TA with the RED PEN is nothing short of BRUTAL with grading of the homework. everyone in the class hates that one.) midterm 1: 20% (it wasn't bad at all, 5 multi-part questions w/partial credit. most people got A's or b's and her curve is EXTREMELY generous). midterm 2: 20% (haven't taken this yet, but it's next week) final 40%. \nher tests have no huge surprises. it's a straightforward class. do your homework and go to class and you'll do fine\n"
        }
    ]
}