{
    "prof_info": [
        {
            "prof_name": "Dusa McDuff",
            "prof_id": 3483,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "December 21, 2013",
            "review_content": "\nIf you need to take Calc, take it with McDuff. I honestly never went to lecture, but she's really great in office hours and is very good at explaining things. I'm sure lectures would have been great if I had been awake for them. : ) I instead used Khan Academy to learn the material, supplementing Khan Academy with office hours. It worked out really well for me and I did well in the class.\nI have to agree with the previous reviewer that her WebAssign usage is heavy, though. WebAssign is frustrating. On the bright side, McDuff is extremely understanding with extensions, so as long as you don't overdo, you can usually get a 24 hour extension on WebAssign.\nWorkload:\nheavy webassign (15-20 problems)\nlight written homework (5 problems, usually)\nfair exams\n"
        },
        {
            "course_name": "Calc I &II;",
            "review_date": "November 21, 2013",
            "review_content": "\nThe Good:\nShe follows syllabus and textbooks to the T. She allows for any questions at the start of every class, so if you started your hw early and need some help with a certain question, she does it on the board. She goes over any part of her work on the board that isn't clear (even if she can be a little condescending in her response). Office Hours can get a little packed but she works with you until you get through whatever is confusing you. You can even stop by Friday morning before the homework is due to ask questions about the assignment. She tells you when she's going to do a proof, so you know when to zone out and zone back into class. If the TAs graded your homework wrong, she'll fix it. She answers emails within 1-2 days. Webassign has \"watch me\" videos that basically give you the answer. She is witty and makes a few good jokes during the semester\nFun Fact: For the first few classes she wore the exact same outfit everyday. If you google her, she can be found in the same outfit.\nThe Bad: Webassign Webassign Webassign. She knows it's annoying but still uses it. Sometimes it does't accept the answers that are right and because of technicalties and problems with Webassign itself, you'll get the answer wrong. In that case though, you can email her and she'll unlock the question so you can try to answer it again. The other that, if you're not a math person, the class is boring. \nWorkload:\n-Weekly written homework of five questions, that will take about 45 minutes to an hour to complete. If you ever really get stuck, just google the question. Answers will come up. Also, if you buy the textbook online, there may be video tutorial next to the question that gives you the answer.\n-Webassign homework of 15 questions that take about 1 hour to complete. \n-three tests (2 midterms, 1 final) -- Midterm practice tests are provided on Courseworks and WebAssign, there is a class session right before the test for just questions. I didn't find the tests to be too hard, but others have.\n\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 06, 2013",
            "review_content": "\nI was not looking forward to taking calculus (it was a requirement for my degree) so you can imagine my surprise when I ended up really loving the class. And I know that my fondness for the subject matter is due in large part to Prof. McDuff's class. She is a clear, concise lecturer (it was a big class but it felt more like a \"classroom\" than a \"lecture hall\") who comes to class with prepared lesson plans that move at a manageable pace. I went to her office hours regularly and found her to be very helpful (I would ask about a particular problem, and then she would take the time not only to help me answer the specific question at hand, but to make sure I understood the reasoning behind it). You can tell she really cares about her students and wants everyone to do well.\nYou *are* expected to come into the class with some basic precalc and trig knowledge - it had been a while since my last math class, so I did have to do some prep work on my own time to make sure I was up to speed. But in general, the workload was manageable, and the test questions (two midterms and one final) came pretty much directly from the HW problems (on Webassign, which gives you a few tries to get the right answer) and from examples presented in class. Prof. McDuff also posted practice midterms and finals on Courseworks prior to the midterms for additional practice.\nIf you have to take calculus (like me) --- take it with McDuff. You will be pleasantly surprised!\nWorkload:\nGrading: 20%  homework (Weekly HW Sets on WebAssign + a few written problems), 20%  midterm I, 20% midterm 2, 40% final exam.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "September 25, 2012",
            "review_content": "\nIf you take calc I for prerequisite and you're not a math genius, McDuff is the professor to take. Don't settle for anything else!!\nI went to two other sessions and could not figure out what the hell the professors were talking about. The combination of their horrible accent, unbelievably fast pace and horrible examples made my head spin and my soul to die inside.\nUntil I got into McDuff's class.\nProf. McDuff is one of those rare professors at Columbia who cares about teaching students, she actually enjoys teaching and don't see students as a pain the ass on the way to do some research. \nif you don't understand something, you can always come to her office hours and she is incredibly nice and actually encourages you come and ask more. \"it's great that you want to know and ask questions\" is one of the thing she said to me. She's so nice!\nAs weird is it might sound, I actually enjoy Calc with her. I know, it's crazy.\n\nWorkload:\nReally manageable. \nTwo midterms and a final.\nWeekly homework, about 15 questions on webassign and a small written part. All can be done in about two and a half hours.\nYou are encouraged to read the text book before class. The problem is that the damm book is not written for people and tend to make simple things difficult. I realized that she explains it so much better so I just skim the book before class.\nShe started using WebAssign this semester which I absolutely hate. The positive side of this though is that you do get 5 chances to get the right answer, which makes it really easy to get 100%. And since H.W is quite a bit of your grade, it's worth it.\n"
        },
        {
            "course_name": "Introduction to Higher Mathematics",
            "review_date": "April 11, 2009",
            "review_content": "\nProfessor McDuff is one of those rare professors who means it when she says she cares more if you learn something. Her grading system was done in a way so that everyone who tried could do well. If you did poorly on the first midterm, she said she would look for improvement in the second midterm and final in order to discredit that poor grade. Homework counts for 40% and you are allowed to submit redos! There is an oral presentation (to be presented only to her) which counts for 10%. If you prepare for it, you'll be fine. All that said, this course is not easy, especially if this is your first time encountering these mathematical topics. The course requires a lot of devotion. You will learn an incredible amount if you put in the effort, and it is certainly worth it if you are looking to be a math major. \nWorkload:\n2 midterms (15% each)\n1 final (20%)\nhw (weekly, about 5-8 problems, plus an optional extra credit- about 11 hws altogether) (40%)\noral presentation (10%)\n"
        },
        {
            "course_name": "Introduction to Higher Mathematics",
            "review_date": "February 06, 2009",
            "review_content": "\nAll Math majors and Computer Science majors should take this class as soon as possible. It allows you to focus on proof techniques that will give you an edge in courses you take later such as Modern Algebra, Computer Science Discrete Mathematics and Modern Analysis. In 2008 Professor McDuff ran the course with generous office hours and the opportunity to submit redone homework and exams. Both the Professor and her T.A. Yael were extremely helpful on a one on one basis. Even average students have a solid shot at an A. Workload is reasonable. Two thumbs up, a must take course.\n\nWorkload:\nModerate, with the opportunity to resubmit homework and exams for a higher grade.\n"
        },
        {
            "course_name": "Introduction to Higher Mathematics",
            "review_date": "August 16, 2008",
            "review_content": "\nDusa makes this class challenging but entirely reasonable. She hits that perfect balance of homework that makes you think, but doesn't make you want to tear your hair out. She's a very clear, straightforward lecturer, and is likewise very straightforward about homework and exams. \nDusa's in-class examples are generally much better than the examples in the text book. She goes a bit quickly in lecture at times, but it's worth writing down her examples, especially the diagrams, because they help with the homework quite a bit. \nShe's unfailingly generous with her time. It's absolutely worth it to go to her office hours. She's very good at explaining things in different ways if you don't understand something the first time. She can seem abrupt and intimidating at times, but she genuinely cares about her students. She was very aware that hers was not the only class we were in and tried to schedule her exams at good times for us when she could. Dusa is both fair and generally quite understanding. \nAbout Intro to Higher Maths: This class is not easy. Don't take it if you don't like maths or if you hate proofs. Like most classes, if you're not willing to do the work, this class will be a complete waste of your time. But if you're willing to go in with an open mind about proofs and about the way think about maths, you may be surprised by the end of the semester at how much you've learnt. There isn't an unreasonable amount of work, and it's absolutely worth taking the class if you think you might be interested. Go to office hours.  \nWorkload:\nWeekly set of 6-8 proofs, one oral presentation, two midterms, one final. The exams are just like the homework -- there's one or two easier questions and then 3-5 more challenging (but not impossible) questions. If you do all the homework, including the challenge questions, the exams shouldn't be unreasonably difficult. \n"
        }
    ]
}