{
    "prof_info": [
        {
            "prof_name": "Johnathan Lee",
            "prof_id": 436,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Rock",
            "review_date": "February 18, 2005",
            "review_content": "\nWhat other course can you walk in and have a song from Guns and Roses or Jimi Hendrix already playing. Surprisingly, Johnathan does an amazing job covering a wide variety of genres in only a one semester course. I am not sure what the other reviewer was talking about, but it was refreshing to see it was NOT a rehash of a bad VH1 show. Rather, this is probably the only Columbia course I have seen in four years where students were eager to attend. I think there was a misconception in the beginning that is was an easy A and some didn't attend at all, and of course were left behind because he mainly tests from lecture notes. If you get a chance to take this course under Johnathan, I would suggest you register early, since it is a popular course that most people probably wouldn't drop.\nWorkload:\nStandard.. midterm/final (lecture-based), 10 page paper. \n"
        },
        {
            "course_name": "Rock",
            "review_date": "January 02, 2005",
            "review_content": "\nJohnathan is big on having people attend this class, even though it's a popular lecture, and he's right. He discusses a more analytical and stylistic side to the music in class while the book focuses more on just sociological aspects of the music. Having said that, he's a really fun teacher, and you can tell he's excited about teaching this course. Even though it's a big lecture, he really likes getting to know his students, so definitely go to office hours if you can, especially to discuss your paper. There's only one, so go to him with an idea in mind so that he can help you structure it in the way he wants. As fun as the class material is, he still demands academic content from everyone. Go to class, especially since it's fun (I only remember one class being boring--the one on heavy metal, ironically), and it will help you a lot on the midterm and final. He doesn't want you to memorize each group and each song; he only wants you to be able to recognize a musical style and be able to back that up with specific elements of the music (i.e. blues has a 12-bar pattern, the vocals and guitar have a call-and-\nresponse aspect, very minimalist instrumentation, etc). Going to class will solidify that into your head, and give you the easy A that this class is. \nJohnathan's a great guy, with a good sense of humor, and really wants his students to have fun and be as excited about his material as he is. \nWorkload:\nmidterm, research paper (8-10 pages), final\n"
        },
        {
            "course_name": "Rock",
            "review_date": "January 02, 2005",
            "review_content": "\nI was fairly dissapointed with this class.  One would think that with a whole semester, you would learn more than you would from watching a few hours of VH1.  If you've led a sheltered life and weren't allowed to listen to rock music as a kid, then I guess this stuff will all be news to you.  Otherwise, you'll probably be pretty bored.  Lee, although a friendly and likeable guy, takes forever to make simple points and consequently gets remarkably little accomplished in the 1:15 class time.  I think it might be that he's uncomfortable with such a large audience (over 100 people) because when approached after class, he is much more coherent and seems to know a hell of a lot more.  If you're looking for an easy, stress free class, this is perfect.  However, it will leave true music fans thirsty for more.  \nWorkload:\nOne paper due at the end of the semester.  It can be easy or hard, depending on what subject you want to do.  8-10 pages.\n"
        },
        {
            "course_name": "Rock",
            "review_date": "January 02, 2005",
            "review_content": "\nI was fairly dissapointed with this class.  One would think that with a whole semester, you would learn more than you would from watching a few hours of VH1.  If you've led a sheltered life and weren't allowed to listen to rock music as a kid, then I guess this stuff will all be news to you.  Otherwise, you'll probably be pretty bored.  Lee, although a friendly and likeable guy, takes forever to make simple points and consequently gets remarkably little accomplished in the 1:15 class time.  I think it might be that he's uncomfortable with such a large audience (over 100 people) because when approached after class, he is much more coherent and seems to know a hell of a lot more.  If you're looking for an easy, stress free class, this is perfect.  However, it will leave true music fans thirsty for more.  \nWorkload:\nOne paper due at the end of the semester.  It can be easy or hard, depending on what subject you want to do.  8-10 pages.\n"
        }
    ]
}