{
    "prof_info": [
        {
            "prof_name": "Allison Foley-Graham",
            "prof_id": 2507,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Alexander Technique",
            "review_date": "August 02, 2011",
            "review_content": "\nI was looking to fulfill my PE requirement with a class that doesn't require much physical activity but one that is relaxing and new.  Boy, I was really right when I chose this class.  As the reviewers before me have said, you literally DO NOTHING.  It was \"relaxing\" because I had the chance to doze off during our \"none-doing\" activities.  It was \"new\" because I never expected physical education to be that non-physical.  Prof. Foley is a nice woman, but she believes in the magical value of Alexander Technique way too much.  In order for the technique to be truly valuable, one has to devote a tremendous amount of time to stop and think about one's actions.  This is definitely not practical for college students who are always on the run but definitely more useful to retired folks who actually do have the time.  I am not sure why the PE department even offers this course.  Please don't waste your time!\nWorkload:\nDon't miss class more than 4 times. \n"
        },
        {
            "course_name": "Alexander Technique",
            "review_date": "June 19, 2005",
            "review_content": "\nI couldn't agree more with the reviewer before me. However, I did enjoy catching up on sleep in this class. Just tell her that you find the laying-down exercises \"really helpful\" and you can sleep up to 20 minutes. Have someone wake you up when its over, otherwise it can get somewhat embarrassing.\n"
        },
        {
            "course_name": "Alexander Technique",
            "review_date": "April 30, 2005",
            "review_content": "\nUgh.  This class was so beyond horrible I can't even describe it.  I lost all faith in the Alexander technique as it just wore on.  A typical day in this class included sitting, staring at the clock, and hoping that I would just keel over.   This may sound like an easy way to fulfill your PE req, but I'm an extremely lazy person and after one or two sessions I just craved some sort of ACTIVITY.  You literally do nothing... if you get up out of your chair and then sit back down more than once a class it's rigorous.  Allison is a very nice woman, but she takes the class WAY to seriously.  By the end, all of us had realized what a crock it was and it was so ridiculous to hear these lectures about how to implement the Alexander technique etc. when we were just dying to get out.  She treats class like it is this immaculate experience when really it was 20 excruciatingly wasted hours of my life.  Honestly, if there was only one piece of advice I could give, it would be to NOT take this class.\nWorkload:\nAllowed 4 misses, 2 tardies equals a miss.  She's extremely strict on this: one girl needed to leave 5 minutes early for an interview and she wouldn't let her.  She also makes you do a short journal, which is totally pointless and everyone did the whole thing the day it was due.\n"
        }
    ]
}