{
    "prof_info": [
        {
            "prof_name": "Zoe Strother",
            "prof_id": 3956,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Arts of Africa",
            "review_date": "December 21, 2016",
            "review_content": "\nThis was by far the worst class I have ever taken at Columbia. Strother does not know how to lecture, she rambles and her speaking style is incoherent and she makes references to things that the class has no idea what she is talking about. I can say with 100% doubt that I learned absolutely NOTHING in this class. She has no business teaching and I don't get why columbia continues to have her teach a really important art history class. \nThe TA was also extremely unhelpful. Did not even learn her name. \nDO. NOT. TAKE. THIS. CLASS. It will be the worst and most boring decision you could make in your columbia career. \nWorkload:\nNot much for 3 short essays, midterm and final\n"
        },
        {
            "course_name": "Arts of Africa",
            "review_date": "May 05, 2015",
            "review_content": "\nHorrible, horrible class. As an African I was incredibly ecstatic to see an Art history course focused on African art on the course directory, but little did I know I had signed up for an awful, boring, at times offensive anthropology class, with a Professor that is not at all hands on with students, doesn't communicate, doesn't seem to give a damn about her students at all. I didn't ever want to show up to class after the first 2 and when I did just rolled my eyes at the ridiculousness of some of the cultural \"facts\" that were supposed to have somehow informed West African art (coming from a West African). The grading is hard and expects you to know minuscule details about every artwork (which is probably normal for any art history class) but is pretty ridiculous considering you are learning mostly about outdated cultural beliefs, not the works themselves 75% of the semester. If you are not required to, do not take this class. And if you already have, please do not let it shape your perceptions of Africa. \nWorkload:\n1 map of africa quiz 2 papers 2 exams tons of reading \n"
        },
        {
            "course_name": "Arts of Africa",
            "review_date": "April 02, 2012",
            "review_content": "\nI really wanted to like this class. But no--I suppose anything that double counts for the core and my visual arts major is going to require a lot of pain in return.\nStrother obviously knows her stuff; you can tell that just by googling her. She loves this stuff, too. Unfortunately, her lectures are often snooze-inducing, and there is little to no actual visual analysis... if you want an anthropology class, this might be a good one for you to take, but personally I was expecting an art history class (I don't know why... maybe because the course is in the ART HISTORY department??) and was sorely disappointed to find that actual art was not the focus. The hundreds of works you have to memorize for the exams (that's right. Hundreds. Literally.) don't help, and the little writing assignments are incredibly irritating an difficult to get good grades on because you never know what's expected from you. Her TAs, at least when I took the class, were complete a**holes. \nStrother is a very nice person, and if you are VERY interested in learning about random bits of African culture (that's CULTURE, not art-- take note) then you might love this class. I just wanted to warn those who are about to walk into hell because they like art, like I did.\nWorkload:\nA bunch of small papers, one big paper, midterm, final, lots of readings that are mostly unnecessary\n"
        },
        {
            "course_name": "Arts of Africa",
            "review_date": "May 15, 2011",
            "review_content": "\nI am shocked to see all of these poor reviews for African Art.  This is one of my favorite art history classes ever, I found the material engaging, beautiful, and it really helped me to sharpen my mental map of Africa, because sadly, before this class, my knowledge was not extensive.\nI'd recommend this class to art history majors and africana studies first since their previous studies could enhance this class when put in context with others, but really, anyone could get something out of it. no, you will not get an easy a without putting a lot of work into this class, but grades are irrelevant compared to all of the new and exciting stuff you'll learn here. \ntake it. strother knows her shit!\nand while you're at it, take her husband Jonathan Reynolds' art history courses, too, like japanese architecture. they both kick major ass and are some of my favorite professors here.\nWorkload:\nlong weekly readings, i think i did a total of 5, 2 papers, midterm, final. pretty typical of an art history course.\n"
        },
        {
            "course_name": "Arts of Africa",
            "review_date": "November 11, 2010",
            "review_content": "\nI am African and there are very few classes about the continent so I was happy to see this offered. I loved it. She is SO knowledgeable about her field. like its somewhat overwhelming. I dont think the previous reviewers were African or had a background in African studies/history etc so they couldnt truly appreciate how amazingly brilliant and unpatronizing she is. Most of the other africans in the class were similarily in awe of her and the breadth of her knowledge. but then she actually didnt grade the papers so what people say about her grading harshly isnt really fair because she didnt grade it. its like 70 ppl in the class and papers are split between the two TAs. They are helpful if you show them your papers before you turn them in. A little extra effort goes a long way. She is truly a marvel. She does ramble a bit but i found it all very fascinating. \nWhen I go home I am able to comment on things people living on the continent don't realize about the history of art traditions across the continent. I think thats great useful knowlwedge. \nbut its NOT an easy A. you really have to work. I got an A- but i put in a lot of work. I just turned one important paper in late so that brought me down. \nI would highly recommend this class because you will learn a lot. But yes, take lots and lots of notes and write down the notes according to each slide as it becomes extremely confusing and time consuming to prepare the exam.  I took this class in spring 09.\n\nWorkload:\n2 papers, midterm, and final, africa map quiz.\nAlso beware, you have to learn a lot of complicated foreign names for the exams. You also have to know dates but as long as your response is 50 years plus or minus its ok. I struggled with that part. but if you dnt try and do it all at the last moment you should be fine. \n"
        },
        {
            "course_name": "Arts of Africa",
            "review_date": "February 22, 2010",
            "review_content": "\nWORST CLASS EVER.  \nStrother is probably knowledgeable on the subject, but that becomes very hard to discern once you attend her lecture.  She rambles and doesn't follow the clearest format.  She claims to put the slides up before lecture, but sometimes her PPT doesn't match the posted one, or she'll jump between slides (instead of going in order) so it becomes hard to keep up.  This is especially crucial, considering a large portion of the exams are slide identifications and short answer/essay questions about the slides.\nIn terms of exam review, the only thing she does is put up the PPTs from each region (Benin, Mali, etc)...there's usually no information that goes along with it, you basically have to look at your notes and try and match it up.  So take good notes!!\nThere are two papers, I think.  One required us to go to the Met and write about one of the artifacts.  It was...tedious work, I would say, but standard.  There are no discussions (which, honestly, was nice, considering a normal (1hr 15min) lecture literally seemed like 2 1/2 hrs....I'm NOT KIDDING.  This class was a drag.), so you don't really get to know the TAs well, but like all classes, you can meet with them during office hours if you feel the need.\nOverall, I'd say find another Global Core class...art history majors will probably have an easier time with this class because they might be used to the memorization-based nature of the class, but truthfully, the lectures are what discourages me from recommending this class.\nProfessor Strother might be a nice, quirky woman, but she really can be disorganized and un-engaging.\n(For the record, I believe I took this class Spring '09 -- not sure whether the format has changed since then.)\nWorkload:\nWeekly readings (which she sometimes brings up in class, and definitely expects you to reference in paper/exams); two papers (5-7 pages) - one of which includes trip to Met; midterm; final\n"
        },
        {
            "course_name": "Arts of Africa",
            "review_date": "September 08, 2009",
            "review_content": "\nI wouldn't recommend it...unless you have a knack for Art History and do not feel like doing any work for your Global Core requirement.\nArts of Africa sounds interesting, but I found it to be a total bore.\nOn the plus side, the essay questions for the midterm and final are handed out in advance. Don't waste your time on reading every assignment, just go to lectures. Only read assignments that are necessary for completing a paper or for constructing a good essay on the midterm or final. You don't even have to take that many notes, as Professor Strother, though very knowledgeable in her field, tends to ramble and share extra information that is not needed for the tests.\nWorkload:\nNot that bad. Cram for the exams and leave sufficient time for writing papers, but don't bother with the reading.\n"
        },
        {
            "course_name": "Arts of Africa",
            "review_date": "June 18, 2009",
            "review_content": "\nThis class is absolutely awful.\nIf you think this will be a fun and interesting way to complete part of the Global Core requirement, think again!\nWhile the workload is not terribly heavy, the readings for each class are pointless and most are never even discussed.  No one in the class read them, so most of the time I felt that I was wasting my time.  The essays are graded mercilessly and the midterm and final are ridiculous. \nThink twice before you take this class!  It was somewhat interesting, but I don't think I took anything out of the class after studying like crazy the entire semester.\n\nWorkload:\nReadings for each class, map quiz- memorize all of the countries in Africa and where they are, two essays, midterm and final.\n"
        },
        {
            "course_name": "Arts of Africa",
            "review_date": "May 11, 2009",
            "review_content": "\nNever. Take. A. Class. With. This. Woman. \nZoe will ruin your GPA and your life. The material is interesting, but makes class unbearable. \nWorkload:\nnegligible, but whatever you do she grades unreasonably harshly with completely incomprehensible standards\n"
        }
    ]
}