{
    "prof_info": [
        {
            "prof_name": "Upmanu Lall",
            "prof_id": 1090,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Data Analysis",
            "review_date": "August 29, 2013",
            "review_content": "\nAfter hearing so many positive opinions about Pr. Lall (even in the EAEE department), I decided to take his class on environmental data analysis.\nIn short: unbelievably disappointing. But this deserves a longer explanation. In all honestly I actually think this Professor is pleasant to talk to. He is also friendly and seems genuinely concerned about the students. But this is not about friendliness, it's about a class that you payed a likely hefty price for, and about you knowing what you're getting into beforehand. Classes at Columbia should NOT be justified exclusively by the alleged \"friendliness\" of the professor.\nAfter spending one semester following his class, it struck me: Pr. Lall is plainly dreadful at teaching. I am not talking about his research which is well developped and at the edge, from what I heard in the department. But a class is all about teaching and making sure that one's explanations are as clear as possible... Right? Well Pr. Lall just falls incredibly short in this area. He keeps teaching as if he was talking to his seasoned colleagues and seems completely unaware of \"difficult\" points in the concepts he approaches. This cannot be emphasized enough. What appears as a given in teaching (again: explaining difficult points) is here completely absent. I have never seen this in a class in my entire time in college. Pr. Lall goes through his class in a very strange way, spending virtually no time on points that deserve a long and careful explanation, he just breezes through his slides. This is unbelievably frustrating. And when you ask him a specific question he almost exclusively confusing in his answer, using other concepts that were not seen in class. The hands-on demonstration with R is basically the following: quickly going through the paragraphs of code that he wrote beforehand at a harrowing speed and with very little explanation.\nMaybe you can go and ask him questions after class for him to actually explain this time? Good luck finding free time in Pr. Lall's overloaded agenda. With his research, his classes and his phd students, he is virtually not approachable. I am not questioning his will at work, he has very long hours and a lot of projects on his hands. I am just making a practical observation: it is nigh impossible to sit down and discuss with him more than twice a semester.\nLet's talk direct consequences of these facts. First you will have to teach yourself almost everything: either before the class in an attempt to follow his floundering reasoning, or after the class to try to make sense of the scribbles you were trying to write in panic. That's how I actually learned all the knowledge I got from this class, which is not what I would expect from a graduate-level class at Columbia University.\nSo what can you do? The only case where you could take this class is if you already know all the concepts of data analysis and you're looking with an \"expert to expert\" sort of class. Or if you know that you have the time and energy to learn everything by yourself. But... why would you take the class if the professor is useless? Exactly. Spare yourself the ordeal and take another class with an actual teacher. And if you want to learn data analysis, buy a good book.\n\nWorkload:\n1 homework every 2 weeks, with the TA being as lost as the students when it come to the correction. 1 midterm and 1 final project corrected by Pr. Lall himself.\n"
        },
        {
            "course_name": "A Better Planet By Design",
            "review_date": "June 09, 2010",
            "review_content": "\nBrah, shit sucks.\nLall tried to teach, but the class was a piece of crap. Sometimes it went in \"too deep,\" this class is supposed to be more \"big picture,\" but seriously sometimes they went in too deep into really boring topics that im pretty sure around 80 percent of the people didn't understand. mid term and final were stupid, they pretty much were like the hw problems but with a thing in each problem that made everyone very confused. This class was really sad, you get something out of a few lectures, but many people were absent and a lot fell asleep, especially during Park's presentations, which were very dry. Many of Lall's were dry too. The TAs are useless, VERY BADLY DESIGNED HW sets, which they don't even know how to solve, it was ridiculous... you'd think they'd care a bit more, but literally it was saddening for me to see how much they didn't care. In the end, the projects you get lucky r you don't. There were some people who did really astounding projects but that really didn't even have anything to do with the class, like some guy whodid some economic analysis... and then reaised the standard. I was sure I'd get an A in this class, I did way above the mean on the mid term which would then be replaced for the final... ended up getting a B, it makes no sense... We worked very hard on our final project... It just shows you some shits are just very mean shits... I really hope i end up taking a EEE class i like, because seriously, this class was ridiculous. \nWorkload:\n4 or 5 hws that are super retarded... TA's don't know shit about them, sometimes they just don't make sense, and sometimes they are retardedly difficult. Everyone in the class worked together.\n1  mid term and 1 final, supposedly they drop the lowest on, but i think that was bullshit\n"
        },
        {
            "course_name": "A Better Planet By Design",
            "review_date": "May 09, 2010",
            "review_content": "\nThe saddest thing about this class for me was that it was clear that Prof. Lall actually cared about it and wanted us to learn about the topics presented. This is because he utterly failed in this regard. The lectures were dry, vague, convoluted, contradictory, and utterly useless if you wanted to download them from courseworks and study them. The latter characteristic has no real significance, however, as none of the homeworks or exams have any connection to the lectures. The graded assignments are all math and equation based, and if you can plug in numbers, you can get an A. The term project consists of a lot of research, a presentation, and a paper as a group of 3-6 and is not really that big of a deal; it is very open-ended and can be as everyday or as outrageous as you want.\nWorkload:\nHomeworks (6) = 30%. Term Project = 30%. Exam I = 20%. Exam II = 20%.\n"
        },
        {
            "course_name": "A Better Planet By Design",
            "review_date": "May 21, 2009",
            "review_content": "\nI would have really liked to write a good review for this class as I have taken away much from the lectures -- which were delivered with passion, enthusiasm, conviction, and scholarly knowledge. \nUnfortunately, however, the class ended up being a disaster -- in any other way imaginable. First and foremost, we were not tested on anything even remotely related to the lectures. The discrepancy was so absurd, that I thought of the two -- assignments and lectures -- as two different classes. \nThe problem sets and the midterm were absurd not only in that they were overly and unnecessarily complicated, time-consuming yet without any educational value, and designed for various and different engineering classes, but also because they represented, basically, everything that you needed to know for a grade in this class. On one problem set, for example, I spent 5 hours trying to figure out how to use excel to crunch numbers. I got 5/10 on that particular problem because I did not get the exact numerical answer they had. \nImagine a 7-page (no kidding!) prompt trying to convey to you without ever stating it that you need to add 2 plus 2. On one hand, if it is an \"engineering class,\" why go around in circles? State the problem concisely, and students will do the number crunching. On the other hand, if the idea is to make students think and learn how to approach a problem, why is the grade based on the numerical answers, not on the procedure followed? \"Engineering\" in this class meant just figuring out what they wanted of you (not how you should solve it; that was the easy part) -- and it took a whole semester of hard work to even marginally comprehend that. \nTeaching materials were also disastrous. Instead of having a textbook, we had poor pdf scans of chapters, without a particular logic in sequencing, without suggestive titles, and mixed together with tons of other useless material on courseworks. It took me two hours, when studying for the final, just to find and pull all the files I *might* need from courseworks. In the end, it turned out that we were being tested on using 4-6 formulas, which could have been taught in one single session, and which a good TA could have put together on 2-3 sheets of paper. That's all. However, there are more than 2000 pages of literature there, none of which has any educational value (i.e., tons of graphs, charts, useless trivia, random articles, other teachers' lecture notes on this and that subject, and so on).  \nOverall, the class had the unreal air of listening to a fascinating, coherent lecture by, say, Jeffrey Sachs on poverty or economic development, and then being graded on how well you can solve a seven-page rhymed riddle about penguins and laptops to which the answer is 1.63553. \nI really took away much from the lectures in this class -- so that makes me a better person I guess -- but the grading was based on some other discipline (mind reading?) I had not signed up for. And of course, as the previous reviewer noted, this was not the only problem with the class. A shame, because it could have been one of the most fascinating classes I ever took. \n\nWorkload:\nNot much, really: 4 problem sets, midterm (retake as many times as you want, but don't expect to do any better), 1 quiz, 1 group project. The only problem was figuring out what the questions were about in the first place -- all else was number crunching following formulas copied straight from book chapters. \n"
        },
        {
            "course_name": "A Better Planet By Design",
            "review_date": "May 11, 2009",
            "review_content": "\nAgree with the last reviewer, except that physics/chem/bio isn't actually necessary for the homework and exams.  What is necessary is a lot of quantitative experience up to and including calculus.  I survived the ambiguously worded (half because they were trying to get us to think critically about the problem, but ONLY half) homework only because I obtained regular help from a quantitatively inclined friend who was WAY more accessible than the professor or TAs.  I got a D on the midterm.  Well, actually I don't know that for sure because we were only told what letter grade our score was \"around.\"  \nThe General Studies website lists this class as suitable for non-science majors and says nothing about any prerequisites or required knowledge.  It was only on the first day of class that the requirements were made clear to us.  I sincerely hope that somebody gets smashed for that little oversight.  \nThe class was very poorly administered.  It was clear that there was very little communication between the TAs and professors, which sure sucks for a class of 100+ students which has the aforementioned complications. The professors would come in and not know when the homework was due even though we'd all received an email from the TAs a day or two prior.  Then they'd give us a different due date than the TAs had.  Assignments were frequently pushed back, which illustrated flexibility on their part, but I got the feeling that the rollbacks were because so many students were having problems with the conflicting feedback and poorly worded assignments.  Oh, and I do believe that every single assignment was followed by at least one email providing corrections to the original-wrong numbers, questions that didn't express what was being asked for, etc.\nSo in conclusion, the subject matter is great, the teachers were enthusiastic and they brought in a lot of guest lecturers, which was great.  I learned some cool stuff, most of which I couldn't replicate quantitatively on the hw/exams.  But if you had any trouble you were, well...in trouble.  \nWorkload:\nfour homework assignments, heavily quantitative.  One term project for which you will face little restrictions and equally little guidance.  One midterm which sucked balls.  One quiz.  No final.  \n"
        },
        {
            "course_name": "A Better Planet By Design",
            "review_date": "April 22, 2009",
            "review_content": "\nAs a humanities major, I came into this class reading the sterling reviews of Professor Lall and noting that the bulleting listed this as a science class for \"Nonscientists.\"  That is NOT true.  From the third class, I realized how much calculus, computer knowledge, and physics/chemistry/biology knowledge is involved.  Unless you are a premed concentrator, I do not see how a \"nonscientist\" could handle the class.  The majority of the class was in SEAS; I ended up dropping this class due to its difficulty and necessity of a strong science/math background, which I lacked.\n"
        },
        {
            "course_name": "A Better Planet By Design",
            "review_date": "July 16, 2007",
            "review_content": "\nUpmanu is awesome... he's one of the nicest people you will ever meet, and kinda funny too. The classes teaches you a lot about what's going on in the world and the need to do something about it. He makes environmental engineering really interesting; that says a lot as i'm going into finance. you dont need to attend the class, but its fun to. Some of the guest speakers are world renowned people. Take the class, you can do well in it with a little effort. \nWorkload:\nHW 33% if you find the solutions and tweak it your way, its easy. Midterm 33% that you can take again even though its open book. Final presentation if no problem. \n"
        },
        {
            "course_name": "A Better Planet By Design",
            "review_date": "April 24, 2006",
            "review_content": "\nProfessor Lall is quite possibly the nicest man on earth.  He is ALWAYS willing to help you, even though he is very busy and the chair of the Env Eng. Dept.  He genuinely cares about his students and actually takes an initiative to get to know everyone.  Professor Lall is truly a gem.  He even treats us to dinner at the end of the year during finals.\nThis class is a wonderful introduction to earth and environmental engineering.  You will definitely want to consider this major after taking this class.  All the subject matter is very interesting.  TAKE THIS CLASS!!!!!!!!!!!!! Even if you do not need for a requirement.\nWorkload:\n4-5 hw sets that you can do as a group.  Not a big deal.  Final project that you have a plenty of time to work on (can do in a group as well).  \n"
        },
        {
            "course_name": "A Better Planet By Design",
            "review_date": "January 21, 2006",
            "review_content": "\nProfessor Lall will make any student love environmental engineering.  He is enthusaistic, brilliant, and the nicest guy you'll meet.  Lall is very approachable and you can talk to him about anything at all.  I encourage anyone to take him whenever possible.  You will love his classes, and youll love him too!\nWorkload:\nVery reasaonable.  HW and midterm just like practice in book, final project is fun and you choose what to do.  Can re-do miderm if you dont do well.  No exam. \n"
        },
        {
            "course_name": "A Better Planet By Design",
            "review_date": "June 18, 2005",
            "review_content": "\nI expected this course to be a somewhat dry analysis of mountains of data, the sort of thing you envision EPA bureaucrats doing every day. Boy was I wrong. Professor Lall showed me that engineering is not just a set of techniques or principles - it's a mode of thought that really bends the mind. His teaching takes the form of a \"story\" of the ways in which people undertake to influence the environment, the assumptions underlying their actions, and how the environment actually ends up as a result. You need to know some hard science, but you really just need a good head on your shoulders to think through the narratives he presents. If you can keep up, you'll learn about a variety of environmental topics - fish in the Delaware River, air pollution in the South Bronx, flooding and arsenic in Bangladesh, and a whole lot more - but more importantly, you'll understand how to think through a problem and what the place of the engineer in the social and natural landscape can be. Lall is a master. He loves teaching this class and will go to extremes to help you out, whether you're looking for help with the homework or trying to find a summer internship. He's also a really friendly, genuine, approachable guy at the same time as he's a world-\nrenowned expert in the field of environmental engineering. I'll definitely be taking more classes with him and I'd urge you to do the same.\nWorkload:\n3-5 problem sets in the first half of the semester, midterm, final group project. He encourages group work so it's not that onerous. The term project was an especially good opportunity to take an environmental problem of interest to the group and try to grapple with it and come up with a solution. There will be crunch times in this class, but the total amount of work is pretty reasonable.\n"
        },
        {
            "course_name": "A Better Planet By Design",
            "review_date": "June 06, 2005",
            "review_content": "\nprofessor lall is amazing.  you cant help but want to hug him during class.  he is indian, but dont be fooled by his name...he speaks perfect english and is easy to understand.  i really learned a lot and loved his class.  \nWorkload:\nnot too bad.  a problem set every 2 weeks about...and a midterm you can redo, and term project as exam.\n"
        },
        {
            "course_name": "Earth Resources and Environmental Engineering",
            "review_date": "June 27, 2002",
            "review_content": "\nThis guy is great. I took the class because all the other professional level engineering courses just didn't look interesting. It was the best choice I've made so far. The classes are interesting, the material is not hard at all. Yes, you have to study for this class. Yes, it helps if you have a good base in calculus. But, still, even that is not required, since professor Lall does a good job of explaining everything very simply. What's best about him is that he is very friendly and very accessible. Also, he puts a lot of faith on first-year students. His big thing is getting you to work on problems that you never thought you could tackle, but sure enough, with some help, you're modeling a 2-level atmosphere by the end of the year, or working on a project on PCB's in the Hudson River, or working with the guy who programmed SimCity (true story) on solutions for polution in New York. Cool stuff. Much better, from what I hear, than Electrical Engineering or Designs of Buildings Bridges and Spacecraft. Take this course.\nWorkload:\nHomework twice a week. Not hard. Great text-book. (The problems look identical to the examples). 2 midterms in class. One final. One term project (pretty involved, but you get to work in groups, and you get to pick your topic) due on the day of the final. Very generous grader. One TA, in the office all the time, always available for help.\n"
        },
        {
            "course_name": "Earth Resources and Environmental Engineering",
            "review_date": "May 08, 2002",
            "review_content": "\nA first-year course basically designed to give freshmen a general sense of the field of environmental engineering. As such, it performs quite well. The textbook is excellent, the lectures are interesting and replete with real-world anecdotes, occasionally, there is some class discussion. I came out with a desire to pursue EEE as a major. The material is presented at a level appropriate to people with little background in science. Be on guard, however, as he occasionally likes to put differential equations on the board. Professor Lall also has the unique ability to get money out of thin air. This man got the department to purchase copies of SimCity 3000 for the students to use to model environmental processes. (The game was used once in a never-to-be-forgotten assignment which had the whole class up all night, and then never mentioned again). By the end of the semester, he had also conjured up enough money to pay for fellowships for students who wanted to go on into EEE. On the whole, prof. Lall is very accessible and friendly, and patient with students who don't understand concepts. He teaches with a passion for environmental engineering and honestly cares about his students. With the class in general and the final project especially (see below), what you get out of it is based mainly on what you put into it: this class can either be a mindless gut or a stimulating course that offers you plenty of freedom to explore the terrain. \nWorkload:\nSeveral problem sets, a midterm and a final. None of these are particularly difficult if you've studied and know how to deal with a few equations. Also, a term project on the topic of your choice, to be presented to the class and written up as a paper. Grading is generous. \n"
        }
    ]
}