{
    "prof_info": [
        {
            "prof_name": "Wei Min",
            "prof_id": 10711,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "May 09, 2016",
            "review_content": "\ni haaaaaaate him \nWorkload:\nnot bad but means u have to study a shitton\n"
        },
        {
            "course_name": "Physical Chemistry I",
            "review_date": "January 13, 2014",
            "review_content": "\nPChem was as expected a difficult course. The problem sets were difficult and time consuming (the 2nd one in particular !). Min is a pretty good professor and tries to make the class interactive- however he didn't seem to have a good feel on what was difficult vs easy for the students- the result was that some exam problems were virtually impossible ( he had to make one of the problems on the first midterm a bonus question). The practice exam he gave for the first exam was way easier than the actual first exam.\nThe material was interesting though and for most people it was required for their major. To succeed work in a group for the psets (they were worth 35% so do well in them) study like crazy for the exams and hope that you immediately \"see\" the solution for the exam problems....it's almost guaranteed for some you won't and you'll end up calculating randomly and hoping for partial credit though ( he gives good partial credit).\nIf you've taken differential equations and have a good calc background things will probably be a bit easier but you can get by if not just get the basic calc stuff down.\nJust ensure you do well on the psets they are worth a lot. The first midterm was harder than the second..,,the exam was probably in between in difficulty closer to the first.\nWorkload:\nPsets took an insane amount of time- prepare to dedicate the days preceding the due date to completing them (35%). Two midterms each worth (20%) ...final worth 25%. \n"
        }
    ]
}