{
    "prof_info": [
        {
            "prof_name": "Karen Green",
            "prof_id": 6086,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Comic Books and Graphic Novels as Literature",
            "review_date": "July 27, 2015",
            "review_content": "\n     The course materials were wonderful. I found the texts to be well curated, which didn't surprise me considering Karen Green is a librarian's librarian. \n     However, she was utterly pedantic and condescending and not very professorial. There are ways in which her candor might have been something great. Perhaps if she were more relaxed or approachable, but not she lacked the academic acumen needed to teach at this university. \n     She incessantly did that annoying thing where she would ask the class something like, \"...and you guys know who Seymour Hersh is right?\" she would look at us. We would look back at her like we were so over this stupid game. She would continue, \"So, nobody knows who Seymour Hersh is? Wow! I can't believe you guys don't know who Seymour Hersh is? I feel so old. So, nobody?\" and on and on it would go. I mean this would happen perhaps twice a class period every single class. The worst. \n     She would begin each class with this utterly didactic diatribe about how she's god's grammarian, and how we're pathetic because we didn't use the subjunctive mood when writing something like, \"I wish that it WERE true,\" instead of \"I wish that it was true.\" That was a fallacious example, she never said exactly that, but it was equally as annoying and trite. She would begin class with sentences like, \"I say this at the beginning of every year and nobody listens...\" I mean every student knows to basically stop listening to this person with a penchant for pedantry. \n     She hates being wrong.\n     Classroom discussions were poorly facilitate. She took every opportunity to explain what things meant as opposed to letting us explore our own ideas. \n     She doesn't clearly outline on they syllabus what you're getting graded for. There's no rubric for the in-class presentation so you basically are graded on whether or not she liked you or your topic.\n     She didn't like me, and well, I didn't care for her either.\n     It wasn't all bad. Some of the discussion were good despite Green's best efforts, and also being able to meet her [comics world] famous friends was certainly a treat. And there was also this really cute girl who sat behind me. \n     Don't take the class. Get the reading list and chat about the texts with your friends. \nWorkload:\nMinimal. \nWeekly response papers.\nOne twenty minute in-class presentation with a partner.\nOne ten-page final comparative essay.\n\n"
        }
    ]
}