{
    "prof_info": [
        {
            "prof_name": "William Leach",
            "prof_id": 1242,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Looking at Nature",
            "review_date": "January 22, 2005",
            "review_content": "\nI had a friend review this class to me, and I'm still trying to understand why. The class was seminar format, yet Professor Leach routinely lectured and students rarely had the chance to bounce ideas off each other before he would hop in and take the discussion somewhere else. Professor Leach would also often introduce articles he had read on his own and then we would discuss those for half of the seminar, even though no one in the class had read them. \n     He also seemed particularly crotchety at times, dismissing students ideas rather harshly and becoming defensive and angry when his ideas were challenged. It was at times humorous how diorderly the seminar was run and how frustrated students felt attempting  to understand his poorly explained tangents. There was not a great exchange of ideas but rather a one way flow of what Professor Leach was interested in that particular  day. That said, it was not a particular taxing seminar and I did learn a fair amount about Americans conception of nature.\nWorkload:\nUsual book a week seminar style. One page response papers  each week. Ten page final paper.\n"
        },
        {
            "course_name": "Looking at Nature in U.S. History - 1800-present",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Leach is a passionate instructor who presents a broad and interesting look at everything from farming and Bambi to highways and genetic engineering.  This class is for anyone with an interest in nature, urban development, environmental science, or any related fields.  You won't want to miss a single class (especially since it only meets once a week for 2 hours).\nWorkload:\nAbout a book a week to read.  Sometimes a bit more, sometimes less.  Weekly 1-2 page papers, one 5-10 minute oral presentation, and a 10-15 page final paper based on in-class readings (no outside research).  The short assignments are not graded so you will only have a vague idea of how you are doing in the class (based on his comments on the assignments and your participation) going into the final paper.\n"
        },
        {
            "course_name": "Americans and the Natural World",
            "review_date": "December 26, 2004",
            "review_content": "\nJust about the worst damn class I have ever taken at Columbia. If you like to be degraded on a weekly basis, attacked for views that differ from the professors, or urged to write and study obscure subject material that will have absolutely no bearing whatsoever on your outside life ... then this is the class for you. Granted, this man is a genius, if you can suffer through his utterly inefficient and downright bad teaching style you will be impressed by his sporadic outbursts such as, \"highways, they are just like sex!\" Otherwise, steer clear.\nWorkload:\nlots of reading, a 15 page paper at the end, not bad. \n"
        },
        {
            "course_name": "Looking at Nature in U.S. History - 1800-present",
            "review_date": "June 21, 2004",
            "review_content": "\nBest class ever.  Leach is a professor who demands a lot out of you, but in the end I can't imagine anyone feeling that their efforts weren't well spent.  The most important thing I got out of this class was a real knowledge of the environmental issues Americans face today, with an in depth understanding of the historical roots of those issues.  Seminar topics are varied and amazing - You can tell Leach is both fascinated by the study of nature as well as with discussing it with students - take him up on office hours!  The sometimes stern demeanor and objectivity he has in class might just give way to an endearing old gent who will banter with you about gardening and inspire you to go do your reading.\nWorkload:\nAlmost all readings were great, about 200 pages a week, plus a response paper.  The final paper is a think piece - you're expected to have thought out the human nature relationship a bit on your own by the end - and more importantly you're not expected to do loads of outside research for your paper.  BEST CLASS EVER.  Take it if you're a nature lover or if you think McDonald's should start serving uncooked beefwiches sandwiched between endangered seabass - either way you'll learn a ton.\n"
        },
        {
            "course_name": "Looking at Nature in U.S. History - 1800-present",
            "review_date": "April 28, 2004",
            "review_content": "\nThe other two reviews are right on. Professor Leach is a MAGNIFICENT professor. At first he seems a bit brusque, a perhaps even unfeeling and intimidating for some students. But never fear - he really has a soft side, and he cares immensely about his students.\nThe diverse range of readings also made this seminar a joy. Totally unlike any other class you will take at Columbia. We talked about an immense variety of subjects - hunting, suburbia, plastic surgery, highways, everything. Leach is passionate and not afraid to share his opinions - but they're not always what you expect, and he wants you to challenge him and others in the class. There was definitely not a dominant attitude or doctrine in the class - everyone was free to express their various opinions.\nThe class is  not a joke - Leach takes the course very seriously - but it's also lots of fun.\nWorkload:\nfair, especially for a seminar. 100-200 pp of reading a week, but never very dense and a great variety. each week you wrote a 1-2 pp paper on some aspect of the reading. also one presentation (~5 minutes in length), and a term paper of 10-15 pp. that does not require (in fact, he discourages) research outside of what we have already read in the seminar (VERY generous for a seminar).\n"
        },
        {
            "course_name": "Americans and the Natural World",
            "review_date": "December 13, 2002",
            "review_content": "\nThe previous review is right on. This was one of the best classes I took at Columbia. This class is not merely about environmentalism. It is about American culture in general. It immensely influenced how I think about many issues. Professor Leach makes Eric Foner look like a mainstream pussycat.\nWorkload:\nAbout 200 pages a week of amazing readings, a weekly response paper, a 10-15 page final paper.\n"
        },
        {
            "course_name": "Americans and the Natural World",
            "review_date": "November 10, 2002",
            "review_content": "\nJust about the best damn class I've ever taken at Columbia. This seminar manages to touch at least tacitly on a huge range of subjects under the general umbrella of the American (and English, here and there) view of nature: the National Parks, industrial agriculture, ecotourism, Darwin, suburbia, butterfly collecting, Moby Dick, and Bambi, to name just a few of them. The reading list is generally good, and made good fodder for class discussions. Leach is representative of a dying breed of professor and should be applauded for it; he expects his students to work hard and does not skimp on criticism. Only take this class if you can afford to put a fair amount of time into it (it's worth it), or else steel yourself for a reasonable amount of verbal abuse. But he's fair about it, and puts a lot of time into his students. His own fields of particular interest are often eccentric, bordering on kind of insane; the degree to which he is obsessed with them made even topics in which I had no interest (e.g. the history of amateur bird collecting) perversely fascinating.\nWorkload:\nA two page reading response on about a book a week, a final research paper.\n"
        }
    ]
}