{
    "prof_info": [
        {
            "prof_name": "Ellie Hisama",
            "prof_id": 3259,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Listening to hip hop",
            "review_date": "May 14, 2011",
            "review_content": "\nAs I write this review, I'm listening to a song by Eric B. & Rakim. Maybe Tupac or Biggie will come up next on shuffle. Hopefully they do, because these three STAPLES of hip-hop discourse were totally absent in this class. Instead, you'll be treated to the likes of Jamez, God-des & She, and the Alter Egos. You've heard of them too, right?\nI say that first part tongue-in-cheek, because there is definitely the presence of well known artists in the class. Eminem, Kanye West, Jay-Z, and Wu-Tang Clan all appear, and do so quite frequently. But 'frequent' must be dealt with as a relative term referring to when we actually DID listen to music. Because for a class called \"Listening to Hip-Hop,\" there wasn't a whole lot of that going on.\nEach lecture was based on a reading or two, and sometimes a documentary. We would discuss the readings for essentially the whole class, making the whole 'listening' aspect in the background or non-existent. When we actually did a critical listening in-class (maybe once or twice), it was interesting, fresh, and actually enjoyable. \nI want to make sure that my review doesn't portray Prof. Hisama in a negative light, though. She is a very nice woman who just hasn't created - in my view - an overwhelmingly interesting syllabus. It's diverse, for sure, but it tends to skip over sections that one would think deserve more attention (ex. West Coast Rap got 1 or 2 classes, and never mentioned Tupac, N.W.A., etc.). Sections that seemed to get an incredible amount of attention were, I feel, lost on the class a little bit: Japanese/World Hip-Hop, Islamophobia in hip-hop, and two weeks actually devoted to music terminology and notation (why?). \nThe tone of my review is overly negative, but I would still recommend the class. The negativity stems from my disappointment and (probably) too high of expectations. In the end, it's still a class that talks about hip-hop - that's better than 99% of the other classes you'll have as an option to fill an elective. I am also optimistic that Hisama is going to continually adjust and improve the course - we were asked for input and constructive criticisms pretty frequently as to how we might approach a topic or improve something. \nOh, yea, the TA? 10/10. In many ways was she a 10.\n\nWorkload:\n...taken from the syllabus (my comments in parentheses)\nClass attendance & participation       15%   \nAttendance is expected and required. Discussion will be based on the assigned reading, \nlistening, and viewing.  The narrative autobiography, written exercises, and any in-class \nprepared presentations will count towards this portion of the grade. E-mail Prof. Hisama \nif you ever have a medical reason for missing class.  \n(Some tend to hog the discussion, and there are going to always going to be a few people who loooove to name drop. Raise your hand a few times, show up, and you should do fine for this.)\n\nTwo critical listening assignments (5 pp. each)     2 @ 10% each      20%  \n(Relatively simple assignments -- asks you to analyze the music and lyrics into some sort of narrative/thesis.) \nMidterm exam        15%  \n(Study guide given a week before. ID's (8/15), 3 critical listening, 1 semi-prepared essay on an outside piece.) \nEthnography of a live hip hop performance (5-7 pp.)   15%  \nThis assignment asks that you get out and explore the world that you are studying. You'll \nattend a live performance of your choice and write an ethnographic account, responding \nto specific directives in the assignment. We'll give you resources to locate possible \nperformances; also be on the lookout for opportunities. \n(Fun assignment to take part in and write.)\nFinal exam - 35% -  (Basically an extended midterm. Pick 10 of 20 terms, 3 crit. listening, 1 essay on an outside piece, 2 essays on themes for the semester. Again, a study guide is provided.)  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 21, 2007",
            "review_content": "\nI really enjoyed Music Hum with Professor Hisama. Unfortunately, she only taught my section because of a last-minute illness, and likely will not teach it again, and go back to teaching grad level courses. She clearly knows a ton about music and is very passionate about it. She is also very friendly and extremely willing to work with students when they need help. Music is her life and work and that shows every class in her desire to expand the musical knowledge of her students. If she ever teaches Music Hum again, I would highly recommend her.\nWorkload:\n3 short assignments, 5% each; 2 concert reports, 10% each (like all Music Hum classes); Midterm; Final; Participation and Attendance-many short readings and listenings which are annoying but not hard at all\n"
        }
    ]
}