{
    "prof_info": [
        {
            "prof_name": "Kevin Dumouchelle",
            "prof_id": 9688,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 19, 2011",
            "review_content": "\nKevin is really fantastic.  He is incredibly brilliant and somehow manages to be totally humble and approachable.  Whenever he didn't know something (which was rare as he knew about almost everything) he would just tell the class he legitimately wasn't sure and he would look it up and get back to them (which he always did).  I found it to be a striking quality in someone so smart and it seemed to make the class respect him even more.\n I'll confess that prior to this class, I really didn't care for any of the artists in the Western Canon other than Monet, but I ended up really loving the class, and subsequently many of the artists.  Kevin is a great teacher, and he manages to make all of the material interesting and relevant (when possible).  I also developed a genuine interest in Bernini, Michaelangelo and Warhol, artists who I would probably not have appreciated, were it not for the in depth information and explanation that he provided.\nThe expectations for the midterm and exam were made clear and all of the information we needed to know, was provided.  I always appreciate this, as I tend to write down literally everything the instructor says and try to memorize it all, which is both time consuming and frequently unnecessary.  We were responsible for a lot of images, but they were provided well in advance and I found this to be incredibly generous and helpful.  \nAnyone would be lucky to have Kevin as an instructor as he has a lot to offer and makes it possible for you to really take away a lot from this course.  I think, if you are willing to put in the work (which it seems like everyone was, as he made it pretty fun) you can be successful academically and learn a lot.\n\n\nWorkload:\nTwo papers, a midterm, a final and two field trips.  Occasional discussion postings on courseworks. Plenty of advance notice provided for everything.  \n"
        }
    ]
}