{
    "prof_info": [
        {
            "prof_name": "John Frankfurt",
            "prof_id": 2653,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Avant-Garde Cinema",
            "review_date": "September 02, 2008",
            "review_content": "\nI'd been waiting for a few semesters for the film department to offer this class again\nand it was definitely worth the wait.  Professor Frankfurt is a well-prepared,\nknowledgeable, teacher who puts together a solid course.  While his humor sometimes\nescapes the class, he does a good job at facilitating discussions - integrating\nstudent comments and questions in productive ways.  The screenings were always quite\ngood.  There was a blogging assignment that was a bit ill-defined though it was nice to\nbe forced to have to visit and write about places like Anthology Film Archive.  Students\nhad the choice of a final seminar paper or making their own experimental film.  Overall,\nworthwhile taking this class.\nWorkload:\nmedium to heavy reading, blogging, final paper or creative project\n"
        },
        {
            "course_name": "Silent Cinema",
            "review_date": "January 26, 2007",
            "review_content": "\nProf. Frankfurt is a nice guy who teaches an okay class.  His interpretation of silent cinema isn't thought-provoking and doesn't evoke enthusiasm from his students, but was informative and a pretty good intro to silent movies.  \nHis papers are sometimes annoying.  The first two topics were so incredibly general.  For the third archival paper, it was interesting to go see archival slides at the Rare Books Library, but no one had any idea what he wanted us to write because there was no precedent for the assignment.  He is nice (slightly awkward) and responsive to student comments, but there's nothing to get worked up about.\nWorkload:\nReadings and 3 papers.  Not too bad.\n"
        },
        {
            "course_name": "Silent Cinema",
            "review_date": "December 10, 2006",
            "review_content": "\nThis is not an easy topic to teach, but Professor Frankfurt managed to make the class casual and engaging.  I  really appreciated how he was so receptive and responsive to student comments; it was great to be able to voice personal opinions for once.\nWorkload:\nDiscussion postings.  Two online papers (3000 words) that lets you site film clips watched in class.  One paper (2500 words) on Nanook of the North looking through the Robert Flaherty archival papers in Columbia's library. \n"
        },
        {
            "course_name": "De-Coding Culture",
            "review_date": "November 14, 2005",
            "review_content": "\nProf.Frankfurt is very engrossing.  He changed the way I think about art and everyday things like IPods.  He is a film guy so make sure you're interested in movies.  He is straightforward and clear. Class discussions were always entertaining.\nWorkload:\nSometimes too much reading.  The paper assignments are very open-ended.\n"
        }
    ]
}