{
    "prof_info": [
        {
            "prof_name": "Harry Kavros",
            "prof_id": 2840,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 17, 2010",
            "review_content": "\nKavros will not provide the typical, quintessential lit hum experience, but he's certainly far better than most other options. He tends to run the class more as a lecture than as a discussion, going on about various vague and abstract ideas meant to help elucidate the texts. Fond of drawing charts and graphs on the board, Kavros rarely provokes spirited class discussion. Kavros did help me think in a new way and write in the academic style that many professors at Columbia prefer. Overall, I think that Kavros is genuinely concerned with the growth of his students and passionate about the texts.\nBeware, Kavros does make some syllabus alterations. But compared to the workload of other sections, Kavros' seemed light.\nIf you make a definite effort to participate, do all the readings, and stay focused, there's much to be learned from Kavros.\nWorkload:\nMidterm, final, two papers, questions every class on courseworks. Grading is fair and context is not necessary on most quote ids.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 13, 2009",
            "review_content": "\nKavros is a good professor. he knows the material well, which sometimes leads him to lecture a little too much, but if students have something to say, he encourages them. in fact, my main complaint is that he can be a little too encouraging, validating even the most ridiculous observations. he does not force things out of you, though, so if you're a quiet student, don't expect to be pulled out of your shell, and hope that the rest of your class isn't quiet, too, because then it just becomes a lecture.\nWorkload:\nnot too bad. submit 3 questions or a paragraph before every class. 2 papers (5-7 pp.), a midterm, and a final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 31, 2008",
            "review_content": "\nHe is a good professor. He has content mastery. I am a math major, I am not good at reading or writing but he was nice enough and helpful enough for me to get a B+ for his course so far. 2 papers, midterm and standard final. He weights things to help you get the best grade possible.\nDefinitely a good Prof.\nWorkload:\n3 Questions for each class (anywhere from 3-20 minutes of work)\n2 papers, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 22, 2008",
            "review_content": "\nHarry is great. He always had interesting stuff to say about the books, and made sure the class  stayed focused on teasing out the meaning of the text and didn't go off on irrelevant tangents. Some people didn't like that he made kids raise their hands to speak and would sometimes lecture for a while about a particular topic, but I thought he gave the class necessary structure. He is smart and a fair graded. In short, you are lucky to get him.\nWorkload:\n2 papers, midterm, final per semester\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 22, 2008",
            "review_content": "\nHarry is great. He always had interesting stuff to say about the books, and made sure the class  stayed focused on teasing out the meaning of the text and didn't go off on irrelevant tangents. Some people didn't like that he made kids raise their hands to speak and would sometimes lecture for a while about a particular topic, but I thought he gave the class necessary structure. He is smart and a fair graded. In short, you are lucky to get him.\nWorkload:\n2 papers, midterm, final per semester\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 13, 2006",
            "review_content": "\nAt first, taking lit hum with a dean of Columbia Law School would prove to be an unforgettable experience.  I regret that it was, an experience I hope not to relive.  Although the cause of this dull experience is debatable, I would definitely go for the \"pre-med excuse\" in order to switch lit hum sections.  The only part of me that appreciates this experience is that students who stuck with this section for second semester had an even worse experience.\n9:00 AM, a gang of football players, the Iliad for weeks on end, all contributed to an impossible task for Harry to stimulate class discussion and class interest.  Well, he failed, in most respects.  It got to the point that each student had to come into class with a prepared discussion which still did not rectify this problem.  Towards the midterm and final we just spent all class testing each other on passages for the tests.  Very approachable during office hours, and a down-to-earth person all around.\nWorkload:\n3 5-page papers, difficult midterm (25 IDs, 3 essays on 3 IDs), department final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 19, 2006",
            "review_content": "\nOne would think that an assistant Dean at the Law School would have better things to do than teach Literature Humanities to a squadron of freshmen. Wrong: Harry was engaged and enthusiatic in his work, and has devoted much of his time to the study of the Classics, particularly those in Greek. For a teacher of first-semester LitHum, it doesn't get much better than this.\nDean Kavros has taught this course several times, and read through the syllabus' works more times than he has taught them. A short visit to his office confirmed that he's been reading up on just about everything in the field. This comes in handy when you are looking for inspiration - he's glad to have students in his office hours, and to acommodate at other times; detailed, accurate, and constructive commentary on written work only comes to those who take advantage of office hours, so do.\nHarry's teaching style is not perfect: while he is a clear speaker who managed even to make sense of the catalogue of ships in Iliad II, he is often too permissive. \nThat is to say, if a student goes off on an unproductive tangent or incorrect commentary, he will try to make sense of it rather than bringing the conversation back around to something useful. The result can be a choppy discussion marred by bad student preparation. \nNonetheless, Harry is engaging and gets something out of every class.\nWorkload:\nThree papers of about 5 pages, with the option to combine two papers into one long paper. The final grade is weighted toward later work, on the presumption that it improves. Midterm, final. Three basic questions at the beginning of each class, in class.\n"
        }
    ]
}