{
    "prof_info": [
        {
            "prof_name": "Max Lipyanskiy",
            "prof_id": 5500,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Honors Linear Algebra",
            "review_date": "January 14, 2011",
            "review_content": "\nLipyanskiy is a great professor.  He's completely willing to help anyone who asks, and really encourages questions, although the class was generally really quiet.  He really knows what he's talking about.  He's such a sweet guy, and he cares about how you do in the class.  And although the class is very abstract and theoretical, he'd always explain why we would want to learn any of this stuff, and try to relate it to something more concrete.\nThat being said, the textbook we used was horrible, and the material is hard to grasp if you've never done any abstract math.  Not saying you won't get it, some people just do, but I was not one of them.  Still, if you really try, you could get a lot out of this class.  I would recommend at least giving it a try.  It really is theoretical, but the material is interesting and you do end up learning practical applications towards the end.\nWorkload:\nThe homework was difficult if it was from the book.  The ones he writes are pretty manageable.  Again, Prof Lipyanskiy is completely willing to help you understand anything that you don't understand, but sometimes it's difficult to find help when you don't start the homework well in advance.  There is an assignment due every week, one midterm and the final.  The final counts for 50%, so do well on that!\n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "May 18, 2010",
            "review_content": "\nThe first review was pretty much spot on, so I can't add much, but I feel compelled to write a review anyway since Lipyanskiy definitely deserves a shiny nugget next to his name.  I was fearing the worst when I saw that this un-reviewed professor straight out of MIT with an Eastern-European name was teaching this class.  But as soon as he walked in on the first day with his track jacket and sweet pompadour, all of my fears were instantly allayed.  The man is as clear as glass and funny as hell, and not in a not corny math geek way; he's a naturally witty guy who would frequently crack the class up.  Overall, a fantastic professor in every respect.\nThe course itself consists of a lot more optimization than analysis: 80% plug and chug optimization techniques, 15% geometric intuition, 5% really basic topological concepts.  However the plug and chug optimization techniques learned are extremely useful - the kind of stuff professors in science and econ classes will give you a 15-minute primer on and expect you to whip out on problem sets and exams.  So knowing this stuff is really useful.  And yeah, you don't really need to buy the book, though it's a decent reference to have if you're an econ major.  I should also note that quality of the student population of the class was pretty low; really dumb questions were asked during lecture and people consistently got homework problems wrong for which there were answers in the back of the book.\nWorkload:\nAs mentioned before, the problem sets got progressively more complicated, computationally speaking, but all were very doable.\nExams were very fair with no surprises, but he didn't give away the farm either.  I think there was a little more of a time crunch in the midterm as compared to the final, which is the reason for the slightly lower mean.\n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "May 13, 2010",
            "review_content": "\nLet me get this out of the way first: I'm an applied math major and I was taking the course to avoid the W4061 Modern Analysis requirement.  Having said that, I found this course incredibly easy. I was worried about this course because of past reviews of Pinkham's \"debauchery\" of the material, and there weren't any reviews of the new prof . \nFortunately, Max was awesome.  He explained things really clearly and tried to keep things simple.  He gave us the definitions and theorems that we needed to know along with numerous computational examples.  Heck, you didn't really need the textbook, which was quite technical and economically oriented.  Your notes from class covered everything you needed to know for the hws and exams.  No proofs were required in this class, which was pretty sweet.\nFor the first half of the semester we covered Linear Algebra, basic topology, optimization of functions of several variables, Lagrange Multipliers, and Kuhn-Tucker theory. Post midterm, we did some ODEs which was a joke if you've taken a class for that already, and Calculus of Variations which could be lengthy.\nI highly recommend taking a course with Max.  Dunno how he'll teach Honors Linear Algebra in the fall, but based on my experiences it's probably not going to be too painful.\nWorkload:\nFair.  At first, the HW's seemed too easy, but the length will definitely go up as the semester progresses.  \nHW-20% 10 assignments total\nMidterm-30% Mean was 72, curved nicely. An A range grade only required a 78.\nFinal-50% Cumulative, mean was 76.\n"
        }
    ]
}