{
    "prof_info": [
        {
            "prof_name": "Andrew Obus",
            "prof_id": 9790,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Higher Mathematics",
            "review_date": "May 23, 2011",
            "review_content": "\nExcellent professor. Lectures were fast paced at times; however, Obus's ability to explain the material made the book practically unnecessary (not to mention the book we had was a pretty difficult text to learn from in the later chapters). \nIn particular, I think what makes Professor Obus stand out is that he is truly committed to teaching. He connects with students during lecture, learns our names, stops frequently so that we may ask questions, and is always willing to schedule help outside his normal office hours. He was organized and always always always willing to help. \nIn addition, I really walked out of the class understanding how to articulate elementary and intermediate level proofs. For someone who's trying to major in math but who didn't go through with Honors Math, this is a must do course - however, for someone who DID go through honors math, I can't say you'd be learning anything all too new. We cover logic, proofs by induction, generating the real numbers, cardinality of sets, some analysis, and some algebra.\nOverall, a great experience. Obus certainly deserves all the excellent reviews he's received in the past. \nWorkload:\n10 Moderately Difficult - Very Challenging HW Sets (25%)\nClass participation (5%) <-- (Free points)\nTwo Midterms (not too tough, not too easy, each 15%)\nExtra Problems or a Presentation (10%)\nFinal (30%)\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "April 13, 2010",
            "review_content": "\nMr. Obus was by far the best professor i had the first semester, i truly enjoyed going to his class. All too often you hear horror stories about Columbia's math department, it usually goes....He didn't teach a thing, He mumbles, He goes too fast, and my favorite \"I just can't understand the guy.\" This man is non of the above.\nHe teaches through examples, is never bothered by questions, always stays late to explain things you may have missed or just didn't understand, and above all the man teaches!!!\nAs a testament to his teaching prowess the averages on the exams were in the 80's and mid 70's for the final; and i showed the exams to others with different professors and they exclaimed that it looked just as hard if not a little harder. \nPS now having gone a semester with a prof that i couldn't understand, frustrated me and having to teach myself Calc III i know that what i had first semester was a god send. \nThank You Mr. Obus\nWorkload:\n10 problem sets (take your time and really understand them because the exams will be in the same vain), 2 midterms (fair), and a final (slightly harder because of more material but definitely doable)\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 01, 2010",
            "review_content": "\nObus is simply and plainly the man!  His course was by far the most interesting and pleasant one I had this semester. He literally jumps for joy when solving an integral problem.  His enthusiasm knows no bounds.  In terms of his grading, he is invariably fair!  Mean grades were the highest on both midterms compared to the other Calc 2 sections.\nThree adjectives that best describe him: helpful, energetic, committed!  He always remains in class until everyone has left to explain difficult aspects of the material to students.  \nObus has a great sense of humor and is always positive in class.  Even if you hate math, you will love this guys class b/c he is so damn cool! Take this professor at all costs!  \n\nWorkload:\nstandard math class:\nweekly PS, two in-class midterms (straightforward) and a final (somewhat more difficult, but certainly manageable!)\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 28, 2009",
            "review_content": "\nAwesome teacher. Definitely the best teacher I have had the first semester. Taught the material very well and enthusiastically, whenever there was a doubt anyone could easily ask any question, but he taught so well questions weren't frequent. \nMid terms and finals were okay, mean on mid terms was almost 80 and on the final it was 74. His homeworks are enough preparation for them, a few book problems each time. Two homeworks are a bit longer than the rest, but you get an extra week for each of them. \nHe is often funny and his class is just delightful, though it gets a bit boring during the second half.\nObus is the bee's knees.\nWorkload:\n2 mid terms, 1 final, 10 problem sets.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 16, 2009",
            "review_content": "\nProfessor Obus is great. He seems genuinely enthusiastic about teaching, and he explains everything clearly. He actually learned our names, too.\nHe is nice about answering questions and he teaches using a lot of examples, so you can take his class if you're not confident with calculus. He occasionally jokes around and tells math-related stories, which keeps class from getting too boring.\nHe doesn't skip any steps when he writes math on the chalkboard, so it's easy to follow along. Many times, he will write verbatim every word he speaks. I found it slightly annoying at first, but actually it's good because it slows the pace a little and you can write down the important stuff without missing any details. His lectures are organized and overall I thought the class was easy.\nHe spends some time the class before an exam to review and tell us what to expect. He also held a review session for the final.\nWorkload:\nTen problem sets (graded), two midterm exams, and final exam. Very reasonable workload.\n"
        }
    ]
}