{
    "prof_info": [
        {
            "prof_name": "Viviana Cruzado-Ramos",
            "prof_id": 6336,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 07, 2005",
            "review_content": "\nIf you are looking to learn good Spanish, this is not the class for you. Don't get me wrong, Viviana is an extremely nice instructor, willing to help, but her class does little to further your knowledge of the Spanish language. A native Puerto Rican, she has trouble communicating in English and often speaks poor Spanish herself. She assigns nearly every excercise in the workbook for homework, but never once does she review the answers in class. The quizzes are short, but relatively tricky and you can bullshit your way through about 4, one page essays, which she gives you the opportunity to correct before she grades. \nI found waking up for this class half the battle, but going is definitely worth it because after three absences she begins deducting from your participation grade. And believe it or not, this could hurt your chances of an easy A.\nThis class is fairly easy, but don't expect to finish the semester with any greater knowledge of the language.\nWorkload:\n5 quizzes (1 dropped); about 4 essays (1-2 pages); nightly excercises in the workbook; frequent posting on courseworks; one novel (Bodas de Sangre); one movie (Belle Epoque); group project; department midterm and final\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 23, 2004",
            "review_content": "\nI really liked Viviana. Maybe its because I had shitty teachers in high school, but I thought I learned a lot at the same time. Fair enough, for a 10 am class that met 4 days a week, I sometimes had to fight sleep off, but the A I earned at the end of the semester was worth the early alarm setting.\nVIviana (who wants her students to call her by her first name) is very energetic and enthusiastic. Although not perhaps the greatest teacher, she is always willing to meet with students and will stop to answer any questions you have. She follows the book, so you don't need to worry about understanding everything she says in class (which is almost 100% in spanish).\nWe had 7 small quizzes, drop the lowest grade. I think 4 essays, which she marks up, hands back, lets you fix, and then grades. Piece of cake. Read one novel and watched one movie. Midterm and final (departmental - not so hard). She follows the department format for everything so its really easy to prepare for the final at the end.\nDefinately would recommend Viviana.\nWorkload:\n6 quizzes (drop the lowest grade), 4 short essays (1-2 pgs), midterm, final, oral presentation (skit). Homework daily but she doesnt go over it ever.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 21, 2004",
            "review_content": "\nViviana is really nice, but she doesn't help you learn Spanish. We rarely do excercises in class, and almost all of the work is from the workbook which you do at home and have to teach yourself anyway. As a native speaker, she seems to only know grammar rules because they SOUND right, but not why or how they do, and is completely unable to explain these things. She also is astonishingly poor in English for someone from Puerto Rico. All in all she's very friendly, and wants to help you, but not a very good instructor, and I would highly recommend taking someone else if you want to learn.\nWorkload:\nDaily excercises, weekly quizzes. About half hour of work a night. Three compositions, all pretty easily graded. Midterm and final are from the department, with each section written by a different teacher, so some are easy and some are ridiculously hard.\n"
        }
    ]
}