{
    "prof_info": [
        {
            "prof_name": "William Bailey",
            "prof_id": 2033,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Thermodynamics, Kinetic Theory, and Statistical Mechanics",
            "review_date": "December 21, 2011",
            "review_content": "\nThis course is real fun. You get a pretty comprehensive treatment of a very fascinating subject, that starts right from first principles of statistical mechanics and slowly works its way up to the thermodynamics of ideal gases, and so on that is probably familiar to you. Studying the theory is fun, and the book (Charles Kittel and Herbert Kroemer, Thermal Physics) is extremely good - study it very systematically, and you'll really understand the subject.\nProf. Bailey - well, he's a little clueless in class. He knows his stuff, but that sometimes doesn't translate into knowing how to teach basic thermodynamics. I didn't really look forward to going to classes, although I loved the subject. He's definitely a nice guy, and will answer questions very patiently; but while it is definitely possible to make the class interesting, he tends to spend a lot of time going slowly through each derivation, which detracts from the focus he gives to the essential points of the theory, that make it interesting and useful. \nBut while he is not the liveliest of professors, he is certainly not intolerable - some of the classes are pretty good. \nOn the whole, definitely look forward to the class - especially the subject matter of thermodynamics. If you like physics at all, you'll love this class.\nWorkload:\nTen (almost-weekly) homework sets (10% of your grade), two midterms (25% each) and a final (40%). The second midterm was ridiculously easy. The problem sets are not too time-consuming.\n"
        },
        {
            "course_name": "Electronic and Magnetic Properties of Solids",
            "review_date": "February 07, 2011",
            "review_content": "\nThis class, if you don't have previous knowledge is a very dense class. It covers electromagnetism, solid state physics, semiconductor physics, magnetism, reciprocal spaces and x-ray diffraction each of which can be a course itself! However with his organized notes Bailey is on top of it. He's really smart and knows his area very well. But sometimes due to the time constraint, he just rushes into one topic and tries to finish it in 1 lecture so it is a MUST that he skips some of the steps. However if you try to understand the notes, ask questions during the lectures or check out the references he mentions, there's no reason not to be able to get a good grade. Bailey is extremely helpful during office hours, and he even answers questions from other courses! However you should act like a senior/grad student and shouldn't expect answers to the hw questions. I remember asking him a question outside his office hour (7 pm) and we discussed it for 1 hour without him showing any sign of exhaustion. I asked him a couple of questions through e-mail and he answered me right away which I really appreciate.\nAs for grading, he is always on time, gives out solutions, goes over the problems during lectures and he is fair. The midterms were so easy but the final was not. However he solved all the questions in a previous final he posted and our final was similar to that. If anyone didn't get a good grade that's totally NOT Bailey's fault.\nHe is also very much involved in magnetism (his research area), so if you want to learn the stuff Bailey is the one you should go to.   \nWorkload:\n8 HW assignments- all related to the class and covers the lectures well. Sometimes the questions are a bit hard, that's when you should go to the TA or his office hours.\n2 MT - 1 final all of which are decent.\n"
        },
        {
            "course_name": "Atomic Scale Engineering: New Materials",
            "review_date": "October 13, 2009",
            "review_content": "\nI took this class thinking that I might minor in Materials Science and Engineering. Bailey changed my mind pretty quickly. He is an awful lecturer. He fills a board a minute with random equations and diagrams, and spends most of his time talking at the board. He never looks around to answer questions that anyone has. He continuously repeats things to hammer it in your head, but this adds dullness to his already sleep-inducing lectures. The class would be tolerable if his readings were helpful, but they only help a little, and he hands them out two weeks after he's covered the material. His homework refers to the most obscure sections of the lectures and the readings. The only good thing about him is that he's willing to meet outside of class, but that wouldn't be necessary if he was clearer in class. And chances are, the material he's presenting is so over your head you won't know what to ask.\nWorkload:\n5 short but obscure problem sets\n1 very technical 10-page paper on a topic of your choice\n1 relatively-easily graded final. You only have to answer for 100 out of 150 to get an A.\n"
        },
        {
            "course_name": "Atomic Scale Engineering: New Materials",
            "review_date": "April 26, 2009",
            "review_content": "\na pretty ridiculous class all around. prof. bailey is pretty disorganized. theres no textbook and the notes are all over the place, so the material is hard to follow. bailey doesnt understand what material is hard to grasp and what material is pretty simple. all the work culminates at the end in a single test, 10 page paper and a presentation.\nto his credit he means well but this is not the course to take to fulfill the pre-professional requirement.\nWorkload:\na few problem sets (which he writes himself- most questions are extremely elementary, while a few require pages of math). a final one week before class ends. a 10 page paper and presentation on the last day of class\n"
        },
        {
            "course_name": "Atomic Scale Engineering: New Materials",
            "review_date": "December 28, 2008",
            "review_content": "\nHorrible Course. Don't take it. Bailey is one of the many Columbia teachers who care more about their own research than teaching students. He canceled so many classes that our midterm was on the last day of classes. He is extremely soft spoken, so much so that sleeping in the 4pm class was quite easy. There was a final paper and project where he looked for ways to grill presenters. Didn't get a lot out of this class. I'd say even if you are a material science major, consider a different pre-prof, and if you aren't stay away.\nWorkload:\nNone - class is too disorganized to function\n"
        },
        {
            "course_name": "Thermodynamics",
            "review_date": "January 30, 2008",
            "review_content": "\nVery interesting course, but rather hard to follow. It moves at a relatively quick pace with lots of complex derivations. The homework can be somewhat difficult and mildly annoying with the little details that one is required to know/remember. You end up learning a lot, but you'll have to read the book (it's a pretty good book, but do NOT skim it). You will need to understand the material pretty well for the final.\nIt's good course though and presents another aspect of the physical world in a more intuitive, and much more fundamental way than when I learned thermo in Chemistry courses.\nWorkload:\nUsually long problem sets (can be short or up to 5 or 6 hours), midterm and final (not easy, but fair since they require full knowledge of the material).\n"
        },
        {
            "course_name": "Atomic Scale Engineering: New Materials",
            "review_date": "May 14, 2007",
            "review_content": "\nNice guy, dull class. Dull dull dull. He's really into what he does, but the lectures still don't stick for some reason. If you are bad at chemistry (hint: I am bad at chemistry), you may have a tough time with it, but he's the world's most forgiving grader. (Comments like \"This shows a complete lack of understanding of the material. B+.\")\nWe also had about eight classes this term cancelled. Draw from that what you will.\nWorkload:\nA few problem sets (pretty easy), a midterm, and then a 10 page research paper. No final for us, but that doesn't seem like it's usually the case.\n"
        },
        {
            "course_name": "Atomic Scale Engineering: New Materials",
            "review_date": "April 25, 2007",
            "review_content": "\nProfessor Bailey is great professor for the intro level material science class. Albeit if you don't like material science, you will hate the professor, but if you do like mat sci, Professor Bailey is hilarious professor. Yes, he sometimes speaks a different language, not literally, but  there's always a TA there to help translate. He gets so caught up in teaching they he often forgets to assign homework... and even forgets to give a midterm. He pushes off all the problem sets and midterm until the end of the semester, but they are not hard at all. Go to class, enjoy his very subtle and geeky sense of humor. He has such strange quirks that lecture was never boring. But again, if you aren't planning on majoring in material science, or a field closely related, you probably shouldn't take this class. Only a true love for crystal structures and doping will make this class enjoyable. \nWorkload:\n4 problem sets, one due the second week of class, the last 3 due towards the end of the semester. One midterm where you choose a few questions to answer (he's a generous grader, lots of partial credit). One final presentation/report on a material of your choice (10-15 pages.\n"
        },
        {
            "course_name": "Atomic Scale Engineering: New Materials",
            "review_date": "October 24, 2006",
            "review_content": "\nNice guy, really smart.  Moderatly easy class.  If you do your work and go to class most of the time you can't get lower than a B+.  I think no one in my class did.  His lectures are rather bland, but some of it is rather interesting.  Recommended\nWorkload:\n4-5 psets that take 1-2 hours, a final and a paper/presentation.  Final is not too bad as you get to choose 10 out of 15 questions\n\n"
        },
        {
            "course_name": "Atomic Scale Engineering: New Materials",
            "review_date": "May 02, 2006",
            "review_content": "\nThere are much, much easier 1000 level courses to take for the credits you need. Unless you have a genuine interest in materials, avoid this one like the plague.\nBailey is a good professor though.\n"
        },
        {
            "course_name": "Atomic Scale Engineering: New Materials",
            "review_date": "July 01, 2004",
            "review_content": "\nProf. Bailey is a very nice person--he's willing to help you and answer questions in class.  HOWEVER, his lectures are quite boring, esp. for a class that's from 6:50pm to 9:20pm.  He focuses on magnetic properties of materials A LOT.\nIf you are interested in materials science, the class does give you a taste of what it is like.  But the lectures aren't stimulating AT ALL.\nWorkload:\nOne midterm--not too difficult, you get to choose about 15 questions to answer from a long list of questions.  Mainly concept-based.\nFinal research paper+presentation--not bad.  A bit time consuming though.\n"
        },
        {
            "course_name": "Electronic and Magnetic Properties of Solids",
            "review_date": "April 18, 2004",
            "review_content": "\nWow, is this class ever boring.  And hard.  Bailey seems like a fairly nice person ,and one gets the feeling that his efforts to succeed as an instructor are sort of \"cute\" but by the end he's totally annoying.  He speaks in a monotone, and a soft monotone at that.  He isn't a fan of eye contact.  And he gives you a packet of the notes at the beginning of every class that he basically just reads from the whole time.  These aren't handwritten spotty notes, but pages of paragraphs gleaned from the textbook he appears to be writing.  So, you feel like you shouldn't have to take notes, but the packets are fairly difficult to breakdown on your own, so you probably should.  \nThe most frustrating thing is that Bailey seems to enjoy being cryptic about tests and homework and questions in general.  When you ask reasonable questions as to the information you should focus on, he dodges them like nobody's business.  And while he is available for office hours, he doesn't actually like to go over the specific homework problems in detail.  He'll mention the sneaky math trick (use the Hamiltonian!) that you were supposed to miraculously divine, but he won't tell you when or where to use it.  Or he will respond to emails regarding tests with \"Don't worry.  The test will be fine,\" and then give everyone Cs.  He's just very difficult to really feel out.  And since his communication skills leave a lot to be desired (he speaks english perfectly, but he doesn't like to give clear/concise/useful answers about anything) you find yourself sort of swimming in a world of nebulous concepts - it's not particularly conducive to learning.  \nAnd he expects you to know a lot of complicated math.  So, unless you're taking this class because you have to, don't do it.  The amount you learn isn't nearly worth the stress.  If you're taking it because you must, you'll survive but mostly due to your own efforts to learn the material on your own.\nFinally, Bailey says that about 5 books are required for the course.  NONE OF THEM ARE - don't waste your money.  He writes all his own problem sets with the exception of a few problems from Griffiths (if you want a textbook, get this one), and the materials is exclusively from the notes he provides.\nWorkload:\nMore than you want, but you can handle it.  Weekly or every other week long-ish problem sets, 2 midterms and a final.  All the tests are hard and he likes to be vague as to what they will cover.\n"
        }
    ]
}