{
    "prof_info": [
        {
            "prof_name": "Eric Foner",
            "prof_id": 92,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Slavery and Emancipation in the U.S.",
            "review_date": "November 02, 2012",
            "review_content": "\ni'm not ashamed to admit it...i am in love with a 69-year-old man. (okay, i'm a little ashamed. i'm only 21.)\ni was in Foner's course on American radical movements last semester and it blew my mind. it was the only course where i genuinely enjoyed every lecture, because Foner is brilliant and his lectures were both accessible and entertaining. i also got a kick out of the fact that unlike many other professors (including ones at Barnard, who teach much smaller but still large introductory courses), he actually made a point of meeting with all of the students in that ENORMOUS lecture class who were registered with Disability Services and needed test accommodations forms signed. he was really congenial and very nice about it (considering he didn't really have interactions with most students in that course), so it was unexpected but very cool. but i digress.\ni somehow managed to convince him i was worthy of being in his seminar on Slavery and Emancipation; needless to say i was thrilled that i would get to bask in his glory, at such close range no less! if you have heard anything about Foner, you know that the Civil War and Abe Lincoln are his shit, so to be in a lecture devoted to these topics is such a treat (for lack of a better, less-hokey word). you can tell how much he loves this stuff and how he genuinely still gets something out of discussion with his students. the class is challenging, but everything is explained and dealt with in-depth. Foner drops multiple knowledge bombs on you each class, and it is awesome.\nFoner is also a true g. he regularly brings in contemporary issues and provides delightful personal anecdotes on conservative politics (which can be summed up as \"oy vey\" due to his profound disapproval), the Columbia scholars (and otherwise) of yore, and current events. he is also bringing our class to go see the Steven Spielberg \"Lincoln\" movie and feeding us pizza afterwards! date night with a Pulitzer-Prize winner! u jelly?\nby the way - DO go see him during his office hours. aside from the fact that his eyes sort of light up when someone comes to see him during that time (you would think more people would come, but they are probably just intimidated by his badassery), and that he has the most epic office in existence (SWORDS!!), he takes the time to talk to and get to know you. he's really great. (i may be biased though)\nthe man is, as we say, a true mensch.\nWorkload:\na book a week, many of which are hella long. each class one person writes three pages and presents on the week's reading. this is a seminar with the God of American history - one does not simply SKIP the reading for his seminar.\n15 page final paper comparing 4 books. a huge pain in the butt to deal with, but oddly fulfilling nonetheless.\n"
        },
        {
            "course_name": "U.S. in the Era of Civil War and Reconstruction",
            "review_date": "December 09, 2010",
            "review_content": "\nEric Foner may be the most impressive lecturer in the historical profession in the world.  He's certainly the best I've had, and this comes from a history major who makes a point of filling her electives with 3000+ level history classes. \nPeople can say whatever they want about Foner's political predilections - and he's certainly far to the left of \"mainstream America\" (whatever that means), myself included.  But Foner presents a compelling, fact-based interpretation of a profoundly important period in American history that proves far more objective than those who would seek to criticize him typically offer as an alternative.   \nWorkload:\ntypical of a 3000+ level CU history class\n"
        },
        {
            "course_name": "U.S. in the Era of Civil War and Reconstruction",
            "review_date": "November 27, 2010",
            "review_content": "\nI'm in this class now, and I feel like the reviews from six years ago are just as applicable today. Professor Foner is an absolute leader in this field, and it is a privilege to take a class with him. Each lecture focuses on one pretty narrow topic, such as the Southern antebellum economy or Northern patriotism in 1863, and the class is impeccably organized. Every class, Professor Foner stands just next to the podium, and talks to the class very conversationally, glancing at his notes once or twice the whole class. He talks so easily, at the end of each class, it's hard to believe it's been 75 minutes. The class is wonderful, and Columbia is very lucky to have Professor Foner on faculty. \nWorkload:\nThere is a lot of reading, but it is very interesting and it is chosen very judiciously. That is to say, Professor Foner doesn't assign reading just to assign it- it is all very relevant to class and goes very nicely with the lectures. Although students can get away with skipping some of the reading, doing the reading is a huge advantage in class and in the discussion sections. The midterm is one essay, very straightforward and concerning something we had talked about a lot in class and discussion. The final was a little harder, and it required studying, but there were no real surprises on it. Also, one 10-12 page paper that required us to read books not on the syllabus. It was kind of pain to read the extra books, but we could pick the books and the topic of the paper. Discussion section also requires weekly posts over the readings, but these are not a big deal at all. \n"
        },
        {
            "course_name": "The Radical Tradition In America",
            "review_date": "December 05, 2009",
            "review_content": "\nEric Foner teaches the most inconsequential aspects of American history as if they were the real thing. He does a good job of analyzing what radical Americans did in the past - not much - and presents a slanted view of their accomplishments. If you are interested in listening to academia discuss intellectual poseurs, militant populists, and communitarian ideologues who believe in living more \"authentically\", then by all means attend every one of his lectures. Foner is clever, a good lecturer, and knows his subject. The trouble is that the subject itself, for any serious student of history, is garbage.\nWorkload:\nVery standard across the board.\n"
        },
        {
            "course_name": "The Radical Tradition in America",
            "review_date": "December 28, 2008",
            "review_content": "\nThere's nothing new to say about Foner, he's brilliant and everyone knows it. This class, for those who have had plenty of American history, is interesting in that it covers the movements of the American left since the Revolutionary War...but there's little mention of the American right. Fitting for Columbia. Foner himself is from the radical tradition, so don't expect an unbiased class. The class is very left-wing oriented, which some people didn't like. Generally, if you're not a left-wing hippie/anarchist/communist, don't take this class. \nWorkload:\nWeekly courseworks postings, but the grade is entirely up to your TA. Standard: midterm, paper, final. \n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "June 05, 2007",
            "review_content": "\nEric Foner has a cult following at Columbia, and although his lectures are interesting and he synthesizes well, this class was definitely not one of my favorite of all time and pales in comparison to the style of Alan Brinkley (with whom I took America Since 1945).  A lot of this comes down to the assignments and the TA whom I had.  My main complaint with this course was its often oppressive focus on historiography rather than the actual tracing and significance of historical events.  So much time was spent talking about how authors perceived things and how authorsÂ’ points of views compared to each otherÂ’s that a lot of the importance of the material was lost.  Granted, historiography and an awareness of the authorÂ’s perspective are useful skills to history students, but the concentration of time spent on such things in this class was far too much.  For the paper, we had to read two works on the same subject and compare the authorsÂ’ analyses.  Besides the fact that this was a god-awful amount of work that prevented me from doing well in my other classes, I found myself reading two books on a subject about which I was interested by just skimming for differences instead of indulging my curiosity on the topic.  Thus, the paper became less interesting and more difficult to complete.  The same was true about the books we read for the courseÂ—the section was spent talking about the authorÂ’s opinion more than the historical period.  I learned a lot about picking an argument out of a text, but retained very little about the U.S. in the era of slavery and Jacksonian democracy.\nMy other complaint with this class was my TA's grading standards.  I am a history major who has taken many other classes in this style, and always get AÂ’s/A-Â’s depending on the level of work I do.  In this class, I worked harder than I ever had before in a history lecture, participated the most in my section, and spent two solid weeks working on my paper (thereby causing my grade in another class to drop by a full letter)Â… and still received a B+.  I am certain that if I had been graded by anyone elseÂ’s standards I would have gotten an A/A-.  This may have been specific to my TA, however.\nWorkload:\nExtremely time-consuming historiography paper that caused me to neglect my other courses.  Midterm and final, standard for large history lectures.  Huge focus on who said what, so you'll need to memorize what the authors stay (1 whole book or parts of a book each week).\n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "January 02, 2007",
            "review_content": "\nFoner does deserve the praise and all the raves people give him. His erudition is quite impressive and I did not find him to be egoistic or prone to \"self-aggrandizement\" In fact, Foner was actually quite humble and spoke of many other great history scholars. His viewpoints are interesting, creative and unique. He will get you thinking in new ways. My only complaint is that the TA's grade everything and are quite unfair and unreasonable. My entire section and other sections shared this sentiment as well as other friends of mine who took his courses in the past. Given the large number of students he can't grade himself. Talking to the TA's about the grades is useless because they will never change them instead you are told that the average class grade was a B- so anything above consider yourself lucky. Grading for papers was even worse. Foner is a great prof but if you want anything close to an A prepare to be disappointed----even with breaking your A-S all semester \nWorkload:\nModerate. Midterm, Paper and Final, which counts more.\n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "June 19, 2006",
            "review_content": "\nEric Foner seems to be in love with himself.  And so seems everybody else, which makes this class even less of a tolerable experience.  I learned a total of three things:\n1.) that no one can really agree on what slavery means in terms of America's historical experience.\n2.) that Eric Foner uses this class as an excuse to show off and radiate his self-appointed, undisputed authority at every moment.\n3.) that plenty of Columbians who get really worked up over racial and social issues that don't always seem especially pressing have no problem [CULPA censor] with the fact that our enormous load of reading does not feature a single female writer\nWorkload:\noppressive, should you choose to actually do it, which is unnecessary\n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "May 08, 2006",
            "review_content": "\nI wasn't really sure what to think of him at first, I hate it when people obsess over popular professors, but I have to say that in the end I think he is in fact one of the better professors I have had at Columbia. He spends the beginning of class connecting history with the current news and then goes through with his lectures often citing historiography and providing interesting tangential tidbits while giving rather broad overviews of topics. At first I thought there wasn't much you could get out of his lectures that wasn't in textbooks or hadn't been said before but then I realized the way he treats historiography, addresses topics and presents his own views and arguments subtlely is actually quite impressive. It also must be noted that he perhaps influenced much of the knowledge we have on some of these topics himself to begin with. I have to give him credit that I never really once was bored in his class despite a few what would seem to be dry and what should have become repetitive topics. He truly is a great professor and historian who is not overwhelmed by his own ego (as many highly-rated professors are) and can be understood by a student with a casual interest in history or a history major already familiar with much about the time period. If you think this period is boring, you should still consider this class because I expected to be a dull period and it has now actually become one of my favorites. He does a great job of choosing books and lecture topics.\nWorkload:\nAbout 150 pages of reading per week but it all seems to be quite useful and interesting material if you are into history. A 10-12 page historiography paper which requires you to read two extra books but is relatively straight forward. A midterm with a choice of some pretty general essay topics and final with some primary source quote IDs and separate choices for two essays which you will not have seen beforehand. Guess grading depends on the TA but the material wasn't particularly hard and the TAs seemed to grade quite fairly. \n"
        },
        {
            "course_name": "The Radical Tradition in America",
            "review_date": "March 04, 2006",
            "review_content": "\nDefinitely an engaging an humorous lecturer. I agree that he really demonstrates the complexities of history without romanticizing, as some professors tend to do when they're teaching on subjects they feel strongly about. While you may find some of the radical movements more boring than others, the class provides a good overview and still allows you to examine those you find interesting in more depth.\nSince Prof. Foner assigns all the TA's in the department, he naturally kept the most outstanding for himself. The discussion section for this class was the only productive section i've had in my three years here; Courtney was really good at focusing the discussing and leading us to draw connections between the movements.\nWorkload:\nHeavy reading (though you can skim the stuff that doesn't really interest you and draw on lecture notes for exams), one paper, midterm & final, fairly graded; a short presentation in discussion section on a movement of your choice. \n"
        },
        {
            "course_name": "Civil War and Reconstruction",
            "review_date": "November 24, 2005",
            "review_content": "\nNot so fast! I read the previous reviews. I can understand their awe, but can't agree with it. I am a histroy major who took foner three times, so I feel qualified to criticize him.\nFoner is obviously well aware of all the facts and the streams in U.S. history. If you read his books, it is easy to discern that he is of the radical wing of the progesssive side of issues. if you only take his class, however, Foner tends to present the consensus (read: bland and less controversial than a scintilliating course should be) approach to crucial historical controversies. He takes himself very seriously, lecturing as if he is giving a sermon, and Foner is not always immune to self-aggrandizement.\n"
        },
        {
            "course_name": "U.S. in the Era of Civil War and Reconstruction",
            "review_date": "May 29, 2004",
            "review_content": "\nFantastic.\n"
        },
        {
            "course_name": "U.S. in the Era of Civil War and Reconstruction",
            "review_date": "May 13, 2004",
            "review_content": "\nI could not possibly do justice to how good this class is in writing.  There is no better lecturer at Columbia, or anywhere, and Foner is the leading scholar in his field.  You simply cannot give up the opportunity to take every possible class from him.  I'll just say this: he got about 3 straight minutes of applause at the end of the last class.  He's just unmatched.\nWorkload:\nLots of reading, worth it, good stuff, midterm, final, one 10-12 page paper comparing two works of history on a similar topic--ends up being a pretty interesting little exercise.\n"
        },
        {
            "course_name": "U.S. in the Era of Civil War and Reconstruction",
            "review_date": "May 07, 2004",
            "review_content": "\nIf you are a history major, this class will be a breeze. Foner, a great writer and important scholar, caters to the absolutely lowest common denominator in his lectures, which means you can skip them if you either know something about the time period or plan on doing the reading, which is substantial. The advantage to taking this class from a history major's perspective is being able to read the books on the list (some of which are skippable) and being able to go to his office hours. The great disappointment is that all of his lectures on Reconstruction, his specialty, come straight out of his book, which you can read on your own instead of listening to him read to you. The other students in the class are mostly non-history majors who don't do the reading and think he's an amazing lecturer because he's got a little personality and tells them things they should already know. If you want your money's worth, do the reading and pick his brain during office hours so that you can do more interesting things during class time. \nWorkload:\nA bunch of worthwhile reading (150-200 pages a week), a midterm which doesn't really count, a 10-12 page paper which requires you to read two books outside of the curriculum (very time-consuming), and a final which counts for a big part of your grade. Discussion section will be tedious if you don't do the reading and since you'll be graded by your TA anyway, make a point of showing up and having something interesting to say.\n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "June 18, 2003",
            "review_content": "\nWOW. Eric Foner is brilliant, dynamic, enthusiastic, one of the best speakers I've had the privilege of listening to. I'm usually not a fan of early American history but he makes it so interesting and relevant. I'm proud to tell people that he was my teacher. Don't graduate Columbia without taking one of Foner's classes!\nWorkload:\na lot of reading (most of the books are practically dedicated to him--and rightfully so), midterm, final, paper, discussion section...all manageable. TAs are really helpful.\n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "May 13, 2003",
            "review_content": "\nEric Foner is the world's leading scholar on Reconstruction. And he's not too shabby with 1800-1850 either. He is a tremendous lecturer, his TAs are the best in the department, and his students are genuinely interested in history. He is funny, brilliant, laid back.  Any class he teaches, you should take, because teachers like Eric Foner are the reasons that we came to Columbia. Don't miss it.\nWorkload:\nLots of reading. You must, and should, do it. One 10-12 page historiography paper. Midterm that doesn't really count. Final that really does. Everything is worth it.\n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "May 10, 2003",
            "review_content": "\nFoner is an amazing, brilliant lecturer. He is very clear. By far the clearest and most organized thinker I've encountered so far here. He has a huge amount of material before him and goes through it in a very logical, sound way. He develops very important historical themes as he does this, themes about republicanism, abolitionism and others. Really goes into the ideas behind history, while detailing the events. He makes sense of everything.\nWorkload:\nConsiderable. If you do the readings, you are amazing. 250 pages a week, easy. And it's not like reading Sports Illustrated. Discussion is a must if you want to understand the readings. 10-12 page paper comparing 2 books on the same historical subject. wasn't too bad. i chose 2 shorter works (combined about 300 pages), so I was able to go into detail about everything and really focus on my essay, not mainly on spending days and days reading. Paper due near the end of the semester. Midterm ,Final.Difficult essay questions. Midterm pick 1/3. Final pick 2/4. Final also includes IDs. Difficult exams requiring much  substantive thought.\n"
        },
        {
            "course_name": "The Radical Tradition in America",
            "review_date": "December 25, 2002",
            "review_content": "\nobviously knows a lot about the subject. reasonably interesting, generally organized. i got bored with some of the focus on labor history, and is general danger of thinking the radicals are mainstream, but thats the nature of the class. in general, good course.\nWorkload:\nlot of reading, don't have to do all of it. midterm, paper, final.\n"
        },
        {
            "course_name": "The Radical Tradition in America",
            "review_date": "May 06, 2002",
            "review_content": "\nFoner is easily the most engaging and hilarious lecturer in the history department. but contrary to what one might think having heard about his political leanings, the class is not leftist dogma at all. Foner's lecturers are full of subtletities that in fact show you that history is too complex to be described and summarized with simple labels. It's as much a study of the practice of history itself. Foner shows you various radical movements strengths and weaknesses, too, and doesn't overromantacize needlessly. Oh, yeah -- he's also awake, alive, and obviously well-prepared and very open and tolerant of people's ideas and questions. Can't say that about some of my other profs. Incredible.\nWorkload:\na paper, two finals\n"
        },
        {
            "course_name": "The Radical Tradition in America",
            "review_date": "April 29, 2002",
            "review_content": "\nWARNING TO ALL FRESHMEN AND SOPHOMORES: The class is comprised mostly by junior and senior history and english majors. I would not recommend that one begin a history major with this course. Although it is a survey course, the lectures assume that the student already has a pretty thorough background. The T.A. sections are mandatory- and are generally used to discuss readings. Although the lectures are not too difficult to follow, the weekly readings are! They are long and time consuming. Furthermore, they are a crucial part of the class because they supplement the lectures. In general, however, the course gets across one major point: history is complicated. And if youre not coming in with a solid background, youll leave this course a mighty fine dabbler, at best. Prof Foner, I might add, is brilliant, and accessible. He is extremely funny and sarcastic and has the class laughing out loud.\nWorkload:\nweekly readings of about 75-150 pages... very detailed... one midterm which the T.A.s grade a bit harshly, and one final. there is also a paper, 8-10 pgs. \n"
        },
        {
            "course_name": "The Radical Tradition in America",
            "review_date": "December 31, 1999",
            "review_content": "\nTo quote Flavor Flav, believe the hype. Foner really is is an amazing historian, an engaging lecturer and one of the best writers in the academic world today. He is also funny as hell, armed with the self-deprecating humor of a white opener on Russell Simmons. Some find his Radical Tradition in American Politics course to be a bit scatterbrained, but the bottom line is, if he is teaching a lecture this semester, take it. And if the course is full, sit in on it anyway.\nWorkload:\n2 Papers, Midterm & Final exam.\n"
        },
        {
            "course_name": "U.S. in the Era of Slavery and Jacksonian Democracy",
            "review_date": "December 31, 1999",
            "review_content": "\nMore people have read Eric Foner's version of American History than any other historian's, since he consulted for an attraction in Disneyworld. In keeping with the theme of history for the masses, he's got major leftist roots. In addition, legend has it that Foner's great grandparents indirectly caused the Russian Revolution by booting Trotsky out of their Lower East Side apartment, the impetus for that rabblerouser's return to Russia. Foner peppers his lectures with anecdotes, some of which are relevant and all of which are amusing. Lectures often summarize the readings but don't engage them in a meaningful way. Civil War & Reconstruction Class is supposedly a lot better than Jacksonian Democracy class.\n"
        },
        {
            "course_name": "The Radical Tradition In America",
            "review_date": "December 31, 1999",
            "review_content": "\nOnce again, an overrated class. Foner is a clear, articulate and concise lecturer, but I do not feel that he has the passion for this course that I would expect him to have. The readings areinformative, as are the small discussion groups.\nWorkload:\nI gained a lot from the required paper, which was a comprehensive examination of a radical figure in American history. The other requirement was a final.\n"
        },
        {
            "course_name": "The Radical Tradition In America",
            "review_date": "December 31, 1999",
            "review_content": "\nfoner is the history department's most popular lecturer and it is no surprise why. he is incredibly engaging, charismatic, and very intelligent. this class is essentially a history of labor struggle, and also emphasis on the abolitionist movement in the 1840s-60s, women's suffrage, and civil rights in 1950s and 60s. he makes subtle points and slight nuances very accessible and uses them to enrich what could be a simplistic chronology of an infrequently taught history of the united states. foner is clearly to the left of the center, but is neither dogmatic nor uncritical of that side of politics. he is an expecially excellent teacher of the study of history, i.e. he will point how the study of certain events has been slanted in the past for some agenda. in this sense the history class is a critique of the entire discipline of history. some of my classmate were dissappointed there wasn't a more extensive history of black-american radicalism. reading is generally about half of a history text per-week, and how strictly that is enforced depends on the t.a. of your madatory discussion section that meets for an hour once a week. handed in work includes an in-class mid-term, final, and an aditional paper.\n"
        }
    ]
}