{
    "prof_info": [
        {
            "prof_name": "Soulaymane Kachani",
            "prof_id": 2319,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Operations Consulting",
            "review_date": "September 04, 2012",
            "review_content": "\nOperations Consulting is a different course from the standard IEOR fare - you get put in teams and work on a consulting project (or in our case, two projects) with an external company. The course runs to two semesters. I found the course to be a mixed bag - while I enjoyed working with my teammates, and became good friends with them, Kachani as a professor left much to be desired.\nWhen you start at MS&E;, in fact at IEOR, Kachani is often introduced as this superstar professor, McKinsey etc. Trust me, he reintroduces himself many times over during Ops Consulting. Most of his lectures are filled with long monologues about his experience as a consultant, how he always succeeds without never really trying (ask someone about how he got the McKinsey!).  Most \"discussions\" are limited to shooting down all responses, and him coming up with some ridiculous solution to the problem. \"What is Harvard?\".....(strange looks and confusion)....\"It is a hedge fund. Now, you are welcome to disagree with me, but you would be wrong.\" \nThough I found the lectures pure torture, and mostly just tried to stay awake, my team did a good job on both our projects, and I ended up with a not-so-bad grade, middle of the pack among my team. (Grades are based almost entirely on what your teammates grade you). He likes the European students, and clearly shows a preference, so I guess that might have helped me a bit! Phew! Never again.\nWorkload:\nWorkload is more in the Spring than Fall, about as much as one course and a half, with some extra mental agony. Grading is fairly easy.\n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "January 09, 2011",
            "review_content": "\nThis course was co-taught by professors Kachani and Sadighian. Kachani was fast-paced and more interesting to listen to. Sadighian was much more textbook, much slower paced, and always (annoyingly) waited to hear a verbal \"yes\" from the students before moving on. The lecture slides were online, but incomplete; you have to go to class to fill in the gaps.\nThe course itself starts as a review of Accounting and Finance, and then moves into a broad array of other topics, like cash flow, beta valuation, and project valuation. The course as a whole didn't really have a coherent feel to it at all; the topics felt sort of medley. Some topics were heavily tested, otherwise were taught and never seen again, neither on homework nor on exams.\nBetween two professors teaching two sections (undergraduate and graduate), there were 13 TAs. There's a near constant office hour Monday through Thursday, which is pretty helpful. Also, TAs are required to respond to e-mails quickly.\nThe problem sets were mostly based on the material in the books, so having the books were most helpful in completing the problem sets. Students were allowed formula sheets during exams, which was a godsend. It's basically impossible to finish the exam in time, but they're designed such that the average is incredibly low (and weighted to an A-).\n10% of the exams are based on current events, so chances are you'll come out of this class with a heavily discounted subscription to the Wall Street Journal.\nWorkload:\n4 problem sets, given at least two weeks in advance\n1 3-hour midterm\n1 non-cumulative final\nParticipation points\n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "January 08, 2011",
            "review_content": "\nThis is more a review of Industrial Economics more so than a review of Kachani. As many students know, this class was co-taught by Kachani and Sadighian, which was definitely for the worse. I can agree that Kachani comes off as arrogant and while he is successful in business, there are smarter, more capable, and humbler members of the IEOR faculty. However, Kachani has historically cared about the class, what students learn, how the TA's grade, and whether people cheat. (Whether he cared in 2010 is debatable given he barely taught)\nThe material in the class is mostly unnecessary. It's a review of Accounting and Finance for the first quarter, then cash flow analysis (to the point of being too quantitative to be useful), then project balances, and mathematical programming for budget allocation. Sadighian taught most of this material and is not a capable teacher. He butchered all the material he taught, which meant that most of the class had no idea what to do unless they struggled through the homework. The exams were long and difficult but with the curve were fairly easy. \nOverall, this class was a waste of time and I learned very little coming out. Kachani was definitely an entertaining lecturer who taught the material better so I hope that Sadighian either improves his teaching or steps aside. Regardless, it's a requirement in the IEOR department so this serves as a warning for non-IEOR students. This class was a waste of credits and time. It was a grade booster at the end of the day so I can't complain, but I wonder many times why I pay for this crap education.\nWorkload:\n1) 4-5 Problem Sets which take 6-12 hours. It teaches the material well but borders on impossible given the level of teaching.\n2) 1 three hour midterm. Curved well but difficult and long\n3) Final. Easier and much more straightforward than the midterm. This was due to the fact that Kachani realized no student understood the material.\n\n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "November 22, 2010",
            "review_content": "\nSoulaymane Kachani is certainly an interesting member of the IEOR department. Initially, it is likely that you will be impressed with Kachani's style, largely because of his intimidation techniques and ability to indirectly praise himself so as to appear to be the most intelligent person on the planet. Kachani teaches an 'engineering' version of corporate finance, and the class is not bad and the grading is fair, often inflated. If you do the work, which tends to be heavy in terms of problem sets and a massive exam that often people do not finish, you will walk away with a good grade; at least a B+. However, you should be aware that there are plenty of options for taking corporate finance at Columbia without the egotistical self promotion that Kachani masks by his disingenuous care for students. It is no doubt Kachani is an accomplished academic with great practical work experience from McKinsey, however his brash and often not well thought out advice and opinions can often mis lead students who only realize later the folly of , revering him as IEOR's most brilliant, because there are plenty other professors who do not present with the same flair as Kachani but have as much if not more to offer students willing to dig a little deeper and go the extra step. \nWorkload:\nSometimes heavy but grading is fair often inflated due to self promotion. \n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "March 11, 2009",
            "review_content": "\nI liked Professor Kachani's style, but I can understand how it does not mesh with everyone.  He can come off as unforgiving, but I don't know him well enough to support that with any facts.  The class was very well prepared and obviously in an area of Kachani's expertise.  He showed us how to use methods we've already learned in other classes and apply them to financial problems.  He's a pretty busy person, so try to grab him right after class if you have any questions.\nWorkload:\nThe exams were ridiculously hard, I was actually afraid of failing and somehow rolled off with a good grade; I am not often that much mistaken by grading scales.\n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "January 26, 2009",
            "review_content": "\nI think he is pretty much the best professor in IEOR department. If anyone thinks that his Industrial Econ is more complicated than reality, he or she is totally right. \nBut the thing is that if you feel the math in this class is hard, you will almost fail in all other IEOR classes. I think the quantitative part is surely very lovely. \nHe has sense of humor, a very good one. He has more charm than all the other IEOR guys combined. I totally love him. My affection for him basically offsets my innate hatred for the French. yeah, he is French. oh--- yeahh..\nWhat I learned from this class has been impressive in my finance interviews. \nWorkload:\ni forgot, once a week meeting with lovely professor is very reasonable. in other IEOR courses, you need to see a bald guy twice a week. hw is fine, easy to get from friends as his class is always big. midterm is prehistorical, final is fine. Overally fair. \n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "October 17, 2007",
            "review_content": "\n  Ok, I actually work in wall st, and so I'm not fooled by his pretentions regarding the suitability of his style:  if you have a toolish nature, you will enjoy this course.  If you do real work with real money, you will end up doing it \"your own way\" or however your firm/fund does it:  his methods are obfuscated and he makes everything more complicated than it needs to be.\n  Yes, it is the McKinsey way, because he clearly needs to bill by the hour considering how belabors and obfuscates the material!\n  He deprecates the bschool way of doing finance, but guess what:  it's how real work is done!  Who uses a Z-transform to compute present-values???\n  That said, I think Kachani would make a great drinking buddy.\nWorkload:\n  annoying...  just annoying!!!\n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "January 24, 2006",
            "review_content": "\nArguably the most useful class you'll take as an engineer--especially if you are interested in anything related to finance and/or consulting. Kachani is an excellent teacher, though he may be intimidating at times because of his disclaimers (e.g. \"Pay close attention because in the next 20 minutes, I will lose over half of you. So try to be in the other half\"). Either way, I really enjoyed this course and found it practical, interesting, and very useful. If you put in a fair amount of effort, you should get at least an A-. Kachani had won a distinguished faculty award, and after taking this course, I think it is well deserved.\nWorkload:\nVery reasonable. 6 problem sets (a few were long) (25%). Midterm (30%). Final (35%). Class Participation (10%).\n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "January 01, 2006",
            "review_content": "\nThis class is helpful for students who would like to go into finance or consulting.  It is basically \"McKinsey 101,\" as Kachani tells you that he is teaching everything the McKinsey way.  The course material is fairly interesting if you are into that stuff.  Kachani himself is very arrogant.  He has 4 TA's though who were very good to work with.  He also curves the class pretty high. \nWorkload:\n5 problem sets.  1 midterm and final.  Make sure you go to multiple TA office hours for each ps and you'll be fine.  HW is 25%.  Midterm and Final were very hard but they were made up by the TA, not Kachani.  Curve was high though. \n"
        },
        {
            "course_name": "Logistics and Transportation Management",
            "review_date": "May 01, 2005",
            "review_content": "\nKachani teaches this class like his others. He is very knowledgable about the field and goes into very technical topics for a few lectures. The rest of the semester is more qualitative. Its a pretty difficult course, so only take it if you're interested in very technical material and doing a lot of work.\nWorkload:\nTwo long hw assignments, take home midterm which is killer, and project due at the end of semester with presentation\n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "December 26, 2004",
            "review_content": "\nClass is very well organized and interesting. He packs a lot of information into the lectures so pay attention. Overall, good class if you're interested in corporate finance\nWorkload:\nHomeworks take a very long time so start early. Midterm was very easy but final exam was ridiculously hard. A mean of 50/120, so go figure. Study A LOT for it. In the end though, he is very fair with grading\n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "December 24, 2004",
            "review_content": "\nProfessor Kachani is organized, friendly, approacable, and very enthusiastic.  Some of the materials seemed very interesting, but this course basically tries to cover too much materials without trying to go deep into any of the topics. Midterm was quite easy, but finals was a real killer. Make sure you study a lot for the finals, and DO the optional homework.  \nWorkload:\nFair. 6 problem sets. Midterm/finals.  Grading is also very fair. \n"
        }
    ]
}