{
    "prof_info": [
        {
            "prof_name": "Robert Mawhinney",
            "prof_id": 3142,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Scientific Computing",
            "review_date": "May 10, 2015",
            "review_content": "\nDon't take this class. Mawhinney's impression in class is that of someone that cares a lot about the subject and is overall responsible.  Too bad that's not the case.  He takes about a week to get any given problem set out, which has its ups and downs. It probably led to larger problem sets, but the guy intended to give us 8 to 10 projects (each of the ones we DID have took 10-20 hours).  The problem sets are riddled with typos that, if called out on, he'll duly ignore. He doesn't respond to emails or show up to office hours despite urging everyone to come to him for help.  \nHe doesn't teach anyone to code, which, although I came in pretty good at it, defeats part of the purpose of this course.  He has short recitations on Fridays that give you a crash course in C that showed up scarcely on two of the problem sets.  His lectures are decent, but the content has nothing to do with the work you're expected to do.  He gives you a week or less to code something, which isn't kosher for gigantic programming projects.  The problem sets, aside from the typos, are loaded with ambiguity as to what to do.  The best parts are when he's flat out wrong as in the fourth and fifth one where he makes erroneous assumptions about the calculation of energy or giving you an algorithm for symmetric matrices to run on matrices that aren't symmetric.  When approached with some questions about the last problem set, he flat out admitted he didn't do his own problem set and that a lot of the assumptions he made as to how to do it didn't hold up.  On top of that, it was about PDE's and he didn't teach us anything about how to handle boundary conditions.\nThe icing on the cake is that he gave us a problem set due in the middle of reading week. The day after, he gave us a \"cumulative\" final programming project that was about one topic, and it was something that he didn't talk about at all in the class and that took ~15-20 hours during finals week.  \nFlat out the worst class I ever took in the department. I'm sure his 4081 class, given the 5 undergrads still in this 4080 class, will be a raging success next year.\nWorkload:\nA lot. 5 projects though, now that he has ours written up, he'll probably hit his 8-10 mark. About 20 hours each.  Final project about the same length assigned during reading week and due during finals week. \n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "January 07, 2013",
            "review_content": "\nThis is my first time to review a course/professor here but I'll try to be objective.\nProf. Mawhinney is kind/nice and he is willing to answer your questions during/after each lecture. However, I have to say he did not seem to care about how well students followed his lecture. At the beginning of the semester, he mentioned the topics we were going to learn would be conceptual and might be difficult to follow. You know Einstein's Special Relativity and Quantum Mechanics are one of the most difficult subjects in Intro level of science courses. However, his class is more than that. His lectures are full of mathmetics, such as extremely complicated integrals, Fourier Transforms, and  trigonometry, which is certainly useful if you are going to study advanced physics courses. But this is a 1400 level course and the title of this course is \"INTRODUCTION to wave......\", and I think that this course is NOT supposed to be that hard. You have the Halliday's textbook from last two semesters and this was also our official textbook. However, unfortunately, this professor did not teach along with the textbook. It is helpful if you read the book and solve the problems in the book. I actually felt the book was quite great in terms of describing somewhat complicated Einstein's theory and Quantum physics. I found myself being interested in those topics because the textbook was quite straightforward and easy to read. However, as I said, professor Mawhinney made everything difficult, even more complicated. I believe he taught Fourier Transform, which you could not find in the textbook, in 1/3 or more of his lectures, and it was on the midterms, and the final.\nWe had 2 in-class midterms and a cumulative final exam. The first midterm was OK(average 70s) but guess what? The average of the Exam ll was around 30 out of 100. I was shocked the average could be that low in an Intro level of course. What's more, the second midterm was one month before the final exam and he let us know the average of the exma ll right before the final exam. No one had known how class performed in that exam. I expected he mentioned something. (why the mean was so low, whether the exam was too difficult, or what we should do for better performance). But he said nothing about the exam ll. The only thing he mentioned was we could drop one midterm.\nWe were supposed to be assinged weekly problem sets. But it turned out we had 9 problem sets due to several reasons. He posts the problem set on CourseWorks. But he did not do it regularly. For example, if he said in Monday's lecture that homework would be posted shortly and it is due Friday, you had to wait for the problem set to be posted until like Tuesday night or Wednesday morning. I'm not exaggerating. That happened many times. He is too busy to take care of the course? I usually make a study-plan each week, but due to this course my schedule was often messed up.\nFinally, today is 3 weeks after the final exam, but we are still waiting for the final grade. \nWorkload:\nWeekly Problem Sets.\n2 Midterms and a cumulative final.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "November 14, 2007",
            "review_content": "\nMawhinney is friendly and will answer your questions, but usually spends most of the lesson explaining how to derive the Physics formulas, than how to use them. \nThe pace of the class is fast, but maybe because I had no prior knowledge in Physics from High School. \nThe midterms are hard, but he curves generously.\nWorkload:\nWeekly difficult 10-Question problem sets, 2 Midterms, 1 Final\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "February 04, 2007",
            "review_content": "\nThis is one of the hardest undegraduate class because of contents. Nobody should try this unless he is prepared to take the challenge. There is no doubt about Professor Mawhinney. He knows the stuff very well. He explains things very well and gives you enough time to discuss after  class or in his office hours. Exams are hard as it should be for this course. However, it would be better for students if he could made up problems like midterms or finals in his weekly homework problems. The best thing is he makes sure everybody gets his / her grades based on her work as well as conceptions on materials.\nWorkload:\nNo that much, but the midterms and finals are very hard.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "January 09, 2007",
            "review_content": "\nHis lectures follow straight from the text, of which is not terrific.  He does make the material more understandable than the text does and his lectures are simple and straightforward with less material than the text.  He is a good instructor and will answer your questions for the most part and cooperate if you are having trouble.  The homeworks are challenging, as should be, but can be completed satisfactorily if you put in the time, especially in a group.  The worst part, which is a total downer, is that I found his two midterms and final were for the most part out of left-field.  They just didn't seem to match the level of course material presented in the lectures or the problems on the homeworks.  That being said, if you work hard enough, you should be able to earn the representative grade that you deserve.  \nWorkload:\nChallenging weekly problem sets, two difficult midterms (3-4 problems) and a difficult final (somewhere around 5 problems).  I suggest reading the text as you go over the material during the semester, always.\n"
        }
    ]
}