{
    "prof_info": [
        {
            "prof_name": "David Johnston",
            "prof_id": 753,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 21, 2015",
            "review_content": "\nA great professor for CC, and I was lucky to have him for a term.  He's very knowledgable about a lot of the books, and I especially loved our classes on Hobbes and Locke (he is less knowledgeable about Al Ghazali and the Qur'an).\nHe is full of himself and he knows it, and he tells us the most interesting, sometimes hilarious stories about his life.  My biggest complaint would be that sometimes he would follow a student's point on a tangent for a very long time and it frustrated me that it seemed like we'd gotten nowhere, really.  But generally he was able to keep conversations interesting and focused on the stuff that he prepared.\nThe essays are graded fairly.  He likes for you to be succint and not include lots of fluff.  Every sentence should have a purpose in the essay.  It's great to learn to write like this.  The essay prompts are short, just a couple of sentences each, all based on the texts.  But they are not often straightforward, and for CC essays you really should think through your points before starting to write. They are on the short end (1200-1500 words).\nIf you have him for your professor, I would definitely keep the class!  I certainly had a great CC experience.\nWorkload:\n3 essays 1200-1500 words each, and a pretty straightforward midterm and final.  The exams were all short answer questions, had options, and covered what we discussed in class. \n"
        },
        {
            "course_name": "Justice",
            "review_date": "July 02, 2014",
            "review_content": "\nI took Justice with Prof. Johnston in Spring 2014 and absolutely loved the class - Johnston is articulate, well organized, highly engaging, and offered excellent guidance as we navigated challenging readings and political theories. I highly, highly recommend this course to any student but especially ones considering a Political Science major or concentration - Johnston's class is what convinced me of a political science major. The class, especially the readings, are not easy - Johnston expects but does not require that students have some base knowledge of Locke, Hobbes, etc - and uses their theories as a basis for the classes' readings which include Mill, Kant, Nozick, Rawls, Nino, etc. The optional TA sessions, however, were incredibly productive in helping clear up the topic material and the frequently convoluted but engaging writings. My TA, who I HIGHLY recommend, was Rob Goodman, and he offered excellent insight into what the authors were actually saying and what topics it related to. Overall, the class focused on some fascinating and highly controversial themes in our legal system today - the right of international rescue, abortion, female surrogacy, torture, etc. The papers, while graded critically, often focused on these same problems - one absolutely excellent topic discussed whether prostitution, in theory, is ever actually just. If you like engaging with political theory and enjoy a highly articulate, organized and accomplished professor accompanied by helpful TAs, I highly recommend this course! Justice was the best class I've taken so far at Columbia. \nWorkload:\nAbout two 60-80pg readings a week and 1 3-4 page paper every 3 weeks. The TAs varied in quality and difficulty but the papers tended to be graded critically but with a lot of helpful commentary. No midterm. Final paper and in-class final exam (not too challenging if you understood at least 80% of the readings - the final exam included some reasonable multiple choice questions and then about 12 essays where you had more options of essays so could pick the ones that you liked).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 12, 2012",
            "review_content": "\nI'm slightly confused as to why Johnston doesn't have better reviews. http://www.youtube.com/watch?v=Z_FCFVJA0E8. For CC, he would definitely be one of the better professors to have considering that he knows his stuff. Especially for Machiavelli and Hobbes, he's written books on those guys. But for other areas like the Qur'an and Al-Gazhali, his knowledge could have been greater.\nBut like what others have said perviously, Johnston is very particular about how he wants his students to write their papers. No fluff, no repeating yourself, and generally no bullshit. Though it is annoying at first, concise and precise writing is a good skill and something students who like to make themselves look smart rather than actually write something smart could pick up anyway. \nWorkload:\nVery manageable. Does not add extra reading to the CC syllabus. 3 essays that should be no longer than 1500 words, regular short (1500-200 word) response papers to daily readings. And a very leniently graded midterm and final.   \n"
        },
        {
            "course_name": "Justice",
            "review_date": "May 24, 2011",
            "review_content": "\nThis was a fantastic class. I may still have some years to go at Columbia, but this is, and will definitely remain one of my favorite classes ever taken in college. I was attracted to this class mainly because of the interesting subject matter of the political theory of justice and I was not let down at all. For one thing, the readings were all very relevant and interesting (and for a Political Science class, thoroughly manageable), and were usually tied into the lectures and discussions. Professor Johnston was also a terrific lecturer - he was clear and concise in outlining the relevant material and arguments, bringing in external perspectives from the readings and elsewhere, while also giving us his own opinion, all without ever boring me in a single lecture. I really have to disagree with the negative CULPA reviews about his demeanor and manner of teaching, because he was always capable of engaging us intellectually in ways that never implied that his own opinions were the right ones, or only ones worth holding. He was also pleasant, kind and patient, and occasionally abruptly funny in ways that make you think, \"wait, did he really just say that?\", and also make you not regret coming to class that day. Luke, one of the TAs, was also really great - he was always swift in responding to emails and was generally adept in answering questions. \nI thought on the whole that the syllabus was well-structured, the readings interesting (though doing ALL the reading isn't really necessary), and the lectures were always fruitful. The 3 papers we had to do (4 assigned overall) were all very thought-provoking as well, inviting us to think more deeply about issues we had discussed, and to form our own personal opinions about issues in modern society pertaining to justice. Perhaps my greatest takeaway from this course is having the privilege of being introduced to John Rawls, whose theory of justice as fairness is now one of my favorite philosophical works. The module on domestic distributive justice was also the best one, in my opinion.\nI guess most people thinking about whether to take this course will want to know if it's easy, or if a good grade will come out of it. The answer is that it's sufficiently challenging that in order to get an A a fair bit of hard work will have to be put into it, but it's all worth it in the end. In general though, as long as you pay close attention in the lectures (really important for the final) and keep up somewhat consistently with the readings you'll do fine.\nAs a testament to how great this class was, I will admit that I've never taken a political theory class before, and as a (potential) political science major I've never considered political theory as one of my subfields. This class has completely changed my mind about that, as political theory will definitely be a subfield of my major. \nWorkload:\n3 short papers of 3-4 pages in length, worth 15% each. (only 2 of which need to be done, if you do all 3 the 2 with the highest grades are taken). 1 long final paper of 8-10 pages (30%), plus one final that covers the entire syllabus of the course (35%). \n"
        },
        {
            "course_name": "Justice",
            "review_date": "July 07, 2005",
            "review_content": "\nHis lectures were interesting.  I appreciated his availability.  However, all things considered, this is probably a good class for kiss-ups\n"
        },
        {
            "course_name": "Justice",
            "review_date": "June 30, 2005",
            "review_content": "\nI agree with all the reviewers on Prof. Johnston, both positive and negative. He certainly is all that is said about him. I think that he is one of those professors that you either love or despise -  you have to make up your own mind about him. I started off hating the class and the lectures and especially the arrogant and aloof TA's, who acted as if it was a bother everytime you asked them a question. I was particularly bothered by the fact that Professor Johnston had little patience for any ideas that could not be reconciled with his own, albeit well thought out theories of justice.\nAs the year went along I must confess I grew increasingly fond of him. Despite the imperial demeanour, he is very gentle and accomodating to the concerns of his students. \nHis comments on the papers can be biting, and you can either get annoyed with him, or swallow your pride as I did, and work much harder. He does have great passion for his subject which covers a multitude of flaws, at least in my mind. I will  always be grateful to him for introducing me via his lectures to John Rawls, who has since become my favorite philosopher. Overall, if you take the notes, and attend his lectures you can do well in this class, and leave with a great appreciation for the idea of justice.\nWorkload:\n3 short papers with one optional, and the lowest grade is dropped. There is a very passable mid term and finsl exam.\n"
        },
        {
            "course_name": "Justice",
            "review_date": "May 08, 2005",
            "review_content": "\nHis middle name is Chambliss.  That basically says it all.  Professor Johnston is one of the most pompous and arrogant professors I have ever encountered.  Yes, the workload is small for this class, but the midterm and final are just ridiculous- I think I spent more time on his final exam than I did thinking about which college to attend.  He regurgitates his lectures from notes which he randomly interjects his own theses into.  His awkward mumbling and sparatic southern drawl don't help him out any either.  Just avoid him, he makes even potentially interesting theories on political justice seem like death in an inescapable hour and fifteen mintues.  The sad thing is he has potential to be a great teacher, not just someone published in his precious Norton (which he'll make sure to inform you of.)  Good luck to you   \nWorkload:\n3 short papers, one of which was optional.  Midterm and final, do all the readings for them or get a friend to tell you every detail because Chambliss isn't cutting any corners, or planning on doing you any favors.\n"
        },
        {
            "course_name": "Justice",
            "review_date": "April 21, 2005",
            "review_content": "\nFrom the first day of class, I was put off by the fact that Professor Johnston was reading almost word-for-word from lecture notes.  Unfortunately, this continued through almost the entire semester.  Johnston has taught this class many times before, and therefore it is nothing new to him - his lectures suffer as a result.  They come across as very scripted and dull, with several humorous and interesting stretches sprinkled in between.   About papers: if you have a desire to be unique, or to challenge accepted concepts of justice or morality, then BEWARE - you will feel extremely stifled in this class.  Professor Johnston has a cookie-cutter image of what papers should look like, and he does his best to make everyone conform to this (quite dull) image.  He even passes out what I consider to be mediocre papers as examples after which he suggests everyone should model their own papers!  I appreciate that the professors and T.F.'s expect clear, well-constructed arguments, no matter what one is arguing, but the fact that they had such SPECIFIC views of what make \"good papers\" was disappointing for those who like to challenge themselves.  My T.F. marked down my grade because he thought my view was \"wrong,\" in his own words.  I was able to show him and the professor that my argument for what was in their opinion \"wrong\" was in fact quite clear and persuasive, and thereby was able to raise my grade on that paper, but the problem was endemic to most students' grades, from what I saw.  This class is not the worst class at Columbia, but the professor's confusion of \"writing a standard paper\" with \"writing an exceptional paper\" is quite nauseating.  I was able to get a good grade in this class only by suppressing any urge I had to become engaged with the topics and by forcing myself to regurgitate Johnston's own views.  If you think you are the type of person that may get frustrated from being expected to write and think a certain way, then avoid this class.  If you can handle being a cookie-cutter student for one semester (or letting your grade suffer), then take the class - the readings are quite interesting on their own.\nWorkload:\n3 short papers (graded using frustrating standards - see above), 1 long paper, a fairly easy midterm and final - fairly interesting readings (and you do not have to do all the readings to do well on the exams)\n"
        },
        {
            "course_name": "Justice",
            "review_date": "April 17, 2005",
            "review_content": "\nWhile the course is far from perfect, and Johnston certainly has a tendency to endlessly reiterate fairly simple points, no one can say that he is anything but clear. \nAlthough most of the readings are both informative and appropriate, there are certain issues which receive a fairly biased review, though as a whole the course is very reasonably balanced.\nOverall a good course, and very clear professor, though far from amazingly inspiring. Definitely recommended if youÂ’re interested in the topic.\nWorkload:\nThree 3-4 page papers, (drop one) , one 8-10 page paper, a midterm and a final. The papers are harshly graded, the exams not especially so. \n"
        },
        {
            "course_name": "Justice",
            "review_date": "June 20, 2004",
            "review_content": "\nThis was the most boring and definitely worst class I have taken at Columbia. Prof. Johnston is extremely knowledgable and nice, but his lectures will bore you to tears...also, he posts lecture notes on-line after each class which made me stop attending after the mid-term. The reading is interesting but I would say that I haven't learnt all that much in class-CC is doing a better job! Take the class if you don't want to do any work, don't want to attend lectures and still get an A/A-..\nWorkload:\n3 short papers (really annoying b/c harshly graded) 1 long-paper--incredibly easy midterm and final (just read the lecture notes!)\n"
        },
        {
            "course_name": "Justice",
            "review_date": "May 21, 2004",
            "review_content": "\nAlright so a lot of these reviews say stuff like...this was an amazing class blah blah I learned so much blah blah...\nI fell asleep every day in class because the material only made me think one thing, DUH! Ok I'll give the class one thing, the readings were interesting. But overall I thought this class was a waste of time. But if you are going to take it...make sure you have a good TA. \nWorkload:\n3 short papers that seemed pretty straight forward but were infact graded really harshly and a large paper that I have yet to see. Midterm and Final were easy but like I said before if you have a shitty TA you could get really screwed!\n"
        },
        {
            "course_name": "Justice",
            "review_date": "May 10, 2004",
            "review_content": "\nI really enjoyed this course - take it! The readings were not all neccesary, since he extrapolated the main points in lecture, but they're so interesting. Also, his teaching style is great --clear, effective, and always insightful. Another plus is that he posts lecture notes online which made studying for the final easy.\nWorkload:\nDealing with contemporary issues: abortion, surrogate motherhood, contracts, compensation, criminal punishment, racial inequality, homosexuality and war and peace. 3 3-5 pg papers and a longer final paper which are really cool -- he gives you this totally random scenario and asks you to construct an arguementative justice-oriented response to the situation. He gets you to think, he gets you to argue -- he just gets you. Aanyway - he drops the lowest grade, so even though they're graded on a rough-scale, that's easily compensated for. Also  a midterm, and this yr there was just a  20 multiple choice final exam due to the TA strike.\n"
        },
        {
            "course_name": "Justice",
            "review_date": "May 08, 2004",
            "review_content": "\nOne of the best classes I've taken at Columbia. Johnston not only clearly defines ideas and concepts in lecture, but posts the lecture notes (which are very extensive) online. The readings are interesting and original. You will learn a lot without doing a ridiculous amount of work. The reading list might look a little long, but everything is worth reading and valuable in almost any other class-- poli sci, philosophy, or sociology. HUGHLY recommened professor and class.\nWorkload:\nLight to Medium for a Poli Sci Class. three short papers, only two required. One longer paper on your personal philosophy that will pick your brain for sure. An easy in class midterm and final. Oh, and don't bother going to discussion sessions, they're worthless.\n"
        },
        {
            "course_name": "Justice",
            "review_date": "November 13, 2003",
            "review_content": "\nThis was one of the best classes I've taken at Columbia (I'm a senior now). I took the class in the Spring of my Sophomore year, so the theoretical readings on justice overlapped nicely with my CC reading. Johnston's lectures were amazingly organized and logical; each class was pretty much structured as a logical argument. If you paid attention in class, while just sitting there you pretty much learned the way to structure an argument and write a proper philosophy paper. The readings were extremely interesting since they dealt with current issues. The papers were on current issues as well, and were challenging yet fun to write, even though they weren't graded as easily as some people liked. If you paid attention in class you easily knew what he wanted in the papers (a logical argument in a similar structure to the way he teaches). The class taught me more about how to write than any Core class I've taken.\nAs for grading, I got B+'s on the papers and then probably aced the surprisingly easy final exam and ended up with an A in the class (and I was a sophomore). I think my transcript says there were 30% A's overall, so don't believe the people who think the class was harshy harshy graded.\nI liked the class so much that if i have the time next semester I'm going to go to the lectures just to sit and hear him teach. It was a wonderful educational experience, and I recommend it to everyone.\nWorkload:\nPapers, final. Just listen in class, do the reading, spend a proper amount of time on the papers and you'll be fine.\n"
        },
        {
            "course_name": "Justice",
            "review_date": "September 05, 2002",
            "review_content": "\nWhat a self-centered guy! This class should be called \"Prof. Johnston Speaks His Mind\" W3100y. His arrogance gets in the way of what would otherwise be an interesting class.\nWorkload:\nLots of inane paper topics and tought final/midterm.\n"
        },
        {
            "course_name": "Justice",
            "review_date": "September 03, 2002",
            "review_content": "\nJohnston was a perfectly fine professor. Although he certainly doesn't hesitate to integrate his theories on Justice into the course, I thought (while not agreeing with all of his theories) that he laid them out in a logical fashion and shouldn't be faulted for doing so. He was accessible after class ended and responsive to emails, although I never utilized his office hours. It utilizes some of the same readings as CC, however there is more of a contemporary emphasis on the readings, and considerably more contemporary readings are used. The final was not difficult, probably one of the easier ones that I have taken. The papers were graded harshly, and grades were largely based on the logic of the student's argument. Lecture notes were posted on the web and enabled you to determine what was important and made studying for the final considerably easier. Broad notes were also posted on the chalk board, although it was up to you to take more detailed notes during class. For these reasons, I would recommend this course, although not to someone who had not taken L & R.\nWorkload:\nOne 2 page paper, two 3-4 page papers, an 8-10 page paper and a final exam. A lot of reading.\n"
        },
        {
            "course_name": "Justice",
            "review_date": "May 20, 2002",
            "review_content": "\nI cannot disagree more with the other reviews. This class was amazing. Professor Johnston loved teaching it (which is rare at our fine institution), and his lectures were thoroughly interesting. Of course Johnston made arguments, and of course he thought his arguments were right. He had absolutely no problem when people disagreed with him, but let's be honest, he's been studying this stuff for his whole life, and he is entitled to his views. In terms of the goals of the class, Johnston succeded in teaching us a ton about justice. The readings were interesting (though long), and the papers were tough (and graded harshly), but interesting to write. More than anything else, Johnston taught a new way of thinking and looking at the world. This was a fantastic class.\nWorkload:\nLOTS of reading (60pp per class), 4 papers (graded harshly), and a final (EASY). A lot, but worth it.\n"
        },
        {
            "course_name": "Justice",
            "review_date": "May 20, 2002",
            "review_content": "\nI disagree with the reviews that cite David Johnston as a know-it-all, overbearing professor. On the contrary, he teaches one of the best poli sci lecture courses I've taken at Columbia. What makes his course interesting is that he doesn't just go over the material. He'll explain what he deems as necessary to the course, and the offer HIS insight. You can take it or leave it (as he says in the beginning of the course). But it's always interesting to see the opinion of someone who's been in the field so long and knows what he's talking about. \nWorkload:\nA LOT of reading. One written exercise, two short papers, one long paper, and a FINAL. The final is incredibly easy and no need to read all the reading material. Just study his lecture notes.\n"
        },
        {
            "course_name": "Justice",
            "review_date": "May 12, 2002",
            "review_content": "\nDo not let the great syllabus and reading list tempt you to take this class. The material covered is incredibly interesting, but the professor will manage either to bore you to tears or anger you beyond all belief with his overly-deliberate, self-centered lectures. He warns you that he will discuss various approaches to each controversial issue studied then explain HIS view of what Â“justice requires.Â” (He thinks his view is very important.) Much of each class is consumed by Â“discussion,Â” which of course is a joke in a lecture class of 100+ people. The worst part of the class was the way he expects you to write papers. Remember that 5th grade style, in which you begin Â“In this paper I will showÂ….Â”? Yeah, that one. If you have more patience than I do, perhaps you might enjoy the class for its great reading list, but beware.\nWorkload:\nOne 1-2 page paper, two 5-7 page papers, one 8-10 page paper, and a final. Lots of reading, but it is not necessary to do all of it.\n"
        },
        {
            "course_name": "Justice",
            "review_date": "April 28, 2002",
            "review_content": "\nIf you are interested in a professor who presents his opinion as fact and leaves room for idiotic comments from the same three people but not for genuine inquiries into his reasoning, then this is the class for you. Professor Johnston seems to think that his word is the word of God, and if you disagree with him he usually dismisses your comment outright. I thought this was going to be my favorite class from looking at the reading list, and it turned out to be awful. \nWorkload:\nPapers are graded very hard. Too much reading, but you don't have to read all of it to get by. \n"
        },
        {
            "course_name": "Justice",
            "review_date": "November 12, 2001",
            "review_content": "\nA thoroghly interesting class if the subject matter interests you. Begins with broad theories of morality, but the emphasis is on contemporary issues (e.g. abortion, death penalty, surrogate motherhood). Lectures follow the syllabus and are interesting and easy to follow. I highly recommend this class to anyone interested in how political theory and morality can actually be applied to modern issues.\n"
        }
    ]
}