{
    "prof_info": [
        {
            "prof_name": "Marlon Feld",
            "prof_id": 513,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Diatonic I & II",
            "review_date": "November 09, 2011",
            "review_content": "\nMarlon is a great guy -- very reasonable, approachable, and sweet. But I could not have been less prepared for Chromatic. I didn't even know what voice-leading was -- until I realized that it is what he refers to as \"blue-motions.\" We spend SO long talking about blue-motions, which makes absolutely no sense to anybody who didn't take this class with Feld. We also spent a month creating a four-voice setting to \"Oh, Canada\" and talking about how it made us feel. It was kind of fun, but given that I was supposed to be comfortable with figured bass and what not, not helpful at all. \nThis class is pretty easy, though, so if you're afraid of Park or Cohen, I guess Feld is your man. But be forewarned, Chromatic will be much more difficult if you take Diatonic with Feld.\nWorkload:\nReasonable -- short assignments, with a couple longer assignments that we do in stages/drafts. No reading ever.\n"
        },
        {
            "course_name": "Harmony and Counterpoint (Diatonic/Chromatic)",
            "review_date": "May 14, 2011",
            "review_content": "\nProfessor Feld definitely knows his stuff, but his very unique methods of teaching sometimes make it pretty hard for him to get that knowledge across to his students. In a lot of ways, his methods are actually quite helpful; he uses different colors to talk about different types of chords and techniques; the problem is, you'll finish the class knowing what \"red chords\" and \"blue motions\" are, but you won't know what they're called in the \"real world\" of music. I finished the year feeling like I would do fine in music theory if I were going on to have Professor Feld next year and beyond, but I'm rather worried that when I have someone who doesn't teach by Professor Feld's methods, I'll have no idea what's going on. We also spend way too much time in every class talking about how a piece we're looking at \"makes us feel,\" and that type of thing, while breezing over important theoretical concepts that deserve far more attention. Professor Feld, while very nice and at times quite funny, is also pretty awkward most of the time, and when he tried to illicit class discussion, there were inevitably a great deal of uncomfortable silences. That being said, I was generally not jealous of the people I knew in Cohen's and Park's classes, who were spending hours and hours and many all-nighters finishing their horribly long and tedious assignments, which I never had to do. Feld means well and tries his best, but you have to be ok with doing things his way. \nWorkload:\nOne medium-length assignment a week, or two weeks for a longer assignment. No midterm or final, but most of your assignments will receive a \"minimum grade\" and comments. At the end of the semester, you will redo all these assignments to improve the grade and receive the better grade as your grade on the assignment. Your final grade is the average of all your assignments' grades. The \"minimum grades\" assigned are ridiculously harsh and it is often hard to improve them significantly even if you redo the assignment according to all of his comments. \n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "December 23, 2010",
            "review_content": "\nProfessor Feld is a dedicated and straight forward professor. He is extremely detailed in his class lectures and makes sure that his students' questions are always answered. His method of teaching involves the use of colors, to facilitate the learning process and clarify the material. He always posts his lecture notes online, so that you have another source to learn from and he also has relevant homework assignments, which are corrected with comments for improvement. I recommend Feld for his clarity and playful attitude in class in combination with his ability to explain even the simplest of concepts in great detail. \nWorkload:\nOne assignment per week, assigned online before the weekend, due Monday class. Assignments directly correspond to class work. Comments are clear and detailed. \nFinal portfolio is the majority of the grade, which consists of four of the homework assignments redone, according to the comments, and a short (16 measure) minuet that is pre-approved and corrected before handing in the final draft. \n"
        },
        {
            "course_name": "V2318-V2319 Diatonic Harmony and Counterpoint",
            "review_date": "January 04, 2009",
            "review_content": "\nWhat a character. He certainly has his idiosyncrasies, but don't let that scare you. Marlon really knows his stuff and is happy to share the knowledge. He takes a potentially dreadful and confusing subject and presents it in a manner so crystal-clear and methodical that it seems to make perfect sense (mostly). His very organized and systematic way of running things almost takes some of the burden off of you. He also has a quirky sense of humor that makes class pretty fun. Although not particularly personable, Marlon is definitely a nice guy. He is a great choice for Diatonic, especially because he is the only instructor who does not require the $200 book set used by the department. As with most theory classes, grading is pretty firm - but Marlon's workload is lighter than other classes I've heard about (*cough* Cohen *cough*).\nWorkload:\nOne assignment a week, occasionally more or less. No midterm, no final. A final portfolio must be submitted at the end of the semester and is the primary basis for the grade.\n"
        },
        {
            "course_name": "Diatonic I and II",
            "review_date": "May 13, 2007",
            "review_content": "\nDon't be put off by his initial awkwardness: Marlon is a gifted pedagogue and a great guy.  Far be it from me to blame him for the awful experience I had in Diatonic this year.  Even with him, I don't see what possible benefit anyone could derive from taking the first year of the main music theory sequence.  The way theory is taught at Columbia is abominable; it seems that pedants like David Cohen have the entire department in their horrible thralldom, quashing any sort of original ideas anyone might have about music.  Case in point: Sebastian Currier was a musical genius, a recent winner of a prestigious $200,000 composition prize and a beloved Chromatic instructor who used his class to analyze real art.  He was denied tenure by the department, effectively forcing him out of the University.\nRather than focusing on analysis of actual music, the Diatonic syllabus wastes an entire year obsessing over, well, theoretical details that are either are exhaustively covered and irrelevant or superficially covered and relevant to the way music is put together.  I'm confident that a year of intensive theory can prepare anyone to analyze and understand almost anything ever composed, but the powers that be dictated that Marlon putter around in the teaching equivalent of a little tricycle.  During first semester, the first eight weeks were dedicated to Renaissance counterpoint and the last eight weeks were spent illustrating diatonic concepts that could have been learned in one or maybe two class sessions and reinforced in a much more productive way than listening to vomit-\ninducing minuets ad nauseam.  Second semester might have been even worse: the Renaissance stuff got more arcane and annoying, and the Diatonic stuff barely more complicated or compelling.  For both semesters, your grade on each assignment was based not on aesthetic value but on how well it followed really arbitrary rules - I still don't really know what my compositions sound like - which to me seems like the opposite of a working approach to a liberal arts education: individuality is severely limited, and unlike in English or Art History or Visual Arts classes, you learn nothing that you could apply to your own efforts to be an \"artist\" in life, unless you happen to enjoy composing in a very strict, renaissance-\nto-classical style.\nIn addition to the syllabus, the composition of the class was also responsible for how badly the year went.  It seemed to consist of kids who were able to pass the stupid entrance exam and absorb Fundamentals/\nCohenism as if it were the gospel, and some kids who knew theory and were fairly bored most of the time.  The size of the class was around twenty students, or somewhere in that weird purgatory between lecture and seminar, and accordingly Marlon's inspired attempts to engage the class ended up bearing as much resemblance to the Socratic method as Caesar's Palace does to Rome.  The class met elementary leading questions with an awkward silence, and so much time was spent on reductionist teaching methods for pieces that were already really simple (Mozart slow movements) that I wanted to stop coming to class.  But I couldn't, because attendance was compulsory.\nSo the misguided teaching methods (including the lack of continuity between Fundamentals and Diatonic) and the class's wide range of ability therefore created a situation that not even Marlon could salvage.  At the end of the year, hardly any friendships or connections had formed within our class, and it seemed that nobody had learned anything that they could reasonably apply to their musical hobby, much less their life in general.  If they had, then they could have learned much more through analyzing real music or playing an instrument or looking at scores.  If you must take Diatonic, then take it with Marlon, and if Marlon teaches a class other than Diatonic, especially in Broadway musicals (his area of expertise), I'd highly recommend taking it.  Stay away from the theory sequence, though, especially if you like music, and be forewarned that there's nothing to look forward to after Marlon.\nWorkload:\nNot too bad.  Weekly/biweekly exercises that are graded on completion and will help you do the three compositions per semester that comprise your entire grade and require a certain amount of fastidiousness to do well on.  Attendance was the most annoying part.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 01, 2005",
            "review_content": "\nIf you've got Feld for this class, consider yourself lucky!  I've heard horror stories about other music hum classes and was afraid to even register for this!  but, dude on class day ONE, I was totally relieved! \nUPSIDE:\nMarlon is so cool!  He's funny and quirky and makes class totally enjoyable.  His passion for classical music is obvious and he wants to instill in his students appreciation for all the little nuances that make a great piece of classical music, well, great!  His teaching style is easy going and laid back.  He peppers his classes with great, funny stories and he's an expert on all-things classical.  He is animated and will at times play stuff on the piano.  It's really quite impressive how knowledgeable he is.  I came away with a deeper understanding of the genius of classical music and a greater appreciation of the great composers who put these works together.  \nDOWNSIDE:\nThe music files you are expected to listen to are only available in you're on campus logged into a Columbia computer or by visiting the Music Library, which CAN be a  bit of a pain.  His TA was a bit annoying at times.\nOVERALL:\nCool teacher, great music, you'll enjoy this class............\nWorkload:\n\"Modules\" consisting of maybe 3 - 5 different music files you must listen to.  You should listen so that you're not lost when they are discussed at the next class.  Two SHORT quizzes consisting of listening to some music pieces and describing the name of the work and the composer (not too bad IF YOU LISTEN TO THE MUSIC FILES!!!!), two papers (one mid, one final) and one final exam for which you will be very well prepared thanks to Marlon.  He will tell you EXACTLY what material to study for and what he'll be looking for in the final!!  It doesn't get better than this!! \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 28, 2002",
            "review_content": "\nFeld's class isn't very hard and if you like music, especially classical, you will find this class pretty interesting. His class is not hard to do well in as he doesn't expect much, just try to act like you feel just as strongly for the music as he does. He strongly encourages class participation, and although it's not hard to get in a word every now and then, he somewhat nags the people that don't say much to also engage in discussion. But all in all, you can coast through this class and not do really anything for it and EASILY get a B, and if you write well you can easily get an A.\nWorkload:\nmaybe one small assignment once every 2 weeks that will take 10 minutes to do, 2 midlength papers and a little identification final. Not much work for the class\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 28, 2002",
            "review_content": "\nFeld's class isn't very hard and if you like music, especially classical, you will find this class pretty interesting. His class is not hard to do well in as he doesn't expect much, just try to act like you feel just as strongly for the music as he does. He strongly encourages class participation, and although it's not hard to get in a word every now and then, he somewhat nags the people that don't say much to also engage in discussion. But all in all, you can coast through this class and not do really anything for it and EASILY get a B, and if you write well you can easily get an A.\nWorkload:\nmaybe one small assignment once every 2 weeks that will take 10 minutes to do, 2 midlength papers and a little identification final. Not much work for the class\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 28, 2002",
            "review_content": "\nFeld's class isn't very hard and if you like music, especially classical, you will find this class pretty interesting. His class is not hard to do well in as he doesn't expect much, just try to act like you feel just as strongly for the music as he does. He strongly encourages class participation, and although it's not hard to get in a word every now and then, he somewhat nags the people that don't say much to also engage in discussion. But all in all, you can coast through this class and not do really anything for it and EASILY get a B, and if you write well you can easily get an A.\nWorkload:\nmaybe one small assignment once every 2 weeks that will take 10 minutes to do, 2 midlength papers and a little identification final. Not much work for the class\n"
        }
    ]
}