{
    "prof_info": [
        {
            "prof_name": "Jonathan Beller",
            "prof_id": 3534,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Contemporary Media Theory",
            "review_date": "May 17, 2009",
            "review_content": "\nThis is probably the only class I have ever taken that I would take again in a heartbeat.  After the first class, where about 25 people showed up, the room pared down to 10 of us, and it was incredible throughout!\nThe readings were fascinating and have been continuously important for me in my academic life, and everyone in the class was totally into the material and each other's comments, due mostly to Beller's incredible passion and kindness.  I actually wanted to do all the readings, and I looked forward to class.\nThough he's not terribly accessible (I had to walk with him to his office to discuss a paper topic and once had to call him at home to talk about a presentation because he's not often on campus,) I am totally obsessed.  Also, he doesn't put anything up on courseworks or email the syllabus, so hold on to it.\nWhile the workload is heavy, he is an incredibly easy grader.  I'm pretty sure everyone in the class got an A.\nWorkload:\nheavy-- lots of (probably non-essential, but it's enjoyable) reading each week, supposedly mandatory weekly postings, a 12 page midterm on, final project on topic and in medium of your choice.\n"
        },
        {
            "course_name": "A History of Criticism; Literary Theory",
            "review_date": "December 14, 2008",
            "review_content": "\nAmazing professor with the thickest lexicon around, Beller takes some getting used to, but his classes are always worth the effort.  You'll encounter no other like t/him!\nI've taken both his Women & Film course (really Feminist Theory & Film Theory: Transnational Perspectives) and his Literary Theory class (A History of Criticism), the latter of which being exceedingly challenging (700p novel first week, 165p of Marx another week - aerobic!).  Both have changed my world immensely (read: I am a different and better person for them).  He studied Fanon with Said, Jameson at Duke - he may just be the next theory superstar.  Besides, who doesn't dig a feminist male professor?  \nP.S. Barnard/Columbia's his side gig - Pratt's the full-time deal.\n\nWorkload:\nNot for the faint of heart!  Though the works reviewed are invaluable - best exposure!\n"
        }
    ]
}