{
    "prof_info": [
        {
            "prof_name": "Amy Bard",
            "prof_id": 1645,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "May 21, 2003",
            "review_content": "\nShe is a very good teacher who clearly knows a lot about the materials in the class.  You can send her drafts of the papers and she will give you comments, which is an invaluable boon. There are only two papers and an oral final, which is really nice as it is a twenty-minute conversation with the professor. The only problem is she can throw curveball questions at you that you can't really bs your way out of like if it was an essay question and you had an hour and a half to write an essay about it. Attendance is crucial. \nWorkload:\nTwo papers and an oral final. Lots and lots and lots of reading. \n"
        },
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "May 20, 2003",
            "review_content": "\nIf you're interested in old [for the most part] religious literature of South Asia and the Middle East, take this course. Bard, despite being blond-haired and blue-eyed, gives the impression of having lived in the subcontinent for a long time--any type of ethnic name, no matter what the ethnicity--instantly acquires an Indian accent.  She put together an extremely comprehensive syllabus, never required more reading than was necessary, although much of the literature was interesting enough that I didn't find myself counting page numbers, and overall conducted the seminar in an efficient and educational manner. The class is set up so that two students present the assigned reading for each week and lead a discussion. Bard holds a meeting with the students beforehand, so no one is forced to walk in struglling with the material. She interjects with helpful comments and good questions throughout the class, and overall the semester went very smoothly. Although the course was not inspirational, it was well run/taught, and the readings were great (plus I probably wouldn't have read them had it not been for the course). I'd definitely reccommend the class  because it was interesting and not overly-challenging. Caveat: She does not give a bathroom break in-between the two hours, so unless you want to interrupt class, go beforehand.\nWorkload:\nweekly readings, 2 5-7 page papers on the text and topic of your choice, and a final oral exam (It's a lot easier than you'd think)\n"
        }
    ]
}