{
    "prof_info": [
        {
            "prof_name": "Young Kim",
            "prof_id": 2986,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Probability 3000",
            "review_date": "May 26, 2016",
            "review_content": "\nHe sucks and dodges your questions. He has a heavy accent and does not speak clearly. I had to find online resources to learn this course.   \nWorkload:\n5 quizzes, homework every week. \n"
        },
        {
            "course_name": "Probability",
            "review_date": "July 11, 2013",
            "review_content": "\nThe guy is a sansei in teaching math.  Notes are perfectly organized and clear, the proofs are laid out so nicely with examples and everything.  He has a clever sense of humour that breaks up the mind f#*$ing curriculum.  Don't try to outsmart him, you will fail, nobody outsmarts Prof. Kim.\nThe Text by Ross is good, and can be used as backup if lectures are too hard to grasp. Make no mistake, this course is difficult, but I think he curved up grades slightly, still tough to get an A.  \nIn the beginning the pace of the class was fine, but then we were flying through the last few chapters.  He does give you an idea of what's expected of you to know for the exams,  but the grading was harsh and sometimes stupid, but that's on the TA's.  \nAll in all, based on pure teaching skills, he is one of the best if not the best lecturer I've come across.  He knows where students can get confused and dissects the essence of things.  He actually INTERACTS with the students, which is unheard of in this day and age, very socratic in his method, he will call on you and have you go to the board and attempt at a proof.  \nNot for the faint of heart, but if you wanna be a math samurai, enter into his dojo, only the honorable survive....\nWorkload:\nWeekly HW, and it's HARD.  Tons of problems and proofs.  \nFIVE EXAMS, which is nice since your risk is diversified, the exams are doable if you go to every class and study your notes carefully.  \nNO FINAL, not in the form of a cumulative one at least. \nEach exam requires at least 3 days of pain and suffering to prepare for battle.  Exams are not open notes/book,  you have to remember a lot in addition to being able to figure puzzles out during the exams.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "July 20, 2009",
            "review_content": "\nI am a post-bacc pre-med student, and I was very frustrated taking Professor Kim's summer 1211 class. While he is a nice man and a fine person, and I appreciate his ability and desire to know everyone's name, his spoken English was very simply a hindrance to his being accessible to someone with an abstract question about this very abstract branch of mathematics. Forget about asking theoretical questions about the topics, or using any decorative language or complex clauses in your questions to discern the general point behind certain statements and theorems. I found myself simplifying the questions I asked in order to accommodate him, when it is he who should be accommodating the students. There are certain expectations I have of a college professor that Professor Kim simply lacked.\nAfter two weeks in the class, it was also clear to me that he does not appreciate it when questions are asked during his lectures. This problem is compounded by the slow pace at which he moves through the verbiage of the material. He spends an inordinate amount of time writing definitions--in admittedly beautiful handwriting--on the board, and his asking students to read passages and definitions from the textbook serves no purpose in a college course. If he were to move through the material at a comparatively quicker pace, there would be more time for questions and further examples of tough topics so as to increase overall class comprehension of the material. Outwardly he seemed annoyed by students' questions, both during class and during office hours, which I believe is unacceptable from a Columbia University professor. Never have I felt such a palpable hesitancy in the air of the classroom on the part of the students to ask questions on account of a professor's rhetorical abilities.\nIn addition, Professor Kim's text of choice, Devore's Probability and Statistics for Engineering and the Sciences, is easily the worst college text in any subject I've come across. (I encourage all to read the reviews on Amazon.com; this text received a paltry 2 1/2 stars averaged from about 40 reviews.) As an English major, I was consistently baffled and angered by Devore's curt explanations of the topics, and the giant leaps in logic he takes when explaining the material. Such leaps create proportionally huge gaps in student comprehension. He has no qualms with laying a few theorems out before his readers, and then expecting them to glean all the innumerable nuances by reading his problem examples--whose solutions also consist of giant logical leaps that serve only to confuse a careful reader. The author strikes me as someone who enjoys reading his own writing--because he understands it better than anyone. But in so appreciating his own writing he forgets his audience.\nThis horrendous text and Professor Kim's (in)accessibility were my main concerns. I can fully understand that certain students to whom tough math comes more easily are charmed by his general temperament and desire to incorporate harmless tidbits of philosophy, science, and history into his lectures.  However some important professorial qualities--patience, rhetorical competence--are undoubtedly lacking. \n\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "November 19, 2006",
            "review_content": "\nProf Kim is an excellent professor.  He's truly a professional educator.  Prof Kim strikes me as someone who could also teach English Literature as comfortably as he does statistics.\nI would not call his summer 1211 class an easy \"A\".  The previous reviewer was in Prof Kim's 1111 class, but I know that my life was basically consumed for six weeks during 1211. It was very rewarding in the end.\nFor students who've feared this material in the past, Prof Kim may be perfect for you.  If you're not getting it, he will find a way to ultimately teach it to you.  He was very patient with my class. \nDon't fall asleep or miss too many classes.  He calls on students from time to time and he knows who you are.  Out of nowhere he may ask you to read a theorem out loud to make sure you know how the symbols translate to spoken English.  Class particiaption was not part of our grade calculation.\nI can't say enough about Prof Kim.  Rarely does one see his style in an introductory undergraduate class.  If he taught an upper level stats class in the future, I would defintely take it.\nWorkload:\nGraded weekly homeworks.  Absolutely necessary to do well on weekly quizzes.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "August 13, 2006",
            "review_content": "\nProfessor Kim is AWESOME. I would highly recommend that everyone take his class. He loves to make jokes, the workload is extremely manageable, and his exams are more than fair, etc.  He truly wants everyone to do well, is patient...the list goes on...I have nothing bad to say about him. If you go to class (which he really encourages), pay attention, and do the problems, there is no reason you shouldn't do well on the exams and get an A in the class. \nWorkload:\nConsistent but very manageable.\n"
        }
    ]
}