{
    "prof_info": [
        {
            "prof_name": "Constance Brown",
            "prof_id": 1354,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "March 22, 2011",
            "review_content": "\nTaking an English course with Constance Brown was one of the most refreshing academic experiences I have had at Barnard.  Because I waited to declare my major in English, I had to take Literary Criticism as a junior.  Needless to say I was dreading it somewhat.\nHowever, Professor Brown neither rambles nor wavers.  She does not take nonsense responses to the questions she puts to the class.  She showed that there are some aspects of studying literature and poetry that are simply not subjective.  Just knowing these fundamental rules for writing and criticizing in an English class has been utterly invaluable to me as a major.\nIf you think you can take a little criticism, take this class - Professor Brown more than does her job.  \nWorkload:\nA 2-3 page paper every other week, comparing or analyzing 1-2 works we have discussed in class.  1 correction is mandatory, and there is an in-class essay halfway through the semester.\n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "November 09, 2006",
            "review_content": "\nProfessor Brown is the light of my English-major life.  She designed a thoughtful syllabus, and keeps the class discussion on-focus while still carefully considering the points of every student.  She makes you back up everything you say, which keeps everyone on their toes, but still has a sense of humor.\nThe topic, literary criticism, was not one I was particularly looking forward to, but Professor Brown's approach was so involving that I'm now completely enthralled.\nWorkload:\n4-5 page essay every other week, 1 in class essay.  1 required revision and other revisions allowed.\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "April 14, 2006",
            "review_content": "\nBrown is one of the best seminar teachers I've had at Barnard. She knows how to keep people talking, and how to make sure it's not the same three people who hog the conversation. She knows when to speak, and when to let students take the ball. The result is two hours of class discussion that are enriching and exciting. Of course this only works if you actually read the books, and enjoy literature, but I guess I was lucky because most of my class did. The syllabus is interesting, and the breadth of material covered means that there is something for everybody.She's also a fabulous editor, my writing improved immensely over the course of her class. Not an easy grader, but an A is possible if you're willing to work hard.  \nWorkload:\nFive page paper every other week, one in class essay, one required re-write, unlimited re-writes possible.\n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "March 19, 2006",
            "review_content": "\nI do not recommend this class. Professor Brown is a smart woman, but she does not know how to lead a good discussion - she has all of the points she wants to go over written on a handout that she gives you beforehand. \nSometimes I found the questions she wanted us to answer during our discussion dull and uninteresting, but there was nothing I could do about it; anything else would've been considered off topic. I found myself staring at my watch the whole time. The readings assigned for this class were very time consuming, and the papers sucked majorly. Look forward to a bunch of awkward silences when you run out of things to say after the first hour.\nWorkload:\nA book a week, and a 5-7 page paper every other week\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "January 19, 2004",
            "review_content": "\nProfessor Brown is amazing, in her quiet, modest way. The class atmosphere was relaxed, but engaged with the material, and it was okay if we went of track and joked around a little. Brown sticks to her outline, but that's a great thing because she illuminates the texts (all interesting) in a way that helps you to appreciate them more. Her grading was always consistent and fair, and her comments actually give you something to improve on. The workload is the same as for all other classes, but it might be more enjoyable because Brown is just so kind and intriguing. If you have her, don't switch. You won't regret it\nWorkload:\n6 papers 5 pp each, 1 required rewrite, unlimited optional rewrites, few books and lots of poems and criticism essays\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "December 15, 2002",
            "review_content": "\nI immensely enjoyed Professor Brown's class; she is definitely not an easy teacher - I think she has a no A policy; I don't know anyone who did better than a B+.  You will work really hard, but there's definitely a sense of headway.  She sees to it that your writing will improve and requires each student to schedule 2 conferences with her over the semester.  She allows revisions, but it's possible that she'll give you the same grade you started out with if she doesn't feel you took it far enough.  Her classes are very well-structured - you will discuss everything you read, which keeps you on your toes, but also makes for a scintillating class because everyone arrives well-prepared.  Her comments are insightful, but not too dogmatic; she pauses to consider even the most inane comments and almost everybody has a lot to say.  If you love English, you will love this class.\nWorkload:\nfive 5 page papers, 2 required revisions, 4 books\n"
        }
    ]
}