{
    "prof_info": [
        {
            "prof_name": "Kate Ho",
            "prof_id": 2938,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Industrial Organization",
            "review_date": "October 20, 2016",
            "review_content": "\nAbsolute Garb Professor\nWorkload:\nMakes no sense\n"
        },
        {
            "course_name": "Industrial Organization",
            "review_date": "February 25, 2015",
            "review_content": "\nShe was one of the first professors I had for an upper-lever econ elective, and she was absolutely amazing. She was very clear in explaining the model, and posted all of her notes online before the lecture.  The TA's were very thorough in going over the Game Theory and competition models that weren't covered as heavily in class.  The problem sets were challenging, but the lecture notes and Office Hours made them more than doable, and she allows for collaboration with other students.  The material for the semester was great, and covered a range of topics from competition in different market scenarios, advertising, and other theories that are relevant for many different industries. If you're going to take Industrial Organization, take it with Prof. Ho. \nCAUTION: This is a math-intensive course.\nWorkload:\nStandard for an Econ course with bi-weekly problem sets, a midterm, and a final.  The final is heavily weighted to covering material in the second half of the course.  You will have to study to get a good grade in the course.\n"
        },
        {
            "course_name": "Industrial Organization",
            "review_date": "May 16, 2014",
            "review_content": "\nProfessor Ho was fantastic. While the material was a bit dull at times, the lectures were exceedingly clear. She seemed very intimidating at first (she very sternly emphasizes not to text in her class), but she is actually a very lovely, nice person. 95% of what shows up in the six problem sets is on the lecture notes already/ only requires you to extend the model she's given you a bit, but it's all very clear and very straight-forward.\nThe midterm and the final were also not too difficult; as long as you studied her lecture notes well, you're guaranteed to do really well. This semester, the median (average? I forget which) on the midterm was a 27 of 30, so people did really, really well. She then said she'd make the final harder, and it was marginally so, though not too horrible either. She said though that she was okay with giving out a higher percentage of A grades since we did well, so she's really very nice and not too concerned with being that tough Econ professor that likes failing everybody.\nShe said on the first day of class that she used to curve to a B, but as she's taught the class more she's become \"nicer\" so she said it's likely she'll curve more towards a B+. She's very flexible, caring, and clear. She makes sure we understand the material, and I've found I/O to be one of the more useful topics in Economics, and while the material was dull at times, I personally found the models, their results and their intuitions (which at the end of the day were quite common-sensical) to be really interesting.\nAll in all, 10/10 would definitely recommend this class and professor Ho. If you're interested in management consulting or in having a much, much more solid understanding of the firm part of microeconomics, this is definitely the class to take.\nTopics covered:\n- Firms\n- Perfect Competition (with Competitive Selection)\n- Monopoly (base case, natural monopoly, durable goods, price discrimination, bundling and tying)\n- Oligopoly (Cournot, Stackelberg, Bertrand, Collusion, market power, other variations on these models) (The Oligopoly section was the foundation for the rest of the class)\n- Product Differentiation\n- Information (Adverse Selection, Market for Lemons)\n- Advertising\n- Entry\n- Network Effects\n- Vertical Relations\n- Research and Development, Patents\n- Anti-trust\nWorkload:\nQuite light, and relatively easy (for a class that I very much expected to be my hardest).\nJust six problem sets per semester (she gives us about a week-and-a-half to finish each). They're about three or four questions long, and range between deriving a model (oftentimes she does this herself on the lecture notes so it's literally just copy-pasting what she wrote), extending a model to N firms or some interesting variation (firm locations, product valuations, etc.), etc. All in all they were VERY doable and the TA's were quite helpful for the one or two problem sets that were trickier.\nThe midterm and the final were quite fair; as long as you studied the notes and the problem sets, you'll be totally fine. Usually they were four or five questions that consisted in some slight variations on a model we'd done in class. All in all this class was not stressful at all, at least compared to other Econ electives out there, and you actually learn a lot of really useful, real-world things.\n"
        },
        {
            "course_name": "Industrial Organization",
            "review_date": "November 13, 2012",
            "review_content": "\nProfessor Ho is very smart and engaged and approachable, and IO is a really interesting course if you enjoyed micro and/or game theory, or are interested in mgmt consulting. Unfortunately, the overall course has proven to be rather dull - droning lectures and periodic problem sets with no support from a textbook. I'm a bit jaded about how econ lectures go, so this isn't bad relative to others, but it was not as rewarding as it could have been. She'll curve to a strict B, so hope that you do well on the exams. Take advantage of office hours because Professor Ho really is bright and friendly. \nWorkload:\nProblem sets (about 8 in total, not as grueling as other PSs) midterm and final\n"
        },
        {
            "course_name": "Industrial Organization",
            "review_date": "January 21, 2010",
            "review_content": "\nThe best econ professor I've had.  I was interested in the material to begin with but Ho's lectures made this a great experience for me.  Her lectures are clear and no nonsense but she spends plenty of time connecting the theory to the real world.  She's also very approachable if you're interested in the material and not just trying to suck up.  \nThis is somewhat harder than most econ electives but it's a must if you like microecon and aren't afraid of a little more math than usual.  A lot of the course consists of applications of game theory, so it would be easier if you've already taken game theory but it's not necessary (I did fine without it).  The textbook is useful at points, but the key to doing well is to read the lectures notes before and after class and do all the HW.\nAs for grading, the midterm and final both had their tricks but were fair as long as you had been going to class and doing your HW.  \nWorkload:\nMidterm, Final and 6 problem sets.  Midterm + Final = 80%\n"
        },
        {
            "course_name": "Industrial Organization",
            "review_date": "December 21, 2007",
            "review_content": "\nFantastic! Both the class and the professor are superbly organized and interesting.  The material is definitely challenging, yet attainable for economics students.  The material connected microeconomics to the real world for me.  The text book was almost useless for me (others like it, I found it difficult to read), but it is unnecessary if you go to class and study the lecture notes.\nWorkload:\n6 good problem sets (5 of which count toward grade), midterm, final. the midterm had one small trick to it, but everything was exceedingly fair\n"
        },
        {
            "course_name": "Industrial Organization",
            "review_date": "May 22, 2006",
            "review_content": "\nThis was a challenging class, but one you can tackle.  You were able to print out all the lecture slides that she had posted in courseworks.  As a class we didn't do well on the midterm, but I think we did better on the final.  The tests were problem sets.  I strongly advise that you read Shy (recommended book) and only read the required text for background information.  And definitely go over all homework and problem examples in the lecture notes.  If you can master those, then you should do well on the exams.  Also I strongly urge you to go to recitation because the TA will cover certain areas in more detail.  Rely heavily on lecture notes and problem sets.  And don't forget Shy.  Good luck.\nWorkload:\n6 problem sets.  Midterm.  Final.\n"
        },
        {
            "course_name": "Industrial Organization",
            "review_date": "May 14, 2006",
            "review_content": "\nGreat lecturer and helpful with explaining the tougher concepts.  IO generally is a tough subject compared to the other Econ electives, but she teaches it well and helps you prepare for the exam with a lot of practice exam questions.  If you like Micro theory, then take this class and if you want to do grad school in Econ then definitely take this class because you'll need it.\nWorkload:\n6 problem sets (some tough) that can be done in groups.  Midterm and final (50% of the grade)\n"
        }
    ]
}