{
    "prof_info": [
        {
            "prof_name": "Joanne Bauer",
            "prof_id": 4982,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Human Rights & Business",
            "review_date": "July 09, 2012",
            "review_content": "\nJoanne Bauer is personally and professionally displeasing. Simply don't take this course. Just don't do it. Other students of this class, whether entitled \"Human Rights & Business\" or \"Corporate Social Responsibility\" have been through it and had similar experiences. A few days after it was too late to drop the class, I received an email from this professor that was unlike any interaction I have ever had with a teacher before. I personally felt that the tone was abusive, and I also feel it was completely unprovoked. I was so shocked I spoke to another student in my program, who immediately said she knew scores of people who had similar experiences in previous semesters. I spoke to a few of them and even went out for drinks with one to get her advice. After that, I quietly mentioned the email to a couple students in the class and every one of them had a story (just three weeks into the semester!) that had similarly alarmed or disturbed them. The rest of the semester continued in the same vein, with seemingly random personal attacks, biting comments, and a feeling in the classroom like she was angry at you, personally, for something awful you'd just done to her.\nMy experience of Bauer's style is that it is scattered, insecure, uninformed, punitive, reactive, and unprofessional. I'm willing to put up with a \"mean\" teacher if they are really, really smart and I feel like they are just toughening me up, but this was nothing like that. I've never written a negative teacher review in my life and I don't think I ever will again, but there you have it. Never take this class. Even if she had been nice, the material was not graduate level and I felt dumbed down after sitting through it.\nWorkload:\n(I took the summer course, so the workload is a bit heavier than average, I think.) Readings: heavy, and necessary. It is difficult to fake it in this class if you haven't read. One mini-presentation early on, one big presentation (30% of grade), and a 20-page final paper (50% of grade). The guidelines for the paper are straightforward which makes it easy to write. The participation grade is 20% and not a given: you are expected to come to class with a current news topic to discuss. In other semesters there was an elaborate grading system attached to discussion board posts, but she chose to keep it \"secret\" from students for some reason. Also, she never told us but the TA was actually instructed to type out everyone's comments during class discussion so she could review them for quality/quantity later on. (People were pretty unhappy when TA-surveillance-gate surfaced.)  I still got an A in the class, but I spent the semester thinking she was going to fail me.\n"
        }
    ]
}