{
    "prof_info": [
        {
            "prof_name": "Brigit McGuire",
            "prof_id": 4605,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 30, 2011",
            "review_content": "\nThis class was weird.\nThere wasn't much work to do between essays, but this was a double edged sword. While you had less qualitative work to do, Brigit's grading was always very harsh (for everyone), and so you had little opportunity to undo that. In other classes, class participation and small assignments counted for something. Here, everyone participated the same (mostly as a result of the style of discussion) and there were very few assignments other than essays.\nBefore submitting a final draft, we had a sit-down with Brigit. However, it always seemed that, once we got our final drafts back, she forgot or avoided pointing out things she didn't like. What I'm saying is that it's unethical to take issue with something you saw before and had nothing to say about. This was a common issue with Brigit's grading.\nCompared to other classes, work you do here that gets you an A- elsewhere would get you a B or B+. And she doesn't \"curve\" or anything.\nWorse, there was very little communication on her part. While in other classes teachers wrote endless notes on margins and even typed up a page-length review that they attached, here, you got as much as she could fit into your last page, addressing your essay in a general \"big picture\" way and leaving you with very little direction in terms of how to better write the next one. It was always about thinking about the essay, and this reflected her way of not giving a hoot about your writing; what always bothered her was some slight structural anomaly. In fact, if you might've written a really awesome, extremely time-consuming essay, that everyone might like, you might find yourself still being asked to restructure the whole thing because it just might maybe turn out slightly better. This reflects an utter lack of concern or respect to student's time and effort. If the structure is fine the way it is, she has to overcome her personal idiosyncrasies and focus on better writing. \nI could go on about these issues, but the point is, you're going to work harder for a lower grade here, and Brigit isn't going to help you understand why or how. Avoid this class if you can.\nWorkload:\nJust the essays, but like I said, that's not going to be helpful in the long run\n"
        }
    ]
}