{
    "prof_info": [
        {
            "prof_name": "Marie Lee",
            "prof_id": 12662,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "December 15, 2016",
            "review_content": "\nProfessor Lee is the most hands-off (by which I mean uncaring, withdrawn, and lazy) professor I've encountered at Columbia. She would give students written critiques that were barely a paragraph long and littered with typos; she hardly ever spoke up in class; and she seemed determined *not* to get to know any of her students or create a warm atmosphere for the workshop. While I ended up enjoying this course thanks to my wonderful classmates, who put in a lot of work and really ran the workshops each week, I was truly taken aback by how little effort Professor Lee seemed to put into the class; at times, it was almost insulting, given how much effort the rest of us were putting in. Moral of the story: if you have good people in your class, Professor Lee won't ruin it, but she won't contribute much either. I'd recommend taking the workshop with someone else if you can. \nWorkload:\nNot too heavy at all. Submit pieces of fiction (anywhere from like 3-100 pages) two or three times a semester; write one-page critiques of three other people's submissions each week. \n"
        },
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "June 03, 2013",
            "review_content": "\nMarie is an insightful and accomplished author whose comments in class really dig to the core of a piece. She offers up thoughtful and useful advice, that is, when she participates. Workshop itself is almost entirely guided by the class, but the conversation created is almost always the most valuable aspect of the course. Marie pushes for an open environment where no one feels hesitant to try something new with their writing. In all honesty I think we as a class could have gotten away with much more experimental (and much shorter) pieces, but we were pretty straight-laced and submitted your typical 8-10 page traditional pieces. If you want to be bold, you're encouraged to in this class. \nMarie's presence in class is minimal, however. She doesn't offer much feedback on pieces, sometimes writing only a couple of sentences about them which can sometimes be synopsis or grammatical pointers. She seems to record critiques submitted for peers' work, but never seems to grade them. The requirements for critiques were also vague. Because of that I received critiques ranging from paragraph length to several pages in length, and never knew quite how much or about what to write myself. \nDespite her sometimes detached presence, Marie's class is good for budding writers because she doesn't judge too heavily, and just encourages you to write often. Even if she's not perfect, she doesn't dare burst anyone's creative bubble, and that's great for writers at this stage.   \n\nWorkload:\nPerhaps a bit refreshing, if a little complicated, for those CW people used to a strict number of submissions between a particular number of pages. Marie is a little vague on assignments in class, but states that submitting is optional. However, there is a final submission due at the end of the semester. So you have to write regardless. That being said, no one in the class took this route, and most submitted between 2-3 times. The final portfolio has no minimum page requirement, but it accounts for a large chunk of your grade and is probably the only thing she really grades very thoroughly. Other than that, you'll critique peers' work every week, though I don't think she actually looks at your responses. Marie does look out for class participation and for people who volunteer for things in class.  \n"
        }
    ]
}