{
    "prof_info": [
        {
            "prof_name": "Joseph Dubiel",
            "prof_id": 2470,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Analysis of Tonal Music",
            "review_date": "July 24, 2010",
            "review_content": "\nTo the previous reviewer: what?! I couldn't disagree more. Maybe he's just less harsh on the humanities class. I took his Analysis of Tonal Music class, which was probably a bit over my head given that it was my first graduate-level music theory class, but I struggled through since I thought I would benefit from doing that level of work. Now, I will give him this: he absolutely knows his stuff. In class, he comes across as friendly and quirky and likes to put people on the spot, but without being too harsh. His nastiness comes across in his comments on assignments. His comments (tons on every assignment) are condescending, belittling, and sometimes just cruel. Usually, it's too far from constructive criticism to be considered as such. He seems too eager to throw out a nasty remark. Although, this never really comes forth in class and I was sometimes thrown off by his friendliness to me in person, especially after getting back an assignment. I will say that the course is worth taking if you're already a skilled theorist. He is certainly passionate and knowledgeable. \nWorkload:\nNo tests; 1 weekly write-up (3-5 pages) of a short piece or movement; 15-20 page final paper\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "March 10, 2005",
            "review_content": "\nOh my God--if you are one of those that just wants to get through the core with as little pain as possible this is the section you want to hope for.....None of those nasty in-class midterms and finals where you have to identify pieces and composers etc--no attendance taken (though you shouldnt overstretch that given that most of your grade will be based on personal interaction with the prof in class)---basically NO homework at all and NO TEXTBOOK (yes, you save those 60$)...\nGet an easy A with the least amount of effort--but it will be boring as hell and not doing anything for an entire semester can be trying at times...anyways the class is 3 credits and it boosted my gpa! but did i learn anything? i think prob only  to look really interested in a subject matter even when i am fighting yawn attacks...aside from that, prof. dubiel is a really nice and cool professor--he actually is really dedicated and wants to win his students for music \nWorkload:\nBasically NON-EXISTANT : take home midterm and final (easy but annoying work--better than memorizing and taking in in-class) one concert review and a couple of really quick, easy exercices that are not worth being mentioned..\n"
        }
    ]
}