{
    "prof_info": [
        {
            "prof_name": "Melanie Ventilla",
            "prof_id": 2435,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "October 11, 2009",
            "review_content": "\nShe is the reason the core exists. I came into Art Hum not knowing much of anything about art. She was incredibly intimidating at first, but she is actually a really sweet and approachable person. That said, this isn't the class for someone who wants to completely bullshit their way through Art Hum. You will learn a lot and actually appreciate art if you put a bit of work into it. \nWorkload:\n2 papers, some reading, midterm and final. Not more than any other professor. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 13, 2009",
            "review_content": "\nabsolutely amazing professor - while her class is intense, you learn SO MUCH in each of her classes that its more than worth it. she definitely is intimidating and appears unapproachable, but in reality, she is always available after class for any questions, etc. if you are lucky enough to get her, don't switch - you'll regret it. she is truly one of the most enlightening professors i have had. \n\nWorkload:\nshort outlines for readings - actually pretty helpful. her papers are interesting and fun (1. public art, 2. compare/contrast nyc museums). \nher exams are brutal - you really have to write fast and know your slides cold, but again its totally doable and worth it in the end. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 09, 2009",
            "review_content": "\nAlthough I can see where the person who said that Prof. was so intimidating that they didn't enjoy the class was coming from, I disagree.  She was intimidating.  She was also sort of a hard ass.  Miss 3 classes and your grade will be lowered a grade and missed museum trips count, even if you make them up, and you will also have to do extra work that no one else had to do.\nBut this was actually my favorite class of all at Columbia.  I thought her lectures were fascinating.  I am sooo glad that I had her as a professor.  She is the sole reason that I know love art.\nWorkload:\na lot, but probably just as much as any other art hum.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 04, 2009",
            "review_content": "\nAlthough the workload for Melanie's class could be considered typical for a normal Art Hum class (though with an inordinately large amount of memorization that has to be done for the midterm and final), I found the lectures entirely unenjoyable as Melanie was extremely intimidating and just way too intense in teaching a class for students that are all most likely not art history majors. Sure, you'll read some reviews that say that it was in her intimidation and intensity that the class was enjoyable since it provided an academic challenge, but if you're looking for an easy-going art hum class just to get it out of your core requirements, this is not the class to take.\nShe demands a certain level of class participation, making it clear at the beginning of the class that she is very mindful of how much you're participating, but at the same time, she will call you out on comments that she thinks are \"wrong\" without any hesitation.\nThere were 3 mandatory museum visits, none of which I found enjoyable. This is coming from someone that has enjoyed visiting museums before, but the way that she contextualized our visits to the museums, the way that she framed them according to how we were supposed to write our essays, made the trips way too intense, as if we were supposed to fill in the shoes of experienced art historians. The first was an unnecessarily long 5 hr visit of the MET, in which we were required to stay at the museum for the full 5 hrs.\n\nWorkload:\n2 5-page essays, midterm and non-cumulative final, 3 mandatory museum visits, a lot of memorization\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 25, 2008",
            "review_content": "\nShe is an unbelievable professor.  Extremely knowledgable with regards to the syllabus, but also pretty understanding with grading.  Ventilla doesn't take bullshit answers, but, and I know this sounds corny-- she is funny and serious, and will make you appreciate art in a whole new way.    \nWorkload:\n2 un-researched, easy papers; midterm and final require basic Art Hum memorization.  I suggest bringing your laptop to class and using the Art Hum website during class to include any piece seen during her Powerpoint presentation on your own Powerpoint to study from for exams.  \n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "January 20, 2005",
            "review_content": "\nmelanie is intimidating, intelligent, unexcitable, eloquent, and often frightening. and i'm an art history major. i can't imagine what  she must have been like for those in the section who were just taking their first art history class-- but then again, her section added so much to my understanding of buchloh's lectures that it may have been the first art history class that actually really mattered for me, too. don't be scared of her, because that would be a shame; just suck it up when you say something stupid and don't worry, keep trying. she's not insulting you, she's trying to help you. you might even get her to be sort of friendly by the end, kind of. and that she only wears shades of black and grey? gosh, i kind of miss her.\nWorkload:\neach student was required to select quotes, make a handout, and present one article from the reader to the section.\n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "January 19, 2005",
            "review_content": "\nThis woman is incredible.  As others have said about the course, your TA will have a large impact on your experience and knowledge gained in the class.  Melanie will beautifully clarify anything that was confusing in lecture, although there is only room for one correct answer.  She has reasonable expectations, friendly to talk with after sections, and is sometimes intimidating.  Don't be afraid to add to discussion.  Her sections were overflowing in the beginning, so do your best push your way in.  An educator at heart.  Highly recommended!!!\n"
        }
    ]
}