{
    "prof_info": [
        {
            "prof_name": "Scott B. Snyder",
            "prof_id": 3294,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "CREA W1001",
            "review_date": "December 27, 2007",
            "review_content": "\nScott was really great. He's very supportive and nurturing but not in an effusive way. He'll really push you - at the end of the class you will inevitably be a much better writer than when you started. He is very big on letting people write the stories they want to write. He is more about guiding students to help them make their stories the best they can be than telling you what good fiction is or isn't.\nA few things you should know about his class. Do NOT be late, it will cost you. For every lateness you will lose half a grade. This is not a bluff, he really enforces it. Because it is a workshopping class tardiness really throws off the rest of the class.\nAlso, he will make you work for your grade. You will really need to follow up on his and the classes suggestions when polishing your work. The more you do this, the better you will do at the end of the semester.\nWorkload:\nTypical for a workshop. If you like writing you will enjoy the workload. \n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "January 18, 2007",
            "review_content": "\nWhat to say about Scott? The man is amazing. If this man told me to jump off a bridge, I would, and I suspect many of my classmates felt the same. If you want to be a writer and don't manage to take a class with Scott, you're missing out in a way that actually makes me pity you. I doubt Columbia ever had or ever will have such a nurturing writing professor. Don't get me wrong--unlike most profs in the department, if your writing sucks he won't just blow smoke up your ass and say it's fine. He'll tell you it's broken and, more importantly, he'll help you fix it. He has an amazing knack, actually, for zeroing in on where your work is weak and making just the right suggestion to get you back on track. This guy will beyond bend over backwards to help his students. He happily looks over work generated outside of class, he'll suggest books he thinks you'll like (and loan you copies from his own collection). He'll share his love of Titanic. He takes the course very seriously. You have to type up comments for each piece of your classmate's work, and while this can be kind of a drag when you're having a busy week, you'll really really appreciate it when it comes your time to be workshopped. He's also strict on attendance and punctuality, but you won't want to miss a minute of his class anyway. Seriously, take him. Or at least read his book, Voodoo Heart - you'll become a better writer just reading each of his stories.\nWorkload:\nThe usual poem/play/story, plus 3-5 typed critiques each week.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "November 12, 2006",
            "review_content": "\nScott Snyder-- A great instructor... or the greatest? After taking this class you'll agree with one of these and my guess is that it'll be the latter. Scott is one of the most involved instructor on the sixth floor of Lewison. Much has been written about his strict policy on being late (don't even think of falling asleep in class... he'll kill you) but he does it out respect for the students. It's clear that were the ones that are important to him and you are reminded of this everyday of class.\nWorkload:\nStandard for the course--one poem, one scene, one short story. The only addition is that you have to type out your comments which is actually well worth the effort when it's your turn to be critiqued.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "July 20, 2006",
            "review_content": "\nIf you get scott snyder, you're a lucky dog.  His first book: Voodoo Heart is out now, which is fantastic.  So that's big: you're working with someone whose work you can respect.  Who's got a taste of success and makes you think you too can make it.  \nAnd he's a great guy.  Gentle-mannered, friendly and very available for help on your work. \nScott is organized, dedicated, punctual and genuinely caring.  He runs a tight ship.  You arrive at his class on time, having reviewed your peers' work thoroughly or you get penalized.  Which can suck when you're a flake like me.  \nOn the upside, you get real feedback from people who have actually read your work.  And classes are not bogged down by the idiotic granstanding of people who have only read two pages of your story.  \nThe result is not stuffy.  You might hear \"tight ship\" and think of detention.  What I mean is that Scott keeps things moving.  He runs the kind of functioning workshop that is worth your time.  \nSo, as I said, Scott is gentle.  He won't tell you that your work sucks or really give you a handle on your grade moving forward, but he's easily excited by work he likes, which you'll notice.  So, you know when you're doing well... \nWhat more can I say?  If you're interested in taking SSII as a slack, easy class, don't take scott.  If you want two hours of solid workshop every week, with a published author who knows his shit and is, by the way, an awesome guy, then he's for you.  \nWorkload:\nSSII.  Poems, Short Story and Screenplay.  A final portfolio ~30 pp of work due including edits.  Weekly comments on 4-6 people's work. \n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "December 03, 2005",
            "review_content": "\nTake this class with this teacher.  That is all.  When you will take it, you will thank me, so here is your pre-emptive \"you're welcome.\"\nokay, if you are not convinced, here's a little more insight: Scott is not pretentious.  He actually *wants* to be there (or if not, he is a very good actor) -- he gets really excited before every unit and always has something good to say about everyone's writing -- truly constructive criticism.  Yes, it humbles you if you go in thinking you're Hemingway, but after you get over the blows (which he really tries to soften), you realize that he was probably right, and you rethink your piece. And if you think he's wrong, he'll actually listen to you!\nLike the other reviewers said, he's a stickler about attendance...but again, it is because he fosters a respect for each individual student... he doesn't want to have anyone's writing given less attention because people were late... and the writing classes are at night, so really, it is not hard to get there on time.\nThe only flaw he has is timing: I don't think there was one class (except for maybe the first one) when we didn't go over the 1hr 50 mins... but you don't even notice until you look at the clock afterwards and realize you were in there an extra 5-10 minutes... it is just a truly enjoyable, educational class.  I think everyone grew as writers and had a fantastic time while doing so.  Really, really, really, a gem in the otherwise mediocre writing department.\nWorkload:\nSame as other classes: 3 weeks on poetry, 3 weeks on drama/film, 3 weeks on fiction.  You go one of each 3 weeks in the units.. and you critique about 5 pieces of writing a week.  It's more work for the fiction, and the least amount of work for the poetry (just because of reading), but it isn't all that time consuming...also, he expects you to be revising all semester, and encourages attendance of outside class events like readings around the city.  These are not required and don't give you any extra pull, but they are worth considering if you have time...on the whole, I didn't.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "January 01, 2005",
            "review_content": "\nA great teacher. Scott's definitely no-nonsense, but he's kind, incisive, and brilliant. He runs a tight ship, giving what students jokingly call the \"death penalty\" for being late or absent (2 lates or 1 unexcused absence = automatic 1/3 grade penalty on your final grade) and demanding that you speak up in class (will send you a personal email if he felt you were too quiet). It's worth it, though. This guy will work wonders with the writing you submit. Am I the only one who thinks he looks like that gymnast guy, Paul Hamm?\nWorkload:\n4-6 thoughtful reviews of peers' writing per week; 1 story, 1 scene, 2 poems over the course of the semester.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "November 15, 2004",
            "review_content": "\nAnyone who took a class with him will agree with the reviewers. This man is incredibly charismatic. Where else do you get a writing teacher who worked in disneyworld as Eeyore and Buzz Lightyear, collects Elvis memorabilia and met Tom Jones in Las Vegas? Scott made me realize that there is some hope for poets in a class called Structure and Style. His workshops are run like graduate classes, and it's probably more work than a normal SS section, but I enjoyed it, and so did all of my peers. No wonder his SS1 and SS2 sections this year have gone first in the registration. Beware, if you're looking for an easy grader, Scott isn't. He'll grade you hard and make you earn your grade--but oh with what pride did I earn it!\nWorkload:\ngraduate school-style workshopping: 5 pieces from 5 peers are critiqued written (you're given a week to read them and write the critiques) and then orally in class. When you get critiqued, this means you get 18 written reviews for your work plus Scott's. One scene, One short story, a free verse poem and a form poem are workshopped from each. After your workshop you need to make appointments with him to go over his comments personally with you. \n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 23, 2004",
            "review_content": "\nAs you can already tell from the reviews written, Scott was just an incredibly wonderful writing teacher.  Not having taken a writing workshop in a while, and having had experienced some pretty unhelpful ones in the past, it was a relief to have Scott as a teacher.  Scott knew how to make the class work.  The mandatory meetings forced us to fully recognize the direction of our own writing and fully understand what we wanted it to become.  It was great that he made us critique others' work as we became very aware of what an audience needed from a writer.\nSometimes the peers' comments were useful, sometimes not, but I always took Scott's comments very seriously and my work always came out better in the end for it.\nOverall Scott's strength came in knowing how to direct a good story to become exceptional (which comes from being a fantastic writer himself, which we found from him inviting us to his own readings in the city and from him showing us his own work).  He took immense interest in us and was just a great guy overall.  The class was fun and I always looked forward to it (which, since it was on a Thursday night from 7-9, is a pretty amazing statement).  He created a comfortable environment for critiquing without harshness.  He was a stickler for punctuality and the class was well organized, but not in a stifling way.  If you can get Scott as a teacher, do it.\nWorkload:\n2 poems, 1 drama, 1 fiction, office hours every 3 weeks and weekly critiques of classmates work. Portfolio of reworked pieces last week of class.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 20, 2004",
            "review_content": "\nbrevity is the soul of wit, so i'll make this brief.  scott snyder is awesome-- not only he is an amazing writer (as you will discover when he shares his stuff with the class) but is also a great teacher.  his advice is always useful, and besides that, he is genuinely interested in getting to know each and every one of his student's style of writing, suggesting authors he/she would enjoy, etc..  that's all i have to say... if you have a chance, take s&s; with scott, you won't regret it!\nWorkload:\nreasonable-- the hardest part is all the reading and critiquing, but if you don't wait until the last minute to do it, it goes quickly and will be the most fun homework you do all week.  you have to write for the class 2 poems, 1 dramatic scene, and 1 piece of fiction.  's all.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 14, 2004",
            "review_content": "\nScott is a terrific teacher who makes one proud to be at Columbia. He gives everyone a chance to speak, allows for participation and interaction between both the students and himself. He makes sure that he gets to know you on whatever level you choose, forcing you to come to office hours once every three weeks and willing to speak to you on a variety of subjects about creative writing. \nHe will go out of his way to recommend writers to you, and has an always interesting take on your work while its workshopped. As long as you hand in your work on time, and arrive to class on time, Scott seems to reward your efforts\nWorkload:\nPortfolio which includes poetry, dramatic scene and fiction that was worked on throughout the year. Weekly written comments on peer's work\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "April 19, 2004",
            "review_content": "\nAfter reading other reviews on courseworks about Structure & Style I, I was very worried, going into the class, that this wasn't what I wanted.  Scott did a great job of proving me wrong.  He teaches the class as a graduate course and is very helpful and constructive.  He'll set up appointments with you (every week if you want!) outside of class and will help you get to the root of what you want to say.  He's a real stickler when it comes to punctuality and attendance... but hey, it's only once a week.  He's a great professor and a great guy.  What a wonderful way to begin the writing program!!!\nWorkload:\n3 weeks poetry critiquing (1 week inc. writing your own)\n3 weeks drama critiquing (1 week inc. writing your own)\n3 weeks fiction (1 week inc. writing your own)\nPortfolio due last week of class.\n"
        }
    ]
}