{
    "prof_info": [
        {
            "prof_name": "Catherine Bohannon",
            "prof_id": 11389,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 29, 2012",
            "review_content": "\nProfessor Bohannon was far and away my best teacher this semester, and perhaps the best teacher I have ever had in my years at school.  University Writing seems to be a class that most everyone hates, and as I'm sure every review will mention, most teachers assign a lot of work.  However, I felt like the work we did for this class was extremely productive and useful.  We did a lot of group work, and a lot of workshops of other students' papers.  While I've been in classes where this process was exceedingly painful, Prof. Bohannon always facilitated discussion in such a way that everyone knew what to look for in each others' writing.  These classes ended up being some of the most useful.  She is also one of the most insightful teachers I've ever had.  I felt like every time I signed up for her office hours (usually via Skype), I went away knowing exactly what to work on in my paper to make it that much better.\nProf. Bohannon inspired me to work very hard for this class, but she also rewarded me for the time I put in.  While she is one of the harder graders I've faced, I felt that she was fair, and that ultimately she factored my effort into the final grade.  In addition, she is rather funny and knowledgeable in just about every field.  I feel truly fortunate to have had her, and I cannot recommend her class enough.\nWorkload:\nStandard four UW papers, plus readings, workshop responses, and incidental assignments.  Every paper has at least two drafts, so it adds up.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 11, 2012",
            "review_content": "\nBOTTOM LINE: TAKE THIS CLASS \nThe only reason this review is so damn long is because I have nothing else to do and because there are no other reviewers for this teacher.  So don't whine: chances are, you're reading this because you looked up \"Bohannon\" (Lucky kiddies).\nSo I was starting my second semester, making as much fun of people in UW as I could.  I was enjoying myself very much until my friend told me that he had UW with Cat Bohannon.  \nYou can't make fun of someone for that.  That's like snickering outside your friend's door while he's getting laid only to witness a gorgeous supermodel emerge about an hour later.   You see, not only is going to class actually fun and worth it, you also don't have to live in fear of the very common 'B'/'B+' you often receive in U-Writing. \nCat seems to understand that this class is a chore/annoyance/tickinyourass for many people.  I got the feeling that a lot of activities were meant to make the class more engaging and fun.  For example, instead of taking 1-3 essays home to review (and lie and say that they're great, exceptionally insightful, super exciting, etc.) we would divide ourselves into groups in class and talk with the writers (I must also remark that my class was quite smart and creative, so this activity was never a pain).  \nCat also made the essays more interesting.  You always had a lot of leeway on what and how to write, which doesn't make the workload any easier, but helps make the work more bearable.  Most importantly, instead of a self-reflection, you will write an Op-ed based on one of your previous essays (15% of your grade)!  Sounds like extra work, but if you buckle down and take it seriously, you can get it over with before the brunt of your finals and even get published (one person was published in the Florida Sentinel [I think]).\nIn addition, Cat is quite nice about deadlines and never bothered people who turned stuff in a little late (a REAL PAIN thanks to newcourseworks).  Extensions?  I know of one student who turned in a revised rough draft on the day the essay was due - she gave him an extension and he ended up getting a decent grade.\nWill you become a better writer?  Cat is a neuroscience grad student, but knows a lot more about writing than you do.  So pay attention in class.  And although you will probably never understand why you got the grades you got (unless you ask her), Skype appointments with her are super useful to figure out where you should go and what you're doing wrong.  \nCat herself is chill.  Don't use your cell phone in class (Don't get caught, idiot that doesn't listen to me).  There's this very funny story about someone doing too much physics and sleeping in class too...\nAnyways, this class was easily my favorite.  Perhaps my classes were just more uninspiring than normal?  Naw, this class actually was pretty good!  If you're looking up U-Writing teachers, make sure you're taking a class that conflicts with your current UW and switch into Cat's class!\nWorkload:\nThere's no escaping it: the workload is heavy no matter which teacher you get (Apparently, they thinking making you write more makes you a better writer).\nBut, compared with what I heard... Definitely not the worst.  \nGrades:  I think everyone did well (I think).  You see, I'm a shit writer, so I have no idea what my grade reflects.  Participation, perhaps?  All I CAN say is, I know good (REALLY GOOD) writers.  I did better than they did in UW (That's why I think being lucky is a skill).  If you're in this class, don't waste the opportunity.\n"
        }
    ]
}