{
    "prof_info": [
        {
            "prof_name": "Mark Carnes",
            "prof_id": 252,
            "total_reviews": 41
        }
    ],
    "reviews": [
        {
            "course_name": "America Since 1945",
            "review_date": "December 14, 2016",
            "review_content": "\nProfessor Carnes is one of the best professors I've had. At the beginning of the year, I was not looking forward to taking a large history lecture, but Carnes really knows how to engage the students. His class does require effort and it's best to create study groups to go over the material, but his teaching style is so captivating that if you pay attention, you'll just have to review for the midterm and final. However, his exams can be a bit tricky if you don't really understand the main concepts and spend time memorizing dates because he puts quotes on the exams, which you have to identify who said the quotes and the significance of them. He is a lenient grader and does his best to learn students' names even if it's a lecture of over 50 people. Highly recommend to take Professor Carnes!\nWorkload:\nUse the course booklet that you can buy from Village Copier to study for exams and take notes in; one midterm, one final, one optional paper. Requires effort to do well, but Carnes's class is you will eagerly want to study for.  \n"
        },
        {
            "course_name": "The United States: 1940-1975",
            "review_date": "December 08, 2016",
            "review_content": "\nProfessor Carnes' US History class is a must take class at Barnard.  For every class, he was always passionate, engaging, and enthusiastic  Reading quotes from primary sources and asking questions about what the students do given the same information the decision makers had at that time, he truly makes history come alive.  \nReadings are not that much are not necessarily to do well on his exams.  Solely paying attention during his lectures, which is easy to do given how engaging and interactive they are, will prepare the students well for the exams.  And even if you do poorly on the midterm, he understands that they may not accurately reflect your intelligence and how much you understand the materials, so if you do well on the final, he will give that into consideration when determining the final grade of the course.\nWorkload:\nA midterm (fun and not that difficult), a final (not accumulative), and an optional paper that can only help your grade.\n"
        },
        {
            "course_name": "Reacting to the Past - First Year Seminar",
            "review_date": "September 05, 2016",
            "review_content": "\nPlease please please as a recent graduate I beg you to take a class with this man. He was one of the best parts about my Columbia University education. He tells a story through history, he makes classes tangible and interactive, he will engage you and make you feel like you are part of the past. If you have any love for history at all, Mark Carnes is the professor for you. I had the fortune of taking Reacting to the Past with him my freshman year, a course that has made him famous academically across the world. It is a course that exercises intellectual history, teamwork, public speaking, debate, research and writing all in one-- a game of history, if you will. You embody a character and you become that character for that \"game\" whether it takes place at the trial of Socrates or the Succession Crisis of the Wan-Li empire. Essentially, you are taught history by becoming history. You are taught to speak and talk through the eyes of others, all while bonding with your classmates. The US 1940-1975 class was a different style of class-- not small seminar but huge lecture. Nevertheless, Carnes riveted us all. The textbook was phenomenal (it made me cry while describing JFK's death and the repercussions that his death had on society) and most of all Carnes was just able to engage the room. I have never been in a lecture where everyone is absolutely engaged. In Carnes's class, people listened to him because he made history not about the past, but about why the past was important for the present and future and how we got to this point in the world. I cannot stress it enough-- take a class with Carnes. If you put in the work and the effort, you'll get an A. Don't take this class if you're looking for an easy class. Take his classes if you're looking for your tuition money to give you an experience that you'll take with you the rest of your life.\nWorkload:\nUsually a midterm and a final exam with a couple essays but they're worthwhile\n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "December 16, 2013",
            "review_content": "\nTAKE THIS CLASS. TAKE IT BEFORE YOU GRADUATE BECAUSE CARNES IS AMAZING. That being said, this class is not easy. \nCarnes is a brilliant man. He shows you the history of this country is another light, and makes you really think. As he would say, he teaches history but he also tells stories. While the material of this class is interesting, the way he teaches it is what makes it that much better. He is really enthusiastic of what he teaches. \nThe midterm is not easy. He will tell you to join a study group, which helps so much. Join a group and make sure they meet because it will only benefit you. Go over the midterms from the coursebook. The readings are not completely necessary but he rewards you with an easy question on the exam if you do do them. Also the readings are really interesting so you should do them. \nThere is an optional final, which I did not do so I cannot comment on that. \nThe final is exactly like the midterm with another essay. The 'short answers' are only on the second half of the course which makes it easier to study. Then you have to do two essays. He gives you a choice for the first essay which only includes the second half of the course. The second essay he does not give you a choice on, but the question is super broad and general that you really don't need to bring in specifics from the first half of the semester. You just need to know general ideas. \nCarnes is really an amazing teacher and worth getting to know. \nWorkload:\nMidterm, optional paper and final. As long as you pay attention in class and go over the past exams, you should do fine. \n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "January 20, 2013",
            "review_content": "\nCarnes is without question the best lecturer I've ever had.  This class really changes how you look at the this country .  Every class was carefully planned and addressed the material on multiple levels.  Once the exams came around, I barely had to study the notes, because the lectures were so memorable.  The exams themselves varied in difficulty.  He has a coursebook containing the past five years worth of exams.  There is a lot of repetition between years, but because of high scores on the midterms, he made the final significantly harder.  That said, I still did well in the course.  Some may complain that he is a little overly dramatic, but that is what makes his lectures so superb.  This is what a history course should be.  \nWorkload:\nMidterm, Final and optional paper.  There was also a lot of reading assigned, but you barely had to do any of it since the exams were almost completely off the lectures.  However, most of the reading was fascinating and the main text was the best textbook I've ever had.  \n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "September 18, 2012",
            "review_content": "\nProfessor Carnes is easily one of the most engaging lecturers I've ever had at Columbia.  He has a wonderful ear for great anecdotes, and made what would otherwise have been an incredibly tedious lecture on the makings of the atom bomb come alive by describing the various members of the Manhattan project working in Pupin, gleefully recounting how members of the Columbia football team were recruited into transporting their various apparatuses across campus to Schermerhorn and in general making a slightly technical lecture fun and relevant for sixty odd humanities majors.  Moreover, he genuinely wants his students to learn and participate, and has a great knack for encouraging student participation.  He handles stupid questions with aplomb, and I never once saw him make a student feel dumb or discouraged for asking something that was patently obvious, despite what must be the incredible temptation to do so.  In short, take this class.  You will learn important and relevant history, be forced to think about it in new and interesting ways, and have a great time doing so.  I cannot recommend it enough.\n\nWorkload:\nLight readings, an optional(!) essay, and a very fair midterm and final.\n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "December 28, 2011",
            "review_content": "\nBest. Class. Ever. Hands down. Professor Carnes is so incredibly knowledgable and engaging in lectures. The course material itself is familiar to most students when they walk in on the first day, but you will still learn so much in this class. Professor Carnes is a storyteller; he manages to tie in these tiny and seemingly unimportant stories, which make most lectures more relatable and enjoyable. He says A LOT in the lectures, so go to every class and take good notes. If you are a good typer, it can be helpful to bring your computer and just write every brilliant sentence that comes out of his mouth-while excessive, it will be extremely helpful when it comes to studying for the midterm and the final. I learned more in this class covering 35 years than I probably learned in any of my previous history courses. I am not a history major, but this course was incredible. \nWorkload:\nA good amount of interesting reading. There is no discussion section, so you can really do the reading at your own pace. Definitely read the textbook on time so you understand the lectures. All of the other readings you can do before the midterm/final, because he puts a lot of quotes on the exams that you need to recognize and explain. Study in a group (which he will assign you) and you can absolutely get an A on both.\n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "October 06, 2010",
            "review_content": "\nMark Carnes is easily the greatest professor I've had the pleasure of knowing at Columbia. He is an absolutely amazing lecturer. The man is completely brilliant, I tell you. I'm notorious for falling asleep in boring lectures or skipping a lecture if I'm feeling even the slightest bit unmotivated--not once did I sleep or skip this man's class last spring 2010. His lectures often take story format, and he becomes really involved in what he's talking about. He really cares about his students, you can tell. He's passionate about history, and he knows exactly how to keep you interested. Moreover, this is one of those \"you-should-take-it-before-you-graduate\" classes: it makes you appreciate the rich history of Columbia. He spends two or three full classes discussing Columbia's implications in race riots, war protests, etc. It's fascinating. \nHe's very available for students to meet with to discuss questions or problems with the material. When I went for office hours one time, I was scanning his bookshelf and picked up a copy of a book he edited called \"The Columbia History of Post-World War II America.\" He then actually gave me the book for free and autographed it with a really funny and insightful message about appreciating history. \nClearly, I can't say enough good things about this professor. \nWorkload:\nNot that bad, there were a lot of readings but they were interesting. His midterm and final are notorious for being difficult, but if you study in a group and if you study hard, you will definitely do well. I got an A. \n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "January 21, 2010",
            "review_content": "\nI hate to say this, but Professor Carnes is super overrated.  I was so excited to take this course when I came to Barnard.  Everyone always told me it was the best class they'd taken so I thought I'd give it a try, and when I realized I had the program's creator I was even more optimistic, but Professor Carnes was totally out-of-it.  He gave extremely vague instructions which he would refuse to elaborate on to leave us some creative liberty, which would be fine if we knew what we were supposed to do in the first place.  The China game in particular was a travesty.  He told the grand emperor it was okay to announce a successor and make it illegal to discuss the matter farther even though he knew many of our characters needed to address just that subject the next class.  Frankly, it was never clear what any of our objectives even were for that game.  The Greenwich game was a great idea, but vague instructions complicated that one as well.  I'm also pretty sure he's senile.  Real life example:\nStudent 1: Professor Carnes, were there other religions besides Confucianism in this time period?\nP.C.: Oh, that's a...great, question.  You know, I'm not sure, but... (sort of rambles. Doesn't directly address what he was asked)\nStudent 2:  Well it says here in the gamebook (written by none other than Professor Carnes) that Taoism, etc, etc, etc... were prevalent in....\nAka, he didn't know basic information from a book he wrote.  Seriously?\nWorkload:\nLots and lots of speeches which will be easy to write for Athens where the instructions are clear, really hard to write for China where there might as well not be instructions, and somewhere in the middle for Greenwich. You should read the gamebooks, but you won't have to really read anything else (except for Confucian Analects.  Know those well.)  Expect to where costumes. \n"
        },
        {
            "course_name": "Re-Acting to the Past II",
            "review_date": "January 11, 2009",
            "review_content": "\nHands down the best course I've taken at Columbia. Combining politics, history, debate, law and theatre, I've learned and retained more from Reacting than any class I've taken in my 17 years of education. Mark Carnes is a genius and will first teach you the material in an exciting way, and then will let you act out the material for yourself. He will work with you in developing any ideas or strategies you may have. As someone who is terrified of public speaking, I have become so much more confident after this class. I have made friends (who can say THAT after any other class at Columbia??), and come away with solid memories. TAKE THIS CLASS!\nGrade recieved: A\nWorkload:\nPretty heavy, but it's all a joy. 30 pages of writing that need to be split up between two 'games.' This will come naturally to you though, as you will be submitting letters and editorials and writing treaties just to keep up with the game. \n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "December 20, 2008",
            "review_content": "\nAn excellent history class.  As a history major (I took this class first semester freshman year) I found the reading to be quite light.  His lectures are captivating and the material is FASCINATING.  NO SECTION is a major plus.  Take this class, but be prepared to study for the midterm and final.\nWorkload:\nThe reading isn't bad, but the midterm and final are brutal.  I didn't take the option to write research papers in lieu of the midterm or 1/2 the final, I just studied my butt off.  He puts past exams in the course packet--BUY it and MEMORIZE answers to past tests.  If you memorize the short stuff, the essays will be easy.  I got an A.\n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "January 21, 2008",
            "review_content": "\nTake this class! This class will give you an overview of everything you need to know in recent US history. And, as expressed by others, he is a captivating lecturer. He adds anecdotal stories to help you understand the events he describes. \nWorkload:\nNot much work throughout the semester is needed for the tests. I would encourage you to read the primary documents (he often quotes those on the tests) but it is not necessary to read much of anything else because he covers the important parts in class. Start to study for the midterm and final a week or two in a advance if possible. \nThe practice exams he gives you are key. And although the tests are challenging (you have to put events in chronological order and one mistake will cost you the whole question) he is a very fair grader.\n"
        },
        {
            "course_name": "Reacting III: Science & Society",
            "review_date": "December 09, 2007",
            "review_content": "\nReacting with Carnes is always a blast!  If you want a class that feels more like playing pretend than doing school work, this is the one for you.  The games are usually structured so that you come to each class ready to debate, present speeches, and vote on issues.  I don't really like science much, but these games got me interested and involved with theories and scientific research in a fun, painless way.  Sometimes the discussions got heated, but it just goes to show how much we all cared about the subjects.  For a unique and enjoyable learning experience, step into Mark Carnes little world for a semester.  You won't regret it!\nWorkload:\nDoesn't really feel like work.  20 pages to write over the course of the semester, but you can break them up into four five-page papers which just fly by.  The nature of the class structure requires some meetings with other students outside of class, but nothing overwhelming.  Definitely recommended.  \n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "November 11, 2007",
            "review_content": "\nCarnes is the man. Great lecturer, very dramatic. Walks you through the decision making process that leaders undergo to make policy. Definitely want to take his class if you are a history major, or just want a history elective. One of the best in my time here at Columbia.\nWorkload:\nHard midterm and a hard final, study well in advance and you can do fine. Reading is a little on the heavy side but there is a fair amount you can skip\n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "January 09, 2007",
            "review_content": "\nThe previous reviewer is absolutely right in regards to Carnes' overly dramatic style & exams that do not adequately demonstrate the material covered in lecture and reading.  However, I found this class to be enjoyable and not too challenging.  I believe that Carnes is the most interesting and captivating lecturer that I've ever had.  However, I would come away realizing that his arguments would usually be overly simplified and totally gloss over or ignore major events of the period, such as the Cuban Missile Crisis.  The reading is doable & usually does not match the lectures at all, but is useful to understand ideas for the exams.  To study for the exams, use the practice exams in the book & having a study group just to help figure out what type of questions he could legitimately include is very useful.  This class is also very flexible in the amount of work you want to do.  Carnes offers the opportunity of a shorter final for those who are pass/failing.  \nWorkload:\ndecent to light reading\n1 midterm; 1 final (part I: choose 10 from date regurgitation, chronology, & ID questions; Part II: 1 essay on midterm; 2 essays on final)\nthe midterm & 1/2 of the final can be substituted by research papers which are very specific & outlined in the coursepack\n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "October 22, 2006",
            "review_content": "\nCarnes is among the most infuriating professors I've encountered during my college career.  I should have dropped the class the second class, when he read aloud from notecards he had asked us to fill out with our greatest fears and reasons for taking his course.  With a self-satisfied smirk, he mocked the fears of students who were never aware that what they were writing would be made public, and smugly read the answers of those who praised him as their reason for taking the class.  Things only got worse.  His lectures are sensationalist versions of history, devoid of any and all meaningful analytic content.  Carnes seems to see the class as an opportunity to exercise his dramatic skills, pandering to the class members' emotions, to the extent that he once ended a class by breaking off in the middle of a reading about Hiroshima, head in hands, whispering, \"I can't go on.\"  His tests do not test content.  Rather, he asks for what he himself calls \"date regurgitation,\" and, when he gives students a list of dates to supply, he will not give partial credit if even one of the dates is missed.  How could this possibly further learning?  All he seems to be concerned about is furthering his own reputation as a tough but beloved professor.  I feel like I've gained nothing from this class but a handful of random dates.  (Anything I gained from the reading could have been done on my own time.)  If you're looking to reinvigorate your love for American history after the disillusionment at Mark Carnes version of \"history,\" do yourself a favor and take one of Sarah Phillip's courses. \nWorkload:\nOne midterm (ten id's, date regurgitations, and one utterly pointless essay that is just an excuse for Carnes to display his \"skills\" at writing prose) or paper option, one final, average amount of reading.\n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "December 20, 2005",
            "review_content": "\nBEST CLASS EVER.  Do not leave Columbia without taking this class.  Carnes is quite amusing and the class is just brilliant, it will change your life and you will make friends...no joke.\nWorkload:\nSomewhat heavy workload but you hardly notice.  Most of it is just angry ranting and heated debating.\n"
        },
        {
            "course_name": "Re-Acting to the Past II",
            "review_date": "December 19, 2005",
            "review_content": "\nAmazing class! fantastic way to bond with your classmates, cover interesting material, and really feel like you are LEARNING.  I know i will retain waaaaaay more information from this class than any other history class i've ever taken.  Carnes is great and is totally into the class.  At times things could get pretty crazy, but that was part of the fun.  This is definately one of those classes where the more put in it the more you'll get out of it.  I would totally recommend this, or any other reacting class. \nWorkload:\nbasically 25 pages over the course of the semester broken down however you want.  It comes VERY easily as you'll be making plenty of speeches to cover that length.  However, as a disclaimer, this class MAY take over your life. (after class plotting, meetings, im-ing, etc)\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "January 04, 2005",
            "review_content": "\nProf. Carnes' class is very bent on understanding the foreign policy of the US Post WWII up until the 1980s.  Very little time spent past Reagan.  He's really engaging in his lectures, and provides outlines every class so you can follow the lecture.  He's a real stickler for dates though, and you really have to attend his lectures to pick up on weird/quirky quotes that might just show up on a text.  Overall, I really recommend this class b/c Carnes is so interesting and thorough.  Also, its a pretty easy class to take if you just want a history elective, but you really have to come to all the classes, the readings, other than the text book, are really not essential to do.\nWorkload:\nA midterm and a final.  Instead of taking the midterm, there is the option to write a paper.  For the final, which has three parts (short answers and two essays), you can opt to write a paper instead of doing one of the essays.  I took both tests and did fine, but i definitely had to memorize, a lot a lot.  \n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "January 03, 2005",
            "review_content": "\nAmong the best classes I've taken here.  Prof. Carnes' lectures are terrific, very engaging and enthusiastic.  Most importantly, you'll learn a lot just by coming to class, independent of the reading.  He's very available to students, so it would be to your benefit if you took advantage of that.  The class isn't really difficult, so it's also great if you just want an elective history class.  Prof. Carnes goes out of his way to make sure the lectures are relatable, interesting, and accessible without being dumbed-down.  Great class.\nWorkload:\nMidterm and final.  Come to most of the classes and do the more interesting reading and you'll be fine.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 31, 2004",
            "review_content": "\nThis class would be excellent if called \"American Foreign Policy since 1945.\" His lectures on nuclear policy, Vietnam, the Cold War, and the causes for much of the developments abroad are fascinating, sometimes funny, and often quite original.\nHis lectures about social/domestic issues, however, are sadly incompetent. During the 1950's, EVERYONE was white, middle-class, and suburban. All women are white. Gay people are only part of history because of the AIDS epidemic (no matter what McCarthy's policy was on homosexuals in government positions). Rosa Parks' refusal was a spontaneous act, and the bus boycott began without any planning beforehand. Oh, and the feminist movement, student rebellions, and the Civil Rights movement are \"Entre'acts\"--historical sidenotes that happen in between the big important stuff the politicians do.\nCarnes is funny, thoughtful, nice, and an engaging professor. But only about stuff that happened outside our borders.\nWorkload:\nEither one (really hard) paper or a (really hard) midterm.\nOne (really hard) research essay and half of a final exam, or the entire final. Manageable readings.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "June 07, 2004",
            "review_content": "\nI ought to not further extol the man because, considering the antecedent reviews, any more praise of Carnes would be gratuitous but, well, his charisma besots students, inexplicably impelling them to indite sonnets and panegyrical testimonials about the beloved legend of 320 Barnard. He is the history department's version of Michael Jordan: one would truly prefer to despise the guy because of his unabashed hauteur (make no mistake: he is noticeaably arrogant) but, well, forasmuch as Carnes consistently \"throws down his 32\", is consistently hilarious and enthralling lecturer, one is forced to avouch his grandeur. Carnes is not all style and no substance: he is actually knowledgable and insightful, eschewing a regurgitation of historical bromides and instead propounding fresh, thought-provoking analyses (to respond one of the above reviewers, every American history book that one entertains from infancy suggests that the causative of the Vietnam War or rather its perpetuation was Cold War posturing/domestic politics; at least Carnes, in his \"hubris assessment\", manages to introduce a new phrase into the Vietnam War anatomy lexicon. And on discontent about Carnes' treatment of Watergate: come on... who really does not know about Watergate? Why not then, as Carnes does, concentrate on the \"larger issue\" i.e. the furtive malfeasance and cabalist machination of Nixon's administration that still largely remains unbeknowst to the general public?) Carnes is the sort of professor that makes you actually want to attend class; its 11 a.m. start time and Monday-Wednesday schedule will inevitably result in an episode or two of truancy but one will find oneself repining for Carnes class.  Like Foner's Civil War course, Carnes' \"America Since 1945 \" is a must for anyone who, after four years, will want to have been minimally compensated for their $170,000  \"contribution\" to the \"wax the Alma Mater\" fund. You will not regret your enrollment.\nWorkload:\nA slightly less-than-standard history class load (100-150 pages a week) of reading that Carnes qualifies as \"optional\" but, well, really is not. My advice is to read the transcripts of the Senate hearings in the McCarthyism book and certain \"important\" speeches in the Vietnam book (say, the LBJ 1968 \"I shall not seek...\" address and Bao Di's abdication) because they will be used as identifications on the midterm and/or final. A potentially difficult midterm and final insofar as, well, the sequence identifications can kill: there is some truth in the above reviewer's assertion that your grade could depend on whether or not you know, say,  when abortion was legalised in Connecticut (the sequences can be that punctilious). Optional paper that counts for 1/3 of your grade as it can be substituted for the final exam essay section. Do not do this paper forasmuch as people who do it generally receive Bs on it (the indolence penalty) and the final essays are \"fun\" in the masochistic sense of that term (Carnes calls them \"interpretative\"). NO SECTION!!! The m.o. for an A is the following: a) attend 90% of the lectures (you'll want to anyway...in the event that you ever feel like skipping, however, do so during the first \"feminism\" lecture: I am not a sexist or anything: this can be done simply because Carnes repeats most of the themes of this lecture in a later \"Fall of the ERA\" one. The other possible skip date is the \"Great Mandella\" one - it is interesting but, well, insofar as your grade is concerned, inconsequential) b) purchase (unless it is posted like last fall) the exam booklet to gain some sense of exam format and with such in mind c) read the relevant sections of the readings for test identifications and d) make sure that you have every handout as the midterm and final exam sequences require that one essentialy memorises certain \"salient\" dates contained on the handouts. \n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "April 17, 2004",
            "review_content": "\nCarnes is not a god, but he's a good professor.  Before class each day he has a coffee hour in Mac where you can stop by and chat about the course.  If you think you can do this and suck up, don't bother; faceless TAs grade you and he never remembers faces.  But, it is a good opportunity to ask questions about his speedy lectures. I thought the readings were really well-written and interesting, although I realized at the end that you didn't have to do them  His tests are unfair because they don't assess your knowledge, but he gives sample exams from the past, so just memorize the answers to those exams and you'll do great.  If it wasn't for messing up one chronology on the midterm, I would have gotten an A/A-, instead I got a B-BECAUSE OF ONE QUESTION THAT TESTED MY KNOWLEDGE OF EVENTS THAT WERE A FEW DAYS APART. But, Carnes knows that his tests are unfair, and so if you do better on the final he discounts the midterm.  Overall, Carnes' humor, insight, and vivacity made this class worthwhile and very do-able.  I'm very glad I took it because I learned a lot about US history that I didn't learn in h.s.  Just one piece of advice-memorize the dates he gives you for the exam (its really easy to do), and do not answer the chronologies, ever, no matter how much you think you know it.  It's not an easy A, but if you work hard and take good notes with careful attention to detail, you'll really love this experience.  \nWorkload:\nAn in-class midterm or take-home paper; and an in-class final with the option of substituting one-part with a take-home paper.   Not a lot of homework, just really good reading that you can use as procrastination for the real work from your other classes.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "January 10, 2004",
            "review_content": "\nI loved this class, and I loved professor carnes. He presented the material in an interesting way, runing through the major events of the past 60 years in \"stories\" and concentrating on particular themes than just straight history.  The man obviously knows his material inside and out and makes an effort to make his lectures humorous and animated.   Some reviewers have complained about the format of his tests, but Carnes makes available all midterms and finals from the past 10 years which are extremely similair to the test he gives, which makes the tests a lot less difficult. Though there is a lot of reading, attendance at lectures and good note taking can make up for avoiding a good chunk of it. Hands down, this was the best class I have taken at columbia, and I would recommend it to everyone!\nWorkload:\n1 midterm, 1 final, (both half ID's and half essay) and a good amount of semi-optional reading\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 17, 2003",
            "review_content": "\nThis class is an unmitigated disaster. It is remarkable, actually, in that it is everything a history class shouldn't be.  We didn't EVER talk about why things happened, instead Carnes would stand up there and lecture like the little annoying professor that he is.  He would tell \"stories\" of history, that is, he would \"strip away everthing interesting, or nuanced, and give the class a crappy account of what happened.\"  His tests are worse. They are half IDs and chronologies, on which there is no partial credit.  Thus, half of your grade, esentially, is knowing whether new york or hawaii legalized abortion first.  On top of that, the essays DEMAND that you do an ad-hoc analysis of history (what would have happened if nixon had won in '60.. how would american have been different.. remember that we have the asset of hindsight).  One other thing: he has this theory of the vietnam war that it was exclusively hubris that let america to get in and stay in.  That is, there was nothing domestic, nothing else international, and the presidents that made the decisions had no individual personalities.  It was the most pathetic attempt at teaching i have ever seen.  And people love him because he talks in a stupid voice, and is completely unintellectual.  This guy shouldn't be teaching at a community college, let alone Columbia University.  Not only is he a bad professor, but he is dangerous--students that take him have be taught exactly how NOT to do history, and as they go forward, it's unfortunate that this is what they have to look back on. UCH!\nWorkload:\nmidterm and final. that's it. no section. no reading that anyone did. no nothing. oh, and no thinking. just memorize dates. no thinking necessary.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "November 30, 2003",
            "review_content": "\ncant really add much more to the great, and true reviews. only can add that the textbooks used were some of the best written and most interesting i have had and that my only complaint is that i wish there was more discussion of social and domestic issues. its a lot of foreign policy\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "November 11, 2003",
            "review_content": "\nProfessor Carnes identifies \"hubris\" as the impetus of American foreign policy and dismisses the Communist threat as \"a paper tiger.\"  More irksome is his belief that he is some sort of god.  Strangely, though, as much as I tried to dislike him and to be bored by his theatrics in front of the blackboard - and to yawn at his jokes - I found myself becoming more and more fascinated with his lectures.  I laughed loud - and often - at his sparkling wit and his ability to convey history through his own spastic gesticulation.  By the end of the semester, I realized that Carnes vanity is a result of his own good taste.  I expect never to encounter a more engaging lecturer or a wittier comedian in the form of a professor.  Though his politics are diametrically opposite my own, I have great respect for Carnes.  If he taught basket-weaving next semester, I'd be the first to sign up.\nWorkload:\nHard hard hard tests.  Optional essay will help to some degree.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "May 27, 2003",
            "review_content": "\nMark Carnes is a good and engaging lecturer and a really nice guy; however, I think he is really unclear on what he is looking for on the writing assignments (the midterm, the midtem paper, the final). Though the class was interesting and there was no discussion section, he is a tough grader. He is, however,  very accessible outside of class and responds promply to emails.\nWorkload:\nMidterm or Paper (8-10 pages) and a Final Exam\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "May 20, 2003",
            "review_content": "\nI really enjoyed having prof. Carnes. He is incredibly enthusiastic about teaching and every one of his lectures was informative and engaging. True, the class did not cover every single influencial event/person in the time period, but how could it? Instead, prof. carnes' lessons were expertly edited and contained unique antecdotes that I never came across in any history textbook. Also, I want to note that even though the class size was huge, prof. carnes made an attempt to get to know his students on a more personal level- he was always open to questions, and he gave an open invitation to have coffee with him everyday before class. \nWorkload:\nThere is a large amount of  (mostly interesting) outside reading, which is somewhat optional (but you never know what will appear on the exams). Grade-wise,  there is a midterm and a 2-part final. Two out of these three components can be replaced by 8-10 page research papers.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "May 19, 2003",
            "review_content": "\nEvery good thing that's been said about this man is true.  He is a wonderful professor, the best I've had at Columbia.  The course is fascinating, he dissects the events your parents talked about but that you knew really knew about.  Carnes is funny and creative, his lectures are well-organized and interesting, and the entire course was a great experience.  Go to lecture, for the exams as well as for the experience of learning from Carnes.\nWorkload:\nReadings are varied, some are longer, others are shorter, just skim them and you'll be fine (especially the Vietnam reading), although you may find some of the readings really interesting and actually want to read them.  The 8 pg papers tend to receive Bs, I would suggest taking the exams instead, they're somewhat hard but not impossible.  The exam booklet is VERY helpful, study it carefully, the actual exams are very similar.  The exams require a good deal of studying, but once you know the material, you'll be set for the exams.  The final counts for twice as the midterm, so study hard for it.    \n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "May 16, 2003",
            "review_content": "\nGREAT lectures that are engaging and fun to sit through.  He likes to get to know students and allows people to yell out suggestions/ideas in the middle of class.  Great overall--highly recommended!\nWorkload:\nReading load is reasonable but it's not necessary to read everything--take notes on the lecture instead.  I would suggest reading only to cover the material missed in class.  He gives you a lot of options--you can write a term paper or take the midterm (the term paper was what I did and it was graded by a TA and then boosted from a B+ to a B+/A- by Carnes).  Then, for the final, you can opt to write a term paper in place of one half of the exam.  I suggest taking the exam because you just have to study dates (which he tells you) and historical \"stories\" of important events (such as Watergate or the Vietnam War)--he expects you to get the scheme of things not the minute details.  He supplies the class with previous exams that are extremely helpful for studying.\n"
        },
        {
            "course_name": "Re-Acting to the Past II",
            "review_date": "May 11, 2003",
            "review_content": "\nYes, I'm one of them! One of Professor Carnes's obsessive fans who would tell anyone that if they have the chance to take a class of his, they should jump at it! I haven't taken his America since 1945 class(although my roommate says it's amazing and he's unbelieveable) but if you have the chance to be in Carnes's reacting class, when you can really get to have an intimate class with him, do not pass up the chance. Professor Carnes is soo interesting, brilliant and fun...He is soo cool and will talk to you anytimeee, even at 1 am on AOL, which you def. will have many conversations wiht him because he knows everyone's screenname and makes sure to use them. The class is really an unbelieveable experience-while sometimes it does get annoying , you learn to appreciate the style of learning really quickly and realize that you're getting more out of this class than all your other classes combined.  I would recommend Carnes and this class to anyone!\nWorkload:\nAround 6 papers(same in all Reacting classes) depending on your role...no midterm or final, which is soo nice come final time. Carnes is the toughest grader of all the Reacting teachers(but well worth it!) so no guaranteed A but if you write good papers, he definitely won't hesitate to give you a good grade.\n"
        },
        {
            "course_name": "Re-Acting to the Past II",
            "review_date": "May 07, 2003",
            "review_content": "\nProfessor Carnes is AWESOME! He's absolutely amazing, and I highly recommend him! I love Re-acting because it opens your mind to different ideas you may never have given a second thought to or accepted before in your life. You learn about history, philosophy, and you definitely become a better impromptu speech-maker! Carnes challenges you and he is always willing to take time out to chat with you if you need help clarifying your position. He also likes to get people involved in their roles and really getting to the point of whole-heartedly fighting for their part. He taught me that even a \"losing role\" can be a rewarding one (as cheesy as that sounds!). He even throws celebration parties after each game so that the sparring factions can talk about their roles and let go of the tension from the games! If you like a challenge and you like public-speaking (or would like to become a better one)...actually, if you have any room in your schedule under any circumstances I COMPLETELY recommend that you take this class. You will not be disappointed!\nWorkload:\nTwo papers for each of three games, not very tough and can be flexible if you work with others in your faction. He is a fair grader. \n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "May 01, 2003",
            "review_content": "\nHooray for Barnard Classes! Remember that American history class you took in high school? Are you fairly sure that the Bay of Pigs is not the world's most trusted producer of deli meats? Great, you'll do fine in this class. Carnes offers a pretty thurough, but basic, account of US history, and is indeed a pretty amiable guy. Illuminating details are scarce, but overplayed History Channel accounts of the Cold War are legion. All and all not a bad class, just take it for what it is. The most difficult part of this class is listening to the mind numbing questions that come from those swooners in the front row who belong to the \"Carnes is God\" camp. Just put up with it, take your notes, receive your brush up in history, and then move on to a higher level course.\nWorkload:\nSlim, some light readings, midterm, final.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "April 12, 2003",
            "review_content": "\nYou might like Carnes, but he is most certainly NOT a GOD.  This class should be called Cold War Politics.  It is a class almost exclusively based on post war american foreign policy, with very little attention paid to social history, and poor and negligible handling of domestic political issues (except for with Nixon and Reagan).  Carnes chooses to neglect or skim over some key episodes and people in American History based on the principle that they arent really important to the story of history that he is trying to present. (he just started teaching watergate a few years ago if that gives you an idea).  Hes fairly funny and he jumps around, so if thats what  your looking for then go for it,   just dont expect to be enlghtened or anything.  \nWorkload:\nHe calls the readings optional but they are on the tests which makes them mandatory.  Reading load is medium.  Choice between midterm and final, or 8-10 page papers as substitutes for taking the midterm and part of the final. \n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "January 27, 2002",
            "review_content": "\nABSOLUTELY AMAZING PROFESSOR!!! Take any class with him. Carnes is so sweet and smart and funny and sexy (if you go for the professor look). Anyway, he's just wonderful and you will learn so much in History since 1945---and he makes it very Columbia applicable. Also, never EVER pass up a chance to take reacting to the past. It's the best class I've ever had, and I learned so much about history, writing, public speaking, and I made some good friends along the way.\nWorkload:\nHistory since 1945---difficult midterm and final---but you just need to do a minimal amount of reading and go to lectures. reacting---dedicate your semester to this class if you hope to enjoy it and get a lot out of it. you can stay up till 5am regularly plotting and planning with classmates. You'll put Carnes on your buddy list and IM with him at the wee hours of the morning.\n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "January 27, 2002",
            "review_content": "\nABSOLUTELY AMAZING PROFESSOR!!! Take any class with him. Carnes is so sweet and smart and funny and sexy (if you go for the professor look). Anyway, he's just wonderful and you will learn so much in History since 1945---and he makes it very Columbia applicable. Also, never EVER pass up a chance to take reacting to the past. It's the best class I've ever had, and I learned so much about history, writing, public speaking, and I made some good friends along the way.\nWorkload:\nHistory since 1945---difficult midterm and final---but you just need to do a minimal amount of reading and go to lectures. reacting---dedicate your semester to this class if you hope to enjoy it and get a lot out of it. you can stay up till 5am regularly plotting and planning with classmates. You'll put Carnes on your buddy list and IM with him at the wee hours of the morning.\n"
        },
        {
            "course_name": "America since 1945",
            "review_date": "April 11, 2001",
            "review_content": "\nProfessor Carnes, while an interesting lecturer, adeptly erases all controversy from this strife-ridden period of American history. For example, with thinly veiled dismissiveness, he basically deemed the \"social movements of the 1960's\" (indistinguishable, of course) a failure \"because of the backlash they caused.\" Umm, excuse me? Talk about a privileged, biased position. In fact, he supports nuclear armament, Reagon, you name it...He unfairly seeks opposing viewpoints from the class without first framing both sides of the argument (i.e.--we don't know the opposing pov--why don't you tell us? even a strawman argument would be better than none). After presenting Vietnam as an \"inevitable tragedy,\" he then asked the class for opposing viewpoints, pausing only briefly. No one answered. Take this class if you want the basics of war history and the big names in politics (presented uncritically, of course). Don't if want anything other than the \"great man\" theory of history--and one that naively portrays the US as a \"benign superpower\" at that. That seems like Mickey Mouse, high school history to me. I was very disappointed by this class.\nWorkload:\nEasy. No discussion section (though, if you have an opinion at all, you'll wish there were), easy-to-prepare-for midterm/final with an optional paper to count as half of each. Grades easily.\n"
        },
        {
            "course_name": "America since 1945",
            "review_date": "December 31, 1999",
            "review_content": "\nA teacher who is unable to grasp the immediacy and relevance of history's social movements. In his America since 1945, he devoted one (1) class to the feminist movement, and he didn't even spend the whole class on it. Half was about the sexual revolution. And he drew no difference between mainstream, liberal feminism and the broader movement for women's liberation. He also devoted just one class to the entire civil rights movement; even here, he focused unnecessarily on Martin Luther King's sexual scandals. The labor movement got zip. He did, however, spend a whole class teaching us how to make an atom bomb.\n"
        },
        {
            "course_name": "America since 1945",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Carnes teaches his subject with both style and substance. Carnes injects his wonderful sense of humor and wit into every lecture, making each lecture engaging and interesting despite the rather large class size. The material the class covers a broad swath of the American experience attempting to examine every major political and social movement between 1940 and the present. Carnes is a fabulous lecturer who continually moves about the lecture hall infusing his lectures with excitement. Occasionally he will follow a tangent in depth, spending a fair amount of time detailing the history and devolpment of the atom bomb and Columbia's role in the Mahattan Project. His tangents prove to be fascinating, giving his lectures a style all its own often bringing the material to relate to events at Columbia and Barnard. Carnes is a fabulous lecture who can seamlessly include the most significant of quotes or facts in a lecture then immediate switch modes and probe t! he class investigating various student responses to fundamental foreign policy questions. An excellent class that began with a half lecture devoted to simply reading prior student responses to a survey that kept the entire class roaring with laughter for almost an hour! The course itself engage America's political history since 1940 in depth and covers to a much lesser extent the specific social movements paralleling the political developments of the era.\nWorkload:\nA fairly small amount of very optional readings. Most of the material in the readings is covered in class though. A midterm and a final. 2 optional papers.\n"
        },
        {
            "course_name": "America since 1945",
            "review_date": "December 31, 1999",
            "review_content": "\n Great professor. I was sad when the semester ended. He kept the class interesting and fun and applied it to our lives...at Columbia and in general. Whoever wrote the scathingly negative review of his class needs to realize that trying to smoosh 50 years of very intense history into a semester while keeping it interesting is no easy task. If you're looking for a class that dissects feminism into groups, take a Women's studies class. Yes, he could have lectured more on civil rights. But if you did all the readings, you got a pretty clear view of that as well. No class is perfect and perhaps this would be a great class to divide into two semesters-- there's definitely enough material. However, the class as it is was pretty great, and kept me awake and interested despite the fact that it was first thing in the morning. Go Carnes! Take the class.\nWorkload:\none midterm, one final, 2 optional research papers\n"
        }
    ]
}