{
    "prof_info": [
        {
            "prof_name": "Valeria Luiselli",
            "prof_id": 9928,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Translation Studies",
            "review_date": "December 15, 2014",
            "review_content": "\nProf Connor's class was very enjoyable. The field of Translation Studies is very new but he still manages to raise interesting issues throughout the semester. That being said I felt the class was kind of wishy-washy. I enjoyed it and thought it was a great class, and I don't regret taking it, but that being said, if you're looking for more practical, hands-on application, you might be a bit disappointed with this course. There is only one required translation assignment, though it is an option for the final. Given that it's a large lecture (100+ students) with only four TAs, it makes sense that there aren't many assignments. \nThe lectures are often just Professor Connor discussing what he thought was important, and him trying (and sometimes failing) to solicit class participation. Sometimes certain readings were never discussed at all, though it is usually helpful to read them. Usually every week we'll have three or four readings (no more than 20 pages, usually they're very short) and Professor Connor will pick one or two and extensively discuss them. You may nor may not appreciate this approach. \nEven though Professor Connor runs a great class about an interesting topic, I felt his lecture style is pretty standard for a college course. His lectures aren't fabulously engaging though they are very informative. He tries his best to engage with students but he is very much the stereotypical \"ivory tower\" academic, and it comes across in his class. Most of what we do is dedicated to theory though I suppose his spring seminar on translation would be more dedicated to practice. I haven't taken it though, so I can't comment. \nAll that being said he genuinely cares about us and he wants to see us do well. He calls us all aspiring translators (which I guess we are) and always has nice things to say about us, just for taking the class. He wants us to learn, and he seems to enjoy teaching, which is more than you can say for other professors at Barnard or Columbia. So all that said, if you have fulfilled the language requirement, you should definitely take this class. It is a very fun class in a subject that everyone is interested about since it really is everywhere nowadays. \nMy TA was Valeria Luiselli. I am very glad to have been able to get her comments on my work. She was very approachable by email and after class, and very knowledgeable about the course material. She would also participate in the lecture with relevant information. All you could want from a TA. The other TAs were equally helpful, from what I could tell. \n\nWorkload:\nParticipation and pop quizzes (15%) -- the easiest things ever. I felt the quizzes were more to ensure attendance than to ensure comprehension. We also had to post questions for guest speakers, which factored into the grade. There is an attendance policy (max two unexcused absences) though it is hardly ever taken. \nLanguage memoir (20%) -- very simple story about your bilingualism and how it developed. It's a very creative assignment, around 4 pages. \nTranslation (20%) and Peer-Critique (10%) -- also simple. You pick a source text, which is about a page, and you translate it. You then send it to your partner and they critique it, and you critique theirs. You can pretty much pick any prose from the 20th century. \nFinal Project (35%) -- 7-10 pages. You get to select from five prompts, and one of them is a translation project (which I did). You translate four pages of source material, and you can pick almost anything, even a poem. You then translate it and write prefatory notes. Altogether it came out to about nine pages. Other topics included: 1) discussion of community interpreting or subtitling/dubbing; 2) translation critique; 3) essay about a play (Brian Friel's Translations); or 4) an interview with a translator. \n"
        },
        {
            "course_name": "Intro to the Study of Hispanic Cultures",
            "review_date": "May 30, 2014",
            "review_content": "\nAnd four for you, Glen Coco!!!\nValeria was an absolute star this semester.  From the beginning, she said that her goal was for us to be able to talk intimately as a class about things interesting to us about Hispanic Culture, and that's exactly what we did.  We went through units on music, film, art, the concept of the nation, etc.  The purpose of the class was to become equipped with the tools to properly study Hispanic cultures, while at the same time improving our speaking, reading, and writing classes.  Most classes were theme-based around a specific aspect of Spanish culture and the associated readings, but every so often we would have a writing workshop/grammar class.\nMy biggest suggestion would be to participate in class discussion as much as possible!  Everyone made mistakes in his or her spoken spanish, but that was not the point- it was the effort.  Active engagement earned high grades.\nThere are 3 essays.  Each essay cannot exceed 3 pages. You turn in a first copy of the essay which Valeria took the time to correct line-by-line, word-by-word.  You would then turn in a second copy the following class based on those VERY detailed corrections.  My grades on the first turn in (which needed MANY corrections) ranged 88-94, and the second turn in was a 100 every time (making the corrections she asked me to make).  Your grade on each essay is the average of the two versions.\nAn additional final essay took the place of a final exam.  This one was about double the length of the previous essays, and we were only able to turn in one copy.  It was on a topic of our choice (related in some way to Hispanic cultures).  We gave very short essay proposal presentations to the class.\nValeria is kind, understanding, and highly intelligent.  I ran into a few rough patches personally this semester, and she worked with my every step of the way.  I would recommend both this class and Valeria, in particular. \n\nWorkload:\nNightly readings (most people at least did some of them, useful for class discussion), 40% participation, 3 essays, 1 additional final essay. No midterm, no final.\n"
        }
    ]
}