{
    "prof_info": [
        {
            "prof_name": "Valerie Keller",
            "prof_id": 2365,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Hispanic Cultures II: Enlightenment to the Present",
            "review_date": "April 10, 2010",
            "review_content": "\nValerie Keller is an extremely intelligent professor, even if she is only a graduate student. She always has awesome insight to bring to all of the readings and topics, and she does a great job at facilitating class discussions. She is a tough grader, especially on the compositions, but she is a great teacher. The class itself is pretty interesting, although the chapters try to cover so much material at once. Although Valerie expects a lot of you as a student, you will grow as a writer and as a critical thinker in her class. She pushes you to develop your writing and analytical skills, and expects a lot of participation from you. If you are a Spanish major, I would definitely recommend on taking this class with her, but don't expect it to be a breeze because you have to work very hard for a good grade in this class. \nWorkload:\n7-8 short compositions (3 with rough drafts) throughout the semester, 3 non-cumulative exams (IDs, short answer, and essay), 1 presentation, readings every night \n"
        },
        {
            "course_name": "1202",
            "review_date": "May 09, 2007",
            "review_content": "\nTake Spanish with Valerie if it's at all possible. As somebody who learned Spanish, as opposed to being a native speaker, she really understands how to teach the language so it makes sense. She's understanding about the occasional screwup with homework assignments and attendance as long as you show her that you actually are making a sincere effort, and she always made sure that we understood the material instead of rushing us on.\nWorkload:\nShort homework assignments almost every night, 3 short essays (you can meet with her and rewrite the first 2), 1 oral presentation on any cultural topic, quizzes on every chapter, midterm, final. The workload is fair and consistent.\n"
        },
        {
            "course_name": "1202",
            "review_date": "May 09, 2007",
            "review_content": "\nTake Spanish with Valerie if it's at all possible. As somebody who learned Spanish, as opposed to being a native speaker, she really understands how to teach the language so it makes sense. She's understanding about the occasional screwup with homework assignments and attendance as long as you show her that you actually are making a sincere effort, and she always made sure that we understood the material instead of rushing us on.\nWorkload:\nShort homework assignments almost every night, 3 short essays (you can meet with her and rewrite the first 2), 1 oral presentation on any cultural topic, quizzes on every chapter, midterm, final. The workload is fair and consistent.\n"
        },
        {
            "course_name": "1101",
            "review_date": "January 17, 2005",
            "review_content": "\nLooking for the right introduction to espanol?  Worried about spending 5 days a week with the same professor?  Want to actually enjoy the experience AND learn the language?   Look no further, because Valerie is your safest bet.  \nValerie is not a native Spanish speaker.  Since she has had to learn the language from the ground up, she possesses the essential sympathy that is all too often lacking in professors, particular in the foreign language departments.   She is a graduate student who is both well read and well traveled; she is able to draw on not only her knowledge of the language - but of the world - to keep the material fresh and interesting.\nThere were clearly people in our class for whom this material was a review, and still others who couldn't spell 'spanish', but she managed the various levels with grace and ease, ignoring none while challenging all.  Very available during office hours, fair (generous) grader, assuring you that 'effort counts,'  and then putting your grade where her mouth is.  \nWorkload:\nQuiz after every chapter (there were 8), several compositions (she welcomed drafts and corrections, adjusting your grade accordingly), tough midterm and final.  Be prepared to work, but trust that it will be recognized and rewarded.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 01, 2005",
            "review_content": "\nValerie is a great teacher for beginning Spanish.  She is funny, calm, and really makes you learn.  She was able to combine her youthfulness and intuition with pop culture with her ability to really drive the points home.  She was confident in teaching, which is really important for young grad students and much appreciated.  Our class ended up being really fun and had a joking atmosphere.  Consider yourself extremely lucky if you get Valerie -- she's a gem!\nWorkload:\nSame as any 1101 class.\n"
        }
    ]
}