{
    "prof_info": [
        {
            "prof_name": "Linda Beck",
            "prof_id": 1024,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 17, 2006",
            "review_content": "\nI enjoyed this class and am glad I took it with Professor Beck. I found her lectures engaging, though the readings were sometimes a bit excessive in comparison / conjunction with work from other courses. The TAs for this class were absolutely amazing, and I would recommend going to discussion sections (which were mandatory). The midterm and final had the same format and were graded very fairly. Excellent class!\nWorkload:\nweekly readings, 10-page research paper, midterm, final (5 ids, 2 essays)\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "April 26, 2006",
            "review_content": "\nShe is an outstanding professor. I really enjoyed her class. I came in knowing nothing about the topic and only taking it to fulfull a major requirement, and I left with a general love of the subject. She engages the class in discussion even though it is a big class, and reviews the material slowly so that everyone will understand it. \nWorkload:\nA lot of reading, a midterm, a final (not cumulative) and a 8-10 page paper. definitely doable and shes a fair grader. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 30, 2006",
            "review_content": "\nThe other reviews are right on. This woman was not my cup of tea. Unfortunately, you will hear otherwise from those less experienced with professors of political science. In short, Beck babbles incoherently on the most inane points, she cannot complete her thoughts, she is unable to teach on a college level probably because she seems completely oblivious to the fact that her students are out of diapers and have had some (sarcastic) education before. She will spend more time running a commentary about things happening in the class amongst her students i.e. \"as this gentleman just asked\", \"what I'm trying to get you to see\" \"this is crucial folks\" yada yada yada without EVER getting to the point that she is leading up to. Without ever getting to the essential INFORMATION of comparative politics and the country she is talking about. I don't know whether this is a result of her shallow level of knowledge or if she just doesn't understand what a course is all about. She quotes pop culture tv shows more often that real world issues. Oh and don't be fooled by her grand theatrics and overdone gestures all to pretend as if she is saying something of paramount importance and complexity. She dummies every potentially fascinating thing down. The TAs however are fabulous and will be the saving grace of this class.  \nWorkload:\nStandard poli sci lecture course. Go to discussion, do the reading, and go or not go to the lectures. You'll be fine.  \n"
        },
        {
            "course_name": "Intro to African Studies",
            "review_date": "December 18, 2005",
            "review_content": "\nI adore Professor Beck. She knows exactly what she's talking about, her lectures are fascinating, and she cares about her students. I learned a lot in this class and I would recommend it to anyone. \nWorkload:\nmidterm paper and exam, final paper, final exam, some postings, a lot of reading \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "November 09, 2005",
            "review_content": "\nDon't bother asking questions when she pauses her lectures for class discussion; if what you ask about isn't specifically on that day's PowerPoint presentation, she'll fumble around for a bit, and then promise to \"get back to you later.\" Had this happened once or twice, I might be inclined to say she was just lazy; however it happened continuously throughout the semester.\nAnother weird thing about Beck is that she constantly tries to dress up this class as phenominally difficult. Maybe she's overcompensating for something else lacking.  Maybe she resents the fct that she's stuck teaching a required Intro class. Anyway, don't believe it. This class is easy (can we all agree that any class that involves regular use of PowerPoint is not challenging enough to be taught at Columbia?). \nWorkload:\nMidterm, final. Easy easy easy. Also a 10 page paper about a country and its political situation. Just make friends with your TA and they'll help you through it.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 21, 2004",
            "review_content": "\nShe's a nice lady but sometimes I felt like she was treating the class like toddlers. Now I really don't mind when teachers baby you (especially for grading) but she got really annoying sometimes. Don't let her scare you about the readings. If you have a good TA (like I did) you'll be just fine. Some sections of the class were great, others I wanted to shoot myself. \nWorkload:\nPaper, midterm and final. Section is once a week and counts for a minor part of your grade. I found grading to be pretty fair. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 11, 2004",
            "review_content": "\nLinda Beck is a good professor whom seems to work very hard at teaching, organizing the class, preparing lesson plans, and cooperating with the TAs. I wasn't that crazy about the class, probably just because it was an intro class and the material was expansive and superficial. I felt like the readings were sort of a pain, because they all had to be completed every week in order to \"participate\" in discussion section. And I thought the readings were a little boring, and definitely lengthy. All in all not a bad experience. She brought in really good guest lecturers.\nWorkload:\nReading is a little excessive and a little boring; 1 research paper (7-10 pp) (easy); midterm and final same format, pretty short and fair.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 08, 2004",
            "review_content": "\nThis class is a required waste of time. Emphasis is placed on memorizing vocab and being able to BS on essays, which is totally mindless and unhelpful to actually learning the material. Beck picks readings which are dry and ill-suited to the topics being taught, and it's quite possible to avoid doing them at all if you can collect the vocab needed for the midterm and final. Lectures are boring and confusing, and a substansial amount of time is wasted on questions and debates that are not intelligent or worthwhile. Avoid taking this class if you can -- it's not hard at all, but you'll resent having to waste your time.\nWorkload:\nLight and mindless. In class midterm and final, 1 term paper on almost any topic you want.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 16, 2003",
            "review_content": "\nPretty straight forward class.  Professor Beck teaches with great clarity.  The material is appropriate for an intro level course.  Each class is outlined on the blackboard so you know what to expect and explains the topics very well.  She takes a bit too much time to answer questions but is genuinely interested in what students have to say.  Beware, though all of the TAs were nice, some are very difficult to understand.  Also, some TAs take attendance and some don't...so choose wisely.  Overall, a solid class--I highly recommend it.\nWorkload:\nEasy--since the midterm and final were both take home essays, you don't have to do all of the reading (though it's very interesting).  Just do the reading relevant to your paper topics.  There are also two quizzes that are based on terms/topics that were discussed in class and discussion section.  For the quizzes, just make sure you understand the topics and their relevance to politics--no need to read the readings in detail for the quizzes either--just study your notes from class!  \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 01, 2003",
            "review_content": "\nLinda Beck is one of those few professors who can take an introduction course and make it interesting.  Yes, she is politically correct and she may talk about issue that some people do not care about, however, given the fact that this class could have been a tortuous experience, bordering on a violation of human rights, it was quite tolerable and at times even enjoyable.\nIn terms of presentation, she is very well organized and appears to prepare for the lectures.  She adds variety by having guest lecturers and although she does have a tendency to tolerate too much class discussion, if you HAVE to take an intro to political science class, then this is a good one. \nThe worst part of the class was the other students.  Be very prepared to be in a class of people who know absolutely nothing at all, along with people who know too much.  The reason I mention this is that it makes the discussion sections and in class comments tolerable if you always keep this in mind. Beck does a very good job navigating the mix of students, which does take talent. In addition, she tries to answer/respond to the questions and comments by relating them back to the topic she is addressing. She is accessible in office hours, and willing to help. \n\nWorkload:\n Reasonable reading load for a Political Science class. Discussion section is mandatory (choose the TA carefully, however), a take home midterm and final, a 8 to 10 page paper (flexible topics) and two Â“readingÂ” quizzes. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "August 05, 2002",
            "review_content": "\nBeck is so intolerably politically correct she made my nose bleed every morning. She is totally insecure, has no opinions worth sharing, and is, in toto, as good a professor as Elmer Fant after his third consecutive stroke. Avoid her Intro to AFRICAN politics at all cost.\nWorkload:\nTrite.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "August 03, 2002",
            "review_content": "\nTeaching is boring, at times suggestive and patronizing. Beck is blubbering endlessly about, in my opinion, super-unimportant issues, skipping most of important topics in politics. TAs were great though, saved our sorry asses.\nWorkload:\nNormal to light.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "July 23, 2002",
            "review_content": "\nWhile reading the first review I was all set to sit back and decide \"it's all been said.\" Then I read the second. Whoever wrote that is exactly the kind of student that the first reviewer was complaining about. If you don't understand the material, that's what the mandatory discussion sections and office hours are for. I found Beck's lectures well organized and informative; she connected well to concepts and theories of which the reading provided examples without summarizing the texts. However, she was at times hard to keep up with, simply due to the speed with which she spoke--a direct result of too much time lost to questions. Her one unforgivable mistake (besides bringing in the librarian)was entertaining questions which should have been answered by \"it's on the syllabus.\" All in all, a good professor, but a little too nice.\nWorkload:\nThe first reviewer had it right: pretty standard, certainly fair for this level course, and didn't even look \"intimidating.\"\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "July 20, 2002",
            "review_content": "\nA simple rule: when teaching 100+ students, don't attempt class discussion. Yes, yes, students need to be engaged and monotonous lecturing is bad, but having suffered bleary-eyed through this course (it was at nine, and I am lazy), I can tell you that the discussion periods which occupied the last twenty or so minutes of every class were torture sessions where a tiny minority of the students would talk endlessly and say nothing. Beck's lectures were workmanlike and straightforward--not particularly original or gripping, but informative in a difficult-words-on-the-board way. The largish but reasonable reading list was a little too heavy on recent journal articles, which may well have been examples of impressive scholarship but which I found too dry and wordy for an intro class. Of the two papers, one was incredibly vague (\"It should be about a country and involve politics\" was Beck's initial description, though the TAs who did the grading weren't quite so permissive) and the other seemed to admittedly poli-sci-clueless me as an request for empty definition games: \"Does culture matter in identity politics?\" To be fair to Beck, though, she did put an extraordinary amount of effort into the class, and she was generally accessible and helpful, not to mention far more interesting one-on-one than in class.\nWorkload:\nPar-for-the-course reading, term paper, take-home midterm with in-class IDs, final with two essays and several IDs.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "July 11, 2002",
            "review_content": "\nThis was a great class for an introductory course. If you are thinking of being a Political Science major I highly recommend this course over the intro to theory or international politics. Linda is a terrific lecturer and answers all of your questions until it makes sense. \nWorkload:\nThe work load may intimadate you at first, but it is relatively fair compared to other instructors. Just make sure you know them well.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "April 20, 2002",
            "review_content": "\nI took this class (Spring 2002) in an attempt to avoid dying of boredom in Chalmers's class, but instead I nearly died of frustration in this class, which appears to be a magnet for inane first-years of all sizes, shapes, and ways of life. Beck is friendly enough, but if her delivery isn't enough to make you feel like an eighth grade girl, then the ridiculous comments she tolerates from your classmates will. She devotes twenty to twenty-five minutes every class to answering questions, which may sound good, but trust me -- it isn't. Also, she is ostensibly an African scholar, but she rarely tells us anything interesting about her research, and instead opts for the annoying line of \"but if you want to know more about that, you have to take my West African political science class ...\" Perhaps she doesn't realize that her students don't care about her OTHER political science class, it's enough being in that one and we want to know about her field of expertise! The stupid waste of time of bringing in a Barnard librarian to teach us our way around the Internet and library resources was the coup de grace for this massive waste of time that represents all that is evil about introductory political science classes.\nWorkload:\nLight reading; a midterm take-home paper and in-class identifications; 5-7 page term paper focusing on one country; final in-class exam of IDs and essay.\n"
        }
    ]
}