{
    "prof_info": [
        {
            "prof_name": "Gail Archer",
            "prof_id": 605,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Music",
            "review_date": "May 13, 2013",
            "review_content": "\nThis woman needs a gold nugget.  What a delightful, engaging, funny, and intelligent professor.  As someone with a little bit of experience playing an instrument, I recognized a fair amount of the terms and composers we discussed, but Prof Archer's comprehensive overview of music from classical, romantic, and contemporary classical music was really enjoyable and I learned so much.\nHer lectures involve some music listening and looking at scores (you would probably take more away from this if you read music, but it's definitely not necessary for the course) which kept them entertaining.  \nShe is such an incredibly passionate and kind woman and you can tell that she loves what she does and she loves music.  Easily one of the best professors I have taken classes with and a truly wonderful class.\nWorkload:\nThree five page essays (turn in a draft to a writing fellow before the final paper is due), three music listening quizzes *get about 20-40 excerpts from songs and she plays 10), and a final\n"
        },
        {
            "course_name": "V1593-V1594 Barnard-Columbia Chorus",
            "review_date": "July 06, 2010",
            "review_content": "\nI couldn't say enough good things about Gail and the choir. Rarely have I met a person who is more devoted to her career, her students, music and life in general. Always bubbly, extremely knowledgable and able to draw out a nice sound from her choir, Gail does what is needed to make a quality choir with intensely busy students. Her semi-relaxed philosophy when it comes to attendance and practice time seems a little bit too lax, but after listening to her explain her methods, they make perfect sense. She's relaxed and always pleasant because it gets more people to join, and we always pull it off wonderfully when the concert comes around. As an outlet for the experienced and unexperienced alike, I fully recommend the choir to everyone (guys especially - we need more of you!). As another reviewer said, we are a family, and we'll welcome you with open arms.\nWorkload:\nLearn your music and know it well. Come as often as you need to in order to be prepared and comfortable for the concert. No extra work, unless you decide to sing a solo.\n"
        },
        {
            "course_name": "V1593-V1594 Barnard-Columbia Chorus",
            "review_date": "January 08, 2009",
            "review_content": "\nGail is fantastic.  The choir is like a family - she loves us all, and it shows in her treatment of the group.  She picks great music, is very patient with the choir as we learn the pieces, and always has some insight to offer in any situation.  She arranges to feed us once a month - we get lasagna and salad and bond as a choir.  There's a lot of student leadership, and she always encourages us to get involved.\nThere is absolutely no reason for you to not take this class.  Trust me.\nWorkload:\nShow up.  Sing.  Eat lasagna when offered the opportunity.  Sing in the concert.  Pretty straightforward.  Very flexible attendance policy - if you can only come once a week, it's totally okay!  Very low on stress.\n"
        },
        {
            "course_name": "Intro to Music, I",
            "review_date": "December 13, 2007",
            "review_content": "\nProf. Archer is great. She's extremely enthusiastic about the subject, and will keep you awake even through the more boring parts of music history. Her lectures are full of facts but you don't really need to know that much for the final. \nDO go to class, though, because that's where all of the information is coming from. Don't bother buying the textbook, because you'll never need it. She's a very fair grader, but the listening quizzes are TERRIBLE.\nSome advice: only take the spring semester- unless Gregorian chants fascinate you, you won't like the fall semester.\nWorkload:\n3 papers (difficult but graded fairly), 3 listening quizzes (nearly impossible), and a final (not bad)\n"
        },
        {
            "course_name": "Intro to Music, I",
            "review_date": "October 24, 2007",
            "review_content": "\nI found the subject to be extremely boring, but Prof Archer's great. She's very enthusiastic and LOVES what she teaches. \nThe papers are OK, but the listening tests are pretty difficult, so make sure you don't leave them till the last minute like I did. Overall, if music before 1750 interests you, definitely take this class with her.\nWorkload:\nNot too bad. 3 papers, 3 listening quizzes, final\n"
        },
        {
            "course_name": "Intro to Music, I",
            "review_date": "February 10, 2007",
            "review_content": "\nGail Archer is such a passionate and well educated woman.  If you give a little, she will give back a lot.  The material isn't the most interesting (even for Music Majors, such as myself) but listening to her lecture makes the class that much better because of her enthusiasm.  She's infectious!\nWorkload:\nEasy enough if you keep on top of it.  A few listening quizzes and a final, but no midterm.  Though taking notes is important, it's actually not entirely going to kill you if you miss a few classes because she offers a review session a few days before the Final entailing every aspect of what's on the test.  Also, don't leave studying for the listening quizzes to the last minute -- they do affect your grade!\n"
        },
        {
            "course_name": "Introduction to Music",
            "review_date": "February 09, 2007",
            "review_content": "\nI thought Archer was great- very enthusiastic, you can easily tell she loves her job.  While it was a large class and she did not know many of the students by name, it was still interesting.  She assigns reading and listening each week, but you don't need to do the reading (she writes really good notes up on the board, and that's what you'll ultimately end up using to study for the exam).  There are three listening quizzes (definitely not as bad as they sound, you just need to study for them), and three papers (what she wants out of the papers is usually unclear, but you are required to turn a draft into the writing fellows before you give her your final copy, and they usually clear things up).  Be careful on the final- she hands out a review sheet and says it is \"pretty much\" everything- there were definitely words/terms included that were not on the review sheet, and surprise sections of the test we didn't know about in advance.  Overall, a pretty good class, and not too difficult to do well in.  I would, however, have found it difficult (and know people who did) if I did not have extensive music background.  \nWorkload:\nNo midterm, three listening quizzes (she says you don't need to buy the cd's, but having them to listen to on your own time makes things easier), three papers (it is a writing fellows class, there is a concert review, a comparison paper, and a book review), and a comprehensive final.  \n"
        },
        {
            "course_name": "Intro to Music",
            "review_date": "March 08, 2006",
            "review_content": "\nThough Professor Archer is a little annoying in the way she lectures (she speaks certain words slowly, as if you were a 3rd grader), she really is out for everyone's best interest. She was totally fair in the way she graded my papers, and as long as you listen to the assigned pieces, the Final should be no problem at all. I admit though, the class wasn't what I expected it to be, but it's a great class to just get an A in.\nWorkload:\nFair: weekly listening quizzes, 3 papers (yeah, you have to work with the Writing Fellows...but i never did!), NO MIDTERM, and a comprehensive final\n"
        },
        {
            "course_name": "Intro to Music",
            "review_date": "December 29, 2004",
            "review_content": "\nthe class is not the most interesting but she truly enjoys the subject . she is veryu enthusiastic, at times seen as humorous- but dont laugh she isnt kidding. shes very nice and very fair- she wants the students to do well.\nWorkload:\nnot too bad, 3 papers including one on a performance. writing fellows used. final exam- pretty fair. 3 listening quizes- not too bad just need the beginnings of the songs\n"
        },
        {
            "course_name": "Chorus",
            "review_date": "December 16, 2003",
            "review_content": "\nColumbia has the potential to have one of the finest choirs of any school in the country.  We're in New York!  There should be plenty of singers to choose from.  Sadly, we don't, primarily because the choir is not ballanced.  There is no effort to recruit male voices.  Most guys don't even know we exist because the choir does not  get very much publicity or exposure.  Furthermore,  with all those GS students on campus who've sung professionally (i.e. Broadway), we could be fantastic.  But no one tries to reach out to them, and get them to join. Gail is a gifted musician who is very caring about music.  However,  she is not practicle in terms of recruiting talanted voices.  Christ, NYU has a better choir than Columbia.    I still love choir, and think Gail is great.  However, there is room for improvement.\nWorkload:\nRehersals  \n"
        },
        {
            "course_name": "V1593-V1594 Barnard-Columbia Chorus",
            "review_date": "January 30, 2003",
            "review_content": "\nAll I have to say is, I only wish I can be as passionate about whatever field I choose to pursue as Gail is about classical music. I only wish there were more guys in the choir so we could sound a little more balanced in terms of voice range. But she's found ways to work around it, and the end product has never disappointed.\nWorkload:\nIt's chorus. There are rehearsals. You sing twice a week. And she's somewhat lenient about attendance -- understands if you have recurring commitments some days and says to show up when you can \"because you love to sing.\"\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "January 28, 2003",
            "review_content": "\nOK, for all you whiny people who complain about how condescending Gail is and how she talks to the class like she would to kindergarteners, look closer. \nthat's not condescension. that's her OWN almost childlike awe for the music and the stories behind it. and in a school full of jaded, \"smarter-than-thou\" profs, Gail's enthusiasm is incredibly refreshing.\n"
        },
        {
            "course_name": "Columbia-Barnard Chorus",
            "review_date": "January 20, 2003",
            "review_content": "\nThose reviewers who are so enthusiastic about Gail are to be admired.  After two semesters of her choir, I have given up in complete hopelessness (she was on leave between the two, or it would have happened sooner).  The choir is decent, I guess, but two hours twice a week is way too long to spend in the same room as Gail.  She is so patronizing, and all she can EVER talk about is herself.  If you're into spending too much time listening to a (not so brilliant) diva gush about how wonderful she is and too little time singing, take this class...  Otherwise, steer clear!\nWorkload:\nIt's just rehearsals, which you don't have to go to (unless you're taking the class for credit, or you feel really bad about the choir sucking without the few people who can read music).\n"
        },
        {
            "course_name": "Intro to Music, I",
            "review_date": "September 04, 2002",
            "review_content": "\nI, too, found that she spoke to the class as if we were in kindergarten. Go with Boerger, she is just a smart and a lot more interesting.\n"
        },
        {
            "course_name": "BC1001-BC1002 Introduction to Music; Choir",
            "review_date": "February 19, 2002",
            "review_content": "\nExcuse me?? didn't anyone find prof. archer intensely irritating? she is one of the main reasons i DIDN'T major in music! the thought of having her as an advisor made me want to transfer! or die! or both!!! she was NEVER at her office hours-- i can't begin to describe to you the number of hours i spent sitting around outside her office waiting for her. she is arrogant and not funny. choir rehearsals were painful, as she would sing most of the passages in order to provide an \"example\" of how we should sound. AAAAAAArg!\nWorkload:\ntoo annoyed to remember\n"
        },
        {
            "course_name": "V1593-V1594 Barnard-Columbia Chorus",
            "review_date": "December 11, 2001",
            "review_content": "\nThis woman is a goddess. She is incredibly enthusiastic about both the music and her students.\n"
        },
        {
            "course_name": "V1593-V1594 Barnard-Columbia Chorus",
            "review_date": "December 11, 2001",
            "review_content": "\nGail is the most amazing professor at Barnard -- at Columbia -- in the Ivy League -- in America -- in the world! I love her! She is musically brilliant *AND* loves what she is doing. She has been a musician all of her life and is currently one of New York's premier Baroque organists. She is on her way to becoming famous, but she is still incredibly down-to-earth and compassionate. She cares sooooooo much about her chorus and is constantly thinking of ways to improve the program -- not that it needs it. She gets her kids to sound fabulous, and the Candlelight Concerts in December are lovely.\nWorkload:\nIt's P/F and Gail doesn't know how to fail a student. She loves them too much. Just show up and sing and she'll love you forever.\n"
        },
        {
            "course_name": "Introduction to Music",
            "review_date": "October 17, 2001",
            "review_content": "\nA brilliant and enthusiastic professor who genuinely cares about both her students and the material she teaches. She has a bachelor's, two master's, a Ph.D., and is working on her Artist's Diploma, so you can be sure she knows her stuff. As accomplished and well-read as she is, however, she's a loving mom who \"adopts\" the students that come to visit her during office hours and is happy to talk to you about anything whether or not it's related to the course itself. I give her four stars.\nWorkload:\nThree listening quizzes; (make sure you know your stuff) three papers written in conjunction with Fellows from the Barnard Writing Center; the final is the only test and is graded generously.\n"
        },
        {
            "course_name": "V1593-V1594 Barnard-Columbia Chorus",
            "review_date": "May 10, 2001",
            "review_content": "\nMusically, the woman is brilliant. She can get a great sound out of the chorus in no time, and her love for the music is infectious. However, I take issue with some of the organizational quirks of the chorus. For example, she always hires \"professional\" soloists rather than taking them from within the chorus. Some of these soloists are actually pretty bad, and there are usually about five people in each section who could do a better job. Similarly, why use an orchestra from the Manhattan School of Music when you could easily contract a Columbia orchestra? Such actions would increase the chorus's prominence on the Columbia campus; right now few people know it exists. One other thing I find annoying: she is constantly advertising her organ performances, even ones as distant as Boston and Phoenix, and then after each one, she can't resist telling us all how wonderfully it went. I'm glad you had fun, Gail, but really, who cares? Overall, these are minor quibbles when you think about what a fantastic conductor she is; I just wish she'd run things a little differently.\nWorkload:\nRehearsals twice a week for two hours; very nice and understanding about attendance conflicts.\n"
        },
        {
            "course_name": "Introduction to Music",
            "review_date": "April 16, 2001",
            "review_content": "\nExtremely enthusiastic teacher who talks on and on in class. Sometimes, her high enthusiasm can drain your energy because she's too excited about some of the things she says. Her passion for music really motivates you to appreciate classical music though. The only problem is she only gives you one exam (the final), which means that you basically have to cram every single information she has lectured on for the final. Good notetaking is a MUST.\nWorkload:\n3 papers and 1 final. First two papers are relatively easy if you put effort into them, last paper is absolutely bizarre which deals with Ives Concord's inexplicable book. Final is ok as long as you're good at memorization all the things she has lectured in class.\n"
        }
    ]
}