{
    "prof_info": [
        {
            "prof_name": "Jon Elster",
            "prof_id": 992,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Political Theory Seminar: Tocqueville",
            "review_date": "July 25, 2011",
            "review_content": "\nThis class was literally a 13 week slow read of Democracy in America. Occasionally students chimed in to answer questions, but for the most part it was just him talking and referencing his book about Tocqueville. The only required reading for the class was Democracy in America. Then there was a paper at the end. No work outside of that. \nI can't recommend this class unless you are sincerely interested in Tocqueville. I highly doubt he knew more than 2 students' names in the whole class. Half the class wouldn't show up for more than a month at a time and it didn't really seem like he cared. Overall, the impression I got was that 90% of the class didn't want to be there, including Elster himself.\nIt's an easy 4 credit class, but there are plenty of other classes where that is also true that don't seem like a huge waste of time.\nWorkload:\n3500 word essay\n"
        },
        {
            "course_name": "Political Theory Seminar: Marx",
            "review_date": "June 18, 2006",
            "review_content": "\nFirst, Elster is clearly brilliant, is a nice guy, and has written a number of facinating books. \nHowever, this has little bearing on his teaching ability. The Marx Seminar was a weekly two-hour lecture with almost no discussion. Elster introduced the four or five main points he thought should be taken from Marx in the first two lectures and we spent the rest of the semester hearing them repeated in relation to different texts. It became hopelessly boring after a couple of weeks and I'm really not sure how I made it to all of the classes.\nIn addition, Marx, though interesting enough in small doses, gets incredibly difficult to wade through after 2000 pages. I've heard that any course devoted to only one person is generally subpar, and this seminar was definitely no exception.\nOverall, if you're interested in Marx or Elster's take on him, I would recommend checking out his \"Making Sense of Marx\" from Butler and signing up for a more interesting seminar. \nWorkload:\nActually not that much for a seminar, 5 or 6 books. The only grade is the final, which is four 5-page questions. After a semester of work, and a weekend spent on the final, the only comment on the paper was: \"Uneven, but good. A-\".\n"
        },
        {
            "course_name": "Political Theory Seminar: Toqueville",
            "review_date": "December 14, 2003",
            "review_content": "\nevery session was a 2 hour lecture. it didnt really matter if you showed up, i think he didnt really notice or care. BUT, the guy is absolutely brilliant and undergrads have no real chance of understanding how deep his knowledge of marx and tocqueville is without already having extensively studied both. id say your best for learning is to take his option of a tocq-marx combination fall/spring seminar series.\nWorkload:\ni dont think its possible to not get an A. 3 6 page papers and all you have to really do is take a stab at answering the questions\n"
        },
        {
            "course_name": "Political Theory Seminar: Marx",
            "review_date": "March 02, 2002",
            "review_content": "\nElster is a god. That's all there is to say about this remarkable man. He is a legend not only in political science, but in philosophy, economics, psychology, and history of political thought (probably other fields too). He is the most prolific academic I've had the honor to work with at Columbia. If you are interested in political theory, then you absolutely must study with Elster at some point in your undergraduate career--you will hate yourself if you don't. Elster mostly teaches graduate courses, but takes undergraduates for his classes. He also teaches undergraduate seminars in political theory. Be forewarned! He moves fairly quickly because he assumes that his students can think as fast as he can. And his seminars are really more like lectures. But this turns out better, since he has much to say and contribute. I don't think he gives out anything below a B+ unless the work is truly atrocious. He does have a strange sense of humor, and sometimes it's hard to understand because of his Norwegian/French accent. But you get used to it. There is a Jon Elster fan page, that I advise you to check out. look Jon Elster in google.\nWorkload:\nFor seminars, choice of (1) presentation paper plus two questions on final take home exam, or (2) five questions on final take home exam. In graduate classes, term paper only.\n"
        }
    ]
}