{
    "prof_info": [
        {
            "prof_name": "Daniel Browne",
            "prof_id": 1311,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "April 22, 2003",
            "review_content": "\nIf you got stuck in this class, make up an excuse, and switch times.  If you have to switch into a 9am class, it might even still be worth it.  He takes all the fun out of writing, and you will be sick of it by the time you're done.  I haven't attempted to use anything I learned in this class.  Certainly the most useless class the University has to offer.  He grades disgustingly hard, with no explanation often for his methods, and delights in telling you you're improving, even when its from a C- to a C+.  If you comfort in the fact you're doing better than everyone else in the class, don't worry.  Your semester grade will disappoint you.\nWorkload:\ntoo much, considering you get nothing out of it\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 01, 2002",
            "review_content": "\nThis teacher started off the year by telling us not to call him professor because no matter how much better it made us feel about the money we were paying to attend school here, he's not a real professor. He also told us that he'd never given a final grade of a A...the rest of the semester continued with him seeming to take pleasure in treating the class with cruelty and lacking any compassion. Some students may find his antics entertaining; the classtimes go by pretty fast. He grades the papers with a very critical eye, and as the class's papers improve on the whole, he explains that it's all the more reason to crack down on grades, claiming that it will make us work harder. The effect instead is that by the end all motivation is gone and you stop caring about your grade.\nWorkload:\n9 shorter essays, 1 revision of that, 3 longer essays each with two pre-writing parts and a revision.\n"
        }
    ]
}