{
    "prof_info": [
        {
            "prof_name": "Rachel Ghansah",
            "prof_id": 4561,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "October 27, 2009",
            "review_content": "\nRachel is a horrible teacher. An EIGHTH YEAR (how can one take this long?) MFA candidate in creative writing, she thinks she knows everything about writing, using vague terms like \"turns of phrase,\" \"writer-based prose,\" and \"gaze\" to no end other than to assert her superiority over her students. While the University Writing curriculum requires that students write a \"lens essay,\" a \"conversation essay,\" a \"research essay,\" and a \"reflective essay,\" Rachel never could explain well what \"lens\" or \"conversation\" meant, and she maintained that a research ESSAY was inherently different from a research PAPER, in that it had to be creative. Basically, she made her students begin their research papers with flowery paragraphs depicting a scene vaguely related to their topics, diminishing the tone and consistency of their work all the while.\nAnother thing about Rachel: she is exceedingly rude; often, she would pick on a few particular students, suggesting in front of the whole class that they were terrible writers who would never amount to anything. As well, she had no regard for students' independent opinions, and she had the most hypocritical lateness policy on earth: she LOATHED lateness, even though she herself was late at least once every two weeks. \nThe worst part of Rachel's class, though, was that she NEVER gave written feedback on final drafts. NEVER. All she did was place check-marks in her self-made rubric, circling a grade (the class average was usually a B-) from the choices at the top of the page. The only comments she gave were on first drafts, and they were usually unhelpful, relevant only in that one could determine from them what SHE would have written about were she writing the essay herself. Seriously, a five-year-old could grade essays the way Rachel does. How can students learn to write if they never receive real feedback on their written work?\nThe bottom line--everyone in the class despised her, and she ruined University Writing, which for many Columbia students can be a great experience. Rumor is Rachel's end-of-year evaluations were so bad that she doesn't teach classes at Columbia anymore, but if you somehow find yourself enrolled in her class, TRANSFER OUT.\nWorkload:\nEasy readings, three papers (she was too lazy and disorganized to assign a real \"reflective essay\"), and a few occasional short pieces of writing that she doesn't really grade. If you tell her you're an ESL student and she believes you, she WILL give you preferential treatment--unfair to the other students, of course. Whatever...don't take her. You'll be really let down in the end.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 07, 2009",
            "review_content": "\nAvoid this teacher like the plague. Rachel is deceptively cool at first, and you will be lulled in by her dreadlocks, connections as a former tour manager for The Roots and sometimes witty turns of phrase. But, young jedis, you will learn the insanity that is this class. Rachel will not show up to scheduled meetings, text on her BlackBerry while students give presentations, roll her eyes at students and send three emails with conflicting explanations of assignments. This was truly an awful class/experience and it is definitely worth haggling with the UW guy to get into another section if possible.\nWorkload:\n3 major essays that are divided into \"progressions,\" with shorter writing assignments in between, along with 3-4 readings per week.\n"
        }
    ]
}