{
    "prof_info": [
        {
            "prof_name": "Alan Yang",
            "prof_id": 1602,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Statistics",
            "review_date": "April 23, 2013",
            "review_content": "\nProf Yang is one of the most boring profs I have ever had. I slept through the entire course and learnt nothing. He does not engage the class at all. His lecture is a monolgue and this does not seem to bother him. He does not have regular office hours and is quite unapproachable. His exams are straightforward so if you want a decent grade this is the course for you. But if you want to learn statistics this is not the course for you.\nWorkload:\nWorkload is decent. One problem set a week. One midterm and an endterm.\n"
        },
        {
            "course_name": "Quant Tech I",
            "review_date": "January 20, 2011",
            "review_content": "\nI liked this class.  The work was straightforward, and Professor Yang is straightforward.  He's also VERY accessible and happy to go over any questions during his office hours.  \nThere were no surprises on the exams, just exactly what he said would be on them.  I personally really appreciate that approach.  I wish they were a little harder though, to spread out the curve some.\nOverall, this is a nice, no muss no fuss stats course, with plenty of resources to help you along the way.\nWorkload:\nThe weekly assignment takes between 5 to 8 hours, including reading.  So--not bad for a grad school course.\n"
        },
        {
            "course_name": "Quant Tech I",
            "review_date": "November 05, 2006",
            "review_content": "\nTeaches Stats I to MPA's. \"Accessible\"?? Yeah, like an Ivy League education is for a street bum in Harlem! He frequently criticises questions asked in class or just won't answer it at all. However, this is all part of his \"I'm way too cool for you\" demeanor which can be thoroughly entertaining at times. He doesn't look it but once you hear him lecture you won't be surprised that he used to be an opera singer in a former life...or so the rumour goes. We suspect his T.A.'s are actually indentured servants (Thursday lab at 9pm?) but that translates into labs actually matching up with lectures - unlike some other classes. And they more than compensate for his inaccessibility and outright rudeness in class. One warning - he is an almost unreasonably meticulous grader, even though he doesn't actually do the grading but as mentioned previously his minions are firmly under his thumb. And he makes you use STATA cos he's too cool for SPSS.\nWorkload:\nAbove average, or I guess average for a quantitative course.\n"
        },
        {
            "course_name": "Quantitative Techniques",
            "review_date": "October 25, 2005",
            "review_content": "\nProfessor Yang is extremely informative.  He takes the boredom out of statistics and provides clear analysis.  It should be noted that true appreciation should be given to the TA's.  They are the ones that provide step by step analysis on problems that Professor Yang does not have time to dedicate to students. \nWorkload:\nweekly hw assignments that are worked in groups, midterm and final (non cumulative)  Cheat sheets are allowed. \n"
        },
        {
            "course_name": "Statistics",
            "review_date": "May 07, 2003",
            "review_content": "\nTough course, but I really learned the material.  Prof. Yang was accessible and helpful.  I really dreaded this class, but he made the material comprehensible and even interesting.\nWorkload:\nModerate\n"
        }
    ]
}