{
    "prof_info": [
        {
            "prof_name": "Kevin Murphy",
            "prof_id": 1684,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Asia-Pacific Wars 1931-1975",
            "review_date": "January 08, 2006",
            "review_content": "\nBest T.A. I've had in my three years here, hands down- no other one even came close.  I'm not kidding- this guy's a born teacher.  Plus, he's funny as hell- and his dry wit enhances whatever it is he's talking about.  If you EVER have a chance to get him for a discussion section, you'll end up with the one discussion section that was actually worthwhile.  Awesome.\nWorkload:\nHe doesn't dole out the work but he does grade it.  He's not an easy grader (have you ever run across a grad student that is?) but he's fair and extremely helpful.. I found myself trying extra hard because I didn't want to hand him crap.\n"
        },
        {
            "course_name": "Survey of American Civilization since the Civil War",
            "review_date": "May 12, 2004",
            "review_content": "\nIf you have the opportunity to be in Mr. Murphy's section, definately get in.  Like the other review states, he's really, really kind when you have a bad week and can't finish the reading.  If you tell him before section that you can't make it, he's totally cool with it, just as long as you do your posting.  But, you really should go to section because not only is he incredibly knowledgable about history, he always makes sure to simplify topics or articles that are difficult.  He'll explain them thoroughly, and then give you the bottom line in one sentance.  He was also really helpful with my research paper.  The TAs were striking, but he answered all my questions via email and was even willing to look at a couple pages of writing.  \nBasically, Mr. Murphy is an awesome TA because he is smart and cool, so I suggest you take him.\nWorkload:\nWeekly readings and postings on Courseworks (not too bad), Midterm and Final (term IDs and essays, all possible ones given out before, only select few appear on exam), 8-10 page research paper \n"
        },
        {
            "course_name": "Survey of American Civilization since the Civil War",
            "review_date": "May 12, 2004",
            "review_content": "\nIf you have the opportunity to be in Mr. Murphy's section, definately get in.  Like the other review states, he's really, really kind when you have a bad week and can't finish the reading.  If you tell him before section that you can't make it, he's totally cool with it, just as long as you do your posting.  But, you really should go to section because not only is he incredibly knowledgable about history, he always makes sure to simplify topics or articles that are difficult.  He'll explain them thoroughly, and then give you the bottom line in one sentance.  He was also really helpful with my research paper.  The TAs were striking, but he answered all my questions via email and was even willing to look at a couple pages of writing.  \nBasically, Mr. Murphy is an awesome TA because he is smart and cool, so I suggest you take him.\nWorkload:\nWeekly readings and postings on Courseworks (not too bad), Midterm and Final (term IDs and essays, all possible ones given out before, only select few appear on exam), 8-10 page research paper \n"
        }
    ]
}