{
    "prof_info": [
        {
            "prof_name": "Philip Oldenburg",
            "prof_id": 2317,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Political Systems of South Asia",
            "review_date": "May 01, 2012",
            "review_content": "\nI hated going to class and ended up skipping as much as I thought I could get away with (turns out I could have skipped most).  While I see below that his grading is easy, I'm going to have to disagree.  It's more luck of the draw; he has no clear rubric, and he makes up his grading scheme as he goes along which makes the process incredibly subjective.  If you happen to get an A, then good for you.  If not, tough, because without a clear set of directions there is no way to even talk to him about it.  When I tried to, he got so defensive that I just dropped it.  He wouldn't even make eye contact with me, I just had to walk away from the guy.  That one example of his social skills might give you a clue as to why his lectures are empty.\nBest value for me was knocking out the cultural diversity with a poli sci class since it's my major.  And I agree with others that the readings were good.  But, one can find cultural diversity requirements with other poli sci classes, and similarly his syllabus can be obtained without taking his class. So I would say this is not worth anyone's time.\nWorkload:\nPlenty of reading, but only 1 midterm and 1 final.  Good luck with the grading.\n"
        },
        {
            "course_name": "Political Systems of South Asia",
            "review_date": "July 29, 2010",
            "review_content": "\nEuphemistically speaking, seriously one of the least impressive classes I've taken at Columbia. The subject matter is fascinating, as is the reading; this much I can attest to, since I'm a MEALAC major. The articles, when I ended up reading them for the midterm/final, were really interesting. His reading list is one of the most well though-out and researched I have seen in a while. Unfortunately, his obvious knowledge of the topic is not reason enough to take the class. His delivery creates an atmosphere of general disinterest and apathy amongst the class, save the token few overly eager students. I think the problem stems from the structure of the class, which is technically a lecture (of maybe 10 students any given day, maybe up to 15-20 were actually in the class), which meant Oldenburg just spoke at us for an hour or so in his monotone voice (after going through current events in South Asia for far too long every class, though I appreciate his attempts at trying to keep his teachings relevant and topical, a necessity as the political state of South Asia is unstable at best). When he did encourage class participation, it was the same few people. We weren't encouraged to talk, since class participation was not part of the grade, and so most people stayed quiet...or just slept in. \nWorkload:\nProbably the easiest A I've ever gotten. Each week, there is \"required\" reading and then optional reading to choose from. Go ahead and read all the required reading if you want, just because they're almost all interesting, but don't expect to be tested on it. For the midterm, he gives you a pretty short set of terms to study - \"short\" and \"long\" ones, the latter a little more specific. Personally, I had not done a single reading by the midterm. I just went through each reading for the \"definition\" and \"significance\" of each term (a long process if you want that easily attainable A - otherwise, you could probably Wiki all the terms and do relatively well). I wish I hadn't worked so hard on getting those terms, as he only asks you to identify a few IDs. If I went to class more than 4 times the entire semester, I probably would have gotten in on some study group to divide up the terms; you should probably do that. The final consisted of IDs reminiscent of the midterm and 2 short take-home essays (pretty specific topics, easy to pick which readings to use, NO outside research needed, which was strange for the culminating exam in a 4000-level class). \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 17, 2007",
            "review_content": "\nI had read reviews that one could get by just by doing the readings.  This is entirely true.  Oldenburg's lectures, while interesting, have little to do with the readings, on which both the midterm and the final are based upon.  Half of the lecture is a discussion about international news, which sometimes was somewhat interesting, but definately not a time spent working towards something useful for what you would be graded on.  Surprisingly, I did very well, even without any previous knowledge about Politics, since most of the readings are dense and require time to read.  You could wait to do the readings until before the exam, but I don't recommend it.\nWorkload:\nOne \"country paper\" (pass/fail), midterm, and final, plus two take-home final essays.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "March 15, 2006",
            "review_content": "\nYes, it's true that Oldenburg could use some work on his lecturing style.  Some organization, coherence, and flow would be nice during the lectures.  However, the syllabus that Oldenburg selected was absolutely superb.\nIf I were to take the class all over again, I would have gone to class only on the first day, the day of the midterm, the day of the final, and to hand in my country study, and would make friends with someone who goes habitually.\nBut I would make a point to DO ALL THE READING or at least as much as I could, because, in hindsight, as a political science major, the readings give an absolutely phenomenal foundation in comparative politics, and they're quite good.  I still refer to some of the articles that Oldenburg selected for the syllabus.  Take this class not for the lectures--skip 'em--but for the reading.  It's about 100 pages a week and well worth it.\nInstead of assigning a textbook, Oldenburg selects some of the best and most important journal articles and book chapters in comparative politics, and organizes them so that you really get to see the debate among political scientists, which is rare in an intro course.\nWhile I took the course with him, I agreed with most other students in the class that it was malorganized and incoherent.  But I was thinking only about the lectures and recitations, but as soon as the class ended, I realized how much I actually learned (from the readings).\nWorkload:\n100 pages of reading a week, 1 pass/fail country study (5 pages), midterm based on the readings, in class portion of final based on the readings, take home portion of final is 2 5-page essays.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 17, 2006",
            "review_content": "\nLet's rewind the tape completely. Go to any other poly sci dep't prof and ask them about comparative politics. They will shrug and nod their heads. This is a bullshit course in general. If you're subfield is not comp. pol. then you have no business taking this course. It's a knot of cables that you can't undo. And this peacefully obscure unintellectual professor only makes things worse. I think Linda Beck teaches it as well - take her if you have to take this course. Oldenberg was probably pulled in because no one wanted to ruin their reputation by teaching this course. \nAnd the TA can  destroy you as well. Piero Stanig, who somehow got rave reviews, was at least entertaining when he outright contradicted Oldenberg in class. Now there's a 120k Ivy League education for ya. Why don't we just have ego mud wrestling? I couldn't stand reading half of the readings. You've never seen so many terms in your life, and they can't decide on any of them. But if you're a robot, and have somehow disconnected yourself from mainstream consciousness, you should be cheerful about this prof and class. There was usually 20% class attendance - what does that tell you? Without the right prof., comp pol. is a spider's web. \nWorkload:\nCan't remember - it was a bad dream. But it wasn't really hard, just time-consuming. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "April 17, 2005",
            "review_content": "\nWhoever wrote that review claiming that Oldenburg was better than Jervis has some serious problems and should stop studying political science immediately- you clearly have NO idea what poli sci is about or what you are supposed to get our of these classes. I went to all of Oldenburg's lectures the first half of the semester and I was APPALED at what an awful teacher he was. I would start taking notes and look at them at the end of the class and be like \"What the HELL is this guy talking about?\". Not one of his lectures were planned, and he failed to convey and idea whatsoever all semester- let alone giving us a sense of what comp politics is about. Like another reviewer said: avoid this guy like the plague. Unless you are one of those girls who doesn't mind what the prof is talking about and insist \"But he's cuuuuttte\".      \nWorkload:\nYou are still thinking?? What does the work load matter, the guy sucks!?\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "March 22, 2005",
            "review_content": "\nOk, everyone, listen up.  I've got some startling news for you:  You've all been duped into thinking that this was actually a legitimate classÂ—it wasnÂ’t!  It was really just the filming of a reality T.V. show called \"Jackass Teacher!Â”  The T.V. audience, of course, knows the secret from the beginning and hysterically observes the chaos and comedy that ensues in the class!\n\tPhilip Oldenburg performed brilliantly in his role as the professor.  I think he may have even fooled some students.  He never fooled me though.  \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 29, 2005",
            "review_content": "\nAvoid Oldenburg like the plague-- while he faces some stiff competition, he is hand's down Columbia's worst professor.  His classes were, to say the least, a mess, a veritable hurricane of useless and esoteric information.  Maybe he prepared for class, but he hid it well.  I was interested in compartive politics because I thought it would be a way to examine the different governments of the world.  Scatter brained and lazy, it's not even particularly easy to get an A.  This class had absolutely no redeeming characteristics-- poli sci majors, take intro to American and IR instead.  Trust me.\nWorkload:\nIt seems really easy-- reading's not too much, and an in-class midterm and final and a two papers (one of which--bizarrely-- is pass/fail).\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 05, 2005",
            "review_content": "\nThis is my second poli sci class here at Columbia and I must say, the intro classes' success lives or dies with your TA.   Your discussion section is basically more important than the lecture itself.  Oldenburg was infinitely better than Jervis in that you can understand what he's saying and at times he evens looks at the class.   He was also very open to debating specific topics with students in the class.  However, the lectures didn't always feel like they were guiding in the direction that his syllabus said we were headed in.  The job of being able to decipher the readings came down to the TA's. My TA Carmen LeFoulon was a stern one.   We were expected to have done the reading before section and she made it obvious to the rest of the section if we hadn't done the reading.   Overall I came out of this class with a very concrete knowledge of comparative politics but also a lot more questions than I had going in.  I guess that's part of the class.  Oldenburg def. sparked my interest but occasionally he put me to sleep and frustrated me.\nWorkload:\n200 pages of reading per week.  In theory you can skip it until the midterm and final but I don't recommend it. Discussions are mandatory and attendance is taken plus they're a lot more fulfilling if you know what your'e talking about.   The midterm was a bunch of long id's.  Country  Study Paper (pass/fail) on poli. system in chosen country.  The final is a long version of the midterm with id's and longer essays.  The discussion section is an exrtra 10 points so you start the class 110/100\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 02, 2005",
            "review_content": "\nLet me start by saying that I wouldn't reccomend this class to a freshman.  It isn't really an intro class, in the sense that you don't really learn a fundamental body of knowledge.  Also, the class will be ten times easier if you have taken other political science classes.\nIf you like Political Science, the topics are really interesting, but you might as well do the readings on your own.  Most of the readings are journal articles, which my TA found difficult to understand and explain sometimes.  They are pedantic, jumbled, and loosely related so that you don't really understand what you are supposed to be learning.  Prof. Oldenberg doesn't believe in lecturing on class topics, so you are pretty much left to fend for yourself as far as learning the material.  Your discussion sections will help, and my TA was really good, but you can't learn everything in an one hour discussion section once a week.  Basically, unless you are a COMPLETELY independent learner, then this is not the class for you.  Prof. Oldenberg doesn't explain, clarify, or discuss anything useful.  So get ready to do a shit load of reading and take really good notes, b/c that is about the only thing that will get you through this class.\nWorkload:\nYou pretty much skate through the semester, and then you hit the final.  Two papers and a test, and he only gives you the prompts and terms a week in advance.  It is pretty much a week long take home final.  You will bust your ass finals week, but that's about it.  There is 100-200 pages of reading a week, of, as my TA put it, \"graduate level reading.\"  If you choose to do all of it, good luck, b/c your life will be hell in this class.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 24, 2004",
            "review_content": "\nProfessor Oldenburg, while a very kind, fair, and good professor, lectures in a way that tends to obscure more than it clarifies. In an introductory course, his tendency to blur distinctions or expound on qualifying points, most often in an unorganized manner, ends up quite unproductive in acquainting students with the basics of the field. The assigned readings, however, do seem to deal with the most significant topics and questions in the field, and all grades are based on the readings. This of course renders the lectures useless for any student who finds them uninteresting or uninformative, which was common judging by class attendance.\nNevertheless, Professor Oldenburg does no harm through his lectures or grading policy. One may simply avoid the lectures if one so chooses. The country study (described below) is in fact quite interesting if one would like to study the politics of any country in some depth. The course definitely accomplished its goal of introducing me to Comparative Politics as a field and as a methodology. The professor treated concepts in a nuanced fashion without stating personal opinions and spent considerable energy attempting to instill in students' minds the process of comparative politics question formulation and research.\nNo extra political or historical knowledge prior to the course is required or rewarded, given the nature of the midterm and final. The grading policy was quite generous, since an extra 10 possible \"bonus\" points were awarded for discussion section attendance. In the professor's own words, if one completes at least 100 pages of each weekly reading assignment, one should be capable of completing the midterm and part one of the final (as described below) with a satisfactory grade. Overall, I highly recommend the course for its approach to the study of comparative politics. While the professor's lectures could have offered much more, the course still accomplished its purpose as determined by its introductory nature.\nWorkload:\nWeekly reading assignments, consisting mostly of journal articles, about 5-6 per week (100-200 pages). One 5-page country study, graded pass-fail, on a country of one's choice, based on individual research and intended to provide one with detailed knowledge of the politics of at least one country other than the United States (the study covers information presented in an outline distributed by the professor). One midterm, consisting of long and short IDs drawn from major concepts in comparative politics which the readings cover. A final exam consisting of two parts: 1) an in-class part consisting of long IDs based solely on the readings assigned after the midterm; and 2) two 5-page take-home essays (due on the day of the in-class exam) on prompts assigned at the beginning of reading week among which there is ample choice. \n"
        }
    ]
}