{
    "prof_info": [
        {
            "prof_name": "Edward Smith",
            "prof_id": 2499,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Cognition: Mind and Brain",
            "review_date": "November 13, 2010",
            "review_content": "\nIt's been awhile since someone wrote a review of this class, so I thought I'd write one.\nI took Cognition Mind and Brain with Smith in Spring 2010.\nI have very mixed feelings about this class...\nPros: Professor Smith is a very nice man, and is friendly. He has obviously contributed a lot to the field. His work on patients with schizophrenia is interesting. There was a field trip to the Neurological Institute up at 168th St (Columbia Medical Center) to see the fMRI machines and hear Joy Hirsch speak, which was pretty neat. Teal and Maxwell were pretty good TAs.\nCons: Professor Smith is definitely not the most dynamic lecturer. As other reviewers have mentioned, he does spend way too much time indulging truly worthless questions of students. He still has yet to correct the errors on his slides that reviewers from several years ago pointed out. Very annoying. It can be hard at times to \"see the forest from the trees,\" so to speak, because Smith ends up spending a lot of time on minute details that are more confusing than helpful.\nAs I was taking this class, it was a total pain in the ass. However, materials covered in this class (e.g., fusiform face area, dopamine hypothesis of schizophrenia, different cognitive tasks, ways of looking at neuroimaging) keep coming up right and left in my other psych and neuroscience classes so at least I feel like I got something out of it.\nTo conclude, I would NOT recommend this class for NON-psych/neuroscience majors just looking to fulfill a science requirement. It might, though, be a good option for psych/neuro majors, depending on how you feel about the rest of the info I have written.\nWorkload:\n-Really boring readings from Smith's textbook that are helpful only if you need to brush up on a particular concept, but that are a total waste of time in general (e.g., I read ALL the textbook assigned readings to prep for the midterm and filled out all the points on the TA's review sheet and ended up getting so bogged down in details.)\n-Readings of empirical studies (important to know the big picture hypotheses, methods, and general results for some studies, but no need to memorize every single thing discussed in them)\n-Class participation, measured using iClickers. The iClicker tasks were actually really interesting--we weren't graded on correct responses. Rather, the iClickers were used so the class could participate in different tasks used to study cognition in empirical research. It was a great way to learn about the paradigms. And 10% of the grade came just from doing this.\n-Term paper, about 8 pages, on the topic of your choosing based on materials covered in class. Basically, you have to pick a topic related to some aspect of cognition covered during the course (e.g., working memory, reward learning, etc.) and find 3 or 4 research papers discussing that topic that were not assigned as class readings and present them in your paper. One of the TA's sent out the paper he had written when he took the class, which was a good sample and helped in writing the paper. \n-Midterm: not that bad...but I made the mistake of obsessing over a review sheet the TAs sent out and memorizing the text book. Not a good way to study for this class. Just be able to define some really basic, key concepts (first part) and then be able to write short essays with examples/evidence from empirical studies to support (second part).\n-Final: same as the midterm. It was cumulative, but most of the questions came from the second half of the semester, and because you could choose not to answer some questions, it was possible to avoid material from the first half of the semester if you wanted to.\n"
        },
        {
            "course_name": "Cognition: Mind and Brain",
            "review_date": "July 20, 2006",
            "review_content": "\nMy overall impression of Professor Smith is that he seems to be at Columbia mainly to do research work. I found him to be a fairly boring lecturer who relies too much on his slides. Smith tends to mention his point first, then spends time meandering towards what makes it important. At the beginning of the semester, he let us know that he enjoys and encourages class discussions. Unfortunately, this means spending time on inane questions from certain students. This became so much of a problem at one point, that the class was asked to log into Courseworks and vote on whether or not we were spending too much time on questions in class. Although this put a kibosh on the what if-ers for a while, Smith made it apparent that he would rather have a conversation than teach, which encouraged those certain students to raise their hands again. I was also disappointed to see that Professor Smith has yet to correct the errors in his slides mentioned by a previous reviewer last year. He still doesnÂ’t know the answers to a lot of the good questions posed by students, sometimes misidentifies the slide materials, and makes errors doing sample problems in class.  Luckily, the stuff you need to know is in the textbook (that he wrote), the slides, and the articles he assigns. The test questions for both exams are pickier than he lets on, and the final includes material from the first half of the semester. The exam questions are straightforward, but it can seem as though you have to have memorized everything covered in everything to do well. The paper assignment is 6 to 8 pages on a limited topic that must be derived from at least 3 scientific papers, and not widely published about.  In short, there are better courses available. \nWorkload:\nMidterm 30%  Final 40%  Paper 30%\n"
        },
        {
            "course_name": "Cognition: Mind and Brain",
            "review_date": "July 04, 2005",
            "review_content": "\nIf you are not going to pursue Neuro-pyschology, DO NOT TAKE THIS CLASS. Prof. Smith is obviously brilliant. His lectures are interesting, and not that difficult to grasp. However, the book (which has not been published and is an $81 coursepack from Village Copier that is thicker than three bibles stacked on top of each other) is incomprehensible. You would think psychologists would understand the problem with the text, figures, and descriptions of the figures being in three different, unmarked locations...yeah, if you're thinking nightmare, you've pinned the tail on the donkey. I took the class as a first year...big mistake. You think you've got it, then you take the midterm, and you realize you were literally supposed to memorize everything you read word-for-word and that synonyms simply will not do. It's impossible, and the lectures are tough to sit through at 9am, nevermind force yourself to walk to. \nWorkload:\nTONS OF READING THAT DOESN'T MAKE SENSE. Midterm and Final that are next to impossible unless you're one of those people who's taking the class who is in Neuroscience 3. 1 Research Paper that is very easy to do well on. Midterm: 30%, Final: 40%, Paper: 30%\n"
        },
        {
            "course_name": "Cognition: Mind and Brain",
            "review_date": "May 29, 2005",
            "review_content": "\nI really enjoyed this class. Professor Smith does a nice job of presenting experiments that set the groundwork for a majority of cognitive neuroscience. In my oppinion, this class is one of the best neuroscience courses that I have taken at Columbia. Unlike the introductory classes which just require you to memorize basic structure and function, this class covers the theory behind neuroscience. This class presents neuroscience the way it really is...it is a rapidly evolving field. The previous reviewers seem a little bitter, perhaps because they didn't do so well in the course. This is a good course and one that I think every Neuroscience and Behavior major should take. It is not very difficult. Professor Smith posts all the lectures. All the material you need to know is in them. The exams are straightfoward: definitions and paragraph explanations of key experiments. Some examples are as follows: define the term \"priming;\" define the term \"false memory;\" describe the methods and results from one experiment that supports the idea of neural dissociatiob between spatial and object working memory.  My point is there are no surprises on his exams. You need to be able to describe the KEY points of the main experiments. If you can do that, you will be fine. Don't listen to other overly bitter reviewers; take this class if you enjoy being a Neuroscience and Behavior major.\nWorkload:\nMidterm (only 30%), Final, and Paper on a topic of your choice. I feel the readings are mainly supplementary. It is not necessary for you to know every detail from them. Just focus on the aspects of the reading that relate to lectures because the exams only require that you have an understanding of the lectures.\n"
        },
        {
            "course_name": "Cognition: Mind and Brain",
            "review_date": "May 10, 2005",
            "review_content": "\nThis class was weak.  If Comic book guy were in this class, he'd wear a shirt that said \"worst. class. ever.\" and you'd look at his shirt, laugh, and fall back asleep.  The lectures aren't terribly exciting, it takes awhile for him to make the point, the one which you knew was coming several slides prior.  Don't bother asking questions, he doesn't know the answers.  There were plenty of mistakes in his power point slides as well.  This is his first semester columbia, so let's just call this an initiation hazing review.  I'd take beer bongs and do the elephant walk with Ed Smith anyday, I just wouldn't a class with him again.\nWorkload:\nmidterm/final - graded by anal and picky TAsshort paper - no swearbrief readings - tests don't really cover them\n"
        },
        {
            "course_name": "Cognition: Mind and Brain",
            "review_date": "April 24, 2005",
            "review_content": "\nThis is the sort of class that sounds interesting in theory, but is very bad in execution.  Prof. Smith is a nice enough guy, but he's a terrible lecturer.  His lectures are muddled and confusing (even to himself), and I've never met another professor with such poor time management.   He's Galanter, but nowhere near as funny. He does post lecture slides, but they're full of errors.  He also made us shell out $80 for a (very) rough draft of his yet-to-be published textbook .  It seems like this class was haphazardly slapped together at the last minute.\nWorkload:\nMidterm (IDs and short answers).  Paper on topic of your choice.  Final.  There were no clear grading guidelines for the midterm, so grading was pretty much arbitrary (good or bad depending on your luck).   In a class of 34, 14 people got C-range and below on the midterm.  \n"
        }
    ]
}