{
    "prof_info": [
        {
            "prof_name": "Donna Masini",
            "prof_id": 277,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style I",
            "review_date": "May 29, 2004",
            "review_content": "\nDonna Masini is exactly what I needed in a writing instructor. Definitely choose her section if you have already done a lot of creative writing and are looking for an instructor who will actually give you useful criticism instead of babying you. In response to the previous reviewer, I don't think she played favorites at all, and I actually found her to be steering us away from sentimentality and cliches - something I greatly appreciate as I see overcoming stereotypes as an important part of growing as a writer. I think Donna is actually interested in her students' pieces, which is something not often seen in college classrooms. This made all the difference for me. In addition, she once taught our class while having a migraine, which shows some incredible dedication!\nIn short, you can take a class where the instructor and your classmates will respond to your writing with, \"Oh, I really liked it, it's great...next person, please,\" or you can take Donna Masini's class and actually learn something. I definitely reccommend her.\nWorkload:\nPoem, short story, scene (with revisions), short log of what we read. Very small workload for a 3-credit class.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 07, 2004",
            "review_content": "\nThe class itself is fun and 2 hours go much quicker in S&S; I than in CC or any other 2hr class I've taken.  The input from the class (and yes, people participate A LOT more than in core classes) is valuable at times, although people are sometimes quicker to say something harsh a la Masini to get her approval regardless of whether or not it is actually pertinent to your writing.  She is willing to help after class but sometimes she seemed to have this attitude that it was a burden to help you.  When I did meet with her I never really felt like I got a lot out of what she had to say - and usually she's just like \"rewrite this entire...\"  She played favorites in the class, and underappreciated other peoples' great writing or great ideas.  I'm not sure how she grades - you have NO idea how you're doing in terms of that - the only grade I know is my expository writing log (write about a few poems, stories, etc) grade.  Basically, in writing for her she seems to like that bullsh*t sentimental stuff, all flowery and sorta cliche and angst-ridden stuff - she doesn't seem to be as big a fan of the stark, humorous qualities in writing.  Her comments basically flow along those lines.  The workload, however, is probably the lightest you can get for any class - basically write 1 poem, 1 short story, and 1 scene from a play and keep a writing log on some poems that you had to read from class.  Just on a side note - she knows nothing about Pop Culture - and even admitted that she just found out what the Knicks are (and she's been in the city forever).  That's it.\nWorkload:\n1 poem, 1 short story, 1 scene from a play.  Submit an expository writing log - where you write about your \"Reactions\" from reading some poems & short stories.  You're supposed to write in your journal every morning but you dont have to hand this in and I doubt anyone actually did this every morning for the semester.  Kind of a slacker class, I guess.  No portfolios or anything.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "April 02, 2004",
            "review_content": "\nI personally did not appreciate Donna's style at all.  It may be because I enjoy workshops that are more relaxed and fun (and productive, of course).  Her class was too serious and just uncomfortable to me.   She was very cold and discouraging when I asked her for help with my writing.  The class is productive and her comments are valuable, but it was just devoid of any enjoyment.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "January 22, 2004",
            "review_content": "\nDonna is a great teacher not only because she's personable but also because she tolerates little bulls**t.  She handles an intro writing course like S&SI; well, exploring writing tactics as they come up in pieces and providing very constructive criticism.  If you are looking for a teacher that will give you honest criticism (though this may include negative comments), take this class!\nWorkload:\nsame as any other S&S; class.  poem, story, scene\n"
        },
        {
            "course_name": "Structure and Style",
            "review_date": "August 05, 2003",
            "review_content": "\nWonderful!  Donna is a passionate, warm, engaging teacher, who takes her students seriously and offers a genuine critique of their writing. She had us memorize 1 poem during the semester, which I thought was an important assignment.  She also gave valuable feedback and ample workshop time in a class of 20 people.  \n"
        }
    ]
}