{
    "prof_info": [
        {
            "prof_name": "Paul Levitz",
            "prof_id": 11434,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "The American Graphic Novel",
            "review_date": "December 10, 2014",
            "review_content": "\nI was really excited going into this class—I'm a huge fan of graphic novels and think it's important that they be viewed as serious literature. This class left such a bad taste in my mouth, though. This class is not an engaging look at the history of graphic novels or a study of the development of the medium. You are literally just given a list of graphic novels on the syllabus to read and the lectures are a string of random anecdotes about them. There is a lot of breadth, but absolutely no depth. All of the assignments are vague and have nothing to do with the lectures, and are just given for the sake of having assignments. They try to run the lecture like a seminar, and what happens is that the same five people talk the whole class and the other students are given nothing to work with. There is also literally a \"race week\" and a \"gender week\" and the way the professors approached these subjects is stale and antiquated. \nWhat made the entire experience worse, though, was that the professors were not open at all to criticism. They wanted our feedback the last day, but spent the whole time justifying their decisions instead of considering the fact that their refusing to plan their lectures or write assignments comes off as lazy and disrespectful of our time. They also told us they didn't want to approach the texts from critical perspectives since they wanted to \"present a buffet\" of works for us to read instead. This class is a survey in the most basic sense, and you could get more out of reading the books on your own then sitting through the painful, shallow lectures. It was also infuriating how strictly the papers were graded when we were given so little to work with. \nThis class was not only disrespectful to the students investing time in it, but disrespectful to the medium itself. It's been fighting for years to be accepted as a legitimate literature in the academy, and this class hurts the progress it has made in the past decades. \n\nWorkload:\n-A one page critical analysis\n-A two page journal entry\n-A 5 page close reading\n-A 15-20 pages research paper\nYou are give no clear directions for these assignments. \n"
        }
    ]
}