{
    "prof_info": [
        {
            "prof_name": "Hang Xue",
            "prof_id": 10387,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "July 08, 2013",
            "review_content": "\nThis guy is the worse I've ever had, his writing on the board is unreadable, following no logic, lacking any helpful illustration or insight.  A teacher should make the complex simple not the other way around.  Extremely arrogant at questions, while void of any interest or concern about the student grasp of the topic.  This is a disgrace to Columbia, the Ivy League, and the state of our higher learning... Complete scam.   When the student sitting next to you can do a way better job than the guy your paying to teach you math, you know something is wrong.  He didn't doesn't even take a breath to stop from rambling that a day's material is often covered 20 minutes early before class ends.  And it wasn't only me, I talked the others after each class, and they all got the vibe that he wants to see us confused and fail.  It's pretty sad, actually.  I have nothing to lose by this, I did not get a bad grade in this class, so I'm not just ranting... Conclusion:  Drop the course and take it with a wiser instructor, an actual professor of mathematics whose craft of teaching math and encouraging students to becoming mathematician is polished.\nWorkload:\nquizes, daily HW, Two midterms, and 40% final.  By the way, the used txt is perhaps one of the worst reviewed math texts on Amazon, I hated reading it, and I'm a Nerd who enjoys reading math.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "July 09, 2010",
            "review_content": "\nUtter Disaster.  His English isn't sufficiently clear to understand if he's saying \"n\" or \"m\" when he speaks.  He routinely makes sign errors when working examples, and he skips steps -- often the steps that are the crux of the technique he's trying to demonstrate.\nWhen you ask for him to clarify a point, he just repeats what he said the last time, he can't explain the issue a different way.  This leads to the other students trying to answer questions.  While we're helpful for each other, the class would probably be more useful if structured as a giant self-help session.\nOn the first day of class, 30 people attended.  By the third day, we were down to 18 in the room, with 10 paying attention.\nOver all, plan to learn by reading the textbook, not from the professor.\nWorkload:\nHomework (~1hr/night) due twice a week, a few quizes, one midterm, one final.\n"
        }
    ]
}