{
    "prof_info": [
        {
            "prof_name": "Lucianne Bulliet",
            "prof_id": 1658,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Vedic Religion",
            "review_date": "May 26, 2003",
            "review_content": "\n\nBulliet is an adjunct, so she doesn't teach too much. I think she's teaching Sanskrit next semester, so some of what I'm going to say does not apply. But, here goes:\nBulliet is a genuinely nice person, and an easy grader - which means a lot - but she's a pretty bad professor. She had a super-ambitious reading list, but we spent over half the class on the first two weeks' reading - and that was on the most uninteresting subject we were covering AND a subject only tangentially related to the course: theories on Indo-European migration. We were supposed to be studying Ancient Indian texts, not Central Asian archaeology. If you're famliar with vedic religion, you'll appreciate this: we spent a total of 30 minutes discussing the Upanisads. That's IT. And almost none of that 30 minutes were devoted to the texts, but instead to the social changes that, perhaps, led to the new thought. Bulliet really didn't have a firm grasp of the material, either. Here's how the class worked: She would ask someone to read a section of text, comment on some mistranslations, comment on a couple of things she knew about, which were pretty insignificant to the meaning of the text, go off on a tangent about that insignificant thing, tell a story about speaking to some Brahmins in Calcutta, and then we were out of time. Sorry for the rambling, but you get the idea. \nBy the way, the lady does not seem to know sanskrit very well. She was often corrected by some Indian kid in class, and when she did know something, she would flaunt the knowledge - a sure sign of someone who doesn't know their stuff that well.\nBut she is really nice.\n\n\nWorkload:\nNot too bad. Midterm, Final, 10 page paper (not graded, just to bump you up or down if you're betwen two grades. It's required, though)\nShe's a pretty easy, if inconsistent, grader. A word of advice: she'll give in if you argue for a higher grade.\n\n"
        }
    ]
}