{
    "prof_info": [
        {
            "prof_name": "Elliott Stein",
            "prof_id": 2785,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "May 13, 2015",
            "review_content": "\nLectures open with proofs that lead into a ton of examples. Examples help with the homework but are not reliable for the exams. First exam was easy with a medium score of 78. Second exam was tough with a medium score of 45. The final was a mix between really hard questions for the brighter students and really easy for those who need some free points.\nI would recommend taking him for his exams. Straight forward, no graphing, no true or false, just problems that were similar to those in the review chapters of the book. \nWorkload:\nWeekly problem sets with webassign and book problems\nTwo midterms\nFinal\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "May 19, 2013",
            "review_content": "\nProfessor Stein is one of the best math professors out there. He may be a little monotonous in lecture but if you actually listen to him you'll pick up a joke here and there. He goes over proofs from the book at the beginning of lecture and then he does a bunch of problems that you can refer back to to help with the homework. Professor Stein is pretty cool when you get to know him and he's super helpful in office hours. He doesn't give busy work and he's clear as to what material you need to know and study. \nWorkload:\nAn online and written homework each week, 2 midterms and a final. \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "August 01, 2012",
            "review_content": "\nTake Calc. II with Stein! He's very helpful after class and during office hours, and also has a sense of humor that manages to dig its way into class once in a while.  His lectures are pretty good; during the first half of the semester he'll go through examples that you should study for the midterms, but during his lectures on series, he'll also demonstrate a lot of interesting properties that not every professor will want to spend time on.  I very much appreciated the effort, and thought it made studying math a whole lot more interesting!  Now if you don't care about how interesting the course is, take this course anyway because the difficulty of homework and exams is pretty average.  As long as you practice both the regular homework and the WebAssign questions, you should be fine.  He also releases stats on class performance on exams, which should be helpful if you're deciding whether or not to drop it.  But if you're actually interested in Math, take this course, or any other one with Stein for that matter!\nWorkload:\nWebAssign + Written Homework, 2 midterms.  WebAssign is ridiculously easy and very helpful (worth the cost).  The written homework is a walk in the park if you did the webassign.  And the exams are simple if you pay attention to Stein's interests and the assignments.  Don't slack off, and you'll be fine.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 01, 2012",
            "review_content": "\nLet me start of by saying this: only around 50% of the students showed up to class. Maybe it was the time that this class was offered (6:10-7:25 pm), or his monotonous voice that seemed to put half of what was left in class to sleep, but it made it very appealing to most to just simply skip class and read out of the textbook (which he followed very closely). \nIf you do show up to class though and listen closely, you can get a lot out of the class. Although many students got by skipping classes and handing in tedious problem sets, Professor Stein is very knowledgeable about both Linear Algebra and what exists beyond it. He goes into many proofs in class (albeit terse) that are not necessary for exams but may be of interest to some math majors. The last class he gave us a very brief preview of analysis and modern algebra, which was very interesting to say the least. \nProfessor Stein is extremely helpful when it comes to office hours. He is exceptional proficient at fielding questions both from the homework and those outside of class and is always available for assistance. Professor Stein is unique in that he insists on solving problems his own way, and learning about the logic behind his methods is very helpful in understanding the underlying concepts behind the course. Although theory is not emphasized nearly as much as problem solving especially in the textbook, going to office hours is a huge help in this regard. \nLastly, the exams. Around 6 problems each of the two midterms, and around 10-11 for the final. Both midterms have around 5 problems modeled after homework problems, while the last problem is usually a more tricky question that involves some of theory and understanding the concepts behind the problem solving. The final is also straightforward except for some tricky questions. Going through past problem sets over again is easily the best preparation for all of his exams. Be sure to be extra careful with arithmetic calculations; you can lose a lot of points from simple miscalculations. \nMany that take this class find repetitive weekly problem sets and exams. But for those willing to show up to class and willing to go to office hours because they want to learn more about the problem solving and understand why linear algebra is important, there is a lot to be found with Professor Stein. The amount of interest you put into this class is directly proportional to how much you get out of it. \n\nWorkload:\nVery long weekly problem sets (20%), Two midterms (20% each), and a final (40%). \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 08, 2011",
            "review_content": "\nI disagree with all the \"great for non-math minds\" reviews. On a personal level, Prof Stein was great. He had a great (though infrequent) sense of humor and he was very approachable. He was also fairly no-nonsense in the classroom, which I appreciate. If you understand the material, his class I'm sure is very enjoyable.\nThat said, I thought his class was harder than it had to be. I never had a problem with math and tested into calculus 1 with a nearly perfect placement score. But I was always, always lost in his lectures. Class consisted of him flying through problems on the board. Sometimes he'd skip steps without explaining, sometimes he'd just erase portions of the work and fill in the new numbers (which sucked when you're struggling to copy the problem and don't have time to rewrite what he is doing.) He is also one of those math teachers that thinks the harder problems are the \"fun ones,\" which was really unfortunate on tests and homeworks. Like I said, personally, I like him very much. If you're entirely confident in your calculus skills, take his class. If not, find another way. Or make a worthwhile investment in calculus for dummies. It saved my grade.\nWorkload:\nHomework was pretty time consuming every week, but he was pretty cool about giving you the time for it (we had a grace day until 5 pm the day after it was due.) The first midterm almost made me cry. Other people just left. The grading was good though - partial credit wherever he could find it and a nice curve. Know your special cases though. Seriously. (I think the derivative of arctan showed up on one of our midterms, for example, that kind of stuff.)\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 30, 2009",
            "review_content": "\nElliott Stein does not deserve a silver nugget.  True he may be fluent in English, but he teaches with so little enthusiasm, I (an applied math major) could not pay attention for any length of time.  Also, he teaches straight out of the textbook, which in most cases is not a bad thing, except the textbook chosen for Linear Algebra was deplorable.  It only teaches equations/applications, so there are no underlying concepts motivating the subject.  Again, this seems like a minor issue, but when you're doing hours of repetitive homework every week, it begins to weigh heavily on the class.\nNow, about the homework.  From the beginning, it took hours to get through.  He assigns two of every type of problem, which is unnecessary for introductory ideas and time-consuming for later ones.  In short, the work was tedious.\nPerhaps the saving grace of the class was its exams.  They were very straightforward: out of six questions on each of the two midterms, five followed straight from the homework and the last one was only slightly different.  But beware, the grading is tough.  My friend made one addition error and got less than half credit for the question.  The final was basically two midterms.\nHonestly, I took this class because it is required and I wanted a decent grade.  That is all I got out of it, too, since I learned next to nothing in terms of linear algebra.  As to whether I would recommend it, well, if you are simply looking for a good grade and don't mind setting aside a few painful hours a week, this is the class for you.  But still, keep your eyes peeled for a professor that can make the class less frustrating.\nWorkload:\nProblem set every week (2-6 hours normally - 20%), 2 midterms (20% each), final (40%).  He curves to a B+/A-.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "September 03, 2009",
            "review_content": "\nGreat professor, very Woody Allen-esque, minus the constant barrage of self-deprecating wit. Stein does launch an occasional joke every couple of weeks that usually cracks the class up.\nHe's reasonable, and approachable, and very smart. You really get the sensation you're understanding the mechanics of calculus with his strategy of highlighting theory before getting to the gross mechanistics.\nWorkload:\nmakes webworks an optional assignment, which is a beautiful thing.\nHomework assignment once a week, which is very helpful. He's lenient with collecting it, and he always hands it back with comments in no time.\nHomeworks are very similar to problems on midterms/final. \nhe literally takes three or four problems from the homeworks, and changes up a number or a negative sign or teeny stuff like that. 80% of his Final is stuff he covered extensively from the homework. 20% is like linearization/optimization random questions that 40% of the students get wrong or partially incorrect.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "February 24, 2008",
            "review_content": "\nThis man speaks English fluently and without an accent.  Hallelujah.  Professor Stein may not be a dazzling speaker, but he presents the material clearly and concisely.  Occasionally he works through short proofs, but this is always enlightening and rarely confusing.  The book was a nice complement to his lectures.  The class is based less around proofs than the other LA sections, which is a relief.  Stein's exams were fair and usually left a lot of time to go back and check answers (not just for me, for most people in the class).  Bottom line: good professor, certainly a good catch for a math class.\nWorkload:\nweekly problem sets that are repetitive and mildly time consuming, though no real thinking involved; 2 midterms; final\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "August 10, 2006",
            "review_content": "\nStein is one of the best calc teachers you will get at Columbia.  He is very down to earth and can explain difficult concepts to non-math people very well.  He is a lawyer by profession.  You will certainly come out of the class understanding the concepts.  He's also very reasonable.  One more thing that differentiates him from the other teachers is he speaks english! clearly! well!  Don't downplay that - my friends have horror stories.  \nWorkload:\nweekly homeworks that vary in length and difficulty.  He will help you if you ask him and the math help room is good too.  midterm and final make up the bulk of your grade.  they are difficult, but the curve is generous.  Also, because this class was at night, there were a number of students that were older, working during the day, and out of school for years.  This was the first math many of them have probably seen in years, so the class is geared a little more towards those who have not taken calculus courses already.  If you have, the tests will still be chalanging though.  \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "May 19, 2006",
            "review_content": "\nI took calc 1 with Prof Stein, and this term he seems to have made the exams less of a nightmare. Professor Stein is a very good teacher who teaches the subject very thoroughly. If you are taking this just for the grade, and will not use the knowledge in other classes, then avoid (I am sure there are easier graders out there). If you actually need to gain the knowledge and techniques in the class, then I would recommend him \nWorkload:\ncouple of hours h/w a week, 2 midterms and a final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "May 03, 2006",
            "review_content": "\nConsidering that the material is difficult to grasp, this is a very good professor. He is very reasonable and approachable. Get a tutor if you want to ace things...\nWorkload:\nweekly homework. (about 20-25 problems). 2 fair midterms and final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "April 28, 2006",
            "review_content": "\nDr. Stein is one of the best math professors I've had. His lectures are very clear and usually entertaining. He does a good job of deriving the various techniques and proving the theoretical aspects of the material without getting bogged down in mathematical minutiae. He's also articulate and thinks quickly on his feet, so ask questions during and after class - you'll generally get good explanations as well as pointers in terms of how to develop an intuition for applying the different techniques to homework and exam problems. \nDr. Stein is a pretty cool guy and has an acerbic wit (which he will occassionally direct at students).\nWorkload:\nWeekly written homeworks of average difficulty and weekly webworks, which ranged from easy to hard.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "April 28, 2006",
            "review_content": "\nDr. Stein is one of the best math professors I've had. His lectures are very clear and usually entertaining. He does a good job of deriving the various techniques and proving the theoretical aspects of the material without getting bogged down in mathematical minutiae. He's also articulate and thinks quickly on his feet, so ask questions during and after class - you'll generally get good explanations as well as pointers in terms of how to develop an intuition for applying the different techniques to homework and exam problems. \nDr. Stein is a pretty cool guy and has an acerbic wit (which he will occassionally direct at students).\nWorkload:\nWeekly written homeworks of average difficulty and weekly webworks, which ranged from easy to hard.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 06, 2006",
            "review_content": "\nI believe that this past term was Professor Stein's first time teaching at Columbia.  While his lectures were pretty easy to follow, his exams definitely required that students learn how to do the examples in the book.  Both midterms were fair and his final was fair for the most part (just VERY long and difficult!) He encourages you to seek help from him and the Calculus help room which both added to my understanding of the material.  He's a good one to take this class with so go for it and you'll do well as long as you put in the effort.\nWorkload:\nWeekly written AND on-line problem sets; 2 midterms; final\n"
        }
    ]
}