{
    "prof_info": [
        {
            "prof_name": "Kira von Ostenfeld",
            "prof_id": 2284,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 28, 2008",
            "review_content": "\nThis woman is the archetypal academic: absolutely brilliant, but completely inept at administrating a class. Taking CC with her, overall, was an absolute joy- I considered myself so lucky to have such an engaging, insightful instructor! The class was maybe a little less discussion-based than most, which is to say, she spent substantial portion of each class period talking about the historical context of the book, the author's biography, themes, important passages, etc. But that was okay because every word she uttered was pretty brilliant.\nShe can be a little intimidating at first- she expects a lot of you, but at the same time you'll see that she really wants you to do well. She always accepts rough drafts of papers (even late), although her paper topics can be arcane, vague, or irrelevant. She also hands out the midterm ahead of time (both passages and essay topics) and lets you bring a cheat sheet... and encourages the class to collaborate on the midterm ahead of time (both semesters, my class made facebook groups and exchanged answers to the essays and passage IDs, so even preparing the midterm wasn't really work). She gives out substantially more reading than other CC professors for the most part (Example- most people I knew did Groundwork in Metaphysics by Kant in 2 or 3 classes, reading maybe 18 pages at a time- we had to read the whole thing for one class). However, because of the way she runs discussion, you can usually get away with doing a small fraction of the reading. \nI don't even need to mention how this woman's personal biography is AMAZING: she is a countess... and distantly a Kennedy. Overall, because she wants you to succeed, she's incredibly approachable, she's interested in you as a student, she's interested in applying the CC material to the rest of your studies, and makes what has the potential to be a very daunting reading list into an interesting, relevant, even fun class. CC with Ostenfeld has been one of the highlights of my academic career at Columbia.\nWorkload:\nMore reading than most CC courses. Reading responses due before class if you don't speak in class a lot. 2-3 papers ranging from 5 to 10 pages each on pretty odd topics. Easy as cake midterm and final that are essentially take-home. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 27, 2008",
            "review_content": "\nAt first Kira, a jovial alumna of Georgetown's SFS and former FBI agent who found herself as a sixth-year grad student specializing in Renaissance Spain and who blusters into CC the first day (as she does every day) with a preternatural energy rendered in a voice not unlike a harpy's, seems terrifying, what with her talk of 'achievement,' 'potential,' and other buzzwords that portend the worst sort of aggressively nurturing tendencies in young, brilliant teachers today.  I myself was scared shitless that I was in for another awful ordeal where one was graded on effort rather than intelligence and PC pabulum ruled the round-table.  But after the third session of class, I loved Kira, and so did everyone else.  In retrospect I had with Kira an ideal CC experience: she gave summaries of each book during each class to give us shared underpinnings (a happy consequence of this was that the readings were always optional but often worth doing anyway), indulgence in the class discussion was rarely censored but always when it needed to be, the papers were generally worthwhile and came back with detailed and fascinating comments (albeit a week or two late, which was kind of nice), the tests were given out beforehand to maximize learning and minimize stress, the grading was consummately fair, and we went out to dinner on the Core office's dime twice.  Only minor quibbles are a profound administrative ineptitude/flakiness that led to our papers being due several weeks after they originally were.  Of course, picking a CC teacher is often difficult, but pick something in the 4-6 timeslot and give yourself a chance to get Kira.\n\nWorkload:\nFair enough.\n"
        },
        {
            "course_name": "Intro to European History: Renaissance to French Revolution 1500-1789",
            "review_date": "December 21, 2004",
            "review_content": "\nSince this is my first year at Columbia, Kira is the first TA I've had with recitations. She did not fulfill the criteria of the \"TA from Hell\", which is what I'd always imagined TAs would be like. She really made my experience an educational and enjoyable one. She came to recitation every day with tons of knowledge that she was eager to share with us. And even though it was a discussion section, she didn't force us to share ideas or treat us condescendingly if we didn't respond correctly. She was very welcoming of different opinions and ideas. We were required to read selections of texts before each recitation, but she didn't make us feel initimidated if we came ill-prepared, which happened quite often. When you hand in rough drafts to her for suggestions, she returns them in a timely fashion and gives you GREAT suggestions and ways to improve the paper's strength in argument and organization, down to the punctuation. \nYou can really tell that she's enthusiastic about the material and is excited for you to learn it. She knows her stuff and is willing to share it with you. Without intimidation and condescention, she ran the recitation perfectly well and perhaps even better than her colleagues from the other sections. If she decides to become a professor here, I'll definitely take her course.\n"
        }
    ]
}