{
    "prof_info": [
        {
            "prof_name": "Karen Henson",
            "prof_id": 2230,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 25, 2010",
            "review_content": "\nI dreaded Music Hum going in, and I left the class really glad I was forced to take it... all thanks to Prof Henson.\nShe makes you learn the canon and all the technical vocabulary, but isn't too much of a stickler about it on exams/concert reports. She's more intent on you truly appreciating the music rather than making you a good cocktail party robot that can blather on about Fur Elise.\nMost telling was her choice to not have any IDs on the exams. I asked her why she was only going to play songs we hadn't heard before, and she told me \"If I tell you Beethoven's Fifth is going to be on the test, you'll listen to it a million times and never want to hear it again.\" This is EXACTLY the mentality Music Hum teachers should have.\nSo, instead of mindlessly identifying pieces of music for the exams, she played John Lennon, the Beach Boys, the Who, etc and made us describe it with the vocab she gave us. Great approach. If you're in her section, you're lucky.\nWorkload:\nMidterm, final, 2 concert reports (10 pages distributed between the two however you choose)\n"
        },
        {
            "course_name": "Opera",
            "review_date": "April 22, 2009",
            "review_content": "\nKaren Henson's class is by far one of the most interesting classes I have taken at Columbia. The class is engaging and class participation keeps everyone interested. I already had an appreciation for opera, but after taking this class, it's impossible not to love it. I definitely recommend this course. The work is easy, and the reading is helpful for the midterm and final, but not necessary. I'd recommend going to class because it's enjoyable and the notes really help when writing the term paper and doing the midterm/final. \nWorkload:\nTake home midterm and final, term paper, reading and listening exercises (not heavy at all) \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 15, 2007",
            "review_content": "\nIf you were assigned to Professor Henson for music hum, you lucked out. The chief reason for this is that she does not take the class overly seriously, but you will still learn a lot. You don't need to a do a ton of work, but you need to listen to the music. And the class is completely relaxed. More importantly, she's British!!! She'll tell you to \"have a think about it for next class\" and she'll entertain you with her delightfully English wit. \nWorkload:\nAverage for a Music Hum class. 2 papers, midterm, final. Fair tests, fair grader.\n"
        },
        {
            "course_name": "The Opera",
            "review_date": "January 22, 2006",
            "review_content": "\nProf. Henson is really wonderful. Her class was so much fun, in addition to being very interesting and informative. She really tries her best to encourage everyone to participate and especially encourages non-music majors to voice their opinions. She does have a \"class participation\" component to her grading, which can be a little frustrating for people who are on the quiet side, but that is truthfully the only thing I didn't like about the class. All in all, her grading was quite fair and I learned a lot. I would highly recommend this professor.\nWorkload:\nTake-home midterm and final, 1 term paper. Reading is not really necessary for class discussion, but is certainly helpful ... and REALLY helpful when it comes to writing the midterm and final (though she does not expect extensive quoting)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 17, 2005",
            "review_content": "\nProfessor Henson is very funny, very engaging, and very British.  If Bridget Jones ever taught a music class, this would be it.  She knows you don't give a crap, so she shapes her talks with plenty of historical background to what she's talking about.  You can tell she loves the subject, and does not grade unfairly at all.  I'd so most people in the class had A's.  I'd guess this is about as good of a music hum class as you'll get.\nWorkload:\n2 papers, midterm, final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 02, 2005",
            "review_content": "\nProf. Henson is a young, chamring Brit who taught her first American students this semester.  The class was very enjoyable and light-hearted.  The workload was pretty easy and Prof. Henson's accent was fun to listen to.  Classes consisted of discussion of some technical musical terms, but she made sure not to get too technical.  Most of the analytical terms are self-explanatory.  Most of the class was spent in discussion of a history of music from chant to opera to impressionist.  Prof. Henson is a Verdi scholar, so there was a focus on Opera.  I would have liked it if there was more in-class listening.  She would talk about the pieces, but sometimes I would have like to listen more. \nShe and the T.A. were easy graders, due, I think, to her thinking that American students are very sensitive when it comes to grading, which is probably true.  I don't know if this will change, but grading was easy.  I really enjoyed the class and I would choose to take Music Hum with her again.\nWorkload:\nShort readings and listening for every class.  Not really necessary.  Two concert reports, 10 pages split between the two.  One had to be on La Traviata, which we saw as a class. The other could be on anything.  Midterm and final were pretty easy: listening analysis, short essay on a particular piece, and longer historical essay.  Very manageable workload.  I got an A-.\n"
        },
        {
            "course_name": "The Opera",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Henson is very easy going. She encourages participation and discussions, but you don't have to participate if you don't want to. You don't have to know anything about music or the opera in order to take this class. We watched different performances of various operas and listened to some recordings. I learned a lot about operatic form, meaning, and the historical contexts in which the different operas were composed. She does care about grammar, but I don't think that affects your grade if there's not a major problem. Sometimes when she rambles it gets a little boring, but overall it is a relaxing class. Love her British accent.\nWorkload:\nReadings from the course reader (not mandatory), take home midterm and final, 8 page essay\n"
        },
        {
            "course_name": "The Opera",
            "review_date": "December 20, 2004",
            "review_content": "\nGreat course for music major and non-music major alike, for opera buff and opera newbie alike. Prof Henson is well-qualified, fun and intelligent, not to mention British (which really grows on you...). \nThere is lots of opportunity for detailed musical analysis in this class and also time for general discussion about opera as an art form, performance thereof, etc. Plus, the reading she gives you in the reader is pretty witty and interesting!\nHenson was new to Columbia this year and i think she made a grand impression. She's not afraid to make fun of people in the class (this grows on you too...), and she encourages new ideas constantly.\nOne caveat: Huge stickler for grammar/form in essays. Use a conversational tone, but remember- this woman comes from the place where English was invented!\nthat being said, take this class and start loving opera!\nWorkload:\nreading not really mandatory (she doesnt test you on it), but you get out what you put in. take home midterm and final and one 8 page essay (topics open- you just have to run it by her beforehand)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 22, 2004",
            "review_content": "\nTake Music Hum with this woman-- she is witty and British and knows her stuff.  She makes class so interesting, and fun (with a 5 minute break!), that I am taking her Verdi class next semester just to have her again.\nWorkload:\nshe doesn't make you do the reading and the tests are easy: no memorization, no dates.  she is crazy about good writing in the concert reports, though.  \n"
        }
    ]
}