{
    "prof_info": [
        {
            "prof_name": "Ludovico Geymonat",
            "prof_id": 3930,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Medieval Art in Manhattan",
            "review_date": "June 06, 2012",
            "review_content": "\nThe course material was interesting enough, although I was left with the feeling that Ludovico was not always fair when it came to grading.  He emphatically made a point in class that he's not very good at reading English and actually asked one of the students to read a section for him during one class period.  However, he made a really snarky comment on one of my papers that I wasn't a very good writer and that it was difficult to understand my points.  I found that incredibly offensive given that he already told us that he has trouble reading English plus I am known by my Columbia professors to be an exceptional writer, especially after four years of research at the university.  I found it really odd that he posts everyone's grade for every course requirement on Courseworks.  He does not post names but with only six students in the class you can start to guess who got what score.  That's when I also found out that he was giving full credit for discussions and readings for students regardless of whether or not they did the work.  There was one student in my class you hardly ever spoke and when he did you just knew that he hadn't read any of the assigned work.  Lastly, I found it odd that a professor who claims to be an expert in Medieval Art doesn't read Latin.  How could he teach us about these great works of art yet be unable to read inscriptions on them. Wouldn't that be an important and relevant part of his academic research?  I remember when he asked students if anyone read Latin.  \nWorkload:\nQuizzes and exams where you need to regurgitate back the stuff he talked about in class.  He got really picky if you didn't know where all the cities were located on an ancient map.  A weekly discussion post.  A few small papers and a much larger research project.\n"
        }
    ]
}