{
    "prof_info": [
        {
            "prof_name": "Paloma Duong",
            "prof_id": 6333,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Hispanic Cultures II: Enlightenment to the Present",
            "review_date": "March 22, 2011",
            "review_content": "\nDespite liking Paloma very much as a person and doing quite well on both the midterm and the final, I suffered in this class.\nThe bi-weekly short papers that we had to write for her should not have been incredibly difficult, but I found myself struggling to do well on them for the first time in my college career and in my 7 years of Spanish.  At the beginning of the semester, she graded my content very harshly, but without giving me very much explanation of why she found my work unsatisfactory.  I went to her many times to figure out what it was that I was doing wrong, but was bewildered to find similar comments on every singly paper.  Over time, my grades got incrementally better until I was earning A's on my work.\nI felt that I was made an example of, and it did not help me to become a better student of Spanish literature.\nPaloma needs to be clearer in her reasons for the grades she gives so that she is providing tools for improvement, rather than some sort of a final verdict.\nWorkload:\nBiweekly 1.5 page papers, 2 reasonable examinations of the history and important vocabulary at midterm and finals time.\n"
        },
        {
            "course_name": "Intro to the Study of Hispanic Cultures",
            "review_date": "December 14, 2009",
            "review_content": "\nPaloma is a wonderful teacher and you should take her class if you can.  She does a great job of engaging students in a discussion.  Classes are never boring and go by really quickly because she really varies the structure and subject matter of discussions.  While she obviously doesn't have very much experience teaching (she's only a few years older than undergrads), Paloma thinks of creative assignments that get students thinking in different ways, and she provides really constructive feedback.  We had to create a portfolio of 2-page assignments, where we would hand them in over the course of the semester and she would give us comments which we would have to incorporate into a final portfolio with all the corrected assignments.  While the work for the class wasn't very much or very stressful, it was useful because you could really focus on the mechanics of writing in Spanish.  Paloma is a gem, and if you take her class you will learn a lot but not have to deal with an oppressive workload.\nWorkload:\n2-page compositions due every few weeks--these are all drafts.  You correct these by the end of the semester and hand in a portfolio.  Readings for each class and some exercises.  Definitely on the lighter side.\n"
        },
        {
            "course_name": "Hispanic Cultures II: Enlightenment to the Present",
            "review_date": "November 18, 2009",
            "review_content": "\nPaloma is cearly very well versed in what she is teaching, despite the fact that she looks to be about 26.  I am constantly impressed by how much she knows about each topic we study.  She always makes sure that everyone can participate in discussions.  But beware, you can't get away with writing bullshit papers.  (It's okay though because none of the compositions are longer than 2 pages). At first her accent is a little difficult to understand, but everyone gets used to it eventually.  Don't be late to class. \nAs far as the content of the class goes, I think a lot of it is determined by the department.  That being said, we looked at everything from Barthes to youtube videos (a favorite of mine was called \"El futuro esta en porno\") to Calle 13 lyrics. \nWorkload:\nnormal.  a handful of compositions that come with re-writes, in-class work (usually in small groups), and a final presentation. no final exam :)\n"
        }
    ]
}