{
    "prof_info": [
        {
            "prof_name": "Mark Debellis",
            "prof_id": 135,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "February 25, 2015",
            "review_content": "\nSuch an awesome professor!! He cares so much and is so interested in music that it makes YOU interested in music! He's so excited and gets performers to come to a lot of the classes, so class is always interesting. He also shows us performances of a lot of the pieces we listen to, which makes class more interesting. He's a really easy grader and works really hard to make sure that everyone understands the material.\nWorkload:\nTwo short papers that he grades very easily. Readings for every class that you should do before the midterm (some of his questions for tests are things taken straight from the book), but you don't need to do them before every class. One midterm and a final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 02, 2015",
            "review_content": "\nWhile this may not be your most exciting class, Debellis is very clear in relaying concepts and pretty much sticks to the textbook throughout the course.  Keeping up with reading and listenings in the text will help, but is not absolutely necessary to follow along in class.  This class is not a history class, but rather focuses on how music is organized and structured.  No worries if you have zero musical background like myself.  He will provide a list of known listenings for the exam, so be sure to make a playlist of these and know them well.  \nThe workload is reasonable and he's a fair grader on papers.  Nice guy as well.\nWorkload:\n2 concerts, 2 papers each 3 pages and 3 fair exams consisting of known listenings, unknown listenings, short answers and short essay \n"
        },
        {
            "course_name": "Diatonic Harmony & Counterpoint",
            "review_date": "May 03, 2006",
            "review_content": "\nIf you want to skate through with an A, this is not your guy. If you want to learn music theory really well and have fun doing it, DeBellis is terrific. As a theorist, he takes the material very seriously and expects that you will, too. He grades assignments very carefully, which (if you have a soul) will make you want to write them more carefully. \nEven without considering the material itself, on the sole basis of this increased discipline, I'm a better musician for having taken his class.\nHe's also hilarious, in a very dryly intellectual way. Usually they're his own words (one of his catchphrases is \"I commend this example to your attention\"), but I wasn't surprised when a Monty Python reference slipped out of his mouth midway through the term.\nI'm writing this review before the final. My grade probably won't be as high as I'd have liked. It doesn't matter. I loved DeBellis's class and I'd gladly take another with him.\nWorkload:\nLight to medium (depending on your compositional velocity; mine's a little slow). A typical four-voice assignment is either to fill in a figured bass or to harmonize a given melody, 6-12 measures or so. Other types of assignments: a dozen 1- or 2-bar phrases, species counterpoint. Two assignments per week.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "April 18, 2005",
            "review_content": "\nOnce you get over the fact that Professor Debellis is essentially RIck Moranis, both in appearance and demeanor, and begin to take him seriously, this class is great.\nI came into it with a pretty solid grasp on the concepts to be covered, but  didn't really find myself all that bored or disengaged.  Debellis has an enthusiastic attitude and isn't afraid to crack jokes at his own expense, both of which keep the class lively and awake.  His teaching is thorough, and he even sets up times to teach those who don't know how to pick out notes on the piano so they can check their assigments aurally.\nThe only downside might be the feeling of time wasted going over EVERY homework assignment, which, if you know what you're doing and spend a small amount of time checking your work befor eyou hand it in, is probably a waste of time since it's just repeating the correct answers.  Also, be very careful with your musical penmanship, as he can be very picky about whether your note is on the line or space or somewhere in between.\nLong Story Short -- great, approachable, thorough professor with a grasp on his material and how to teach it.\nWorkload:\nHomework assignments for every class.  Midterm Exam.  Final.  Assignments are initially very easy, but by semester's end, expect to spend a solid 30 minutes to an hour on assignments if you're not already some amazing virtuoso.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "April 18, 2005",
            "review_content": "\nOnce you get over the fact that Professor Debellis is essentially RIck Moranis, both in appearance and demeanor, and begin to take him seriously, this class is great.\nI came into it with a pretty solid grasp on the concepts to be covered, but  didn't really find myself all that bored or disengaged.  Debellis has an enthusiastic attitude and isn't afraid to crack jokes at his own expense, both of which keep the class lively and awake.  His teaching is thorough, and he even sets up times to teach those who don't know how to pick out notes on the piano so they can check their assigments aurally.\nThe only downside might be the feeling of time wasted going over EVERY homework assignment, which, if you know what you're doing and spend a small amount of time checking your work befor eyou hand it in, is probably a waste of time since it's just repeating the correct answers.  Also, be very careful with your musical penmanship, as he can be very picky about whether your note is on the line or space or somewhere in between.\nLong Story Short -- great, approachable, thorough professor with a grasp on his material and how to teach it.\nWorkload:\nHomework assignments for every class.  Midterm Exam.  Final.  Assignments are initially very easy, but by semester's end, expect to spend a solid 30 minutes to an hour on assignments if you're not already some amazing virtuoso.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "January 22, 2004",
            "review_content": "\nDeBell has a curiously subtle way of being a fantastic Fundamentals teacher.  The first two weeks or so are slow if you know anything about music, but it picks up after that.  Don't be fooled by his funny mannerisms.  He really knows his stuff, as you gradually come to realize.  Some of the classes seem tedious, but nevertheless if you have any interest in music, you'll quickly come to love DeBellis for all of his quirks.  I highly recommend DeBellis for any class he may be teaching.  He cares so much about what you get out of the class, and he's always available to talk with outside of class.  A+, Debell.\nWorkload:\nA lot of busy, yet necessary, work.  He makes you write out all the excercises on staff paper, but this quickly builds your ability to do it, making his Midterm and Final a breeze if you've been paying attention and putting a decent amount of effort into the homework.  All in all, moderate.\n"
        }
    ]
}