{
    "prof_info": [
        {
            "prof_name": "Brian Metzger",
            "prof_id": 12887,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Physics 1401",
            "review_date": "July 17, 2016",
            "review_content": "\nClear lecturer and occasionally (unwittingly) hilarious. Just do the work and you'll be fine. Also, it helps a lot to read the textbook. I have no prior knowledge and managed to sneak out an A. I actually thought it was a lot easier than mechanics. \nWorkload:\nAverage (14 hours/week, maybe?)\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 14, 2016",
            "review_content": "\nEven after considering the awfulness of most Columbia professors, I cannot understate how miserable my experience with Metzger was. He is, at best a tedious and monotonic lecturer. He rarely stops to ask for or answer questions. He puts minimal work into the class - this was his first time teaching, and yet he could not take it on himself to make a practice final or midterm, instead giving us one from another professor that he himself admitted to being bad during office hours. I have had other professors in the same position who were willing to do so, but apparently this is too much for him. \nI didn't have any background in physics prior to taking this course, so I found it challenging. Lectures were not good vehicles for learning the content as he would go through long derivations and spend minutes on a concept. I don't know if homework really helped to reinforce the ideas or not; in my opinion, everyone used available answer keys (go find them) to do the homework. A lot of the HW problems involved useless long math calculations (that he admits he will not test) - honestly, half of the time, it seemed like he flipped to the page and randomly choose a few questions. \nHe is also not a gentle grader, in my opinion. 1 midterm, and 1 final made up most of your grade, so good luck to you if you messed either one of them up! I did, and ended up with a B-. It's probably my worst grade ever at Columbia. For comparison, I got an A in 1401, which is admittedly easier and probably has less people who dropped down from 1600. I was actually (prior to taking this class), planning on doing a joint major with physics; this will probably not be happening.\nI would personally not recommend him for people who care a lot about grades, do not have a good physics background and require a competent lecturer. If, however, you know the material well, and don't require much instruction, you'll be fine.\nWorkload:\n1 midterm - 35%\n1 final - 45%\nHW (weekly, 10 problems, basically did not factor into grade b/c everyone had the key)  - 20%\n"
        },
        {
            "course_name": "Electromagnetic Waves and Optics",
            "review_date": "May 04, 2014",
            "review_content": "\nProfessor Metzger has a habit of lecturing to the blackboard. Though he says that questions are welcome, he very rarely looks up from his notes long enough to see who has their hands raised, even immediately after he asks if there are questions. \nHis presentation of the material is reasonably clear and he only makes a few minor errors in any given class. His motivation of the mathematical material is fairly compelling, but many of the derivations covered in this course are unavoidably long and tedious, so it is just not easy to maintain one's interest for the full lecture, given the detached manner in which Metzger lectures.\nThere were absolutely zero in-class demonstrations for this course, despite the fact that it covers very accessible results in optics and electrodynamics.\nOverall, not a terrible concluding course for the intermediate physics sequence, but there is no getting around that this material is hard going. \nIf you're studying physics, you'll have to take this course. If not, you probably shouldn't.\nWorkload:\nStandard physics course: \n- 11 4-6 question problems sets, with a shorter twelfth one added before the final to cover the last bit of material\n- one midterm (fairly easy, mostly conceptual questions with a few simple integrations)\n- cumulative final\n"
        }
    ]
}