{
    "prof_info": [
        {
            "prof_name": "Jason Freeman",
            "prof_id": 927,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "September 03, 2002",
            "review_content": "\nAre you kidding? How can you not want to wrap Jason Freeman in a polarfleece blanket and hand him an artisanal mug of steaming cocoa? He is so shy and adorable but sooo eager to teach. He brought in really insightful snippets of articles and such, and also some ancillary musical listening which really informed what we were studying. He is always available if you need help and he knows a lot. Watch out for his secret sense of humor-- sarcasm and dry wit abound if you haven't stopped listening just because he looks like pinocchio. \nWorkload:\nVery by-the-book, nothing extra. Two short papers and weekly assignments that I often did wasted and aced because they are so 5th grade. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 24, 2002",
            "review_content": "\nJason, a Yale graduate, is eager to teach music hum. That doesn't necessarily mean he's that good at it. He tries his hardest to keep everybodys attention, but unfortunently he doesn't quite get there. The midterm was very hard, but by the final he realized that he needed to ease up and it wasn't nearly as difficult as the midterm. His best asset was that for the midterm and final he gave us a list of the pieces that we had studied.\nWorkload:\nWeekly (or so) simple assignments, midterm and final. Two concert reports.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 21, 2002",
            "review_content": "\nJason managed to make the second half of music hum tolerable. That alone is impressive. He found fun ways to teach us about the things we had a hard time considering music, and was very open to our ideas. He was readily available to the students. Very thorough, very interesting. He expects a lot from your essays, and you'll do better if you have a good ear, but if you don't you can still ace the midterm and final and walk away with at least an A-.\nWorkload:\nA short weekly assignment on the pieces, two papers, midterm, and final.\n"
        }
    ]
}