{
    "prof_info": [
        {
            "prof_name": "Hannah Rabinowitz",
            "prof_id": 12874,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "April 23, 2014",
            "review_content": "\nEkstrom is adorable, and he really cares about the material he's teaching, and it shines through in his lectures. He tries, but, unfortunately, he doesn't always succeed. I end up spending half of the lecture on my phone, and he's a bit dry for an 8:40 AM class.\nThe class material is all really interesting, and he tries to make it accessible and engaging and humorous, but this class can get HARD. The TAs can be tough graders, and there will be curveballs on the midterms (of which there are two) that you will not have seen before. The problem sets were all over the place -- some were ridiculously easy and quick, while others were incredibly difficult and could take hours for me to finish. There is roughly one a week (except the weeks when there are exams). My grades were all over the place in the class, and reflected that -- some were A+'s and some were C-'s. You win some, you lose some. This class is essentially a statistics class taught through the lens of environmental science: they want you to do some mathy stuff, so they throw it into what could be a really genuinely interesting class.\nDiscussion sections are optional, but are helpful in making sure that you can at least do the problem sets. They don't do much else, and that's the reason anyone goes.\nI ended up P/D/Fing this course like the person below me did, which makes it easier on me, but it's not worth it over all if you're not a science person looking to get through your science requirement with an easy A. It's just not happening in this class.\nBottom line: take it if you're interested in the material, but don't go into it expecting to coast. Take it if you really, really, really want to challenge yourself.\nWorkload:\nTwo midterms, one final exam, can be rather harshly graded. Problem sets every week after the first that there isn't an exam (so there are roughly 11 over the course of the semester).\n"
        }
    ]
}