{
    "prof_info": [
        {
            "prof_name": "Alvin Wald",
            "prof_id": 1483,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Engineering In Medicine",
            "review_date": "March 24, 2007",
            "review_content": "\nThe structure of this class makes for a very manageable A.  Guest lecturers generally lecture at a high level and it's tough to stay awake, so most people figure out that it's pointless to go to lecture.  Just find the good TA section and write down every single word and diagram the TAs put on the board and make sure your homeworks reflect what they tell you.  The review sessions prior to the midterm and final are extremely helpful.  I did a lot of Wikipedia research for this class and printed a lot of material from it for the midterm and final and it was helpful to me.  The most helpful thing, though, is to have tidy recitation notes and papers and psets that are at least an 8/10, which can be hard at times.  I did all the homeworks the night before and it was totally manageable.  If you are spending more than 2 hours on a homework you're spending too much time.  How to study for the midterm and final: Go to the review sessions, and for the day of the test bring a binder with all your notes and graded homeworks and all of the supplementary material that Dr. Wald posts on courseworks.  Often he takes some questions from the supplemental essays and papers but the answers aren't so hard to find.  Just be organized.\nI learned a lot of really interesting things about BME and just Medicine and Surgery in general in this class but it was more of a fun class for me than a serious one.  Take it and enjoy your good grade.  People who did not get at least an A- simply slacked off on the homework or were in the bad TA section.\nWorkload:\nWeekly problem sets that can be Psets or Essays.  Essays are easy, Psets are not.  Open book Midterm/Final, both with averages around 70-75%.  A+ is not awarded in this class, unfortunately, though many students would have it! \n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "January 18, 2007",
            "review_content": "\nMy advice; take this class if you don't want to work too hard or need to fulfill a requirement.  Do not take it if you want to learn or experience the field of BME. The general consensus about Professor Wald is true; he appears to be a nice guy but is extremely boring, seems to be oblivious to what is going on, and drones on pointlessly for the first 45-60 minutes of class.  The TA's essentially run the class, and it is their recitations that matter. For the weekly homework, simply regurgitate what the TA's tell you, add a fair bit of your own work (wikipedia will do the trick), and make sure its not too short.  This may just be a personal opinion, but I found most of the guest lectures to be boring, as well.  They were too topic-specific, and only gave you an idea of a specific project, not the opportunities of the field or the exciting research being done.  Finally, although the midterm and final were not difficult, per se (they were both open-note), they included a lot of minutiae that were at best mentioned in passing.  Bring as many notes and printouts as you can, and you'll do okay.\nWorkload:\nWeekly homework assignments (9 of 11 are actually graded) are not too challenging, just attend recitation.  One midterm and one final, both of moderate difficulty due to the fine points they ask you to recall.\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "December 22, 2006",
            "review_content": "\nProfessor Wald was sweet but senile. His lectures were boring, but some of his obscure facts actually showed up on the finals. The guest lectures, while some were interesting, were basically pointless as for grades -- the recitations were what made up the course. For the homework essays, repeat what the TAs said word for word, plus a small paragraph of wikipedia research and you'll get a 10. (Don't worry about the word limit)\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "December 10, 2006",
            "review_content": "\nDon't let the older reviews fool you. This class is no longer quite so easy.  The final and midterm may be open note but they are still pretty difficult.  The averages are upper sixties or low seventies if you need proof.  I went to the lectures and recitations and it seemed to be that many of the questions had never been covered.\nAnd as for the TAs not reading the papers and basing the score on length... I wrote one that was 3 and a half pages and got a 7.5 out of 10.  Although I eventually figured out that I needed to include every single thing my TA said during recitation to get an A and did get 10's on most of the weekly papers, some of my friends struggled and never got better than an 8.5.  New this year, the TAs now require extra research on every single paper to get full points.\nWith that aside, this class was extremely interesting.  A wide variety of topics were covered and the guest lectures were usually interesting.  I probably learned more here than in any of my other classes.\nWorkload:\n3 page paper every week (best 9 out of 11), a weekly recitation that you MUST attend to succeed, curved open note midterm and final\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "December 01, 2006",
            "review_content": "\nProf Wald has nothing to do with this class. The lectures, midterm, and grading are all outside of his control. The class is interesting. Every week there is a guest lecturer who speaks about a topic in Biomedical Engineering. The TA's write the tests, grade the tests, write the homeworks, and grade the homeworks. \nWorkload:\nNot bad at all - A midterm, a final (open book). Weekly homeworks that are a bit annoying but very doable. \n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "December 22, 2005",
            "review_content": "\nThis class rocks, I mean it's really boring sometimes, and some of the guest lecturers suck but most are really good, once you learn to write the essays, you're golden and the midterm and final are tough but the curve is general...and it's open notes, definitely take this class\nWorkload:\nOne essay a week, one open note midterm, one open note final...and an extra credit assmt.\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "January 05, 2005",
            "review_content": "\nEasiest A you'll get!\nDeciding whether to take this course or Physics of the Human body? This course is as easy as they get for SEAS students. TAKE IT!\nThe lectures are SOOOOOOO BOOOORRRRIIIINNNNGGG. Spare yourself the pain and skip Wald's 45 minute drones and only go to the guest speaker lectures you won't miss anything. Wald has the curse of redundancy; in 45 minutes of lecture, he will have explained nothing at all. \nAsk your TA's which lectures to attend, becasue out of 11, I would only recommend about 3. \nGO TO THE RECITATIONS - that's what will get you the easiest A in Columbia. The TA's are sophomores and juniors, so you can approach them as friends, and they'll give you honest advice.\nIn conclusion, you won't have to open a book EVER for this class, or use your brain for that matter..... TAKE IT, great GPA booster!\nWorkload:\nOne 300 words paper a week, best 9 out of 11 counted - easy as hell, go to the recitations\n1 midterm, and one non-cumulative final (ie a second midterm) OPEN BOOK, you can bring anything, books, notes, friends.... ok, no friends - not that you'd need them.\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "December 29, 2004",
            "review_content": "\nHis 45 min lectures at the beginning of class are boring and pretty much useless, so show up late. The guest speakers talk next and they are very interesting. Then go to the recitaion where they TAs tell you exaclty what to put in ur paper and this class is easy to get an A in.\nWorkload:\nOne paper a week. They are easy to write, just a bitch if you leave it to sunday night. The midterms are easy cuz they are open note.\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "January 28, 2004",
            "review_content": "\nThis class is really interesting.  Some of the guest lecturers were really boring, but there were some real gems in there. Wald is a really cute old man, but his 45 minute lectures at the beginning of class are pretty dull.  The easiest way to get 5s on your lectures is to go to the recitations...the TAs tell you exactly what they want to see in your paper. You could just not go to the lecture, but you'd be cheating yourself by missing out on some really brilliant people.  \nWorkload:\nweekly essays (they count all but 2, so you can not turn 2 in), midterm and final (not cumulative, both are open book)\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "December 15, 2003",
            "review_content": "\nif you have to take this course, don't worry.  it's easy and sometimes really interesting.  although prof wald's one hour lectures before the guest speaker can be EXCRUICIATINGLY boring, many of the guest speakers are really good.  of course, some aren't, and then those are when most of the class takes naps in the dimmed down lighting...  the most important thing to know about this class: if you are too slackerish to go to lecture (although you really ought to go) you MUST at least go to a recitation section.\nWorkload:\none essay/week, 9 out of 11 are graded.  midterm and final exam are open note and are fill-in-the-blank and short answer.  all pretty easy if you go to the lecture and the recitations.\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "December 14, 2003",
            "review_content": "\njust wanted to disagree with the other reviewer. the TAs definately read the papers and you don't just get a 5 on every paper...i got a mixture of 4s and 5s when i put the effort in but the week that i just tried to hand in crap i got a 2 and it was probably deserved...you do have to try in this class but it really is damn easy and you'll do well...for sure the easiest of the pre profs, compared to what i've heard\nWorkload:\nten essays, 3 pages eachmidterm, final, openbook\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "November 17, 2003",
            "review_content": "\nGreat class. By far the easiest Pre Prof course you could take. Kinda long lectures, but u may atcually learn something. all the notes posted online. Highly recommended\nWorkload:\nweekly papers. which are around 300 words. midterm and final. both real easy, most question are fill in the blanks\n"
        },
        {
            "course_name": "Engineering In Medicine",
            "review_date": "January 21, 2003",
            "review_content": "\nYou go to class and a genius lectures you on why they are a genius. Then you go home and write a paper explain why they are a genius. The TA's \"read\" them and grade them....It took me about 2 classes to realize that there are too many papers for the TAs to actually read, so they basicly just look at how long it is. If you write 3 pages each week, you will get a 5 (of 5) on every paper- no matter how bad it is. There are recitations and office hours, so you don't even need to go to the lectures to write the papers, although it makes life a little easier. This was the easiest A I have gotten thus far in my Columbia career. Plus, if you care, you can learn quite a bit. As for Wald, he's a nice old man who knows what he's talking about.\nWorkload:\n3 page (or less if you don't want an A) paper each week (not as tedious as it sounds). A midterm (take-home, fill in the blank) and a final (in class, open book/note, fill in the blank) \n"
        }
    ]
}