{
    "prof_info": [
        {
            "prof_name": "Nicole Wallack",
            "prof_id": 1758,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 05, 2005",
            "review_content": "\nI wanted to pipe in a word about Professor Wallack because I worry that too many freshman are caught up in work load and what their friends are doing in their core classes and end up missing out on a wonderful learning experience.  I took this class with Prof. \nWallack my freshman year and I can safely say that she is one of the best professors I've had at Columbia and she made what could have been one of the worst classes at Columbia into one of the better ones I've taken.  You will be doing more work than your friends do in their university writing classes, but in the long run you should be feeling badly for them, because they most likely have some grad student and you have the assistant director of the whole program sitting right front of you.  Nicole really does push you to the limit, asking you to try new things (she once made me literally cut up my paper and put it back together in a different order) and her advice has stuck with me in my writing throughout my Columbia career.  The important thing is that she wants you to do well.  She grades you tough but she wants you to do better, and you're allowed to rewrite your essays for an entirely new grade.  She makes herself available to all of her students, has a quirky sense of humor and is very approachable and easy to talk to.  Just to give you an idea of how different she is from the reviews written before me:  She heard me saying to a friend that is was going to be my birthday on Thursday and when my birthday rolled around I went to class and she had bought me a cake with candles.  So yeah.  If you get in then consider yourself lucky.  And just do yourself a favor and stay in this class.  You can thank me later.   \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 03, 2005",
            "review_content": "\nDr. Wallack is hard.  I spent more time on her class than all my others combined.  However, she is also a passionate teacher, and truly cares about whether or not her students learn.  If you are placed in her section, it is worth it to work your butt off.  Not only will it pay off for your grade in this class, but it will improve your writing immensely.  You will mostly learn about how to improve your IDEAS, though.  I actually really dislike Nicole Wallack's personal writing style--it is wordy and overly-intellectual to the point where I can't feel that it matters.  Again, though, you will learn a lot from her despite all of this.\nWorkload:\nSame as all UW classes, but be prepared to rewrite your essays forever.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 16, 2004",
            "review_content": "\nDo not take a class by this professor if at all possible! She makes you read the worst possible texts, and then she goes on and on as if they are the best pieces of literature ever written. When you are writing your essays, she leads you in completely different paths. After one draft, she may tell you to do something, and then after you do that, she says something completely different. Also, if you are a guy it will hurt you, because she gives advantage to flaming liberal girls. On top of all of that, she grades very harshly. Most of my friends who take this class received A-s or As, and I looked at their essays and they weren't anything special. I know kids in my class who received Cs and their essays were much better than those who received As from other professors/TAs. Maybe it is because she just taught English grad students at NYU, and expect that level from us, but I don't know. \nIf you are unfortunate enough to be put in her section, I recommend switching out by some means.\nWorkload:\nMuch more than other UWriting classes! Almost every class in the first half of the semester you have to write a short essay!\nLens Essay (25%)Constellation Essay (25%)CCP (35%)Presentation (5%)Reflection Essay (10%)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 02, 2004",
            "review_content": "\nIt's impossible to overemphasize the importance of taking this course with someone else. While theoretically every section of University Writing should be more or less interchangable, Ms. Wallack manages to make sure that her section always has more work to do than any of the others. In addition to assigning more work, she tends not to be too specific about exactly what she's looking for, and never returned assignments quickly enough for the next one to reflect her comments. She also has no sense of time management in the classroom, often beginning what should be a 20 minute discussion with 5 minutes left in class.\nWhile she's willing to be somewhat flexible on major deadlines to those who she thinks make the class a priority, there's no predicting whether or not those people are the ones who actually give a damn. She'll let you redo your papers for an improved grade, but if you fall into the trap of doing so, you'll fall hopelessly behind.\nWorkload:\n500-1500 word essay due every class, with four graded essays and a group presentation over the course of the semester.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 29, 2004",
            "review_content": "\nBeware!  Avoid at all costs.  This woman is ridiculous, the course itself is already very consuming, but her requests are way beyond that.  It is obvious that she favors certain students (cutting off others).  In addition, her mind is on her own dissertation paper.  She doesn't take the time to get into the minds of her students as they write.  Her first words of thanks, and the lenth of comments is only a false image.  (Unfortunately she is the assistant director to the writing program.)\nWorkload:\nThe course is expected to be heavy, but take it with someone else.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 07, 2003",
            "review_content": "\nMs. Wallack is a highly intelligent person and generally has a good teaching style.  But, with both her teaching and commenting/grading on essays, she tends to deconstruct ideas and statements to the point which one feels he has to write an entirely new essay.  She is an extremely harsh grader, and will push you to your limit until you have exhausted the subject and the current assignment at hand.  Depending on how you see it, this could either be a good or bad thing.  Other U.Writ instructors are much more lenient and don't grade at such a high level - so getting an A in this class is not an esay task, but, at the same time, you do actually learn to refine your thinking and write at a higher level.  To put it this way, I hated the class while taking it, but now I am so grateful.  Yes, Ms. Wallack is really tough, and doesn't take s**t (like late papers, bad papers, etc), but she is a human being and gives a lot of feedback and consideration, including extensions, to her students.  In all, I think she's tough cuz she knows we can take it.  \nWorkload:\nA lot. Exercises/essays due every class, 4 big essays that count for a lot, and tons of time needed for revising and doing new drafts.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 08, 2003",
            "review_content": "\nShe is a very good teacher, but she gives too much homework and expects too much out of people. On top of that, she is very high up in the English Department, and does not curve. The average is a C+ on most essays!! She lets you redo essays. However, instead of permitting us to redo essays, she kind of expects us too. It's as if she grades us very low so we HAVE to redo the essays, which there is no time for. Try to stay away from this professor, because the work will occupy all of your time and even if you spend insane amounts of time on the essays, the grade won't reflect that.\nWorkload:\nAn essay due every class with a lot of reading due also. Four essays to constitute the grade (25%, 25%, 35%, 10%) and a short project (5%).\n"
        }
    ]
}