{
    "prof_info": [
        {
            "prof_name": "Margaret Morrison",
            "prof_id": 2956,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Tap 1, Tap as an American Art Form",
            "review_date": "June 20, 2008",
            "review_content": "\nMargaret is extremely friendly and easy to get along with. \nYou can tell that she gets genuine personal joy out of watching her students improve, and she is very good at giving feedback (without making people feel stupid).\nTap as an American Art Form is a lecture AND studio class combined. It was well-taught and a lot of fun. We would learn something about a certain generation of tap, and then perform sequences in that style. It really helped the material stick in my brain.\nAll in all, 5 stars all around.\nWorkload:\nAverage: three 3-5pg papers and a final paper/presentation. Very fair grader.\n"
        },
        {
            "course_name": "Tap I",
            "review_date": "June 01, 2006",
            "review_content": "\nOne of the best dance teachers I've ever had, Margaret explains material clearly, uses class time effectively, and criticizes students directly and without a trace of cruelty.  She never singled out any student for praise unless that student had corrected an earlier mistake, and she never asked students to demonstrate steps for the class.  In this way, while she never found any mechanism for rewarding the best students in the class, she avoided creating undue competition or bad feelings between studetns.  The class was thus a pleasant and relaxing part of my day, and I hope to take another tap class with Margaret.\nWorkload:\nNo work outside of class required.  Somewhat absurdly (because who really cares about dance grades?) Margaret is trying to crack down on her own grade-inflating tendencies, and claims that she will only give A's to students who stand out in comparison to all her current and past students.  That's a pretty ridiculous standard, so I reccomend pass/failing the class.\n"
        }
    ]
}