{
    "prof_info": [
        {
            "prof_name": "Corinne Low",
            "prof_id": 12587,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "January 04, 2013",
            "review_content": "\nEconometrics with Arkonac was actually a pretty manageable class. I took Intermediate Micro with Arkonac, and can thus attest that her lectures in Econometrics are MUCH clearer and better organised than her Intermediate Micro class. Arkonac's lectures are VERY comprehensive, organised, and littered with examples. She does repeat half her previous lecture the next lecture, but hey, doesn't that just make it easier to skip class????? Pay attention in class, and you will never need to read the book.She's a lovely, sweet, and yes, very regal lady with impeccable fashion sense.\nHomework: \n Her problem sets never make any sense, but they're brilliant for getting you familiar with the material and getting a sense of what Arkonac wants you to know. Yes, they do that ages to finish, especially at the start, when she makes you fill out tables and tables of stata output; but as I said, it's all good practice for the final. Her P-sets do get a lot better towards the end of the semester, but I suspect that was the correcting influence of her TA. \nTA:\nThere were a ton of TAs for this class, but the head TA, Corinne Low, WAS BRILLIANT. Why doesn't Corinne Low have a teaching award, like Carlos? \\ SHE IS AS GOOD AS CARLOS AND DESERVES ONE. Her sections were on Sunday from 6 to 8, yes, but go. Just. Go. The week's lectures are pithily summarised. New and better stata commands are given, making your p-set experience that much better. Arkonac's strange fondness for mathematical formula and derivations are repeated, when necessary for the midterm and final, and discarded, when not. Math is translated into intuition. Have I convinced you to go to a 6-8pm section on a Sunday night yet??????\n\nWorkload:\n9 psets (lowest is dropped, and the hardest thing about those Psets is figuring out what Arkonac wants...)\nmidterm (stats based; worth 30% or 0% of the final grade, depending on how you do)\nfinal (also stats based; worth 50% or 80% of the final grade, depending on how you do)\nThere is always a mathematical proof (worth about 10% of the grade) on the midterm and the final, which is a bitch. This is why you go to Corinne's section, where you learn to do shit like that. Even if you're math stupid, like me. \n"
        }
    ]
}