{
    "prof_info": [
        {
            "prof_name": "James Hone",
            "prof_id": 1953,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Mechanics",
            "review_date": "June 03, 2014",
            "review_content": "\nLECTURES: Professor Hone's lectures are straightforward and to the point. There are some derivations but much of the time is spent on helpful examples. I preferred to just attend his lectures than read the textbook. I know some people that made it through using the textbook since the textbook is pretty good at explaining things too. However, I prefered Professor Hone's delivery as that was something that just worked for me. Overall, I found if attended lecture, it was easier to keep up with the work and material.\nEXAMS: Somewhat straight forward. I can say all exams were fair. However, not all problems are problems that you have seen before thus one must really master the material in order to get full credit for the problem. I personally found the first exam more than fair and second exam challenging. The final was the hardest exam of all and also a time crunch.\nHOMEWORKS: This is probably the single most annoying part of the course. There are homeworks due every class. Also class is M, W, F. Granted, the psets due every class are 2-3 problems each, it is still annoying. To be completely honest though, it did keep me on my toes and did not allow me to slack off. \nGRADING:\n(I found the grading of assignments and exams to be fair/lenient)\n2 exams (20% each)\nHomework (15%, 40 or so assignments, 9 lowest dropped)\nFinal (40%)\nOffice Hours (5%) -- these are mandatory office hour sessions. You must attend 2 before each exam (including final)\ntl;dr: unusually a lot of work and little things but ultimately you will leave the class with a strong understanding of basic Mechanics. I recommend this professor! \nWorkload:\neach assignment took roughly 2 hours each, 6 hours outside of lectures.\nexams are medium difficulty to difficult\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "June 05, 2011",
            "review_content": "\nI must admit that in the first few weeks of class, I was disappointed with Professor Hone. He didn't cause the textbook to sing a song when I opened it, let alone make the chalk explode with the power of his magical teaching abilities that I expected with a gold nugget. So sad. \nAs the weeks went on, however, I realized that the magic that got him this gold nugget is in the simplicity and clarity of his teaching, in addition to his genuine desire for everyone to do well. Although he doesn't propel me into being a physics major, he comes as damn near to inspiring people to like mechanics as is possible with such content. His teaching style, as explained before, is to both derive concepts and reinforce them with examples -- a practical method of problem solving that I wish more professors use. \nI did fairly well in this class, and I can attribute at least 80% of it to Professors Hone's teaching. After taking, and practically failing, Physics 1600 last semester, I came into this class with low expectations and consequently threw myself into it. By merely attending class and doing the problem sets (by myself, the night before -- I survived), I was able to grasp as much material as most. I barely studied for the exams apart from writing down some relevant formulas. Professor Hone's teaching was enough to solidify the concepts in my mind. I ended the course with an A-, which I was satisfied with. \nProfessor Hone cares so much about teaching and it shows. He repeats, time and time again, his office hours and holds extra office hours before exams. What kind of person nearly begs you to take up his time? I only went for office hours once before the final, and I felt almost guilty for not taking advantage of Hone's open door.\nDon't sell yourself short by taking this class with Testa. Seriously, don't. \nWorkload:\nweekly problem set, midterm, final. \n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "May 19, 2008",
            "review_content": "\nHone is a naturally gifted teacher. His teaching style consists of deriving the equations and teaching the concepts. then, he applies this concepts and equations to solve example problems. And it worked very well. Hone is also very funny, managing to keep most people awake. The MWF schedule is a bit much, but that's what you get for cramming statics and dynamics into one semester. \nWorkload:\nweekly problem sets of 5 problems. answers are in the back for you to check. 2 midterms of 3-4 problems and a final.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "May 13, 2007",
            "review_content": "\nI'm so glad I took Mechanics with Hone!  I have a physics phobia, so I assumed Mechanics would be awful. But I actually learned a lot and performed fairly well on his exams due to his clear teaching.  He's very accessible and you should definitely go to office hours, because homeworks are tough.  He dropped the quiz requirement this semester and instead gave two midterms, both reasonable (although the second one had a mean of about 50%).  The MWF class schedule is not friendly, but at least he does a Monday dance when he realizes nobody is listening.  You'll like Hone a lot.\nWorkload:\nWeekly homework, 2 midterms, final\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "May 20, 2005",
            "review_content": "\nHone's mechanics class was awesome, he's a great teacher who can make a somewhat boring topic very interesting. His examples were always very clear and he'd always tie them to real-life example (very helpful in engineering). He was also one of the most approchable teachers I've had, a few friends and I ran into him at a pizza place and he sat down and chatted with us. He also holds great review sessions, though he doesn't really drop any hints about what exactly the exam questions will be.\nOn the last study session he brings in a ton of pizza for everyone who's there.\nWorkload:\n20% homeworks (medium difficulty), 20% weekly quizzes (easier than homework questions), 20% midterm (not too hard) and 40% final (pretty challenging, but curved).\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "March 29, 2005",
            "review_content": "\nHe is amazing.  He is what a teacher should be.  He will make everything make sense even if you weren't as on top of your previous physics classes as you should have been.  His notes are AWESOME in that they are logical and step-wise with words and tricks and examples instead of just some formulas thrown on the board.  They actually help you do the problem sets when you look back over them!  Not that you would be taking this class unless you needed it, but take it when he's teaching if you have a choice of semesters...\nWorkload:\nweekly problem set (20%)and quiz(20%), midterm(20%) and final(40%), he drops your lowest 3 quizzes.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "February 10, 2005",
            "review_content": "\nHe is a fantastic Professor, he makes a potentially tedious subject seem easier, and is always keen to help students. Great great guy, take his class if you have too. In fact, I'm hoping that he teaches all the Mechanical Engineering classes.\nWorkload:\nWeekly Problem Set and Quiz. 1 Mid-term and 1 Final\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "March 29, 2004",
            "review_content": "\nA great professor.  Sadly, i never went/go to class, but a few friends do.  The schedule itself is horrible (M/W/F) but he does his best to make it fun and interesting, and he does a damn good job at it.\nAs far as teaching, i show(ed) up mostly fridays to hand in the weekly homework, and from what i saw, he knows his stuff, knows how to teach it, and most importantly, knows when to slow down and repeat what he just said.\nHe's sooo accessible.  He will go out of his way just to help you with any problem you have (class-related or not), and has office hours seemingly constantly.\nAs far as workload goes, it's the usual engineering workload.  Weekly problem sets (they are hard, don't start them the night before), two midterms and a final.\nThe book will cost you an arm and a leg!  Soo expensive, not clear at all, but contains millions of problems.  If you want to learn anything, i suggest you go to class, or borrow another book from the library.\nOverall, probably the best teacher in engineering who's course i've taken, not because he's the smartest, but because he actually wants to teach instead of just do research.  Teaching is a job to him, not just a nuisance.\nWorkload:\nWeekly problem sets, 2 midterms and 1 final.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "May 10, 2003",
            "review_content": "\nYou are the luckiest mo' fo if you have this guy teach you mechanics.  I've heard horror stories of other professors who teach this course, and God must have smiled on you if you get Hone.  Nicest guy ever to teach such a boring topic.  Oh but there's more!! You actually learn in his section.  His notes are awesome.  And for the first time, I met a professor in engineering who loves to teach this material and manages to keep you awake at the same time.  (unless you have a hangover thursday night and go to the friday class)  He's lenient with late homeworks, a problem set due every week.  At the end of the semester, he holds review sessions and he feeds you!! The only downside is spending $200 on two books, and if you buy them used maybe for $150, but Columbia Bookstore doesn't sell them used.  But the book he uses is very helpful, I plan to keep mine for future reference.  If you find out he's teaching the course a particular semester, I recommend hold off the class til then.  \nWorkload:\nWeekly problemsets.  2 fair midterms. And a Final\n"
        }
    ]
}