{
    "prof_info": [
        {
            "prof_name": "Richard Bushman",
            "prof_id": 332,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "American Revolution",
            "review_date": "November 20, 2003",
            "review_content": "\nPut it this way: this is the only class I've ever taken in which, after the last lecture, the entire class spontaneously stood up and broke into applause.\nWorkload:\nA fair amount of reading, but only three short papers plus a final.\n"
        },
        {
            "course_name": "American Culture from Revolution to Civil War",
            "review_date": "May 17, 2003",
            "review_content": "\nThis was the best class I have taken at Columbia yet.  Bushman is not only extremely smart, but he's nice as well, and understands college students like no other professor.  Classes were always engaging.  The topics were amazingly interesting, and never once did I find myself bored.  You will actually want to go to class!  As seminars go, you can't go wrong with this one.  \nWorkload:\nOne 10-15 page paper on the topic of your choice that requires extensive research, but he helps you through it every step of the way, and he is an extremely fair grader.  Five response papers on the readings are necessary to get an A or A-, but what you can write in the response papers is virtually limitless.  If you make sure to be an active member of discussion and you produce a solid paper, you will get an A.\n"
        },
        {
            "course_name": "American Culture from Revolution to Civil War",
            "review_date": "April 17, 2003",
            "review_content": "\nWithout a doubt, one of the most kind, affectionate, insightful, and engaging professors at Columbia.  His classes are all a joy to attend and he makes sure that the conversation flows smoothly.  He activates participation by the entire class and goes out of his way to grip his students interest in every topic.  IT was an honor to have been his student.\nWorkload:\nPRofessor Bushman is a moderate work giver.  100 pages to read a week at most and a 12-15 page paper.  \n"
        },
        {
            "course_name": "American Culture from Revolution to Civil War",
            "review_date": "April 17, 2003",
            "review_content": "\nWithout a doubt, one of the most kind, affectionate, insightful, and engaging professors at Columbia.  His classes are all a joy to attend and he makes sure that the conversation flows smoothly.  He activates participation by the entire class and goes out of his way to grip his students interest in every topic.  IT was an honor to have been his student.\nWorkload:\nPRofessor Bushman is a moderate work giver.  100 pages to read a week at most and a 12-15 page paper.  \n"
        }
    ]
}