{
    "prof_info": [
        {
            "prof_name": "Arturo Sanchez",
            "prof_id": 1844,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "SOCI S3247: The immigrant experience, old and new",
            "review_date": "December 21, 2006",
            "review_content": "\nThis class really uses New York City as a \"strategic research site\" in order to learn more about the history of transnational migration overall, but specifically the readings build context around the immigrant enclaves here in NYC.  The readings are interesting, and the 2006 Summer Session came right after the immigration debates, which made the concepts relevant to a contemporary issue.  As for Professor Sanchez, he is very knowledgeable of the subject, and is very civically involved in his Queens neighborhood.  \nThe icing on the cake was when we went on two field trips to Jackson Heights and Long Island City towards the end of the term.  There, we got to see firsthand the immigrant enclaves in Jackson Heights, and the rapid gentrification in LIC.  \nFor it to be a six week class, you will enjoy the class and the independent research project on a post-1965 immigrant group here in NYC.  If you end up having to take a summer class, I recommend this one with Prof. Sanchez.  And, if you're like me, and couldn't take the popular \"The History of New York City\" class, this is a great alternative.\nWorkload:\nReadings every few days, research prospectus for your individual project, book review of one of the textbooks, field trips (somewhat voluntary), and the individual research project (10-12 pages), as well as a take-home final exam.\n"
        },
        {
            "course_name": "Immigrant Experiences, Old and New",
            "review_date": "January 21, 2004",
            "review_content": "\nProfessor Sanchez was friendly and for the most part, well-prepared.  As some of the other reviewers have mentioned, he's interesting on a personal level because he is very involved in local politics, and knows a great deal about what's going on in the world today.  Unfortunately, his lectures are frenetic and disorganized and extremely boring.  He likes to overuse terms like \"optic\" and \"vis-a-vis\" as sentence fillers which become increasingly annoying as the semester rolls on.\nAttendance (and reading) is absolutely, positively, unnecessary.  I did not do any of the required readings, and went to only 5 class meetings, but ended up with a 95%.  This is possible because all the work is take-home, and answers for midterm/final questions can be gleaned from your own background knowledge, or just from skimming a couple of the readings a day or two before the assignment is due.\nFrom what I have heard, this class was much better when Robert Smith taught it.\n \nWorkload:\nTake-home midterm and final, book review, research paper. \n"
        },
        {
            "course_name": "Immigrant Experiences",
            "review_date": "January 18, 2004",
            "review_content": "\nAlthough he gets caught up in his jargon, the class is overall well informative.  I learned a lot about immigration theory and the readings albeit overwhelming, are quite informative.  It is completely unnecessary to read everything.  You only need to read the articles he refers to.  The TA tells us where we are on the syllabus, so it really isnt as bad as people think.  I enjoyed this class a lot and would take another class with him.  He's a really nice guy and cares about his students.  One would only know this if they speak to him after class.  I think he stresses people out by making it seem as though he is strict on grading so that people turn in really thoughout and well argued papers, so that it leaves him with less to worry about in terms of grading.  So just do your best and you'll be fine.\nWorkload:\n1 book review, mid term, final, and 10-15 pg paper (I did about 11 pages and did well, so you dont need to do 15)\n"
        },
        {
            "course_name": "Immigrant Experiences",
            "review_date": "January 12, 2004",
            "review_content": "\nThis professor is \"a nice guy,\" but that doesn't save his teaching style.  He is a big fan of over-the-top adverbs, making them from words that are just too long already --his lectures could sound something like \"the transnational effect of the strucural top-down phenomenon of the processes hold a historically and intellectually-based position in the hierarchical hegemony.\" He honestly talks exactly like that during class. The class \"discussions\" mostly involve him asking questions most of the class cannot possibly answer, and him shooting down any student who may not be  entirely correct. The workload is rather heavy, but manageable.  I did well but still have no idea what his grading style is. Probably fairly leneint. Fill your papers with sociological jargon and as long as you make some sense, you will probably do ok.\nWorkload:\nsame as everyone else mentioned\n"
        },
        {
            "course_name": "Immigrant Experiences, Old and New",
            "review_date": "January 04, 2004",
            "review_content": "\nIts hard to kick Professor Sanchez down when he is such a nice guy. He cares a lot about his subject--but I must agree with the other 2 reviewers in that he seems to get lost in his lectures and ends up repeating the same thing over and over again. \nThe readings: not neccessary. You can do EXCELLENTLY with minimal skimming of the index. For the papers simply reiterate one of the many things he has continously drilled..buffer up your paper with lots of jargon and you'll do fine. I actually dont know why everyone has complained about his grading system. the questions are fairly easy and dont require much thought Beware on the final though..as we did not get through the syllabus and he does not get through his lectures..you will need imagination. \nhmm what else? Oh if you are one to hand in papers late or one that needs extensions avoid this man. He has a \"strict\" late policy--he reduces you grade by one letter grade if it is late. RIDICULOUS. Trust me..you are better off handing it in on time as it is graded easily anyway.\nAttendance not neccessary.\nWorkload:\nmany readings listed on the syllabus (not neccessary at all), 1 (6pg) take home midterm; 1 (6pg) take home final; 15 pg research paper *all graded very generously. \n"
        },
        {
            "course_name": "The Immigrant Experience",
            "review_date": "December 15, 2003",
            "review_content": "\nI completely agree with the other reviewer. \nProf. Sanchez has tons of real-life experience; he is very active in local government in jackson heights, which is \"ground zero\" for immigration, and is himself the child of Colombian immigrants (a fact he doesn't let you forget). His lectures are completely disorganized (he once repreated almost the same lecture two classes in a row), and while he himself is knowlegable regarding the subject matter, he has a difficult time conveying anything beyond buzzwords such as \"transnationalism\" and \"globalization.\" We got through only a portion of the syllabus and it was never really clear which readings were expected for which class. However, by doing the extremely lengthy and mostly soporific readings (a must in order to write the midterm and final exams), a came away with a greater understanding of the topic and what the professor had been trying to convey. Sanchez is personable and often humorous, but unfortunately, these traits do not make him an effective teacher. This class is not without merit, but I don't think I'd take it again knowing the amount of work it entails. \nWorkload:\ntake-home midterm and final, 5-page book review, and a 15-page research paper\n"
        },
        {
            "course_name": "Immigrant Experiences",
            "review_date": "December 09, 2003",
            "review_content": "\nProfessor Sanchez has a great passion for the subject but unfortunately is extremely unprofessional and un-academic in his teaching.  The lectures are rambling and disorganized as he often forgets what he is talking about in the middle of a speach, and is more preoccupied with hand motions and pacing than saying anything of substance.  His grading is based on a rubric with no care for writing style or original ideas.  He lacks integrity and demands no respect.  \nWorkload:\nExcessive readings that have little connection to lectures.  I research paper, two take-home essay exams, and a book review.  \n"
        }
    ]
}