{
    "prof_info": [
        {
            "prof_name": "Feng Wang",
            "prof_id": 3013,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "January 17, 2007",
            "review_content": "\nWang Laoshi is the best language teacher I have ever had in my life. Not only does she make a genuinely boring powerpoint (used by the whole Chinese department) seem interesting by filling it in with stories and cultural anecdotes, she was also extremely kind. She invited her students to office hours for additional help and speaking practice. Try to get her as your teacher!\nWorkload:\n5 tests, weekly dictations and character quizzes, weekly grammar sheets and character sheets, weekly recordings, a large final skit, a final, drill session\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 25, 2006",
            "review_content": "\nWang Lao Shi is a very lenient and understanding professor with a decent english-speaking skill. She cares about her students very much and welcomes them to her office hours. Like the previous review says, she makes learning chinese easy for non-chinese speaking students. I love when she speaks chinese with enlgish in the same sentence..she is very fun and joyous to be around with..take her class, she'll also teach u the chinese smiley faces.\nWorkload:\nHW almost every other day. Quizzes or Exams every other day too..like any other chinese 1N class, but she is very lenient with deadlines and is always willing to push back on quizzes dates due to class circumstances.\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "October 28, 2006",
            "review_content": "\nShe is just about the sweetest teacher I've ever had. She made learning Chinese a breeze most of the time and she's very understanding. I encourage anyone and everyone who wants to take a Chinese course to try and get her. She's absolutely adorable and is pretty easy-going with deadlines. \nWorkload:\nModerate\n"
        }
    ]
}