{
    "prof_info": [
        {
            "prof_name": "Peter Eisenberger",
            "prof_id": 2954,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 08, 2012",
            "review_content": "\nThis guy is a genius. Period. I do not know what other people in my FoS section thought, but he really made FoS one of my favorite classes this semester (Seems weird, but that's how awesome he is). Like the previous reviewer, I agree that FoS syllabus did somewhat limit his discussions and presentations, and yet his opinions and ideas were so thought-provoking that I kept thinking about them after each and every discussion section. It completely changed the way I thought about science. Maybe it's because I'm a science major, but still, you should consider yourself lucky if you get him as your discussion leader. Finally, he was eager to hear your ideas (this was supposed to be a discussion section after all), but the amazing thing was how he could respond to, challenge and encourage almost every kind of opinions that you had.\nWorkload:\nI thought the workload was pretty light.\n"
        },
        {
            "course_name": "Human/Earth System",
            "review_date": "January 05, 2012",
            "review_content": "\nThere aren't enough things that I can say to dissuade you from taking this class. \nREALLY -- JUST DON'T TAKE IT. \nFirst of all, why is this class even in DEES? Science is almost entirely absent from this course. If you're seeking a class with FACTS, this is not the course for you... I don't understand how a physics person can talk so much and provide such little support for his arguments.\nThe first week or two is all about cutting down the class to under 20 students - if you get chosen you will feel special and like you should definitely stay in the course, even if your instincts keep telling you to drop it. Listen to your instincts, and get out while you can!! The rest of the semester will be made up almost entirely of Eisenberger lecturing about a bunch of bogus ideas that are really not realistic or relevant at all. Don't believe it when this class is sold to you as a seminar - IT'S NOT! You will, however, be graded on participation. So if you stick it out make sure you figure out some way to participate in class. Although you should not expect your arguments to be taken seriously - Eisenberger always has something to say to try to prove you wrong. And he really will not drop it until he feels like he has. Even if it means making arguments such as evolution being just a \"theory\" (I mean, really? in a science department of all places?!).\nEisenberger will tell you that he is open to opposing ideas, but I honestly don't think this is true. Which means you will have to tailor your paper to something that he agrees with. That's a minimum of 25 pages of bullshit! The worst part is that his ideas are ridiculously naive and downright unrealistic, and his confidence in the human race's ability to figure out all of its problems just by \"following the Golden Rule\" is saddening. Don't worry if you don't get to shed a tear for our future during the first couple of weeks though, you will be subjected to an entire semester of repetition, so you will have plenty of chances. Maybe Eisenberger is one of those who believe that if you repeat things enough, people will start to believe you. (nope, didn't work... at all.)\nOne thing I liked about the course was the guest lectures - we had a really good one from Peter DeMenocal. It was kind of hard to concentrate when Eisenberger was falling asleep in the middle of it though... If you don't find your guest lecturers interesting, then why invite them to speak in class in the first place?!\nDespite my evident disagreements with Eisenberger's teaching style/content/etc., the worst part definitely had to be the TA. Suparna Dutta was hands down the worst TA I have ever had at Columbia. She was rude during class (putting her head down during student presentations, acting visibly annoyed when she didn't approve of the topics, answering her phone during lecture) and over e-mail. And her and Eisenberger were evidently not on the same page whatsoever. Good luck getting help from her, but don't try Eisenberger either, he won't answer your e-mails.\nWorkload:\nReadings, weekly postings on discussion board, 2 presentations on paper topic, 25-50 page final paper\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 18, 2011",
            "review_content": "\nPretty much agree with what the other reviewers said. I wish we could have talked more about his areas of expertise because he had really interesting opinions and his research seemed fascinating. But alas we had to stick to the (bogus) Frontiers syllabus. Class was mostly tedious, occasionally interesting, every few minutes he'd step aside to cough up a lung. He's a decent grader for the most part and for some reason we had a TA who was responsible for posting things on Courseworks (I'm assuming it's because he has no idea how to use Courseworks), and not always in a timely manner. I mostly just felt bad because he seemed trapped by the Frontiers curriculum and you could tell he really wanted to talk about more interesting things.\nWorkload:\nIt's Frontiers...WIAs, 3 small quizzes, one short paper (1-2 pages) on a \"threat\" to the environment, and the Frontiers term papes.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "March 27, 2011",
            "review_content": "\nStrange man. Not much else to say; his classes were just utter tedium, with half of the class filled up by unengaged athletes who had a strange propensity for the History Channel. Although at times his peculiarity was quite amusing, I cannot reasonably say that the 1 hour and 50 minute long Frontiers discussion (or lack thereof) was of any particular value, and I would recommend that those that are unfortunately relegated to his class consider it a sunk cost. Peter himself is very polite, and will probably answer your questions (although in a very roundabout manner). Also you will have to adjust to his endless coughing, probably a result of his chain smoking.\nWorkload:\nOne midterm, one final, tedious WIAs and 3 strange quizzes (we didn't have one for the last topic...)\n"
        },
        {
            "course_name": "Human/Earth System",
            "review_date": "January 13, 2011",
            "review_content": "\nMost absurd and incredible class I have ever taken.  \nPeter has strong disagreements with the way education is done so his teaching style doesn't exactly fit the mold of the 1.5 hour class twice a week, but the contents of his brain and life are worth poring over and questioning.\nThe development of knowledge and the brain over time, overtaking the time scale of natural evolution, and how this will effect our concept of the future and \"sustainability\" (such bullshit in every other SD class I've taken, but here the term is really carefully examined), and basically just about anything else you want to talk about will be covered.  The world is going to be a scary place in the near future, probably unrecognizable to us.  Peter helped me see just how much humans are going to need to take over in managing the planet, and how scary it might be.\nWorkload:\nWeekly posting on anything you want, one final paper (25-50 pages), again on anything you want. WORTH IT.\n"
        },
        {
            "course_name": "Human/Earth System",
            "review_date": "January 13, 2011",
            "review_content": "\nMost absurd and incredible class I have ever taken.  \nPeter has strong disagreements with the way education is done so his teaching style doesn't exactly fit the mold of the 1.5 hour class twice a week, but the contents of his brain and life are worth poring over and questioning.\nThe development of knowledge and the brain over time, overtaking the time scale of natural evolution, and how this will effect our concept of the future and \"sustainability\" (such bullshit in every other SD class I've taken, but here the term is really carefully examined), and basically just about anything else you want to talk about will be covered.  The world is going to be a scary place in the near future, probably unrecognizable to us.  Peter helped me see just how much humans are going to need to take over in managing the planet, and how scary it might be.\nWorkload:\nWeekly posting on anything you want, one final paper (25-50 pages), again on anything you want. WORTH IT.\n"
        },
        {
            "course_name": "Human/Earth System",
            "review_date": "March 02, 2008",
            "review_content": "\nAn excellent class with very interesting and provocative concepts. Professor Eisenberger is  an engaging and passionate lecturer on the topic of the interaction of man and his environment. Some of his theories are a little out there but it forces you to push the limits of what you think is possible, sane, moral etc.He made the effort to meet with every student in a group and if you like stuff about space exploration,mass extinction events, lasers, supervolcanoes and cyborgs this is the class for you. \nWorkload:\nA semester long research paper(25 or more pages), plus 2 presentations.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 31, 2006",
            "review_content": "\nSo I know you don't really pick your section leaders for Frontiers, but Peter's not a bad leader if you are placed here. He's extremely enthusiastic about the Frontiers of Science program, so I guess that's a plus, although there's clearly a divide between his enthusiasm and the lack of it from the students. He's organized, he grades things promptly, and there're no extra assignments or anything. He does more than just reiterate the lectures; for example, our interest was piqued by artificial intelligence, so we just discussed that for a few weeks. However, his enthusiasm has a downside too. A lot of times the questions he asks are \"Based on the readings for this week...\" which means you actually have to read them (or at least skim). All in all, not a bad section leader taking into account that Frontiers, in general, is not a pleasant experience.\nWorkload:\nThe same as other sections.\n"
        }
    ]
}