{
    "prof_info": [
        {
            "prof_name": "Amy Benson",
            "prof_id": 3382,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Nonfiction Seminar: The Lyric Essay",
            "review_date": "December 24, 2012",
            "review_content": "\nI'm a little shocked there's not many more comments... c'mon CW students.\nAmy is one of the finest professors you can have at Columbia.  Beyond her knowledge of the subject, which is masterly (she's won some serious national honors) she is committed to her students.\nYou will learn a ridiculous amount in her seminar in a down to earth way.  The work load is heavy, but her comments are handwritten and constructive.\nI've never written a culpa review before, but feel compelled to get some more kind words about Amy up here.\n\nWorkload:\nWeekly readings:  usually short and entertaining.  4 books toward the end of semester.\n6 responses\n2 page Lyric Essay for workshop\n8 page Lyric essay for final project.\n"
        },
        {
            "course_name": "Nonfiction Seminar: The Lyric Essay",
            "review_date": "August 13, 2010",
            "review_content": "\nAmy is a gem of a human being, and every student in her class will be blessed to have her feedback. She's attentive, patient, insightful, and endlessly perceptive. She loves lyric essays and has extensive knowledge on the history and trajectory of the craft. Every work to which I was introduced via this seminar taught me a ton, and some of them, like Anne Carson's Plainwater and collections by Ander Monson and Lia Purpura, never leave my bedside table. If you have any interest in contemporary nonfiction, experimental writing, or becoming a better person, take a seminar or workshop with Amy!\nWorkload:\nheavy. weekly exercises responding to readings, one long piece for workshop, critiques of others' work, final lyric essay and companion piece explaining your choices. all of it made me a better writer, every step of the way.\n"
        },
        {
            "course_name": "Literary Nonfiction Workshop",
            "review_date": "January 23, 2008",
            "review_content": "\nAmy is, hands down, the best professor I've had at Columbia. She fosters an environment of comfort and respect, and is firm when students test that. Her comments both in class and on paper are thoughtful and appropriate without being negative, and she expects the same in workshop. A really great experience.\nWorkload:\nThree writing assignments on guided topics (place, autobiography, lyric essay, and research) 3-5 pages each; three longer workshop essays; portfolio including one revision of a longer piece.\n"
        }
    ]
}