{
    "prof_info": [
        {
            "prof_name": "Paul Shapiro",
            "prof_id": 2636,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Industrial Information Systems",
            "review_date": "July 21, 2006",
            "review_content": "\nThe last review sounds like the person got shafted with a C. This class is ridiculously easy if you put any sort of effort into it. I was 2 points shy of an A+ and that's with a mean grade (83) on the midterm, though it was really too long for the time frame allotted. Final also ran a bit long but was immensely easier. He's also a really nice guy, even if he is a little anal and OCD. If you get a chance, set up a group meeting at his apartment. Moral of the story is: go to class and DO the project. Getting the A depends entirely on your understanding and doing the project. If you wait till the last minute, you WILL be screwed.\nWorkload:\nProblem sets are probably not worth doing if you go to class and they affect your grade minimally. The project is time intensive, especially if your group has a few slackers. The second part of the project is individually graded so it's easy to get 100% if you just follow all the nitpicky corrections he sends you. He will tell you EXACTLY how to FIX your project. There's no reason you shouldn't get 100 when you hand it in.\n"
        },
        {
            "course_name": "Industrial Info. Systems",
            "review_date": "November 05, 2005",
            "review_content": "\nThis is probabaly one of the worst classes to take as an IEOR major, and to have to take it with Paul Shapiro is going to make you feel like you want to cry. After a long, boring lecture, you will find yourself appreciating the good things in life, because Paul Shapiro is so horribly bad. He is generally a nice guy, not to take anything away from him as a person, but he is a horrible professor, who is not that fair of a grader.\nWorkload:\nHeavy. Weekly problem sets, Long Midterm, Anally Graded final, long group project. Avoid this class.\n"
        }
    ]
}