{
    "prof_info": [
        {
            "prof_name": "Jonathan Crary",
            "prof_id": 502,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "19th Century Art",
            "review_date": "October 13, 2016",
            "review_content": "\nIf I could have Crary's children, I would.\nWorkload:\nDoesn't matter. Crary is the man\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "December 23, 2012",
            "review_content": "\nI just want to issue a disclaimer: he does not necessarily follow the syllabus. I took this class solely because of my interest in impressionism. This midterm (which was slightly after the middle of the term) was almost entirely late 18th century art with some that went into the 1830s. We spent maybe 3 classes on the impressionists. From what I've heard from other students and seen on culpa, this isn't an isolated incident. If history paintings spark your interests, then by all means, take this class, but don't take it for the sake of impressionism. \nWorkload:\nmeh\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "June 06, 2012",
            "review_content": "\nOverall, I really enjoyed this course. I had never taken any type of art history course before and jumped right into 19th century painting with Crary. This course made me fall in love with studying art, and now I am strongly considering the Art History major. I would say that showing up to lecture is crucial for succeeding in the class. First of all, Crary is such a genius and we should all feel privileged to have the opportunity to listen to him talk about major works of art. Second of all, his insight on each of the paintings can be helpful for writing the essay and for the exams. You get points on the midterm and final if you discuss the lectures, and you are expected to discuss them in the essay. The course also involves weekly readings, which need to be read carefully and possibly more than once to be fully understood. In weekly discussion sections, you are expected to discuss points from these readings. \nThe lecture itself could get tedious at times, but the weekly discussion section was always engaging and was a great place to delve into certain topics and paintings of the course. Try to get into Brigid Von Pruessen's section. She is super nice and very helpful! I also heard she is slightly more generous than other TAs with grading. Many people thought this class had very harsh grading, but I disagree. You have to put in the study time for the exams, but if you do, you will be successful. I studied two weeks in advance for each exam and did well. \nOverall, good class! Wish we spent more time on impressionism and less time on David...\n\nWorkload:\nmidterm, final, paper...fairly graded. Study the slides really well and you will be prepared. Bring in points from readings and lecture on midterm, final and paper! Attend all weekly sections and lectures! \n"
        },
        {
            "course_name": "19th century",
            "review_date": "June 13, 2011",
            "review_content": "\nI took Nineteenth Century Criticism junior year with Professor Crary.  I had read some of his work, and so couldn't believe I was being taught by him in a class with only five other students.  \nProfessor Crary is one of the most articulate and fascinating speakers I have come across.  Even though our seminar was much less discussion based than I had expected, I did not mind because listening to Professor Crary speak about the texts was illuminating in itself.  I thought the selection of texts was really great as well.  There were very few written assignments, which made it hard to know exactly how you're doing through out the semester, but he is fair, and really just wants to see that you're engaging with the texts.  Another thing that's worth mentioning is that the syllabus was organized around a very specific central point, one that he himself had written about, and so, in a way the discussions were much more directed and focused than other seminars tend to be.  Crary is not the most accessible professor, which was understandable, but often  frustrating.  I wished I would have been able to go deeper into the discussions, and even in class time it always seemed like we were running low on time.  \nWorkload:\nreadings every week, three short writing assignments\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "January 17, 2011",
            "review_content": "\nClass and Professor:   This class was really fascinating, and Professor Crary has an interesting and unique interpretation of 19th Century Art. The problem is he takes far too long to say it. We did not finish his syllabus, and, after spending 3 or 4 whole classes on David (who worked mostly in the 18th century...),  we skimmed over Impressionism, skipping Post-Impressionism and the end of the century entirely. We missed a lot of the big paintings that you would expect to cover, but I think the \"road less traveled\" is more his style. He was a little disorganized too, and didn't allow computers at all, which made note taking (and sharing) very cumbersome. \nTA:  Eliza Butler is amazing; she is by far the best TA I've ever had. She is very laid back, and seemingly without effort can produce some of the most productive and interesting discussions. She encourages independent thought and criticism. She's a very fair grader, and is realistic (and lax) about student attendance. She manages to be informal, but still commands a sense of respect. I have had her for two discussion sections, and am signing up for a third, and planning on taking her Art Hum section next semester (if I can get in). And she's smart as a whip!\nWorkload:\nMinimal: 1 midterm exam, 1 midterm paper, and 1 final paper, no exam. Class attendance: optional if you're regularly attending section.\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "December 07, 2006",
            "review_content": "\nIt's true. Crary might be a genius. \nThere are times in this class that you will sit  in awe. This man is amazingly articulate and creative, and he really knows his stuff. He is interested in the theory of early modernism,(Think: CC but for art texts,) but he's totally aware that a lot of the people in his course have never taken art history before, so he makes sure that the concepts are super clear. \nIf you take this course, DEFINITELY take the discussion section with Emerson. This Prof-TA duo is really something. \nWorkload:\nDense but interesting reading, discussed in section. Midterm based on 4 topic questions with images provided (like a comparison, with given topics). 7-8 page paper with no extra research, take home final. \n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "January 04, 2005",
            "review_content": "\nOhmigod, this guy is awesome.  And I'm not one of those fanatics who is writing this review because I think the professor is awesome - truth is, I can probably tell you that 90% of the kids who took this class thought it was good if not great.  Crary has a way of explaining paintings in a vocabulary that you would normally not understand but which makes sense when he makes his presentations to you.  Also, the paintings that we cover in class are amazing: take a look at his slide list and find out!  He's also very accessible and approachable and even makes an effort to go to the Met in the 19th Century section in order to be there to talk to you about the paintings towards the end of the semester.  All in all, a great class - probably one of the best classes in the Art History dep't at Columbia.\nWorkload:\nEasy.  1 8-page paper + 1 midterm + 1 final.  Crary encourages everyone to hand in a draft of the paper to the TA or to talk to him about it, so there are so many opportunities to make sure you hit an A for the paper.  The midterm and the final are pretty easy too; the essay questions tend to be on works of art that he's spent half a class or a whole class talking about so they are pretty obvious.\n"
        }
    ]
}