{
    "prof_info": [
        {
            "prof_name": "Meredith Davis",
            "prof_id": 12316,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "North American Art and Culture: 1865-1945",
            "review_date": "May 29, 2012",
            "review_content": "\nI took North American Art and Culture (1865-1945) with Professor Davis and I sorely regret it. She is by far the least organized teacher I have had at Barnard or Columbia. This disorganization affected the timeliness of her grading, the structure of the course, lectures, assignments and tests. I know, and Davis knows, that she is an intelligent woman. Yet often I felt that my ideas or a classmate's ideas, when shared with the class, were shot down by the teacher. Her response would often consist of a smirk, a nod, and a pregnant pause, and a comment along the lines of \"I haven't read that.\" In an Art History course the class should be structured tightly and uniformly, with a concise delivery of each lecture and a clear trajectory. Davis' lectures were scattered, the powerpoints often did not work or had erroneous information on them, and often, as I said, left little room for student interpretation. \nI think that Davis is faulty mostly for her inability to engage me as a student. I know my classmates felt the same way. Her ideas were the right ones, and only if a student's idea was essentially a carbon copy from a book that Davis had read was it acceptable. Her tests were ridiculous -- she gave much less time than was needed to spit out the ideas that she found fit. Also, to stray (on midterms and finals) from the words Davis regurgitated in lecture was to sabotage your grade. I felt that she dissuaded me from thinking individually and creatively about any of the materials we covered, as expressing such ideas would surely be 'wrong' and would lower my grade.\nLet it be known that three weeks after the final she has yet to hand in the final grades. DO NOT take a class with Davis. I am an art history major and know that the department, save for her, is very strong. She is an adjunct professor and it shows - I  have never had a teacher like her at Barnard. She is truly the worst. \nWorkload:\nOne midterm, one 7 page paper, one final exam. Tons of reading, all of which you are responsible for the midterm/final. The paper prompt is roundabout, wordy and confusing, just like her lectures. \n"
        }
    ]
}