{
    "prof_info": [
        {
            "prof_name": "Isabel Estrada",
            "prof_id": 2100,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Films of Pedro Almodovar",
            "review_date": "November 12, 2007",
            "review_content": "\nProfessor Estrada is great and actually made me want to become a Spanish minor after taking this class with her. Although this was a 3000-level course, she acknowledged that no one in the course was perfectly fluent and she spoke at a reasonable pace so that everyone could keep up. She's good-humored and totally down-to-earth. She's really considerate of students' ideas in the classroom and she's always open to helping them out during office hours. I thought that she was slightly tough on grading papers but she allowed rewrites and if you follow her suggestions/corrections, you're bound to get a good grade. \nThis course isn't offered anymore... she's teaching a different film class. I'm sure any advanced spanish course with her would be just as fun and interesting. She truly is one of the best professors I've had here. \nWorkload:\nyou need to see 1-2 movies every week outside of the classroom, readings, and a few papers including the final paper (with each paper increases, page # increases)-- manageable\n"
        },
        {
            "course_name": "The Films of Luis Bunuel and the Spanish Literary Tradition",
            "review_date": "August 19, 2007",
            "review_content": "\nSo basically this class was a lot of movies with some literature thrown in there and a whole lot of talking about nothing. We had to watch about 10 movies of Luis Bunuel, which I admit were interesting. But class discussion wasn't very inspiring, and I feel like everyone just repeated themselves over and over. Profesora Estrada would give a little commentary on the new movement in literature or movies that we were about to study, but it never seemed very important. Until it came to studying for the final, when she wanted us to know the differences between each \"era.\"  The literature wasn't very interesting in my opinion and when we had it (which wasn't all too often), she expected us to read it VERY quickly. Which, for me, a non-native speaker, was difficult.  Estrada is very nice and speaks clearly and slowly, but I feel like I didn't get much out of the class.\nWorkload:\n2 essay outlines (5% final grade each) and 2 essays (20% each).  Must have an \"original\" idea for the essays, but they were fairly graded (could revise the first for grammatical mistakes and regain some points). An oral presentation on a movie or novel/play (10% of grade). Participation (10%) - she takes off points quickly if you don't come to class - participate as much as possible! Final is done at home on your computerer and shgives you two hours to do it. Four questions, open notes, internet, etc. - could be written in English or Spanish.  A medium-difficulty class for those who are not fluent in Spanish.\n"
        },
        {
            "course_name": "Intermediate II",
            "review_date": "December 04, 2006",
            "review_content": "\nI found Prof Estrada to be very committed, enthusiastic, and incredibly sweet. Intermediate II covers some of the finer points of Spanish grammar and style, and she's set on getting her students to understand these concepts in preparation for higher-level courses. The coursework is, overall, pretty interesting, and there's really no need to stress out for the tests if you put a decent amount of effort into studying.\nProf Estrada also makes herself very accessible to her students. She's always happy to help you to clear up any confusion about grammar, the essays, etc, and never acts condescending if you come to her with any questions.\nHighly recommended!\nWorkload:\nManageable, don't worry too much.\n"
        },
        {
            "course_name": "Violence and Memory: Film and Literature of the Spanish Civil War",
            "review_date": "January 03, 2006",
            "review_content": "\nI really like Professor Estrada, and the class was good (not amazing but very interesting if you are into Spanish literature or history). The films we watched were for the most part worthwhile, although a few were dull (although they all did have a point within the context of the Spanish civil war). They range from documentary to propaganda (a film written by Franco) to satire, etc. Professor Estrada is usually really good about facilitating conversation and she makes you feel very comfortable speaking in class, even non-native speakers. The only annoying part is that you have to watch about 10 movies altogether outside of class, so that's an extra 2 hours per week--I think it should really be a 4-point course. But overall recommended.\nWorkload:\nThree 5-7 page papers on any theme, easy easy easy final (25 fill-in-the-blank history questions), 10 or so movies outside of class, some poetry, a few novels.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "April 18, 2005",
            "review_content": "\nVery easy class and an amazingly nice professor. I found this class to be mostly review, but if you ever had a question, she would do everything she could to give you the best answer. She speaks slowly enough for you to understand her well, and never patronizes you if you make a mistake while speaking.  The essays and tests are fairly graded, and she explains the readings very well. As someone who is petrified of speaking Spanish but is good at reading and writing, I loved this class. If you really want to improve speaking, this may not be the class for you. Overall, a really good, sweet professor and an easy A. \nWorkload:\nNot bad at all. Some reading, 4 2.5 pg essays, easy tests, final group presentation. Minimal class participation necessary, but like most small language classes, you should show up to most of the classes.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 10, 2005",
            "review_content": "\ncommitted to making sure that students actually LEARN spanish, and also an incredibly sweet woman.  includes cultural activities, will not let you slide with an american accent.\nWorkload:\nlight, 4 very short essays.\n"
        },
        {
            "course_name": "Memory and Violence: Spanish Civil War",
            "review_date": "November 09, 2004",
            "review_content": "\nBy far, the best class taken in the Spanish department (Columbia or Barnard). What I love about this professor is that she never tries to act the part of a condescending instructor; she is very frank about her desire to teach us something. As for the class: the slides, the movies, the books, the poems all work  together to form a glimpse of the profunidity of the Spanish Civil War until whose effect still is felt in the present. An incredible course and professor.\nWorkload:\nEssays and Final Exam. Fair grader.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 18, 2004",
            "review_content": "\nI thought the class was really easy but this may be true of all introductory spanish classes.  Isabel is full of energy and really kind.  She really tries to get everyone involved, even people who normally don't speak up.  I liked that she divided the class into groups of two or three to discuss particular items or answer particular questions.  If you have to take Spanish and want to get it done with a minimum of pain, take it with Isabel.  If you want to learn a lot of Spanish, on the other hand, take it with someone else, because Isabel isn't very demanding of her students.\nWorkload:\nEasy -- 4 really short papers, 2 really short tests, and a final.\n"
        }
    ]
}