{
    "prof_info": [
        {
            "prof_name": "Robert Remez",
            "prof_id": 1078,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "Psychology of Perception",
            "review_date": "January 18, 2017",
            "review_content": "\nIf you want to just read the textbook or just go to class-- THIS IS NOT THE CLASS FOR YOU \nYou need to go to lectures and do the readings in order to succeed in this course. There is also a lot of teaching you will have to do for yourself on the textbook readings and the class is more theme based. That being said the lectures can be incredibly interesting and engaging. I truly enjoyed taking this class. \nWorkload:\nabout a chapter or half a chapter and an article per class/ three exams\n"
        },
        {
            "course_name": "Psychology of Perception",
            "review_date": "December 13, 2016",
            "review_content": "\nAVOID. An incredible lecturer?! Is the person below me insane?! This professor is awful, he doesn't actually lecture about course material and you WILL end up teaching yourself this course and putting in hours of studying for a mediocre grade. Hence, taking this pass/fail. The exams were impossible (75 questions in just over an hour) and he actively tries to trick you and make the questions impossible to understand with unnecessary jargon (just so you know, the class average on each exam was between a 62 and 65, and the class high was consistently in the 70s, so let that sink in). Don't be fooled by his apparent charm on the first day, it translates to nothing but irrelevant lectures with tangents that make no sense. Take this class only if you enjoy seeing your GPA die a slow death and listening to a 70-something man stand at the front of the class and talk in ridiculous jargon for an hour and 15 minutes while you profoundly question why you ignored this culpa review. And if on the second day of lecture, you are frantically flipping through your textbook trying to locate where his lectures are pertaining to, know that you are just one of many generations of Perceptioners before you that had no idea what was going on. \nThis man is a life ruiner. He ruins people's lives.\nWorkload:\n3 exams non-cumulative. \nYou only have one GPA, take care of it. \n"
        },
        {
            "course_name": "Psychology of Perception",
            "review_date": "April 14, 2015",
            "review_content": "\nProfessor Remez is an incredible lecturer.\nIf you absolutely, with no wiggle room, need to stick to the syllabus and have clear idea of what is relevant to the exam in every lecture, he may not be for you. \nHis lectures are more conversational and involved than powerpoint-style organized. Tangents are frequent,  but always interesting. Questions at all related to the material are welcomed (though he may come back to it later if the class needs to cover a lot). Professor Remez is clearly passionate about not only his field, but about applications of his field in other disciplines. \nIf anecdotes help you understand concepts, his lectures can really help to lock down the information you get from the book. If at the end of the lecture you have a pile of unanswered questions, is office hours can either be getting bullet point answers to them all, or talking in depth about the ones you are more interested in/worried about. Either way, you lead the office hours how you want them to go. \nIt's not very difficult at all. All you have to do is be engaged in lectures, at least skim the book (though reading helps with context in lecture), and go to office hours a couple of times. The three midterms are pretty straight forward. \nI would definitely recommend this class to any one who is passionately interested in psych, but not necessarily to those who are looking for a lab credit and are indifferent about the material. It's an amazing experience, but I can see how the lecture could be frustrating if you're not all that curious about the ins and outs of his field.\nWorkload:\nThree midterms and the third midterm is the final. Non cumulative. \n"
        },
        {
            "course_name": "Psychology of Perception",
            "review_date": "December 19, 2014",
            "review_content": "\nThis class was so boring to go to. I didn't have a problem with the material or the book, it was just going to class that was hard because of Professor Remez's lectures. He tries to sound super academic and scientific when he lectures but in reality, you could explain everything he says in a much simpler way. Definitely go to class because for every test there were a couple of questions directly from lecture where you couldn't find them in the book. If you want an A he tells you at the beginning that its going to be very difficult. \nWorkload:\n3 midterms noncumulative\n"
        },
        {
            "course_name": "Psychology of Perception",
            "review_date": "December 19, 2014",
            "review_content": "\nThis class was so boring to go to. I didn't have a problem with the material or the book, it was just going to class that was hard because of Professor Remez's lectures. He tries to sound super academic and scientific when he lectures but in reality, you could explain everything he says in a much simpler way. Definitely go to class because for every test there were a couple of questions directly from lecture where you couldn't find them in the book. If you want an A he tells you at the beginning that its going to be very difficult. \nWorkload:\n3 midterms noncumulative\n"
        },
        {
            "course_name": "Perception",
            "review_date": "December 28, 2011",
            "review_content": "\nRemez. What a guy. If you ever read this, Remez: don't ever change. \nOk that aside, Perception was a great class. I really thought that it was going to be terrible based on previous reviews (just read them - pretty awful), but I loved it. This class made me happy to be a psych major. The material was really interesting and obviously relatable to everyday experiences. The textbook wasn't my favorite, but I don't think Remez liked it very much either (it was the first semester using this particular book). But that said, I did get used to reading and studying from it.\nYup, the exams are tricky, but honestly guys - can we stop complaining about having to take exams that aren't easy A's? We do go to this school, after all. If you aren't a psych major and you think that psych is a way to get the science requirement out of the way no problem, either don't take the class or PDF it. Done. \nHe'll say it on the first day: to get your A, you have to put in the work. So, don't say he didn't warn you.\nWorkload:\nReading for every lecture if you want to stay on top of it. 3 tricky exams. Weekly lab assignments if you take the lab, and a final lab paper. If you just take the lecture, there's a short research paper assignment\n"
        },
        {
            "course_name": "Perception",
            "review_date": "December 28, 2011",
            "review_content": "\n    I'm not going to lie; Perception is sometimes a bit dull. But it's really not as hard as some of the previous reviews make it out to be. If you go the lectures and read the textbook you can definitely do well on the exams. I only took this course to fulfill the science requirement, and it did not end up being very time consuming. For the last two exams I didn't do any of the readings until a few days before the test and I got an A in the class. Remez is amusing in an you're-laughing-at-him-not-with-him sort of way, which makes lecture worth going to.\n   My real issue is with lab. Lab was basically pointless, boring busy work that taught me nothing and was a huge waste of time. Avoid lab if possible. \nOverall, this class is not that interesting or life-changing, but it's not very difficult to get a good grade. \nWorkload:\n3 non-cumulative midterms, Lab with weekly busy work assignments and one final lab report\n"
        },
        {
            "course_name": "Perception",
            "review_date": "December 19, 2011",
            "review_content": "\nAfter reading previous reviews for this class, I went into it assuming it was going to be a terrible class that was impossible to do well in.  I ended up really liking this class, and the lectures weren't boring.  Professor Remez brings new information to class so that he's not just repeating what you read in the textbook, and he's funny, too.  This was one of the only classes at Barnard where I've actually enjoyed going to the lectures, and the information in the readings is interesting.\nThis class is one of the courses that many psychology majors take, so most people in the class are only taking it for the requirement.\nThe lab was one of the most difficult parts of the class, and it was more time-consuming than difficult.  The lab brings aspects of the lecture and reading together with active learning, and while some of the experiments were long and the assignments took time, if you focus on them they're not so difficult.\nWorkload:\nAverage - 3 exams (non-cumulative final).  Each exam counts for 1/4 of the semester grade, and lab counts for last 1/4 (research paper if not in lab).  4-7 textbook chapters per exam, plus articles and research studies.\n"
        },
        {
            "course_name": "Perception",
            "review_date": "January 03, 2011",
            "review_content": "\nTake this class if you are the type of student who likes to learn and who does not like to bitch about unfairness or dryness or lack of an obvious correlation between powerpoints and exams. Its fascinating if you actually try to understand the big picture that he paints for you, and don't focus on the minutiae that he does ask for on tests. (He scales a lot, so if you try you will do well)\nWorkload:\nNot a lot at all, text book, outside readings and three exams (Final is not cumulative)\n"
        },
        {
            "course_name": "Perception",
            "review_date": "November 10, 2010",
            "review_content": "\nDon't. Just don't.\nPast reviews of this class are pretty much accurate, Prof. Remez himself has said so in class. How you do in the course pretty much depends on you. If you are the type who is listens closely and take good notes in the lecture; if you are the type who always does the readings on time and study extra hard before an exam; you'll probably do well (in this and every other class), but Prof. Remez won't make it easy for you. The readings are dry, the exams are hard (I can't emphasize that enough) and he goes on tangents. Tangents are fine, because he is a funny man, but that humor and those tangents come up on the exams later, and then it's not remotely funny anymore (it's just sadism). Getting an A isn't impossible (in the sense that anything is possible, just not probable), I know people who do extremely well on the exams but I know more who don't.\nIf you are like me and find it difficult to pay attention all the time in lectures (he doesn't have lecture with powerpoints) and can hardly find the time to do the readings, just drop the class and take something else to fulfill that major requirement (if you are a psych major). It has nothing to do with humor as the previous review said. I don't think the students should have to adopt a prof's sense of humor in order to do well on exams; students should do well on exams because they studied and the exams test their relevant knowledge.\nI can't speak for everyone. My advice is to take the class if you really want/need to. The first exam results come back before the deadline to drop. If you didn't do well on that first exam, I'm telling you it does not get easier. Decide wisely then whether to drop or not.\nWorkload:\nThree exams (non-cumulative), each worth 25%. The remaining 25% goes to lab or a research paper if you only take lecture. Textbook readings and research papers go read for each class.\n"
        },
        {
            "course_name": "Perception",
            "review_date": "April 14, 2010",
            "review_content": "\nThis has been one of my top classes since I've been here. Yes, the exams are difficult, but all you have to do is start studying a little early. Remez has a great sense of humor and the lectures are very interesting, however this sense of humor is put into the exams so if you are the typical columbia student that doesn't understand humor, don't take this class, because his exams will confuse you. You really have to use his sense of humor to know when he is making a joke on the exam. Once you've mastered this, the exams are very straightforward. There are no powerpoints or notes posted, so you do have to go to class and take notes on everything he says (even his tangents because they will likely be on the test). I wouldn't consider myself the hard working type of student, however in this class you have to be. In the end it does pay off. \nTake this class if you want to learn some interesting facts about the world. Don't take this class if you are looking for an easy A and only go to class to browse the web.\nWorkload:\n3 decently hard non cumulative exams (all curved) worth 25% each. Lab is last 25% or if just taking the class last 25% is a research paper on a psych study that you get to choose.\n"
        },
        {
            "course_name": "Perception",
            "review_date": "April 10, 2010",
            "review_content": "\nRobert Remez is a very intelligent, comical man, but he is not the greatest teacher. He is very approachable and nice outside of class, but he does not teach very well. This is a very challenging course, and it caused me a lot of stress. As others have said, the tests were almost impossible, and the average grades were somewhere between 60-70, which he curved in the end. There is much information on the exams that you will have never seen before, which is frustrating. He does assume that you apply your own knowledge to these questions. You will probably end up with a B if you score somewhere within the average. His lectures are not at all helpful and your notes will not help you prepare for the exam. I went to many of his office hours, and that helped me a little on the exams. This is probably one of the most challenging courses at Barnard. \nWorkload:\n3 non-cumulative exams (multiple choice), several articles to read, textbook chapters, a lot of studying is necessary to succeed on his exams\n"
        },
        {
            "course_name": "Perception",
            "review_date": "December 10, 2009",
            "review_content": "\nDon't take this course if Remez is teaching it.  He will kill any curiosity you feel about Perception, and the exams are impossible and will make you feel like studying for them is hopeless.\nProfessor Remez would often leave sentences or ideas hanging, which was very frustrating as I was just trying to keep up with him.  He taught the class like it was for grad students, not students who had never taken a Perception class.  I also found it really disruptive to the class when he made that big stink about cell phones going off and how you would have to leave the class immediately.  I agree that cell phones going off are rude and interruption, but the way he handled it exacerbated the problem, and was insulting to the students.\nThe exams: Challenging beyond a reasonable point.  I studied a ton and really felt like I understood the material, and yet when I took the exam, it was impossible.  The difficulty of the exams didn't make me think, it made me guess.  I am amazed that I am doing as well as I am in the class, considering how screwy the exams are.  What exactly is Professor Remez trying to test us on?  I would appreciate a fair test that actually looked at our retention and understanding of the material presented.  This urked me so much.  What is the point of designing a test that your students can't answer, and then having to curve it so you don't fail everyone? Shouldn't that tip you off that maybe you aren't doing a good job making exams?\nWorkload:\ntextbook reading (Schiffman) and some additional readings, mostly psychological studies.  The reading needs to get done before each exam.  (There are 3 non cumulative exams, super difficult, you need to study a ton but it won't really help because his questions are unfair and impossible.)\n"
        },
        {
            "course_name": "Perception of Langauge ",
            "review_date": "September 01, 2008",
            "review_content": "\nI can understand how Remez would be a poor teacher of a large class but in this six person seminar he was amazing. He is knowledgeable, intelligent, and knows how to get his students to think. He'll answer questions for hours. He challenged our class but was reasonable on grading. Many times class became a discussion rather than a teacher trying to transfer their knowledge. His assignments are difficult to understand but all he ask is that you try. I think he is one of the best professor if you are in a small enough class so he gets to know you and you get to ask A LOT of questions.   \nWorkload:\nNot too much reading but very abstract. One writing assignment a week. A take home mid-term and final. Hardest part is figuring out what the assignment is asking for. \n"
        },
        {
            "course_name": "Perception",
            "review_date": "December 09, 2007",
            "review_content": "\nI feel obligated to write a review because a) the most recent review is from 2004, and b)the other reviewers were exaggerating.  Remez is actually not Satan, as they would have you believe.  Sure, he has an off-beat sense of humor.  Yes, he is rigid about test dates.  But he is passionate about his subject, he tries to keep you interested during his lectures, and he is a totally nice guy when you go talk to him during his office hours. (And he is really smart.) I did not find him condescending at all, only helpful.  But be warned: if you are a Barnard student thinking about taking the class to fulfill your science requirement because you are terrified of all things science... don't do it, unless you want to pass/fail.  The other reviewers were not exaggerating about how hard the tests were - especially if science  is not your thing.    \nWorkload:\nNormal for a psych class - textbook + additional articles to read.  Three non-cumulative tests.  Did I mention they were really hard?\n"
        },
        {
            "course_name": "Perception",
            "review_date": "December 24, 2004",
            "review_content": "\nRemez is an okay professor once you get used to him. He does know his stuff. But he is arrogant and totally brushes off those questioning his word. And he's extremely rude and condescending to students with strong opposing views. There were times when someone brings up a valid question that challenges what he just said and he completely evades the question in a very politician-like way and restates his claim. It was kind of funny actually. He also purposely makes a lot of noise during exams to piss people off, but he does give us chocolate to make up for it. Overall, I don't regret taking the course cuz the material's pretty interesting, although the textbook is extremely repetitive.\nWorkload:\nThree exams, non cummulative. There's a lot of required reading. On the first exam alone was half the textbook (10 chapters) plus a bunch of course packet articles. The exams themselves are insanely impossible. Even though it's all m/c and matching, there's no way you can pass by just recognizing answers cuz nothing will seem remotely familiar. It's either extremely nit-picky minor details from the readings or worded in such a way as to distort the original meaning. You really have to know your stuff. However, I do admit it does get easier once you're used to his form of questions. And some of the m/c are hysterical and you will laugh out loud during the exam.\n"
        },
        {
            "course_name": "Perception",
            "review_date": "March 02, 2004",
            "review_content": "\nAs a teacher, Remez isn't bad; for the most part, he kept my attention, and I did learn a lot from his class. As a person... well, that's a different story. He's the most rigid person I ever met -- everything he does is more or less set in stone, and he doesn't deal well with unexpected outside interruptions (even unintentional ones). He's probably got some form of obsessive-compulsive disorder. While he finds it okay during his lectures to go off on tangents (and I mean TANGENTS -- he'll literally take time out to go around the room and ask each member of the class what they had for breakfast that morning), but he has trouble with students raising their hands and asking questions related to the material during the middle of his lecture. (He'll politely tell you to wait until he's finished talking.) Not to mention he has little to no concern for his students. He's always in a hurry to leave class following a lecture and won't stick around to talk to students afterwards, even for a minute. And even though he urges students to come to his office hours, he won't stay a minute past the allotted time. (Let it be known, by the way, that it's not even like he has a class or a meeting afterwards.) I wouldn't go so far, as the previous review has, as to call him a \"Psycho\" -- there are definitely worse out there -- but his rudeness, obnoxiousness, and inflexiblilty can be really frustrating most of the time, and not always something you can get used to. \nWorkload:\n3 exams that are butt hard and majorly curved (the class average was a 68 on the first one), or else contain easy questions that are so convoluted it takes a few minutes just to understand what he's asking for. And significant chunks of reading from an overly dense textbook (of which he'll cover maybe 1/10 in class and expect you to know the rest come exam time). Plus either a 3-hour lab (which was completely pointless) or a short paper on a topic of your choice.\n"
        },
        {
            "course_name": "Perception",
            "review_date": "December 24, 2003",
            "review_content": "\nOkay...so you have read some reviews.  This is by far the latest one. Listen up!\nThis guy belongs in the Psycho Department.  NO I am not exaggerating at all !!! If you are someone who likes being vomitted information on to your ears then by all means go ahead and take the useless course.  But if you have some self dignity and self respect, you will blast out of his class after you witness the degrading manner in which he treats his students.  Trust me...the guy is an asshole with everyone, you will not be the exception.  \n\nWorkload:\nworkload: you will have to carry a bucket full of bricks on your back for the entire semester. NO...there are not multiple textbooks, rather it consists of the text and the reading packet. The bricks are  figuratively speaking the mental and physical drag this course will put you through.  You will never fully accomplish all of the reading and the 3 exams are purposely created so that you don't know  95% of the answers, thus you fail them or barely pass them.   Add another 3 hours to your class schedule if you are taking lab.  If only taking the lecture,  you will write a research paper.  If you are a rational individual who knows that CULPA is not full of shit,  you will automatically remove this course from your class schedule.  Best of Luck and many blessings to you if you do waist your life and money on this Psycho. \n\n"
        },
        {
            "course_name": "Perception",
            "review_date": "December 06, 2003",
            "review_content": "\nHave you seen \"Better Off Dead\"?  Do you remember the math professor that speaks incredibly slowly and holds his high school class in rapt fascination?  Remez reminds me of that guy to a T.  but with a lot less fascination from the class.\nIf I had the chance to do it again, I would definitely take a different class.  \nWorkload:\n3 Tests....and for the Lab, Remez is God over a series of dull experiements (though mind you they had potential) and one big APA style write-up.\n"
        },
        {
            "course_name": "Perception",
            "review_date": "November 17, 2003",
            "review_content": "\nI absolutely hated this course. Although Remez is obviously knows his stuff, his lectures are extremely boring and he goes off on tangents all the time. What's worse is that his tests are impossible and they are made up of material that comes out of nowhere. Stay away from this class.\nWorkload:\nLots of reading, 3 tests, and a short paper if you aren't taking the lab. \n"
        },
        {
            "course_name": "Perception",
            "review_date": "December 28, 2002",
            "review_content": "\nIf you think \"how many days does it take for an astronaut to stop vomiting in space, 2, 3, 4, 5, or 6\" is a reasonable mutiple choice question, then you will love him.  Warning: if you take this class, make sure your cell phone is off.  If it rings during lecture, you get an automatic W on your transcript and have to drop it.  It's not a bluff, either.\nWorkload:\n3 tests with questions on material you've never seen before, and a research paper if you're not taking the lab.\n"
        },
        {
            "course_name": "Psychology of Perception",
            "review_date": "December 15, 2002",
            "review_content": "\nProfessor Remez is an extremely engaging lecturer.  While he sometimes goes off on tangents, his anecdotes do have a point and help you to understand seemingly impossible theories. He has a sarcastic sense of humor, and some students were offended by his use of four-letter words [and he did use the \"F\" word, if you're curious]. Sometimes his jokes cross the line - for example, when one student approached him with a question during an exam, he said something to the effect of  \"You need to study more.\"  Perhaps he was not trying to be offensive, but comments like this can be offensive considering how much butt we all busted in this course. Remez kept my attention 100% of the time, and I learned more than I ever thought I could from this course. If you don't think you can deal with his antics, however, you will not enjoy the class.\nWorkload:\nTons of reading. The textbook is densely packed with information, but it's clear and repeats concepts over and over until they're drilled into your head. The articles int the course packet rannge from \"fun, easy, and interesting\" to \"what the hell does this say?!\" A short research paper for students not enrolled in the lab. He gives three exams that probably gave every member of the class an ulcer. Let me stress that you should probably take this class pass/fail. You will learn a lot, and the material is interesting, but I felt that the exams did not allow me to demonstrate my understanding of the material.  That was VERY frustrating! No final.\n"
        },
        {
            "course_name": "Perception and Language",
            "review_date": "May 05, 2002",
            "review_content": "\nHe taught a seminar that only had three people in it. Hes an amazing professor, but hes hard. He expects you to take the already complicated theories and apply them, but hes williing to go over it if you don't get it. This man knows everything there is to know about language and everything else, so it was really cool to have him teaching such a small class.\nWorkload:\nSome of the readings were hell, but it wasn't so bad. A couple of short assignments that made you apply theories, a midterm and a take-home final\n"
        }
    ]
}