{
    "prof_info": [
        {
            "prof_name": "Eleni Gage",
            "prof_id": 4569,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "March 02, 2010",
            "review_content": "\nUniversity Writing is a requirement for every incoming student, so hardly anyone chooses it freely and everyone is new to Columbia. One would think the professor takes that into consideration. I didn't think Prof. Gage did. Her expectations are very high, which will only become apparent once you start receiving actual grades. The bi-weekly assignments always receive enthusiastic comments from her, so you will think she really likes your work. So you will be surprised when your grade doesn't quite reflect that. She is a stickler when it comes to grading. Although she has a meticulous system breaking down each grade, which makes it seem transparent and fair, it somehow doesn't work out that way.\nThe class itself was often stimulating, but much of the credit for that has to go to my classmates. \nWorkload:\nreading+writing assignments for EACH class, which can take you 4-5 hours if you do them seriously - and that twice a week. Then there are 4 main papers. This class will keep you busy!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 04, 2009",
            "review_content": "\nEleni was terrific.  She really made our UW section quite fun, and we still got a lot done.  She also puts a lot of effort into grading, unlike other professors.  All of the material that we turned to her in would have, when returned, tons of helpful comments written in the margins and a large summary, as well as a fairly detailed scoring rubric.  This REALLY helps in pinpointing the problems with your writing and to help you improve for later semesters.  The grading seemed fair to generous.  \nI recommend her section strongly.\nWorkload:\nReasonable.  Short assignments for each class (not graded but factored in as an \"effort\" grade).  4 papers for our class (other sections just had 3), none of which was horrific if you put decent effort into the first draft.\n"
        }
    ]
}