{
    "prof_info": [
        {
            "prof_name": "Larry Wright",
            "prof_id": 2277,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Probability",
            "review_date": "December 22, 2012",
            "review_content": "\nThe content in this class is amazing, but Wright is a pretty bad lecturer. He tends to just read off pdf files containing his poorly handwritten notes. And so, lectures can be rather dull. Nonetheless, this was definitely my favorite class this semester. Also, sometimes he randomly gives extra credit if you can do a homework problem on the board in class.\nHe also talks a lot about his experience working with IBM and teaching at University of Arizona.\nWorkload:\nWeekly hw set containing 5 questions of varying difficult, 2 midterms (easier than hw), 1 final (way harder than midterm; more comprable to hw problems)\n"
        },
        {
            "course_name": "Applied Statistical Models in OR",
            "review_date": "April 23, 2012",
            "review_content": "\nThe worst professor I have ever encountered. PLEASE AVOID HIM AT ALL COSTS. He is a terrible lecturer and doesn't even know how to copy down the formulae from his notes on the blackboard. To study for the test, you need to go through his terribly scanned hand-written pdf, and the textbook which doesn't cover some of the stuff he goes over. Course material is not hard if you read the textbook and try to understand what's going on, but it is just too painful to sit through his lectures. It is really a disaster that everyone who wishes to pursue the glorious financial engineering as their major has to go through this course. Seriously, this course (more like this professor) is one of the major reasons that made me consider changing my major. I seriously advise students to take other alternatives for the statistics requirement for their major.\nWorkload:\nWeekly problem set (5 problems), two midterms (fair, but ridiculously formatted), one final.\n"
        },
        {
            "course_name": "Intro Probability/Statistics",
            "review_date": "May 23, 2011",
            "review_content": "\nTerrible, terrible teacher. It's people like this that make me really furious. Why in the damned world do we have to pay 50 thousand dollars a year to come to this school and have a completely useless teacher? This guy seriously just went over the book, verbatim (although he did crop some few things out). the review below this one explains exactly how dumb/annoying those often unreadable PDFs are, since they are just a copy of the pages of the book (I'll give him credit though, he did change the names of the people in a few of the problems in the first chapters). I worked really hard in this crap only to do areview_content. review_content MGFs and Max Likelihood Estimators! \nWorkload:\n1 pset a week, many answers are online. Really annoying that he even gave problem sets during mid term weeks....\n"
        },
        {
            "course_name": "Intro Probability/Statistics",
            "review_date": "May 01, 2011",
            "review_content": "\nThis course and professor are very frustrating.  This course teaches a lot of very useful material, and the material is covered in a logical, orderly fashion.\nHowever, the textbook is a mess.  The software, an integral part of the text, only runs on Windows 32-bit systems and was designed for DOS.  Also, the text is full of frustrating errors.\nThen there's Prof Wright.  He's a very nice guy, though not all that politically correct.  He likest to talk about AZ and his family.  He does his own recitation sessions on Fridays, and he often picks out students to praise or challenge or question or mock.  This makes the course a lot more personal.\nHowever, he teaches from hand-written PDF notes, which don't scroll properly since they're scanned in at such high resolution and can't be redrawn properly by a low-powered system.  They're also fairly hard to read.  Worst of all, they generally just rehash the content and the examples from the text; although it is a subset that is more likely to show up on an exam.\nHowever, if you go excruciatingly slowly through the dense text and use Wright's PDFs to review before exams, you should be fine.\nDespite this, class is pure agony.  Not only do you have to wait for his notes to scroll, but Professor Wright mumbles incomprehensibly, trails off, writes too lightly, dismisses or forgets students' questions, and erases his work before anyone has a chance to copy it down.\nIt amazes me that 13/~100 students bother to show up by the end of the semester.  Truly remarkable for a professor who has worked at IBM and elsewhere, and has been teaching since the 1970s.  But I guess you can't teach an old dog a new trick.  And the course is doable, even if highly and unnecessarily unpleasant.\nWorkload:\nAverage.\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "January 06, 2008",
            "review_content": "\nPeople hate on Wright too much. I mean, yes, I had a tough time sitting through the lectures for this class. And yes, it sucks to get all your homework assignments in the form of all-caps Courseworks emails that you can't find anywhere else. But, I mean, whatever, the lectures are pretty thorough, the homework is remarkably comprehensive, and he puts the effort in.\nI don't know about these curve rumors... I had a D average or something and got a B in the course.\nWorkload:\nOne homework a week, tough if you haven't been paying attention (I hadn't), and two nasty exams.\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "December 24, 2006",
            "review_content": "\nProfessor Wright makes Stat interesting because he loves himself to the point that his real-world examples of stat devolve into stories about how awesome he is.  You'll hear all about his two businesses and his house in Greece and his awesome apartment and how his other professorship at the University of Arizona is great in the sense that they have better classrooms but not so much in that the students aren't as bright as those at Columbia.  And on and on and on.  Stat is boring, but listening to this guy ramble makes it funny and sometimes actually teaches you something about it.  The book isn't very good because it was clearly thrown together to make people buy a new edition with almost no new material.  But the class really isn't bad if you follow along and learn the procedures for solving the problems he gives you.  Some of the probability and the stat analysis is challenging, but putting in a little work makes this class pretty manageable.  Grading is not particularly inflated because it doesn't need to be.\nWorkload:\nweekly problem sets (5 problems each), two midterms, standard final\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "January 09, 2006",
            "review_content": "\nHe's fairly boring but he explains the material very comprehensively. If you attend class, the homeworks aren't difficult and you likely will not have to refer to the textbook. Classes are fairly dense, as he covers a good portion of the textbook. Exams are very fair; he gives problems that are exactly like what he has been teaching. However, there is virtually no partial credit, unless for arithmetic errors.  He allows notes and a calculator, but it is no longer open book. I don't think there is formally is a curve, but he is very fair in giving out grades.\nWorkload:\nWeekly problem sets, two midterms, final\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "April 08, 2005",
            "review_content": "\nI learned a lot in here - which is good, because it will haunt all throughout the IEOR classes if you don't.  Some people complain that notes are worthless to take.  That is pretty closedminded to complain about.  Rather, it's a fact.  One will learn a lot more in this class if they just take the time to put down their pen and listen.  The book was elementary enough to bring it all together for you when you did the homeworks.  Too many people are worried about taking notes that they will never look at again rather than sitting in a lecture and trying to understand the concepts being presented.\nThe lack of Courseworks was annoying, though.\nNot a bad professor, not the best, but I'm glad I took this class with him.\nWorkload:\nEasy homeworks, decent midterm, rough final.  I think there's more of a curve than people think though - I did horrible on the final and came out with a very good grade...\n"
        },
        {
            "course_name": "Financial Engineering",
            "review_date": "January 10, 2005",
            "review_content": "\nDisorganized and boring - these are two words that define this man. His lectures are boring and the information he presents does not have much to do with financial engineering. I mean I am not complaining that the class was easy. But I am complaining because this class was slightly more complex than Intro. to Accounting and Finance. So, do not expect to learn anything interesting such as options and futures. He briefly touched on options and it was not much for a 4000 level FE course. Homeworks and exams were easy at the beginning but they got more tedious (not necessarily diffucult, just stupid calculations) towards the end.\nAs one person noted the worst thing about this guy is his inefficiency. Instead of posting homework solutions as pdf files on a webpage he simply sends out useless emails that only have the result of the problems. Most of the time he does not even bother to show the calculation for more diffucult problems and just writes \"messy calculation\". But dude we are taking this class to learn the messy calculations. \nHis grading is also not very fair. There is almost no partial credit. However, considering the difficulty level of the class, there is no reason that an average student can't get an A in this class\n\nWorkload:\nweekly problem sets, 2 midterms (1st very easy, 2nd slightly harder), final (long)\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "January 06, 2005",
            "review_content": "\nA lot of people are really hard on Professor Wright.  He is not the world's best lecturer but he is not terrible either.  When listening to his lectures, you will hear a lot of stories about some of the projects that he did as a professional statistician.  He teaches right from the book, so if you don't get anything, it is right there in the text.  I thought that the lectures in the beginning were a lot better than the ones at the end, partly because of the material though.  Also, a lot of people complain abou this grading process.  It is really not bad.  He doesn't give much partial credit for conceptual errors on the exams, but they are OPEN BOOK, and you also get two cheat sheets.  Many of the problems are right from the book with book examples that mimic the problems almost exactly.  If you have conceptual errors with the book in front of you, then you can't really complain too much about partial credit.  Also, his lack of a curve is not really a bad thing.  All you need to do is get an average of 85% and you have an A.  There are no pluses or minuses, so there's  no getting screwed by arbitrary grading.  Going into the final, I knew eactly how many points I needed to get an A in the class.  It is a lot better than the classes where you have a good grade, and then the class has a ridiculous average on the final and you end up getting a grade a lot worse than expected.\nWorkload:\nWeekly problem sets (about an hour) two midterms and a final.\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "January 04, 2005",
            "review_content": "\nI agree with the people who said that Professor Wright was lazy/disorganized/boring. He claimed that he used questions from the book and made the exam open book to save paper. I certainly am not complaining about the open book policy, but  I would be quite naive to believe that he was concerned with saving paper. He was definitely lazy; he was the only math/science professor in my three semesters to never set up his class on CourseWorks and/or post information on a personal website. Sending out information by e-mail is fine I suppose, but it seems like something my CC professor would do. For someone in the IEOR department, he is the epitome of inefficient. He is counter-optimization: he would hand out homework by calling out each person's name, one-by-one, in a class of 100 students or so---a complete waste of 10 minutes. But then again, you don't really want to watch him copy proofs from his notes onto the board (which were readily accessible to the students in the class via the book and also pointless given that he provided no insight about the proofs and never asked anything like that on exams). Watching him write on the board is hard because he is incredibly disorganized. Taking notes is almost always a waste of time. He likes to write pointless things on the board, such as \"Election\" or \"Red Sox\" or the batting averages of 3 baseball players--stuff that really doesn't need to be written down on the board or just does not matter. Anyways, he's still kinda funny, and I think he makes up a lot of stories (stories that are meant to be relevant to the discussion but never are). All in all, you'd be better of not going to class. He stressed the importance of moment-generating functions for several lectures and insisted that he'd asked something about them on the final exam, but as expected, he never did. The lack of partial credit is pretty weak, but you should just be sure to avoid careless mistakes. The lack of a curve is not problematic because the class really is pretty easy. One recommendation: try to get a solution's manual for the book. And one more thing, De La Pena is probably a better professor, but Wright is definitely far easier.\nWorkload:\nHomework from the book (15%, easy). Two midterms (25% each, mostly out of the book, easy). Final exam (35%, more difficult than expected, but still not too bad).\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "January 03, 2005",
            "review_content": "\nLarry Wright is the worst professor I have had at Columbia.  It was a bad sign when there existed no syllabus, and it got worse from there.  The lectures were awful; solely comprised of his rambling on and on for pages and pages, briefly punctuated by absolutely random non-sequitur jokes and anecdotes.  On top of that, he is simply not a nice person.  Outside of class, he is entirely unapproachable and is rude and snippy with many of his students.  Office hours were a farce, as the outside door leading to his office is perpetually locked, and he was fully aware of this fact.  His \"TA\" Rouba, was virtually nonexistent.  He is also very lazy, demonstrated by two things: the majority of the questions on his exams were from the book,  Also, he is a statistician, and refused to construct exam-by-exam curves.  He decided to use a strange system by which 85+is an A, 75-85 is a B, and 65-75 is a C.  Further, his system of no partial credit is definitely harsh, he docks 10-15 points at the drop of a hat, which makes it pretty tough to get the A.  He also doesn't award plusses or minuses, so it's either a straight up A or a straight B.  However, to be fair, I definitely learned a lot about probability and statistics, and I developed a lot of appreciation for the field and understood how to look at data in a totally different light.  This knowledge was absolutley no result of the effort of this professor, but was through reading the book, which was a pretty good text.  The class was very useful, the professor was worthless, and it wasn't especially difficult.  Take this class, but do so with a different professor, you'll learn the same stuff and probably have a better experience.  \nWorkload:\nReasonable.  Problem sets (9) worth 15%, 2 easy midterms worth 25% each, very hard final worth 35%\n"
        },
        {
            "course_name": "SIEO 4150 - Probability and Statistics",
            "review_date": "December 31, 2004",
            "review_content": "\nProfessor Wright is definitley a breath of fresh air around Columbia as far as professors are concerned. His lectures are fairly interesting if you find his anecdotes and sense of humor funny, all of which are hilarious. He brings his own work experiences into the class to help explain the material. He uses a great book, so you can just read the book and you will understand it all. If not, his lectures will suffice in learning the material. As far as the \"harsh\" (as the previous reviewer put it) grading policy, it really is not bad. There is no curve whatsoever in this class and 85% is an A, 75% is a B, and so on. The reason why there is virtually no partial credit on any of his exams is because the exams are easy and not complicated. The two midterms were very easy, both allowed calculators, a formula sheet, and OPEN BOOK. Many of the questions were directly from the book, which is why we were required to bring it to the exams). The final was cumulative and harder than expected. Im sure that was because he didnt want to give out so many A's. No partial credit does seem harsh, but if you make a mistake in the reasoning on such straightforward questions, then you deserve to get penalized. Mathematical errors get partial credit, and if there was an error in the process, you get squat. So if you have the opportunity to take the class with him, do so! You will learn the material well and should do well if you learn the material. He doesnt hand out a syllabus or hw assignments, but he emails them, so there should be no problem if you check your email regularly. \nWorkload:\nNot Bad: 9 Problem Sets (from the book, straightforward) - 15%, 2 Miderms (easy) - 25% each, and a cumulative final (medium difficulty, but not hard) - 35%.  All exams with no curve or partial credit for any error other than calculation errors. \n"
        },
        {
            "course_name": "Probability and Statistics IEOR 4150",
            "review_date": "December 20, 2004",
            "review_content": "\nLarry Wright is OK as a lecturer, but his class is a wreck.  No syllabus, no info on courseworks, nowhere to get information on what you're supposed to do and when you're supposed to do it, except through his messy last-minute emails, and no TA that I was aware of.  All this would be fine if he was approachable, but he's snippy and barky and gets annoyed easily.  And even all this would be OK if it wasn't for his barbaric grading policy - NO CURVE, and NO PARTIAL CREDIT.  The material on the midterms was pretty easy, but make the most minute of mistakes, for which most teachers would take off 1 or 2 points, and watch your grade plummet by 15 points.  Such is A. W. Wright, crusader against grade inflation.  \nWorkload:\nPretty Light, but be prepared for the final or it'll bite you in the\n"
        }
    ]
}