{
    "prof_info": [
        {
            "prof_name": "Hektor Chang",
            "prof_id": 12750,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "March 12, 2015",
            "review_content": "\nI don't know why the other guys have said so many mean words, but as far as I know, Hektor is a great professor who really commits to his teaching. Although occasionally I find it a little difficult to follow his accent, in general, his lectures and coursework materials are really helpful for someone who wants to construct a sound basis for calculus. What I like most about his class is that he has a lot of bonus questions in the homework as well as exams, which can boost your grades up to 50%. Even for a lazy student as myself who never starts doing assignments until the last minute, the outcome of homework and exams were very well. BTW, Prof. Chang likes to use graphic tools in homework, which is really helpful to build up a graphic understanding of Calculus. He also gives us a lot of supplementary materials like history of mathematics (not a must-do, though), which I find both fun to read and learn. \nDuring office hours, Hektor is very laid back and likes to help students with their questions. He is not the sort of instructors who will ask how're your parents doing, but he is really friendly and tends to foster a close personal ties with his students as long as you are willing to ask him. Just to do him justice, no committed professor who harbors the least respect for mathematics has the obligation to design a class, even as fundamental as Calc I, to suit the need to \"get an easy A\", let alone there are 30% bonus points you can get in the exams to higher your overall score. (Personally all my midterms and final are over 100%, thanks to the bonus questions) Actually, Prof. Hektor gives every opportunity for students to get an amazing grade, it's not him to blame if you don't take that. \nWorkload:\nModest amount of work, usually takes 2-4 hours to complete. 20% Homework, 20% for each midterm (2), 40% for final. There are bonus questions each week that can boost your homework grades up to 50% and bonus questions in exams that can boost your grades up to 30% (which means, you can get a maximum score of 130%, because he never cuts the extra points). Therefore, it's a class not only designed for A, but also with every possibility to get an A+. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 23, 2015",
            "review_content": "\nPlease, please, please, for the love of your own well being, do not take this class. Hektor Chang makes Calc I much more complicated than it needs to be and doesn't curve as much as he should. He assumes that everyone in the class has taken calc before and, based on what most of my friends in other Calc I classes were tested on in the final, he went further into the book than he had to. I had a bad time in this class.\nWorkload:\nOne problem set per week, decent length but always the stupid hard questions at the very end of the chapters.\n2 average difficulty midterms, RIDICULOUSLY hard final\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 15, 2013",
            "review_content": "\nDO NOT TAKE HIS CLASS (especially if you haven't taken calculus before). He is a terrible lecturer and he assigns way too much work. His problem sets require you to go to office hours and explain them because they're all geometric proofs of random examples. I took calc I as a way to get an easy A since I took BC calc in high school and this class required way more effort than I wanted it to. \nWorkload:\n2 problem sets per one, one of 30 webassign problems from the textbook and one of 2-6 written problems from material discussed lecture (proofs, theorems, etc)... 2 midterms and a final... way more workload than other calc I classes\n"
        }
    ]
}