{
    "prof_info": [
        {
            "prof_name": "Timothy Donahue",
            "prof_id": 10784,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 16, 2014",
            "review_content": "\nTruly an amazing teacher who cares deeply about each student. A bit of an awkward guy, Tim is enormously helpful every time you meet with him (which ends up being 5-7 times at least), always offering new ideas to help your writing improve drastically. His feedback is a bit overboard with the page letter at the end and all the comments, but I never remember a moment when the feedback wasn't helpful. This guy literally spends 4 hours per kid per progression. I got an A but happen to be a pretty skilled writer (from talking to others, his grading is fair and he'll always explain his grading).\nWorkload:\nLike any other UW class, tons! Luckily, he doesn't pile it on at the end like some of the other teachers but makes it manageable on a class to class basis.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 18, 2011",
            "review_content": "\nTimothy Donahue is an excellent, engaging and accommodating professor. Although many in my class were not the the most vociferous of contributors in terms of the in-class discussions, Mr. Donahue was always willing to rephrase questions in a more accessible way. His grading is fair, and he gives you ample opportunity to do your best work. He is often flexible with deadlines, and is sensitive to the other numerous demands on your time as a student. Additionally, he provides COPIOUS feedback on your drafts (Usually a full page, typed in letter format) which is extremely helpful in addressing your weak spots as a writer and helping you to do your best work. The readings he selects are mostly interesting and engaging, although some require an exorbitant amount of analysis to prove useful in the greater context of the progression.\nUltimately though, what makes Mr. Donahue a great teacher is his enthusiasm and passion for language. Although our class was an early one, Mr. Donahue was always totally committed to engaging us with the topics at hand and the assignments we were asked to complete. \nWorkload:\nThe reading can be heavy at times (Typically 2-3 longer length Essays along with a small writing assignment for homework) but it is doable. He gives you plenty of time to complete the essays.\n"
        }
    ]
}