{
    "prof_info": [
        {
            "prof_name": "Sonia Pereira",
            "prof_id": 2973,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Theoretical Foundations of Political Economy",
            "review_date": "January 27, 2015",
            "review_content": "\nProfessor Pereira is one of the nicest professors you will ever encounter. It was her first semester teaching theoretical foundations and in my opinion she did a good job. She made the best out of the boring material. She is very cute and funny and most importantly approachable, if you ever need an extension she will more than likely give it to you. I found it refreshing to have a professor who truly cares about her students and not her research! Anyways the class itself is easy and not demanding. Prof. Periera gave us 6 questions for the final to study for and chose 3. Luis the TA grades the papers and finals and he's pretty chill with grading- if I'm not mistaken a large percentage of the class got As on their papers. \nWorkload:\n1.    First paper – 25%\n2.    Second paper – 25%\n3.    Class participation and short written assignments – 25%\n4.    Final exam – 25%\n"
        },
        {
            "course_name": "The Theoretical Foundations of Political Economics",
            "review_date": "December 02, 2014",
            "review_content": "\nI found the material to be very interesting but Professor Pereira, plainly said, is a boring lecturer. Her notes on the board are incomprehensible and the information on the slides are grammatically awkward. Also, there is an attendance sheet for each class and you are required to participate once out of the two days we meet a week. The upside is that she is a very easy grader. It is not difficult to write an A paper but still, going to class is a pain..and mandatory. \nWorkload:\nVery light. 3 essays (submit draft for each essay) and a final. \n"
        },
        {
            "course_name": "Introduction to Economic Reasoning",
            "review_date": "April 08, 2013",
            "review_content": "\nProfessor Pereira is awkward. She rolls into class on a red scooter. She gives her lectures off the slides, so you might as well sit home and read the book and slides. \nBoth she and her TA have some problems with English grammar. In the beginning of semester I was puzzled by double negatives in some of her slides, but by the end I wished I had a religion so I could pray that the next midterm/final does not have ambiguous language or typos.\nIf you send her emails, she won't respond. The TA is barely comprehensible. \nThe book is boring: if you know at least some math, you will hate it. It can go on and on and on about calculating an average. Come on, people. I'm a math major, and I can't read the book because I keep dozing off.\nI got out of class knowing half a dozen new words, and that was it.\n\nWorkload:\nPretty much nonexistent. Three homework sets (take some 5-10 hours to complete, but it's simply because they are TEDIOUS, two midterms (don't believe Professor Pereira when she says that the midterm will be shorter than the practice one: it will be more than twice longer! We all thought it was a joke), one final.\n"
        },
        {
            "course_name": "Introduction to Economic Reasoning",
            "review_date": "April 06, 2013",
            "review_content": "\nI want to start off by saying that Sonia Pereira is a really sweet woman. She tries to make jokes and seems to care about her students. I loved her as a person, but really disliked her as a teacher. \nFrom the get-go I realized that most of my class had taken economics before (AP or whatnot in high school). I had never taken an econ class in my life, so I could have benefited from a better, clearer, more helpful teacher. Expect that you will be behind from the first day in this class if you are an econ newbie. You can figure out the material yourself (the book is helpful) and succeed in this class, but with little help from Pereira. \nThe lectures were boring, tedious, and mostly read from the slides (she doesn't post them on Courseworks until after class, which makes note-taking frustrating). \nThe homework was pretty doable. The midterm and final were really easy as well. The quizzes, on the other hand, were difficult. She has completely unrealistic expectations about how quickly they can be completed. Write fast! \nOverall, I think I could have really enjoyed econ if I had a better professor. The time I spent outside of class learning the material was interesting, but the class itself was pretty dull. \nAvoid if you can, but if you end up in this class, it's not the end of the world either. \n\nWorkload:\nTwo homework assignments. Two quizzes (for which she gives you 25 mins instead of the hour you need). Midterm. Final. \n"
        },
        {
            "course_name": "Introduction to Economic Reasoning",
            "review_date": "December 13, 2012",
            "review_content": "\nWords really cannot describe how bad of a professor Sonia is. For starters, she has typos in every single quiz, midterm, final, homework and homework assignment. What's more, she oftentimes has miscalculations in the homework and practice problem solutions that she releases to the class. I would be able to tolerate this lack of attention to detail if she actually taught anything in her class, but alas her inability to proofread is but the tip of the iceberg. Her class consists of her reading aloud a slideshow that accompanies the book and uses the exact same phrasing and examples as the book. She will show these slideshows every single class and whenever a student has a question that isn't exactly lined out on the current slide, Sonia says that she will get to it later, yet never does. I have learned more from the book than I have in her class. It is disturbing that such an unqualified teacher could be in charge of an intro course, as she has definitely deterred all potential economics majors from further pursuing this career track through her inadequate teaching habits. Even more surprising is that she is still teaching at the university, in spite of the countless scathing reviews she has received. \nI will close this with a Sonia anecdote: For our quiz, not all of the students in the class had calculators. To remedy this, Sonia allowed everyone in our class to use our cellphones as calculators during the quiz, so long as they were on silent. Not sure if this was so that she wouldn't hear the texting \"bings\" around the room as everyone cheated or what...\nWorkload:\n2 Quizzes, each laden with typos and bad phrasing and only 25 minutes for each (each question has around 8 parts)\nMidterm and Final, non-cumulative\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "December 19, 2007",
            "review_content": "\nSonia is very nice, but she sometimes does have trouble answering questions. Overall, I found her to be helpful. She was much more responsive than the TA and more understanding. I went to her office hours a few times and thought they were useful. The class is not hard, but the lectures can be tedious. Sitting through powerpoint slides in the dark is never fun. But she does try to engage the students which not enough professors do. I would take a class with her again and she is not as horrible as some of these reviews make her out to be. \nWorkload:\n1 midterm, 1 final, 5 homework assignments that are due every couple of weeks\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "October 01, 2007",
            "review_content": "\nI read her reviews on culpa before arriving on campus my freshman year (last year) and thought, she can't be that bad...  Well, she can.  My experience with Pereira taught me to always trust in culpa (except Dalton deserves a gold nugget!) -- she the worst teacher I've had here.  Granted, I have based all my class choices since on culpa reviews (only choosing teachers with a shadowy gold nugget or higher), but she was even worse than high school teachers!\nI must warn you that I rarely read the book and have little interest in the subject, I took it to try out the subject.  Her lectures were straight out of the book, and if you want to understand the material I recommend you just stick with the book and skip the class.  I didn't want to do the reading and so I hoped that I would absorb the material in class through osmosis while doing other homework.  I ended up with a B+, although with a little more effort I probably could've gotten an A.\nWorkload:\nWeekly problem sets, a midterm and a final.  \n"
        },
        {
            "course_name": "Inequality and Poverty",
            "review_date": "January 10, 2007",
            "review_content": "\nI found Sonia very engaging. She goes by slides but still manages to generally make an argument, which with you can choose to agree or disagree.\nAlthough the class is often oversimplistic, it was generally very thought-provoking and interesting. If you are interested in an economic interpretation of public policy, this class is for you.\n\nWorkload:\nMidterm (graded harshly this time), Final, overall as limited or in depth as you want. grades turn out fine\n"
        },
        {
            "course_name": "Inequality and Poverty",
            "review_date": "January 09, 2007",
            "review_content": "\nThis class is a waste of time to attend - the lectures display intellectual laziness (data from 1995) and the tone is far from scintillating. And it's taught like no one in the class has any economic background whatsoever.\nBut as long as you go through the tedium of outlining the answers to the midterm/final essays (conveniently given out as pass/fail assignments before the tests), you will get an A. Easily. You might even learn a couple interesting facts. \n\nWorkload:\nAre you good at doing things you don't like to do but know you have to do? Yes? This class will be easy. \n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "December 25, 2006",
            "review_content": "\nSome professors are very sweet and nice but just cannot teach..Sonia is one of them. She cannot answer you questions in class, so don't ask her because u'll get her even more confused! she'll say she cannot answer ur question at the time and will email u the answers to ur question. She posts all the slides on courseworks after the class is done (but in the middle of the semster, she posts them b4 class.) But many ppl who did not come to class did well just reading the text book and the slides. Her lectures are extremely boring and tedious and most ppl just fall asleep anyway. her exams are long but not too hard..also with very generous cures. she always gives review materials the class b4 the exam and forgets to put some info there...HW set and exams take extremely long to be graded because there's only on TA.\nWorkload:\nweekly HW sets, not too hard--it's based on the text book and her slides.\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "December 18, 2006",
            "review_content": "\nDon't do this to yourself. I think this woman has no idea what she is doing, and that is me being kind. When students asked questions, she would have no idea how to answer them and change the subject. She takes over two weeks to grade homework and takes forever with tests. first midterm took three weeks to grade, second midterm took over a month. we only got them back two days before the final. her slides for class are posted online and are word for word transcripts from the textbook, which is actually a pretty good one. I only went to class five or six times and did fine just reading the textbook. She doesn't even care enough to show up to her own class on time. She is one of the best examples of the assertion that columbia professors are experts in their fields, but a lot of the time have no clue how to teach a class. Take this class with a different professor.  \nWorkload:\nProblem sets each week which should take about an hour to do, two midterms and a final. very flexible grading to help the student get the best grade possible. \n"
        },
        {
            "course_name": "Inequality and Poverty",
            "review_date": "December 14, 2006",
            "review_content": "\nUnfortunately this was a very lack-luster class. The professor is amiable and passionate about the subject, but she isn't able to present the material in an engaging manner. We spent the first week of class looking at broad measures of poverty and inequality in the world, but we never really moved on from there. It was always more graphs and statistics, or summaries of studies. She posted all of the PowerPoints online, so there seemed to be no reason to go to class. We didn't have very many reading assignments, but the ones we were responsible for she would have already summarized in the lecture notes. So there wasn't any need to read either, although I found the papers much more interesting than her lectures. \nThe structure of the exams was kind of odd...they were virtually the same as the two \"Quizes\" that we had a week to complete for homework, and the answers came directly from the slides. Most of us were surprised when we got our midterms back though, because our grades were much lower than expected. She posted \"answer keys\" for the quiz and the midterm, but I don't see much of a difference between what I wrote and what she was supposedly looking for. For the final, she has already posted the answers to the second quiz.\nThere is also the option of writing a research paper instead of the two exams; the student paper presentations the last week of class were actually very interesting.\nBottom line: In my opinion, this was a pretty boring course, even if the subject matter was intriguing. The workload is close to nil, but the grading seems to be unfair.\n\nWorkload:\nAttendance not required, if you don't want it to be.\nReading not necessary, though interesting (and light, anyway).\nTwo take-home \"quizes\" whose questions are the same as those on the exams.\nA midterm and a final; several short essay questions (or one research paper).\n"
        },
        {
            "course_name": "Inequality and Poverty",
            "review_date": "November 16, 2006",
            "review_content": "\nThe focus of this class, Inequality & Poverty is very interesteing, but this professor doesn't quite do it justice. Her slides are very thorough and well planned, but it has become quite annoying to be in an upper level class where the professor teaches by reading the slides word for word. This has been a tough class to stay awake in at times. She is simply not engaging. \nOur midterm was a disaster. It was based on the problem set which she refused to provide answers to. A lot of people were confident going into the exam, but did horribly because she did not explain to us what she expected in our replies.\nWorkload:\n2 problems sets which receive full credit if you attempt all questions and opt to take the Midterm and Final; you have the option of a paper and presentation if you do not want to take the exams; reading articles (however, all of the information you need is in the class slides which she posts. it would be helpful to go to class to get  more details.)\n"
        },
        {
            "course_name": "Inequality and Poverty",
            "review_date": "July 19, 2006",
            "review_content": "\nEasy A, don't bother to buy the books. All slide show, posted on coursework. Don't ask questions, most of the times she doesn't have an answer. \nWorkload:\nEasy Midterm + Easy Final + 2 quizes (not graded) or Final paper + 2 quizes (graded). Quizes are right before exams and they are the same questions that will be on the exams.\n"
        }
    ]
}