{
    "prof_info": [
        {
            "prof_name": "Irwin Gertzog",
            "prof_id": 346,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "The American President",
            "review_date": "May 17, 2016",
            "review_content": "\nProfessor Gertzog was awesome!!!! He is SO knowledgeable about the course material and his passion for it shines through in his lectures. He's a very sweet man that loves teaching. I never went to his office hours, but I wish I would've. He's really old, so if you sit at the back it may be hard to hear him at times, but I didn't have this problem because I always sat near the front. Also, at the beginning of class he usually does a recap of the previous lecture and sometimes he will go off on a bit of a tangent and it takes him a while to get back into the structured lecture he had planned. It didn't bother me though.\nThere are 3 take home exams which are each worth 1/3 of the grade. They consist of two essay questions and he usually assigned them on monday and they were due wednesday, so you had 48 hours to complete them. The questions were tough, and he expected you to incorporate the reading into your responses, which were capped at about 1100 words per question. Also, the grading was pretty tough, but altogether fair. Plus, he lets you appeal the grade if you feel it's really unfair. It's difficult to get an A, but if you work hard on the essays and incorporate the readings/lectures you'll do okay. I got an 85 on my 1st exam and a 95 on my 2nd. (Haven't got the 3rd back yet)\nOverall, very rewarding class with a wonderful professor. Not an easy A though.\nWorkload:\nmoderate\ndecent amount of reading textbooks, but it's not necessary for in-class. if you wait until the exams are assigned it will make them more difficult though.\n3 take home essay exams\n"
        },
        {
            "course_name": "The American Congress",
            "review_date": "January 22, 2015",
            "review_content": "\nI am registered to take this class this semester, however, after seeing the workload I plan on dropping it. The previous reviews made this class look appealing because though it has a moderate to heavy reading load, the only work (based on previous Culpa reviews) was supposed to be three short essays and a take home midterm and final. This is wrong. There is also a 20-30 page research paper due. Gertzog also made it very clear that while the midterm and final are take home, they are very difficult. Gertzog also takes random attendance in the beginning and end of class. This class is not good for anyone that has a heavy schedule or a heavy reading/writing load. Gertzog himself seems to be knowledgable about congress and able to explain the concepts, and he does seem to be somewhat organized but can ramble a small bit. \nWorkload:\n20-30 page research paper\n3 1200 word responses\nTake home mid term and final\n"
        },
        {
            "course_name": "The American Congress",
            "review_date": "May 11, 2014",
            "review_content": "\nI suspect Professor Gertzog got a silver star by petitioning President Eisenhower for one, as 1952 was probably the last time this man organized a thoughtful and coherent lecture. \nTopics in class come under bold and promising titles - \"Congressional Leadership,\" \"Congress and the Supreme Court,\" \"Interest Groups and their Influence\" etc. \nThese topics, however, are substantiated by vague reading (the reading on congressional committees spanned six chapters of a book, none of which actually covered committee systems in depth). The exams have little to do with the reading or lecture material, and are often vaguely political questions surrounding \"how to get into Congress\" or something of that nature. \nIn terms of feedback, there's just about none - both papers came back with a number and cryptic rune-like symbols that resembled celtic spiritual symbols. Visually pleasing as they were, they provided 0 guidance or constructive criticism. \nIt's very easy to skate by in this class - but I suggest you avoid it, even if you're looking for an insubstantial poli-sci course. Attending class is a chore. Writing the papers feels arbitrary. Class participation is an occasional question a week, if you're lucky.  \n\nWorkload:\n3 papers (or not? he randomly changes assignments periodically, including a few weeks before the due dates) \nReading every week that redefines \"optional\"\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "April 20, 2014",
            "review_content": "\nIt bewilders me how this class comes with a silver star.\nLecture material is a restatement of the obvious, plus perhaps one or two interesting nuggets, spread across 75 minutes. \nMy biggest gripe is probably how disorganised his exams were. The semester began with the syllabus promising two take-home midterms and a final that was either take-home or in-class. Midway through the semester, Gertzog decides to swap the second mid-term to a term paper dealing with two bills. A week later, he changes it to one bill. \nTwo weeks before final, nobody has any idea if it'll be a take-home or an in-class. \nTAs in this class weren't very helpful and very little feedback is offered, even when solicited. \nWhile this may not be a terrible class, it's very disorganised and does little for you. Skip unless you have to. \nWorkload:\nNo homework. Number of exams and their format depends on Gertzog's mood, which varies from one week to the next.\nGertzog assigns 5-6 books at the start of the semester, but there's no need to read all of them. \n\n"
        },
        {
            "course_name": "American Politics Seminar: Issues that Divide America",
            "review_date": "May 19, 2005",
            "review_content": "\nProfessor Gertzog is able to initiate discussion well - students do the majority of the talking during this class. Gertzog is extremely intelligent, and has a firm grasp of the material. He was able to answer virtually every question posed and had great knowledge of dates/court cases. The majority of the readings are worthwhile, though the topics will seem repetitive by the end. Term paper topics are flexible.\nWorkload:\n25 page term paper, weekly emails about the readings, presentation on research for paper, 150-300 pages of reading per week (but for only 10 weeks, the last four weeks are dedicated to the presentations)\n"
        },
        {
            "course_name": "American Politics Seminar: Issues that Divide America",
            "review_date": "May 31, 2003",
            "review_content": "\nI would say Gertzog falls somewhere in between what others have written.  He's not the worst professor at Columbia, but he's not nearly as incredible as others have made him out to be.  \nThis seminar focuses on social movement theory and social movements that formed around the issues (which are abolition, prohibition, and abortion).  The classes consisted of him reading discussion questions students had written about the readings and the class discussing them.  He does not do much to structure the classes beyond picking which questions he reads.  The last month or so of the course is devoted to the presentations, which means there is no reading.\nWorkload:\nWeekly discussion questions based on the readings, a term paper (which can be however long you want, but he suggests 25-50 pages), and a presentation based on your term paper.\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "April 15, 2002",
            "review_content": "\nI find all of the reviews listed above to be a bit extreme. If you're new to the study of American politics, Gertzog's Congress class is a fine choice, as evidenced by the considerable number of students who endorse it. But if you followed politics fairly closely in high school, you're likely to find his lectures interminably boring, as I did. Each lecture consists of a laundry list of obvious observations about the nature of the legislative process and are usually devoid of any interesting insights. The class isn't without merit for the experienced: the take home tests are both fairly easy, and one can learn a fair bit from them if you take them seriously. I don't regret taking the course, but overall it was a disappointing experience.\nWorkload:\n3 take home tests consisting of two 5 page papers each. Fairly extensive reading, but you don't have to do most of it to score A's on the tests.\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "November 11, 2001",
            "review_content": "\nA must have?? Please... this class single-handedly killed my desire to be a political science major. I came into Gertzog's class first semester of my freshman year, hoping to be inspired, challenged, etc. Instead, I think my knowledge of Congress regressed. One of our take home essays was based on his book, Congressional Women. By that point, I had realized what total BS the course was, so I didn't even bother to open the book. So I wrote ten pages of utter crap, making up facts and quotes left and right, and received an A+. The other people in the class likewise received A's for similar effort. The class itself is atrocious - our class only had 12 students, most of whom read papers or slept through class, but Gertzog either didn't notice or didn't care. The other two reviews blow my mind (although Gertzog is indeed a teddybear); however, I was similarly amazed by how much my classmates prasied Gertzog once they received their A's. Ugh.\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "December 31, 1999",
            "review_content": "\nGertzog is a teddy bear of a man and a very good professor. He is the only professor I have had over 70 years old who wears sunglasses in class everyday. He is incredibly knowledgable about congress (he can name every senator since 1900 and about two-thirds of the House; he knows a lot of them personally). He knows a lot of stories and shares all he can with the class. He doesn't mind diverting from the syllabus and talking about whatever the class is interested in. He never was asked a question about congress that he couldn't answer. His specialty is women in congress (he has several books about them) and really gives a good overview of congressional proceedings. Definitely recommended.\nWorkload:\n2 midterms and a final (all takehome!). The questions were actually very interesting (theoretical scandals and if you were running... type essays).\n"
        },
        {
            "course_name": "The American Congress",
            "review_date": "December 31, 1999",
            "review_content": "\nGertzog should be on everyone's \"must have\" list. Engaging and thoroughly knowledgable of the subject matter, he is a consummate authority on Congress. Fair and responsive to questions, students feel they are part of the learning process. A seasoned prof, he brings both and vitality to the subject. No stress.\nWorkload:\nReadings are extensive (espcially related, but optional). However his focus is on the main issues. Come to class, do the required readings and an A is almost certain (3 papers-all take home/challenging but fair).\n"
        }
    ]
}