{
    "prof_info": [
        {
            "prof_name": "Edward Mendelson",
            "prof_id": 779,
            "total_reviews": 57
        }
    ],
    "reviews": [
        {
            "course_name": "Lit Hum and British Lit. 1832-1900",
            "review_date": "December 21, 2016",
            "review_content": "\nReviewing for Lit Hum: I love Professor Mendelson. He is extremely bright, and his brilliant ideas are great. I don't care much for the Core, but I did my work for class (when I easily could have gotten away without doing anything) because I absolutely loved having discussions with this man. He is genuinely caring, and try not to be put off if he doesn't remember your name! He holds to his ideals and is a brilliant, brilliant person. You will be lucky just to have one conversation with him, let alone an entire year of classes. He teaches you to write, and he's so good at what he does. I felt inspired just by being around him. Seriously, seriously my favorite. \nWorkload:\nmuch lighter, but do the work! You will learn so much and grow a lot with this Professor if you put in the effort--and it is worth it! \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 10, 2016",
            "review_content": "\nLet's be honest, you're only on here to find if his class is an easy A. If you complete the two papers and show up to class, you'll get an A.\nWorkload:\nTwo papers (no more than 1500 words).\nMidterm and final which he designs himself, not the one the rest of the class takes.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 20, 2016",
            "review_content": "\nI have so much respect for Professor Mendelson that I feel wrong writing this review. A man of this much track record, the subsequent reviews, and natural charisma doesn’t need valuation. Just take his class, get an A, and leave a changed human.\nOh and one thing – Mendelson’s a natural savage. He doesn’t care about the little things. It’s the big things (how to be human; how to live life) that he’s interested in. Don’t waste your time brooding over whether he likes you as a person. He’s wiser than that – he’ll see through you. He only cares that you’re getting something out of this class – after all, a man of his success doesn’t need to be teaching freshmen. He’s there because he chose to be there. Just focus on what you can do as a student to best learn from the man. \nOne caveat – that said, don’t take this class as a joke. I’m not saying it’s a tough class. It’s not. But it is going to be tough if you don’t enter the classroom with an open mind, ready to learn. Put in the effort but not that of brute force. Put your effort into answering the questions that genuinely interest you. If you’re the type that thinks you know all the answers to life, well you’re 18/19 my lad, it’s about time you get off your high horse. \nTrust the man, and he’ll trust you back with his wisdom.  \n\nWorkload:\nLight - have some thing genuinely interesting to say. If you don't have anything to say, don't say it. No one wants their time wasted.\nNo midterm.\n1 hour final - listen to the man in class. Take notes on the things that interest him and the class, and the quotes. You do that and you won't have to prepare for the test.\n"
        },
        {
            "course_name": "Yeats, Eliot, Auden",
            "review_date": "May 28, 2016",
            "review_content": "\n\nThe MOST boring class you'll ever take. Sure he's easy but you're also wasting your time. He takes attendance because he knows no one would even show up otherwise. The things he says will make you wonder if he's actually lost it. The only reason students take this course is because it's easy. He puts in very little effort into this class, making the same exact remarks and lame jokes day after day and reading out loud passages that were assigned. The only assignments you hand in are 3 very short responses written in a way he WANTS you to write. He literally gives a paper with instructions on how to begin and write your \"paper\". Then he complains about reading those \"papers\" but really his TAs read and grade the assignments who also think this class is a joke. \nYOU WILL FALL ASLEEP.      \nWorkload:\nalmost nothing. 3 very short papers. A take-home final similar to the assignments where you must write according to the given formula.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 19, 2015",
            "review_content": "\nEdward Mendelson is a professor who truly cares about his students. Aside from providing fresh apples every Thursday, he takes the time make a connection with each student. He has some very interesting things to say and he enjoys a class that is able to make meaningful additions to the discussions. He makes you want to try in his class, and he grades very generously.\nWorkload:\nJust have something interesting to say about each book we read and you'll do great.\nThere is NO MIDTERM! And one very easy-going 1 hour final. \n"
        },
        {
            "course_name": "Yeats, Eliot, Auden",
            "review_date": "May 16, 2015",
            "review_content": "\nI was so excited for this class but all that ever happened was Mendelson reading out loud some of the assigned poems and rephrasing what is going on and I battling to stay awake. He also made it clear in class that he doesn't care about what students write in the course evaluations. So be warned, it is a boring class where he doesn't interpret the poems and instead, along with the TAs, grades the papers harshly if you interpret the poems yourself. You have to write the papers as he insists. It is not a college course with any intellectual discussion going on in the class. I would not recommend it to my friends so you take heed!  \nWorkload:\n3 short papers arbitrarily graded by TAs and a take-home final answering 6 out of 10 questions with a paragraph each. \n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "August 22, 2013",
            "review_content": "\nThis class really left something to be desired. I can't speak for his other classes (Lit Hum in particular), but I did not find Mendelson to be a very interesting or engaging lecturer. What an incredible reading list -- I'm not even really into modern lit (I prefer older stuff), but there were some great texts on the syllabus, plus a good mix of poetry and prose. What a disappointment this class was. I really wanted to love this class, and him, but I just couldn't. And quite frankly, I don't know what the big deal is with him. I'm sure he knows his material, but he sure as hell didn't show that he knows it.\nHis lectures were pretty surface level, and I never felt like we really got into the texts. There was pretty little incentive to do the reading, show up to class, or put in any effort into this class whatsoever after like, the first two or three weeks. His quirks are interesting, funny at first. But they get old really quickly. I don't care who wears a baseball cap in class, who uses a phone or a laptop, or who (ffs!) spills coffee on accident or comes in late. No need to address each of these people personally. It's a completely waste of time. God forbid someone spills her coffee in NoCo 501 and some people next to her help clean it up. No need to stop your lecture so you can ask this person what's wrong, and then offer to come and help her clean up her coffee. That's not even funny.\nI would forgive these quirks if I felt like his lectures were really insightful or engaging (but let's face it, if they were, he wouldn't be stopping them every 5 minutes). The reviewer from 2006 got it right when s/he wrote: What? I must be dreaming, because I know I didn't just spend my 9 ams on Monday and Wednesday attending a glorified season of Reading Rainbow. (In fact, go back and read reviews from like 06 and 03 -- that's how I felt about Mendelson. Can't figure out if he's regressed or something because the most recent reviews make him sound like God. I particularly like the review_dated Nov. 19, 2003.)\nExcept in my case, it was Tuesday/Thursday at 10 in Noco. His lectures are painful. He goes through the text line by line and explains it. There's barely any analysis -- he just tells you what happens and then doesn't analyze it, talk about themes, etc. He constantly also says that what he says is unimportant because he has no way of knowing what the writers were really thinking, and keeps asking if we understand what he's saying. \nI'd have to agree with all the reviewers who said that Mendelson thinks his students are idiots. He takes attendance in a lecture, for Christ's sake. So you can't even skip the horrendous lectures. There were days I would go to sign the attendance sheet and then leave. He also INSISTS that all papers should begin with a quote and then an analysis of that quote and then get into the larger picture. I'm all for skipping the useless intro and getting right into what you want to say, but teaching students how to write better isn't as simple as giving them a formula on the back of the syllabus and asking them to follow it. Everyone has his/her own style and the best profs are the ones who give tailored advice on how to improve what you have. \nAlso, he complains all the time about grading and has repeatedly said in lecture that we should all write good papers and follow the instructions so it's easier for him to grade, since good papers are easier to grade than bad papers. Then we get our papers back and it turns out some random TAs that we lay our eyes on maybe once on the first day of class did ALL the grading (which is pretty arbitrary). \nThe one good thing about this class is that it's ridiculously easy. He says in lecture repeatedly that he sees grades like swim times... only your best time (or grade) counts. Also, his class is so poorly run that if he gave out bad grades I'm sure people would like him a whole lot less.\nTL DR - This class is a total waste of time. It's really only good if you want a grade boost, since you don't even really have the option of doing all the reading on your own and skipping the painful painful lectures, but then you have to sit through all the lectures without any electronics. I don't get what the fuss is about Mendelson but I certainly won't ever take another class with him.\nWorkload:\n3 600-800 word \"papers\", plus one final. \nThe final is a bunch of IDs plus an essay. The essay is ridiculously easy if you have done any reading whatsoever, and he acknowledges that (it's just to check if you've done your reading! if you have a brain and you're not asleep you can think of something to say! blah blah)\nThe IDs were hard for me because I didn't do all the reading/didn't read that carefully. But it didn't even matter that I probably got a bunch of them wrong.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 04, 2012",
            "review_content": "\nWhat does it take to get a gold nugget? If there's anyone who truly deserves one, it's Professor Mendelson.\nI don't think a review can possibly express how great of a professor he really is. His class will make you think of the world in a way that you probably never did before. With his years of experience at Columbia, he knows what he's talking about. If you happen to be in his class, consider yourself to be amongst the luckiest of freshman at Columbia. It is classes like these that you will be constantly reminded of, mainly because of how much you genuinely learn about individuality and how the world works in general.\nAt the beginning of the semester, Mendelson assures his students that his section of LitHum will be a completely low-stress section. His reason being that he believes that in doing so, it allows the students to feel more comfortable in class, which in turn results in clearer thinking. Coming into the class, I didn't know how well it would work, since it allowed those students who didn't want to do a lot of the reading an opportunity to slack off. However, in the end, it proved to be an effective method of fostering a highly efficient academic environment.\nTop top it all off, not only is he (arguably) the best professor you can find for LitHum, but he is also a pretty lenient grader. He usually assigns two (arbitrarily unimportant) grades: one each for ideas and writing, the latter of which he'll probably rip apart most students for. However, he does this because he truly understands how one needs to write to effectively get their ideas across to their audience, whomever they may be.\nGet ready for a great year with him!\nWorkload:\nNot much, just reading the books\n"
        },
        {
            "course_name": "Virginia Woolf",
            "review_date": "December 24, 2011",
            "review_content": "\nEdward Mendelson is one of the smartest people I have ever met. He did an excellent job unpacking the dense works of Woolf in a funny and careful manner. He really REALLY knows what he's talking about and really cares about the class and his students. At first I hated him and thought he was a total jackass but I slowly realized the reality in his many claims. You have to read all of the books and he takes attendance but if you do go to class and do actually read the works you will be so, so happy you did. Take a class with Mendelson and you won't regret it. \nWorkload:\nThree papers and final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 14, 2011",
            "review_content": "\nEdward Mendelson is undoubtedly one of the best Lit Hum professors you could get, if not the best. You get the best of both worlds: his insights into the books are fantastic, and he's a completely reasonable, understanding person (i.e., he is an easy professor). Mendelson wants you above all to think--he won't take any bullshit (anything you say in class should be grounded in the text), and he wants you to think of things that are actually interesting. If you haven't already, do yourself a favor and google him. You'll quickly discover (by the length of his wikipedia page and the many books he's published) that Mendelson is quite famous. The fact that he's teaching a core class to freshmen when he could be doing whatever the hell wanted (publishing more books, teaching grad students, etc), says a lot about how much he cares about his students.\nYou might be intimidated by his first e-mail and your first class. (I think the e-mail forbade laptops, food, giving yourself intellectual authority by categorizing yourself, etc.) I definitely was. But in reality, he's the most understanding professor I've ever had, or ever will have. Need a few day's extra to finish that no-longer-than-1000-word-essay? No problem. Need to miss a class? No worries at all.\nIf you're lucky enough to be placed into section, do NOT switch sections. Compared to other sections, you will not sweat. Mendelson doesn't exactly hold you accountable for the work; rather, he makes classes genuinely interesting so you want to do the work in order to engage in discussion and critical thinking. Sure, there were times when probably two people did the reading--I think Don Quixote was the worst--but Mendelson totally understands how stressed your life can be and doesn't take it personally (like other professors often do). As other reviewers have said, he wants you to read because the books are genuinely interesting--not because they're part of some curriculum.\nWhere is his gold nugget? This man is the nicest, most understanding, easiest, most fascinating professor (throw in as many great superlatives as you want) to teach the core. More importantly, though, he made me think.\nWorkload:\nAbout a book per week like most sections, though he does frequently trim the amount of reading you have to do for a book (Herodotus' Histories), or he decides to get rid of entire books (i.e., Boccaccio's Decameron), or he substitutes a shorter book for a longer one (i.e., Notes from Underground instead of Crime and Punishment).\nNo midterm a 1-hour stress-free final. Fucking amazing compared to ANY other section. Plus two 1000-word essays, in which he wants concise and simple writing (for example, he crossed out the word \"attempt\" in my first paper and wrote \"try\" above it).\nIt's pretty easy to get an \"A\" in his class; once you figure out what he wants and make genuinely illuminating insights into the books in class and in your papers, you can even get an \"A+\" in the class.\n"
        },
        {
            "course_name": "Modern Poetry II",
            "review_date": "May 13, 2011",
            "review_content": "\nThe indignant review_dated 5 September 2009 has it pretty much right: this is your only chance to study Auden with Auden's foremost scholar, and is worth taking for that reason if no other. Even more, though, Mendelson is a fantastic teacher, passionate and (usually) very articulate about all three poets. I've come away from this class with a totally different conception of modern verse (or at least the narrow slice of it we studied).\nAs for the infamous laundry list of proscribed objects and behaviors? The point is that Mendelson wants to be able to make eye contact with everyone in the room while he's lecturing, to watch how people react to the things he says. He's one of the few instructors I've had that actually responded to people's expressions of puzzlement or disapproval, and the only one I've had that made a 70-person class feel like an intimate personal discussion.\nIn short, take this class.\nWorkload:\nLight. Reasonable reading each week, three essays graded forgivingly, straightforward final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 28, 2011",
            "review_content": "\nIf you are lucky enough to get randomly assigned into Edward Mendelson's Lit Hum section, don't be intimidated by the first class. You quickly learn to like him and realize that he's actually kind of amazing. He is really everything you look for in a Lit Hum Professor. He's ridiculously well read, he's engaging and most of all he's very supportive. Our classes on To the Lighthouse and the Bible especially interesting because he just knows so much about them. He made me love the books that he loves. He has very specific requirements for how to write his papers that can be frustrating at times, which he understands so he encourages everyone to come to office hours. \nHis class is all about discussion. He assumes that you've read the book so you spend very little time going over plot. He's only interested in talking about the bigger (often very abstract) ideas in each book. He's loves hearing your interpretation, though he's not afraid to tell you that he thinks its wrong or that you're \"reaching\" as he calls it. But if you're point is interesting, he'll continue to talk about it and turn it into a much more sophisticated point that you had originally intended. It's also not hard to get away with not finishing all the reading. The few times he noticed that no one had finished the reading, he didn't seem to care that much. He wants you to read the books not because they're required but because they're worth reading. \n\nMendelson seems like the stereotypical pretentious professor, but he's not and he acknowledges when he's being like that. He's not afraid to say something controversial and regularly does (sometimes with his favorite \"irony light\" on). He also is open about the problems with the Lit Hum syllabus. We would spend a chunk of class talking about them towards the end of the semester. Sometime in the semester you'll realize that the majority of the stuff  he talks about are his own ideas, and that other professor actually reference him. Oh and he brings you apples every Thursday and jokes about how the apple you pick says something about you. \nWorkload:\nLight compared to other sections\nReading: Around a book every week. He doesn't think there's a point to assigning you more than you will actually read, so he often cuts down the reading from the official reading list to make sure we have real discussions in class. He will also replace a longer book with a shorter one he likes more.  \nPapers: Two paragraphs in the first few weeks + two papers for the first semester and just two papers for the second semester. The papers are supposed to be somewhere between 1000-1500 words, but he honestly doesn't care if they're well done but on the short side. He rip your paper apart, but he wants to help you improve your writing. \nExams: No midterm (!) and a super easy one hour final\nBasically, he doesn't care about grades. He just wants to learn. \n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "January 10, 2010",
            "review_content": "\nI loved this class. The syallabus is about half poetry half prose, though it seems clear that Mendelson is more interested in the poetry. Prof. Mendelson has a wonderful speaking voice, and is a great lecturer. I think he gives immensely valuable insight into all of the works, and is great at putting things into perspective. He is also very accessible for office hours, and is super nice and helpful in them. You can tell that this guy is ultra smart.\nA few words of warning, however. Mendelson is very picky about weird things, especially with respect to writing style. Some reviewers apparently don't like Mendelson for this, and I'll admit he does occasionally come off as being a bit pompous. Mendelson is the only professor I've ever had who did not like my writing style, and I'll admit it hurt at first, but you just have to realize he's just picky and try to fix it. That being said, he really wants to give you a good grade, provided you do the work. You can get an A in this class easily as long as you read the books and put a little thought behind your papers (I did, even though I routinely got A for content, B for style on my papers). Paper due dates are VERY loose. He really does not care if you turn your paper in a little late, as long as its good. He'd rather have a good paper than a late paper. Despite this, he is extremely strict in class. If you even look like you are talking to your neighbor or texting, he will call you out immediately. You are also not allowed to wear hats or have laptops. All of this is, I believe, to prevent him from getting distracted. Finally, the last and most important warning, GO TO CLASS! He sends around an attendance sheet maybe 75% of the time (the other 25% is only because he forgets). If you consistently don't come to class he will either deregister you or fail you, depending on how late in the semester it is. I actually witnessed him verbally failing some poor kid who I guess decided to start going to class 2/3 of the way into the semester. That being said, he will give you a little wiggle room for illness etc. I missed 4 classes for no reason and still got an A.\nOverall, I loved the class. Lectures were interesting and workload was not terrible. I took this class for fun (I'm a senior science major) and am immensely glad I did, and not just because of the nice GPA boost.\nWorkload:\nnot too bad. The novel readings are heavy, poetry readings aren't too bad. The books are good so I didn't mind. 3 papers, 600-800 words (900 max), one final which was ridiculously easy, only exists to ensure you read all the books and payed attention in lecture.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 07, 2010",
            "review_content": "\nI was scared out of my mind when Professor Mendelson sent us the syllabus for our fall section of Lit Hum and a third of the second page of the PDF was taken up by a list of things he does not allow in class (e.g. electronics of any kind, eating, wearing hats). But it turns out that the list of things he does allow is much longer and far outweighs the first list: toward the end of the semester he brought in a bag of apples to pass around almost every class; he doesn't get all that mad if you fall asleep (discreetly) during a lecture once in a while; he doesn't really mind if you turn in a paper a few days late; and by the end of the term it was clear that he knew and didn't really care that not everyone had done all of the reading all the time.\nAll in all, Professor Mendelson is amazing.\nDefinitely do not be scared of him (though his booming voice and wild gesticulating can sometimes make him seem like someone to be intimidated by) but keep in mind that he is not a pushover. He was the only professor I had this semester that wasn't completely full of shit â€” after handing our first papers back to us, he went on for about ten minutes about how they were all bullshit (not his words) and that next time we should all strive to write about something real, something we actually care about, \"something someone would ACTUALLY WANT to read,\" as he said. He told us he doesn't read the teacher evaluations we have to fill out, \"because it is insulting for you to have to fill them out, and insulting for me to read them.\" He deals with obnoxious people in class in a satisfying way, because while he doesn't completely shut them down, he shuts them up relatively quickly so discussion can continue. I actually came to respect Mendelson as a person, not only a professor.\nHe was also the only professor I had this semester (and probably the only one I'll ever have) who told us to not stress about the class AND ALSO actually conducted the course in a way which made this possible (an unprecedented combination for me). The last week of class, he told us continually to not stress about the final, and lo and behold, the heading of our final was \"Lit Hum Final Exam: Now with reduced anxiety!\" He told us an hour into the final that we should be finishing up at that point, which most of us were actually doing.\nIt's really not difficult to get an A. But you'll get a lot more out of the class if you make an effort to read at least some of all the texts, and pay attention to what he says about them during class. His lectures, responses to questions, and input into the discussion are usually pretty interesting. He's extremely intelligent and yet unpretentious, another unprecedented combination for me. Professor Mendelson is great; I think our class was unanimous on this.\nWorkload:\nMake a vague effort to do at least some of the reading. Show up to class. Two papers and a final, but don't worry about them. You'll do fine if he knows you're a capable student and are putting in some amount of effort.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 28, 2009",
            "review_content": "\nProfessor mendelson is fun and laid back. He makes sure that the class causes us as little stress and possible. The discussions are interesting but he tends to stare at you when you make comments in class. He really cares about his students and is always available during his office hours. He even brings apples for the whole class for more than 50% of all the classes. He has a different reading list so make sure you don't buy your books from the library boxed sets. Make sure you put effort into the essays and cut out all the fluff. He wants insightful and concise writing. You will enjoy lit hum if you are lucky enough to get him.\nWorkload:\nlight, 2 essays and a short, easy final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 18, 2009",
            "review_content": "\nGreat, Great professor. He can be very stream of conscious-like but he's always really energetic. Don't be intimidated by his syllabus, he's a lot nicer than he sounds on paper. He understands the failings of the core and isn't afraid to talk about them. You may read a little more than the other sections, but overall you do so much less work. You'll definitely hear a lot of things over and over from him but eventually it becomes endearing (hopefully). His a bit of a demanding grader but if you are concise he'll definitely grade you well. Hope you like apples cause he brings them to every class! Seriously.\nWorkload:\nWay less than average. Two essays of 1,000 - 1,500 words or less. No midterm, one hour long final with 10 IDs and one 3 paragraph essay.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "September 05, 2009",
            "review_content": "\nFrom Dissent: \"No one is better acquainted with Audenâ€™s papers than Mendelson, who was a graduate student at Yale when he first met Auden in 1970. (Auden appointed him executor in 1972 after Mendelson used his cache of copies of Audenâ€™s work to help the poet assemble a collection of prose, Forewords and Afterwords.)\" I'll explain: \nAround 1970, the elderly WH Auden, who was, after Eliot, the most influential 20th century British poet, unable to find copies of his early work, discovered that a Yale grad student had collected them. Auden made a bold decision. He invited the young man to hang out with him and his ancient, drunken, famous poet friends, answered all his questions, and made the kid his literary executor, his literary heir. It's forty years later. Auden (b. 1907) and his modernist generation have been gone for thirty years, and only Ed Mendelson, himself now in his sixties, can write of the great English modernist poets from first hand knowledge. He is acknowledged as their finest interpreter, and our last living link to them.  Does that fact appear anywhere in these reviews? What does?  He won't let you wear your baseball cap in class. And this site dares to call itself \"professorial ability?\" You're evaluating yourselves, and with terrible clarity.  \n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "May 12, 2009",
            "review_content": "\nIt's not that he's a bad teacher--he's not.  But the entire class is based solely on his interpretations of Auden, Eliot and Yeats.  He complains about how \"typical English classes\" are run, and insists that to read your own personal experiences in the poetry is arrogant, and forces you to look at what the poem itself is saying.  This isn't a bad method, but the constant mocking of this not-preferred poetry analysis method wears thin, as does his constant repetition of the same stories and analogies from January to May: the \"weird Goth student\" who always sat in the back that he looked up on Facebook, the previous student who asked stupid questions, the outraged student.  In fact, he almost seemed a bit disappointed that no one in the class was able to provide him with new fodder. \nThe class itself breaks down into about four weeks of Yeats, three weeks of Eliot, and six weeks of Auden.  It feels unbalanced, and once you're aware that Auden is his specialty, it does make more sense, in a way.\nIf you like reading poetry, you'll like the class. You'll be bored at 9:10 in the morning (though he's always late) and frustrated that you can't bring a laptop, but your homework is reading three really great poets, so it's worth it.  Just don't expect Professor Mendelson to suddenly light up the world of understanding poetry for you--as he'll tell you, he doesn't think one is meant to find the Great Truth in poetry.\nWorkload:\nThree 800 word papers, one for each author, that start analyzing a line or two from a poem from the assigned author and then moving out to a macroscopic scale. No midterm. One final, with a required minimum twelve-line poem for it. \n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "March 24, 2009",
            "review_content": "\nJudging from my own experience and the other reviews of this and Mendelson's other classes, he should stop teaching it. I took this class after reading all of the other sparkling reviews about how EM is such a great guy and loves to give As. The class is easy and the reading is light, true, but it's also horrifically boring. Even EM knows he's boring! (He mentioned at the beginning of the semester that he'd try to open the floor for questions at the end of each class because our attention would start to wane.) \nI can also believe and agree with the comments I've read about EM considering his undergrad students to be idiots. I agree, it's a little depressing to hear a student fumble through a question with a lot of 'um's and 'uh's, but EM can be really harsh in response. (For example, shouting \"PROJECT!\" at every meek female in the class doesn't encourage many others to ask questions. Also, pointing out that the answer to a question is \"Obvious\" or \"Silly\" doesn't make for much conversation.) Finally, his tangents (due to poor lesson planning or forgetting to bring his book) often make him hard to follow or even incomprehensible.\nI think what bothered me most was that Mendelson's style of teaching is so opinionated and biased that he doesn't leave any room for his students to question him.\nNot at all the gold nugget I'd been hoping for. =/\nWorkload:\n3 very brief papers and a final. Lax grading. No laptops. (just frustrating). Early morning and boring as hell.\n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "November 02, 2007",
            "review_content": "\nEdward Mendelson is one of my favorite professors for many reasons.  One of the most superficial is his deep voice.  Surprising but nice.  \nIn any case, Mendelson is incredibly intelligent, passionate and creative.  His ideas are creative.  \nI also really appreciate how much he loves literature.  He really opened my eyes to Virginia Woolf, teaching you how to read her and I am so thankful.  He is absolutely right when he says that if someone doesn't like V Woolf the fault lies with them.  I would recommend this class to anyone who intends to actually read the books assigned.  \nI could really gush about how fantastic he is and how i am disappointed that i can't take another class with him...but no one wants to read that.  It sounds silly to say that he taught me a lot about morality and life, but he did, and I have never be prouder than when he graded my paper and i got an A.  \nTAKE HIS CLASS AND DO THE READING!\nWorkload:\n3 papers (no more than 900 words) that really help you to dive into the books and wrestle with them.  They may be short, but don't expect and easy A.\nfinal that was ridiculously easy.  Do expect an easy A on the final and chances are you can get an A for the class as long as you get an A on one paper.  \n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "August 31, 2007",
            "review_content": "\nAfter taking these two courses I seriously considered switching my major to English. While figuring out how his TA's grade took me a bit of time, taking his classes actually inproved my writing considerably. Three papers at no more than 900 words will teach you how to write exactly what you are trying to get across. I highly recommend going to his office hours because that is where you will get to see the more relaxed side of him and will learn a lot. You should definitely take a class with him before you graduate. \nWorkload:\naround a book a week, 3 papers at no more than 900 words, easy final.\n"
        },
        {
            "course_name": "Virginia Woolf",
            "review_date": "April 07, 2007",
            "review_content": "\nI like Professor Mendelson. He's funny, knows his stuff, and takes no BS. So far, so good. But in this semester he has missed two classes, with no making up. Is this what I'm paying thousands of dollars for?!? We're already \"doing\" a book per class some weeks, so I feel a little cheated. \nWorkload:\nThree papers where Prof. Mendelson does not want his views from class regurgitated on the page, plus final exam. \n"
        },
        {
            "course_name": "Virginia Woolf",
            "review_date": "March 22, 2007",
            "review_content": "\nFor me, the jury is still out on Virginia Woolf - but then, as Prof. Mendelson will tell you, if you have a problem with VW the problem is actually with you. However, this lovely man is making an otherwise crappy semester worthwhile.\nProf. Mendelson is quirky, he's funny, and he's certainly different. But most importantly, he's a grown-up, with wonderful advice for those of us too young to have done any real living yet. \n\"Avoid mentors at all costs!\" ... \"Self-esteem comes only though accomplishment!\"\nEveryone at Columbia should take one of Prof. Mendelson's classes, if just to knock some of the bullsh*t out of them. \nHe's a star. \nWorkload:\nDo the reading! A couple of papers, the possibility of quizzes, plus a final exam.\n"
        },
        {
            "course_name": "Virginia Woolf",
            "review_date": "March 22, 2007",
            "review_content": "\nFor me, the jury is still out on Virginia Woolf - but then, as Prof. Mendelson will tell you, if you have a problem with VW the problem is actually with you. However, this lovely man is making an otherwise crappy semester worthwhile.\nProf. Mendelson is quirky, he's funny, and he's certainly different. But most importantly, he's a grown-up, with wonderful advice for those of us too young to have done any real living yet. \n\"Avoid mentors at all costs!\" ... \"Self-esteem comes only though accomplishment!\"\nEveryone at Columbia should take one of Prof. Mendelson's classes, if just to knock some of the bullsh*t out of them. \nHe's a star. \nWorkload:\nDo the reading! A couple of papers, the possibility of quizzes, plus a final exam.\n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "January 13, 2007",
            "review_content": "\nMy favorite class for the semester I had him. Very knowledgable, slightly quirky--how I like my professors. My AP English from h.s. had him when she was at Columbia. We both found him adorable. Yes, you have to read the books (it is slightly daunting when you're encountering Joyce for the first time). He has his moments of spewing funny quotes. Warning: turn off cell phone and watch alarms, and don't talk to your neighbor (not even passing notes) while he's lecturing. He'll give you the evil eye if a cell phone goes off, or if he catches you not giving him your attention. I loved the class (despite the early time). He counts attendance and your highest grade for your final grade. For response papers, just grab onto something he said and expand, show more evidence that he is right. Note: don't write 'on closer inspection', and 'at first glance', or 'it seems to me' on your resposne papers or on the final.\nWorkload:\nModerate-Heavy reading (when dealing with the novels, the poems were an easy breeze), three response papers (no intro, no conclusion, just start interpreting and analyzing! Oh yeah, if it's over 900 words, you fail.), final (easy if you've worked and attended classes). no midterm.\n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "January 11, 2007",
            "review_content": "\nYou'll quickly notice that Mendelson's grudge against ignorant, lazy undergrads and his generally prickly, feisty attitude. That said, he relaxed over time. Also, when's he's not complaining about inane paper-writing, his observations and analyses of the texts are usually quite intelligent. Plus, one can't complain about the reading - Yeats, Eliot, Hardy, Wilde, Woolf, Wells, Auden.\nI wouldn't take another course with him, but I don't regret taking this one. Perhaps a seminar with him would be better.\nWorkload:\nthree short papers. the final was literally a joke (really, laughter and good feelings were shared)\n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "January 08, 2007",
            "review_content": "\nThe reviews on CULPA made me really excited about this class...but there are better English teachers around.  Yes, hes interesting and all...but its nothing special.  The TA also randomly grades...sometimes its fair...sometimes its not.  its an ok class...dont expect to be inspired or anything though\nWorkload:\n3 papers...flexible deadlines...decent load of rading (about a book or 15-20 poems every weeks).  Very managable\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "December 17, 2006",
            "review_content": "\nGreat class to take if you are not a strong english student and need to fulfil the Barnard Literature Requirement.  Mandatory attendance for 9 AM class but he is very entertaining.  Also, you read all those novels that you are suppose to have read -- Mrs. Dalloway, Tess of the D'Urbervilles, A Portrait of an Artist as a Young Man, The Importance of Being Earnest, etc.\nWorkload:\nVery accomodating grading.  Whatever you do best on [whether it be one of three 2 page papers or the final] is your grade.\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "December 11, 2006",
            "review_content": "\nIt's 9 AM mandatory attendence but... your highest grade on any assignment is your grade for the semester.  Take this class!  It also fulfills the Barnard Literature Requirement.\nWorkload:\n3 short papers (2-3 pages) and a final.\n"
        },
        {
            "course_name": "20th Century Poetry",
            "review_date": "May 31, 2006",
            "review_content": "\nWhat?  I must be dreaming, because I know I didn't just spend my 9 ams on Monday and Wednesday attending a glorified season of Reading Rainbow.\nAlas, it is no dream.  I actually did trek to Hamilton at 9 in the morning to hear Mendelson read aloud the poems on the reading list and do little else.  Whenever the one person in the class who still thought Mendelson was an effective educator asked a reasonable question, he would respond with some strategically dubious, smart-alecky comment about how the poets are (always, but always) ironic and don't actually mean anything they say.  That's fine if they don't, but I couldn't help but feel that it was just something he said to appear in control.\nMost of the time in class, when he isn't reading aloud, he's talking about Joyce's Ulysses.  He has all sorts of antiquated rules such as no hats.  He also takes attendance.  Every day.  It's absurd.\n That said, the poetry you read, for the most part, is awesome.  Although he can ruin some poems, so be prepared in advance if you happy to be a big fan of Yeats, Eliot, and/or Auden.\nThe essays were graded almost haphazardly and there was no correlation between the comments he gave and the grade one received. \nTake this class if you have already read Yeats, Eliot, or Auden and you'll breeze through, except for the waking up and being there every day bit.\nWorkload:\nAn essay for each poet, quizzes which didn't seem to affect grades whatsoever, \n"
        },
        {
            "course_name": "Seminar on Alternatives to Modernism",
            "review_date": "May 30, 2006",
            "review_content": "\nMendelson is a trip. Once I got over how intimidating he came off in the beginning and got a bit more comfortable in his presence, I started to enjoy his class much more. He has his quirks: Do not stutter or say Â“likeÂ” or Â“umÂ” excessively because he will interrupt you and move on. While he does have his somewhat loud and intimidating intellectual side, he is also a very kind, gentle guy. I never went, but I have heard he is very pleasant in office hours. I think he is the kind of professor who likes to meet in office hours so that he feels like he knows you on some kind of level other than the occasional comment in class. At first, I thought he was randomly favoring a couple of people in class but then I realized they were all people who had met with him in his office. After realizing that, I couldnÂ’t be bitter since I hadnÂ’t taken the time to actually go myself. \nIf you tend to read like Vandenburg or have just completed a class with her, avoid her kind of readings in his class. He reads what IS on the pageÂ…not what is not there or what seems to be suggested. I have heard people refer to this as a Â“sixth grade level of reading,Â” but I think it is just a different kind of reading that so many of us have gotten away from. Theoretical readings can be fascinating and eye opening when led by someone knowledgeable enough to back them up. But, a bunch of undergraduates running around talking about theory can get pretty ugly. Do not get me wrong, you cannot just read each text and spit out obvious observations in MendelsonÂ’s class. What you need to do is read each text carefully and make connections based on what IS there. \nBooks include, Secret Agent by Joseph Conrad, Return of the Soldier by Rebecca West, Tono Bungay by HG Wells, Riceyman Steps by Arnold Bennett, and Mrs. Dalloway by Virginia Woolf. There was not much focus on how they all tied together or how they were \"alternatives to modernism\" but discussion was usually interesting nonetheless. \n\nWorkload:\nModerate amount of reading. One 2000-3000 word essay (about 7-9 pages). Participation is crucial (after all it is a seminar). Grading seemed very fair. \n"
        },
        {
            "course_name": "19th Century English Novel",
            "review_date": "January 01, 2006",
            "review_content": "\n1. Take Mendelson when you are a Sophomore, or if you are not an English major. He is good for that point, but after you've taken some more rigorous classes, he will be lost on you.\n2. His reading list is an exercise in the obvious, BUT he genuinely rejuvenates some books (Jane Eyre, Frankenstein) by giving the definitive \"classic\" readings on them. That is, he is not interested in groundbreaking Frankfurt school theory, but he appreciates the books as they are meant to be.\n3. He is a super nice guy, but if you take more than one class with him, you WILL hear the same stories again and that kind of retroactively ruins them.\n4. He thinks that novels are a good way to live and measure your life. I couldn't agree more, and for that, he gets my approval, with all of the above qualifiers. \nWorkload:\n200 pages a week. EASY grader. Standard papers, midterm, and final.\n"
        },
        {
            "course_name": "19th Century English Novel",
            "review_date": "December 01, 2005",
            "review_content": "\nProfessor Mendelson presents himself as a bit of a hard ass in the beginning, but stick with him and you'll see that he really is a really nice guy with a lot of insightful things to say that just has an antipathy for electronics, hats, and stupid questions.  He says that you will be graded on what you do best, and he means it.  He is not a professor whose purpose is to terrorize you into doing well.  Instead, he basically begs you to give him something intersting to read rather than just regurgitating and saying what you think he wants to hear.  I enjoyed his class even though it was a dreadful 9am start.  Mendelson always tried to do his best to keep us all awake and could be surprisingly funny and self depricating at times.  I would recommend him.\nWorkload:\nfairly easy:  two papers and in class final, maybe a quiz or two that doesn't even count toward the grade\n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "October 24, 2005",
            "review_content": "\nI am the 'chuckler' referenced in the entry dated 17 December 2003.  I was absolutely mortified that Mendelson chided me for responding to HIS OWN JOKES in front of the whole class.  I must admit he was delightful when I met with him individually about the matter.\nI completely agree with his assertion that any Columbia student should be able to ask a question that is not peppered with 'like' every second syllable.\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "April 03, 2005",
            "review_content": "\nThe deal with Mendelson is that he has put himself in this weird position where he has to give you an A no matter what.  His teaching is biographical and uninspiring, and consists mainly of him railing against high school, which to him represents what vast social \"nonage must have meant to Kant, and against people who think they're just people from Scarsdale, and against people who think they can improve their sex lives by reading Cosmo.  He also spends a lot of time reminding the class of his rules, which are posted on the back of the course syllabus, and of which there are nearly thrity, and which involve things like not wearing hats and not letting cell phones ring and not bringing laptops to class and not missing class and not talking during class, and lots of other rules he stole from the high schools he so loathes.  And then he assigns papers to be written about short passages of the books assigned.  Think AP commentaries.  So in other words, his class is high school, but weird, meta high school, where the teachers are always making jokes about how worthless high school is, but doing it ironically--except minus the irony.  And then, when you turn in the papers, you find out that they've been graded by TAs that he never told you existed.  And that they grade your AP commentary really obnoxiously--think (\"good--put could you go further?\") and (\"you should call her 'Ms. Kilman' rather than 'Doris.'\")  And then, when you follow the stylistic advice of the first faceless and obnoxious TA, they give your next AP commentary to a different one, who has a different literary vision, but a similar desire to impose it on you.  But here is the beauty of the system: the system doesn't hold.  You can't teach a high school class at a university and spend the bulk of it complaining about high school--you can't have faceless TAs grade silly papers in a manner adherent to very specific but unstated personal guidelines--you can't ask people to show up for the bad 9AM lectures you take attendance for--and then give them Bs.  If you did that, the world would explode, or at least people would stop taking your classes.  And so Mendelson, who, by the way, is very, very nice and gives candy at his really easy exam--gives As!\nWorkload:\n2 papers and a final.  Grueling 9 AM wakeup schedule.  Lax/utterly nonsensical grading.  \n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "January 18, 2005",
            "review_content": "\nMendelson is an energetic and engaging teacher. Especially for a 9am class he can really wake you up with his deep, booming voice or intensive questioning. He has become one of my favorite teachers at school.  There is no bullshitting in this class because he can see through it and will call you out in front of the class. He cares deeply for his students and the subject, is eager to meet outside of class (he is easier to approach one on one), and is highly accomplished and intelligent. The papers were graded fairly. Don't wear a hat to class, click your pen, eat solid food, or say the word \"like\".\nWorkload:\nabout a book a week, sometimes a couple poems. 2 papers and a final that are very open-ended and manageable.\n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "October 10, 2004",
            "review_content": "\nEM is one of the best teachers I've ever had.  Few professors today inspire students to get up at 8, bust out the highlighter, and strain to hear every word spoken in lecture.  In class, Mendelson is brusque -- bullying, even.  Do NOT ask questions unless you want to be slammed up against a wall and feel your guts ripped out.  And then to have your words repeated in a mimicking, high-pitched voice.  But if you catch up with Mendelson on the stairs to ask for clarification, or just listen closely to the self-deprecating jabs that pepper his speech, anyone can see that the guy just wants to be loved.  \nWorkload:\nFine.  Enjoyable.  Remarkably light, considering the prof tries so hard to seem like a hard-a$$.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "August 06, 2004",
            "review_content": "\nI regret having taken this class. The material is narrow and limited for a class entitled \"Modern Poetry\". Though this was intimated in the syllabus Mendelson did not provide the context and richness needed to fully understand the modern movement in poetry. Modern is a movement, part of a progression, not the be-all end-all of poetic expression. Don't ask questions many a person was shamed into silence by asking things which at all challenged Mendelson's views. Go to amazon.com and order yourself some poetry books; you'll learn more.\nWorkload:\nFairly light, inconsistently graded.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "May 22, 2004",
            "review_content": "\nAlthough I loved getting credit for reading beautiful poems, the class itself was a struggle. MW at 9:10 am (and he was often late)?? Mendelsohn goes to the front of the room, makes some weird random introduction to the day's lecture (usually by some off the wall analogy like the vegan macrobiotic restaurant one), and then proceeds to meander around for 1:15 about God knows what....? A recurring complaint was that he doesn't focus on any overarching themes, but merely goes line-by-line through selected poems, which besides being boring, does nothing to help you understand the poet's ideas or themes- therefore I had a hard time having anything to use in the paper, or having any information to use when reading non-microanalyzed poems. Also, he tells people to sit up straight and pay attention (at 9 am!! in a 100 person lecture!) He is a nice guy, but the lectures are painful. He reminded us he was tired every day and that he hadn't prepared a lecture - which I don't particularly mind, but we shouldn't be able to TELL that you don't have anything cohesive to say!!\nthe only 3 poets we did were Yeats, Eliot and Auden. Take from that what you will...\nWorkload:\n2 3-4 page papers (very easy)\n1 final which is not hard, just be able to talk about the themes and recognize passages by each poet (not as hard as you think, they're not very abstract)\nyou do get a grade for doing basically no work, and he's an easy grader, so don't  worry if you do decide to take it - the lectures will kill you though!\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "May 19, 2004",
            "review_content": "\nMendelson's Modern Poetry class is definetly the worst class I have ever taken at Columbia. Mendelson is a generous grader but he is also extremely dull. It would help if he did not think (as, in my opinio, he does) his students were idiots. He shows a clear disinterest and disregard for esthetics/form. He presents the poems as \"windows\" into the biographies of the poets. \nWorkload:\nfairly easy, do the readings... two papers and a final\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "May 10, 2004",
            "review_content": "\nMendelson's class was an experience in boredom. And frustration. Mendelson would drone out his lectures (when he didn't trail off in the middle of sentences) in a an uninspired manner. Questions were apparently welcome, though if your question wasn't up to his standards you ran the risk of snippy comments instead of answers. Seemed nice otherwise... Seriously, this isn't the class to take if you actually like and read poetry. \nWorkload:\nFairly easy, but uninspired and tedious.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "May 08, 2004",
            "review_content": "\nMendelson is an interesting character.  I can't say I didn't like him as a person.  He can come off as gruff and intense to say the least, but in person he is really friendly.  I DO NOT recommend him for poetry, especially at 9am.  Sure, he's knowlegeable about the poetry (or it seemed like it at lease) but the lectures consist entirely of rambling, almost always incoherent diatribes where he reads huge chunks of the poems, says, \"In other words...\" says something random, and then asks (demands of) the class, \"Are you getting my meaning here?\"  He harps on the same themes constantly, and by the end of the semester I was still waiting to actually learn something about Auden beyond what I could have gotten by purchasing a copy of his selected works (edited, of course, by Mendelson himself) and reading them on my own.  I don't know if all poetry classes leave one feeling this dissatisfied, but this one definitely did.  On the other had, the poems were great, and if nothing else I was happy I took the class because I got to read them all.\nWorkload:\nReading a lot of poems by Yeats, Eliot, and Auden.  Two 3-4 page papers (sooo easy) analyzing a poem.  Final (which I haven't taken yet) looks to be hard... you have to memorize an entire poem and recognize poems (author and title).  Oh, and NO midterm.\n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "February 25, 2004",
            "review_content": "\nI missed a lot of the class because of the time but if that had not been the case I would've gone to them all. He's a professor that everyone loves or dislikes--you can't hate the man: unless his ordering you to take off your hat or cell phone bothers the hell out you!\nmendelson is to english literature as latoya jackson is to skany clothes and bad music, i.e. equals.\n\nWorkload:\nnice and light--2 papers and a final--sweeeeet\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "February 15, 2004",
            "review_content": "\nProfessor Mendelson is to modern British literature as LaToya Jackson is to modern British literature.  I can honestly say that MendyÂ’s class was one of the absolute worst I have ever taken at Columbia.  As many of the other reviewers have said, his painful early morning lectures involve little more than loosely paraphrasing the plots of the novels or poetry, sharing a few of the same stupid anecdotes again and again (e.g. his young son attending an awkward junior high dance, or his infamous Â“ScarsdaleÂ” story), pointing out a few passages that he again paraphrases and then drops completely, and picking one or two issues in the literature and beating them into the ground.  Is Tess a free individual, or mererly the subject of the whims of the cosmos?  Gee, I donÂ’t know... but how about we spend three weeks on it!  And of course, no lecture would be complete without Mendelson stopping literally mid-sentence to single out (in front of a room of over one hundred) any student who may be slouching in his chair, tapping her pen, cracking his knuckles, or even laughing a bit too loudly.  Do yourself a favor: read these great books and poety on your own time, and stay as far away from this class as possible... especially if you happen to be from Scarsdale.\nWorkload:\nEmbarrassingly easy, and one of this classÂ’s only perks: a few quick one-page assignments, two 3-4 page papers, and a straightforward final with IDÂ’s and one essay.  Turn in all the annoying Â“intriguing problemÂ” assignments (and he means it when he says he doesnÂ’t even read them) and longer papers and youÂ’ll be fine.  (HeÂ’ll also personally alert the registrar that youÂ’re failing the course if you donÂ’t turn them in, so be warned.)  HeÂ’s also telling the truth when he says he grades you only on what you do well.  I got an A- on the first paper, a B on the second, and left the final knowing I missed half the IDÂ’s... and still got an A for the semester.  Go figure; oh Mendelson.\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "January 27, 2004",
            "review_content": "\nProf. Mendelson is extremely knowledgeable about this subject, and in fact is the executor of Auden's literary estate.  His lectures may sometimes seem rambling, but he usually comes around to making the point.  He is very accomodating with papers and assignments, and ready to help students outside class with preparation and research.\nWorkload:\n2 papers, two 1-page responses, final (no midterm)\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "December 20, 2003",
            "review_content": "\nThe previous reviewer criticizes Prof. Mendelson's lectures as \"moralistic.\"  They are indeed moralistic, which is one of the reasons Mendelson is an excellent professor.  Unlike many humanities professors who seem incapable of forming coherent moral judgements, Mendelson will give his opinion about the moral implications of a work of literature.  His moral judgements are often surprising and challenging, you may not agree with all of them but they certainly deserve to be taken seriously.  In general, Mendelson's views of the literature you study in this course (Hardy, Conrad, Joyce, Woolf, Yeats, Auden, Eliot, Wilde) are nuanced, untraditional and challenging.  His understanding of Auden really seems to be top-rate (he is Auden's literary executor), this was a highlight.  His critique of how poetry is usually taught is both hilarious and right on the mark.  Yeats and Joyce he is perhaps not so strong on, but still very worth listening to.  (The way he teaches Yeats is radically different than how I had been taught Yeats before.  I wasn't entirely convinced of his point of view, but it was completely cogent and very interesting.)\nTwo previous reviewers complained that Mendelson is like a high-school teacher.  There seem to me to be three conclusions that you could draw from this:\n1. They didn't really understand his lectures.\n2. They went to a much better and more interesting high school than I did.\n3.  They were upset that Mendelson didn't indulge in the virtually meaningless post-modern jargon that many humanities profs seem to prefer.\nFrankly, the first explanation seems like the most likely to me.  If you are a rigid thinker, only willing to understand literature in terms of absolutes, his lectures will be of little value; as he once said in reference to a specific point he was making, \"It requires tact to understand this, but that doesn't mean it isn't right.\"  That quote describes most of Mendelson's understanding of literature.  I highly recommend him.\nWorkload:\nNot very heavy.  Significant, but not enormous readings.  Two four page papers and a final.  The grading is relatively easy.  I didn't study at all for the final and did fine.\n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "December 16, 2003",
            "review_content": "\nI must agree with the last reviewer. I still cannot believe how much of a following Mendelson has in this school. His moralistic lectures often put you to sleep at nine in the morning; his reading of the books is shallow enough to make you believe you're back to a high school setting. If you love literature and are serious about analyzing it, please save yourself time and mind and steer away from Mendelson. I should have dropped the class the moment he started analyzing Hardy's Tess D'urbervilles in the following way: Was it Tess's destiny that drove her to ...? Or was it really Tess herself that ...? His lectures mostly consists on superfluous anecdotes, moralizing and paraphrasing novels and poems.  \nWorkload:\ntwo papers & a final\n"
        },
        {
            "course_name": "20th Century Literature",
            "review_date": "December 16, 2003",
            "review_content": "\n Firstly, those that label his lectures (style) as simply moralistic and inept are [WRONG]. *CULPA censor* Sure Professor Mendelson doesn't give a damn about reading 10 pages of notes; and more interested in the real significance of the works and poetry so as to keep most of the class (nearly 100 students) riveted for an hour and fifteen minutes. That is an accomplishment for any class.\n I think that those that call his class a \"cult\"  and believe that it is an insult to label it as \"moralistic\" were angry that he didn't tell us to kill ourselves or come to the conclusion that the world has no relevance but for those that understand fully the didactic and aesthetic constructs of Joyce's work. I'm in no cult--believe it or not--i'm just conscious and ready to admit that this professor is perhaps one of  best that columbia has to offer. HE ALMOST JUSTIFIES THE 43 THOUSAND DOLLARS WE PAY TO COME HERE. \n He's deep and his lessons transcend the pages of the books that we will ever read.\nSO: STOP HATIN\nWorkload:\n2 papers--he's not easy persay: but if you deserve the a/a- you probably do. He's fair and willing to help you write and think more critically. \n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "December 16, 2003",
            "review_content": "\nLike Prof. Mendelson, I hate pretentiousness and English major-jargon. Yes, those students deserve to be shut up in class and Prof. Mendelson does a good job of it. Pen-clickers. Students whose laughter at his jokes goes beyond a \"slight chuckle.\" Ok, a little extreme but if he wants to shut them up too, fine. Quirkiness, not a problem. An endless supply of stories about his twelve-year-old son and the former student who supposedly said \"What does this have to do with me? I'm from Scarsdale!\", not a problem either. Sometimes even worth that slight chuckle. The problem is the broad, sweeping generalities. Now, if this is the way you like to interpret literature, by all means, take this class and you'll enjoy it. In fact, I highly recommend it. But if not, I'll give you a brief synopsis right here. Tess: is she an individual or a category? the product of outside forces or responsible for her own actions? raped or not? surprise surprise ALL OF THE ABOVE. Wilde: It's all about style. Conrad: Meaninglessness. Yeats: ideals, artificiality, myth, hint: he's winking at you. Joyce: conquering language. And Stephen's pretentious, so watch out. Eliot: we're isolated. the world is incoherent. Woolf: so Clarissa was originally supposed to die at the end. Auden: did you know that Mendelson is the proprietor of his estate? that's what I personally found to be the most interesting part of the Auden lectures. Ok, so you get the broad themes of modernism. I would have liked a little more.  And remember, don't slouch. \nWorkload:\nLight reading, 2 short papers, a final. That's all well and good. BUT who grades your papers? That's a mystery. Prof. Mendelson talks about staying up to finish grading them. I wonder how many he grades because neither of mine was graded by him. And he never bothered to introduce the TAs or tell us that we even had them. If he has so little respect for them, maybe they shouldn't be grading the papers. Especially not with such insighful comments as \"the plural of Tess is Tess' not Tess's. I mean, honestly, Prof. Mendelson is obviously a very intelligent, well-renowned guy and it would have been nice to know that he even glanced at my papers.\n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "November 19, 2003",
            "review_content": "\nwhat i find most confounding about the cult of edward mendelson is how a man with absolutely nothing to say about what he reads manages to not only to acquire an impressive position in the world of literature (he's auden's executor and as such manages all the publications of his work/writes the introductions to all this books), but also to a respected and - evidentally - loved member of the columbia english faculty. \nand then it came to me: these other reviews - and the host of admirers who are in my 9 am - are so pleased to be back in the familiar world of high school english class! \nindeed, he'll lecture you about sentence fragments and flip a sh*t if he catches you with a baseball cap on in class. isn't that nice? \nbut in my opinion he has yet to say anything interesting about the fantastic books we read. he ruined yeats for me. i didn't think that was possible! yeats, for christ's sake. \nand he lets the most annoying people ever talk in class. encourages it, in fact. *CULPA censor*\nbut people love him. so maybe i'm crazy. just don't take this class if you want think about what you read or occassionally hear something interesting in the lecture. \n\nWorkload:\n2 brief papers and final. HE IS THE EASIEST GRADER I HAVE EVER SEEN AT THIS SCHOOL. but he takes attendance. so it's not worth it. \n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "April 18, 2003",
            "review_content": "\ngreat.  enthusiastic and strong lectures (that \"you should not simply but into---have your own opinion!\") on great books.  good, new, and different ideas on commonly-studied books.  a nice 9am (if that's possible).\nUnfortunately, TAs are never around and he had no interest in reviewing my paper after a dummy TA started making arguments on it about the wrong novel...he claimed he would adjust our grades b/c he expected the TAs to suck (!!!!!), but I received an exact average of the 2 papers and the final.  And don't bother e-mailing him;  he won't write back---go to office hours.\nWorkload:\nLotsa reading, but he gives you a good amount of time, 2 papers, final\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "January 10, 2003",
            "review_content": "\nI loved this course. Prof. Mendelson is interesting, funny and down to earth. He's not looking for you to impress him or to give him some sort of unique insight. Instead, he'd like you to tell him the obvious, simply and briefly. He'd often talk about random topics like SUVs (he hates them) or Scarsdale. He's understanding about deadlines and would prefer that you turn in a polished piece later on. I think he's probably more approachable if you have him in a smaller setting-our class had about 15 people and I felt that he was comfortable in getting to know us. If you have him, visit him in office hours. He's really great and such a wonderful professor. He was helpful to me with my writing and is caring about other stuff that's going on outside of class. Maybe the best professor I've had here.\nWorkload:\nVery light. About 4-5 short papers (250 words) on works read in class. Last paper (250 words) is a book review on a book of your choice. He encourages class participation but I don't know if it counts that much. Sometimes he'll just ramble about random things. It's pretty entertaining.\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "December 28, 2002",
            "review_content": "\nWhat a great professor.  His opinions on the readings are completely different than what you've studied before, I promise, and he really cares about his students.  You may be rubbed the wrong way at first, but stick with him.  I can't say enough good things about him.  I even made my suitemates come to his 9 am class once just to have the experience.  Take a class from him!!!!\nWorkload:\none pager on a problem you have with the class, two 3-4 pagers on anything, and a final.  It's not that he's an easy grader, he's just enthusiastic if you show interest and make effort.\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "December 02, 2002",
            "review_content": "\nMendelson is a very good if very quirky professor. He is energetic and engaging, generally insightful, and happy to engage in discussion, especially if you send him questions by e-mail. Beware that he has strong opinions, both on the books and on life (he once went on a random diatribe against prozac), and he will not hesitate to disagree with student comments. Beware too that, despite the title, the reading is mostly from the late 19th and early 20th centuries (Hardy, Wilde, Conrad, Yeats, Joyce, Eliot, Woolf, and Auden). Mendelson has the added advanage of being an extremely easy grader.\nWorkload:\nTwo short papers, a one-page 'note,' and a two-hour in-class final. Relatively light reading. Very easily graded.\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "November 19, 2002",
            "review_content": "\nProfessor Mendelson is one of the most inspiring professors I've encountered at Columbia. He is refreshingly insightful, entertaining, and he really makes the works come alive. He alternates between spirited, compelling lecture and hilarious comments about how he only wears a tie to class because someone is paying our tuition for it. If you can't deal with abstract ideas or go with the flow, he might be too much for you, but for those who want to feel GOOD about waking up early for a truly unique class, he's the best!\nWorkload:\nBasically just 2 3-4 page papers and a final\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "November 18, 2002",
            "review_content": "\nProfessor Mendelson is a superb and refreshing teacher. He doesn't allow for fluff or crap in his class - he cuts through poor questions, he takes spoardic attendance, he challenges weak interpretations and he's not afraid to make controversial statements. He cares about his students (he learns names fast, despite the fact that it's a lecture). He is rather funny, with humor that ranges from sophisticated to absurd. He makes a point not to lecture from notes, which means you'll often find yourself just listening instead of writing anything down (for better or worse). You'll find his knowledge about the authors is vast, and his ability to answer questions about the books to be superlative, even if you find his style to be disorganized. The reading list is incredible, the coursework moderate, and the classtime enjoyable. I highly recommend this course - especially to first years or sophomores looking for an engaging english class without the burdens or complications of trying to get into a seminar.\nWorkload:\nOne ungraded page on a problem that intrigues you. Two graded 3-4 page papers, and a final. Reading is not overwhelming and you usually have several classes to finish a novel. \n"
        },
        {
            "course_name": "British Literature 1900-1950",
            "review_date": "November 25, 2001",
            "review_content": "\nProf. Mendelson will really bust your balls about certain things: coming to class on time (try that at 9:10 in the morning), being at every lecture (he takes attendance), not eating in class, and not wearing baseball caps (that only applies to the guys). I was skeptical about him at first, but once you become familiar with him, you realize that he's really funny in his own, quirky, dorky way. He also genuinely cares about his students and really tries hard to learn as many of their names as possible. I've grown to be quite fond of him as person. As for his actual teaching, he's disorganized and doesn't really have an opinion on what he's lecturing on. He vacillates on what he thinks about the works and the authors, claiming that he nor anyone else is the absolute judge on matters. While I appreciate his openmindness (something that's quite lacking in most of the English department faculty), I would appreciate it if he simply gave us his reading, whether I agreed with it or not. I leave the lectures feeling like I learned next to nothing about the works. The reading list, however, is amazing. Hardy, Eliot, Yeats, Joyce, Woolf, Auden.\nWorkload:\nFairly light reading assignments, 1 page on a problem from any of the readings (doesn't really count), 1 page of notes towards the first paper (also doesn't really count), Two 3-4 page papers, final. Claims to be an easy grader and will only count what you do well on.\n"
        }
    ]
}