{
    "prof_info": [
        {
            "prof_name": "Bina Gogineni",
            "prof_id": 2079,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "April 18, 2006",
            "review_content": "\nBina is a cool teacher and keeps University Writing relatively chill.  Unfortunately, she is very disorganized.  It took her many weeks to hand back each of our essays.  We never even got to see the grade on our big CCP paper which would have been really helpful for understanding why we got the semester grade we received.  Overall though, she is a good teacher but I feel the students would get more out of the class if she actually handed back the papers we wrote and was more clear in explaining why we got a certain grade.\nWorkload:\nNot too bad.  Readings were relatively light and we didn't have any substantial writing assignments outside of the ones required of all University Writing classes.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 02, 2006",
            "review_content": "\nBina is a cool person and she keeps UW interesting and non-painful with her relaxed attitude and interesting readings.  However, I have one major problem with her.  The way she grades essays seems rather arbitrary.  You can receive a bad grade on a paper just for one minor mistake that she blows out of proportion.\nWorkload:\nThe workload was pretty light.  Readings were not very frequent and overall pretty short.  There were only three graded essays (the fourth retrospective essay she just gave as an ungraded assignment).  However, I couldn't fully enjoy this class due to the unfair grading.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 13, 2005",
            "review_content": "\nBy far Ms. Gogenini has been the worst instructor I have encountered here at Columbia.  I should have seen it from the begining of the semester.  She was often late and did not seem to care that she took away valuable time from her students.  She was very cavalier about attendance, she expected attendance to be perfect, yet she herself missed several classes and did not inform the class on a timely basis.  Her grading was arbitrary and the leniency she showed to certain students was as well.  She misplaced students drafts and papers, and her ability to return first drafts in a timely fashion was completely lacking.  Ms. Gogenini is completely unprofessional, shows no real interest in expanding the writing abilities of the students, and brings little to the table as a Columbia University instructor.  I STRONGLY reccomend that you not take UW with this TA.\nWorkload:\nThe course load was also lacking.  In UW you have on average 4 main projects, yet you also are supposed to have multiple free writes throughout.  This did not happen in Ms. Gogenini's class.  We had the four main projects with little ability to do rewrites.  Ms. Gogenini was quite unrealistic on the deadlines she set for the CCP as well as the over all course in all.  She throws the UW reading list out the window and uses her own material, which while interesting may not be suited for all students.  Check her syllabus beforehand if at all possible.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "June 21, 2005",
            "review_content": "\nBy far the most interesting and engaging professor I've had here at Columbia.  Uninterested in the inane and mundane details of the UW program, Ms. Gogineni focuses on the important aspects of the course: critical reading and analysis.  She structures the class beautifully with fantastic reading pieces, although some of them are somewhat difficult, and great disussion fuel.  After dreading UW for so long, I felt extremely fortunate to have her as my teacher, as I looked forward to going to class while everyone else outside of my class in UW complained.  Liking UW... imagine that.  She grades amazingly fair, giving rewards where rewards are due.  She is also extremely leniant with deadlines and requirements, giving much freedom to the student.  If you ever have an opportunity to take a class with her, please do so.  It's extremely rewarding.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 26, 2005",
            "review_content": "\nBina is one of the best teachers I have ever had. She took University writing, a typically boring, drudge work orientied class, and turned it into sometihng interesting. She picked her own reading list, and centered all the texts around the theme of transcultural society, exoticism, globalisation, etc. and she is especially well trained to teach these texts, having studied under Said himself, right before he died. Although she is strongly engaged in the material, she is also quite laid back, and I doubt you'll find a chiller UW teacher. She is extremely understanding when you cant get papers in on time, or if they are under the word limit. Whats more, she has no qualms about handing out A's for good papers, unlike many stingy teachers out there. You can expect her to show up to class late, dressed stylishly, everyday. Thanks to her my writing has evovled immeasurably. Long story short, Bina is awsome.\nWorkload:\nAs chill as Bina may be, she is only allowed to tamper with the UW workload so much. However, she never gives us annoying little assignments like some other UW teachers, and she grades easy. Also, instead of a retrospective essay at the end of the course, all we had to do was an in-class free write.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 11, 2004",
            "review_content": "\nBina is awesome.  She's basically a kid just like us but she knows what she's doing.  She usually comes late to class, but that means that I don't have to rush to get there myself so it works out well.  She's a lot of fun to have as a teacher, and makes the material interesting.  She grades pretty fair on the papers, and is flexible with giving extentions(no rewrites though).  It does tend to take her a little while to get the papers back. I would definitely recomment taking her for University Writing.\nWorkload:\nIn the first half or so of the semester a little over an hour of work for every class.  Maybe 40 minutes of reading, and then 20-30 writing an assignment on it.  As the semester goes on, those slow down, and most of the work is just getting papers done.  There's plenty of time for the last CCP.  I found the workload pretty light as compared to Lit Hum, which is an absolutely terrible amount of reading.\n"
        }
    ]
}