{
    "prof_info": [
        {
            "prof_name": "Suad Mohamed",
            "prof_id": 2684,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "February 02, 2008",
            "review_content": "\nI had Suad for three semesters and would not recommend her as a professor.  She is very moody, does not like when people disrupt the flow of the class, limits questions causing confusion, and doesn't teach the grammar well at all.  \n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "December 19, 2007",
            "review_content": "\nWhile she is a passable teacher and a very nice person, Intermediate Arabic is a terrible class. Columbia does not know how to construct a coherent language curriculum. \nThree hours of homework a night, inane in class exercises, and a GPA ruining grading scheme make this a horrible experience. If you want to learn Arabic, teach yourself. \nWorkload:\nToo much. Ridiculously hard final.\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "December 19, 2007",
            "review_content": "\nThree words:\nGET OUT NOW.\nBy far one of the worst language experiences that I have had. You work, you slave, you beg, and you plead...and nothing.  I know that she is a nice woman deep down; when you go to her office hours she's perfectly fine IF she likes you.  But if you are for some reason on her bad side--which sadly a few students in our class were--your life will be miserable.  You will be unable to ask questions, get above a 70 on anything, ridiculed, ignored, etc.  And beyond all of that, she just was not a great teacher.  Things weren't explained well or at all.  Everything was explained in a confused manner that contradicted what was in the book. \nHead for the hills. \nWorkload:\nHEAVY AND MISERABLE. No curve whatsoever. \n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "January 16, 2007",
            "review_content": "\nSuad is a tough teacher. She is very cheerful and enthusiastic, but she can also be impatient. She has no mercy on your homeworks. She marks all the mistakes and grades them with check (minus, just check, and plus). You can only get a plus if it is perfect. AND they count a lot for your overall grade! Participation is no joke either. If you don't have a loud voice or are shy you're screwed because she will take it out on your average. The tests are much easier than being in class with Suad. They surprised me, because she makes you expect the worst. Also, if you forget something and ask her about it later, she will scold you for not remembering. It is very easy to feel stupid in this class. \nYet, Suad is not a bad teacher. She includes outside songs and videos and also loves to get to know her students. If you care enough (and by caring I mean putting in 3 or 4 hours of work a night), you can do well in the class. If you don't work hard though, you can bet on having your GPA slaughtered. \nWorkload:\nQuizzes on each chapter, nightly homework (set aside at least 2 hours a night), oral exam, final exam\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "December 13, 2006",
            "review_content": "\nSuad Mohamed is a really nice woman if you're on her good side, but this doesn't mean she's a good professor. If you are actually interested in having a competent professor who will help break down Arabic grammar and make sure you're learning, she is not the one for you. If you're OK with teaching yourself from the book, however, you might be fine in her class. She's not particularly hard, but the tests in the Arabic department are standardized, so you will be at a disadvantage being in her class. The problem is she really doesn't seem to know how to explain things to American students. She rarely understands people's questions in class - she doesn't get what we don't get - which is a really big problem in teaching a complicated and difficult language like Arabic. She's also quite straightforward and seems to like to embarrass you in front of the class when you make mistakes, which I imagine is a product of her culture and not because she's trying to be mean, but it also means that people stop talking in class and get too nervous to try, which is a bad thing to happen in a language class when this really is our only opportunity to use Arabic.  She definitely picks favorites, which is nice if you are one of them (all you have to do is be nice and talkative) but can be frustrating if you're not. Her class is not horrible, she's fun and likes to keep things light, but it's also frustrating and not really worthwhile. If you're taking Arabic, this class will be your life, you have it every day and you will always be doing your homework for it. Do you really want your life to be a second-rate? Think about it!\nWorkload:\nHomework every night (it gets very tedious!) and 4 or so quizzes, a final, and 4 presentations - and it ends up being even more than it sounds!\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "December 06, 2005",
            "review_content": "\nArabic is no joke. Having no bachground in the language, I found myself struggling to keep up at first, then later blowing off my other classes to study Arabic. If you don't have a good instructor, life can be hell, because you end up going to class to just feel dumb, and the learning process grinds to an unpleasant halt.\nSuad is like the hip Yemeni grandmother you never had. \nShe smiles a lot, she's friendly, and gently makes fun of you from time to time.\n There is just one problem: she is a bad teacher. If you already speak Arabic or have a background in a similar language, then you might not have problem, but if you actually need to lean arabic from the ground up, go elsewhere. Suad is very friendly, but she is terribly unhelpful.\n When I would try to go to Suad's office hours, she smiled, was very nice, and totally blew me off. It was like she didn't think it was her job to teach me anything. In her mind, her job is to present the materials. Figuring it all out is left up to you. \nOf all the studying I did, I'd say that classtime was the least helpful part of the day.Very little learning happened in class, and maybe that's normal, but I don't think so. I ended up hiring a private tutor for $20/hour, and it made such a huge difference.\nWorkload:\nHonestly, if I had to do it all over again, I'd rather do an immersion program. Arabic is insanely hard and insanely demanding. If you want to learn it, you have to dedicate probably 5 hours a day outside of class (if you have no background in it), and possibly go to outside tutoring. \n"
        }
    ]
}