{
    "prof_info": [
        {
            "prof_name": "Kaiama Glover",
            "prof_id": 700,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "FYS Haiti",
            "review_date": "April 17, 2013",
            "review_content": "\nTake a class with her if you can, any class. Not only is professor Glover a wonderful person, she is also the most eloquent, brilliant professor I have ever had. She knows what she's talking about, she's wonderful to listen to, and she is kind. She will inspire you and you will want to impress her. Even though she's incredible in her field, she is not full of it and will always listen to student opinions. She is always available to meet outside of class and is helpful. I highly recommend taking any class with her that you can. \nWorkload:\nLong but interesting readings, papers that are graded fairly, and a final exam. She has high expectations but also appreciates effort.\n"
        },
        {
            "course_name": "Francophone Fiction",
            "review_date": "December 13, 2011",
            "review_content": "\nAn absolutely incredible course! Professor Glover, as the many reviews below accurately describe, is warm and encouraging, kind and funny and so, so brilliant. You will eat up everything she says and then be inspired to analyze the texts she's selected for the syllabus at an even deeper level. All of the texts were interesting and thought-provoking, and the framework for analysis that Glover brings will always hold your attention. Highly, highly recommended -- and take any class with her that you can!\nWorkload:\nSeveral texts for the semester with a reasonable amount of reading per week, a 1-2 page response paper for each text (20%), a 20-minute oral presentation (30%), final 8-10 page paper (30%), attendance/participation (20%). \n"
        },
        {
            "course_name": "Intro to French and Francophone studies",
            "review_date": "April 15, 2010",
            "review_content": "\nI had Professor Glover for Intro to French and Francophone Studies II. I absolutely loved her as a teacher. She's energetic and extremely knowledgeable and although she speaks really fast her French is so clear and well articulated that I can understand everything she says. As far as the class went though, I often felt overwhelmed. The reading is a lot and was kind of boring (for me, some people might love it) and after the first few weeks of class I gave up doing it at all. Luckily though, Professor Glover goes over all the important points of the reading so even if you don't read AT ALL, if you come to every class, sit in the front, pay lots of attention and take continuous notes, you should still be able to do pretty well in the class (I got a B on the midterm having read nothing - not too bad).\nThe class is a little hard to keep up with due to the enormous amounts of complicated reading but other than that, there's never any homework to turn in. So it's just reading and then a midterm and final. \nIf you're looking to actually improve your French though, this might not be the class for you. The focus is a lot more on the historical material learned rather than how well you speak, read, and write French. Her grading on the exams focuses solely on your understanding of the subject matter and not at all on your writing abilities. Because the class is mainly a lecture class, you won't develop your speaking and writing skills much but you'll get plenty of practice with listening and reading and taking fast notes in French.\nOverall though, the class was interesting and I have nothing but praise for Professor Glover. If you're interested in French colonialism and history, then this is the class for you and Professor Glover is simply an amazing teacher.\nWorkload:\nLots of reading (usually a 20-40 page essay to read for every class), 1 midterm (essay questions) and 1 final\n"
        },
        {
            "course_name": "Black Baghdad",
            "review_date": "April 14, 2010",
            "review_content": "\nprofessor: SMART, FUNNY, BEAUTIFUL and ARTICULATE\nsyllabus: WONDERFULLY VARIED ENGAGING readings by American European Caribbean and Latin American authors \nworkload: 2 SHORT papers, 1 LONG paper, 1 EASY presentation\nreadings: about 1 BOOK per WEEK (meet once a week for 2 hrs)\ndiscussions: short lecture background info by Glover (you'll wish she kept on talking forever, its that good!) then a class discussion (we always run out of time)\nwhat you get out of it: critical reading and thinking, historical and literary discourse on Haiti, construction of perceptions of Haiti), fun books!\nOverall: best class of my semester. Read the books on time, pick  an interesting topic for your papers, get to know ur classmates and you'll be fine\n\nWorkload:\nworkload: 2 SHORT papers, 1 LONG paper, 1 EASY presentation\n"
        },
        {
            "course_name": "Introduction to the African Diaspora",
            "review_date": "July 26, 2008",
            "review_content": "\nImagine sitting in a small, hot, over-crowded classroom in the late afternoon for two hours, two days a week. The petite black woman in front of you makes you feel unintelligent and inadequate every minute you are there.  She speaks too fast for you to follow her with notes.  She occasionally makes up words.  You love EVERY minute of it.  She is simply brilliant.  She is one of three professors for whom I would give rave, unblemished reviews.  You know when that kid brings raises her hand in class and brings up that book that's only mildly related to the subject matter and is probably not even originally in English? Glover knows it back to front.  She is really passionate about the material. Following her thought process is pure entertainment because she is vivacious and funny. I would take any class with her given the opportunity.\nWorkload:\nQuite a lot of reading, but you won't feel it's pointless. 2 response papers. Midterm and final.\n"
        },
        {
            "course_name": "Introduction to the African Diaspora",
            "review_date": "April 04, 2007",
            "review_content": "\nI loved this class! Prof. Glover is amazing. She is so articulate that you find yourself wanting to write down every word she says. The class had a good balance between her teaching/lecturing and people's own opinions.  The reading was really interesting and provided a different side of history. The only thing is that I was always intellectually exhausted after the class, but it was worth it. \nWorkload:\nTwo 2-3 page response papers, a midterm and a final, and a fair amount of reading.\n"
        },
        {
            "course_name": "Introduction to the African Diaspora",
            "review_date": "March 28, 2007",
            "review_content": "\nShe is absolutely brilliant.  The class was two hours twice a week at a time in the afternoon when I would otherwise be napping and I was still hanging on her every word.  Bring up any related text outside of the syllabus and she knows it back to front.  You will learn so much from Professor Glover.  \nWorkload:\nReadings were often heavy.  They are also very dull in the beginning of the semester but get much better. Two response papers, a midterm and a final which are basically spitting back information from lectures.\n"
        },
        {
            "course_name": "Intro to Francophone Studies I",
            "review_date": "March 05, 2007",
            "review_content": "\nsuch a fan.  'nuff said.\nWorkload:\npretty much perfect, and interesting readings.\n"
        },
        {
            "course_name": "Literature of the french speaking world",
            "review_date": "February 21, 2007",
            "review_content": "\nThis was the best class I have taken yet. There were only seven of us, first of all. The readings were new and incredible, the course was well-organized and do-able. Prof. Glover is amazing. So smart, so elegant, (so beautiful) she made sure discussions stayed on track and stayed sophisticated. She was open to different opinions, if they were well thought-out. \nWorkload:\nRelatively light: 8 response papers (one per book, essentially), fair amount of reading, but it goes fast,a presentation and a final paper.\n"
        },
        {
            "course_name": "Global Lit--First-Year Seminar",
            "review_date": "December 04, 2006",
            "review_content": "\nThere are already several glowing reviews for Prof Glover, and I just wanted to add to the pile. This woman rocked my first semester world. Not only is she brilliant, but she's great at encouraging meaningful, interseting discussion among her students. If you have her for FYS, she will not only teach you the fundamentals of college-level writing (as first-year english courses are intended to), but she will also make you go above and beyond the expectations found in most other classes. So basically, you're pretty much set for any type of essay-writing at CU if you take a course with her.\nProf Glover is also very accessible, and is always willing to discuss paper topics. She's a very fair grader and puts A LOT of effort into her crits, just to make sure that her students really do improve their writing.\nThe material is interesting, and the reading is very rich. \nThis course has made me very excited about pursuing further studies at Columbia/Barnard.\nTAKE ANYTHING YOU CAN WITH PROF GLOVER.\nWorkload:\nVery manageable. She expects a high level of preparation for her classes.\n"
        },
        {
            "course_name": "Introduction to the African Diaspora",
            "review_date": "April 29, 2005",
            "review_content": "\nTake this course! Professor Glove is extremely knowledgeable, articulate, and adept at stimulating interesting, provocative discourse among her students. I'm not particularly a fan of theory or philosophical-like texts, but I found the readings both engaging and accessible.  Professor Glover makes the most of what could easily have been a boring, traditional intro course.  Most classes are discussions about the readings (i.e., summaries of key points to know and further implications to the field of Africana Studies), with a few days of lectures. \nWorkload:\nModerate. Readings for every class range from 30-100pp. but most are interesting enough that you'll want to read them, and even if you don't you go over key points from the text in class, so you'll be able to understand the big picture. One response paper (2-3 pages) due for each half of the semester; thematic and informal. Two quizzes, midterm, and final, all thematic. Quiz - get 3 questions, answer 1. Exams - get 5 questions answer 2.\n"
        },
        {
            "course_name": "Haitian Novel",
            "review_date": "February 14, 2005",
            "review_content": "\nI cannot praise this professor highly enough. In a French department where most professors are too scattered, too busy, or too apathetic to put much effort into teaching undergrads, Kaiama is a notable exception. She is passionate about the material, gives coherent and insightful lectures, and is a veritable encyclopedia on francophone/caribbean literature. She is also fair about grading -- *fair* as opposed to generous. She expects a high level of preparation in class and holds students accountable for their performance. That said, she is also genuinely friendly and personable. The best French professor at Columbia in my experience as a French major.\nWorkload:\nManageable -- 5-7 pp paper OR an in-class presentation, midterm, final; substantial (but fantastic) reading\n"
        },
        {
            "course_name": "Africa in Cinema",
            "review_date": "December 24, 2004",
            "review_content": "\nA really great class, with very minimal effort involved. There's a little bit of reading at the beginning of the semester, but otherwise it's watching movies once a week and then discussing them the other day of the week. I wouldn't recommend taking this class to improve your French, however. It's a joint class between African Studies and French, so it's taught in English with discussions and reaings in English. You have to write your papers in French for it to count towards the minor or major, however. Most of the movies have some French in them, but are all subtitled, which doesn't encourage much use of French either. Take this class if you're interested in learning more about Africa than just economics and politics, but really understanding the lives and struggles of people in the postcolonial era. The discussions are also really engaging and Prof Glover definitely knows how to direct them. Professor Glover as a whole is very intelligent and engaging as well, although her field definitely isn't cinema, it's francophone studies, which is a nice touch to the class, as she's able to contextualize a lot of the films. \nWorkload:\none paper or presentation which she's pretty generous with, a final which is just two essays, a 1 or 2 page review of each film once a week, and minimum class attendance of the discussions once a week\n"
        },
        {
            "course_name": "Haitian Fiction ",
            "review_date": "November 09, 2004",
            "review_content": "\nThis was one of the most unbelievable classes I have ever taken in my life!  First of all, the material is incredible.  As I learned this semester, French Caribbean literature is both well-written and full of substance (unlike the French literature of France, which tends to be excessively verbose, flowery, and about nothing in particular).  It was wonderful to learn about something so obscure - I would not know anything about Haitian history and politics, if it were not for this class.  The material aside, Kaiama herself is an amazing professor.  She is extremely knowledgeable about her subject, yet full of the youthful passion that not many scholars have today.  She cares wholeheartedly about her class and her students.  She wants everyone to not only understand the material, but also to come up with their own ideas about the texts.  The class is very intimate, and even though it is a lecture, the small number of students makes for a very discussion-oriented seminar-style class.  You cannot get away without having done the majority of the reading (I don't know why you wouldn't want to though, it's very good!!!).  Students are expected to participate actively at all times and it is difficult to fudge having read an obscure Haitian book.  Grading is very fair (even on the generous side).  Everyone who is capable of taking this class should.  It is a pity not more people speak French, so that they can appreciate the amazingness that is Kaiama's class!!!\nWorkload:\nMedium: Response papers (1-2pgs) on each work studied, choice of either a term paper (5-7 pgs) or an oral presentation (25 min), final, readings at a moderate pace\n"
        },
        {
            "course_name": "French and Francophone Studies",
            "review_date": "November 23, 2003",
            "review_content": "\nKaiama reaches areas other professors don't reach. Her whole mannerism suggests that we have in her a star in the waiting. It's like Josephine Baker started to work at Columbia. Her teaching is effortless, her behaviour toward students sharp and fair. I think I'll sign up next year again...\nWorkload:\nManageable.\n"
        },
        {
            "course_name": "French and Francophone Studies",
            "review_date": "March 31, 2003",
            "review_content": "\nNot only is she brilliant, she is simply the best-looking professor I've ever had at Columbia. This prof is gorgeous and dresses extremely well too. She'll def keep you awake.  \nWorkload:\ndo-able, she's a fair grader. \n"
        },
        {
            "course_name": "Issues in the Study of Pan Africa",
            "review_date": "March 03, 2003",
            "review_content": "\nKaiama Glover is just plain magnificent.  Not only is she brilliant, but she's dead set on getting you there as well. She doesn't dumb things down, or make ideas way too inaccessable.  Her grades are always fair. \nWorkload:\nManageable: lots and lots of reading for this course, but all very interesting\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "September 09, 2001",
            "review_content": "\nKaiama is a fabulous teacher. I was lucky enough to get her first semester, and signed up for her class again the next semester even though it was at 9am. She makes sure everyone understands the material, keeps in close communication with the students through office hours and email, and is a fair grader. Take her class if you can!\nWorkload:\nSix tests that are pretty easy, some homework assignments that take no longer than 20 minutes, two compositions that you get to revise for a new grade, and the final, which after her class is a breeze.\n"
        }
    ]
}