{
    "prof_info": [
        {
            "prof_name": "Hamid Rezai",
            "prof_id": 4247,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 08, 2009",
            "review_content": "\nLove love love Hamid. best teacher i've had at columbia. his simple language is deceptive, as he presents very complex problems and questions that have very few solutions or answers, but the exercise of listening to him and writing papers is well worth it. he's very intelligent and inspiring. He will make you understand the texts, unfold their obscurities and show you them in their clarity; you cannot ask for more in a CC class. Make sure that you participate in class discussions.\nWorkload:\nWeekly Responses, Final Paper (expected 10-15 pages) 20%, midterm exam 20%, presentation 10%\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 07, 2009",
            "review_content": "\nHamid know the books well, he's EXTREMELY friendly and funny, and he's very smart. His command of the books is good and should only improve (it was his first time teaching CC). If there's one drawback to the class, it's that Hamid's English isn't great, and it sometimes takes him awhile to answer questions or explain difficult concepts. Class is very relaxed--very little lecture, mostly discussion usually guided by a student presentation. \nHamid is a self-professed hater of tests. His experience in the German university system has clearly left him with a good deal of empathy for students, and he tries to limit stress by giving fairly easy tests/quizzes (if he gives them at all). He is also a very generous grader on papers. Pretty much anyone could enjoy this class--if you do your work, you'll learn a ton, and if you don't, you'll probably do just fine. If I were a culpa administrator, I'd give him a gold nugget.\n \nWorkload:\nSemester 1: midterm paper (5-7 pages, open topic), midterm (three broad questions, pick one), final paper (6-8), final (pick 10 of 12 questions, one to two paragraph each)\nSemester 2: midterm exam (like final first semester), book review (4 pgs, essentially summary), 2 quizzes (3 easy questions each), research paper (10-12 pages), NO FINAL.\nThere's a standard amount of work and reading, but it's graded leniently. \n"
        }
    ]
}