{
    "prof_info": [
        {
            "prof_name": "John Gamber",
            "prof_id": 9601,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Novels of Immigration, Relocation, Diaspora",
            "review_date": "May 09, 2016",
            "review_content": "\nAfter a full semester attending most of the lectures and all of the discussion sections, I've concluded that this course organizationally makes absolutely no sense. The books themselves, however, are for the most part really entertaining and well worth reading.\nProfessor Gamber stated in no uncertain terms in the first two lectures, \"if you don't believe white privilege exists, this is not the course for you,\" which I would think would self-select a group of pretty \"social justice\"-minded students (myself among them). However, Professor Gamber spends the rest of the semester lecturing to this imaginary student he made it explicitly clear from the beginning he didn't want in the class. The result is lectures full of entry-level social justice statements (\"If you believe in equality between all genders, congratulations, you're a feminist.\"), which are usually redundant, kind of patronizing, and (as others have noted) often tangential to the actual book. Another reviewer wrote that Professor Gamber has a tendency to speak on behalf marginalized groups he is not a part of, which I would say is accurate. It can get pretty uncomfortable as a student of color in lecture, ironically.\nBecause Professor Gamber's lectures focus largely on critical theory and historical phenomena surrounding the book, discussion about the actual novels gets relegated to a 50 minute discussion section. I really liked my TA, but 50 minutes per novel wasn't nearly enough time to really delve into the books. Your TA really makes or breaks this course, because they hold the discussion sections, and they do all the grading — what was actually really frustrating was that Professor Gamber withheld information on the midterm and final formats (even from the TAs) until the last class before each. (Ultimately, both exams were pretty easy). Professor Gamber didn't even show up for the final exam, which I found pretty telling.\nIn general, I'd say Novels of Immigration is worth taking if you're really interested in the novels, because it's not at all a difficult course, and Professor Gamber's lectures, while pretty lackluster, aren't the real backbone of the course. I don't feel like it should count for Global Core, but apparently it does, so this seems like a fairly viable option. If you're in CSER or the English department, however, you'll likely find the course pretty bizarre and struggle to grasp what exactly you're meant to take away from it.\nAs for Professor Gamber specifically, if you have similar politics to him (you hate the Core's Eurocentrism, you want to destroy the white supremacist cisheteropatriarchy), you might enjoy a seminar-style class with him, wherein you can actually engage with the books and his arguments about them.\n\nWorkload:\n11 novels (about one a week), all from contemporary American authors.\nIt seems like the assignments for this class change dramatically from semester to semester, but here's what it was this time:\n25% Discussion Group participation\n25% Midterm (essentially a reading quiz testing your ability to ID short passages)\n25% 8-10 Page Paper (There's a creative option)\n25% Final (ID 4 of 6 Passages and write about 3 paragraphs about each)\n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "September 02, 2015",
            "review_content": "\nGamber is glib, sarcastic, witty, funny, and well-rehearsed. He showed up to every class in a suite and tie, and his presentations were always perfectly prepared and executed.\nDespite that, things went wrong from day one: there weren't enough TAs for the course, so he had to cancel the mandatory discussion sections. This also meant he had to cancel one of the papers for the class. The books were all interesting, but Gamber really gives off the impression that he cares more about his research than his students. He flat out doesn't seem to care about reading the midterms. The midterm was writing three short essays on excerpts that were easy to identify if you came to lectures -- you didn't even need to read the books -- and was essentially graded on whether or not you 1) knew the title and author of the quote, and 2) could write more than one paragraph on it. Most of the students in the class seemed to get a perfect or near-perfect score.\nThe paper, though, was graded incredibly harshly, and the final was impossible. Like the midterm, the final was quotes that were far more obscure, and even people who read all of the books (I read most of them, but not all of them) had trouble identifying them.\nOh, and he also claimed that he automatically failed 15% of the class for not handing the paper in on time, no exceptions. So there's that as well. He doesn't really have time for bullshit, but he also doesn't seem to care how much we're absorbing other than if we have read the books. The problem is this: all he cared about was reading the books, but the class soon became so much more than the books. They were jumping off points for a larger discussion on race and movement in America post-1965, which is amazing and interesting, but so much of his lectures had nothing to do with what we were being graded on.\nJust read the books yourself. Most of them are pretty short, and they're by and large really good.\nWorkload:\nMidterm exam, which was a joke.\nLong (8-10 page) paper, graded super duper harshly\nFinal exam, which was a miserable experience\n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "September 02, 2015",
            "review_content": "\nThis class was not good, and Professor Gamber does not (in any way) deserve a gold nugget. I don't know how many negative reviews he needs before CULPA changes that.\nLike many reviewers have already said, while the books and lectures were enjoyable, the lectures were only superficial and very rarely succeeded to expand my understanding of the text or of the issues at large. Truly all he did was dramatically read long quotes from the texts without any substantial analysis. He runs through many different literary elements that were present in the text without every really connecting them to issues of immigration/relocation or explaining them thoroughly. I have come out of this class not really knowing anything more about literature about movement than I did at the beginning. \nThe assessments and grading were horrific. I understand that he had a problem at the beginning with his TA's, but that's really no excuse. It's absurd that the midterm essays were graded out of 5, with two of those points awarded for identifying the author and title. There absolutely should have been more than one paper, worth 40% of the final grade, so we could have improved our writing and more fully understood what the professor and TA's were looking for. The grading was very harsh, almost to an arbitrary extent. The final was god-awful, as others have already explained, despite the fact that I really did read all of the books. All of this is to say that the exams and papers in absolutely no way assessed what we learned in the course. \nProf. Gamber may be a nice person, but he does not seem to be a particularly good professor, and I implore you to reconsider before taking this class. \nWorkload:\nSee below.\n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "June 16, 2015",
            "review_content": "\ntl;dr: Gamber as a person = humorous, witty, all around a good guy. This class was a nightmare logistically and impacted the experience, but that was mostly beyond his control and is probably a one-time thing. More Global Core than English, great books, really tough paper, reasonable exams (though my opinion on the exams seems to be an outlier).\nGamber's funny, knows his shit, isn't afraid to call people out on their bullshit, etc. He has flair & timing, so his delivery of his lectures were always great.\nThe selection of books is great. I really enjoyed most of the novels, and managed to finish all of them because I genuinely wanted to.\nAs for the class itself: a lot of things went wrong for it on the administrative side, unfortunately. They couldn't find enough TAs for the class, so mandatory recitations were cancelled. Because of this, the entire grading system had to be changed. Gamber was really frustrated by this; you could tell that this was not the way he wanted to teach the class. He believes lectures are the worst way to teach a humanities class, but he ultimately got stuck teaching a class that could only be a lecture. I think this definitely damaged what the class had the potential to be, but I also don't believe this should reflect badly of Gamber, when it was out of his control.\nLectures would usually start with background on the novel. Then he'd pull a few quotes related to whatever theme he was focused on, dramatically read the quote, and discuss the theme more. This class did feel more Global Core than English at times, as some previous reviews have said. He focuses much more on cultural/social/racial/gendered themes that were semi-obvious than actually analyzing the text and the language. Still, I learned a lot, even if it didn't exactly deliver as an *English* course.\nThe midterm was ridiculously easy: ID 3 of the 5 given passages and explain how it ties thematically/stylistically to the rest of the book. Basic stuff.\nThe paper: damn. Grading was really harsh. I can't tell if this is just representative of the TAs or if Gamber told them to be so rough. I've previously had Gamber for Lit Hum and he was easier on grading so, not really sure about this one. I regret not visiting the TAs more for help with the paper, I'm sure it would've helped me loads more. He gives you a list of pretty varied prompts, or you can come up with your own as long as it's cleared with him/the TAs.\nAlso--make sure you follow his instructions for the paper. Gamber was raging because 15% of the class either 1) didn't hand in the paper on time 2) didn't hand it in in the right location 3) wrote on an unlisted topic without getting it cleared. He then said he was going to give that 15% a 0 for not following instructions, no exceptions, effectively failing them. Not sure if this ever happened (I sure hope not). Either way, I still wouldn't even want to face the threat of this.\nThe final: I know previous reviews all have said the final was a bitch, but I didn't have much trouble with it. If you read all the books (and this wasn't a problem for most people I know in the class) and have a firm grasp on the themes, plot points, etc, it wasn't too difficult to discern which passages were from what books. It definitely wasn't easy, but it wasn't horrible either. Again, my experience may have been the exception on this.\nI agree though, that the midterm/final probably weren't great assessments of how much we actually learned/gained from the class. That probably was what the discussion sections went towards, but since they were cancelled, there was really no way for Gamber to gauge that for everyone in the class. I'm also pretty sure he thinks exams are stupid ways of testing, so he just didn't give a shit about the exams and basically tested on reading comprehension.\nDespite how weird it was this semester, I'd still recommend taking the class. Hopefully it'll be better in the future & discussion sections will be back in place.\nWorkload:\nmidterm (3 IDs & explain significance) - 30%\npaper - 40%\nfinal (20 quotes, ID 18 & explain how you ID'd them) - 30%\n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "May 19, 2015",
            "review_content": "\nI went into this class with a very open mind, and I was sorely disappointed. Pretty much everything about this class was terrible except for (a) the books and (b) the lectures (in terms of style, not content). To elaborate…\nFirst, this class is cross-listed as English and CSER, but don't be fooled. The class is not at all an English class -- it is basically a study of race using the books as jumping off points. This isn't necessarily a bad thing, but don't expect high-level analysis of the texts.\nSecond, on his lectures. He is a vivid speaker and quite lively, but the substance just isn't there. The class is structured so that every week is a different book, for the most part. Usually, he spends the entire first lecture or more on inconsequential things such as: the author (because the books are all recent, the author is often just a random adjunct professor at a random university -- who cares?—this often seems like he is trying to justify the importance of these obscure books and their authors), the historical background (again, it IS interesting, but not really related to how the class was presented), and the epigraphs (I'm sure we can all agree this one is a waste of time). After that hot mess, most of the lectures are him reading off slides. He is the kind of person that reads things emphatically and dramatically and believes it wholly alters the meaning of the words. In reality, he spends most of the time picking out important passages and reading quotes in an actor’s voice while barely giving any original analysis. In this respect, I would say the class very closely resembles a high school English class. But, his presentation is immaculate, almost like a well-orchestrated sermon. So, the lectures for me were a mixed bag: They started off amazing, but as I became accustomed to the formula I quickly started to dread them. In short, while I would generally really enjoy the lectures as they were happening, afterward I would think back and realize I gained virtual nil from them.\nThird, the grading. The midterm was a total joke for not really any reason. Nearly everybody got a 9/10 or 10/10, and it is lunacy that the essays were graded out of 3. The long essay was graded way too harshly. Also, anybody who handed in the long essay a minute late was failed IN THE CLASS, which is major overkill. Thank God I was not in that boat. The final exam came out of the blue and was extremely difficult, again for seemingly no reason. It was essentially him picking out the most unidentifiable passages for us to ID (e.g., some books have Spanish every other word, and he purposefully found places where that wasn’t the case; another example, none of the “Oscar Wao” passages on the exam contained nerdy or Dominican references that pepper every other sentence). Basically, there was no rhyme nor reason to the grading system, and it seemed like he was making up the expectations as he went along.\nFor anybody considering this class, I will advise you: (a) You don’t have to be super progressive to enjoy the course as long as you keep an open mind. (b) Go to the first lecture—he is very consistent, so you will immediately be able to understand how the semester will be. And, (c) don’t take this if your GPA is more to you than a number. This class IS a sandbag. (I hope I don’t sound bitter—I have been looking forward to this review cathartically for weeks now when all I had gotten back was a 10/10 for the midterm.)\nOne last parting jab: Gamber likes to pretend he is a speaker for ALL people of color, to a comical extent. He doesn’t realize how transparent he is being, but he loves to artificially associate himself with the minorities in the books. For example, he will drop a comment like “everybody always pronounces this like X when it is really pronounced Y,” as if he is the authority on Vietnamese or Muskogee or whatever. It is just embarrassing, part of his progressive pathology and acclamation of victimhood, so I hope he sees this and cease-and-desists. \n\nWorkload:\nMidterm Exam: 30%\nLong Paper (8-10 pages): 40%\nFinal Exam: 30%\n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "May 19, 2015",
            "review_content": "\nI was really looking forward to this class, and for the most part enjoyed it, but I feel like something went wrong this semester. The books are incredible and the lectures worth attending; the way this class is graded is a mess. \nGamber is a glib, charismatic, and thoughtful lecturer, and I never regretted coming to class. He's fun to listen to! He usually spends two days on each book, with the first lecture more focused on author/historical context and the second on plot/themes/language/etc. The syllabus is expertly crafted, with a good mix of more popular texts (Brief Wondrous Life of Oscar Wao) and things I had never heard of before (The Bird is Gone). I loved everything we read. If you’re an English major, it fulfills your American and Prose requirements as well as counting for Global Core, which is great. \nThe way that this class was graded was really frustrating. One of the TAs dropped out at the beginning of the semester, so discussion sections were canceled. We were supposed to write a 5-page paper earlier in the semester that also got canceled, which put a lot more pressure on the midterm, final, and final paper. \nMidterm was fine—passage ID/short essay. Lots of options for the final paper topic, and TAs were really helpful, answering emails and holding extra office hours. (As far as I can tell, the TAs did all the grading in this class.)\nThe final was awful. I’ve taken a good number of English finals at Columbia, and this one was just *bad*. We had to identify 20 short, obscure quotes (from 11 books), and give the title, author, and one sentence about how we knew the quote was from that book. No literary analysis at all; it was basically a glorified reading quiz. I kind of feel like Gamber sensed people hadn’t been doing the reading as much as he wanted them to, and decided to punish us with this joke of a test. I read all the books and couldn’t identify all the quotes, and they definitely weren’t all quotes we discussed in class. \nHopefully a lot of these problems were particular to this semester—as far as I can tell this was the first semester that canceled mandatory recitation sections, had no shorter paper, and gave a final that was a train wreck of super short IDs rather than a more thoughtful assessment of our understanding and analysis of the texts. \nBottom line: Wonderful books, great lectures, frustrating grading. Take this class if you have time to read everything twice because the final's a doozy. \nWorkload:\n-Book a week\n-Midterm (pretty mild) \n-Final paper \n-Atrocious final exam\nCanceled: Recitation sections and a shorter paper \n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "May 09, 2015",
            "review_content": "\nI honestly don't understand some of these reviews of Gamber. He's a great lecturer, sure, who's glib and funny and sarcastic and witty, but there isn't much else there. The books were all fantastic, but it's in the assessment of the class that I really began to lose patience with the guy.\nGamber really doesn't seem to want to read papers. His midterm was identifying and writing a short essay on two passages from the books, and were graded solely on whether or not you could identify the books and then wrote something that resembled an essay for the new four paragraphs -- each essay was worth 5 points, two of which were simply identifying the author and the title of the book correctly. Then there was a paper, which seemed to have been graded pretty harshly, and a brutal final which was simply just identifying obscure passages from the novels. I'd read most of the books, and couldn't work out most of the passages.\nSimply put, Gamber is a great lecturer, but doesn't seem too invested in actually measuring how much we've learned in the class\nWorkload:\nA book a week\nMidterm\n8-10 page paer\n(Awful, brutal) final\nThere were supposed to be discussion sections, too, but those were canceled at the beginning of the semester.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "February 25, 2015",
            "review_content": "\nProfessor Gamber is FANTASTIC. He really knows his stuff. My class was the last time he was teaching Literature Humanities, but I'm sure that his other classes are just as good. I have a hard time paying attention in any of humanities classes and John kept me interested every single class. He knows how to engage the class in intelligent discussion really well. At the same time, he does a great job of translating the texts into real, understandable English.\nWorkload:\nMidterm, final, a few papers that were relatively short. Not bad at all!\n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "January 05, 2015",
            "review_content": "\nI agree with one of the reviews below: Gamber is not a gold-nugget professor. He got the gold nugget because of his charisma and glib rhetoric. If you scratch beneath the surface you won't find much.  His analysis are interesting but often shallow and predictable because of the heavy-handed political statements he likes to make.  Gamber is himself a bundle of contacdictions: a \"man of color\" with blue eyes and blonde hair, he likes expensive suits and he is a disciplinarian of sorts. He often criticizes Columbia, for example because Butler library is named after a white man. If he dislikes this place so much, why did he accept the job offer? To fight the system from within? How about teaching at a Community College wearing a plain sweater? But he is also extremely kind and polite, the material is interesting (with some exceptions) and in the end the class is an easy A (just don't be late for assignments or he will fail you or just threaten to fail you). You don't need to do all the reading, just go to class.\n\nWorkload:\nTwo papers, one midterm and one final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 04, 2014",
            "review_content": "\nHe's extremely intelligent and makes the class discussion a challenging and interesting one to be apart of. An impressive speaker his class is fun to listen to, although he arguably lectures at you a bit too much. There is no bullshit it his class, he doesn't try to emphasize the importance of all these classics and has a very modern and young perspective on a very old class. He expects your work to be done, no real extensions are granted. His grading is fair, if not a tad harsh. Great Professor, you are lucky if you have him for lit hum. \nWorkload:\nNormal\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 29, 2014",
            "review_content": "\nProf Gamber is maaaaad chill. He's just a cool dude in general: he always dresses on point, and always has an interesting story to tell. His classes are always engaging, and the way he talks/the impressions he does are always great. Gamber is one of those adults that teenagers consider cool and look up to; he knows bullshit when he sees it, and not only is he willing to call you out on it, but will think it's funny and laugh along with you. He's eloquent, witty, quick on his feet, and intelligent. It's also really interesting to hear him connect themes in the texts with themes that have roots in other fields. He really makes the texts applicable across time & studies.\nHe's also not one to force discussion when he sees that we're all drained out. Classes are usually out early by 20 minutes, which is great. He expects daily responses every week, but they're really easy and you can talk about anything.\nI wish I had him for a different class than Lit Hum though. He does not like Literature Humanities, and you can tell even though he never explicitly says it. He's always saying how it's ridiculous that CC expects its students to get through the syllabus at the pace it sets. If I had him for a class he was actually really interested in teaching, I'm sure I'd have the most amazing experience.\nSomething annoying is that his office hours are \"by appointment\", and he's very unresponsive over email. He also gives literally no feedback/comments on anything.\nThis semester is the last semester he's teaching Lit Hum ever, but still. He's a great professor and you should definitely take a class with him if you can.\nWorkload:\n2 essays, one 5-6 pages, second (synthesis) 8-10 pages. Both have very broad prompts.\ndaily responses\n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "January 08, 2014",
            "review_content": "\nI highly recommend this course. This is probably one of the best courses I've ever taken at Columbia. Gamber provides very analytical and interesting lectures, so going to class really helps you come to insights that you might not have realized by just skimming the texts or online summaries. My only regret is that I didn't go to class as often as I should've and didn't have much time as I would've liked to read the books, all of which are extremely fascinating and thought-provoking. That said, this class is probably an easy A if you go to all the lectures and have a good understanding of the works. I only read three of the books in the syllabus and attended half the lectures. I wound up with an A-. \nSo word of advice: You don't necessarily have to read all the books, especially if you are pressed for time with a really demanding course load. I mostly relied on online summaries to get the gist of most of the books, which, in retrospect, was a shame because all these books are what I would have liked to read in my spare time. You should definitely go to all or most of the lectures though  (something I wish I did), especially because the midterms and finals are so much easier to study for if you go to class and take notes. I would also heavily recommend meeting with your TA to discuss your essays before submitting them. Take note of what the TA says he/she wants to see in your essays and incorporate anything he/she suggests. You'll get a much higher grade, especially because your TA is the one grading your essays. \nWorkload:\n2 essays, 1 midterm, 1 final\nmandatory discussion sections,\nAll very manageable and easy if you go to lecture\n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "November 18, 2013",
            "review_content": "\nJohn Gamber is thought provoking, engaging, with an understated brilliance. I enjoyed every single novel on the reading list as well as the discussion sections.He works hard to provide his students with quality lectures and it shows, truly. Best class thus far!\nProfessor Gambers lectures cover topics on race, gender, violence and politics. Some of the lectures cover sensitive issues in these areas but they are always presented in the most elegant and respectful manner. Controversial discussion topics only made for very interesting lectures, my only regret is that I wont be able to take another one of his classes.\nWorkload:\n2 papers, midterm, final, discussion section graded on participation.\n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "December 25, 2011",
            "review_content": "\nGamber is definitely not a gold nugget professor. If you are looking for someone who will really constantly challenge you, and force you to examine texts on the highest intellectual level possible, Gamber is most certainly not your go-to professor. If you are looking for a professor who will not make blanket statements against \"the man,\" against Columbia, against really anything in America that has money, but will rather qualify his statements and in a thoughtful fashion pinpoint specific issues that wealthy, white America needs to fix, then again, don't be prepared to be blown away by his style.        \nNow for the good parts- I did enjoy Gamber's class overall. The reading list (for the most part) contained really fascinating books. We learned to read books that I would usually read for leisure as serious novels that made powerful statements about immigrants and minorities in society. I came away from the class with a fresh perspective on immigrant novels and the challenges different groups face in America. \nGamber is WAY to reliant on his slides which definitely takes away from his lectures, but he had good insights into the books, and was always entertaining.  \nThat being said, he could have tied in the theme of the course- immigration, relocation, and diaspora- into his lectures more. I was especially disappointed on the last day when he did not offer any real conclusion or further food for thought.        \n\nGamber seems really young, and I think has the potential to be a fantastic professor at Columbia. I just think he needs to mature a little bit and learn to articulate his own ideas in a more thoughtful manner. \nWorkload:\n2 papers, midterm, take-home final, weekly recitation. One book/week. Not too bad. Recitation often felt like a book club because the books and conversation were so good. \n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "January 12, 2011",
            "review_content": "\nBy far one of the best classes that I have taken while at Columbia. As a person who doesn't like to read, I became super excited to read all of the books on the syllabus. Like seriously, every single book was amazing and each conversation that followed was really engaging. It was also really nice how often the conversations tied back to our experiences as people living in the United States, as people with histories and cultures, and as Columbia affiliates. \nProfessor Gamber really allowed conversations, as opposed to class discussions or lectures, to flourish and that is much appreciated. I think everyone, if not mostly everyone, felt that they could truly express what they thought about the books, the characters, the plots, etc without feeling hesitation or reproach from the professor. \nHe also was willing to change the reading assignments when he realized that they were too long and maybe unmanageable. This demonstrates that  the he maybe wanted to have good discussions (which I take more away from), as opposed to just \"teaching\" the material. \nStupendously-amazing class. So seriously, take any class with him. \n\nWorkload:\nGreat, manageable readings (something like 1 short book per class or half a book, if longer); one weekly response; one 8-10 pager. \n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "December 18, 2010",
            "review_content": "\n     John Gamber is by far the best professor at Columbia. He is engaging and excellent at leading and allowing the students to influence the direction of class discussions. He is well versed and knowledgeable about the books in the syllabus and context of the texts above and beyond whats written on the pages. Immigration, Relocation and Diaspora met twice a week and it always felt like there wasn't enough time to discuss everything we wanted to discuss. I'd have to admit that leaving class each day was always a little difficult because our class time honestly felt too precious and worthwhile to wrap up. Participation is key, as it is 25% of your grade, and one of the largest ways you will get anything out of the course. If you take any class by Professor Gamber it is guaranteed that you will look forward to attending class each day. Most, if not all days felt like we weren't even attending a class at all. The class was like a weekly enchanting book club, always leaving you with a new profound thought or idea as you left.\n   The catch however is that there is usually a required reading of one book a week. Yes, I know it sounds like a lot, but they are not your everyday, mundane selections of the western canon with critical acclaim. As a person who loves to read, I would admit to gaining a new collection of all time favorite books through this classes' syllabus. Although I am someone who often gets away with doing little to no reading for a class, I will be quite honest when I say I read and enjoyed reading every bit of the page turning books we were assigned to read. The plot and endings of the books always left you breathless, gently putting the book down, and feeling a smile slowly run across your face. I would highly encourage this class to anyone and everyone who loves to read and talk about the depth to which books are able to connect to the everyday lives of us, our peers, and citizens of the world. John Gamber was phenomenal in his teaching as a global citizen, and will genuinely leave you feeling like a brand new person. \nWorkload:\nAverage one book a week, some longer than others. Weekly reading responses after you've finished the books of 1-2 pages double-spaced. An in class midterm of passage id's + critical analysis -very fair and straightforward if you've gone to class and done the readings. A final paper that is very flexible with options for essay topics including media outlets or even creating a fictional narrative, 8-10 pages double spaced.\n"
        },
        {
            "course_name": "Immigration, Relocation, Diaspora",
            "review_date": "December 18, 2010",
            "review_content": "\nThis is a review for: Immigration, Relocation, and Diaspora\nThis literature class focuses on minority authors who have written about their immigrant/relocated/diasporic communities.The novels are AMAZING. I wasn't really sure what I was getting myself into when I signed myself up for this class because I don't enjoy reading. I don't read for fun, I barely read for classes,and I didn't think I would all pick up these books to read/participate. There ended up being only 4 people in the class, including myself. I READ ALL OF THE BOOKS AND I LOVED THEM. The 5 of us would have informal discussions about these interesting/beautifully written books. Every class I went to I was excited for. Professor Gamber is brilliant and very personable. He never shut our ideas down and was easy to talk to about anything. This class has been the best class I've taken at Columbia by FAR.\n\nWorkload:\nWeekly responses on the books, in class midterm, 8-10 pg paper for the final.\n"
        }
    ]
}