{
    "prof_info": [
        {
            "prof_name": "Ted Mosby",
            "prof_id": 9992,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Architecture 101",
            "review_date": "September 26, 2012",
            "review_content": "\nTed Mosby is just like the best professor ever. Like, um he is just so smart and like, um he has that dreamy look and like um, he knows all about this girl named Robin, and she is like, um the prettiest girl ever, just saying.. \nLike um, he knows all about those big, tall buildings, and like, um he did not make me to write this review. Anyway, the way he presses the button  so that his presentation would go forward is just the best. And like um, yes I am American, not Canadian.\nLike um, i just love the way Ted talks and he never notices nobody is listening to him, thats how much he loves his job. Like, um yall are lucky he is your professor. Even though he is kinda eccentric and weird and just not normal, like um he is great.\nLike um, i just love him. AS A FRIEND OF COURSE.\nLike um, he is so great and helpful. Like um, you all would be lucky if he was your friend, but he is my friend. So yall can just die ! \nLike, um...\nWorkload:\nLike, um, a lot? Is that good?\n"
        },
        {
            "course_name": "Robin 101",
            "review_date": "March 10, 2012",
            "review_content": "\nTHIS IS DOCTOR X SAYING PROFESSOR MOSBY IS A GREAT PROF. AND REALLY COOL GUY. ALTHOUGH WESLEYAN IS A PRETTY COOL SCHOOL TOO. I THINK GETTING RID OF THE ARCADIAN WAS DEFINITELY A GOOD THING, HAD TO GO! Also, don't mind Barney cause he's just an idiot, whatever you do don't give him your number! oh and if you go to Wesleyan and your in orion hall your pretty lucky!!! oh and if you ever meet robin, seriously count how many times she say's \"Like, um\"\nDOCTOR X OUT...\nWorkload:\nWHO IS DOCTOR X?!?\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "February 06, 2012",
            "review_content": "\nNot the best lectures. They felt kindof scripted, and the course really had little to do with introductory architecture. It was pretty much just a never rending slideshow of his favorite buildings. Professor Mosby's personal life seemed like a much higher priority than teaching. All in all, he was a really cool guy, though perhaps an inappropriate professor. He likes to go drinking with his students, many of whom are underage, and I've heard that he's sleeping with a girl in my Economics class....\nWorkload:\nHardly anything at all, seriously just like 30 minutes a week.\n"
        },
        {
            "course_name": "20th Century Architecture and City Planning",
            "review_date": "January 16, 2012",
            "review_content": "\nProf. Ted Mosby is Hot <3\nWorkload:\nWork?\n\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "January 08, 2012",
            "review_content": "\nProfessor Mosby is really mean and insensitive.\nI am a foreign student and worked very hard to go to Columbia, and I was actually enjoying Architecture 101, until Professor Mosby humiliated me because of my name. Apparently, my name sounds funny in America, but it doesn't justify Professor Mosby's mockery. It was really hurtful and made me quit. \nThe classes itself were actually good. Prof. Mosby tries hard to give good lectures and he is the friendly type. Sometimes he tries too hard, like when he put on a hot dog costume in Halloween. Of course I didn't see that, because I was not in his class anymore, but everyone in Columbia was laughing about it behind his back. He is also a respected architect and is designing a skyscraper in New York City.\nBut I WARN you, if your name is Cook Pu, do not take this class, no matter how good it sounds!! It's not worthy of being publicly humiliated! \nWorkload:\nNot Asian level. Very easy. \n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "January 04, 2012",
            "review_content": "\nTed Mosby is a jerk. How can someone so smart be so effing stupid? He's lucky that someone felt sorry for him and got him the job as a teacher because we all know he would not have got the job by himself. He is very unorganized and he constantly leaves in the middle of class (He's the Axl Rose of teaching). He's always showing silly pictures of random buildings, and he sometimes feels the need to add in pictures of hot girls, maybe it's his way of subtlety bragging. And why is he always at the bar? Every single day him and his friends sit in the bar and drink. He's in terrible shape, he needs to get some exercise. I saw him at the gym several times but he never actually did anything.I also saw him on tv one time, trying to pick up on the news reporter. He has taught more about his love life than he has architecture. In fact, until the hot blonde girl came in and complained about him tearing down an old shitty building that probably has snakes or other disgusting creatures in it, I was sure he wasn't actually an architect but just some crazy guy with a building fetish. If you want a good laugh about how lame ones life can get, then take his class. If he want to learn about architecture, you have come to the wrong place. He also has his own website: www.tedmosbyisajerk.com \n\nWorkload:\nNot very much. It's mainly just him asking stupid questions and rambling on about things.\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "November 05, 2011",
            "review_content": "\nFuture Ted, voiced by Bob Saget, narrates the entire series to his children in 2030, framed as the story of how he met their mother. As of Season 6, the kids only know that Robin, Stella, Victoria and Zoey are not their mother, and the real mother has yet to be revealed.\nSome clues given are that Ted's future wife is a college student learning economics, who was in the classroom on Ted's first day as a professor, is the roommate of Ted's one-time-girlfriend Cindy, and that their meeting involves her yellow umbrella. It was also mentioned that she was at the same nightclub as Ted and Barney on St. Patrick's day. There are indications that Ted meets his future wife at a wedding in which he is the best man, and there is a very strong implication that Barney will be the groom at said wedding.\n\nWorkload:\nwikipedia\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "October 18, 2011",
            "review_content": "\nI picked up Introduction to Architecture this semester and I found it quite fun and interesting. Prof. Mosby gave us a tour around NYC, Prof. Mosby's apartment, McLarens bar and we even got to meet a German family touring N. During the tour Prof. Mosby and Assistant Professor Barney made us thought questions that made us think deeply. Also, Assistant Professor Barney teached us about the Ewok theory, which has been a enlightenment on my life ever since.\nI think that if I can not achieve a career in tattooing I'll give Architecture a chance.\nWorkload:\nBring comfortable shoes, will walk.\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "September 21, 2011",
            "review_content": "\nMy name is Zoey, and i cannot state how much of a hypocritical (expletive) this guy is. He goes on and on about architectural marvels yet he wants to singlehandedly tear down one of the most beautiful buildings on the NYC skyline.\nAlso, what kind of professor drinks with his students? I vote professors have to complete AlcoholEdu too. If the school admin saw the way he was downing shots, he'd be in serious trouble. I wouldn't be surprised to learn that he's been CAVA'ed before.\nWorkload:\nI didn't really do his work; i just protested outside and ended up with an F. What a mean professor.\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "September 14, 2011",
            "review_content": "\nI had a \"sandwich\" with Prof. Mosby the other day and believe me, he's quite the closet sandwich connoisseur. He's given me lots of great advice and tells me that I remind him of himself back at Wesleyan College.  I've learned more about architecture in his class than anywhere else and I'm honestly beginning to wonder weather it's for me. \nOther than that, Prof. Mosby, who kindly lets us call him Ted, really does try hard. I mean, I'd imagine this is what all \"newer\" teachers would do, but he's not jaded yet, and that really means a lot when you go to Columbia. \nJust one bit of warning, if you hate bad jokes, don't take this class.  \nWorkload:\nPlease? pff... actually he's pretty decent about it... day to day assignments aren't too bad. \n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "June 07, 2011",
            "review_content": "\nI think that he is adorable, he's so dreamy, when i look into his eyes I get lost.  Ted is a little bit eccentric but all in all he's a good guy.  He also knows a lot about architecture and sometimes he even plays drinking games with us (But umm...) !! I love this guys! Best prof ever! Architecture 101 for the win!! I think that I would like to have him again next year, because he's simply AWESOME, and also legen...wait for it...dary! \nWorkload:\nWe have to do work in this class!? I was so distracted by his good looks I didn't even notice\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "May 04, 2011",
            "review_content": "\nI've gotta say, I don't see what all the fuss is about this guy -- he's the worst prof I've ever had!  He's scattered, goes off on personal tangents all the time, and honestly?  I don't think he even knows that much about architecture.  Sometimes it feels like someone just felt really sorry for him and gave him the job out of pity.  Or like he's an actor just reciting some lines about architecture.  I don't know.  Maybe it's just me.\nOn the plus side, his quirkiness keeps me from being bored in class.  Usually I can find some entertainment by focusing on those ridiculous blazer/sneaker combos he keeps wearing.  Seriously, how can he possibly afford this many pairs of sneakers on a prof's salery?  And I guess it's kind of cool that he knows Robin Scherbatsky.  Meeting her was worth the tuition I paid for the class.  \nWorkload:\nNot too bad -- this guy is so scatterbrained that he forgets a lot of what he assigns.  And he's usually pretty busy on Monday nights, so he never assigns any weekend work.  \n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "April 09, 2011",
            "review_content": "\nAs a Professor he's fine, though maybe a little disorganized.  He gets side tracked in class a lot and occasionally mixes up his slides (sometimes with hilarious results!).  On the plus side he is a super easy grader, though very strict about spelling and grammar mistakes, and this one time he corrected a students pronounciation of Encyclopedia.  \nI have to admit the highlight of this class for me was hooking up with his friend Barney.    \nWorkload:\nNot to bad, mostly nights.  \n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "March 12, 2011",
            "review_content": "\nSurprisingly a good professor.  Really seems to care about his students.  Plays hacky sack.  Was nice enough to come out drinking with us (even though it turned out horribly wrong after a bad game of \"but um\").  I've never had a professor bring students so deeply into his life.  I mean, I've met like 4 of his girlfriends.  Although he allegedly is knocking down a great building, he'll be sure to design the greatest building on New York's skyline.  Much love T-Dawg!\n\nWorkload:\nHere's what you all really want to know:  little to no homework.  T-Dawg has too much going on in his life to grade papers.\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "November 06, 2010",
            "review_content": "\nI was in Professor Mosby's Architecture 101 class, and he was the worst professor I ever had.  He kept making fun of my name! It was too bad; I really liked him at first, too. He seemed really funny and interesting...but he wouldn't stop making fun of me, so I dropped his class. \nWorst of all, I think he might have been following me; there's this bar I go to called McLaren's on 55th. I went in there one day to get some takeout, and he was there too, and he made fun of my name! Again!\nI don't know how he is as a professor, because I didn't hang around long enough, but as a person, he SUCKS! Nobody should take his class.\nWorkload:\nI don't know, I don't care. Just don't take his class.\n"
        },
        {
            "course_name": "Economics",
            "review_date": "November 21, 2009",
            "review_content": "\nProfessor Mosby is in the architecture department, but he somehow managed to lecture for the first fifteen minutes of my economics class this semester!  He was a bit unsure of himself, but I thought it was endearing. For some reason, though, he refused to take any questions and really could not take the hint that he was in the wrong class; when he finally figured it out I don't think he could have been more embarrassed.  Poor guy.\nCome to think of it, I believe I saw him once before on a St. Patrick's Day!  I wouldn't mind seeing him again.  He is kinda cute...\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "November 20, 2009",
            "review_content": "\nI do not understand all the negative comments about Prof. Mosby. He is a nice, approachable teacher who knows his stuff. Granted, he does go off on tangents a lot, sometimes with stories that are not appropriate to tell a group of students, but it just makes his class all the more enjoyable.\nThis is an intro course, and that is exactly what he does. He introduces you to architecture and does a great job doing it. If you want a more detailed and specific syllabus you have a problem with the course not the professor.\nGive him a break! Its his first semester!\nAlso, awkward, I spotted him at MacLaren's on 55th. He was hitting on girls with one of his douchey looking friends who was in a suit.\nWorkload:\nManageable. Weekly assignments. Midterm. Final project.\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "November 15, 2009",
            "review_content": "\nHe's a really nice guy but can seem a little too attached to his students at times. I once stopped by office hours to let him know I was really enjoying the class and was considering architecture as a career. The creep said he loved me. \nIt seems like a lot of people like to call him \"T-Dawg.\"  Has anyone else noticed that he sounds exactly like Bob Saget when he uses the mic?\nHe rambles on for quite sometime and doesn't get to the point of most of his lectures and stories.\nHis teaching is strong but he seems to not have been successful as an architect and just ended up teaching as a back-up plan.\nWorkload:\nNone, if you manage to pretend to pay attention to his long, near-obsessive relationship stories.\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "November 15, 2009",
            "review_content": "\nProfessor Mosby really knows what he's talking about, if you have the patience to listen to him. His stories are long and seem to ramble on. He takes himself too seriously, even though he doesn't really seem to have that much experience in the field. \nThe worst part of his lecture is that he continuously makes awkward jokes about things \"college\" kids supposedly can relate to, so they he can seem young and hip, but its really him trying too hard. \nOverall, If you can stand his arrogance, this is not too bad of a class, and if you're willing to laugh at his jokes, you might even enjoy it. \nWorkload:\nHW every week, not too bad, midterm that was deceptively difficult, and a final project (don't expect any help!)\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "November 15, 2009",
            "review_content": "\nAlright, so admittedly, Prof. Mosby's a likeable guy. He's surprisingly young for a professor, funny in an accessible kind of way as if he were in a cheesy sitcom, and seems to know what he's talking about. The problem is, he's really unorganized in the classroom. It's almost impossible to follow his lectures as his Powerpoint slides are mostly just contextless pictures of buildings he really likes. There doesn't seem to be any rhyme or reason to their sequence. In fact, I'm not sure how much thought Prof. Mosby gives to his lesson plans as the slideshows seem pretty rushed and slapped together. One time in lecture, he accidentally included a random picture of some woman going to the bathroom, which was gross and actually pretty offensive. Actually, the entire class seems to be really shallow masturbatory overall, as if Prof. Mosby's more concerned with going through the buildings and architects he really admires, and thereby reliving his failed dreams of becoming a famous architect, rather than giving us a solid introductory overview over architectural history.\nHe does remind me a lot of Danny Tanner in Full House though, which sorta mitigates his haphazard lectures.\nWorkload:\npretty light. problem sets, midterm, and a project. no final\n"
        },
        {
            "course_name": "Robin 101",
            "review_date": "November 15, 2009",
            "review_content": "\nThis is Professor Mosby's other class that he teaches besides the Introduction in Architecture class.  The class is really difficult due to its size and the one other student in the class who throws off the curve.  The few others students in the class seem to fall asleep very often, as the class is offered only at an extremely late hour. \nUnlike Mosby's architecture class, he is extremely knowledgeable about the subject.  He likes to work powerpoint slides and pictures into his lectures, so even if you don't pay attention the his voice or what he's saying, the slides seem to show most of the material.  \nThe material isn't too challenging.  It's important to study hockey, guns, and emperor penguins, as they are the main topics in the class.  It's also important to note learning about topics that Robin Mosby warns against, like youtube videos of animals playing musical instruments.\nOverall, the class is pretty easy.  A few difficult topics, and Mosby curves the class which will hurt most people as the size of the class is small.  He definitely knows what he's talking about, and you truly learn about Robin Scherbatsky .\nWorkload:\nWeekly problem sets and a really difficult final exam featuring Robin herself\n"
        },
        {
            "course_name": "Architecture 101",
            "review_date": "November 15, 2009",
            "review_content": "\nTed Mosby is a young and dynamic professor.  He gets his material across in a interesting, but mildly douchey way.  He corrects the smallest mistakes and misspellings, and likes to talk about this one building in Seattle that nobody has ever seen.\nOverall the class is pretty entertaining.  There was this one time he was showing an architecture slide on some more unique buildings, but he mixed up the slides and we actually saw a few pictures of this hot girl on the toilet.  I'm not really sure how he got the job as a professor, as he is young, and immature in this sense.  He may have even wanted to put the picture up there on purpose.  He must know somebody that got him the job. \nHe was also extremely late to class on the first day, and therefore is not very self-aware.  He always wears a sweater vest and tries to pass it off as being very \"professor-like,\" even though he is just a few years older than us and probably only owns like two vests.  He also uses too much hair gel.\nOverall, a solid professor.  Definitely entertaining class, and gets the material across in a successful way.  His sense of humor and attitude keeps the class from falling asleep despite his sometimes pertinent ego.\nWorkload:\nWeekly problem sets, midterm, no final but an architecture project \n"
        }
    ]
}