{
    "prof_info": [
        {
            "prof_name": "Marc Masdeu",
            "prof_id": 10392,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "April 12, 2013",
            "review_content": "\nI am going to have to three way the past two reviews to say this --\nmarc is a nice guy - yes thats true - but when it comes to teaching he simply is not that great. i had to basically teach myself through extensive review of the text, online sources etc because he does not teach in a way that a student can establish the fundamental concepts. so at the end, my gpa was shot down, but because I resorted to other sources and made the extra effort to actually learn the subject properly, I do GET the topic. not sure if that made up for the dent in my transcript, its a sad reality- but if I were to advise anyone, i would say, take the course from someone else, regardless of whether you really want to learn or whether you are afraid of a-bombing your gpa. you can find another venue to get to know him if you really want to.\nWorkload:\nweekly hws etc - usual\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 26, 2012",
            "review_content": "\nThe previous review is SPOT ON. \nThis professor does not understand that math does not come easy for everyone and there are students in his class that simply need a class like CALCULUS I to fill a prerequisite. A class at this level should not be hard at all - yet his class seemed impossible most times.\nI felt like the entire semester I only worked for his class. Seriously, his homework took me ALL WEEKEND. I neglected other classes because of the workload in this class - and what did it get me?  B- !!\nHis class is seriously made for students with an advanced calculus background.\nBASICALLY:--- DO NOT TAKE CALCULUS WITH MASDEAU IF YOU DO NOT KNOW CALCULUS ALREADY BECAUSE HE WILL NOT TEACH YOU.\nWorkload:\nTOO MUCH TO HANDLE. MOSTLY USELESS. NOT WORTH IT AT ALL WHEN HIS TA'S LOSE THE WORK!!!!!!!!!\n\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 19, 2012",
            "review_content": "\nDo not take this class unless you have taken BC Calculus and got an A+ or a 5 on the exam. Maybe not even then...\nMarc is an extremely nice guy, and he devotes a lot of time to the class, but he is a terrible teacher. He spent entire lecture hours explaining one concept, but it was extremely unclear and he taught way too fast, making it impossible to copy down notes and understand them at the same time- something that shouldn't be impossible for someone who goes to COLUMBIA especially if it is feasible in other classes. Also, he made a lot of mistakes while doing problems on the board, which is not his fault but it made it even more confusing when we had to stop and redo entire problems.\n I had already learned most of the material we covered in class this year, and got an A in high school calculus but Marc confused me to an extreme reteaching it and I will be lucky to end up with a B in the class- but this is only with the curve! I should actually have a 55%. \nDo not take this class if you can avoid it!! It's really just not worth it. \nWorkload:\nWeekly homework and Web assign- complete waste of time, the two lowest scores are dropped, and the problems are impossible yet irrelevant to the class. Expect to spend at least 4 hours a week completing both. In addition- the TAs lost our written homework on several occasions and we were given zeros, even if we had completed the assignment. Marc did nothing to fix this even though several people emailed him. \nThe 2 midterms are impossible- both exams are composed entirely of material that is not covered in class or on the homework.I believe the lowest score is dropped. Our class average was a 40% and Marc blamed it on us. I don't think anyone got above 18 out of 20 points for the second midterm and only one person got 18. \nThe final is split into two part- half the problems are starred which signifies that they are \"extremely\" easy and the other half are supposed to be the harder problems that you should do if you want an A+. According to Marc you should not even try the true or false extra credit because that's only if you are worth an A. Let me just tell you, most of the extremely easy problems are extremely difficult and the hard ones are almost impossible. Most people took close to the full three hours for an 8 question exam. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 11, 2012",
            "review_content": "\nI could not agree more with the review below this. Coming from High School, I had a solid B average in the class. But let me tell you something, this class has become the death of me and is making my experience here at Columbia an incredible rough one. He is by far one of the worst Calc professors there has to be. \nI ADVISE YOU: DO NOT TAKE MASDEU'S CLASS.\nIf he's the only professor available, wait till next semester. You will thank me. But if you have to, be prepared for wasted nights on Homework that has no relevance to class, wasted nights stressing about if you will pass or not, and wasted nights reviewing for midterms that will ultimately be COMPLETELY different then what you studied.\nI am currently enrolled in this class, unfortunately, and I cant take it. He does not listen to anyone, he talks way to fast, and he assigns so much work. Dont get me wrong, he seems like a \"nice\" guy, but as a Calc Professor, by far the worst.\nWeekly Webassign and Written Homework. = 5+ hours of work. Lowest 2 scores dropped\n2 Midterms= extremely difficult. The class average was a 40%. 40%!!! Yet he blames us...clearly there is something wrong with your teaching if its this low.\nFinal=I have no idea what to expect.\nAll in all, avoid this class like the plague. Otherwise you will seriously regret it like I am. This was supposed to be a booster, but now could do serious damage to My GPA/Transcript. \nWorkload:\nWeekly Webassign and Written Homework. = 5+ hours of work. Lowest 2 scores dropped\n2 Midterms= extremely difficult. The class average was a 40%. 40%!!! Yet he blames us...clearly there is something wrong with your teaching if its this low.\nFinal=I have no idea what to expect.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "October 25, 2012",
            "review_content": "\nLet me be honest. \nMarc Masdeu is hands down the most terrible Calc teacher I've ever had-- and that's saying something. I came from an incredibly challenging high school where I aced AP Calc (with what I then thought was a \"terrible Calc teacher\"). Since I don't want to major in anything math-related, I took Calc 1 as a grade booster. Grade BOOSTER. Jesus that was a bad idea. Masdeu somehow manages to talk the entire class period without teaching you anything at ALL. I honestly still fail to see how it's possible that he's managing to unteach me everything I thought I knew well, and then reteach it to me in a horribly confusing way that lands me in a worse position than I was when I started the class. And don't even think abou trying to just skip class and do the homework-- his homework does a really great job of \"branching out\" from the Calc book, which means that you're forced to teach yourself from the internet. This is not what I'm here for. \nHe did ask us to tell him what to change about his teaching, and I wrote him a long message that he so far seems to have ignored entirely. What the other reviewers say is true, he's a nice guy, but I don't care about how nice he is-- I want someone who can teach. \nI know it's easy to read the reviews on culpa and think that it will be different for you, but trust me, I'm speaking for the solid percentage of the class that spends all their free time in the helproom, the solid percentage that I see with 30-40% class averages, and the solid percent who did the smart thing and dropped the class after the first midterm. \nAll I can say is do. not. take. this. class. \nWorkload:\n2 midterms, drops lower score. 1 final. 4+ hrs of homework weekly. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 30, 2012",
            "review_content": "\nProfessor Masdeu is incredibly nice and helpful. I thought he did a good job of explaining the concepts and emphasizing the accessibility of his office hours. He did have little patience for people who were just scraping by, or taking the class because it was a prerequisite, and didn't care about really understanding the material. Masdeu expected some measure of interest and commitment to the material, but was then an excellent professor. As someone who took Calculus only to fulfill the econ prerequisite, I still thought Masdeu did a great job helping those people who asked for it!\nWorkload:\ntwo midterms, weekly homework and webassign problems, and a final exam\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 17, 2011",
            "review_content": "\nHe is a nice guy and incredibly smart but does not realize that math does not come easily to everyone. He is always surprised when someone asks him to repeat a step or to go back and explain something. He doesn't seem to process that you may not immediately understand and will usually skip multiple steps while solving problems out on the board which makes it a lot worse.\n\nThe homework often takes an unreasonable amount of time to complete, not so much because there is a lot of it but because while doing the homework you will realize that you learned nothing in class. He spends too much time trying to explain the concept and not enough on doing actual math. You'll leave the classroom with an understanding of what a derivative is but no idea how to actually calculate one.\nThe homework problems and class examples were misleading. If you can do 70-80% of the questions in the textbook, there is no guarantee that you'll pass his tests. His tests are very much based on your ability to recognize a random substitution at a very specific time, so if you don't remember to substitute (sin x) / x for 1 at the right time, you will get the problem wrong. \nDo not take math with Masdeu unless you are extremely math inclined.\nWorkload:\n10% Written homework, 10% Online (webassign) homework, 40% Midterms (two midterms), 40% final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 11, 2011",
            "review_content": "\nI was in class for two days. That should be enough for a review on this \"professor.\" \nThis is what I learned: \n\"You know when cartoons get into a washing machine and they get dizzy from the spinning, well if they got back in and spun the other way, they would not be dizzy anymore. Makes sense?\" (Masdeu, 1st day of class). \n\"God created the natural numbers 1,2,3... maybe 0\" (Masdeu, 2nd day of class).\nThis class is a joke!\n-'nuff said\nWorkload:\nWeekly online and textbook assignments\n2 midterms/ 1 final\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 26, 2010",
            "review_content": "\nThe material he covered in class was not relevant to the homework, the homework and review sessions did not prepare us for the exams, and neither the exams nor the comprehensive extra credit review he assigned could have prepared us for the final. In class, it often seemed as though he utilized the least direct problem solving strategy possible, making it even more difficult to process the material he was presenting in order to gain a strong grasp of the material (that of which he did actually cover, of course). Furthermore, there were instances in which, despite having prepared his solutions, he struggled to solve the very problems that he himself had assigned. I'm not sure anything could ensure success in this course, but a masters in math might help. Or better yet, just don't do it!Â \nÂ \n\nWorkload:\nHomework (online and written) was time consuming and misleading; success on the homework assignments constructs a false sense of security that crumbles come test time. Office hours did little to help. Exams (two midterms and a final) were not relevant to the material covered in class or on the homework.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 22, 2010",
            "review_content": "\nHe is a very nice guy but he is an awful teacher.  I believe he once told me that I was not going to learn anything from him, thats what the text book is for, and he was right I learned nothing from him.  The homework is not terribly difficult, once you teach yourself how to do the problems that is, and this can be very misleading when test day comes.  I was able to do every problem in the text book but somehow struggled immensely with his tests.  His questions do not simply ask you to know the math, but how to apply the math he \"taught\" you, and since I am not a math person (nor is anyone taking calc I) I had a lot of trouble.  Do not take a class with him if you can avoid it, he will make your semester very unpleasant. \nWorkload:\nweekly hw, 2 midterms (very difficult, first harder than second), a final that will take years off your life\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 19, 2010",
            "review_content": "\nCalc 1 is difficult if you've never been exposed to the theory of calculus. Professor Masdeu focuses a lot on the theorems involved, and how to use them, and not much on actual \"plug and chug\" mathematics. This can either be a good thing, or a bad thing, depending on how you learn, because if you never understand the theory, you won't pass his exams. You also have to implicitly know how to do the basic mathematics, because it is assumed you will be able to solve the problem after he shows you how to apply the theory. He also forces you to think mathematically, not just as a problem solver. \nIt was difficult at first to get used to the style, but after the first mid-term, you realize that you have to focus more on how to learn and apply the theorems to calculus than how to actually arrive at an answer to the question asked. Masdeu is a really nice professor, and seems to enjoy teaching, though I'm not sure if the realizes the incredible difficulty of his exams. He is very eager to give partial credit, if you look like you have a clue as to how to answer the question, in this I disagree with the previous post. \nPersonally, I enjoyed the class, because it literally made me interested in mathematics, not as a problem solving device but as a tool to understand how the world works. Most people in his course, however, would likely disagree. The workload is rough (though I'm not sure it is any worse than any other Calc class); I spent about 6-8 hours on Saturday working on an assignment, and then would go to the Math Help-room for about 2 more hours during the week to complete it. The exams are honestly very difficult, but if you understand the theories and how to apply them, he will award partial credit. There is also a big curve, which means that you don't have to worry about your grade. If you got a 30% on the exam, that means you knew 30% of the calculus that you were supposed to have learned, not that you will fail the class. \nIn all, the class is challenging, but it is \"real math,\" and for that, it is interesting. Masdeu is a good professor, because he focuses on the math and theories, which is fundamental to understanding calculus. I do however, recommend the help room, and office hours; there you can learn more the steps to come to an answer for the problem, than just the theory taught in class.\nWorkload:\nOne written assignment a week (5-10 problems, 12 assignments), and one WebAssign assignment a week (6-30 problems depending on difficulty, 10 assignments). At the end of the term, your top 18 homework grades are counted for 20% of your final grade. Two midterms (20%) and a final (40%). \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 18, 2010",
            "review_content": "\nFirst, let me start off by saying he's not a bad guy which makes the entire class even worse due to its horrendous difficulty. He got his degree recently and he is incredibly smart and I think that is what is limiting him. He seems to have issues with the idea that calculus is difficult if you don't have a math degree. Almost all the work will be incredibly theoretical and so when you get to the mid term (we had two the first had 7 questions and the second 4) you will find yourself spending a significant amount of time blathering through things. \nThe homework is incredibly difficult, just because the explanations given are quite scanty. He is more interested in theory, but a slight language barrier means that he spends 50 minutes describing something that could be done in 10 or less. This leaves little time for problems and those he does do, he doesn't clearly explain each step. As a result, you will think you get the material and then, come exam day, he will throw weird items at you in a problem to make it nigh impossible to do in the alloted time. Also, he gives nearly no partial credit unless you were practically right anyway, something that is not helpful when the theories involved means that there is a significant chance that you will have no idea how to do a problem at all.\nI would not recommend this class unless you are a math genius by college standards, not high school, have a significant amount of time on your hands and are willing to sacrifice your GPA\n\nWorkload:\nOnline assignment (offline if you so choose) and written each week. Prepare to spend hours on each.\n"
        }
    ]
}