{
    "prof_info": [
        {
            "prof_name": "Robert Montgomery",
            "prof_id": 1687,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style I",
            "review_date": "August 21, 2003",
            "review_content": "\nThe other July 2003 review of Montgomery is completely on point.  Just to add to it, Montgomery is a writer's writer.  Meaning, he will look for the positive in your writing however bad your stuff is, and always be encouraging.  He is a nice guy, and very laid back.  From what I hear from takers of this class with other professors, Montgomery's class was an easy one.\nWorkload:\nTwo poems, one character sketch, one monologue, one scene and one short story.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "July 22, 2003",
            "review_content": "\nFollowing the Structure & Style curriculum, this class was a survey of basic forms (the poem, short story, play, etc.).  Montgomery comes from a playwriting background, but is a good judge and teacher of other forms as well.  He managed to avoid the usual \"this-is-how-you-structure-a-plot\" sort of claptrap and generally tried to give assignments that would allow us to follow our interests and experiment within forms.\nMost of class time was taken up with workshopping, with two or three interesting readings (Marianne Moore's \"Poetry,\" or a scene from Beckett) sprinkled throughout the semester.  Workshops, if not always helpful, were at least seldom harmful; he was very encouraging to those he considered \"real writers\" and tried to point others in the right direction, too.  If class discussion wandered into the inane, he usually did a good job of bringing it back.\nAll in all, Montgomery is a decent professor with a good sense of fun, but it is a writing workshop, so how much you end up liking it will depend a lot on how much you like your peers.\nWorkload:\nAbout one short writing assignment per week, but with extremely flexible due dates. \n"
        }
    ]
}