{
    "prof_info": [
        {
            "prof_name": "Tanya Zelevinsky",
            "prof_id": 9820,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "August 29, 2014",
            "review_content": "\nTanya is a very sweet lady, but unfortunately, this is where my praise for her stops. Before I go further I would like to note that my poor review of her is not because of a poor grade, I got an A+. \nPerhaps because she is involved with such high level research, Tanya can not understand the questions that students ask her. She constantly uses the word \"intuitively\" as her source of conceptual explanation, which is unfortunate when most students, myself included, have little intuition from E/M. Questions were best answered by her TA Sebastian (who was awesome), or by other resources (Textbook, MIT Open Courseware, etc.). \nLooking back on the material, Tanya's homework and exams were not particularly difficult. However, they were not necessarily easy at the time because Tanya's teaching wasn't clear. She usually either simplified things in the lecture too much to be able to tackle homework/exams, or she used such disparate examples that it was hard to generalize the concepts. However, her homework load is quite light, each weekly problem set only has 2 problems. A great way to check if you actually know what is going on is to do some of her \"suggested textbook problems\" for the respective chapter, but of course, that vast majority of the class does not do this, which perhaps explains why the vast majority of the class didn't understand E/M. \nBecause Tanya confused me so much, I resorted to learning from the textbook, which was fine, but not the best. About halfway through the semester I started watching the MIT open courseware lecture for this class. These videos taught me the concepts in a much more understandable way, after which, I could understand the stuff Tanya was talking about. You can get through Tanya's class with a solid grade by blindly plugging in formulas and treating it like a high school math class, but if you don't go to lectures and instead use MIT open courseware, you will understand the material and do well on the exams. I believe my grade is proof of this. \nPerhaps it will be easier to learn Mechanics from her since, for most people, Mechanics tends to be more intuitive. In general, the difficulty of this class was not super hard, and the workload wasn't very high, so if you can either comprehend her teaching (unlikely) or learn on your own, you'll do great. Most people can't learn from her, but then don't put in the time to learn on their own, hence the reason they do badly in her class. \nWorkload:\nHomework (weekly 2 question problem sets) 25%\nMidterm 25%\nFinal 50%\nDO SOME OF THE SUGGESTED PROBLEMS. THEY HELP. \n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "August 09, 2013",
            "review_content": "\nTanya is a very sweet lady and her lectures were great to attend just for the fact that she goes at a nice pace, pausing at points to answer questions. She also uses a microphone so it's very easy to understand her. Although she mainly teaches from the textbook, I found her notes helpful because they were great summaries of the material that we were learning so they were valuable resources during the midterm and final. At some lectures, she even did demonstrations and showed videos that were relevant to a concept she was teaching. Another thing to point out is that no calculus was necessary in the midterm and final and I believe, the problem sets as well. I thought the midterm and final were very reasonable considering that no calculus simplified problems. Although the medians were quite low, 63 for the midterm and about a 58 for the final, they were curved so for example, the 63 would be a B+. The difficulty in her exams is that she goes over a lot of material so many different concepts are tested.\nMy biggest advice would be to go to recitation. The TA Sebastian was fantastic. He even had some funny quirks such as calling a numerator \"upstairs\" and denominator \"downstairs.\" He teaches more problems and often they were similar to the homework. The problem sets were difficult because none of them were textbook problems and they weren't really based on any previous examples that we learned. \n\nWorkload:\nWeekly problem sets (lowest two are dropped)\nMidterm (formula sheet provided)\nFinal (formula sheet provided)\n\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "July 11, 2010",
            "review_content": "\nProfessor Zelevinsky started out completely affable. I found her charming and exceptionally brilliant when explaining the beginning materials, i.e. chapters 1-8. After which, I had no idea what she was talking about, mainly because she teaches verbatim from the textbook. This is fine for the easy chapters on mechanics, but once approaching simple harmonic motion and waves, I was completely and totally lost and so was the rest of the class. Her exams were another problem all together. I'd have respected her written exams, but only if I had received a practice exam that was of the same model. Her first midterm I did remarkably well on, only because it was simple material and my calculus helped me through. However, for the second midterm, I royally bombed. I prepared more for that exam than the first and was pissed by the grading. I later found out that though I had the correct answer for one of the problems, I should have derived the equation that I used (I chose to memorize it since she did not give us a formula sheet for the first exam). This is ridiculous. If you are going to make someone derive something, put it in the f&%^ instructions. I am also disappointed that we did not go over thermodynamics and fluids since I feel this are more important topics than waves (all the other physics professors at Columbia teach these topics and not waves). Thinking back to the beginning of the course, maybe she wasn't the best instructor, but I just didn't realize it until the material was difficult. I would say don't take her, but Aprile is a nightmare and Budick probably isn't much better. The physics department at Columbia is a disaster. I would rather have Pontus (the saving grace in the physics department) teach the class than some research genius who can't answer simple questions. \nWorkload:\nDoable: 1 problem set each week, two dropped. 3 exams (none dropped so don't fuck up)\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "May 03, 2010",
            "review_content": "\nThis is the course evaluation I submitted for the class, almost verbatim. Hope you find this helpful:\n-----------------------------------------------------------------------\nShe is one of the most effective instructors I have had in my undergraduate career, and probably will be through my whole formal education.\nProfessor Zelevinsky and Christina Romer, my economics professor and now helping the Obama administration communicate economic policies, both fight for first place in terms of teaching effectiveness/clarity. These two individuals are examples of two great scholars who happen to be excellent, excellent teachers. In all honesty, Prof Zelevinsky may actually get my number one spot as econ was my undergrad major whereas Physics is my only science class at the college-level, and also, as physical or biological sciences, unlike econ and to an extent political science, are not and never were my forte.\nThere are numerous examples of why I consider Professor Zelevinsky an undeniably effective teacher. Perhaps one of the many examples might help: In studying the concept of center of mass, I remember having a very difficult time understanding this relatively abstract concept while going over it in the book. TZ's lecture on it illuminated this concept really well, as she went from ensuring we had a strong sense of the basics behind the concept before moving on to the more complicated aspects of center of mass. She further solidified the concept by helping us see the concept more \"physically\" by throwing a disk marked with random points and the center of mass. (These are things that any professor could do, but it is different when a professor actually does explain in this way, in the very specific order and with the right amount of details that TZ without a doubt deliberately chooses to deliver in her lectures). An analogy would be a great story teller who knows when to emphasize something and when not to emphasize the other, and when, at which EXACT moment to deliver the punchline for the best effect. Teaching is an art that TZ is great at. (Not that this can't be learned, so no excuses for other professors).\nOn this point, I want to fault the Physics department at Columbia for what I perceive failing to uphold its mission to teach Physics to generations of future citizens. I was, the semester prior to Spring 2010, a student in Budick's Physics 1 course. I scored well above the mean in both exams, but had to drop the course 2/3 of the way for personal reasons. Assigning him as a professor in an intro Physics course is irresponsible, as he teaches for students who already have a strong grasp of the subject. I would like to cite a specific incident that might support even if not prove my contention: After a lecture last semester with Budick, I remember waiting in line to ask him a question. In the meantime, he was talking to a student who was not sure whether to take the class. This student explained to Budick that he had a strong background in Physics as he had done really well at an IB (International Baccalaureate) program, and thus far, was finding the subject quite easy. Budick gave him a fraternal nod, saying that this class was a fit for him. At the time I didn't think much about this. As time went on and I became more familiar with Budick's teaching style (not that he has one), I beagn to suspect that Budick was only teaching to students who already had a strong Physics background. \nAt best, the Columbia physics department is creating the sense that Physics is not for everyone, and especially the case if you are at Columbia (posturing that is detrimental to learning, and usually reserved for people or institutions insecure of their status), at worst, you are perpetuating social inequality; you are teaching people who for one reason or another (educated parents, magnet school background, \"naturally gifted\" in the sciences) already have a strong background in the subject, and leaving behind others who don't. (Uneducated parents, students of a culture or economic background with a modus operandus different from the one that is best suited to understanding basic physics). Your role as an educational institution is to teach, elevate individuals, not to stimulate at the detriment of other students those who would have done fine even without your intervention.\nGoing back to having taken Budick's course the prior semester, you may be tempted to conclude that that is the reason why I perhaps found TZ's teaching so effective. I think my assessment of TZ's teaching above indicates otherwise, and the fact that although I found the chapters on Rolling, Rotation, Oscillations and Waves difficult (subjects which I had no prior knowledge of and which I never touched on during my time as a Physics I student with Budick), I can say with certainty that I was able to grasp them enough to at least have a way of beginning to become more familiar with these concepts through my own review and through doing problems from the book). Without having been given this preliminary background by Professor Zelevinsky, I would have had to spend a minimum of give and take 20 or so hours to merely understand the the basics needed as a starting point (which would have been the case had Budick been my professor). \nProfessor Zelevinsky is an incredibly effective instructor. That coupled with intelligent and communicative TAs (where I assume that being able to communicate you are best able to \"transfer\" knowledge to others, or at least best able to guide a student in learning the subject most effectively) like Pontus Ahlqvist (and Daniel Chapman), made for a very effective learning experience. This team should not be a sporadic and random luxury for students trying to learn basic Physics, it should be the standard for learning Physics at Columbia.\nYou insult students who want to learn basic physics by assigning Budick as a Physics I or II instructor. If you want to bring prestige to your department, I am sure there are better, more effective and more creative ways to do so. Give EVERY single student who steps into your department the chance to learn basic physics. In a larger social context, contribute to eliminating social inequalities by simply giving students of ALL background the chance to learn basic Physics from Professor Zelevinsky. \n\nWorkload:\nOne problem set per week. Two midterms, one final. \nMidterms were not as straight forward as the homeworks, which is reasonable given how much this professor helps you understand the basic ideas/concepts. (In other words, doing well on her exams requires that you on your own review the material and practice applying them).\n \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "April 01, 2010",
            "review_content": "\nI'm currently taking her General Physics class and so far it is has been a pretty awful experience.  She seems like a nice person, but there is literally zero teaching going on in this class.  Every lecture is word for word from the book and, occasionally, we get a physics demonstration which makes me feel something close to pity for her.  The demonstrations never actually demonstrate what what we're learning - mostly because the supplies are so crappy - and everyone just snickers and shakes their head.  These facts might not seem all that important until you consider that you're paying so much for this course (both monetarily and mentally/physically) to essentially teach yourself the material.  The exams are also, in my opinion, unreasonable for a few reasons: this is the first time she's teaching this course so she gives you Professor Dodd's exams from last year as practice.  These exams ARE reasonable.  The questions are challenging, but pages of formulas are provided so you don't have to waste time deriving things.  Zelevinsky has you prepare for her exams with these and homework problems, but never tells you what formulas you'll need and winds up giving you a 1 page sheet with basic equations.  However, the exam questions are just as hard or in most cases even harder AND you have to derive the needed formulas.  Because of this you are not likely to ever completely finish unless you have excellent math skills.  This is extra frustrating because she says things like \"the exams will test your physics skills, not your math skills\" or \"the problems will be easier than homework problems\" - none of this is true.      \nI would recommend staying away from this course unless you really like paying a lot of money to teach yourself (which is probably why you're taking CU classes to begin with) and are really speedy deriving equations.\nWorkload:\n10 homework problems per week, 2 midterms, 1 final.\n"
        }
    ]
}