{
    "prof_info": [
        {
            "prof_name": "Ellen Rentz",
            "prof_id": 3479,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 16, 2008",
            "review_content": "\nEllen's class is absolutely amazing. It's a combination of lecture and discussion, but she always emphasized discussion more. At the beginning of each class she gives background information about the work we just read, including when it was written. She requires that you know these dates for the midterm and final, but it's not that bad and she's an easy grader on exams. She grades papers more harshly, but is still reasonable, and she is very willing to meet with students during office hours to discuss topics and arguments for papers. Overall, Ellen is one of the nicest people you will ever meet. She cares about her students and is genuinely interested in helping them with any problems they may have. She even baked cookies for our last class!\nWorkload:\nThere are a few homeworks, each a page long, about your ideas on the text. She assigned three papers this semester and the length requirement became longer as the semester went on. The papers aren't bad though because you can choose the topic. The midterm and final are graded very fairly. My only advice is not to fall behind on reading because catching up later is very difficult and not at all fun.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 30, 2008",
            "review_content": "\nEllen is absolutely amazing. I cannot stress this enough.\nClasses are mostly started with a short (less than 10 minutes) lecture followed by discussions, group work, and/or practice quizzes. The class is really informal, which is great if you have funny, smart, or interesting people in your section, which you should if we can have any faith in CC admissions. \nShe's a tough but fair grader on papers, always leaves lots of feedback, and is more than glad to help brainstorm topics or look at rough drafts or outlines during office hours. Also, she's a much easier grader on the midterms and finals to make up for it.\nDid I mention she's incredibly nice? And she's a medievalist. What's not to like?\nWorkload:\nStandard lit hum reading, no additional textsoccasional short homework assignmentungraded pop quizzes (to shame you)2-3 papers on topics of your choicemidtermfinal\n"
        }
    ]
}