{
    "prof_info": [
        {
            "prof_name": "Igor Krichever",
            "prof_id": 1016,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "January 15, 2007",
            "review_content": "\nIgor Krichever is the cutest little russian man ever.  He is really nice and he is a little hard to follow sometimes but I think that he's probably one of the better foreign math teachers at columbia.  It's much easier to just teach yourself the material and just go to class for the weekly quizzes.  He's a good teacher and explains most of the material really well there are just certain topics that he doesnt explain so well.\nWorkload:\nreally light. he assigns weekly homework assignemnts that he doesnt check but its good to do them because he usually gets the quiz question from the homeowrk.  he also gives weekly quizzes.  the first midterm was really easy and the class average was like a 95 or something but he made hte second midterm really hard and ended up curving it around a b+.  the final was pretty fair as well. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 03, 2007",
            "review_content": "\ni didnt really like his teaching style. i thought he was really hard to follow at first but then i realized that i could learn everything out of the textboook. i NEVER went to class. only for the scheduled weekly quizzes. i managed to get an A- which i think is pretty good considering. \nHEs not hard  at all, but make sure you read the chapters. \nWorkload:\n2 midterms, 1 final. weekly quizzes (he drops the lowest 3)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 29, 2006",
            "review_content": "\nThis class was pretty easy. I never went to the lectures so I can't really tell you much about his accent although I think it's not that hard to understand. His tests are very straightforward and as long as you keep up with the homework problems attendance is absolutely not necessary. Also he gives you a review before the midterm and he uses a lot of the problems on the test from this review. So as long as you know the homework problems and the review problems you're set. It's a pretty easy deal. I never studied more than an hour for his exams. \nWorkload:\ntwo midterms, weekly quizzes, homework (not graded, but recommended), final Pretty light overall\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 22, 2006",
            "review_content": "\nI really enjoyed his class this semester, and am taking his calc IV next semester.  I found the lectures to be quite clear: he moves through the material by introducing the concept and giving several examples.  He does have a Russian accent, but I did not have any trouble understanding him at any point during the semester.  Things were very amusing at times (in a good way), including, but definitely not limited to, \"I graded your exams, and I feel like I have failed.  I have never had something like this happen to me.  The average was 90.\"\nOn the second midterm, however, the average was around 68, if I recall correctly, and he curved 68 to a B+.\nThe weekly quizzes are no problem if you do the optional homework.  Also, don't forget to listen for the hints he drops in class, such as \"A typical quiz problem could be like this...\"  Note that he loves cross products. \nRather than giving problems that require a memory of all the different integration methods (for example), he tests on the material that HE TEACHES, with test questions coming almost straight out of the lecture examples.  \nDuring the reviews before each exam, he works through example problems that show up on exams with nearly no modification.\nA typical \"Igor Moment:\" Student: \"Will polar coordinates be on the exam?\"\nProfessor: \"Well, not really, but I like roses.\"\nI would recommend his class next semester, even though it's at 9:10.\nWorkload:\nOptional, non-graded and non-collected homework problems from the book every week.  Short quiz (1 problem, 5-10 minutes) at the end of every Tuesday class \"closely related to the homework\".  Two midterms and a final exam.  \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 21, 2006",
            "review_content": "\nIgor is a solid teacher. Though it was at 9 in the morning, I choose to go to every class, and I was able to resist the siren's call of sleeping in at 9-- all because I found him to be thorough and, most important, very funny. He's not unpredictable. What else could you ask from a math professor?\nIn terms of the difficulty level, if you are prepared at the basic level you will do well on the quizzes. The difficulty in exams progressively gets harder though. The only negative part about this course is that people would always complain when there was the slightest challenge. \nHere's a little suggestion, folks: have some genuine interest in this course, and perhaps occasionally look at the proofs for what you're mechanically memorizing?\n\nWorkload:\nQuizzes are fair; the first midterm is very easy; the second is somewhere near the middle; the final was somewhat more challenging (worth 40%)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 08, 2006",
            "review_content": "\nHis class was really easy. That's the first thing that comes to mind. I never studied more than two hours for the midterm. He reviews the class before what problems there are going to be on the midterm. So if you study those well, it should really easy. I didn't feel the need to go to class. It's at 9:10 in the morning so it can be a pain, but attendance is not required. There are quizzes on Tuesday and so I went to class at about 10am to take the quizzes. If you want a really easy math class, take Igor's class. It's minimum work and I only wished that my other classes were like this.\nWorkload:\nHomework every class but it's not collected. Basically there's really no workload.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 01, 2006",
            "review_content": "\nI'm not sure if Igor is a good teacher, or Calc 3 is a pretty easy class, but in any case, Igor is not like some of those awful professors you hear about in the Math department. It was kind of annoying that I took this class at 9 in the morning and had to go because of the weekly quizzes. Overall experience - decent. \nWorkload:\nTwo relatively easy midterms. Weekly quizzes. A final. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "May 17, 2004",
            "review_content": "\nBreaking the pattern here, I guess: I didn't have him for ODE.\nAnyway, he seems a nice enough guy, if a little distant. I had no trouble at all with his accent, so I don't understand where those comments are coming from. The class itself sometimes moves very slowly, and somehow it's HARDER because there are only two chapters covered in the entire class. I could be wrong, but the impression I got was that he's a fair grader on tests and a killer on the weekly quizzes. The quizzes only count for 10% of your grade, so they're not such a big deal (and apparently very few people do well on them anyway). The tests were fair overall, and I got the grade I expected. I have heard from people in my ODE tutoring that Krichever's ODE class is hard and that he likes to focus on physics problems. Either way, his IVA class is relatively straightforward. No surprises. Class attendance drops dramatically as time goes on.\nWorkload:\nStandard calc class: quizzes (don't remember how many) 10% of grade; 2 midterms; cumulative final. No HWs, the quizzes substitute for that.\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "May 10, 2004",
            "review_content": "\nNot too bad. Easier than the other ODE classes. Pretty nice guy. Very straightforward, as his example problems look very similar to test and quiz questions.\nWorkload:\nweekly quizzes, 2 midterms, final\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "February 27, 2003",
            "review_content": "\nAww, he is SUCH a sweetie!  His quizzes and tests are straightforward... maybe TOO easy in light of the breadth and complexity of the textbook.  In class, he explains with lucidity and a sprinkling of humor.  Warning: His accent is a thick, authentic Russian, but after a few weeks you stop noticing it.  Heck, the only thing that distracted me was my latent attraction to this kind, earnest, and brilliant little man.\nWorkload:\nHomework assigned but not collected.  Short quiz once a week, 2 midterms and a final.\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "April 24, 2002",
            "review_content": "\nigor's ok. Like, at first i thought he sucked, but like he seems to grow on you. If you dont sit in the first few rows, the quasi-russian he speaks can be incomprehensible. He's pretty straight out of the book. if you do the work and keep up, you should be good.\nWorkload:\n2 midterms, final, weekly quizzes.\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "April 09, 2002",
            "review_content": "\nProfessor Krichever speaks english moderately well - you'll be fine as long as you sit within the first 5 or so rows. if you don't sit up close, you won't be able to hear him, much less understand him. Krichever is an adequate teacher, but is far from spectacular. Bottom line, if you're willing to put in the work, you will learn ODE, but if you're like most Columbia students and are looking for an easy way out, this isn't it.\nWorkload:\nweekly quiz, two midterms, final. (no homeworks). \n"
        }
    ]
}