{
    "prof_info": [
        {
            "prof_name": "Qingmin Liu",
            "prof_id": 11625,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Game Theory",
            "review_date": "December 14, 2016",
            "review_content": "\nI found Qingmin's Game Theory class to be very enjoyable. He clearly loves the material, and actually seems to enjoy teaching it too. I would agree that his lectures are powerpoint driven, but these are heavily supplemented by his oration which will often include interesting examples and anecdotes. \nAlthough he is quite blunt, he is also very approachable. At the end of each of his monologues he will end with \"Questions?\". He is then really quite patient in answering them before moving on. \nCommunication between him and the TAs is a bit of a joke, but the two we had have been really helpful and great teachers. We only ended up with 3 psets, 1 of which was dropped. Their recitations and solutions were very helpful in understanding these though. \nThe difficulty with having so few psets is that the midterms consisted of questions we had never done questions on (although which may have come up in class). Couple with the lack of practice questions, it is a little hard to know what is coming.\nGrading remains the same as in one of the reviews below. \nAll in all, definitely a class I would recommend. \nWorkload:\n3 psets.\n2 medterms.\n1 final.\nWay less than any other econ class I've taken here. \n"
        },
        {
            "course_name": "Game Theory",
            "review_date": "May 04, 2016",
            "review_content": "\nThe lectures were not clear.  Little to no guidance with regards to outside resources that could be used to help learn the material was given.  I bought both textbooks and used those to teach myself almost all of the material, but had to spend hours identifying which chapters corresponded to the lectures since no reading guide was given.  The lectures were not correlated with the text in terms of order or heading.  I am sure Professor Liu is a brilliant professor, but he needs to slow down and walk through the steps more clearly.  Frequently he would jump around and then simply ask at the end \"questions?\" to which everyone was so lost that they rarely asked questions.  Having slides that were more comprehensive would be extremely helpful as well.  Maybe it was just my learning style and his teaching style that were not compatible.  I have excelled in most of my Econ classes, but found this class to be overly stressful (due to the lack of guidance) and relatively unrewarding.  He should have covered less material, but made sure students actually understood what the heck was going on in class.\nIf you are a mathematician that can grasp abstract concepts easily, then you will excel.  If you work hard to get your grades by taking advantage of recitations and outside resources, this is NOT the class for you.\nWorkload:\n4 Homeworks (Combo of impossible questions and easy ones, TAs provide minimal help)\n1 Midterm\n1 Final\n"
        },
        {
            "course_name": "Game Theory",
            "review_date": "April 27, 2016",
            "review_content": "\nThe lectures were not very clear.  Little to no guidance with regards to outside resources that could be used to help learn the material was given.  I bought both textbooks and used those to teach myself most of the material, but had to spend hours identifying which chapters corresponded to the lectures since no reading guide was given.  The lectures were not correlated with the text in terms of order or heading.  I am sure Professor Liu is a brilliant professor, but he needs to slow down and walk through the steps more clearly.  Frequently he would jump around and then simply ask at the end \"questions?\" to which everyone was so lost that they rarely asked questions.  Having slides that were a bit more comprehensive would be extremely helpful as well.  Maybe it was just my learning style and his teaching style that were not compatible.  I have excelled in most of my Econ classes and maintain a high GPA, but found this class to be overly stressful (due to the lack of guidance) and near impossible to excel in.  If you are a genius with Game Theory background, take this class.  If you get your grades through hard work and extra work outside of class, this isn't for you.\nWorkload:\n4 Problem Sets\n1 Midterm\n1 Final\n"
        },
        {
            "course_name": "Game Theory",
            "review_date": "January 19, 2013",
            "review_content": "\nI was relatively satisfied with Qingmin Liu even though I didn't do as well as I wanted. \n1) GRADING\nThe course was graded on problem sets (5 total), a midterm, and a final. Grading was as follows:\n20% Problem Sets, 30% Midterm, 50% Final\n10% Problem Sets, 20% Midterm, 70% Final\nDepending on whichever was higher. The median for our midterm was about a 40/50 which I believe was a B, though not 100% sure. Problem sets are graded check +, check, check -.\n2) LECTURES\nLectures are PowerPoint driven. The PowerPoints themselves are useful resources and posted online; however, they can at times be hard to follow if you didn't attend lecture. Liu goes into more detail in his lectures and thus you'll miss out if you just try to learn on your own without attending class. Also, he does make an effort to learn the names of people who regularly attend class and this could potentially help in grading (though it's unclear if that's true and if so, how it affects grading).\n3) PROBLEM SETS\nThese problem sets...are a bitch. Basically, he takes the lecture material - which is generally straightforward - and riffs on it a bit, so you'll have to do some creative thinking in order to come up with a solution. It means that you have to have a mastery of the concepts. Sometimes, a problem will arise with an extremely complex solution; in these cases you may still be able to do well on a problem set without providing the right answer. \nOf course, there are a couple problems which you can usually find from the lecture notes. However, be prepared for a substantial time investment if you're seeking to do well.\n4) EXAMS\nThe midterm was only two problems, one of which was very straightforward and one of which was quite difficult. The final was five problems, each featuring some straightforward and some difficult questions.\nBasically, the consistent trend is that just like in the problem sets, you'll have to be able to apply Game Theory concepts to potentially new situations, which means you'll have to have a fairly decent familiarity and comfort with them. To study for the final, I reviewed all the problem set & practice problems and got to understand them decently well, but it wasn't enough for an A while with other courses that much studying may have been enough.\nThis leads into my biggest criticism of the course, which is: those with any expertise in Statistics have a significant advantage in tests because we are asked to do math and problems that require solutions we have to come up with ourselves. Often for these problems they require certain statistical proofs or tools that a non-Stat student may be unfamiliar with. While this may be expected to some degree in a Game Theory course, it is amplified by the fact that the exams test advanced questions that are not covered in lecture.\nIf you don't have a math/stat background, you can still take this course and do well. However, if you're looking to excel, you need to: A) Go to every lecture & take notes B) Be in regular communication with the TAs. They were very important and helpful as they not only are knowledgeable but also do the grading. They can also explain to you from a beginner's perspective how to work through some of the more complex concepts.\n\nWorkload:\nMidterm, Final, 5 Problem Sets that were decently time consuming. Overall a fairly large workload but not ridiculous.\n"
        }
    ]
}