{
    "prof_info": [
        {
            "prof_name": "Jean Cohen",
            "prof_id": 993,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 13, 2015",
            "review_content": "\nProfessor Cohen is fierce, smart as a whip, and a bit scattered. Expect no emails longer than a sentence, cozy office hours, or gentle let-downs. Do expect to learn from a scholar who knows her stuff like no one else and teaches the texts as theory more than literature. By the standards of Contemporary Civilization, this class will include relatively little discussion. Thorough notes of her perspective on the text is absolutely crucial for the 1-2 papers, midterm, and final. Both exams comprise essays. She is a stickler for use of clear language and her own ideas (but her ideas may well be better than yours - at least better than mine - so that is not such a big deal). She will not tolerate questions about grading or rubrics, which she sees as secondary to the actual business of learning. \nTaking Professor Cohen's CC is worth it just for her explanation of Kant.\nWorkload:\nGenerally low, with very intense moments of paper-writing.\n"
        },
        {
            "course_name": "Contemporary Continental Political Thought",
            "review_date": "September 16, 2009",
            "review_content": "\nJean Cohen is clearly very smart but she isn't able to articulate her thoughts in a un-neurotic, digressive way.  The topics and political scientists we studied were extremely interesting however and her TA, Axel, did quite a lot to clarify the material.  Definitely though, Global Justice is easier to understand than Political Thought.  Also there will be graduate students, they will dominate the discussion, and they will confuse you.\nWorkload:\nA lot of reading, take home midterm and finals, A- to B+ definitely do-able without investing too much time in the readings\n"
        },
        {
            "course_name": "Contemporary Continental Political Thought",
            "review_date": "April 25, 2007",
            "review_content": "\nProfessor Cohen presents a vast array of european political theorists with a detached eye that allows the strengths and weaknesses of each theorist to come through without being clouded by the personal biases of the professor.  The class was the strongest when Professor Cohen presented and led the class as well as highlighted important ideas in the works.  \nThe only two criticism I could find with the class was that often a few students in the class dominated the class, not with discussion but with bluster and arguments which did not serve to clarify any of the important points made by the writers.  Professor Cohen was easily drawn into these arguments and then flustered by them.  Perhaps because of this, the connections between the authors was not as clear as they could have been.\nHowever, the professor was always willing to entertain ideas and to hear people out.  She also had an engaging teaching style that brought clarity to the key points of the readings.  THe books on the long reading list, though expensive, were well worth adding to my library.\nWorkload:\nReadings, Presentation, Paper\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 20, 2006",
            "review_content": "\nProf. Cohen is truly a terrible CC instructor.  Don't be fooled by her status as a professor of political philosophy.  Sure, she knows her stuff, but she has next to no talent for communicating it effectively and engagingly.\nAt least as far as I know, CC is meant to be a discussion-based class; Prof. \nCohen is either unaware of that fact, or decided to blatantly ignore it.  She spent all of each class lecturing, which might have been OK if she were any good at it.  She's rather boring, and she seems to think her students need a specficity of knowledge of the material that is absolutely ludicrous.  The few times that she stops for a comment or question, she acts like she's doing the student the biggest favor she knows how to do (which actually may well be true).  And if she disagrees, she'll tell you, but she's not nice about it, and only occasionally illuminating in response. \nStay away.\n"
        },
        {
            "course_name": "Political Theory Seminar: Globalization of Law and Politics",
            "review_date": "May 17, 2005",
            "review_content": "\nÂ“Exceptional.Â” I can't say enough about Prof. Cohen! There is obviously a valid reason for her increasing popularity among international political theorists. She has made me a believer too. This is an extraordinary course for students looking to learn about many of the prominent theories (e.g. Just War v. Cosmopolitanism) behind international law and politics. During the course, we examined those theorists (e.g. Beitz, Walzer, Buchanan, Chesterman) participating in the contemporary debate on national sovereignty v. human rights enforcement. \nFurthermore, Prof. Cohen examines these theories in a non-intimidating, easy going style while encouraging her students to conduct a critical analysis of these theories in light of very real events (e.g. Cold War, Kosovo). For this reason, even students not exceptionally well versed in political theory (such as myself :) nevertheless have a sufficient opportunity to grasp each theoryÂ’s tenets by discussing its actual real world application (e.g. UN Reform). Finally, while this is a theory course, I believe it is surprisingly applicable for the student interested in obtaining a JD and/or MIA.\nWorkload:\nMODERATE WORKLOAD: Lots of reading, 1 class presentation, and 1 15 page term paper.\n"
        },
        {
            "course_name": "Contemporary Continental Political Thought",
            "review_date": "March 02, 2002",
            "review_content": "\nAs with most political theory courses in the political science dept, Jean Cohen's lectures are delivered with the graduate student in mind. This, despite the course being listed in the undergraduate Columbia College bulletin, leads to a situation where the professor assumes prior knowledge and lectures that are rarely helpful for the undergraduate beginning to develop a more thorough understanding of political thought. This course was unsatisfactory for several reasons. First, continental thought is impenetrable to begin with. In a department that is known for analytical Anglo-American political theory, Cohen's attempts to elucidate continental theory was not very helpful, often falling back on the lingo of the contintental theorists' themselves. A second problem had to do with the delivery of the lectures themselves. The lecture was a two-hour session that met only once a week. Because of this, there was not much time for students to raise questions on texts that are surely difficult to understand. Third, the reading list was much too long to get through for a week. To be sure, Cohen separated core texts from suggested readings for the graduate students, but even then, the readings did not fit in well with her lectures. I would recommend only students with the most committed interest in continental political thought to take this course. Otherwise, better stick with the more mainstream political theorists in the department--i.e., Johnston, Barry, Elster.\nWorkload:\nEnormous reading list for each week, which doesn't really need to be done. Final exam only.\n"
        }
    ]
}