{
    "prof_info": [
        {
            "prof_name": "Steven Goldstein",
            "prof_id": 2867,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "V2200 Solid Earth System",
            "review_date": "May 16, 2013",
            "review_content": "\nMy take:\nThis class was totally worth taking. I can honestly say that it enriched my academic experience and taught me fascinating and relevant facts about the earth's geological history - something I feel that everybody should know if they graduated from a liberal arts college. The TAs were all extremely helpful and willing to answer all questions related to labs. The professors, I will admit, read directly off the lectures but they're so awesome that I didn't care anyway. Plus, the lectures were straightforward and easy to understand so them reading it off wasn't a waste of time. This is one of those classes where you get to know your classmates because of labs, TA office hours, fieldtrips, faculty student dinners, etc. I also got to know my professors: both Steve and Sidney are sweethearts and passionate about their field, as are all the TAs. \n\nWorkload:\nWork:\n13 labs\n1 midterm\n1 final\nlabs will take you a good while, a solid half a day maybe if you focus, depending on the lab. However TA office hour was deadly useful and I will admit I was one of the students who were scrambling to finish lab on time. However I always did because the TA as well as all the other students who came, were all useful. Theyre not graded too harshly, as long as you explain your logic. \nMidterm was a bit of a fucker for me because of the short answer. You could study enough but if you didn't hit all the points they wanted you to then you lose A LOT of points. key was to just write everything you possibly knew down.\nJust took the final and it was pretty easy. Steve's final was way more straightforward since there were no essays. \nYou could keep up with the reading or you could cram, and still do decently well.\n\n"
        },
        {
            "course_name": "V2200 Solid Earth System",
            "review_date": "April 08, 2013",
            "review_content": "\nDo not take this class and if you have to, lecture is a waste of time. Just print the slides and read them on your own. That is all that is done in class. Professor Hemming and Professor Goldstein just read their slides word for word in each lecture and there are roughly 60 or more slides per class. Lectures are dry and long. \nFor at least six classes, Professor Goldstein just talked about his many research trips and anecdotes. He would then tell a joke and wait for someone to laugh or say \"Has anyone ever been to...?\" or \"Is Anyone from...?\" with no response and would wait until he could find a place that someone had been to. About halfway through the semester most of the class stopped showing up. \nThere are field trips every two weeks some of which take place during the winter outside in the cold (it was 20 degrees when we went) for three hours and some of which take an entire weekend day.\nWorkload:\nAbout 10 labs which are tedious and often not very helpful. Professor Hemming is a fan of  GeoMapApp so expect to use that a lot. Homework assignments were often due the same week as lab so plan ahead. A fairly easy midterm (practice give) and a final. Easy enough to do well\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "April 17, 2007",
            "review_content": "\nFirst of all, as a science major in Columbia College, I was warned that Frontiers of Science does not favor our science background at all. In fact, it might be to our disadvantage that we already know some science. I was kind of doubting such pessimistic views when I first started taking Frontiers last semester. I mean, how difficult could the class really be? But oh my was I wrong! It was not only impossible for me to digest everything that Frontiers of Science threw at me during their tedious long lectures where most people choose to sleep, but on top of it all, Goldstein was a terrible, absolutely terrible teacher. \nI had no idea why I did not transfer to another class but remained in Goldstein's class. But I wish I did because I learned nothing! He is the type of teacher who probably knows a lot but can't find a way to teach it to the students effectively. He is really awkward to talk to. He is terse as well. So if you go up to him to ask for an explanation, he will give you a best a one sentence answer. You will be sitting there, looking at this man and wonder to yourself how much more awkward and frustrating this class is. \nWhat is even worse about Goldstein is that he actually grades the midterms and finals as if they are senior thesis! He even takes off points for a bonus question which is suppose to help you out. What kind of teacher does that do his students? And he also plays favorites, which should only happen in high schools.\nIf you have Goldstein as your professor, you should first hit yourself on the head for having terrible luck and then try to run away from him as fast as possible. He might look harmless at firs. but the more classes you go to, the worse he becomes. In the end, you just want to sit down and cry. Don't be that freshman who did terrible in Frontiers because of a bad teacher! \nWorkload:\n1 midterm, 1 final. The final is cumulative. Cheat sheet allowed on both. But I doubt they will be of use to you, since you will be sitting there for half an hour trying to figure out what the test questions want to ask you. There are weekly homework assignments that have just as vague questions. Brace yourself. frontiers + Goldstein=bad times\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 20, 2006",
            "review_content": "\nEven though Frontiers is a crappy class overall, Goldstein manages to make it interesting. He doesn't waste a lot of time with stupid and pointless activities. In fact, he summarizes the lectures and explains them in ways that we can understand (which is nice when the main lecturer isn't as good.) He is accessible, and makes a lot of resources available to his students via courseworks. And, he lowered the number of required lecture questions and dropped the lowest WIA. If you have him for Frontiers, you'll be set!\nWorkload:\nLecture Questions, Weekly Individual Assignments, Midterm, Final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "March 23, 2006",
            "review_content": "\nFrontiers of Science was a horribly stupid class to begin with. That being said, Goldstein was pretty fair. He wasn't organized (he took forever to hand back graded homework) and he was not very good at orchestrating discussion within the class. However,he did a decent job in reviewing important material from the lectures. He made good review slides and was good at going over \"habits of mind\" concepts that were not completely explained in the book and you were just kind of expected to know. Overall decent professor, and with experience will probably improve. His workload is annoyingly more than most other discussion sections. \nWorkload:\nannoying: required homeworks that are graded (unlike other discussion sections) however, they are useful for preparing for the final. posted (and graded!) discussion question responses by 7am  of the day of class. \n"
        }
    ]
}