{
    "prof_info": [
        {
            "prof_name": "Marcellus Blount",
            "prof_id": 231,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "African-American Literature",
            "review_date": "May 18, 2015",
            "review_content": "\nProf Blount is a lecturer. Expect class to be a rambling of his ideas of black male inferiority and the musings of a gendered racial historical narrative. Despite making up his own words and giving Woolf a run for her money in stream of consciousness rambling ad nauseum, Blount is on top of his game. He really cares about what he is talking about. He refuses to define sexuality. \nBlount integrated the Columbia English faculty on 1985 as the first black hire. He has a personal relationship with the authors we read (metaphorical and legitimate) and is eager to share with us his own experiences.\nIf anything the syllabus is incredible. AA Lit II is the way to go for a class that's readings are actually worth reading. \nI wish he had graded our papers though, instead of the know it all TA.\nNot incredible, not horrible.\nPainless especially if taken for the GS lit requirement.\n\nWorkload:\nA book a week\nTwo five page essays\nIn class final exam that is comprehensive to say the least\n"
        },
        {
            "course_name": "Black Masculinity",
            "review_date": "December 25, 2011",
            "review_content": "\nProf. Blount is a wonderful professor and this class was a wonderful class. It's obvious that Prof. Blount invested a lot in our class, from his very thoughtful, purposeful, engaging syllabus, to his always-brilliant lecture notes, to organizing class trips (free trip to a show, free trip to a movie!), to bringing in speakers, to giving us snacks and ordering us dinner. Many profs will give a lecture and leave the room or will let students run the class, but Blount consistently demonstrated his interest and care for each member of the class. He also did a good job of balancing his expertise on the material and students' desire to offer their own thoughts and opinions: each class was a mixture of lecture, student presentation, and discussion of the texts. This was useful because there was always so much to cover and most students had a lot to say--our discussions needed framing and structure and he facilitated them well.\nTake this class if your are interested in Af-Am Studies, Gender Studies, American literature, or even just confused/angry/curious about portrayals of black men in the media.  You'll learn so much in a dynamic environment with a expert professor who loves the material.\n\nWorkload:\nHeavy-ish reading (sometimes a novel a week), discussion posts, 2 5-pg essays\n"
        },
        {
            "course_name": "African-American Literature II",
            "review_date": "June 08, 2011",
            "review_content": "\nProf Blount is one of the kindest teachers I had this semester. He is extremely understanding and flexible when it comes to deadlines. He encourages you to go to office hours (which I highly recommend you go to, one on one convos with him about the essays are really helpful). \nTrue, his lectures are a bit boring. Ok, maybe more than a bit. But on the bright side, he talks slowly enough for you to write down everything he says. The reading list is AMAZING- every single thing we read was absolutely fascinating, from Baldwin to Morrison to Wright.\nI say take the class if you want something where you don't really have to pay attention in class. As long as you do the reading and take a feeeew notes, you're set. He's a fair (not easy, FAIR) grader.\nWorkload:\nNot bad. Lots of reading (but manageable and also really, really interesting), two essays and a final.\n"
        },
        {
            "course_name": "AIDS and the Politics of Literary Form",
            "review_date": "June 07, 2009",
            "review_content": "\nYes, it's true, Professor Blount can be a little flighty -- he missed a couple of classes, and came late to others - but he is a dedicated and briiiiant professor with a huge wealth of knowledge. The class material itself was incredibly interesting, and though it is a specific topic, it related to many other topics and I feel I learned a lot and enjoyed class time tremendously. Highly recommended. \nWorkload:\nReasonable reading, one 15-20 page paper at the end of the class. Your grade is based on participation, and the final paper. If you participate in every class class, start the paper more than a week ahead of time and go to his office hours a few times, you should get at least a B+ or A-. If he sees you are putting in an effort he will reward you generously. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 07, 2009",
            "review_content": "\nOne of the worse prof/teacher I've ever had. Although he is a nice guy and seem very knowledgeable about the materials, he does not give a damn about his class. Over the course of the first semester, he did not show for 4 classes and did not tell us what happened or even give us a formal apology. He canceled our third paper (made it an optional one), did not show up for our final, AND 2 weeks into the spring semester, I have yet to receive my final grade. On top of that, he is not an easy grader for essays. His classes are disorganized, and he does not make an attempt to direct the class to explore a certain aspect of the book. AVOID AT ALL COSTS!!!\nWorkload:\nthe usual lit hum readings. 2 3-4 page papers (when it suppose to be 3).\n"
        },
        {
            "course_name": "African-American Literature I",
            "review_date": "January 17, 2008",
            "review_content": "\nI was exposed to texts that I wouldn't have been otherwise. \nMy understanding is his area of expertise is poetry and the poems we read for Harlem Renaissance era women poets (who  get very little attention in the academy) were great. I believe he made an effort to create a balance on the syllabus between canonical literature and obscure works. I don't understand why some students say his lectures are tedious. \nWhen I took the class the students gave him an ovation after his last lecture at the end of the term and he deserved it.\n\n"
        },
        {
            "course_name": "introduction to the major",
            "review_date": "November 06, 2006",
            "review_content": "\na nice man, talks slow, conducts the class slow. not an easy grader. not a lot of work, though. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2005",
            "review_content": "\nAlthough Marcelleus talks really slow, which makes the class drag at times, he is a great teacher overall. He is funny and enjoys talking about baseball, esp. during the playoffs and world series this past semester. He is very passionate about his work, which definitely shows through in his classes. Close reading is recommended but seriously not essential. Skimming will suffice. Participation is very important. So if you say one or two things every class, skim through the texts, do the essays, and come up with an original question every class, you are sure to get at least an A-. \nWorkload:\nDaily readings of books listed on the syllabus. One question typed up every class. [You don't have the answer the question, just present it to him, so that he review them and asks some to the class to stimulate discussion. ] No quizzes. Three 4-page essays, with at least 4 essay choices to choose from. One midterm and one final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 08, 2005",
            "review_content": "\nProfessor Blount is a highly intelligent professor with years of teaching experience.  He has an extremely pleasant demeanor and is very likable.  He requires very sophisticated and well-written papers.  Do not expect to simply write grammatically correct papers and come out with a good grade.  \nThe class would be better if Professor Blount lectured more.  He truly adheres to the seminar structure and allows the class to be dominated by student comments.  Because of this, the class moves at a sluggish pace at times.  Overall though, I enjoyed the class and recommend him as a professor.  \nI found his final grading policy fair:\nThree Papers (60%)\nMidterm + Final (30%)\nClass participation (10%) \nWorkload:\nTyped question on the reading for every class, three papers, mid-term (fairly straightforward), final  \n"
        },
        {
            "course_name": "AA Poetry",
            "review_date": "February 25, 2004",
            "review_content": "\nEventhough the positives (possibly) outweigh the negatives, I speak for others who found the class a burden and surprisingly stressful! Yes, we did review two or three poems per class--and one had to witness the same florid and uninteresting points brought up by the SAME people--however the midterms were not so much \"gifts\", unless one's \"gift\" was snatched up and away during these examinations. The class has forced me to REALLY dislike Audre Lorde and Robert Hayden, and that's a pity.\n \nWorkload:\nThe Basic-2*2 system of English Dept. Lectures\n"
        },
        {
            "course_name": "African-American Poetry",
            "review_date": "November 19, 2003",
            "review_content": "\nI agree with the prior stipulations that Prof. Blount speaks EXTREMELY slow, using language that is overdone and gratuitous. Regardless, I do believe that the positive points of the class far outweigh the negative ones. First of all, the reading load is soooo light...he may give you 157 pages for two nights, but he'll tell you the 3 poems that we will actually talk about in class...and you don't even have to read that, because you read everything over and aloud in class anyway. He poses interesting questions about the text, and allows the class to come to their own conclusions about whether or not the poems are even worth reading...which is more than I can say for a lot of other professors here. The syllabus is amazing...Hughes, Lorde, Hayden, Brooks, etc. Take the class - its practically no work, and the material is interesting enough to hold you for 3 hours a week. Plus, he's a nice guy. \nWorkload:\nlight reading load (i mean, it is poetry)..2 papers, midterm (a gift), final\n"
        },
        {
            "course_name": "African-American Literature I",
            "review_date": "December 12, 2001",
            "review_content": "\nProfessor Blount certainly takes great interest in his students and the material he is teaching. He obviously puts significant effort into grading papers, his comments were detailed and extensive. However, I cannot ultimately recommend this class. Professor Blount's slow style of lecturing is annoying, but not intolerable. The endless literary jargon, however, ruined this class. This jargon seemed to fall into two categories: 1. the use of esoteric vocabulary to describe painfully obvious concepts (see all of \"post-colonial theory\") 2. the purely meaningless (\"the poet appropriates africa as a female space and thus subverts the rhetoric of male dominance of motion\") I cannot say that prof. Blount provided any real insight on the texts. His lectures consisted of biographical information on the authors, combined with almost meaningless jargon-laced discussions of literary theory. Furthermore, there seems to have been (on the part of Prof. Blount and many of the students who spoke in class) a real abdication of critical judgement; many of the works, particularly in the first part of the course, were simply bad, yet nobody seemed willing to point this out. Some of the texts in this class are worth reading, but do so on your own.\nWorkload:\nTwo papers, midterm, final. Blount drops your two lowest grades (or at least he did this semester) which makes things rather easy.\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "December 09, 2001",
            "review_content": "\nThis was a great class. Professor Blount made excellent choices about the readings for this section, and our discussions were really good. His speaking style is a bit unsettling at first; he talks very slowly, with long pauses, but it's because he's choosing his words extremely carefully, not because he's from the South. You get used to his speaking style fairly quickly, though. He has really good things to say and is good at facilitating discussion in this small class (15 people or so). Our section was a little heavy on the poetry -- Shakespeare's sonnets, Whitman's Leaves of Grass, and selections from Gwendolyn Brooks. I don't really like poetry, but I had a good time anyway (ended up really liking Whitman), and I'm glad I had to read it.\nWorkload:\nEight books over the course of the semester, so about 100 pages a week; two 4-5-page papers (graded fairly hard); no midterm or final.\n"
        },
        {
            "course_name": "African-American Literature I",
            "review_date": "April 28, 2001",
            "review_content": "\nThe syllabus was great. Students had interesting things to say in class. But unfortunately, Blount's style of lecturing is unbearable. You can write down every word he says (and at times I did) with time to finish the spec crossword in class. It is really difficult to go because of this. I'd suggest the course with another instructor.\nWorkload:\n2 papers and a Final\n"
        },
        {
            "course_name": "African-American Literature I",
            "review_date": "December 31, 1999",
            "review_content": "\nI enjoyed this class. Prof. Blount is a thorough, conscientious and an extremely well read and articulate professor. Although other students comment on his slow-paced lecturing style, I felt that he exuded so much respect and passion for the books and the authors of them that he assigned. The class was very comprehensive, covering a century of black writing. The readings selected by Blount were absolutely wonderful and his willingness to work with you on fine tuning paper topics was consistent.\nWorkload:\n2 papers and a Final.\n"
        }
    ]
}