{
    "prof_info": [
        {
            "prof_name": "Ana Paula Huback",
            "prof_id": 11416,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Comprehensive Intermediate Portuguese",
            "review_date": "January 03, 2013",
            "review_content": "\nAna Paula is the best professor I've had at Columbia.  She is super organized and lets you know the class schedule/assignments even up to 3 weeks in advance.  She is also very intelligent and an excellent language teacher; by the end of the semester my Portuguese level had improved from basic to almost fluency.  This class is however not an \"easy A\", it's not particularly hard but in order to get an A or A+ you need to put in quite a bit of effort.  Ana Paula is a fair and very transparent grader and will give you the grade you deserve.  That being said, the assignments are fun and varied and there is a lot of leeway to work on what interests you so putting in the effort shouldn't be difficult.  All in all it was a great class and arguably the best I've taken at Columbia.\nWorkload:\n3 or so presentations, 5/6 one page essays, weekly one-paragraph commentary on a video, regular homework, one midterm and one final\n"
        },
        {
            "course_name": "Comprehensive Intermediate Portuguese",
            "review_date": "September 12, 2012",
            "review_content": "\nAna Paula is the best language teacher I've ever had & one of the nicest professors at Columbia.  She is understanding & helpful and crafts a comprehensive curriculum that might be overwhelming if she didn't structure it so well.  She does a great job of creating an easy-going classroom environment.  \nDespite the fact that I had this class 3 times a week, and it could easily have felt tenuous to attend so often, I enjoyed it immensely!\nWorkload:\nweekly assignments (written or oral presentations) + nightly mini-assignments that take almost no time\n1 midterm + 1 final\n"
        },
        {
            "course_name": "W1201-W1202 Intermediate Portuguese",
            "review_date": "April 10, 2012",
            "review_content": "\nThis is quite possibly the best class I've ever taken!  My Portuguese improved tremendously in just one semester.  Ana Paula is an amazing teacher and a fair grader although you do have to put in quite a bit of effort.  The class was very well structured and it was clear exactly what was expected of us.  She's also very flexible when it comes to projects and presentations and lets you work on topics that interest you.\nWorkload:\nWeekly exercises, various projects (film reviews, compositions, presentations) a midterm and a final\n"
        }
    ]
}