{
    "prof_info": [
        {
            "prof_name": "Victor H. de la Pe&ntilde;a",
            "prof_id": 372,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Probability and Statistical Inference",
            "review_date": "January 06, 2014",
            "review_content": "\nMy comments on 4109 in general as well as this particular class:  \nIf you can avoid taking 4109, do it.  At all costs.  Take 4105 and 4107.  Not only will you have a more diversified group of students and therefore a more normal distribution of grades, you will have more time to actually learn the material (it's a lot!).  In any given 4109 class, you'll find about 85-90% of the students are Chinese, half of which have already taken the material (maybe not all, but a majority of it) in their undergrad program.  So don't plan on getting an A in this course unless you already know the material walking into the class on day 1.  It's possible, but very difficult.  Oh, and then there's the cheating.  The MA Stats program is rife with cheating (the Chinese!), and this class was no exception.  In every quiz or exam there was a constant flow of whisperings in Mandarin.  Some of the more cavalier students even took out their cell phones to search topics or formulas during the actual test!  Also, if you don't sit in the first few rows of the class, expect to want to punch half the students around you for constantly chatting (also in Mandarin).  The professor can't hear them beyond the first few rows, so unless you mention the issue to him he won't do anything.  \nMy comments on Victor:  \nWhen you boil everything down, Victor is considerate, fair, but a bit disorganized.  The lectures consist of him putting his hand-written notes, many of which are riddled with errors, up on the projector while he simply talks through each page.  I don't mind this teaching style but, on top of all the errors, his notes don't follow the book (from which I had to base my learning).  The homeworks are what help you understand the material, but his quizes/exams are based on his notes, so there will often be test questions that you haven't had any opportunity to practice or understand fully. \nAnother annoying point was that if he deviated from this typical lecture plan, he would often confuse himself, then call a 5 minute break while we, the students, had to explain to him what he was trying to do.  He would often say, \"I don't do math in public\".   Many students, including myself, often walked out of a lecture more confused about a topic than when we walked in.  \nSummary:  \nProfessors are humans (surprise!), and they make mistakes too.  Victor made some mistakes throughout the semester, but we brought them his attention and he tried his best to correct for them.  That said, take a different professor.  You'll save yourself from a lot of anxiety. \n\nWorkload:\nWeekly homework (long), 3 quizes (1 pop-quiz, 2 announced), midterm, final, and a group presentation on a topic of our choice from the book.\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "April 02, 2012",
            "review_content": "\nI took Professor de la Pena's Intro to Stat Reasoning course in Fall 2011. I am not a math person, and this course is definitely easy in terms of what is learned if that is what you are looking for.\nHowever, while Professor de la Pena is very sweet outside of class, in the classroom it is very difficult to follow his lectures - he often got very nervous and would make mistakes, confusing not only himself but also the class in the process. My advice? Go to his office hours - literally no one would go, and I would get the benefit of getting help for the problem sets (usually he assigns one per week). Also the TA, Ben (I don't know if he'll be the TA again in Fall 2012), was helpful and his sessions were well-attended - he breaks down the concepts that are mentioned in lecture. \nYou can get through this course, just know going into it that you will be confused by Professor de la Pena's lectures but that if you go to office hours and the TA's advising sessions then you will be fine.\nWorkload:\nPretty standard - 1 problem set a week, 1 midterm, 1 final - the midterm was fine, the final I thought was difficult \n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "September 09, 2011",
            "review_content": "\nHe's a nice guy and tries to make sure everyone understands. Unfortunately for my class, this meant that we spent most of the time doing probability (4105 stuff) and didn't cover half of the material for statistical inference. He tried to hurry his pace and started using to present slides to save time from writing on the board. At some points, he showed pages from the book as well. Any material we didn't cover was assigned as a project or self study with homework.\nAlso, there would be questions asked during class that he wouldn't be able to answer, more than any other class I've taken.\nThe material is not any harder than 4105. The book by hogg and craig is fine. It's harder than Degroot & Schervish [4109] but easier than Casella & Berger [PhD book]\n\nWorkload:\nWeekly homework, two tests, final, The scores for the midterm was lower than he would've liked so he introduced a new test to try to raise the class average.\n"
        },
        {
            "course_name": "Intro. to Probability and Statistics",
            "review_date": "January 17, 2007",
            "review_content": "\nVictor de la Pena is dedicated and super friendly.  He is always willing to explain even the simplest things in as many different ways as possible until everyone understands.  He was a very fair grader and never put any surprises on tests, and I found him to be one of the nicest professors I've had so far.  He seemed so happy to have people taking his class, and, even though I am not remotely interested in Statistics, I was very sad to leave his class.  This class was not a breeze, but if you try to understand you will not end up with a terrible grade because he breaks everything down and makes it totally manageable.  \nWorkload:\nweekly problem sets (with the lowest one dropped), 1 midterm, 2 tests (with the lowest score dropped), and a final\n"
        },
        {
            "course_name": "Probability Models W3000",
            "review_date": "December 20, 2006",
            "review_content": "\nProfessor de la Pena's class was the worst academic experience I've had at Columbia. As (I hope) several other engineering students will attest, it was not the lack of basic math skills that caused the majority of this class to get stuck during lectures and problem sets. But don't assume the only problem was the A math major in the class told me before the final that he was lost too.\nYes, Professor de la Pena is a nice person - he really *wishes* the class would understand what he's talking about, and he tries to help, but he's just not effective in conveying the material. He was so nice that when he realized that most of the class didn't understand what was going on, he made the midterm take-home. (Several students broke their agreement to work individually, resulting in a \"binormal\" distribution, with a mean in the 60s and another small cluster in the 90s. Otherwise there would have been very few high scores - on a straightforward take-home exam!)\nThat brings us to the nature and content of the class. It's called \"Probability Models\" but should be called \"Probability Theory.\" It's not very practical for scientists and engineers; we went over the derivations for a few of models, but didn't really get into their applications. The lectures were very theory-oriented, and he assumed a better background in theory than most students had. During an extra-credit presentation (another \"nice\" addition to the class), a student explained how one could use a \"lemma\" to build a proof, and noted that he/she had never heard of a lemma before. The class laughed, because Professor de la Pena had used the word in several lectures without explaining what it meant (it's a statement that's been proven already). \nWe didn't get to important concepts like covariance and correlation-the very foundation of statistical scientific methods. \nThe books are near-worthless (but cost a combined $250). Find a different book to learn from if you have to take this class.\nBut don't take this class with de la Pena. Petition your department to change the requirement, take it during the summer at a state college, or even take a more advanced class (this class had no calc IV requirement, though you needed double integrals). \nIf you have a good resource to learn from, I guess you could do well in this class. I haven't received my grade, so I don't know if it's true that he curves to an A-. That would be nice, but I don't feel like I learned statistics. \nWorkload:\nProblem sets could take a long time if you get stuck, but were of fair length. The midterm was take-home, and we had an extra-credit project that didn't take too long. On top of 4 engineering classes this class is hard.\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "January 06, 2006",
            "review_content": "\nI believe that Professor de la Pena is a good person and a great teacher.  Yes, he has a distinct accent, but it did not prohibit us from understanding what he said.  His lectures were clear, and he conveyed in the concepts in a simple, easy-to-understand manner.  He definitely has a superb grasp on the material, and he enjoys teaching what he knows to his students.  He is very approachable in the very rare event that anyone who has had basic math has a question.\nMy problem with the class was that it seemed to lack students who had basic math skills.  One student didn't seem to know how to calculate an average!  I know I'm no math genious (after all, I'm in Intro to Stat REASONING), but I do know how to do basic addition and subtraction.\nThe reason that I emphasize this point is that it really seemed to confuse the Professor (understandably) at times.  There was no way to make his concepts simpler, yet some students still didn't get them.  This might be the reason that some people didn't like him, but I think it is a sign of the students' inadequacies rather than the professor's.\nIn short, take this class if you want a good general knowledge of statistics from a good professor.\nWorkload:\nweekly homeworks (they aren't difficult), one quiz or two, midterm, final.\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "December 18, 2005",
            "review_content": "\nI was in the midst of studying for my final in this class, and I realized I had to write a review for it. As many others have said, Professor de la Pena is a nice man with good intentions.  Most people's first reaction to him was \"awww he's so adorable\". However, I don't know how he is still teaching this class. With all the terrible evaluations he must receive annually, it is unfortunate that he has not taken advice from them or actually learned how to teach! Class lectures usually have nothing to do with assigned problem sets. Things are completely unclear and it is very obvious, to me at least, that the class as a whole is lost. Professor de la Pena will randomly call on people if no one responds to a question, he just doesn't seem to understand that everyone is confused. DO NOT take this class! I took it to fill a requirement and I cannot wait until tomorrow when I will never have to look at this stuff again. TA's are not helpful at all. I went to office hours every week, but I went to speak to others in the class, not the TA.\nWorkload:\nWeekly problem sets, 2 quizzes (lowest dropped), midterm, final\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "December 11, 2005",
            "review_content": "\nYea, he's a nice guy, but he's a terrible teacher. Unless you absolutely have to take this class, DON'T TAKE IT. Everybody is totally lost in every class, most people don't bother and just read the book, which is only mediocre. One time he tried to help us review for the midterm and then couldn't figure out how to solve the problem himself. And the TAs? Don't bother- they're even worse. de la Pena's sympathetic enough, but this class was a waste of time.\nWorkload:\nHomework sets every week that seem to have nothing to do with what we learned in class. Plus 2 quizzes, midterm, and final.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "November 15, 2005",
            "review_content": "\nAlthough he's a very nice man and has the best intentions and teaches a class that SHOULD be easy, Professor de la Pena is a terrible teacher and will only help confuse you more about the material you read in the book.  He also tries very hard to trip up students on quizzes and exams by throwing them curveballs.  He doesn't realize that when most of the class is doing so poorly in introductory statistics, there's probably something wrong with the way the material is being taught.  \nHis grading system is also extremely annoying.  Whoever was correcting the tests and homeworks just really enjoyed using their red pen and took off points when it was totally unnecessary.\nWorkload:\nweekly homework, a few quizzes, midterm and final\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "September 11, 2005",
            "review_content": "\nGood class, but very, very challenging. It's billed as a Introduction, and it is, but it's very in-depth. The first few weeks of the class are deceptively simple, after that it ramps up quite a bit. de la Pena isn't interested in just having you apply statistics, he wants you to understand it deeply. As such, the class is proof heavy and requires a lot of time outside class to comprehend the material. \nLuckily, de la Pena is very approachable, and seems to want students to succeed. He will help you understand.\nAll in all, a very good class, but well beyond the needs of many students.\nWorkload:\nRegular problem sets, usually a few straighforward problems with a few really difficult ones thrown in. Midterm and final are on par with the material, i.e. difficult.\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "January 23, 2005",
            "review_content": "\nI took his class because i thought his lecture was fairly understandable and his first quiz was easy. i got a 100 on it without much study, however, after the drop date is passed, the materials got a lot harder, and i would say it is simply unmanagable. and since it is already towards the end, u can't do much about it, so i ended up having a very very hard time in that class, so ppl who take this class have to be warned, the beginning of the class is fairly easy, but towards the second half, it is going to be a lot of theoretical proofs of the statistical theory which is not similar to anything you have ever learned in mathematics. he requires a lot of understanding of the thoeries and a lot of proofs which you can't even fit half of them on a piece of cheat sheet......so watch out!!!!\nWorkload:\nhomework every week, really easy, fair quizzes, hard midterm and final\n"
        },
        {
            "course_name": "statistical reasoning",
            "review_date": "June 15, 2003",
            "review_content": "\nOk, I took this class in order to avoid taking regular stat 1111, what a mistake. The lectures were totally disorganized and the homework assignments never coordinated with what we learned in class. The professor is a nice guy but he not only has problems with English but also with adding and subtracting numbers, which makes sitting through lecture that much more frustrating and painful since the professor makes so many mistakes that you are no longer sure who is the one teaching the class. 95% of the time I was beyond lost, but somehow I did well on the midterm and final and got an A in the class. The weekly review session with the TA was the only way to get homework done and get a good grade on them. Because of the total chaos and the fact that your grade is composed of so many factors it is possible to get a good grade.\n\nWorkload:\nNot much if you can figure out how to do the homework and what he is saying... Weekly assignment, STAT problems, midterm, and final - everything counts and is curved.\n"
        },
        {
            "course_name": "Probability 3000",
            "review_date": "November 16, 2002",
            "review_content": "\nI've read and heard people say pretty bad things about de la Pena, but I think he is the nicest and most sincere man at this school! He loves his subject, and since this is 3000 he will assume that you love the subject too. He tries to go beyond the book and talk about current applications - he always encourages people to do internships and research. I must admit that the man does have an accent, and he isn't the best at doing complicated double integrals on the board (you'll find moments when you are falling asleep while he's spending so much time on some banal piece of math), but these things aren't the main thing about him. He sincerely wants you to learn and understand, even if that means extending every homework deadline, helping you with the homework in class and in office hours (or scheduling personal appointments), curving tests so that the bulk of the class gets A-'s, etc. If you are thinking of continuing work in statistics, math, or insurance/finance, I suggest you take the class and take advantage of all the opportunities he tries to give you.\nWorkload:\nProblem set once in a while (they take hours and hours, but you can bascially hand them in whenever, and after seeking all the help you want), a midterm, a final, and two/three quizzes (depending on what you get to). It's a lot of work, but it got clearer for me as the term went on.\n"
        },
        {
            "course_name": "STAT W1001",
            "review_date": "May 21, 2002",
            "review_content": "\nI'm not sure why so many people are slamming Prof. de la Pena!!!! He is a sweet man who loves his subject and especially teaching it. His accent is barely an issue - you won't notice it after a while. He will repeat everything as many times as necessary for you to understand, and he'll meet with you after class. He explains things really well, too. Prof. de la Pena is a great guy, and it's just that this class is the easiest Stat out there, and it must be really hard to teach such a horribly simplified version of such a complex subject. A warning to anyone taking this class: It is sooooo dumbed down. If you know any higher math at all (like, precalc or early calc) you will rip your hair out with frustration at the pace. And it is not de la Pena who sets the pace - it is the students. In short, if you are horrible at math, a non-science talented student, or if you are a purely humanities major who hates any kind of science, take this class. If not, you will be hating yourself the whole term while hearing people reviewing the formula for a line. Seriously.\nWorkload:\nweekly homework (sometimes easy, sometimes hard, the TA will help you all you want, drop the lowest grade), biweekly STATA hwk (stata is a stats computer application that you use - mainly easy stuff), two or three quizzes (drop the lowest grade), midterm (not challenging), final (long but not hard)\n"
        },
        {
            "course_name": "STAT W1001",
            "review_date": "May 21, 2002",
            "review_content": "\nI'm not sure why so many people are slamming Prof. de la Pena!!!! He is a sweet man who loves his subject and especially teaching it. His accent is barely an issue - you won't notice it after a while. He will repeat everything as many times as necessary for you to understand, and he'll meet with you after class. He explains things really well, too. Prof. de la Pena is a great guy, and it's just that this class is the easiest Stat out there, and it must be really hard to teach such a horribly simplified version of such a complex subject. A warning to anyone taking this class: It is sooooo dumbed down. If you know any higher math at all (like, precalc or early calc) you will rip your hair out with frustration at the pace. And it is not de la Pena who sets the pace - it is the students. In short, if you are horrible at math, a non-science talented student, or if you are a purely humanities major who hates any kind of science, take this class. If not, you will be hating yourself the whole term while hearing people reviewing the formula for a line. Seriously.\nWorkload:\nweekly homework (sometimes easy, sometimes hard, the TA will help you all you want, drop the lowest grade), biweekly STATA hwk (stata is a stats computer application that you use - mainly easy stuff), two or three quizzes (drop the lowest grade), midterm (not challenging), final (long but not hard)\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "December 31, 1999",
            "review_content": "\nI agree that de la Pena is not the best professor. English is evidently not his native language, and although his accent is decent-good, you can still tell he is translating stuff in his head - which hinders his ability to explain things in a perfectly clear manner. Although he sticks to the book closely, he tends to summarize it very nicely and your notes become a useful complement to the book. Plus, he is a sweet guy, and to basically succeed in the class you have to be an active student. You won't get it all just by listening to him, but you can ask him questions and he WILL keep answering them until you say you get it.\nWorkload:\nquizzes, drop lowest hw, drop lowest midterm and final\n"
        }
    ]
}