{
    "prof_info": [
        {
            "prof_name": "Joshua New",
            "prof_id": 9865,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Cognitive Psych",
            "review_date": "May 16, 2016",
            "review_content": "\nCognitive Psychology with Professor New was fine - honestly, typical for a 1000 level Barnard psychology course. Although I attended all but two classes during the semester, most of my studying came from the textbook. Since he's pretty incoherent as a lecturer, the only way to understand how the material fits together is to read the textbook (you don't need to memorize the chapters though!). If you have questions, it's best to ask in office hours because he gets a bit snippy during class when people raise their hand. Although the exams are poorly worded and require a decent amount of studying, it is completely possible to do well.\nOn a more positive note, Professor New provides a \"fair game\" sheet about a week in advance of each exam, which includes all of the relevant terms. Again, you should read the sections in the textbook to get a full picture of the concept, but the \"fair game\" sheets are definitely sufficient (in other words, you don't need to memorize everything in the book or on the powerpoints). \ntl;dr Cognitive isn't a particularly good class and Professor New is honestly pretty annoying as a person), but a fine way to fulfill the Group A requirement.\nWorkload:\n3 multiple choice midterm exams and a cumulative two-hour final exam.\n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "December 19, 2014",
            "review_content": "\nProfessor New's Class was extremely fair and predictable. I thought the questions were sometimes phrased a bit confusing but if there was a majority problem with particular questions, he would look into it and sometimes just get rid of it. He was really nice and he knows his material really well. If you go to class and study the book, it shouldn't be difficult to keep up. It struck me as a classic psych course at Barnard which, if you are a psych major, you should be used to. \nWorkload:\n3 midterms. noncumulative \n"
        },
        {
            "course_name": "Psychology and Philosophy of the Human Experience",
            "review_date": "November 09, 2013",
            "review_content": "\nDO NOT. DO NOTTTTT TAKE THIS CLASS. I was a freshman when I took this class and I am psychology major now. I can honestly say this is the worst class I will probably take in my four years. It was so disorganized, confusing, and mind-numbingly boring. Granted, the curve was gracious. But in the end, that did not make up for the stress I went through before the midterm and final. Just don't do it. Don't. DO NOT.\nWorkload:\nA midterm and final (open ended essays). Heavy reading throughout the semester that is impossible to keep up with.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "April 05, 2013",
            "review_content": "\nMeh. \nJosh New pretty much lectures completely from slides which he uploads to Courseworks, so while the class is pretty blah, it's also easy and barely any work. \nHe tries to make the lectures interesting with video clips and visual aids, but he's not the best lecturer. I got the feeling that he wasn't very confident. His nervous laughter was really annoying by the end of the semester. \nHe also says/does a lot of stupid things, like giggle nervously and skip over slides about child development and breastfeeding (seriously, if you are a married scientist who's teaching at a women's college and are too awkward to show a slide on breastfeeding, you've got problems). He also showed a graph for one lecture that showed a high percentage of disapproval in the US of interracial marriages in the 1960s. He was really surprised by this data because he thought the 60s were all about \"peace, love and understanding\" *nervous giggle.* Dude, the 60s were not a peachy time for race relations. \nCould be worse, though. \nWorkload:\nTwo midterms and a final. He provides a \"Fair Game Sheet\" with all the terms you need to know. Memorize it. All multiple choice. Easy. \n"
        },
        {
            "course_name": "Psychology and Philosophy of the Human Experience",
            "review_date": "December 18, 2012",
            "review_content": "\nI have never felt the need to write a culpa review before taking a class with New. I am a senior and can say with confidence that he is the worst professor I have had at this school. I took his course, the Psychology and Philosophy of the Human Experience, which is co-taught with Professor John Morrison. I really wouldn't recommend the class, but that is mostly because I would NEVER recommend any course in which Professor New involved. \nTeaching:\nHe has a powerpoint for every class which is comprised of roughly 70-100 slides. Of course he can't get through all of them, so he spends a majority of the class contemplating which slides to include and which to omit, mostly by asking Professor Morrison, a philosophy professor, what he thinks (as if he would know). The slides that he does cover he might as well skip. I would say I actually know less about psychology after taking this class, as much of what he said just confused me. His knowledge of psychology is either really lacking, or he is a really good psychologist who can't teach. \nExams: \nExtremely unfair. You might as well not look at his fair game sheet because studying that information won't help you at all on the exam. I would say roughly 30% of the information on the exams was never covered in class and definitely not a primary focus of any of the readings (which are all rather long and boring, and I am a psychology major so if anything I should find them interesting!). The exams are all multiple choice, which I'm sure many people like. However, they are the kind of multiple choice questions where there could easily be 2+ correct answers, and sometimes it doesn't even seem like any of the choices are correct. I would say that this is just my personal struggle, except that the average on the exam, was a 75. For an intro level psychology, all multiple choice exam, I'd say that's pretty low. I honestly believe that students' issues with his exams are partly due to his inability to teach the tested material well, and primarily due to his inability to write exam questions. Want an example of the kind of questions you'll see?\nWe learned during a lecture that there is a positive correlation between neocortical size and social group size of a species. One question on the final exams asked which of the following relationships are true. Two of the answers were wrong, answer (3) neocortical size and social network size answer (4) neocortical size and average group size. \nI would say that that question is unfair, as are many of his questions. \nI really really really suggest not taking this class. It's such a shame because I went into it with a really positive attitude because I think we need more interdisciplinary courses at Columbia. But not this kind of interdisciplinary course. \nWorkload:\nPsychology Midterm: 50 MC\nPsychology Final: 50 MC\nPhilosophy portion is taught by Professor Morrison, but he has a midterm and final where you have to write 2-3 short essays responding to the readings. \n\n"
        },
        {
            "course_name": "Intro to Psychology ",
            "review_date": "December 03, 2012",
            "review_content": "\nI wasn't that crazy about Josh, although it's hard to put my finger on exactly why. He is a pretty uninteresting professor, to begin with. He presents the material without much energy or enthusiasm, and his slides were so unorganized and endless that it was hard sometimes to figure out what you needed to study. He constantly went off topic and told long stories about weird pop culture psychology. I think we were about four classes behind by the end of the semester. I never really approached him about anything/went to his office hours, but he seemed approachable enough.\nThe tests were so easy -- way easier than it appeared based on the \"Fair Game Sheets.\" I reviewed the relevant chapters in the textbook and (occasionally) Josh's slides, and went to class (not really necessary), and I got an A in the class. The psych experiment project was fun, as was the extra credit where we got to write about a lecture. I hope he continues to assign these fun extra credit assignments.\nWorkload:\nSO light! (Though there's a lot of vocab to memorize, all the time.) Study the terms, read the textbook, occasionally go to class, and you'll be fine.\n"
        },
        {
            "course_name": "Intro to Psychology ",
            "review_date": "August 31, 2012",
            "review_content": "\nHis intro to psychology class isn't too bad.  Everything he says in class is on the midterms and finals.  His slides are pretty useful, it is more important to go to class and write down what he says rather than skip class and read the slides/ textbook.   Just remember his examples and ideas from the book and you should be fine.  He also has a fair game sheet, but tends to give that only a week in advance (which may not be enough time to memorize 1/3 of a semester's stuff.  Also, his final is cumulative.  \nWorkload:\nNo homework, some extra credit, just a lot of reading.\nReading: more important to take notes and fill in the holes using the textbook.\n"
        }
    ]
}