{
    "prof_info": [
        {
            "prof_name": "Barbara Woike",
            "prof_id": 1496,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "January 10, 2017",
            "review_content": "\nShe's an okay professor. Her lectures are pretty clear, and her examples really do help clarify concepts. The trouble comes when you attempt to speak with her outside of class. She is very unapproachable and at times straight up hurtful. One time I saw a girl leave her office crying uncontrollably. My roommate even considered speaking to the administration about withdrawing from her class after emotional torment over e-mail. The bottom line is that she gets the job done and will teach you psychology, and she is clearly passionate about what she does. BUT BEWARE. This comes at a cost. You would think Barnard/Columbia would want professors to inspire their students and break them down to build them up...not break them down for the sake of breaking them down. She clearly has some issues and projects them onto her students. College is a trying time due to workload..no student needs emotional abuse on top of that. Barnard, please someone with teaching skills AND compassion. \nWorkload:\nNot bad. 3 exams. Do the reading. Attend lectures, and really pay attention to her examples. \n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "January 15, 2014",
            "review_content": "\nAfter reading the CULPA reviews of this class I almost didn't take it... and I am so glad I did!!  If you are interested in personality psychology (ex. Meyer-Briggs personality test etc) at all TAKE THIS CLASS. If you put in some effort you can can get a lot out of the it, Woike covers a huge range of topics and I found the textbook really painless and the subject matter rather fascinating. The reviews of Woike and the class are totally unfair. Yes, you must do the readings in order to get As on the exams but this  should be expected at the college level. Plus, unlike many other courses in which you are expected to memorize a gargantuan amount of info at test time, this stuff actually MATTERS and can be applied to your own troubles, existential questions, and all that good stuff.  This class made me want to become a psych major.\nThis review may not be helpful for all students-- I did have an initial interest in personality psychology which may be why I enjoyed the class so much but I felt i had to write a positive review to even out the kilter. \nWorkload:\n2 chapters of textbook reading and 1-2 journal articles per week (do it all) and 3 exams mostly based on the reading \n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "December 17, 2013",
            "review_content": "\nI don't think it's that difficult to get an A in this class. You just need to know where to focus your time and energies when studying.\nWoike's past reviews are a little unfair. She knows the material well and deserves credit for her contributions to personality psychology, but it's true that she's not a great lecturer. People often asked her to repeat herself. I sometimes found myself typing \"..............\" or \"asdkjdgajsbk\" in my notes when I couldn't tell what she was trying to say. I usually paid attention and typed up her lectures, but I often zoned out whenever someone asked an uninteresting question and then listened for a change in tone indicating that the professor was back on topic.\nGoing to class is definitely helpful. Woike usually gave us outlines before each lecture, but she often brought up very specific concepts or studies in class, noting \"these aren't in your outlines.\" If you're going to skip class, borrow notes from someone who pays attention. \nThe class outlines are definitely the most important tool you can use to sufficiently prepare yourself for the exams. They explain the material that the professor considers most important, and they give you a clearer idea of how she thinks. It's also important to review the tables and figures in each chapter of the textbook--the professor often used these as test material. Other than that, I just skimmed the journal articles and the body of the text.\nWorkload:\nTypical 1000-level psychology course at Barnard: three non-cumulative multiple-choice exams (except they aren't curved). She will most likely give out an extra credit assignment to boost grades a bit. Other reviewers said the assignment only raised class grades by a point, but she offered to raise our grades by \"half a grade\" if we did the assignment (i.e. a B+ becomes an A-). \n"
        },
        {
            "course_name": "Psychology of Personality ",
            "review_date": "November 20, 2013",
            "review_content": "\nWoike's class is just straight up weird. She is nice, and will answer questions but she is also qwirky and weird so the way she answers them doesnt always make sense... here are some basic facts about woike:\n1.She knows her stuff, but always goes off on random tangents about nothing...\n2.her voice is always the same.. she never changes pitch or anything \n3.She teaches very colloquially... not with an assertive and loud \"I know what I'm talking about\" voice but with an \"is this class almost over? You should know this... why am I even here\" kind of voice\nYou need to know this because it is because of these 3 qualities that make her class crappy. Because of all of this it is so easy to get zone out, BUT BEWARE, because if you zone out for a minute during one of her tangents and then zone back in, you will realize that now she is talking about work again, but you didnt know she even switched from her tangent to work because she always sounds the same.. -__- This is the main problem with her teaching style... you never know what is important to listen to and what is just her talking bullshit about lord knows what. \nNO POWERPOINTS, just her and her voice\nher tests are do-able but just for some reason a little difficult... I dont actually know why though. I cram and always come out with a B so I think if I studied ahead of time I could get an A, but I'm not sure cause I never study ahead of time. whoopsie. \nWorkload:\n3 tests and an extra credit assignment \n"
        },
        {
            "course_name": "Psychology of Personality ",
            "review_date": "November 14, 2013",
            "review_content": "\nProfessor Woike is the worst professor I have ever had the misfortune to take.  This was absolutely the worst class that I have taken at Barnard/Columbia.  She is unintelligent and makes ridiculous statements during class.  She doesn't teach as much as she reads notes off of her little sheet that is essentially just a basic skeleton of the textbook ( which happens to be far more eloquent and helpful than Woike herself). The class time goes on for hours, you don't learn a thing, and the content for the exams cannot even be found in your lectures-- it is all in the book.  You might as well not even bother attending class, she doesn't notice and she doesn't care. In short, steer clear of this course. \n\nWorkload:\n3 midterms, impossibly hard as she has not taught you any of the material.  A weird extra credit assignment that is time consuming and simply furthers her personal research.\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "November 05, 2013",
            "review_content": "\nAlthough Woike isn't a terrible person, I think she is the worst teacher I have ever had. She clearly doesn't care about you doing well and is more concerned with just doing the bare minimum. She prepares \"notes\" for you before every class, but it seems like she writes them 5 minutes before class. There is not real preparation or thought that goes into her lectures. She just rambles the whole time and sometimes what she says is irrelevant. I did this class for the major requirement and boy do I regret choosing her. I would record every class, do the reading and go over her notes... and I still found the test to be next to impossible. It's not that the tests were hard... they were unfair. I normally can admit to when I didn't prepare enough or when I could've done something differently to study. But I think the problem is her. When anyone would go up to her during the test to ask a question on her wording of a question... all she would say is \"Can't help you\" while she keeps staring at her phone. I truly mean it when I say... please do not take this class for your own sake. It will only affect your GPA and will make you hate psychology. \nWorkload:\n2 midterms, final, and a small extra credit assignment \n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "October 16, 2012",
            "review_content": "\nI think Professor Woike is a wonderful, sweet woman. I didn't mind that there weren't any powerpoints, because it forced me to pay attention and take notes on what she was saying. I found that the hour and fifteen minutes went by really quickly each week. Multiple choice tests were definitely difficult, but the material was not so tough. She also gives you the opportunity for an extra credit project if you want.. Professor Woike is engaging, knowledgable, and personable. I really liked her and would recommend her class!\nWorkload:\n3 Midterm exams and a final, all multiple choice\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "December 11, 2010",
            "review_content": "\nThis psych class is structured like pretty much every other psych class at Barnard. It's broken up into thirds, separated by non-cumulative multiple choice tests. The difference between this class and most of the others is that Woike does not use PowerPoints for her lectures. Instead she just stands at the front and reads from her notes in her extremely quiet voice. This makes it pretty difficult to follow along. The nice thing is she assigned someone the first week of class to be the official notetaker, and all the notes were posted on Courseworks, so it is never really necessary to take your own notes.\nThe first test was pretty normal. I think most people did pretty well. I just studied by reading the notes on Courseworks and all the bold words in the textbook. And then came the second test. I was beginning to wonder why all the CULPA reviews said her tests were so impossible. The first one was somewhat challenging but easy enough that students were able to do well. But the second test was insane. It asked questions about the most minute details of the readings and worded the answers very weirdly, so even if you thought you knew the answer, you weren't really sure. The average for this test was a C, and she did not give any curve. Instead, she offers an extra credit assignment, which is very simple to do but only raises your final grade by 1 point, so it is not such a huge help. I think the class would probably have benefitted much more from a curve on the C-average exam.\nSo I do agree with the other reviewers when I say that it is VERY hard to get an A in this class. I am a psych major and I took this class for the lab, but I also took developmental psych, and I highly recommend that class over this one. For one thing, personality psych is not a very interesting subject. My other friends in the course and I laugh about how we took an entire semester of it and still have no idea what personality psych is. Developmental is MUCH more interesting and much easier to do well in. I can't speak for the developmental lab, but I'm still sure it's worth it to take another class over this one.\nThe lab in this class was fine. It was a lot of busywork but it wasn't too too terrible, and it ends up helping out your grade a little since it makes the exams weigh less.\nWorkload:\nNormal amount of reading each week, three non-cumulative 50-question, multiple choice tests.\nFor the lab, there is a lot of busywork but the assignments are all very straightforward and most of the work is group work, which is nice.\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "December 10, 2009",
            "review_content": "\ni found the material positively boring, and her presentation of it i don't think helped that. she can be occasionally funny at times (intentionally or not) but i could barely pay attention half the time. additionally, the exams were unnecessarily difficult for material so simple and common sense. i felt like they didn't always give students the opportunity to show their knowledge of the material, as they were so detail oriented. but as the class progressed, she became a little more transparent about what she was going to ask on the exams (she gave a detailed review sheet for the last exam). \nbut a good class to take for the science requirement, i think. totally manageable.\nWorkload:\ni only read the textbook closer to the exam, after she said what we should concentrate on; if you followed the syllabus you would be doing a lot of superfluous reading, as the book is pretty longwinded. three exams, 50 questions each.\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "January 26, 2009",
            "review_content": "\nInteresting lectures, really monotone voice and way of presenting the information though, she just talks straight at you the whole hour and 15 min. \nTotally bearable, and sometimes really interesting. Sweet lady, approachable. \nWorkload:\nThree exams, mulitple choice, make sure you read everything she gives you and try to go to lecture as much as possible, although you can get away with not going all the time. \n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "January 15, 2007",
            "review_content": "\nTo be honest, although she is a somewhat cold and aloof person, I don't fully understand the reviews that claim Woike to be a harsh and rude person. She seems to really respect her students and their input. She gives excellent and complete answers to every question she recieves and she is always quite well prepared. She is also a very humorous lecturer and designed a course centered around very interesting content and reading. I only took the lecture component and found it somewhat strenuous (especially around the time of the very difficult exams) so I can only imagine how tough this course must be if you take the lab as well. However she is a fair scorer and I came away happily with a B (note that it is VERY difficult to get an A in this class). Though this class wasn't perfect and wasn't ALWAYS exciting I would definitely recommend it to anyone. \nWorkload:\na chapter a week and 3 difficult tests that require ALOT of preparation. no final, no homework, no attendance taken. \n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "January 06, 2005",
            "review_content": "\nDespite mixed reviews, I really enjoyed my class with Professor Woike. Yes, she's a bit brash, and yes in the beginning I was intimidated by her; however, she is truly intelligent and knowledgeable, and she does a great job of relaying everything she knows to her students. Though some may have found her mean, I disagree wholeheartedly. Professor Woike is really kind, and if you are polite and interested, she'll give back to you 110%. She is quirky, humorous, and fun--all of her lectures were interesting, linear, and organized. It is not an easy class, however. The workload is steady and there is a lot of reading which you should keep up with. Her exams treat her lectures and the textbook as separate entities and test on both; therefore, take good notes and read everything (and take notes on the reading). Though I found this a challenging course, I ended up doing well. Just keep up with the reading, study, and be interetested; you'll appreciate Woike a whole lot more. \nWorkload:\nAverage: 100-ish pages per week of textbook reading, plus additional studies, three exams that divide semester into three parts, each take one class period (even final).\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "December 29, 2004",
            "review_content": "\nI'm ambivalent about Professor Woike. I can definitely sympathize with the other reviews that cite her for being somewhat boring and affected, and even rude, but I also found her quite funny and I thought that material was interesting. One area where I agree with the other reviews is that her tests are pretty random and unfair, with questions from the little boxes (yeah, the ones that no professor expects the students to read) in the textbook. But if you read everything and have a good grasp of the material, you'll do fine. Her in-class exam reviews are helpful also.\nWorkload:\nBasically a chapter a week from the textbook, sometimes substituted for articles (we get a coursepack), three exams (the final is the same length as the first two)\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Woike is a quirky funny woman. She is fun to listen to and her lectures can be interesting. But, she doesn't seem to know much about what she's talking about. So, the class is mainly focused on the large textbook. The textbook isn't bad, but Woike makes it unclear as to whether the tests will be focused on her disorganized lectures or the hundreds of textbook pages. Because of that, her tests are surprisingly difficult and often include questions that have very little relevance to the class or the subject matter. Out of a class of about 50-60, 20-30 students passed/failed.  But, no matter. As Woike told the class right before we filled out the evaluations: \"I have tenure so the evaluations don't really matter.\" Fabulous attitude.\nWorkload:\n3 tests, lots of reading.\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "December 29, 2004",
            "review_content": "\nDisagree with all the other reviews! Professor Woike is a very funny and interesting instructor. She makes the material seem fascinating, and generally gives us a fair idea of what to study for on the exams. Essay questions are never a surprise. There is, granted, a lot of reading, but she makes it clear that we should stay up to date on all of it. Definitely recommend her.\nWorkload:\n3 non-cummulative exams, comprised of 40 multiple choice questions and one essay question\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "June 14, 2004",
            "review_content": "\nThis is bar far the most annoying teacher - she proceeds to not only chew the gum but also chew the words - if you understand her it is because she drags words as if you would not be able to understand her otherwise.  The questions on the tests are ridiculous - like what did Prof. Woike say about this concept in class.  Well I would know if I could stay awake in it...\n"
        },
        {
            "course_name": "Health Psychology",
            "review_date": "May 14, 2004",
            "review_content": "\nOverall I really enjoyed Prof.  Woike's class, although i can see why others would have reviewed her negatively.  She is slightly disorganized, she does tend to chew gum rather annoyingly during every class, and she can be downright mean when interacting with certain members of the class.  However, I must say I was rarely bored during her class.  She picks interesting topics, and adds extra information beyond the 300+ pages we had to read per seminar.  Also, she was very considerate with our term paper, requiring several drafts which really helped us to make sure that we had turned in our best possible work.  Also, because you got feedback on TWO drafts before you recieved any grade, you got the highest possible grade based on the work you did.  Overall this class is very interesting and a must for anyone planning on going into a health related industry.  Despite what was said by others, I wound up liking Prof. \nWoike.  She's not a perfect professor but she was FAR from the worst prof ive had a Columbia, and I really enjoyed her class.\nWorkload:\nLOTS of reading per seminar.  Read enough to comment.  Each person has to write discussion questions for a topic of assigned readings and to lead a discussison.  Everyone also has to choose their own project topic, for which they write a 20 page paper and present the topic to the class for around 40 minutes.  This was the only work all semester that I found actually meaningful as it wasn't just rote memorization or busy work, but actually intended to develop skills, which I think it did.\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "February 11, 2004",
            "review_content": "\nAvoid Professor Woike at all costs.  Do not be fooled by the \"fun\" first lecture or two.  Once she ropes you in, she turns a complete 180 and proceeds to deliver a semester's worth of boring, unorganized \"lectures\".  She is extremely affected, and while she clearly knows her stuff she is incapable of presenting it coherantly.  Also:  in order to succeed in this class, you must be willing to photocopy your own copies of thick piles of esoteric journal articles (not online), which may or may not be on reserve at the barnard library (note:super-annoying hours.  Biggest copico card balance i've ever encountered.  once a professor assigns that many pages of reading, a COURSEPACK is required.\na note on her exams: they include minute details that test your ability to physically be in your seat, and retain mindless information that does not pertain to the subject matter.  for example (i'm paraphrasing, but the essence remains): according to the video we saw in class, erikson's  (A) wife's name is mary  (B) lived in cleaveland  (C) had a border collie growing up  (D) all of the above.    she also asked the author of our textbook.\ni kid you not.\nthis class is not suggested if you prefer being tested on actual, relevant course material.\nWorkload:\n2 midterms, final: non cumulative.  lab can be time consuming, grading can be tough on minute details, mostly pertaining to APA format, also very dependant on how tough your TA grades.\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "January 01, 2004",
            "review_content": "\nHOrrible, horrible! Stay away from this class if you can. If you can't...(I took the class to fulfill the Barnard science requirement) take it pass/fail. Not hard to get a B but almost impossible to get an A. Lectures were rarely organized...and Woike loves to put minute-detailed questions that were barely covered in class on exams. Lab was discouraging...grading was difficult emphasizing minute details that were not even brought up in class. \nWorkload:\nReading not that extensive...2 midterms and a final. All are the same format--40 multiple choice and a short essay. Multiple choice are meant to be tricky. \n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "December 01, 2003",
            "review_content": "\nI disagree. I think that woike is an interesting professor. she is a bit of an odd person... but still she makes the boring textbook sound more interesting than it actually is. she is probably the most interesting psych professor- she's a dream compared to the others in the dept.  i would recommend her class\nWorkload:\n3 exams- not so difficult\n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "January 24, 2003",
            "review_content": "\nThis woman has the worst personality ever. She is obnoxious, rude, and unprofessional. She chews gum during her lectures, rendering her speech unintelligible. I actually got an A in her class, so I have no grade-related axe to grind. The work load is not so bad and her tests are fair. her attitude and general demeanor are what offended me. She tends to be very unapproachable and mean. \n"
        }
    ]
}