{
    "prof_info": [
        {
            "prof_name": "Tony Jebara",
            "prof_id": 1636,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Machine Learning",
            "review_date": "December 14, 2013",
            "review_content": "\nMachine Learning by Prof. Jebara was an excellent class. There are not many graduate classes at Columbia where you feel you have learnt your money's worth. Trust me, this is one class where you will feel challenged and inspired. Prof. Jebara is good with giving intuitions about many things, picking examples from Vision, Genomics, NLP. You many find this course \"hard\", or \"uninteresting\", if you thought ML is \"cool\", or the sole image of Machine Learning in your head is from ML class by Andrew Ng on Coursera. This is a very maths based course, and he mentions this in the first class, and urges people to drop if they can't handle it. I guess it is fair on his part, to announce that the maths will be slighty tough, I wouldn't say even tough, just different. This course will help you a lot, if you want to read Machine Learning papers, do research in the field, because there is some very odd notation involved and the course will teach you that. My vote is take this course, if you are ready to dive into hour long lectures of Mathematical Proofs, but if you are upto it, this will be a great course.\nWorkload:\n5 Assignments : Assignments are actually easy, programing ones might take time depending on how familiar you are with matlab\n2 quizzes, \nMidterm:easy\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "January 26, 2013",
            "review_content": "\nTop 5 (out of 1,024) reasons to avoid this course at all costs:\n1. No matter how much Prob/Stats or Linear Algebra or just MATH in general you *think* you know, you're not ready for this course (especially if you're an undergrad.. if you're a superstar Ph.D student, make your own judgement).  For example, on one of the homeworks, we were asked to perform vector calculus, which is usually not covered in any of the prerequisites. Another example is when we were asked to do multiple indefinite integrals of a particularly long formula, by hand, during a midterm as a problem worth 20% of the grade.\n2. He goes through very few examples in class, (and when he does, only a select few understand him) which means that most of the homework problems you have absolutely no idea how to do, even if you took the best notes humanly possible in his incredibly dull lectures. For this reason, academic honesty in its strictest definition (no looking through internet for answers, no collaboration on homeworks) is nowhere to be found, because it is impossible to do 90% of the workload in this class otherwise.\n3. He can't teach. I will leave it at this because no other words can describe how truly bad he is.\n4. Since this isn't an absolute requirement for any tracks (even for AI, you can take much better courses such as Spoken Language Processing), you can do yourself a favor and take this same course on Coursera or other excellent online alternatives if you would really like to learn Machine Learning. This is more ideal since Jebara's class is the least efficient place to do any learning.\n5. http://www1.cs.columbia.edu/~jebara/ Look at his picture. He is smiling smugly at the pains you will have to go through to survive in his course.\nWorkload:\n5 Homeworks (5-20 hours of RESEARCH, because you ain't solving these with what you \"learned\" in class)\n1 Midterm (Average was around 50)\n1 Final\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "July 06, 2011",
            "review_content": "\nMost of the reviewers from spring 2011 class have got it right about the lecture style of prof Jebara. He simply can't teach. I think the prerequisites are enough to prepare you for the math covered in the material; you will have the opportunity to explore more of differentials applied to matrices, lagrangian and bayesian probability. \nFor me it was pain attending lectures as I could hardly follow him. I guess his lectures were hampered by the size of the class. He would always seem to be in a hurry to cover as much material as he could without really caring whether students understand any of it or not. Like many others, I had to rely on online lectures from Stanford to build a proper understanding of many concepts covered in the class. What a shame! \nAssignments do well in helping you get the feel of the concepts but are not substantial enough to endow confidence to tackle hard problems. Mid-term was a disaster. Final exam was good, I thought.\n\nWorkload:\nFive assignments, a midterm and a final exam. Assignments have programming (in matlab) and non-programming (math) problems. Most of the problems in assignments test basic knowledge, therefore doable in couple of hours. Some (in most cases non-programming problems) are extremely difficult and you would spend days pondering and not get an answer.\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "May 18, 2011",
            "review_content": "\nThe topics were extremely interesting. All of the readings were fun and understandable. Unfortunately, the class was enormous with about 200 people and the lectures took a hit.  The instructor had no clue where most of the class was, and questions were rare. The lecture slides and lectures assumed reading ahead of time, and half of the class seemed to be behind. I got an A+ and I didn't do anything special other than read ahead in the book. The class doesn't lost as prerequisites but should MATLAB, optimization (Lagrangians, subgradient and gradient methods, etc.), graduate probability ( measure spaces, Bayes, and conditional/causal reasoning, etc.), lots and lots of linear algebra, and differential equations. It felt like he was trying to fit an entire career of ML into one semester.  \nSome I sat next to in class were from basketweaving departments like OR or Business.  This is definitely a math or statistics class. \nWorkload:\nFive very challenging homeworks. They would have taken much longer, but the answers were all online from previous years.\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "May 14, 2011",
            "review_content": "\nWarning: this class should be an applied math course. I attended lecture frequently but learned nearly nothing, and the slides were incomprehensible. He assumed a level of math that was not reflected in the prerequisites whatsoever, but at the same time, he oversimplified some things to the point of being confusing: he explained what an integral was but then, a few lectures later, used Lagrange multipliers without a single word of explanation. The homeworks were nigh impossible, and the midterm was about tangential mathematical properties of the equations that we based algorithms off of. This course is by far the worst grade I've gotten at Columbia, despite the effort I put in.\nWorkload:\nFive homeworks that take around 6 to 10 hours each.\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "May 11, 2011",
            "review_content": "\nThis is a very difficult course made much worse by the fact that he simply can't teach.  From what I understand he is very good in his field, but that does not translate into the classroom.\nThe lectures are confusing and the slides are difficult to understand.  He spends slide after slide on the easiest parts and then glosses over the more difficult concepts because they're \"obvious\".  I and a lot of other students in the class didn't bother to use our notes and materials from his lectures to prepare, instead using the freely available materials for the Stanford machine learning course.  It's absurd how much better they are.\nJebara isn't very approachable.  If you look at his personal web page he has about ten different places where he says he's busy and can't be bothered.  The TA's are hit and miss - there are one or two that are good and will actually try to help, but the rest aren't that great.  I'm pretty sure one of them never actually held office hours.  He just sent out an email that he was canceling every week.\nAlso, there was a really strange incident that stuck out at me: on one of the homeworks one of the TA's announced they thought there was a lot of cheating going on, as they got a lot of almost identical submissions (something like 40 out of 130ish students), and their response to this was to take a few points off the grade of any student with one of those suspicious homeworks who asked for a regrade.  It just falls in with the fact that, as a general rule, the professor and TA's for this class just can't be bothered.\nWorkload:\n5 deceptively difficult homework assignments - they seem simple, but you have to look up a lot of math\n1 unholy difficult midterm - I thought I was pretty prepared, but there were a lot of hard concepts combined, along with the requirement of doing a lot of big matrix operations we'd been doing in matlab by hand.  Not fun.  For one 20 point question, I got 0 points and a frownie face as the only explanation.\n1 final that I'm fairly sure will be a crime against humanity\n\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "April 27, 2011",
            "review_content": "\nOne of my least favorite classes at Columbia.  I am sure the professor is a genius in his field, but it was not well executed or translated to undergrads.  The lectures were dry at best - the class was not engaged.  The lectures were very repetitive - you realy only needed to go to every other class as he spend the first half reviewing and the second half teaching (though I did go to every class).  The slides were confusing with too much information crammed into them.\nThe teacher was not very approachable - I went to his office hours but he was unable to explain the proof in question to me.\nMuch of the course was over my head, in part because the prerequisites did not prepare me.  Iw as not alone in this, but the course was not taught with this in mind.\nThe TA's were horrendous at best.  The did NOT understand teh material.  I would usually start the homework the day it was assigned - if I went to office hours then I was told I was working too early and they were not yet expected to understand the homework.  I was also very annoyed when, after a homework had been live for a week (and I had completed it) it was changed.\nWorkload:\nExams were impossible - no idea where he got the concepts from\n6 decently straightforward homeworks\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "May 15, 2010",
            "review_content": "\nThere's a lot of debate on the background required to take/enjoy this course. Let me give you mine: Linear algebra (important, forgot), Gradients/Hessian (slightly important, forgot), diff/integ of exp, log, poly (important, very good), Probability (most important, Very good), Statistics (not needed, forgot), Optimization (slightly important, none), MATLAB (most important, none). Do not let people intimidate you, you can still do very well in this course by honest effort. Besides Prof. Jebara is a very good and considerate teacher who buffers his lectures with essential background material. \nI'm puzzled with the other reviewer's comments regarding the material with respect to Ng et al. The combination of topics such as SVMs, VC Dim, graphical models and Back propagation is rare. Digging deeper, 6.867 at MIT is very similar in scope.\nHis slides are a work of art! Beautifully thought out with rich visual cues.\nTAs were brilliant (Pier Francesco Palamara and David Bondatti). Patient, welcoming and knew the material inside out.\nWorkload:\nVery well designed assignments. These involve translating/extending the equations in class to new distributions and settings and implementing them in MATLAB for a non-trivial data set. I feel very happy doing them because I know I will know EM, Junction Tree etc. inside out rather than wrestling some artificially hard time drain. Exams are challenging but fun! Make sure to get plenty of sleep and work out the practice exams WITHOUT referring to your notes.\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "April 01, 2008",
            "review_content": "\nNice guy, a horrible professor. The main problem is that he tries to fit way too much information into slides and is so boring that you stop caring about the course. He also interlaces examples while introducing examples, which may seem like a good idea, but Prof. Jebara introduces them at such bad times that you don't learn anything. \nAlso, the homework is embarrassingly easy and you don't learn anything, so by the time exams roll around, you don't have a clue what happened in the class.\nBefore people spout off bullshit about how machine learning is hard, try to find a lecture about ML by Andrew Ng (Stanford), Michael Jordan (Berkeley), or Tommi Jaakkola (MIT), or for a different flavor Carlos Guestrin (CMU). All the classes they teach cover more material, but the students are able to understand more material and understand it better.\nWorkload:\nTwo bad exams, 6 joke homeworks\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "February 15, 2007",
            "review_content": "\nMy opinion is opposite to that of the other two reviews. While I do not rate him as the best guy in the department, he is not as bad as the other two reviews suggest. Machine Learning is a specialized field, unlike other core cs courses, it is interdisciplinary. It does need a good background in Linear Algebra, Calculus and a bit of statistics. WIth the right background, if the course is taken, the course is really enjoyable. Some of his slides are really good (again if you have the right background needed). Compared to Machine Learning home works given at other schools by other professors, his home works really make you understand what you implement. Overall I would give an A- for his course. I would like to stress that you need right background and interest to appreciate his classes\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "June 25, 2006",
            "review_content": "\nOne of the worst professors at Columbia.  Not a mean guy, by any means, probably a genius in his field, yet not a very effective lecturer.  Be sure to know your linear algebra and calculus cold because this is what this course is all about.  If you're a statistics major, all the better, the course will be a breeze for you.  All the rest, keep out.\nWorkload:\nNot too bad, if you understand the material.\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "May 18, 2003",
            "review_content": "\nAllegedly Columbia's resident machine learning guru, Jebara is an extremely mediocre professor.  The lecture slides were unhelpful at best, and he basically just reads off of them during lecture with some supplementary doodling on the blackboard.  Still, he's a nice guy who will be happy to explain stuff in office hours, but I found the books to be the most helpful, especially for the homeworks.  As for the course, be ready for A LOT of stat and linear algebra before you get to the good stuff.\nWorkload:\nFour cookbook homework assignments using MATLAB (start early), a moderately difficult midterm, a virtually impossible final, and an open-ended project/paper.  \n"
        }
    ]
}