{
    "prof_info": [
        {
            "prof_name": "Liza Monroy",
            "prof_id": 4601,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "April 25, 2012",
            "review_content": "\nLiza Monroy is a true gem; there is no other way to put it. If you are one of the lucky few with the privilege of being a student in her class, hold on tight to your spot because if I were your peers, I would kill for it.\nLiza is very laid back. She assigns readings for some classes, not all. She facilitates a discussion in which you never feel pressure to speak. She mixes up class styles to include workshops, discussion, and work-time. The papers are standard UW papers. The last one is creative writings instead of retrospective.\nLiza is very lenient on due dates and word count. 'Quality of Quantity' is her motto. As another reviewer mentioned, she always gives you the tools to receive an A. She is also very accessible. She e-mails back quickly, and if you can't make office hours she'll even set up a Skype date to discuss a paper.\nThis is the best class I have taken at Columbia so far. She is one of the best professors at Columbia. I am looking forward to taking a creative writing class from her in the future. (I am a sociology major)\nThis is the type of class that you love so much you want to give that extra amount of work even though often it is not always needed. I looked forward to every class, and I enjoyed writing every paper.\nThanks Liza, for the best UW class ever! Boy am I blessed that I picked into her section!\nWorkload:\nStandard 4 UW papers. However, you aren't turning them in to any old professor, you are turning them into Liza- aka a privilege!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 10, 2012",
            "review_content": "\nLiza is incredible. UWriting has become my favorite class this semester and actually my favorite class I've taken in a while.\nExtremely understanding with deadlines, genuinely caring when it comes to editing drafts and commenting on essays. Even offered to look at other creative pieces I've been working on completely separate from UW.\nI feel so lucky to be in her class. Hope I can have her in the future for a creative writing class.\nWorkload:\nshort, fun readings for each class (often recent ones from the Times from columns that she has been repeatedly published in!)\nall of the classic UW essays, but Liza is much more lenient with the drafting process than other teachers -- often only asks for one draft prior to the final draft of each essay.\nlast essay can be substituted for an editorial/personal essay!\n"
        },
        {
            "course_name": "university writing",
            "review_date": "December 03, 2011",
            "review_content": "\nLiza is an amazing professor who truly cares about the success and confidence of her students. Writing can be a very intimidating process, but Liza removes the insecurities and allows for the student to truly shine through. The multiple drafts at first seemed troublesome, when in actuality, it led to some of the best pieces I have yet to compose. Her feedback is insightful and definitely helped me in reworking my papers. I could not agree more with the previous posts that stated if you see you have Prof. Monroy, you are in luck! That is certainly true. Regarding the extensions, I never had to utilize this, but I agree that if need be, she would accommodate you within reason, but she definitely would not allow you to take advantage--a quality that leads me to respect her even more. Wonderful professor, intelligent, accomplished, and gracious. \nWorkload:\nVery manageable--weekly light, interesting readings, usually a response due for each class, and drafts. In total--3 major essays which progressively increase in length, and 1 retrospective essay, which can also be a creative writing experiment.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "June 19, 2009",
            "review_content": "\nIf you find yourself nervously looking at your courseworks page the week before classes start only to find Liza's name in your schedule...you have certainly hit the jackpot!  University Writing may get mixed reviews, but Liza was undoubtedly one of the best teachers I have ever had.  She is patient, smart, creative, successful and always willing to help.  I went into U.Writing loving writing, but I left with even more confidence and a greater understanding of my own personal style of writing.  There were others in my section who absolutely hated writing and thoroughly enjoyed the class and ended the semester loving, (or at least liking)  writing.  \nI can't express how accessible Liza is.  She would read as many drafts as you wanted to give her and wrote long letters to you in response about your progress, what she liked about your piece, and tips on how to improve the essay.  Liza is a talented writer who deserves a lot of respect.  You will always enjoy going to class.  \nIf there was a UW Part II with Liza, I would be there in a heartbeat.\nWorkload:\nThe 4 essay progressions of U.Writing and a few reactions to articles which are not graded, but counted as participation.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 29, 2009",
            "review_content": "\nLiza is wonderful - there's just no question. I've never written a review before, but I had to for this teacher because she is just so great. First off, she's extremely relaxed about the courseload and work. If you need an extension, there's no question - granted. If you couldn't do the work one night - forgiven. Now don't get me wrong, she won't let you take advantage of her, but Liza is unquestionably kind and caring; she wants you not only to become a better writer and do really well in her class, but also to be okay in your life. I think she's reached out to everyone in our class to see how our other classes are - if we're doing alright in this, that, or the other - if we ever need her to write a recommendation for one of us - anything. She's even invited us all to a celebratory end-of-semester party at her house after everything. Super wonderful person. Kind.\nAs for teaching, Liza's feedback on papers is amazing. We've receieved dozens of letters from her throughout the semester that give very specific and valuable advice - a part of each letter is always how to fix the specific paper, and another is always how to improve our writing in a greater, more general sense. She gives us the tools to get an A, always. She's also more than willing to give unlimited feedback - I don't know if it's the same for all UW teachers, but she really is willing to read your paper as many drafts as many times as you want. Invaluable.\nSeriously take this course with Liza if you have the opportunity. I'm coming out of it a much better writer; I got an A; made a really wonderful friend (who wrote me a recommendation before she really even knew me that well cause she's awesome); and most of all, I had a fun, easygoing, wonderful experience. This was the best class and best teacher I've had at Columbia thus far.\nWorkload:\nSame as any UW class. Oh, but Liza gives the opportunity to trade out the retrospective essay with a creative piece (fiction, even, if you want).\n"
        }
    ]
}