{
    "prof_info": [
        {
            "prof_name": "Alan Segal",
            "prof_id": 359,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Life After Death",
            "review_date": "June 11, 2009",
            "review_content": "\nBy far the MOST BORING but EASIEST class I have ever taken. somehow, each week the lectures are boring- which is weird because the subject sounds so interesting. however, if you actually do the reading, it is good material (but there is NO NEED to buy segal's huge book! take it from an A student! promise!). \n"
        },
        {
            "course_name": "Life After Death",
            "review_date": "September 03, 2007",
            "review_content": "\nThe course should have been called \"Life After Death... as it relates to Judaism, the only topic I have any interest in.\" Seriously, in what should have been an overview of ancient civilizations with DIFFERENT religions, all Segal would do is talk about Judaism. Maybe take a class that is supposed to be about it and you would like him better. But this class was disorganized, sloppy, and overall, not at all informative. His lecture style seems to be \"show up and ramble about whatever the hell I want.\" As for his multi-media content, what the hell does watching excerpts from \"The Magic Flute\" have to do with anything? Maybe he's nice, maybe he's informative, but that did not come off in this class. The fact that the students were clearly not interested in what he was saying (which was kind of his fault) made him defensive. I really didn't learn anything, but since my TA was nice, I did fine in the class. \nWorkload:\n3 papers that you can bullshit (I wrote and researched one in half a day and got an \"A\".) Reading is totally unnecessary. Don't buy his book!\n"
        },
        {
            "course_name": "Life After Death",
            "review_date": "November 13, 2006",
            "review_content": "\nThis is by far one of the worst classes I have taken here so far. Segal loves to hear himself talk and goes on tangents freqeutnly. There is no need to buy his book (he will put it on the books for the course because he gets royalties on it) because you dont use it at all. perks of the class include that there really isnt much work and you dont need to do the reading. also, hes a really easy grader, a guaranteed A if your TA likes you. if you want a boring class with an easy A take it. \nWorkload:\neasy\n"
        },
        {
            "course_name": "Life After Death",
            "review_date": "November 13, 2006",
            "review_content": "\nThis is by far one of the worst classes I have taken here so far. Segal loves to hear himself talk and goes on tangents freqeutnly. There is no need to buy his book (he will put it on the books for the course because he gets royalties on it) because you dont use it at all. perks of the class include that there really isnt much work and you dont need to do the reading. also, hes a really easy grader, a guaranteed A if your TA likes you. if you want a boring class with an easy A take it. \nWorkload:\neasy\n"
        },
        {
            "course_name": "Life After Death",
            "review_date": "May 15, 2006",
            "review_content": "\nThis was a really interesting course. The lectures were definitely more interesting towards the beginning of the semester, but I am not sure if that is because of a personal preference to the earlier material or that Prof. Segal was just running out of energy near the end. Nevertheless, I can safely say that the reading list was one of the best I have had at Barnard. No, you do not have to do all the readings, but it helps if you do ... and the readings are really very interesting. Students should know that he has an attendence policy for the lecture (yes, with 250+ students, it was interesting) ... and your attendence DOES MATTER and does weigh surpringly heavily on your final grade for the course.\nI found Prof. Segal to be a very nice, approachable professor. He really loves it when you come to his office hours and he is genuinely engaged in the subject and likes talking to students about it. Yes, he has some strong political beliefs and yes, they do come out in lecture occassionally ... but they were side notes and did NOT influence the range of material he presented (so I would therefore not call it \"unprofessional\"). Good class, fairly easy, interesting material, approachable prof. Go for it. (PS - BC students: it fulfills the Cultures and Comparison requirement)\nWorkload:\nEASY. While there were a lot of assigned readings, there were only 2 5pg papers; the first one was allowed to be rewritten. No final.\n"
        },
        {
            "course_name": "Life After Death",
            "review_date": "May 15, 2006",
            "review_content": "\nIf your looking for an easy, informative religion class, this is the class for you. This class is a lecture class, but all of the discussion sections are optional, as well as the meetings with the T.A.s. Basically, you just attend class to listen. Attending class is stressed though, because attendance is actually taken. But since there are no exams on the material, you can just go to class and listen while you finish up homework, check your email, whatever. I usually looked forward to going to this class as well, just because Segal knows an extensive amount about western religions, and the class is really interesting. There are two/three papers, which I recommend seeing a T.A. about, but nothing else besides that. An esay A class as long as you actually try on the papers.\nWorkload:\ntwo/three papers and attendance taken in class\n"
        },
        {
            "course_name": "Life After Death",
            "review_date": "May 03, 2006",
            "review_content": "\nWhile I hate to be blunt, the only fitting word for this class is \"joke.\"  On the first day, it was clear that it was going to be a jock/greek life fiesta, which seemed okay at the time.  Now, four months later- not so much.  Segal's lectures are disorganized (he can't operate technology to save his life), poorly executed (he'd scribble useless, illegible words on the chalkboard and pull up courseworks for no apparent reason), and often boring.  Sometimes his humor savedthe day/woke people up, but typically, the only thing interesting to do in that room was count the number of people playing sudoku. I honestly took it because I thought I'd enjoy the content, but given the circumstances, that was impossible.\nWorkload:\nLight.  He cut the 3 papers down to two because he felt it was \"just too much.\"  TAs were helpful.  Papers had the propensity to be interesting.  Books proved useless, except for Campbell and the Bible, in my opinion.\n"
        },
        {
            "course_name": "Life After Death",
            "review_date": "April 18, 2006",
            "review_content": "\nThis class is a waste of time. True, he tries to make it interesting with his presentations but sitting through the lectures are an utter waste of time. Segal is way too into himself and loves to spend time talking about himself. Buying the books are a waste of money as you dont even need to read them. This class could be interesting but Segal wastes too much time with pointless stuff and the class becomes redundant and boring. I would have slept through the class but attendance is mandatory. Light course-load though - only 2 papers which you can rewrite for a better grade.\nWorkload:\neasy\n"
        },
        {
            "course_name": "Life After Death",
            "review_date": "January 10, 2006",
            "review_content": "\nThis is a great class.  Lectures are really interesting, and Prof. Segal uses a lot of multi-media equpiment and presentations.  Really fun.  The only two drawbacks are mandatory attendance (which isn't really a problem since the lectures are so good) and Prof. Segal's complete lack of tact and professionalism in injecting political commentary into his lectures (but the majority of students here will probably really enjoy what he has to say about all that).\nWorkload:\nCan't remember the reading (because I didn't do any of it), short papers that you can re-write for better grades.\n"
        },
        {
            "course_name": "Judaism",
            "review_date": "January 09, 2006",
            "review_content": "\nAlan Segal is a brilliant professor but this class was definitely far from easy. I worked my ass off and got a B. I did learn more things from this course than I have from any course at Columbia/Barnard for a while, but still.\n"
        },
        {
            "course_name": "Judaism in the Time of Jesus",
            "review_date": "October 27, 2005",
            "review_content": "\nProfessor Segal is a great professor and this class is always packed. Judiasm in the Time of Jesus explores many of the traditional Judeo-Christian beliefs and the Biblical or historical stories behind them. Some students might be a little surprised by some of the thing Prof. Segal says, or maybe a little unwilling to admit that some of the things they have believed their entire life are very different in reality. He also examines the historical Jesus as opposed to the official institutional version of Jesus. He points out descrepancies in the Bible and uses his very critical approach in some instances to show that a story is unlikely to be true, and in others to show that something from a traditional story very likely did take place. His lectures are very interesting and the reading is not too bad at all. The essay topics also allow the students a lot of room to explore what interests them. I definitely recommend this class to anyone, especially if this is not your area of study and you want to learn about something new-the class is manageable and it might also open up your eyes!\nWorkload:\nReadings each week, which follow along with the topic being talked about in lecture. Three essays spread out over the term; you can also do more for extra credit. \n"
        },
        {
            "course_name": "V3201 Introduction to the Hebrew Bible",
            "review_date": "December 29, 2004",
            "review_content": "\nOverall, Segal is not a bad professor -- he does make incredibly odd jokes, mostly political and some slightly sexual.  Just ignore them -- this is college, everyone should be able to deal and not take such offensive with what is so obviously absurd.  Its a good class, with some interesting ideas taught.  I wouldn't really recommend it as an intro for those with no previous knowledge of the bible as he does have a very skewed way of teaching it.  Take what you can from the class and stop complaining.  \nWorkload:\nEASY--three papers (if you repeat what was said in class its an easy A)  No need to buy any of the books except for the bible of course.  Reading also not needed, everything is gone over in class\n"
        },
        {
            "course_name": "V3201 Introduction to the Hebrew Bible",
            "review_date": "December 17, 2004",
            "review_content": "\nThis class was certainly...interesting (for lack of a better word). Segal is quite pompous and arrogant. He tells awful, often offensive jokes every class and thinks he is very important especially since his last book was published (and yes, we all had to buy it). His most popular joke topics are Jews/Judaism (he's a Reform rabbi who basically rejected the pulpit and has made it clear he's much happier now that he's not observant), women (how can a Barnard professor make such mean Barnard jokes?), and the government (total Bush hater). His lectures were occassionally interesting. The only reason to show up to class is that it makes writing the three 4-5 page papers of the course easier since he goes over each topic. Segal also is a big fan of technology but really doesn't know how to use it. He wastes so much time trying to manipulate the projector and DVD player. He is also often late to class since he's a Jersey commuter. As long as you semi-answer the question asked for the paper topic, you'll get an A. Such easy grading it's ridiculous. This class is also a total jock class...I had practically the entire football and wrestling team in my class. It fufills a Barnard requirement and is an incredibly easy A. \nWorkload:\nThree 4-5 page papers with rewrite on 1-2 of them. Such an easy A.\n"
        },
        {
            "course_name": "Life After Death, Spring 2004",
            "review_date": "October 20, 2004",
            "review_content": "\nI take it back, I take it back, I take it back.  I love Prof. Segal, and I really deserve whatever I get karmically for having said such vile things about him.  He is engaging, and funny.  He knows a whole lot about what he talking about, and he's compassionate and really cares about his undergraduates.  He got very passionate about \"The Passion,\" but it was a nearly appropriate forum, and I really felt like I had an inside knowledge of the hype surrounding the film.  Love this guy, am hoping to take Judaism in the Time of Jesus with him next semester.\nWorkload:\n3 papers, don't really remember when they were due, attendance.  light reading, mostly from the book he wrote about different cultures' beliefs about the afterlife or lack thereof.\n"
        },
        {
            "course_name": "Judaism",
            "review_date": "January 14, 2004",
            "review_content": "\nSegal is someone you'll either love or hate.  His unashamed placement of his owns texts on the syllabus is laughable.  His arrogance can sort of be admired abstractly for what it is.  He is, however, one of the world's leading experts on Judaism.  His class is ill-organized and -attended, but he really doesn't seem to care.  He likes to hear himself speak, and I happen to be fascinated with Judaism so I liked to hear him speak also, but I knew plenty of people who had no use for him.  It's a coin toss, but if you're very interested in Judaism, you'll like it.\nWorkload:\nparticipation/attendance (at least that's what it says on the syllabus - mine became pretty spotty by the end), a minimum of three papers, he chooses the topics.  You get rewrites, and the grades get better as you go along.  I got an A-.\n"
        },
        {
            "course_name": "Judaism",
            "review_date": "January 01, 2004",
            "review_content": "\nOverall-I highly recommend this class!!! Prof. Segal is highly knowledgeable in this subject and is very friendly both in and out of class.  I took this class to fulfill a requirement and I walked away from the class learning a lot. Lectures engaging as he loves to use the projector with every one of his lectures.\nWorkload:\nReading is not necessary. No exams at all! 3 papers spaced out during the semester 6-8 pages long. Grading is fair...with effort...easy A/A-! \n"
        },
        {
            "course_name": "Judaism",
            "review_date": "November 03, 2003",
            "review_content": "\nI took this class in hopes of acquiring a basic knowledge of the history of judaism. Unfortunately, the lectures are somewhat disorganized and disjointed, and although the material covered is interesting, and professor segal engaging, I am completely confused as to the actual structure of this religion, and how it developed over time. \nWorkload:\n3 papers. no midterm or final. \n"
        },
        {
            "course_name": "Judaism in the Time of Jesus",
            "review_date": "April 23, 2002",
            "review_content": "\nIn response to the previous review, he does not hate orthodox Jews. He just disagrees with them. He said that the author of one of the texts, who happens to be an orthodox Jew, is one of his good friends, and one of the guest lecturers, also a friend, was from an orthodox background. i think he's an ordained rabbi, or however you get to be a rabbi, too, so i think he just selects bits and pieces that he disagrees with in the orthodox philosophy, but harbors no general disdain. He is brilliant, but he doens't shove it in your face. He knows German, Hebrew, Greek, French, pieces of Italian, and of course, English. He knows everything there is to know about ancient Jewish civilization, and if you pay attention, you'll realize this. The material is pretty interesting, but i have a hard time caring sometimes because everything is so easy, and there's absolutely no motivation to do the reading except for overzealousness and extra time. He is incredibly sarcastic, so when he told one of the previous reviewers he aims to prove that religion is full of crap, he probably meant that any intellectual human being should ask questions about his or her religion and actively try to find answers, with the knowledge that sometimes there won't be any. Having taken Massad's class on Palestinian and Israeli politics and societies, this class was total cake in terms of offensiveness, except when the orthodox people in the class started spouting their \"always right\" views. That was more difficult than listening to Joseph Massad. \nWorkload:\nthree papers. don't bother doing the reading. enjoy your A. ideal for jocks. \n"
        },
        {
            "course_name": "V3201 Introduction to the Hebrew Bible",
            "review_date": "January 28, 2002",
            "review_content": "\nThe one beef I had with Segal's Intro. to Hebrew Bible class were the cancellations. I could understand cancellations due to Sept. 11th and the Jewish holidays, but it really is inexcusable that we missed more than a month of class time. That said, I have to totally disagree with the previous poster who gave Segal a nasty review. I learned tons about the world of the Bible from this class, and the course has whetted my apetite to go on to a graduate program in Biblical studies. The best part of the class is the way he lambasts the absurd view of Scripture promulgated by Orthodox Jews (and fundamentalist Christians). The lectures are highly entertaining (he plays music at the beginning and end of each class). One friend who also took the class told me glibly that Segal hated Orthodox Jews. [CULPA CENSOR] This makes sense in light of his approach to the bible...\nWorkload:\nEasy. Three papers (about 5-10 pages), no final. One of the easiest As I've gotten in 2.5 years at Columbia.\n"
        },
        {
            "course_name": "V3201 Introduction to the Hebrew Bible",
            "review_date": "December 23, 2001",
            "review_content": "\nI have never met such an arrogant man in my entire life. I found him disgusting. He speaks to hear himself talk and makes bad jokes to hear himself laugh at them. The workload isn't bad - just three papers that can be handed in at any time, so you don't have to do any of the readngs other then the ones for the papers. He was boring and constantly cancelled class. He had little to say about the topic at hand and what he did say was usually offensive. The good part is that the papers were pretty easily graded and if you just show up you'll be given a lot of points for doing so.  Warning: If you are at all religious - any religion - you will hate this man!!! On the last day of class he noted that he hoped that we had noticed by now his undying wish to make us all believe that our religions were false.\nWorkload:\nNot hard, but the easy A wasnt worth having to listen to him for an entire semester.\n"
        },
        {
            "course_name": "V3201 Introduction to the Hebrew Bible; V3210 Judaism in the time of Jesus",
            "review_date": "December 31, 1999",
            "review_content": "\nYou either love the guy or are horribly offended by his jokes and leave the first day. Even though he is a practicing Jew (and a reform Rabbi), The Bible, Judaism and Jesus will be put through the ringer. Some favorite quotes: \"The first 5 books of the Bible are F-I-C-T-I-O-N, fiction people\"; \"Any religion that bases its morality on the first 5 books of the bible is not thinking straight.\") As someone who is facinated by religion but critical of it, I loved this class! Segal is entertaining, funny, yet caring (go to his office hours). He loves multi-media almost to a fault, but he uses it to make fun of fundamentalists. He gets into theory, not just fact. And don't be scared off by the orthodox Jews in the class: Segal knows they know more than you ever will and grades accordingly. Class: Intro to the Hebrew Bible is better than Judiasm in the time of Jesus. Both classes are taught chronologically and like a history class. The main text in both is the Bible.\nWorkload:\nA good deal of reading but you do only what you want because there are no tests, just three papers that you can do on a variety of topics and are fairly and easily graded. Just show up to class -- he notices when you are not there.\n"
        }
    ]
}