{
    "prof_info": [
        {
            "prof_name": "Erin Ehsani",
            "prof_id": 11658,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "June 05, 2012",
            "review_content": "\nSweet teacher. She really cares a lot about her students and is incredibly understanding. The worst you could call her grading is fair and the best is lenient; She really tried to give people the resources and feedback they needed to improve. Her discussions were usually alright and often times interesting. She seemed to make a sincere effort to keep the class content as interesting and relevant as possible for UW. She also tried to present otherwise boring topics in as least painful a way as possible. To be sure, everyone was not always pleased with the topics we had to read and write on but at least most people were content most of the time. She encourages a less stuffy, non-academic style of writing and pointed out the problems that were relevant to students at Columbia. She was a strong advocate for presenting a well-reasoned opinion in your essays. She also favored off-beat type exercises that could be a lot of fun. I like her style. She's pretty responsive to feedback.\nSometimes the class could be tough to get through, a little dry, and sometimes, especially at the beginning of the year, the workload was really intense. I think the homework assignments were the worst part and they felt pretty repetitive and long. Draft assignments were demanding but she was pretty flexible about deadlines especially around midterms and exams. She tried to keep tab of when we were all drowning, particularly during midterms and finals.\nAll in all, I think almost all of her students leave pretty fond of her and for the better as writers. Be grateful that you have a teacher who cares about actually teaching so much. At the very, very worst, she at least will bring you cookies on occasion so I guess stay in her section for that. I don't think UWriting could get much better.\nWorkload:\nAverage for UW. For the first half of the semester, one or two articles, anywhere from 5-10 pages and of varying density per class with about a page of response questions. You do have to write a thoughtful response. You do not have to write an essay for each question. They're not graded per se but are factored into the standard three essays (lens, conversation, research, reflection.) Extra credit for the writing center usually, and i highly recommend going because the writing center was very helpful. Essay drafts usually had at least one weekend between each. You'll do most of it the night before anyway. Some of the readings are very, very good. Some of them are okay. A few are awful.\n"
        }
    ]
}