{
    "prof_info": [
        {
            "prof_name": "Robert Thurman",
            "prof_id": 193,
            "total_reviews": 22
        }
    ],
    "reviews": [
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "December 10, 2009",
            "review_content": "\nso i was kind of apprehensive about taking this class, after reading some of the below reviews. but i have to disagree with many of the negative remarks. i think he's gotten a bit more organized in his lectures, and there is indeed a structure to the class. yes, he goes on tangents, and yes, sometimes he's a little boring. but i think the positives outweigh the negatives. i learned a LOT about buddhism, which i knew literally almost nothing about before. additionally, i also learned much about thinking about religion, which i appreciated, not being religious myself. i enjoyed taking a class with such an academic celebrity (it's quite something when your professor talks about his personal conversations with the dalai lama; which he's quite pleased with, but irregardless...). thurman can be incredibly funny in class (intentionally or not) and has some funny stories to tell (but because he is self-proclaimed \"senile\" he often repeats them). i enjoyed his lectures, learned a lot, and would recommend taking this course with him. my only real complaint was that he didn't write some sanskrit terms on the board, and often talked fast about some things without pausing to let us catch up. \nand he didn't miss all that many classes, only four i think. it's understandable that he has obligations, and because there were four TAs for the class, it seemed like it was also an opportunity for them to practice lecture. i've had professors who skipped more than that, so some of the reviews about his checking out because he thinks he's above lecturing undergrads, whatever, isn't all that accurate (at least anymore). \n\nWorkload:\nyou can't possibly do ALL of the readings. i mainly read the primary sources, thurman's book inner revolution (if i had time), and the intro book. weekly course postings that you either need to spend time on or not depending on the TA, a midterm that required more time than given (and graded either easy or hard  again depending on the TA), and a final research paper on a topic of your own choice. all doable. \n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "January 18, 2007",
            "review_content": "\nThis class can be a complete waste of time if you want it to be.  Maybe there is some truth to the fact that there is something of value to be learned from Thurman's brilliance, but it is obscured by the lack of structure in the class.  Unless you are really interested in THOROUGHLY doing ALL of the readings and willing to listen to his random lectures, I wouldn't recommend this class.  Easy grading, though.\nWorkload:\nA lot of reading (easily can be not done), a midterm ( really easily graded if you get an TA), final paper.  1 hr a week discussion groups, and class attendance is factored in. \n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "August 16, 2006",
            "review_content": "\nIf a professor polarizes students into two camps, they he is leaving a significant portion of the student body disaffected and alienated -not exactly the hallmark of a good instructor. Similarly, a \"tangential\" approach to \"esoteric\" material is hardly encouraging. Poorly construed thoughts aside, Thurman is, I think, a pathetic windbag who uses his academic position to expound on a number of themes pertaining to politics and mass culture, using eastern religion as a vehicle. He did not seem to me truly interested in explaining Buddhist philosophy in any comprehensible way. The class is large, the lectures bad, and the TAs mildly useful. Oh, and Big Bob will likely be absent a lot because of other commitments. Don't believe for a second that your tuition obligates him to be present for your education. \nIf you want a quick three credits, take this course. You won't learn a great deal, but it will be only mildly irritating. I pulled an 'A' and didn't break a sweat. \n\nWorkload:\nListening to a lot of verbal diarhea, outside readings you can skip, mid-term, final, and a short essay that will be read by the great American buddhist himself. \n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "December 17, 2005",
            "review_content": "\nIf an instructor can polarize students into 2 diametrically opposed camps, he must be doing something right. I personally feel that the class was awesome. This being said, I can fully understand the frustration of others with whom I talk about this class. Thurman does not think a linear fashion. The thought process of the class itself is tangential to say the least. If you can get past that, the result is rewarding as you glean very real insight into a culture that you may not know so much about. \nThurman is truly a character. Regardless of your politics (and he is very left of center) the discussions are humorous when they pertian to the modern state of affairs. He has attained expertise in the field and it shows in every lecture. He literally \"wrote the book\" so to speak. \nThe subject matter is exceedingly esoteric. Western thought does not encompass all that is taught in the class. Quite a bit of mental gymnastics are required to understand the concepts particularly in the latter half of the semester.\nThe second half of the semester is largely for naught. \nThere is no final per se but only a final paper. \nIf you do all the reading (no easy task) and are attentive in lecture, the midterm is no problem. Time management is crucial during it but the end result is generally positive if one focuses on what was learned.\nThe final paper, much like all other aspects of the class, is poorly defined. This is part of its charm though and you are able to write on anything you desire so as it pertains to Buddhism and Buddhist culture. \nAnybody interested in the study of religion would enjoy this class. So too would those interested in Eastern philosophy. If you are taking this class for reasons of conversion rethink it. The class is sterile and academic and is not intended to be an impetus for conversion. The class is 100+ students, even at the end of the semester, effectively precluding the ability to meet people. Good class all around.\nWorkload:\nVery heavy reading (200-400 pp. a week... I managed to do it all... not true of all); attend class, you might not think so but it helps during the midterm; final paper of considerable length... all are manageable\n"
        },
        {
            "course_name": "Topics in Tibetan Philosophy",
            "review_date": "April 29, 2005",
            "review_content": "\nWarning:  to all students who sign up for a Thurman class thinking, \"despite all the bad reviews of this guy, he's friends with the Dalai Lama so there must be something good about him,\" you will be disappointed.  I practically gauranteed it.  In fact, this class made me lose respect for H.H. because I couldn't understand why he'd be buddy buddy with such an arrogant, infuriating man.  I'm trying to get that respect back so I don't end up in a hell-realm, but its difficult because Thurman is such a poor teacher.  In fact, fantasizing about writing this review is pretty much the only thing thats kept me motivated  during class.\nRobert Thurman is obviously extremely brilliant.  You can tell this from his excellent translations of seminal Buddhist texts as well as his own extremely influential commentary, both of which constitute a majority of the reading for the class (not necessarily bad).  But Thurman is horrible at giving any coherent version of his knowledge to students.  There is absolutely no structure or organization to his long diatribes that dominate the class.  A couple things about this Thurmanism (that should be the title of any Thurman class).  First, this was supposed to be a seminar, which is laughable.  Thurman is pretty much incapable of not hearing himself talk for more than about five minutes.  He'd open class with a long rant, often having nothing to do with Buddhist philosphy (nominally the subject of the course;  the second half of the course was supposed to be on Tantra; we probably mentioned it two to three times per class). Then he'd run out of steam after about half an hour, then ask why other students weren't talking or say, faux-sheepishly, I shouldn't be talking so much (you'd think he'd learn his lesson after like twenty years). Then he'd take a question and start to answer it, but get off-track after about two more minutes and rant again.  If a student ventured to disagree with him, or asked how another tradition might consider the topic, he would invariably tell them that they were wrong (Thurman once refused to continue a class until a student admitted he was wrong) or dismiss entire traditions offhandedly and extremely simplistically (Zen = not thinking).  Here's another example of how Thurman would dominate class.  Tom Yarnall co-taught the class (he's awesome, by the way, see below), although Thurman probably spoke about 90% of the time, except when Thurman missed class (about a quarter of the classes).  One of Yarnall's books, the most coherent thing we read all semester, was on the syllabus for two weeks.  Both classes started out being taught by Yarnall, as they should have been.  He proceeded to give a great lecture for about half an hour, logically explaining arguments and directly answering students' questions (If Tom Yarnall is the only one teaching this course, I would highly recommend it).    Then slowly Thurman started butting in,  speaking for five minutes, then ten minutes, then finally taking over the last half of those two classes with his singular brand of runaway talking (its not really lecturing).\nThe second, even more annoying aspect of Thurman's teaching style are the astonishingly, I mean jaw-droppingly, inane and oversimplified political anti-Bush diatribes that seep into every discussion and which would get him flunked in any political science course here. Here are some gems, as I took them:  the ending of the chinese occupation of Tibet is imminent, five years tops, its just illogical for them to stay;  Bush and Cheney = nihilists.  I mean it was hard not to laugh when he was saying some of this stuff.  This guy hates Bush with an incredible passion, which is fine, I'm not too fond of him myself, but the way he brings this hatred into the classroom and infuses into it a subject that it has nothing to do with is just inexcusable, irresponsible, academically unethcial, and sad to me.  If people are truly concerned with classrooms being politicized or whatever this \"academic freedom\" debate is about, start right here.\nIf you want to hear a very smart, pretty interesting old man spout hurriedly discuss complex Buddhist philosophy that he knows well but is absolutely incapable of delivering coherently to students, by all means take the class.  But the idea that as a previous reviewer put it, and I think other positive reviewers have implied, that the disorganization of the class and Thurman's semi-lucid raving is somehow \"Buddhist,\" \"counter-culture,\" or \"really make you think about the world,\" are laughable, wrong, and intellectually lazy.  Thurman's biggest point about Buddhism is that its very rational, and that its a Western fallacy to think that Buddhism is somehow irrational and that the West is more logical.  In fact, Thurman sees himself, erroneously, as not priveledging east or west, although its remarkable that, on pretty much every topic imaginable, Tibetan Buddhism has it right and Western \"scientists\" (thurman hates scientists) have it wrong.   The idea that these rants are counter-cultural or thought-provoking is insulting to someone like Eric Foner who painstakingly, logically and meticulously presents evidence that really does go against the grain of modern life, not because its evil or just because he hates it (these are Thurman's reasons), but because its untrue.  Also, if you came to Columbia to hear Thurman's \"wisdom\" I feel sorry for you.  That's not the point of Columbia. Columbia is an academic institution, whose purpose is the engagement of scholarship.  It may not be cool, or whatever, but I have plenty of time to be cool outside of what I'm paying 40K a year for.\nTo all those who will say I don't \"get\" Thurman, I didn't waste my time writing this, a diatribe in itself that Thurman has quite un-Buddhistly inspired in me, for you.  However, you're exactly right:  no one who really values academics will \"get\" Thurman.  I wrote this for all those who value their education, and to you I say, \"run away,\" despite Thurman's intelligence, which is very high, and on account of his academic teaching aptitude, which is very very low.  Otherwise, you'll be subjected to his wretched, look at me I\"m so humble and quaint I can laugh like Yoda routine, and you'll be furious that you wasted your money and your time and your anger when you could have been outside or really learning.\nWorkload:\nweekly postings on courseworks that are never really used, or just mentioned briefly before Thurman goes off again.  1 final paper (8-12), no exams.  Probably less reading than an average seminar.\n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "January 18, 2005",
            "review_content": "\nthis class is a waste of time. i know that a lot of people found thurman to be a wonderful and engaging human being, but his is a worthless lecturer, at least at the intro level. i know nothing more about buddhism than i did when i enrolled in the class, and it is entirely unnecessary to do the readings or even to attend class, unless you like to hear him ramble. He is certainly an interesting man and has lots of well informed, educated views on a wide variety of subjects, but only once in a blue moon did they have anything to do with buddhism, and apparently there were no blue moons last semester. \nGood class to take if you need a filler with no work and don't plan to attend, or I guess you could just throw a lump of tuition money away directly and save yourself the hassle. \n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "January 17, 2005",
            "review_content": "\nDisregard all the negative reviews of Professor Thurman.  He is a gem and I am really grateful to have been able to study under him.  His teaching style is Buddhist in itself: each of  us is reponsible for our own education and intellectual and spiritual growth, and exams don't do you any good. Each student benefits from just being around someone as extraordinary as Prof. Thurman.  His open-minded and often radical opinions of our contemporary society and of western history really make you re-think many aspects of your life.   He is spontaneous, funny and funny. Take this class, you'll love him.  \nWorkload:\nVery easy midterm, final paper graded very leniently (if at all).  You do as much reading as you desire.\n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "January 09, 2005",
            "review_content": "\nThurman is a hilarious guy. No doubts. Anyone who loves I heart Huckabees has got to at least drop in on a class with him. If you'd like to take a class where you sit in on a ramble-session on buddhism with a funny professor who has no end of buddha-lessons and bush-wacking, go for it. If you are interested in getting any historical, cultural or ideological perspective on the indo-tibetan tradition, skip it, because you won't get what you're searching for. I took Introduction to Asian Religions first semester of my freshman year, and I gained little to nothing tangible to add to my knowledge of Buddhism from Thurman's class. I wanted to get some kind of a history of the religion, or at least an interesting exploration of its syncretism with other traditions, but all I got was some funny quotes in my notebook.\nWorkload:\nIn-class midterm exam (short answers), one final paper (7-9 pages), and weekly postings in response to the readings (this last is total bs but extremely annoying).\n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "January 04, 2005",
            "review_content": "\nProfessor Thurman is amazing!  He is brilliant, and there is no other way to describe him.  The class was extremely interesting and eye-opening.  True, he gets easily distracted by his own point of view, but that's the best part of the class!  He's wickedly funny, especially if you enjoy liberal rants.  But because he's so brilliant, his opinion actually makes sense.  Plus he's a genius in the field and can explain things with knowledge that no one else has.  Who else can tell you what the Dalai Lama says in private?!  As long as you do some of the readings, you can follow what he's teaching in class, although you don't actually learn much information from him.  Although i highly recommend reading Inner Revolution, which he wrote.  That book is genius.  Professor Yarnell was more helpful with the nitty-gritty and when you had questions about details.  But the lectures are the best part of the class, despite their frequent lack of content, because they are just so entertaining! \nWorkload:\nWeekly postings on courseworks.  Don't have to read that much to post or understand the lecture.  Midterm.  Final paper, 6-9 pages, on any topic.\n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "December 31, 2004",
            "review_content": "\nok, so the man is very very cool.   go to lecture.. that's what youre in school for.  \nWorkload:\nbooks are expensive... Thurman's inner Revolution is interesting and relatable.. read the preface\n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "December 20, 2004",
            "review_content": "\nWell, it's true: he is unorganized, the books are expensive, and it is confusing. But I still loved it. I liked the subject, I liked his lectures and I had fun. Everyone was a little worried about the lack of organization. But when you finally relax, the class can be really interesting.   \nWorkload:\nMidterm, final paper, weekly postings.\nNobody should stress out too much about the postings. The Midterm is a little nerve-racking because you have to understand alot of philosophical concepts. Be prepared to have a really interesting final paper because he'll be reading a lot of them. (It could be about anything you've learned)\n"
        },
        {
            "course_name": "V2607 Indo-Tibetan Buddhism",
            "review_date": "November 16, 2004",
            "review_content": "\nAs previous critics have said, Professor Thurman's class is certainly overrated.  Thurman is an extremely intriguing man who clearly has had an adventurous life, but he doesn't quite fit into the classroom lecture scene.  Most of the class is spent reading aloud many of the elaborately detailed Buddhist texts - it's quite hard to pay attention.  Most of the students appear to be taking the class because Professor Thurman is infact a famous guy (not to mention Uma's father).  People are definitely entertained and Thurman is very entertaining (esp his rants on pop culture and MOVIES...).  The TAs are pretty arrogant - at least when it comes to the mandatory regurgitation in the midterm exam.  Yes you do learn a thing or two about Buddhism but the lack of structure and lucrative discussion leaves you lost in a sea of philosophical confusion.\nWorkload:\nOne midterm, weekly postings on readings (not sure how they grade these), one final paper.\n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "November 08, 2004",
            "review_content": "\n  While I am a huge fan of Professor Thurman, and find his lectures entertaining, and occasionally inspiring, if I could do it over again I would not have taken the class.  I know a lot of people love the class, I just want to give an opposing view.  If you're the type of person that finds yourself asking \"okay.  so what?\" in classes, who wants to learn useful material, this probably isn't the class for you.  I was hoping for more of Buddhist theory that might be applied to everyday life and how Buddhism functions today rather than a painstaking account of every detail of Buddhist history which I found extremely boring.  Silly me.  If you're charmed by Professor Thurman's irreverance and humor, don't be fooled.  The required reading list is also absurd.  I must have spent over $350 for this one class.\nWorkload:\nWeekly postings on the 100-350 pages of sort-of required readings, one mid-term, one final paper 9-12 pages.\n"
        },
        {
            "course_name": "Buddhist Ethics",
            "review_date": "May 01, 2004",
            "review_content": "\nI disagree completely with all the negative reviews posted on here about Thurman.  Thurman is indeed an incredibly smart thinker and highly intelligent--the only thing the prior reviewers have gotten right about him, in my opinion.  Thurman definitely is not your typical stuffy Ivy League lecturer filled with mundane academia crap.  If you're expecting to be given a boring textbook lecture, then of course you're going to be disappointed.  I, for one, absolutely LOVED going to his classes; it was the highlight of my week.  Thurman challenged one to think outside the box, reject unquestionably accepting the mores of established society, and really lay off the pretentiousness and act realistic.  Don't expect to get anything out of his class if you're planning on approaching it with the same systematic mentality you approach the majority of other CU classes. Thurman's class is truly the only challenging course I've taken here at Columbia (I'm a 3rd year). ...  Buddhism is learning what the nature of reality really is and consider yourself fortunate if you have him for a professor.  He's one of the very few Westerners appropriately trained in Tibetan Buddhism--was taught by the same teachers who taught the Dalai Lama.   \nWorkload:\nWeekly CourseWorks postings.  No midterm.  Final 8-10 page paper on topic of your choice.  \n"
        },
        {
            "course_name": "Nonduality in Indian and Tibetan Thought",
            "review_date": "January 22, 2003",
            "review_content": "\nI can only speak from the experience of my own section (I've heard from people who took the class in previous semesters that it was much better), but this is among the worst classes I've taken, ever. This course is full of shortcomings that could be easily corrected if the profs just took the time to do so. The material covered oscillates wildly between the phenomenally dense and the absurdly simplistic, with virtually no middle ground. The syllabus and outline of the course are so vague and the readings are presented so totally out of context that it took me the better part of the semester to get even the most rudimentary sense of what exactly we were studying (for future reference, it is the history of Madhyamaka as seen through the eyes of the Tibetan philosopher Tsong Khapa, with Vedanta thrown in every other week just to make things extra confusing). This seems to be a general characteristic of nonduality scholarship; at first I though the class readings were impenetrable because the subject matter was so difficult, but in time it became clear that, while this is true, it doesn't help that virtually no one among the assigned authors can write their way out of a paper bag. Tubb is extremely nice and knows his Vedanta, but somehow his lectures manage to be simultaneously very well-organized and totally impossible to follow. Thurman is fascinating when he gets going in \"Buddhist Sunday school\" mode, but this is largely predicated on his ability to show up on a semi-regular basis, which is hardly a given. My section suffered immensely from a couple of graduate students who liked to hear themselves talk, to no discernable benefit for anyone else. If anyone in your section has studied extensively in Tibet but hasn't managed to pick up any monklike humility in the process, I suggest that you abandon the class immediately. Finally, although prior knowledge of Tibetan and Sanskrit is not a prerequisite, you're basically wasting your time here if you don't know at least one of them. Tubb (who also teaches Sanskrit) loves to go into the philosophical intricacies of Sanskrit grammar, and one of the underpinning theses of the course is that nonduality doesn't come across in translation to any meaningful degree.\nWorkload:\nInfernal weekly postings based on the readings, which will be unconstructively torn apart in short order by your more educated and less mature peers (who, thanks to Courseworks, can take a crack at anything and everything you submit). A 25 page research paper that I suspect no one actually reads.\n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "May 10, 2002",
            "review_content": "\nIf you want a solid introduction to Indian Religions, take Professor McDermott. Then, if you want more, you can take Thurman, who will elaborate on certain aspects of Buddhism. By taking McDermott first, Thurman's lack of context and structure will be mitigated, and you'll be able to appreciate what he does say when he actually decides to teach.\n"
        },
        {
            "course_name": "Introduction to Asian Religions",
            "review_date": "May 01, 2002",
            "review_content": "\nDr. Thurman is a very talented speaker and an intelligent man. He certainly has a wealth of knowledge about Buddhism. He also has a very big ego, and he doesnt seem to try very hard to restrain it. He does most of the talking in class. Even when he invites others to speak, he seems far more interested in what he has to say. He quickly jumps to conclusions and has a habit of projecting extreme opinions onto students that they never claimed to have. He can be defensive when students say something that could contradict one of his own ideas. His lectures are entertaining, but I feel we missed a lot of the details of what we are studying. I rarely took notes because he rarely wrote on the board, and much of what he says are opinions, anecdotes, and stories. I enjoyed the class; however, it would have been much better if there had been more concrete information given to the students. We had, in theory, a total of six three to four page papers and weekly postings to Courseworks \nWorkload:\nSignificant amount of reading. six three to four page papers. Weekly postings to Courseworks. \n"
        },
        {
            "course_name": "Buddhist Ethics",
            "review_date": "February 20, 2002",
            "review_content": "\nThurman gives tenure a bad name. If he did bother to show up he had the class laughing at other students (those ballsy enough to disagree with him). If he decided he would rather travel than teach, the class was led by TAs with similarly \"enlightened\" personalities to that of Professor Windbag. Do the smart thing, sit in on a class and decide whether leftist diatribes and shameless self promoting is worth the money your parents will throw down.\nWorkload:\nThose horrible postings and a final paper.\n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "February 13, 2002",
            "review_content": "\nThe previous reviewer nailed it - this class is overrated. Obviously Thurman knows his stuff and is very articulate, whenever he happens to get around to discussing the topic. Nearly half of the class time is spent answering students questions (yawn) and a great chunk is devoted to Thurman's political/social/spiritual/anti-capitalistic diatribes du jour. Sure he has cool friends and is very entertaining and *enlightening* (if you've had your head under a rock for the past decade) but learning about Buddhism??! you're on your own kid.\nWorkload:\nMidterm, final paper, weekly bulletin board submissions. Lots and lots of books to buy which you rarely discuss thoroughly or even at all. Buy used, borrow, steal, or share.\n"
        },
        {
            "course_name": "Buddhism: East Asian",
            "review_date": "January 30, 2002",
            "review_content": "\n3 words: Overrated, Overrated, Overrated. If you're taking this class because you think you'll catch a glimpse of his movie star daughter Uma you're out of luck. You will hear alot about his beautiful swedish wife and how good friends Thurman is with the Dalai Lama. He looks like the man from Titanic - you know the scary valet guy.\nWorkload:\nHis philosophy in a nutshell: Chinese are commie bastards who oppress the poor little Tibetans.\n"
        },
        {
            "course_name": "Buddhism: Indo-Tibetan",
            "review_date": "January 23, 2002",
            "review_content": "\nLet's cut all the hype right now. If you don't have a previous background in Buddhism, Thurman's lectures provide you with no context and are often filled with absolute anti-West drivel and an auto-erotic homage to his ego. Thurman, an incredibly smart thinker, wastes away much of class time on I don't know what, but at the end of the class, I had hardly learned anything. Don't need to do the reading after the midterm.\nWorkload:\nMidterm, final paper on topic of your choice (8-10 pp). Relatively light workload. Midterm is very easy.\n"
        },
        {
            "course_name": "V2607 Buddhism: Indo-Tibetan; V3000 Buddhist Ethics",
            "review_date": "December 31, 1999",
            "review_content": "\nAlthough he often parachutes into class without preparation, Thurman is a fascinating man and agile speaker, which makes for entertaining lectures. Besides, who would turn down a chance to learn about Buddhism from someone who's renowned for knowing so much about it? People magazine and the Dalai Lama can't both be wrong. Still, the hype surrounding him as a campus \"famous-guy\" tends to really build up some unrealistic expectations for his classes. People who register for his classes expecting to attain Nirvana in time for the midterm will probably be a little disappointed. Taken as a class, it's a good experience and a prime choice for the major cultures requirement. One thing: Many of the classes wind up in the default \"one-hundred person question and answer session\" format which can be frustrating compared to the real lectures.\nWorkload:\nMidterm exam; 1 essay.\n"
        }
    ]
}