{
    "prof_info": [
        {
            "prof_name": "Cristobal Silva",
            "prof_id": 10802,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Early Caribbean Literature",
            "review_date": "January 19, 2015",
            "review_content": "\nSilva is a man of strange and wonderful benevolence. I took this class to fulfill an English distribution requirement and while I can't say I enjoyed the material all that much, Silva himself was wonderful. He'll read your papers as many times as you want to write and revise them before the deadline, as long as you bring them to his office for him to read in person. You should definitely take advantage of this, because he will tell you exactly how to improve your writing and is quite charming to boot.\nHis exams are tricky. They're long and seem to defy studying in unexpected ways. But fret not, because his grading is mysteriously generous. I suspect that if he knows you and has some faith in your ability, then he will finagle the grades around to give you what he thinks you deserve, regardless of how the numbers fall. (This is another reason you should go to office hours.)\nAs the reviewer below said, his lectures are consistently clear, sensible, and purposeful (and this may not sound like a big deal, but it's honestly a huge relief compared to some of the nonsense that goes on in this department). All in all, highly recommended.  \nWorkload:\nTwo brief papers (focusing on close readings) and a 6–8-page term paper. A midterm and a final, both rather difficult. \nThere's a lot of reading. It's not the end of the world if you don't get through all of it, though, since the emphasis on close reading means that it's easier to study a few things very carefully than a lot of things more generally. (Obviously, the exams will be a lot easier if you've read more things, though.)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 25, 2013",
            "review_content": "\nCristobal Silva is possibly one of the greatest people, let alone professors, on the face of the planet. I had him for LitHum last year, and I'm taking an elective with him this year, along with several other former students. The man has a veritable fan following. Here's why:\nFirstly, his interpretations of the texts are both concrete and insightful (partly due to his obsession with close reading); you never walk away feeling like you just spent two hours postulating about abstract nonsense that isn't really there, and he always contributes a meaningful, sensible reading.\nSecondly, he's very very very fair. He understands that LitHum is a core class, and that the reading load is on the verge of unmanageable. He gives you \"real grades\" on papers, and doesn't pull punches with his critiques, but his exams are very doable. He's not one of those professor's who thinks they can single-handedly combat grade inflation, but he still expects his students to work hard. He cut a few texts over the course of the year and somehow squeezed in five days for Moby Dick (trust him on this one; it really should be in the core). Go to office hours with drafts of papers and questions about the reading--he's very helpful. Ultimately, he wants you to leave the class with a strong appreciation for the texts, and the ability to write a solid close reading.\nThirdly, and probably most importantly, he's hysterically funny. His sense of humor is obtuse, geeky, politically incorrect, and extremely endearing. Ask him about his family/real life during office hours (or during class, actually). He's been all over, and has great stories. \nWorkload:\nTwo papers, midterm, final, participation. Not easy, but very doable.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 16, 2013",
            "review_content": "\nI had this class at 9 AM, and it was remarkably uninspiring. At any given moment, half the class was asleep and a quarter of the class was on their laptop or phone surfing the internet. Although Silva does encourage student participation, this was limited to a handful of people who occasionally threw in comments; the rest of class time consisted of Silva droning on in an unchanging, quiet lullaby. Half the time he presented a question to the class, no one responded. Then there would be 10 seconds of awkward silence before he moved on. Even the people who participated regularly/ the people that sat right next to him were often nodding off. I can imagine that he could do much better with a less catatonic class, but keep in mind that this is a likely possibility.\nWith that in mind, he has a..quirky sense of humor. Coupled with his high pitched giggle and rather cynical personality, he makes for an interesting specimen. He laughs often, most of the time only to himself. He's a huge advocate for close reading. Huge as in, his entire class basically runs on it. His two papers involve close reading, and since it's also a part of both the midterm and the final, I would suggest you learn to close read exactly the way he expects you to, or risk having an unappealing grade at the end of the year. He grades writing fairly, somewhat on the tough side though. He's surprisingly warm and willing to help during office hours, and he encourages students to go. I would take advantage of that.\nDefinitely not an easy A class, but I think he gives you the grade you deserve. I don't want to discourage or encourage anyone, but I have had him one term and I'm not staying.\nWorkload:\nTypical Lit Hum reading workload, which you /technically/ don't even have to do if you don't participate too much. He certainly doesn't check. Two papers, a midterm, and a final. Very manageable, but again, if you want the good grade, you'll want to put in a lot of extra time.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 27, 2012",
            "review_content": "\nSilva is an excellent LitHum professor and you are lucky if you have him. He has high standards in grading written work but it is by no means impossibly to get an A in class as he is willing to consider a student holistically for the final grade and appears to want them to do well. He does not overload the class with unnecessary information but immediately tackles the big issues of the texts with gusto. You will either be very tickled or completely bewildered by his unorthodox sense of humor.\nWorkload:\nHe has realistic expectations when it comes to how much work to give, acknowledging the very heavy reading already demanded of Columbia students from this class. He requires two papers (the first is usually a short close reading), one midterm and one final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 27, 2011",
            "review_content": "\nI decided to write this review while procrastinating writing my 8-10 pg lithum paper due in 12 hours because silva is that great. he's new a columbia this year, so i had no idea what i was getting into first semester, but i am so glad i wound up in his class. lithum has been my favorite class over this entire year, and i can't help but attribute that--at least in part--to professor silva. the texts are amazing, the discussions are amazing, and he really pushes everyone to close read, close read, close read. i highly recommend this class. \nWorkload:\n- 4-5 pg paper (close reading, pick any 10-20 line passage)\n- midterm (pretty easy)\n- 8- 10 pg paper (2 texts, anything you want to write)\n- final (course wide)\n"
        }
    ]
}