{
    "prof_info": [
        {
            "prof_name": "Peter Juviler",
            "prof_id": 283,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium: Human Rights in a Diverse World",
            "review_date": "April 17, 2007",
            "review_content": "\nJuviler's colloqium is a great way to fulfil the political science colloqium requirement.  The workload, while still tough at times--after all, it's a political science class--is far more reasonable than that of the average Barnard poli sci class.  The readings are generally engaging and relevant, if somewhat unacademic.  Juviler himself had a tendency to ramble, so that it was impossible for even everyone in our small class to comment every week, but he is also the course's most redeeming feature: a kind, understanding man who truly believes in learning as a process of the exchange of ideas, not just a finished product.\nWorkload:\nTwo-page response paper each week--beware, he does actually grade them and you're not assured full credit just because you slapped something out, unlike in some other colloqia instructors. 20-25 page paper at the end.  Reasonable amount of reading--you have to do some, but not all.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "April 29, 2002",
            "review_content": "\nI am in Prof. Juviler's Colloquia now, and though it is interesting, I wish there was more of a structure. But, if you know Juviler, you'll realize that he can get long-winded and that a strict schedule takes second place to open discussion. I'm not complaining at all-- i had such an easier time with this colloquia than my friends taking Pious' (who scares the crap out of me)-- but now that it's the last week of classes and only now am i doing my paper, i wish i had more guidance. to juviler's credit- he is the most caring professor you will ever meet. he truly cares about his students, even if he mispronounces your name on a daily basis. he is very accessible, and is incredibly intelligent. as long as you have patience with him-- he isn't quite the spring chicken anymore-- you can be rewarded for your experience in his class.\nWorkload:\nfor colloquia: weekly reading responses, 20 page final paper\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "January 22, 2002",
            "review_content": "\nThis class REALLY dissappointed me. It was all very theoretical and never really got into the application of human rights. Juviler's lectures are hard to follow (even with his lecture notes in front of you) and don't seem to go anywhere. He could have done a lot with the class, but it just ended up lacking. TA Danny Celermeyer (or something like that) lectured once and seemed far more qualified to be teaching the class. Lecture once a week, mandatory discussion section once a week (different readings).\nWorkload:\nthree papers. no exams.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "January 17, 2002",
            "review_content": "\nProfessor Juviler is one of the most knowledgeable professors I've had. His lectures are very interesting and informative, however only remotely related to the required readings. Discussion sections with the TA's. Exams: two midterm papers, and a take-home final. The exam topics are pretty incomprehensible at first sight, but actually not too difficult to manage provided you have read each and every piece of the reading material. A piece of advice: don't take this course before you have taken the basic intro courses in poli sci. Simply don't be mislead by the \"intro\" title of the course; it is anything but at an introductory level.\nWorkload:\nLong, sometimes dry texts. An average of 200 pages a week, number declining as the semester progresses. Again, understanding of these readings requires some prior knowledge of poli sci, international developments and economics. Exams are 6-8 page long, graded quite fairly by the TA's.\n"
        },
        {
            "course_name": "The Political Community",
            "review_date": "December 31, 1999",
            "review_content": "\nThis course covered Democratic Consolidation, Human Rights, Minority Rights, and UN issues. This class allowed me to expand my point of view and recognize that the scope of focus was not as open as it could be. Juviler is one of the MOST approachable professors I have encountered. His enthusiasm for students, activism and teaching is apparent whenever he speaks and acts. The course was based on discussion, with only 8 people in the class. would recommend this class to sophomores and above with introductory knowledge of international relations and/or comparative politics.\nWorkload:\nPretty average for a poli sci class -- about 150-200/week. Four papers -- 2-4 pages each. The papers are very straightforward graded fairly, leaning toward easy. Just a Final exam.\n"
        }
    ]
}