{
    "prof_info": [
        {
            "prof_name": "Lorena Rodas",
            "prof_id": 2188,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 25, 2009",
            "review_content": "\nI agree with everyone that she is personally a very nice person and it is hard for me to write a bad review because of how nice she is.  However, I have to agree with the previous reviewer that this is NOT the professor to take Elementary Spanish I with if you don't have a background in Spanish prior to the course.  She is an exceptionally tough grader and no English is allowed in the classroom from day one.  For a beginning student this is a bad combination because you end up not asking questions because you don't know how to form the question in Spanish yet.  If you are willing to teach yourself Spanish on your own and want to use the classroom as a place to practice conversation then Lorena is perfect for you.  If you are expecting a class that starts at the basics and works its way up then she is not the professor for you.\nOne other thing to mention is that it feels like there is some slight animosity with the Barnard department having to accept Columbia students because it takes spots away from Barnard students.  It is just something to be aware of if you are a Columbia student.\n\nWorkload:\nSame as all Elementary Spanish I classes except that compositions are 150 words instead of the usual 200\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 16, 2009",
            "review_content": "\nI can understand why so many people love Professor Rodas. She is sweet, understanding, patient and enjoyable to talk to. Personally, however, I did not particularly enjoy the course. Professor Rodas speaks Spanish in class from day one, and while I understand why this immersion might be great for some people, as someone with no background in Spanish, I felt behind from the first week. I feel like professor Rodas' class would be great for people who come into Elementary I with a bit of experience, but if you are someone who struggles with languages (like me), then I would enter with caution. I had a hard time with some of the grammar concepts, since I am the type of person who has a hard time teaching myself foreign grammar out of a textbook. She is also a very picky grader, and even after going to her office hours, I had a hard time doing well on my compositions. I thought maybe since she graded so harshly, she would curve our finals grades up, but I don't think that's the case. There is no doubt that Professor Rodas is a sweet person, but I guess I just didn't mesh with her teaching style. \nWorkload:\nMidterm, Final, 4 150 word compositions and homework out of the book most nights.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 23, 2008",
            "review_content": "\nI absolutely adore Professor Rodas, she made Spanish by far my favorite class of the semester. She is energetic and fun. Class attendance and participation is very important. Although you can get away with not doing all of the exercises she assigns from the textbook, if you're having trouble it's definitely better for you to do them. The essays are only 150 words each on a topic that pertains the to chapter and you do a rewrite for all of them and the two grades are averaged. She is definitely a fair grader and she is very approachable. She is also very laid back but don't take this as a sign that you can try to take advantage of her and get away with it - she's very perceptive. Overall, definitely take any Spanish class with Senorita Rodas if you can. She is flexible, approachable, and genuinely wants all of her students to do well. I could not imagine a better Spanish teacher. \nWorkload:\n1 Final - 25%\nClass Participation and Attendance - 25%\n4 Essays (150 words each, you do a rewrite for each one and then average the grades) - 25%\n1 Midterm - 15%\n1 Final Oral Exam - 10%\noverall definitely fair\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 18, 2008",
            "review_content": "\nAt the final, I did the exam, turned it in to Profesora Rodas, and then cried like a baby while I was saying goodbye. She was unbelievable. SO helpful, SO patient, SO kind. You're left wondering how so much fierce passion for the language and her students could emanate from such a little body. (She's adorably short)  My one AND ONLY qualm about her class was she had too much patience for attitude problems and people who really didn't want to learn. There's a nasty rumor that next semester (spring '09) will be her last at Columbia. If I were you, If this is true, Columbia (or Barnard, whatevs)  is losing what has to undoubtedly be the best Spanish teacher EVER. But let this be as warning: she will make you learn. So, please, if you want to just slide by this requirement, leave this class for the people who really want to learn Spanish. \nWorkload:\nFair. Short assignments out of the book every once and awhile. Three or four 150-word compositions. Reading a poem. But she's a fierce grader. Don't expect to slide by. \n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 18, 2008",
            "review_content": "\nAt the final, I did the exam, turned it in to Profesora Rodas, and then cried like a baby while I was saying goodbye. She was unbelievable. SO helpful, SO patient, SO kind. You're left wondering how so much fierce passion for the language and her students could emanate from such a little body. (She's adorably short)  My one AND ONLY qualm about her class was she had too much patience for attitude problems and people who really didn't want to learn. There's a nasty rumor that next semester (spring '09) will be her last at Columbia. If I were you, If this is true, Columbia (or Barnard, whatevs)  is losing what has to undoubtedly be the best Spanish teacher EVER. But let this be as warning: she will make you learn. So, please, if you want to just slide by this requirement, leave this class for the people who really want to learn Spanish. \nWorkload:\nFair. Short assignments out of the book every once and awhile. Three or four 150-word compositions. Reading a poem. But she's a fierce grader. Don't expect to slide by. \n"
        },
        {
            "course_name": "Elementary II",
            "review_date": "January 12, 2008",
            "review_content": "\nI have no choice but to write another glowing review about Professor Rodas- not only is she an excellent teacher that makes sure you actually leave with at the minimum an understanding of the basics of the Spanish language, but she is one of the most patient, kind and caring women I have ever met.  She teaches the class completely in Spanish from day one, and expects her students to reply as such.  However, I never felt intimidated or shy about raising my hand- she was always very supportive of all levels of ability.  She is a serious grader however- her tests tend to be lengthy with a lot of essay/short-answer- and you really have to work for an A.\nWorkload:\nA test/quiz every other week, graded scrupulously.  Also short workbook assignments listed in the syllabus that she often goes over in class (but not always), which I found worthwhile.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "September 09, 2007",
            "review_content": "\nProf. Rodas is great. She knows her stuff and makes you want to learn Spanish. Class is fun. She really likes it when people participate and you can ask her any question.\nShe does expect a lot from you. For 2 of the papers you submit rough drafts so you have a chance to make your final draft better but she is a tough grader. Her tests are also hard. Be sure to know the literature that you are reading because she tests the grammar through the stories you read. Overall, she is a joy to be around.\nWorkload:\n3, 1 1/2 papers, 3 tests\n"
        },
        {
            "course_name": "Advanced Oral/Written Spanish",
            "review_date": "May 21, 2007",
            "review_content": "\nBEST PROF EVER. Do not leave Columbia/Barnard without taking a class with this woman. She's by far the best instructor I've ever had at this institution.\nWorkload:\nmanageable\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 10, 2007",
            "review_content": "\nProfessor Rodas is great. She is the perfect Spanish professor. I am by no estimation good in Spanish, but her warm words coupled with her enthusiasm made me feel more confident and more willing to participate in this class. I would wholeheartedly recommend this class to people looking to painlessly fulfill the language requirement. Hey-- you never know, you might even have some fun. \nWorkload:\nReasonable. 2 exams, 1 final, 3 essays (2/3 you rewrite for a higher grade), 1 oral presentation and a straightforward final. \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 10, 2007",
            "review_content": "\nProfessor Rodas is great. She is the perfect Spanish professor. I am by no estimation good in Spanish, but her warm words coupled with her enthusiasm made me feel more confident and more willing to participate in this class. I would wholeheartedly recommend this class to people looking to painlessly fulfill the language requirement. Hey-- you never know, you might even have some fun. \nWorkload:\nReasonable. 2 exams, 1 final, 3 essays (2/3 you rewrite for a higher grade), 1 oral presentation and a straightforward final. \n"
        },
        {
            "course_name": "Intermediate Spanish 2 (Barnard)",
            "review_date": "May 10, 2006",
            "review_content": "\nLorena Rodas is an unusually fine teacher. She brings a lively, upbeat attitude and  great sense of humor to every class session and her enthusiasm is infectious. She is very adept at communicating the subtleties of Spanish and helping the student to comprehend them. While she is a demanding teacher she is  absolutely fair. She was always available for office hours and responds to emails quickly. I learned a great deal over the two semesters that I studied with her (I also took Intermediate 1 with her). Perhaps most telling is this: of my fellow students that took Intermediate 1 with her, at least 6 of them followed her into this class. Her sign up sheet was filled almost instantly on registration day. \nA word to the wise: Spanish classes at Columbia are faster paced and somewhat more demanding, based on my experience, than those at Barnard, so know thyself.\nWorkload:\n2 tests during the semester plus a 3 hour final exam; 4 two and a half page essays (these were time-consuming because you had to rewrite them after she had corrected them-mine were invariably covered in red ink). The goal, a fine one in my view, is to train you to write accurately and eloquently in proper Spanish. Toward the end of the semester there is a group presentation which is done in front of the class. \nOddly, this course is only a 3-credit course. I say \"oddly\" because Intermediate 1, which had a similar workload, was a 4-credit class.\n"
        },
        {
            "course_name": "intermediate spanish",
            "review_date": "February 08, 2006",
            "review_content": "\nWhat a wonderful woman.  What a painless way to fulfill a language requirement!  Lorena has so much heart, and loves each one of her students.  She is incredibly accessible outside of class.  Not that hard of a grader, and definitely wants to see each student reach their true potential. \n"
        },
        {
            "course_name": "Int I",
            "review_date": "November 01, 2005",
            "review_content": "\nI loved Int I with Prof Rodas! She's adorable and has a real passion for teaching. She makes sure to call on everyone and makes participating in class fun, not embarrassing. I would suggest her class to anyone. But beware that she is a picky grader although she does everything she can to help you raise your grade. In the end your final grade is a generous one also.\nWorkload:\nNot too much work. Homework unnecessary. 3-4 essays 3-4 tests a final and a presentation...you get to watch movies too!!!\n"
        },
        {
            "course_name": "Intermediate I & II",
            "review_date": "May 18, 2005",
            "review_content": "\nTo start, I will admit that Professor Rodas is a very nice woman.  The workload is also fair (it's based on a departmental syllabus so you have no choice whoever you take it with).  However, Professor Rodas is an extremely harsh grader and her tests are long, painful, an impossible (they usually run over the class time period, which is not fun when you have a class 10 mins later).  I also think she is a lot better for Intermediate I because she has time to balance the grammar and culture.  In Intermediate II, she spend whole periods discussing culture (about which she is very enthusiastic) and leaving us to fend for ourselves with the more complicated grammar which we were still graded harshly on.  I would say take it IF you are already strong on grammar and in conversation and think you can keep up by yourself.  Grades are extremely low but the final grade is generous\nWorkload:\nIntermediate II: 4 essays; 2 tests; final; various group presentations (she likes those)\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 03, 2005",
            "review_content": "\nThis woman is my favorite person at Barnard. She absolutely loves what she does, and it shows. I think the other reviews pretty fairly sum her up, but I had a conversation with her once after class (as she waited for me to complete part of a test that I had accidentally left blank the week before), and she moved me to tears! I am not kidding...She talked about how she just wants to share this language and culture that she loves with the students, and make it fun and fair for them, to encourage a love of learning and a mastery of the language. I definitely learned more Spanish, as she took any opportunity available to teach us something new. I recommend her to anyone. She will call on everyone in class, but I hate speaking, and I was an active participator for once. The end-of-\nsemester evaluation will be fun, I swear! It ends up being like a love letter...haha.\nWorkload:\nfair. i actually enjoyed the essays. she prepares us well, and she is always willing to help.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 02, 2005",
            "review_content": "\nProf. Rodas is the best and cutest teacher EVER!  I agree with all of the reviews here. She is a hard grader on essays and tests, but when it comes to the final grade, she is generous.  I've never had a teacher that was so devoted to a class in my life.  She always came to class smiling with enthusiasm.  I was actually excited to go to this class, and I'm not the greatest at Spanish.  Bottom line, take her if you can. Don't be discouraged by her picky grading, its all worth it.  I'm taking her again for Intermediate II!\nWorkload:\nDaily homework: not checked because she doesn't like drills. However, its helpful to read the stories because you talk about them in class. 3 exams - sometimes confusing and long, but again they don't make or break your grade. Long final exam.  And a final group skit.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 30, 2004",
            "review_content": "\nRodas is the sweetest teacher, and clearly enjoys her job. She encourages her students to participate, but does not force them to do so. She creates an environment that is easy to learn in, and the class discussions definately help improve grammar and vocabulary. Her tests are somewhat unclear at times, and her grading in not that straightforward, but on the upside, she grades fairly easily when it comes to overall grade.  \nWorkload:\nNot bad...some workbook assignments, 4 small 1 1/2 page essays, and 3 fairly short tests with a long, but fair final \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Rodas is an extremely flamboyant and exuberant person who definitely takes Spanish seriously. She makes class very fun, and if you are not exactly excited about speaking in Spanish, she makes it relatively painless with her enthusiasm and support. Her grading is a little hard, however, and she takes her tests and essays seriously as well. Overall, a very sweet woman who can definitely teach. She's very flexible with due dates, and very accomodating of her students.\nWorkload:\n3-4 tests, 3-4 essays (1 1/2 pages each). Grading is hard. Homework was never checked, and very unnecessary.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 29, 2004",
            "review_content": "\nLorena Rodas is the best spanish teacher i have ever had. She speaks clearly and is sooo nice.  There is barely ever homework but you really do learn spanish. She is wonderful...totally reccommend her!\nWorkload:\nBarely any homework, 3-4 papers (one and a half pages-you get to turn in a rough draft and then get to revise it), 2-3 tests (a little tough but fair), and a final (lots of writing but pretty easy)\n"
        },
        {
            "course_name": "intermediate spanish",
            "review_date": "November 08, 2004",
            "review_content": "\nShe is the cutest woman with the best outfits.  She is petit Guatemalan who is kind and funny.  If you participate in class you will do better.  She is a tough grader, but she wants you to understand concepts and is always available to help.\nWorkload:\n3 exams, 3 page and a half papers and workbook stuff, same as any other spanish course\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "November 02, 2004",
            "review_content": "\nI absolutely adore Prof. Rodas.  She is by far the nicest and best Spanish teacher I have ever had.  She is very encouraging, but also a fair grader: not too hard, not too easy.  She is also knowledgable about culture and art and is very bright overall.  Needless to say, I recommend Prof. Rodas to the fullest.  In fact, I'm planning to take her again for Int. II!\nWorkload:\nFair, about 4 essays and 4 tests plus a final.  She prepares well for all of the work.\n"
        }
    ]
}