{
    "prof_info": [
        {
            "prof_name": "Tanisha Fazal",
            "prof_id": 1519,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Law of War",
            "review_date": "April 30, 2012",
            "review_content": "\nA decent seminar.  Professor Fazal is one of the more personable Political Science professors here at Columbia.  She was pretty good at stimulating discussion in those sessions when we'd gotten around to doing the reading. \nAs a political science PhD seminar, this class is not a survey in what laws of war are on the books.  It looks at questions like \"how is the law of war created\" and \"does international law influence state behavior (or do they just ignore it)?\"  In so doing, it does what political science is so wont to do: Take a subject as exciting and dynamic as war and turn it into the most boring sh*t ever. \nActually, Prof Fazal's reading list was the most varied I've taken in a poli sci course.  Of course, she makes clear that the reason is because so little work on the Law of War has been published in political science journals.  We are forced, kicking and screaming, to instead learn from prose that has not passed muster with the esteemed peer reviewers of International Organization: The horror. \nBut yeah, there's a decent mix of books you might actually want to find yourself reading for fun, like Helen Kinsella's feminist critique in The Image Before the Weapon, and savagely painful political science articles that test null hypotheses about stuff you once thought you cared about.  \nAfter taking this course, I have a better understanding of how and when International Law influences state behavior.  I also know a lot more about the origins of what we now take for granted as the Law of War (and the Geneva Conventions).  \n\nWorkload:\nThe standard poli sci reading load: 5 or 6 required articles a week.  Occasional critiques of unpublished articles at the worst possible moment in your semester.  20-40 page research paper. Weekly discussion.\n"
        },
        {
            "course_name": "Current Issues of International Security",
            "review_date": "May 31, 2003",
            "review_content": "\nFazal was good at times but certainly not \"brilliant and amazing\" as said by the other reviewer. I found the class to be rather dry at times and the guest lecturers to be mixed. Fazal only lectures about half of the classes and there is not too much info here that one couldn't figure out for oneself. Not a bad polisci class but not the best. The simulation (mentioned by the other reviewer) was actually more fun than I thought it would be.\n"
        },
        {
            "course_name": "Current Issues of International Security",
            "review_date": "April 01, 2003",
            "review_content": "\nfazal is amazing and brilliant. great lectures--even better guest lectures, engaging material, fair workload, good readings. if you have any interest in international relations or security issues take this class. it is a commitment due to a security council simulation, but it is well worth it considering the amount you take away. highly recommended.\nWorkload:\nmedium to high--  150-300 pp./ week. 24 hour take home midterm, 2 quizzes, position paper (4 pp.), simulation, 10 page policy memo, and 1 page policy memo summary.\n"
        },
        {
            "course_name": "International Politics Seminar: Causes of  War ",
            "review_date": "March 04, 2003",
            "review_content": "\nI thought that Fazal did a fairly good job with this class.  The readings that she selected were fairly interesting and she did a pretty good job of leading discussion.  We often were able to talk about current events and she was always available to speak with after class.  She isn't the best professor that I have ever had but she is more than adequate and doesn't make the seminar process too painful.\nWorkload:\n1 paper, 25-30 pages (and one rough draft due along the way). 1 30min presentation to the class about your paper.  1 page critique of each classmate's paper due on the day that they present.  Pretty standard seminar stuff.\n"
        }
    ]
}