{
    "prof_info": [
        {
            "prof_name": "Alexandre Lunsqui",
            "prof_id": 1113,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Ear Training IV",
            "review_date": "November 09, 2004",
            "review_content": "\nThe best guy to take for ear training, especially if you consider yourself to have a pretty good ear already (hint: you don't). Alex is really smart, a good composer and an AMAZING jazz improviser, though he's super-modest about all of these things. He's also just really cool, like you'd wanna hang out with him in your spare time, which I'm not sure is something we'd say about Francoise (thought that's not fair- I've never had her except once as a substitute for Alex- what a weirdo!)\nAlex has a very broad approach to ear-training- all music, everything, is just sounds, vibrartions in the air. A semester with Alex and he will have you listening for the overtones in a humming air conditioner. So expect to listen to a lot of really modern ugly music but to learn to appreciate it. Alex will also totally turn around and whip out a Bach chorale or even some medieval/ Renaissance stuff. You also do practice with extremely complex irregular rythms and cool jazz harmonies! I feel like I've understated Alex's coolness. He's really REALLY cool. And Brazillian.\nWorkload:\nJust go to class! I never skipped this class, even on days where I skipped every other class.\n"
        },
        {
            "course_name": "Ear Training IV",
            "review_date": "May 14, 2002",
            "review_content": "\nAlex is so so so great! On top of the fact that he's a good teacher, he's just a really nice guy. He doesn't quiz people in front of the whole class the way the other ear training teachers do, but you still learn the stuff because he manages his time well. Very easy class; his section parallels Francoise's, so it doesn't really matter which one you take. But Alex's class compared to Francoise's is the difference between an A and an A-, and you don't really mind going to class.\nWorkload:\nAs long as you show up, you get an A. Otherwise, I'm pretty sure that you still get an A. By the time you get to ET 4 you have to know your stuff, so it's pretty impossible to get below a B no matter how badly you screw up.\n"
        }
    ]
}