{
    "prof_info": [
        {
            "prof_name": "David Dinkins",
            "prof_id": 1926,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Critical Issues in Urban Public Policy",
            "review_date": "January 15, 2007",
            "review_content": "\nAs an undergrad who is interested in public policy and possibly pursuing an MPA, this class was a must.  It's completely unlike undergraduate courses in that what's learned is practical rather than theoretical.  The speakers are phenomenal, you have the opportunity to make excellent connections with great organizations and individuals, and it's not a stressful class at all.  I literally looked forward to it all week long.  Dinkins is getting up there, so he re-tells stories like a grandpa, but it's pretty adorable and the guy is still generally really sharp. \nWorkload:\nThe course packet looks intimidating; just don't read it all.  It's completely unnecessary  The take home allows you to read up on the necessary materials while you write.  For the final, the TA (who is also great) told us all the topics to read up on and which readings were important so we were set.  It was one of my most reasonable workloads all semester.\n"
        },
        {
            "course_name": "Critical Issues in Urban Public Policy",
            "review_date": "October 29, 2005",
            "review_content": "\nThe previous review is a very accurate description of the course. I would, however, disagree on two points. First, the class does not generate networking--perhaps among graduate students, but I don't see undergrads having much of chance or reason to network (grad students will stick to their own). Secondly, Dinkins usually has a lot to say before he lets the speakers take the podium. He will talk for about 30-40 minutes, sometimes on completely unrelated topics via anecdotes or news summaries. However, these digressions are of value because you learn what is important to Dinkins and what he personally cares about. He gives great insight. Good class, feels long because it is 2 hours. But well worth taking, especially for the speakers.  \nWorkload:\nMidterm - 5 pg essay. Final - in class. Weekly readings - it seems that only a few students read.\n"
        },
        {
            "course_name": "Critical Issues in Urban Public Policy",
            "review_date": "January 08, 2004",
            "review_content": "\nAn appropriate subtitle for the course_name might be \"David Dinkins and Friends.\"  Each lecture, he invites 2-4 guest speakers to talk about a topic: education, health care, homelessness, budget, etc.  He starts the lecture off by reading, from typed notes, a paragraph or so about the topic, then proceeds to read the bios of the speakers.  Sometimes he has more to say, but not always.  The list of speakers is impressive.  Many are his former associates, and several are still in public service.  The lectures rarely go into great depth about any one topic; it's more a survey course about \"critical issues.\"  However, it's definitely fascinating listening to the perspectives of authorities-- for examples, about crime from Ray Kelly, or about education from Joel Klein.\nExpect lots of anecdotes, several pet stories of Dinkins retold over and over, and lecutures that won't put you to sleep.  Sometimes, unfortunately, those currently in public office will feed you the official organizational spin on an issue, but at other times they can be surprisingly candid.  Since many of these people are friends and former hires of David Dinkins, there is also quite a bit of effusive praise for the former mayor.  A Q&A; session at the end of each lecture, but don't be timid or you'll find yourself listening to long-winded, overzealous, stuck up grad students who think too much of themselves.\nI would wholeheartedly recommend this course, not because you necessarily learn a lot, but just because it's interesting to hear these perspectives.  It's also great if you're into networking.  Attending lectures are a must, but you won't want to skip them anyway.\nWorkload:\nWeekly readings, 100-300 pgs.  Most of the materials are on reserve at the Lehman Library, but many are scanned into e-reserves, so you can just print them out.  It seems like not many students in the class actually do these readings, at least not until exams come around.  Midterm and final of three short essays each, to be written using readings and notes from lecture.  Generously graded by the TA.\n"
        }
    ]
}