{
    "prof_info": [
        {
            "prof_name": "Lydia Liu",
            "prof_id": 3274,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Literary and Cultural Theory: East and West",
            "review_date": "December 16, 2012",
            "review_content": "\nThis is actually a review for China in the Modern World:\nIf you've read the review below, you have been given an accurate description of what its like to be in Professor Liu's class. Words of warning--she is tough! She is direct and extremely knowledgeable. If you think you can pull off the class with you \"BS-ing skills,\" think again! Though the readings are very lengthy (150-200pgs) or very abstract (I spent way too much time re-reading 5 stanza poems), she knows when your interpretation is BS. She has met some of the authors of the works she assigns or has studied the materials closely herself. \nIf you are looking for a class that pushes your critical thinking skills, critiques your writing, and improves your knowledge about Modern Chinese Literature; definitely take this. However, if you're just looking to fulfill a Global Core requirement and have neither the stamina to keep up nor an interest in Modern China, then switch out. Its not worth suffering since there are other course options. You do not have to read the works cover to cover, but you have to know your stuff: At least read most of the material, take good notes in class, and read your classmates' discussion posts from time to time. Also important: Go talk to the TA or Professor Liu at least once in the semester to gauge your understanding of some of the readings. If you can't do this, then at least go talk to them a week before your paper is due.\nIn conclusion, this was a very interesting course. I was disillusioned earlier in the semester because the course wasn't what I thought it would be like. However, I kept an open mind and grew to like it in the end. There will be days when you're like 'wtf!' and days when you're like 'oh, this is cool.' Its all part of learning, which is usually painful anyways.\n\nWorkload:\nA lot, but in retrospect, necessary to get the most out of the course:\nWeekly readings (150-250 pages)\n*you might also watch a movie, view an online art gallery, and read some poetry \nWeekly discussion posts (400-600 words)\nTwo papers (5-7 pages)\nMidterm and Final (Each a 15 min interview)\n"
        },
        {
            "course_name": "Literary and Cultural Theory: East and West",
            "review_date": "December 12, 2009",
            "review_content": "\nThis was the most challenging, engaging, and rewarding class that I've taken at Columbia.  This class introduces a vast array of literary and cultural theory, which is crucial for EALAC majors concentrating on literature and Comp Lit majors.  Professor Liu is incredible knowledgeable, and she knows how to balance giving us background information without compromising the class discussions.  I don't know if there's anyone more knowledgeable here about the issue of the East meeting the West in terms of translation, literature, and cultural exchange.  She is good at raising challenging questions and prompting us to engage with the texts.  Her class will definitely improve your critical thinking skills.  I recommend this class for those up for a challenging and exciting class.\nWorkload:\nA lot of work, but worth it!  Weekly readings (150-250 pages), weekly online discussion response, 1 presentation, 2 papers.\n"
        }
    ]
}