{
    "prof_info": [
        {
            "prof_name": "David Damrosch",
            "prof_id": 1723,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "January 06, 2009",
            "review_content": "\nProf Damrosch was an excellent lecturer, and I really enjoyed the CRCW  \nlectures. He was sometimes a little disorganized, especially with  \nworks that he was less familiar with (like one of the Dickens  \nlectures), but he consistently displayed enthusiasm for the text and focused on close reading. He spoke a little fast and didn't incorporate student  \nparticipation, but the lectures were only once a week for an hour, so  \nthat was understandable. For many of the poetry readings, he played  \nrecordings or read them out loud (the latter of which was always fun,  \nsince he read so well). Our last lecture was on global works, and it  \nwas hilarious and endearing watching him nod his head along to the  \nJ-pop songs he played for us. Even though this is the intro class that everyone has to get through, Damrosch seemed to genuinely care about the quality of the course (he sat in on one of my discussion sections). Of course, the overall quality will depend largely on the discussion leader, but I'd definitely take a class with him again. While the syllabus covers a lot, I found all the readings valuable and interesting.\nWorkload:\nReally light for an English class. Weekly readings assigned by lecturer and some additional by discussion leader. 3 papers of increasing length (1000, 1200, 1500 words). No midterm or final. Also weekly Courseworks posts (for my section).\n"
        },
        {
            "course_name": "Global Literature in English",
            "review_date": "May 21, 2007",
            "review_content": "\nThis was the first time this course has been offered and, while it was very successful, it could very well be different the next time it is offered, if it is. The basic theme of the class is the different ways in which the English language is used around the world over the past 200 years, ranging from Britain in the days of Empire, to the Carribean, and focuses alot on the use of it in Africa and African-American communities. Damrosch is brilliant and his love of the material is evident-he mostly lectures but is always willing to take questions and discuss the material in and out of class with students. This is a very interesting literature class, and very enjoyable, and I would highly recommend it. \nWorkload:\n11 books; 2 7-8 page papers; 2 100-200 word posts on the online discussion board (different for graduate students-3 750-word online posts, no papers, I think)\n"
        },
        {
            "course_name": "Modernism and its Enemies",
            "review_date": "September 27, 2003",
            "review_content": "\nProf. Damrosch has an infectious love for the material he teaches.  It's hard not to like the material covered, both because it's genuinely interesting and because it's presented so well.  Even if you've studied Modernism before, you're sure to read new works that help you to understand the movement better.  This is a great class, and an excellent professor, if you want a deeper analysis of a literary movement.  Note that you will acquire a terrific grasp of Modernism but not of any particular author, since so many works are covered.\nWorkload:\nOne midterm, one essay; reading load is intense but almost always worthwhile\n"
        },
        {
            "course_name": "Modernism and its Enemies",
            "review_date": "September 03, 2003",
            "review_content": "\nClass content wise, the material, perfectly coincided with the current popularity of woolf and tolkien, covers a much wider range than your average modernism run-throughs...he goes through the whole scope of the period rather than just focusing on the standardised greats, which makes the whole class much more interesting. but if you're looking for a sole fix on joyce or yeats or wilde or eliot and you don't want to sacrifice time for wodehouse or bennett or tolkien etc., then this class might not be for you.\nIn terms of lecturing, Professor Damrosch is great. He's extremely personable and has a great sense of humour. Obviously loves the material, but without taking it so seriously as to sort of obstruct any more fun approaches to the works or even to his own lectures. \nHe's extremely open to class discussion as well. Overall, a really fantastic class.\nWorkload:\none midterm, one final paper...really nothing. there's a lot of reading, but you can weed through what you want to read and what you don't, especially after the midterm. but most of what's on the list is really interesting anyway.\n"
        }
    ]
}