{
    "prof_info": [
        {
            "prof_name": "Leah Whittington",
            "prof_id": 11192,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 21, 2011",
            "review_content": "\nThe way Professor Whittington taught the core was the the exact reason I chose Columbia. She was enthusiastic, passionate, and so insightful. She gave us lots of supplemental materials so that we could appreciate the texts that we read better, and the class discussions that she led were usually very interesting. She was a tough grader, but I don't see why anyone would expect anything different. I learned a lot from her comments on my essays and understand why I got the grades that she gave me. \nWorkload:\nNormal lit hum reading, occasional ungraded written responses, three essays, midterm, final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 16, 2011",
            "review_content": "\nA very difficult teacher. Sometimes, classes seemed to go on forever, like the catalogue of ships in the Iliad. Grading wise, she is very VERY VERY strict. If you go to see her to talk about an essay, she will tell you what to do. If you do this, you will get a B/B- on your essay with comments of \"great work!\"; leaving students puzzled with just how to do well on her assignments. Midterm was very difficult as well. Be wary. It seemed like no matter how much time you put into the class, you can't really do very well. \nWorkload:\n3 essays, midterm, final, lots of reading/writing assignments, participation. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 12, 2011",
            "review_content": "\nProfessor Whittington was the best professor I had freshman year.  She is absolutely brilliant.  I looked forward to her class more than I did any other, as she lead fantastic, engaging discussions.  She demanded college-level work, which clearly a few of my classmates were unwilling to do.  She was always willing to meet with students multiple times to help them with their essays; evidently, some of my classmates didn't put in the time or effort necessary to do so.\nDinner at Symposium with the whole class was one of the highlights of my college experience thusfar.\nWorkload:\nTypical Lit Hum.  3 essays, a midterm, and a final.  The third essay can be creative.  I wrote a short story.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 10, 2011",
            "review_content": "\nProfessor Whittington is an up-and-coming academic powerhouse.  She is the most widely-read person I have ever met, and is extremely knowledgeable about the material.  I had many great professors this semester, but she was my favorite.  She brought out the best in her students during the two-hour seminars, which despite their length were never boring or fatiguing.  She never lectured to the class, but got students to discover the texts for themselves.\nI am usually quite shy and have absolutely no classics background, but Professor Whittington drew me into the discussion more than any other professor ever has.\nShe is an extremely fair grader.  My writing improved dramatically over the course of the semester, as did my grades on essays.\nWorkload:\nthree essays, a midterm, and the course-wide final.  Nothing unusual.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 10, 2011",
            "review_content": "\nProfessor Whittington is fantastic.  She is the best professor I have ever had at Columbia.  She has an incredible knowledge of the lithum material and leads wonderful and engrossing discussions every day.\nProfessor Whittington expects good, college-level work, and does not give students A's on papers just for trying.  Arguments must be clear and cohesive.  However, she is always willing to meet with students and help them improve their drafts.  Students who do poorly on her papers have no one to blame but themselves.\nFor example, I didn't do well on the first paper.  For my second and third papers, I met with her individually a couple of times and she helped me improve them dramatically.  I got As, and I expect an A or an A- in her class.  I am a much better writer now than I was at the beginning of the semester.\nGold nugget for sure.\nWorkload:\nTypical lit hum: three papers, the third of which can be creative (short story, poetry, etc), a midterm, and a final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 30, 2011",
            "review_content": "\nshe is just a bad bad bad nugget. she is a recent harvard grad and thinks she is better than anyone at columbia which means bad essay grades for all. i did not think it was possible to get below a b- in a core class but behold i got a d on an essay. if you enjoy getting bad grades and falling asleep in a class where participation matters go join this class immediately\nWorkload:\nthree essays a hard midterm and a final(department wide WOOOHOO)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 31, 2011",
            "review_content": "\nShe is one of the worst teachers you can have for lit hum. Very biased toward students who she doesn't like and will give you an undeserved  bad grade. On all the essays she writes \"great job\" and then will throw out a c/b without giving you one negative comment. The general vibe of the class was that she was one of the worst teachers you can get. Class consisted of long discussions that seemed to drag on forever that had almost every student in the class staring at the clock counting down the time to the end of class. Bottom line is AVOID her at all costs.\nWorkload:\nTypical lithum course work. A much harder midterm then any other lithum class and the lithum wide final. \n"
        }
    ]
}