{
    "prof_info": [
        {
            "prof_name": "Scott Martin",
            "prof_id": 1772,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Latin American Politics",
            "review_date": "March 23, 2005",
            "review_content": "\nBy far the worse lecturer I have encountered at Columbia, and I am usually pretty lax with my judgements, having found most culpa reviews to be too harsh. \nBut the man is really terribly boring. Granted I'm taking the class for \"fun\", and it's not my area of concentration, but how can you make one of the most dynamic areas of the world so incredibly boring. Also, he is condescending and annoying as soon as it becomes apparent you are not a fluent spanish speaking latin american, which was suprising to me coming from another regional concentration and having often heard professors of those other regions dealing with \"newbies\" in a fair and helpful manner. I suppose I had always taken it for granted until now. The man is terrible. He's not particularly approachable and he seems to be followed by a mini-SIPA cult, probably because there's a limited number of people who concentrate in the region. He definitely tells you right away that you're at a disadvantage gradewise as an undergraduate. And he harps on the fact that this is an upper level political science course, but doesn't really support that claim with his mostly regurgitated lectures. Boring and kind of a jerk. So disappointing.\nWorkload:\nReadings (normal for polisci class), take home midterm, take  home final\n"
        },
        {
            "course_name": "Human Rights, Labor, Global Capitalism",
            "review_date": "January 03, 2005",
            "review_content": "\nI agree fully with the other reviews.  Although, I did learn from the discussions somewhat, Martin's speaches were incomprehenible.  If you have an intelegent group, which you should be able to discern, stick with it.  However, if you can tell there are bullshitters looking to capitalize on Martin's lax grading policy, you'll be board.  A nice easy class to use for a seminar but dont expect to learn too much. \nWorkload:\nA lot of reading.  Most books on reserve at lehman with only one copy/  \n"
        },
        {
            "course_name": "Comparative Politics Seminar: Globalization, State, and Society",
            "review_date": "August 20, 2004",
            "review_content": "\nNice guy, weak class.   At least the first hour of the almost two hour class consists of him talking.  Not a good seminar experience, as you barely ever get to discuss anything.  He will interrupt your point to talk for 20 more minutes, and you won't be able to follow a word he says.  Class is hard to get through, readings are highly and unneccesarily technical.  You are never given readings that give a solid foundation for the big picture of globalization, and the scope of the material covered is very narrow for a course title that general.  A lot of the stuff you read is about labor, his specialty.   Honestly, I learned very little from this class.  He is never on campus and very inflexible with office hours, so good luck getting help with your paper if you happen to have a class when he holds them.\nWorkload:\nabout a book a week, and the seminar paper is pretty short (I think max 18 pgs.)\n"
        },
        {
            "course_name": "Latin American Politics, Society, and Culture",
            "review_date": "October 28, 2003",
            "review_content": "\nSweet professor, very approachable and knowledgeable. Reading is generally interesting.  Focus on globalization and labour politics/economics - which are Martin's interests. Great class to Latin America in that it takes a comprehensive approach, including society and culture as well as political science. If you've lived or spent time abroad in the region, you will definetly relate and have a lot oto contribute. My only qualms was that the class depends on the level of participation and interest of the class, and with a book a week - some weeks get be rough going. \nWorkload:\nOne book a week (which is a lot), about three reviews (3-4 pages each, and final seminar paper (15 pages) \n"
        }
    ]
}