{
    "prof_info": [
        {
            "prof_name": "Damon Horowitz",
            "prof_id": 12568,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 21, 2013",
            "review_content": "\nHorowitz is a talented professor. He manages to get people to work hard and put time into the class while still grading quite leniently. He keeps people on their toes to get us to put in quite a bit of time in the class. If you want a walk-in-the-park class, this probably isn't it, but the workload won't kill you either.\nWe had 2 papers, 1500 and 2000 words each. I think he awarded higher grades to people who sent him drafts. On the exam, there were no passage IDs (YAY), just explaining concepts, which isn't hard if you paid attention and took notes in lecture.\nYou have to send in a response to your reading every class. In the long run, this is helpful since it forces you to at least OPEN the book rather than show up 100% unprepared and gives you an opportunity to consolidate your thoughts. Responses are 1-2 paragraphs, so it's not really a big deal.\nIf you can take Damon's class, take it.\nWorkload:\n2 papers (1500 and 2000 words each)\nexams without passage IDs (not hard)\nreading responses every class\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 25, 2012",
            "review_content": "\nThings you should know about Damon: He works at Google (as their \"in house philosopher,\" whatever that means??). He's a Columbia grad. He may or may not be at least part robot. He's disgustingly smart. Oh, and he became a millionaire when he was like 24 or something for selling some startup he made. He doesn't talk about that stuff in class, but it definitely clarifies some of his weird professorial idiosyncrasies. Damon knows the material well and expects you to, too. Being able to participate in discussion is a big deal. Damon isn't the kind of professor who will fill awkward silences with rambling lecture; he sits, he waits, and if no one says anything, he'll give a little disappointed sigh and ask another question.\nHe expects you to do the reading, but he's not evil. He went here, too, and he's pretty familiar with the Columbia workload. If you can read enough to participate in lecture and know at least one idea from each text backwards and forwards, you're in good shape. His midterms are easy, he grades papers fairly (especially if you go in to talk to him about your ideas), and he's a generally nice guy.\nNot very engaging as a lecturer, though (he puts weight on you as often as he can), so make sure you have people in the class that do the reading. 2 hours of crickets does not a CC class make.\nWorkload:\nStandard, plus a \"reading response\" due before every class. Just a few sentences about the reading, doesn't actually directly impact your grade (he just uses it to get an idea of who's reading and what people want to talk about).\n"
        }
    ]
}