{
    "prof_info": [
        {
            "prof_name": "Mu-Tao Wang",
            "prof_id": 730,
            "total_reviews": 26
        }
    ],
    "reviews": [
        {
            "course_name": "Honors Math A",
            "review_date": "May 29, 2014",
            "review_content": "\nThis is absolutely a worthwhile course to take if you have the necessary prerequisites and are thinking of becoming a math or sciences major. Don't be put off by NSOP's awkward avoidance of the Honors sequence -- if you're interested in proof-based math and up for a bit of a challenge, try it on for size. Like several students in Honors Math, I took both linear algebra and multivariable calculus in high school, so I very much appreciated a differently-motivated and more rigorous perspective. And this course will prepare you for upper-echelon math courses like no other. For example, Mu-Tao starts the first semester defining fields and finite-dimensional vector spaces, definitions traditionally seen first in abstract algebra, and often uses functional notation rather than matrix notation for linear transformations. In the second semester, Prof. Wang introduces you to analysis with the completeness of the real number system, and throws quite a few bones to topology along the way.\nAs a previous reviewer noted, Mu-Tao is an excellent, excellent lecturer. He structures and organizes effortlessly, he tries to develop intuition (especially geometrically; as a analytic geometer he's also an accomplished sketch artist), he proves almost everything he states in a way that's easy to understand -- and he responds well to questions. He's also very friendly and helpful in office hours.\nHomework assignments are due every class (the assignments due after the weekend are generally longer, 2~4 hours instead of 1~3). In the first semester, most of the problems are Mu-Tao's own, but a couple of weeks into the second, all of them come from Apostol. With that shift comes a shift away from rigorous proofs and towards problem-solving. Additionally, the cramming of all of Calc III & IV into the second semester may at times feel a bit rushed. But all in all, this is not a difficult course to follow if you put your mind to it.\nExams are all in-class and can be tough to complete at times, but Prof. Wang understands this and grades generously. As the previous reviewer noted, there's a good mix of problems, so you can play to your strengths, but there's not a lot of correlation between the material on problem sets and the material tested on the exams. That said, do the homework anyway because it'll enhance your understanding of the material from in class. Then when an exam comes around, do the practice exams, go to the review sessions (one before each exam in addtion to regular weekly recitation), and re-read your notes -- you'll be good.\nWorkload:\nHonors A: a quiz early in the semester (5%), best 20 out of 25 homework assignments (of which 24 were collected and graded, 25%), midterm exam (30%), final exam (40%).\nHonors B: best 20 out of 25 homework assignments (of which 22 were collected and graded, 20%), two midterm exams (20% each), final exam (40%).\n"
        },
        {
            "course_name": "Honors Math A",
            "review_date": "May 23, 2013",
            "review_content": "\nOverall, I walked away pretty happy with this course.  Based on reviews of previous iterations of the course, it sounds like this one wasn't nearly difficult was the killer courses with Savin and Friedman.  It follows the second volume of Apostol's textbook very closely, and served as coverage of linear algebra and multivariable calculus, and basic proofs.  Since multivariable calculus is covered in two separate courses, calculus 3 and calculus 4, taking this class is a good idea if you want get the material out of the way in a single semester.  \nProfessor Wang was an excellent lecturer who covered material very thoroughly in class.  He moved quickly, but he was very thorough and wrote down everything that was important on the blackboard.  He did tend to focus on long proofs that were never to be seen again, but he also did a great job conveying the intuition behind the material.  \nHomework was assigned twice a week every week, and the length of the homework varied a bit, but it usually didn't take too long.  The assignments were almost always out of the book, and this was probably the biggest weakness of the course, because the problems in the book were generally not all that great.  During the first semester, when we did linear algebra, they were generally decent.  During the second semester, when we covered multivariable calculus, some of the problems required excessive tedious algebra without having much value or relating to what we were emphasizing in class.  There were three times when the professor wrote his own assignments that were not from the book, and honestly these were the most interesting and relevant assignments that we had.  It would've been nice to have more proofs assigned during the second semester, where the homework assignments were almost entirely computational.\nThe exams were very fair.  Usually 40% of the points came from true/false questions and the remaining 60% of the points came from longer problems.  There was usually a good mix of computations, conceptual problems, and short proofs.  Usually the average was between 70 and 80.  He clearly didn't design the exams with the intention of them being brutal and the averages being very low, as he expressed disappointment when the average was in the low 70s.  He is also very good at writing problems that simplify very neatly, and is not interested in making the students crank through a lot of tedious algebra on the exams.  He also does not penalize students multiple times for the same mistake, and if a problem has multiple parts, missing one does not imply you won't be able to do the later parts.  The most relevant preparation for the exams was the practice exams that he provided beforehand, for which solutions were provided, and he or the TA worked them out in a review session the night before the exam.  Seriously, these were golden.  The exams weren't copies of these, but some of the questions on exams did emphasize similar points (that might not be seen in the homework) and got you thinking in the right direction.  Comparatively, the homework was not very helpful for exam preparation.  \n\nWorkload:\nThe first semester was graded as follows:\n30% Homework assignments (best 20 out of 23 were counted towards the grade)\n30% Midterm exam, which consisted of an in-class portion worth 70% of the points and a take-home portion worth 30% of the points.  The remaining exams only had in-class portions.\n40% Final Exam, which was cumulative \nThe second semester was graded as follows:\n20% Homework assignments (best 20 out of 25 were counted towards the grade)\n20% First Midterm exam\n20% Second Midterm exam\n40% Final Exam, which heavily focused on material covered after the second midterm\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "December 31, 2009",
            "review_content": "\nThis was a painless, if quite dull, class and a good section.  Mu-Tao was a nice professor who tried to make the tedium of regular singular point series solutions at least bearable.  He had his work cut out for him, and sometimes I'd catch myself falling asleep.  His accent was not terrible after a few classes, once you got used to it.\nThe material is very applications heavy, as you'd expect from an \"engineering\" ODEs class.  You'd learn how to recognize many different types of ODEs and how to solve them, rather than spending time learning why the methods you choose work.  I'd say take that into account while picking classes, but since this class is a requirement for many majors, I'm not sure there's much of a point in doing that (although there is the 3027 ODEs class).\nI honestly don't feel like I learned that much after the class, but I'm not sure if that's a function of the professor or of the class.  I suspect the class, and so I'd recommend Mu-Tao as a good professor with whom to finish this requirement.\nWorkload:\nWeekly quizzes, a midterm and a final.  We had weekly homework assignments that weren't collected and were generally considerably harder than the graded work, which seemed quite easy.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "August 30, 2007",
            "review_content": "\nNice guy and energetic in class but if you don't understand the textbook chances are you won't understand all the multivariable stuff he's writing on the board. he write copious notes, theorems and proofs, but it's mostly by the book.\nclass size is usually large (90!) so there's not much time to address individual questions. if you don't understand something, better go to the TAs or his office hours. NO LATE HWS (weekly!) and Weekly quizzes but no sweat everyone does poorly. Exams are difficult even if you study, unless you remember the theorems and happen to be really REALLY good at math. So, don't take this class unless you have to.\nWorkload:\nWeekly HWs and Quizzes, 2 midterms and 1 final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "July 16, 2007",
            "review_content": "\nAlright, here's the deal guys. Mu Tao Wang is an awesome professor. Just too hard. If you are not a proof based guy, get the hell out of this class. If you like proofs, Wang will be fun and challenging. There are a lot of other professors that teach the same course and people get easy A+. Unless you're brilliant, chances of getting higher than a B+ are very slim. \nWorkload:\nWeekly quizes that are hard, and they make you think. Exams are crazy hard. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 09, 2007",
            "review_content": "\nMore of a theoretical class than your typical slack-off class where you get easy word problems, this class is for people who are good at math and physics, or adept at logical reasoning. Be confident of your math skills if you want to take this class. Highly stressful, as the averages were low but the curves weren't very helpful because of math/engineer people who scored very high. You may not learn much if your foundations are not solid and if you don't really want to add to your theoretical math knowledge.\nWorkload:\n1 hw set a week, 1 quiz every week. Difficult midterms, averages around mid-60s. Easier final. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "February 06, 2007",
            "review_content": "\nThe thing with Professor Wang is that you have to 'get' him. I had a tiny bit of a nasty shock going in because he teaches Calc III like he does the honours math course -- lots of proofs and theorems along with the 20 examples he goes over every class period. I admit it is sometimes like running next to a motorcycle trying to keep up with him, as most of the 75-minute lecture consists of frantically scribbling down his notes on the blackboard (each of which he reuses at least six times during the period). Still, it is not fair to say that the class was unpleasant. Wang was always punctual, prepared and ready to lecture. He speaks perfect English with a bit of an accent, though it took me a while to figure out that 'reco' meant 'recall'. He has that dorky math professor type humour and even took a stab once at the annoying kid we all wanted to shoot spitballs at. Definitely a sure way to pass the time quickly.\nLectures are really important. I felt like I would miss out a lot if I skipped even one lecture, since he covers so much. Also, Calc III with Wang is more difficult than with other professors -- there is a LOT of mathematical theory that requires you to have intrinsic knowledge of to not get lost. Other classes covered more, but I figured Wang was going for depth and understanding more than a finish line. He is crisp, articulate and very very organized -- and he actually wants you to LEARN something, not just solve equations robotically (hence all the theory). He's also extremely nice in his office hours. \nThe only annoying thing is the weekly quizzes, which are really difficult. Luckily, they don't count for much. Curve and final saved my less-than-mediocre quiz and midterm grades.\nWorkload:\nweekly problem sets, graded generously, impossibly hard weekly quizzes, two hard midterms, and a relatively easy final (just review the practice exam -- carefully!)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 21, 2007",
            "review_content": "\nProf. Wang was an excellent no-frills mathematics professor. He was very focused and well-prepared, lecturing from notes while ocassionally adding extra insight. Obviously understood his stuff and was able to communicate it clearly to the class, step-by-step. He answered questions thoroughly and also reviewed a bit of the previous class at the start of every new lecture, which was very helpful. Although some have complained his lectures went too quickly, I found them just fast enough to stay challenging and keep you on your toes. There were also some moments of surprising hilarity that livened up the class once in a while. Prof Wang's lectures will teach you the material, and reviewing the textbook afterward is all that's needed to reinforce key concepts. He's very good and you'll learn what you need to know about calculus.\nWorkload:\nWeekly HW, weekly quiz (sometimes tricky!). Two moderately difficult midterms and a ridiculously straightforward final. Reasonable curve.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 18, 2007",
            "review_content": "\nProfessor Wang was, all in all, a very good teacher whom I would take again.  His accent is nothing to worry about, very easy to understand, and his writing is clear if you miss a word or two.  From what I heard, he was a bit harder than many of the other Calc III professors, and moves a rapidly through the material without using many concrete examples.  However, he is good at explaining the principles, and willing to help if help is asked for.  He also tries to make the class a bit fun, cracking the occassional joke when it gets too serious.  A word of warning, however; he sets down basic guidelines and intends to follow them.  Late homework is not accepted.\nWorkload:\nWeekly homework assignments are a bit long but very do-able, and range in difficulty.  His weekly quizzes are quite difficult, moreso than the midterms, which are curved well enough.  Final is easier than any other part of the class, and also curved to a B+\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 11, 2007",
            "review_content": "\nMu-Tao is actually a pretty good teacher. You should sit in the front though because with his Chinese accent you might not be able to understand him that well and it'd be better to sit up front and take notes. He writes everything down on the board, but most of his notes are just proofs. He opens up towards the end of the semester and really just wants you to learn Calculus, so no matter what, raise your hand if you have a question. As long as you put SOME effort in, really listen in class (or at least take down all his notes), and do most of the HW and all of the practice midterms/finals, you can pull off at LEAST a B in this class.\nWorkload:\nHW every week (10 or so problems from the book), 2 midterms and a final. Some of his midterms/final follow the exact format of his practice ones he posts online, so DEFINITELY do those for practice.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 01, 2007",
            "review_content": "\nEveryone wrote that he's great so I took him.  He's not bad but not excellent.  He's quite approachable.  And his best quality is his lack of strong accent.  He is clear with his examples and he curved to a B.\nWorkload:\nNot too bad.  A homework assignment and a quiz each week.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 28, 2006",
            "review_content": "\nTeaches straight out of the textbook (which is horrible at explaining concepts).  His 1 hour 15 minute lecture is simply copying pages of notes while he explains.  Accent does not pose a problem, but his speed does.  It is best to read the material in the textbook to learn anything.\nSupposedly his section is easier than other professors', so if you are willing to work hard, you will do very well.\nWorkload:\nWeekly quizzes (HARD), weekly homework (leniently graded), two midterms (REVIEW the practice midterms!!!), one final OUCH.  Nice curve, though.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 19, 2006",
            "review_content": "\nAs compared to the other calc 3 professors during my semester, Prof. Wang was by far the hardest. The homework was hard, the weekly quizzes were hard, and the two midterms were hard. On the upside, he is a great professor who really tries to get students to understand. His english is fine-- also a bit amusing when he says alpha or delta. About 30-40% of the students dropped out of the class. The curve is slightly on the bad side because all the smart people stayed in the class... The really nice upside is his final was very easy, so easy makes me wonder if he has something up his sleeve. He has a great sense of humor, that corny teacher humor. I'm not sure if I would recommend him for the average columbia math student. decided for yourself. \nWorkload:\nquizzes every week, homework every week, two really hard midterms, a really easy final.\n"
        },
        {
            "course_name": "Honors Math III",
            "review_date": "April 22, 2005",
            "review_content": "\nProfessor Wang is by far the best mathematics professor I have ever had.  He can reduce the incredibly complex presentation of Apostol's Calculus to concrete, useful examples and provides much better, cleaner proofs than those in the book.  That said, these classes are hard.  When you think that they can't get harder, they do.  Multiple problems from Apostol are misprints and cannot be solved but in failure, you will learn more about the process of solving these problems than otherwise.\nThe bad part is his annoying habit of assigning problem sets on Thursday evening to be due on Monday.  It really messes with your schedule.\nI will be taking as many classes with Professor Wang as I can.\nWorkload:\nA few completely insane problem sets.  One assigned over Spring Break that took more than 14 hours.  Some people finished it in under 10 but they were freaks of nature.  Most problem sets have good mix of very easy, moderately challenging and rock-your-world difficult.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "November 24, 2003",
            "review_content": "\nI want to agree with everything else that is said and add to it a little bit. Professor Wang is an excellent math teacher. The only bad part about this class is the homework. It takes about 4-5 hours to do a week (sometimes even longer) but the midterms seem to be a step below what is asked on the homework so if you do fine on the homework you will do well on the tests. I definately reccommend him as a teacher and would take any class in the future that he is teaching.  \nWorkload:\nPretty time consuming. Weekly Homeworks that take a couple of hours to do each week, 2 midterms (all straightforward), and a final \n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "November 18, 2003",
            "review_content": "\nAbsolutely the best math professor I've ever had.  The thing that puts him above the rest is that he explains what you are doing when you are proving an equation, or anything like that.  Other professors don't do that, they just do the proof.  Wang makes math both understandable and interesting.\nWorkload:\nWeekly problem sets, two midterms, final.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "September 17, 2003",
            "review_content": "\nImagine the best math teacher humanly possible.  Okay, Wang is a notch or two BETTER!  He explains everything from the bottom up (it's impossible to \"get lost\" along the way), and always stops for questions.  Don't be afraid of his Asian appearance; Wang is quite articulate and he even speaks at an audible volume.  I only wish I'd had him for every math class since 1st grade.   I challenge anyone to take this class without enjoying it and its patient, gentle, thoughtful professor.\nWorkload:\nTypical math class with problems out of the textbook due every week.  If you're a math nut, you'll find that matrices stimulate your brain in a kind of massage that only math can set in motion.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "August 23, 2003",
            "review_content": "\nI think Prof. Wang's English was just fine.  I heard nothing that was hard to understand and never needed him to repeat anything in class.  He is generally aware of the class and will stop and go over something if he senses that people aren't keeping up.\nHe seemed like a very nice Prof., though I never went to see him after hours (I did talk to him a few times after class).\nHaving heard the horrors from a couple of friends taking Calc1a at the same time as me, both with difference professors, I would highly recommend Prof. Wang.  \nFair, nice, easy to understand.  Need I say more?\nWorkload:\nWeekly problem sets (couple of hours each), two mid-terms and final.  I think it's the same for all the Calc 1a classes.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "May 26, 2003",
            "review_content": "\nProfessor Wang was by far the best math professor that I have ever had.  He has an accent, but he is still understandable.  His lectures were well organized with excellent notes on the blackboard.  The homework can be difficult, but he always took time in the next lecture to cover difficult problems.  If you struggle with math, he's the right teacher.  Besides, the midterm and final problems were taken from the homework, so if you do the work, you'll be fine.\nWorkload:\nweekly webwork and \"paper homework\" two midterms and a final.\n"
        },
        {
            "course_name": "Honors Math III",
            "review_date": "May 18, 2003",
            "review_content": "\nAs yet another Honors III drop-out, I have to say that what both the other Honors reviewers said was true.  The class started with about 22 people, when it ended I think there were 8.  The textbook we used was full of errors.  Beware of taking this class without a STRONG math background, or else be willing to work and study HARD -- or else be a genius.  Any of those (especially the first and last) will do.  I am a math major (and I love math!) but this was too much for me.  It's not like high school where you can always take the hardest course available.\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "January 21, 2003",
            "review_content": "\nhard to understand but very nice and always willing to help you after hours.  I got an A but never went to class and just taught myself everythign.  Hard homeworks, but livable if you have friends in the class\nWorkload:\nHard homeworks, but livable if you have friends in the class.  I got an A but I'm a math major\n"
        },
        {
            "course_name": "Honors Math III",
            "review_date": "August 08, 2002",
            "review_content": "\nAs an Honors Math drop-out, I can say that most of what the other guy said is very true. I would probably add a couple things. Though, Mu-Tao Wang's English is passable, our TA could not speak English for shit, which is a pretty big problem if you need him to explain stuff. The homework is not consistently difficult. Usually it will be a lot of easy (somewhat time-consuming) problems, and then one or two problems that are a real kick in the balls. I remember one time Mu-Tao assigned this impossible proof. At the recitation, the TA said, \"This was solved by the famous mathematician BLAH BLAH BLAH ... so let us follow him.\" And I was thinking, \"what if I hadn't shown up for the recitation? Does he REALLY expect us to single-handedly accomplish a proof that only some famous Russian guy could do?\" I didn't understand the TA's explanation either, because, as I said, his English sucked. That's when I left. So, if my experience is any indication, I would say this class is definitely not for the casual math enthusiast (like myself). Even though I got A's in BC Calculus and a 5 on the exam (booyah), I was definitely out of my depth. Even my ex-girlfriend, who was brilliant in math and took the exact same class at Yale (the textbook was written by a Yale math professor) said the class turned her off to the subject. What the other guy says about \"theoretical underpinnings\" is true. If you take this class, you won't learn multi-variable calculus or linear algebra. Really. You won't even see numbers that often. My ex-girlfriend, who took the class both semesters, feels like she didn't learn anything. I would agree with this guy that you should only take this class if you are very serious about math, and definitely going to major in it. But even if that is the case you should probably take calc 3s and linear algebra at the same time as the honors class. I always got the impression that the class tacitly assumed a prior knowledge of these subjects. Though the math department says you should start with Calc 2s if you took BC in high school, that's bullshit. The first half of that class is stuff you already learned (like improper integrals and series) and the second part is incredibly easy. You could teach yourself everything in that class that you haven't yet learned in a few hours, a weekend at most. Again, I speak from experience. I took Calc 2s the following spring. It's cake. So the bottom line is, you should only take this class if you're definitely going to be a math major, and even if you do take it, you should supplement it with Calc 3s and Linear Algebra---unless you are some math prodigy who already studied that stuff in high school, in which case you're good to go.\nWorkload:\nWeekly problem sets, graded on a scale of one to ten and assigned from a textbook that is riddled with typos that matter in a significant way (another big reason to go to the recitation). I didn't hang around for the tests. See Russian proof anecdote above.\n"
        },
        {
            "course_name": "Honors Math III",
            "review_date": "July 31, 2002",
            "review_content": "\nBefore you even THINK about taking this class (with or without Prof. Wang) ask yourself this question: \"Am I going to be a Math Major?\" If you answered \"no\" or \"maybe\" then don't take Honors Math, take IIS. In addition to being very difficult, this course is abstract and proof-based to an extreme. I feel like I have an excellent understanding of the theoretical underpinnings of linear algebra and multivariable calculus. If I were required to say... build a bridge using my knowledge of the subjects, I would be absolutely hopeless. There are NO applications in this class, this class is all proofs and abstract concepts. Having said that, this was the best math class I've ever had in my life. I am a math major, I love proofs, and I don't really care for the practical applications of math. Prof. Wang gets a B+ on English (it's not at all an obstacle) and an A for everything else. He's approachable, willing to repeat himself, available after hours, and willing to reschedule a take-home midterm for you because you have tickets to see the Dismemberment Plan that night. The workload is hard, but fare, and he knows that the students in his class are working hard and shouldn't be making Cs. The bottom line is: if you're serious about math, love doing really difficult proofs, and willing to work, then by all means TAKE THIS CLASS! However, on the first day of class there were 40 students. Only 11 stuck around for the midterm. It's a hard class, that is not what most students are after, and if you think you fall into this category, IIS is a much better class for you.\nWorkload:\nAll I can say is, form a study group. Once I got with some other students and we divided up the (very challenging) homeworks, things went much better. The take-home exams are tough, but if you've done the work and studied, certainly not impossible. I hope you like proofs. Grading is fair, but not inflationary.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "March 02, 2002",
            "review_content": "\nMu-Tao was definitely a pleasant surprise as math teachers go. Don't be scared off by the foreign name; he speaks English very well, and his handwriting makes up for the very occasional deficiency. His explanations were generally pretty helpful and clear, and he always tried to be receptive to questions in class. Tests were fair. It certainly wasn't exciting, but it had pretty much everything you look for in a good math class.\nWorkload:\nTwo straightforward midterms and a final. Weekly homework that's graded.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "November 12, 2001",
            "review_content": "\nA rare Chinese Math professor who speaks good English. Eloquent and clear lectures. Thoroughly knowledge of material. Reasonably responsible and responsive. Not extremely nice but never mean. Harvard PhD but not arrogant. Overall a good professor and extraordinary compared to the others in the Math Department.\nWorkload:\nThe weekly homework takes a loooong time to do. But that's just how Lin Al. If you already expect that before taking the class, you'll find the workload very reasonable. Basically everything is reasonable about this class. Not too easy nor too hard.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "November 07, 2001",
            "review_content": "\nMu Tao Wang is a very good professor. He speaks English just fine, with just the slightest accent. He knows everything backwards and forwards, and is responsive to questions. There is nothing extraordinarily good or bad about him, he is simply a good professor and there is eminently capable of teaching any class you are taking well.\nWorkload:\nWeekly problem set, two midterms, final. Yes you will have to work, but not exceedingly.\n"
        }
    ]
}