{
    "prof_info": [
        {
            "prof_name": "Vasilis Fthenakis",
            "prof_id": 2869,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Air Pollution, Prevention, and Control",
            "review_date": "April 03, 2013",
            "review_content": "\nAvoid this class.\nProfessor Fthenakis is disorganized, hard to understand, and makes no real attempts to inspire students. He is not adept with the technology used in the classroom such as digital whiteboards, and will not provide feedback on your homeworks until after the exam on the same materials. The dry material does not help. \nExpect nothing more than a 1950's style lecture, tedious problem sets, and a vaguely helpful book. The body language of my fellow students as I look around the room -- heads slumped, eyelids sagging, aimlessly scrolling through cell phones -- means I'm not alone in my sentiments.\nI regret taking this class immensely. There are no redeeming qualities unless you are pursuing air pollution control or analysis for your career.\nWorkload:\nChallenging and regular problem sets; midterm; final.\n"
        },
        {
            "course_name": "Air Pollution, Prevention, and Control",
            "review_date": "March 20, 2006",
            "review_content": "\nAbsolutely terrible professor.  His lectures are disorganized and out of order.  He teaches straight from the textbook, which is equally as bad as he.  He assigns difficult homework problems where everyone in the class copies off each other.  (If you are not friends with other people in the class, you will be at a disadvantage.)\nHe's also quite belligerent when discussion errors in homework assignments, solutions, or exams.  He frequently asks vague questions and expects specific answers.  For example from a previous exam, \"what can you tell me about carbon monoxide.\"  With a question like that, it is impossible to include everything that he is looking for.  It's like asking someone \"what do you think about Columbia\" and then taking off points because they didn't mention that Butler is open 24x7.  If he's looking for specific answers, he should ask specific questions that equally test knowledge of the material (e.g. how late is Butler open until)?\nIf you do not have to take this class, skip it.  He's an irritating waste of time.  Fthenakis is from an older generation where professors are respected just for the fact that they work for the university, rather than having anything useful to say or teach.\nWorkload:\nDifficult weekly homework assignments, lots of reading to understand wtf he is talking about, quizzes, midterm, and final.\n"
        }
    ]
}