{
    "prof_info": [
        {
            "prof_name": "David Madigan",
            "prof_id": 6375,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Applied Statistical Methods",
            "review_date": "May 31, 2013",
            "review_content": "\nProfessor Madigan is an incredible professor. He is extremely receptive to emails and is always more than happy to talk to his students. He is one of the nicest professors at Columbia and is genuinely interested in having his students learn something rather than having them just care about the grade. The man is an amazing lecturer and is able to make difficult concepts understandable. If you put the time into this class, you will walk away with a solid understanding on how to use certain statistical tools. \nRegression, in a nutshell, is an art form. There are no straightforward, procedural methods, and this class teaches you a variety of statistical tools to put in your statistical toolbox. Although the class begins with some easier concepts (especially if you have taken the prerequisite 2024 Applied Linear Regression Analysis), it gets more interesting in a hurry when he begins discussing generalized additive models. The one challenging portion of this class is the math behind some of these statistical concepts. Luckily, you don't have to fully understand them, but they're still very interesting. \nThere is one homework assigned per week, which requires the use of R. If you didn't know R before this course, you definitely will be comfortable with it by the end. The homeworks, which use the concepts taught in that week's lecture, require a bit of tinkering. Luckily, the TA and the professor are both extremely helpful if you ask. In addition, the textbook is very helpful in completing the homeworks (which is available online). \nThere is a final but no midterm. The final is open book and last about an hour (most people finished in around 30-40 minutes). There are six short response questions that don't test R knowledge, but rather theory behind the things taught in class. It's the kind of final where you either know it or you don't. A bit difficult to prepare for, but as long as you attend lectures and take notes you should be fine. \nLastly, Professor Madigan had each student do two projects, which could be done in groups of 2-3. These projects were incredibly enjoyable; students were given the opportunity to research any topic they pleased (I recall one student writing a project on basketball statistics); I recommend you choosing a topic that interests you. You were required to use statistical methods taught in class, like poisson regression or time series. A write-up is also required in the project in explaining your results. Don't leave the projects to the last minute though, as they take a bit of time because R is bound to give you some fits along the way. Really make it something yours and if you put your heart into it (cheesy i know), you will be rewarded.  \nWorkload:\n1 Homework using R assigned per week, 2 projects (project topics must be approved first by Professor Madigan) which can be done alone or in a group, and 1 open-book final. \nApproximate grade distribution was around 40% homeworks, 30% projects, 30% final.\n"
        },
        {
            "course_name": "Applied Linear Regression Analysis",
            "review_date": "April 24, 2013",
            "review_content": "\nThe most insparing professor ever. He is very determined to help you learn and understand, not simply to pass the class. I very appreciated his quick e-mail responces for any question I had ( even th emost simplistic). He was always available for the office visit, if you need to see him in person and willing to spend lots of his personal time to help you understand material. \nI higly remomed his class. and from now on will look for any class he is teaching :)\nWorkload:\nweekly home works- very duable. 2 projects . final.\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "January 19, 2011",
            "review_content": "\nI am not a math person. I took this class because it was advertised for those who do not enjoy math. But I LOVED this class!!!! Professor Madigan is the sweetest professor you will ever have. He wants his students to do well more than anything else, and he has no problem explaining and re-explaining a concept if you don't understand. You can email him asking any question, and he is always available to meet privately to go over a concept or a homework. He is also extremely receptive to grading (if you don't understand why something was graded the way it was, he'll either explain it to you, or agree with you and change your grade for the better). I've never enjoyed a math class before this one. TAKE THIS CLASS!!!\nWorkload:\na chapter of the textbook per class (and the textbook is ridiculously easy and interesting), a weekly homework assignment, 3 mini-projects, a mid term and a final. For the midterm and final, we were allowed a cheat sheet\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "December 14, 2010",
            "review_content": "\nAMAZING!\nIf you want an easy way to fulfill your math requirement, this is the class for you. Not only is the material incredibly manageable, but Madigan is the nicest Professor in this university. He is always available in class or out of class to help, and eagerly does so. Plus its incredibly easy to do well. The work is straight out of the textbook so as long as you do the reading before the homework or midterms, your fine. And if you didn't do well on your homework, he will gladly go through it with you and give you a higher grade. \nI cannot stress how great this class was. Take it!\nWorkload:\nTotally manageable. 3 Mini Projects. Weekly Homework. Midterm and Final.\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "November 13, 2010",
            "review_content": "\nI had a very positive experience taking STAT W1001 with Professor Madigan in Spring 2010.\nFirstly, Professor Madigan is obviously very smart and accomplished in his field. He is the current Chair of the Statistics department, and has served as an expert witness in a number of interesting cases, which he would often share during class.\nDespite being so successful, Prof Madigan still knows how to make stats approachable and understandable to students with no background in it whatsoever. I think I did more math in 7th grade algebra than in this class. It is much more conceptually based. Prof Madigan is great about answering students' questions in a thoughtful manner. He will go over homework or exam questions in class with great detail and make sure that everyone understands the concepts. Though attendance at lectures is not required, I would highly recommend it just because Madigan explains the concepts well. He is a very reasonable grader and genuinely wants his students to do well. He will meet with you instead of just passing you off to the TA's (although they are pretty good too). He's prompt with responding to emails, too, which is nice.\nIn short, I highly recommend taking this Stats class--if you take it with Madigan. I have heard that other professors teaching the same course just don't compare.\n\nWorkload:\nWeekly homeworks (you can miss two, I think, or have your lowest two scores dropped), 3 or 4 mini projects which were pretty manageable, midterm and final (a one page, double sided sheet of notes and the text book were permitted for both the midterm and final. Exam materials mostly come from the book. The final and midterm both took less than 75 minutes. \n"
        }
    ]
}