{
    "prof_info": [
        {
            "prof_name": "Carol Rounds",
            "prof_id": 1695,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Descriptive Grammar- Hungarian",
            "review_date": "July 30, 2015",
            "review_content": "\nI would recommend this class, but with caution. \nThe clear bright side is that Carol Rounds is an awesome professor. She explain hard concepts (all of which border on grammatical witchcraft) in Hungarian well, although the inherent difficultly of Hungarian grammar makes this a difficult class at times. \nI would immediately recommend this to any person in Carol's Hungarian language classes, as it's good review of what you've covered and good prep for what your about to see. (I saw the past tense in this class before I saw it in Elementary II.) \nFor all others, it's going to take you a lot of review of her packets out of class to know what's going on. \nWorkload:\nAssignments due roughly every other class, once you understand what she wants they're not that bad. \nMidterm presentation- comparison of Hungarian grammatical structure of choice with another language. \nFinal, which was sort of a homework on steroids. \n"
        },
        {
            "course_name": "Elementary Hungarian I",
            "review_date": "April 04, 2014",
            "review_content": "\nProfessor Rounds is an absolutely top notch language teacher. Not only is she a great teacher, but she is a preeminent expert in Hungarian grammar, and is also quite knowledgeable about its history and culture. You couldn't ask for better. I have studied French and Spanish before with various teachers, and while I definitely have had some good (and not-so-great) language teachers in the past, Carol Rounds is by far the most adept at teaching language in an intuitive and engaging manner.\nI am taking Hungarian as part of the separate language requirement for the Linguistics special major, but this semester the other three students in the class have previous experience with Hungarian (from their Hungarian parents, etc.). Even with this mixture of backgrounds and differing levels prior experience, the class runs pretty much seamlessly. What I really love about her class is the intuitive way each lesson builds upon the last. Hungarian has quite a few aspects that can be confusing to the English speaker at first (cases, grammatical agreement depending on the definiteness/indefiniteness of the direct object, etc.) but Professor Rounds introduces them in a stepwise manner that ensures you have mastered the basis of each grammatical concept before moving on to grammar that builds upon those concepts. From the perspective of a linguistics major, this is especially satisfying (because really, at a university level, a language professor is pretty much useless if they don't have an understanding of exactly how and why the grammar works the way it does--- we've reached the age where our language learning faculty is pretty dried out, and we really need to learn those rules explicitly... we're not going to soak them all up through immersion!).\nThis being said, the class is by no means one giant grammar lesson. It isn't unfriendly to people with non-linguistics backgrounds, but if you ARE interested in learning more about the minutiae of the grammar, she can answer pretty much any and all of your questions---she's written pretty much the most authoritative grammar of the Hungarian language that exists today. She also will occasionally remark on grammatical features of the language that are unusual or interesting.\nClass time is mostly spent conversing, and since the sections tend to be pretty small (the class was 5 students including me Fall 2013 for Elementary I, and 4 students Spring 2014 for Elementary II), you get to know your classmates rather well and become very comfortable conversing with them. Professor Rounds devises in-class conversational exercises that are just repetitive enough to help you learn concepts thoroughly, but not so repetitive that they are boring. She stays on topic, with occasional interesting digressions about Hungarian culture.\nAll in all, this is a great class for anyone interested in having a fluid and fun language learning experience, and especially good for Linguistics majors looking to study a language with an interesting grammar with a professor who knows it inside and out. I can't speak for the heritage speakers, but it seems to me that Professor Rounds's approach to teaching grammar would be helpful for someone who has a strong basis in vocabulary but never received formal education on the grammar. As a bonus for people with busy schedules, the class meets only twice a week, and the workload is quite reasonable (and not busy work---you're practicing new skills with each assignment, and it isn't really difficult. Just challenging enough. Goldilocks style.) She wrote the textbook, which is modestly priced on Amazon, so she knows the lessons inside and out and has plenty of supplementary material to enhance it. She requires you use the CD that comes with the book but if you don't want to shell out and buy it you can just borrow the CD that she has and upload it to your iTunes (that's what I did). She's very accommodating and helpful in general.\nShe really deserves a gold nugget! One of the best teachers I've had at Columbia and definitely the best language professor I've ever had. If you like languages, you should take this class! If you have any questions she is very open to meeting with potential students, and can help people who already have experience with Hungarian determine what level of her course to take.\nWorkload:\nClass meets for two hours twice a week. There are exercises due at each meeting of class; they are based on the textbook reading which comes in the format of a dialogue or text in Hungarian with a glossary of vocab and a grammatical lesson after each Hungarian section. The exercises can include questions in Hungarian about the text, sentences in English that you must translate into Hungarian, exercises on conjugating verbs or using various grammatical features from the lesson. Occasionally we'll be assigned a free-write exercise to practice using, for example, time expressions to describe what we did this week. Pretty standard stuff.\nTwo sets of exercises per week (as described above). Each can take from 20 minutes to an hour if it's a long one, but they tend to be shorter. Occasional quizzes on conjugations, chapter quizzes for some (but not all) off the chapters, a midterm, and a final. She is explicit about what we will have to know, both vocab- and grammar-wise for all the exams, and grades generously. This class has a pretty light workload but you learn a lot because she has streamlined the exercises so you are practicing things just the right amount.\n"
        },
        {
            "course_name": "Elementary Hungarian I",
            "review_date": "February 07, 2005",
            "review_content": "\n*The best foreign language instruction I've ever received*\nCarol is knowledgeable, accomodating, and very passionate about Hungary and its native tongue. As the previous reviewer mentioned, the class tends to be very small, and the individual attention means much more speaking time in-class than is typical of foreign language courses. This semester she has gone out of her way (taking obscenely early trains from Jersey) to meet at a time when all interested students from last semester were conflict-free. Plus, hey, she wrote the book (literally, she authored the text), and her grammatical explanations are extremely digestable. If you're looking for incredible instruction in one of Europe's oldest languages, take Hungarian with Carol Rounds.\nWorkload:\nA few quizzes (i.e. chapter tests), midterm and final\n"
        },
        {
            "course_name": "Elementary Hungarian I",
            "review_date": "January 03, 2005",
            "review_content": "\nCarol is friendly, approachable, responsive, talented, and a wonderful teacher.  Because very few people are interested in taking Hungarian, the classes are small and thus very personal.  You get to know Carol and your classmates pretty well.  For nearly individual instruction learning a very interesting language, this course is exceptional, and Carol is wonderful.\nWorkload:\nWorksheets and exercises due every class (twice a week).  Two quizzes (moderately easy), 1 midterm (moderate), and 1 final (harder, because you learn so much during the semester and have to put it all together).\n"
        },
        {
            "course_name": "intensive elementary hungarian I and II",
            "review_date": "July 23, 2003",
            "review_content": "\ncarol is the most wonderful instructor i have ever had at columbia. she says elementary hungarian is her favorite class to teach, and it shows. she has such a love for the language, which she passes on, and she presents all the lessons so that the language seems logical and sensible. she has more patience than anyone i've ever known, and doesn't mind if you keep making the same mistake -- she'll gently remind you every time. she's always enthusiastic, cheerful, encouraging, and energetic despite a 2-hour commute to a 9 a.m. class. and she's been teaching hungarian for years and years, so she knows the best way to explain every grammar point, knows what will trip students up, and isn't surprised when you don't catch on for another 2 weeks. hungarian may be a hard language but i wouldn't know -- in this class, i just thought it was fun.\nWorkload:\none or two hours a night of studying and homework. \n"
        }
    ]
}