{
    "prof_info": [
        {
            "prof_name": "Satyajit Bose",
            "prof_id": 3069,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Economic and Financial Methods for Sustainable Development",
            "review_date": "March 29, 2014",
            "review_content": "\nThis was an amazing class. Professor Bose is extremely knowledgable about the subject matter. His PhD was on the economics of global warming. Back then people thought he was wasting his time. He worked on Wall Street for a while and then Columbia wooed him back after it appeared this whole climate change thing might have some merit. \nHe's continually behind in his lectures, but that's because he loves to engage in discussions and would rather discuss an interesting topic at length rather than force feed you facts and formulas. He is good in that he challenges everyone's thoughts and opinions, but is also very encouraging. He's also very funny and makes the material interesting.\nHe's also extremely approachable and not at all intimidating. He encourages students to go to Earth Institute events and is happy to talk with students outside of the class about anything - economics, what the hell to do after graduation, etc. I've kept in touch with him since the class and he's continually helped me out with my academic/career endeavors.\nThe class itself covers a lot of interesting subjects. He goes over some of the basic economics of the environment first. If you've taken principles you'll be fine. Then he teaches some basic finance. After that you talk about cost-benefit analyses, game theory, green accounting, macroeconomic models, etc. that all relate to sustainable development. Very interesting and a good introduction to some practical skills.\nIn terms of grading, the midterm and final project were graded extremely fairly. The problem sets were graded more harshly, but he curves grades at the end of the course. Participation counts, but it's not a big deal. I normally don't like to participate, but you won't feel intimidated at all and it's easy to engage with the subject matter. \nIt's also nice that the bulk of the work is done in the first half of the semester. There are no problem sets after the midterm. Just a group project, which was really interesting. You get to choose from a list of topics and I think he creates the topics based on what everyone seems to be interested in.\nWorkload:\n3 Discussion posts on courseworks\n4 problem sets before the midterm\nMidterm\nFinal Project\n"
        },
        {
            "course_name": "Economics of Sustainability Management",
            "review_date": "September 13, 2011",
            "review_content": "\nI took Professor Bose's Economics of Sustainability Management class in the first semester he was teaching, Fall 2010. Professor Bose cared a great deal about his students and had consistently made himself available in office hours. It is a challenge to teach economics to students with a great range of background in the area and I think as the semster progressed, Bose improved in his style. From other students who had taken his class in the following semester it seems that he continues to just get better. I thoroughly enjoyed the class  - but I did find group problem sets somewhat difficult. The problem sets themselve are difficult, but also working in large groups to agree on a single answer for each question was a challenge. I think it would be better if you could work on your own problem set but then meet in groups / with friends to help each other out. Regardless, the problem sets were very helpful towards studying for the midterm - which was harder than expected, but overall I think it was fair. The group project at the end of class was a great experience and an effective means of incorporating the principles of economics learned in the semester with the real life issues of sustainability being studied. \nWorkload:\nA lot of readings, only some of them were helpful. I would recommend skimming. The problem sets are tough, but they are in groups - so it is up to you to make sure you understand the problems and are not relying on others. This is generally time consuming to coordinate the answers. There is also a midterm and then a group project: presentation and paper for the final. \n"
        },
        {
            "course_name": "Microeconomics and Policy Analysis",
            "review_date": "December 20, 2006",
            "review_content": "\nApparently, this was his first time teaching since getting his Ph.D. and leaving the private sector.  An extremely nice man, very genuine, and really wants the students to get it.  Having said that, he needs a lot of work.  Granted, it was a large class of 50, but he never really grasped how far behind him we were.  The mid-term results were a shock for him and the students.  The second half of the semester was much improved: let's hope the trend continues.\nWorkload:\nHeavy\n"
        }
    ]
}