{
    "prof_info": [
        {
            "prof_name": "Vishal Misra",
            "prof_id": 2089,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Computer Networks",
            "review_date": "January 04, 2014",
            "review_content": "\nThe lectures were not very interesting, and I think those 60 students who seldom showed up in class would agree with me on this. But Professor Misra was really a nice guy and he was very patient to answer every question in class. The workload was okay, though the programming assignments could be time consuming, but Professor Misra was always considerate enough to give extensions due to popular request. Plus, you have 3 late days, which really came in handy when you were overwhelmed by the crazy workload of some other course. \nWorkload:\n3 programming assignments(20%). Can be very time consuming, if you have no prior experience in socket programming and multi-thread programming. But you did learn a lot from those assignments.\n4 written homewok(20%). Relatively easy. And there will be an extra makeup written homework for students who might fail the course.\n\n1 midterm(25%). Hard, way harder than the sample midterm. \n1 final(35%) Not as hard as the midterm, about the same difficulty as the sample final.\nThe midterm and final were open book, you could also bring your laptops/tablets. The exam problems were like those homework problems in the textbook, which required you to apply what you had learned to solve real world problems.\n"
        },
        {
            "course_name": "Programming Languages and Translators",
            "review_date": "May 20, 2008",
            "review_content": "\nOverall a good class. Good programming assignments, some of the written hw questions can be vague. Class lectures were alright but were unfortunately scheduled to start at 9:10AM, so I missed most of them.\nExams were not problematic if you knew your stuff, which you would if you could do the homework.\nOn a side note, I was able to use this class to get quite a nice bit of experience doing multithreaded programming. That was pretty nice.\nWorkload:\n2-3 Programming Assignments (Time Consuming), 4-5 Written HW (easy enough), midterm, final\n"
        },
        {
            "course_name": "Computer Networks",
            "review_date": "January 06, 2008",
            "review_content": "\nLike swimming through Jello. Bad lectures, good programming assignments, bad written homeworks, unbelievable exams.\nIt's not that the exams were hard. They were open book. But even if you knew ALL the material, you couldn't really do well on the exams. Or the written homeworks. I don't think anyone knew the right answers, because the questions were vague and were graded vaguely to boot.\nWorkload:\nFair: Three reasonable-difficulty programming assignments, five short written assignments, open book exams.\n"
        },
        {
            "course_name": "Information Theory",
            "review_date": "May 15, 2006",
            "review_content": "\nInformation theory is an interesting subject, but the professor has some trouble presenting it. He taught directly from the Cover and Thomas textbook, but assigned a different textbook for us, which didn't cover the same material, and organized it differently where there was overlap. The lectures were hard to follow, and there was no text to refer to (Unless you had cover and thomas)\n\nWorkload:\nA few easy problemsets, a longer problemset given as a take home final.\n"
        },
        {
            "course_name": "Information Theory",
            "review_date": "May 14, 2004",
            "review_content": "\nPretty Good Professor.  Also, the course is very interesting.  He explains things clearly.  However, he usually explains things exactly as they are in the text, and doesn't really go out of his way to make them interesting.  He is very good in interacting with students however, and makes himself very available outside of class.  \nWorkload:\n5 Homeworks, all challenging, some harder than others (some will take 6-7 hours, a few will take 15-20 hours).  A take-home exam, about as difficult as a homework.\n"
        }
    ]
}