{
    "prof_info": [
        {
            "prof_name": "Elise Giuliano",
            "prof_id": 6706,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 17, 2011",
            "review_content": "\nInternational Politics is a great intro class, and I would highly recommend taking the course with Professor Giuliano. Essentially, you really don't need to do the readings for this course (but if you do, she sends out guided questions to help you hone in on the relevant material). I probably did the readings twice the entire semester and got an A-. Having a background in world history is extremely helpful, as the second half of the semester mainly focused on applying the theory you learn at the beginning to real situations.\nGiuliano does a great job summarizing the readings in her lecture, so if you only do the readings and don't go to lecture or vice versa, you should be fine for the class. My TA, Seung Jee, was nice, but the discussion section had a TON of people and wasn't very helpful at all. She contributed a lot of supplemental information that we weren't tested on - it was interesting, but not very helpful on the quiz/midterm/final.\nGiuliano's lectures became more interesting farther into the semester (especially when we were talking about her areas of focus).\nWorkload:\nA couple of readings a lecture (but you really don't need to do them), quiz/midterm/final, discussion section - easy peasy.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 05, 2011",
            "review_content": "\n I highly recommend this course to anyone who needs to fulfill a political science requirement or who wants a broad understanding about how states function on an international level. \n  The lectures themselves were pretty boring. Giuliano is a soft spoken professor who really cares about the subject matter, but she certainly isn't very entertaining. The topics, for the most part, were very interesting. The first part of the semester is spent discussing international theory--Kant, Machiavelli, Hobbes, etc. Following the first quiz and midterm we focus more on larger issue areas, such as WMDs, Genocide, War Tactics, and Humanitarian efforts. \n  What makes this course great are the discussion sections. People generally dislike section since it takes up extra time, but mine were fantastic. I'm not sure if Liya Yu is a TA for this course again, but she is brilliant. Take discussion section with her if at all possible. She truly cares about all of her students, she's brilliant, and she always brings a new, relevant, and fascinating angle to lectures. Best of all, she was MUCH more interesting than Giuliano. \n   Over all, discussion section was fantastic, lectures were pretty boring, and the topics were interesting. \nWorkload:\nEasy, but interesting reading assignments. Readings for the week usually took me between 20 minutes-1 hr. 1 easy id quiz a few weeks into the semester. Easy midterm, and a harder final. Participation during section also factors into the overall grade. Just a warning about Giuliano: her tests are LONG. Make sure to pace yourself during the essays/short answers or you might run out of time. \n"
        },
        {
            "course_name": "Russia and the West",
            "review_date": "November 23, 2010",
            "review_content": "\nI took Professor Giuliano for \"International Politics\" in Fall 2009.   She is amazing!  I liked her so much I took another class the following semester (Russia and the West).  She is easy to talk with, answers questions thoroughly, and I LOVED her lectures.  It was like watching the Biography Channel---easy to digest and entertaining.  I looked forward to her lectures.  I learned a lot about International Politics (and Soviet Russia the following semester).  \nThe other reviewers shredded her to pieces.  I don't get why.  Barnard is pretty lucky to have her.  (She looks just like actress Julia Ormond in \"Sabrina.\")\nWorkload:\nTake good notes---that's what will carry you through the midterm and final.  No paper.  Lots of terminology and identifications---go to every discussion section for clarification.  Readings are moderate (nothing to sweat over).  She covers the reading assignments in lecture.  \n\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "September 07, 2010",
            "review_content": "\nWow. What a disappointment. Not much work, teaches it like its HS, and final grades are surprisingly harsh. Attendance def dropped below 50% by the second lecture. It becomes a note sharing frenzy by the end. \nShe leaves so much on the TAs its ridiculous. The TA Ryan was 10 times better than her at teaching. Really a waste of time and I wish I could have taken it with Jervis. Boooooo!\nBUT, She is kinda hot in a secretary kinda way. \n\nWorkload:\nMore than you are gonna want to do...midterm, final, yadda yadda\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 14, 2010",
            "review_content": "\nShe looks and sounds like a World Civ teacher I had in HS mixed with a secretary you'd find at a doctors office. Her lectures were nothing profound and pretty boring. The whole class was sitting on laptops the whole time. The readings start out easy and get progressively longer as the class moves on. She constantly repeats herself and when you study you'll see the same things in youre notes over and over. Also there is a ton of information to study for this class... A TON but typical of a poli sci into class. Really a bad experience for me (except my TA Ryan who was amazing)\nShe is really nothing special. Her voice will def get on your nerves. I would not recommend her if you are looking to be challenged academically (I am not saying its easy just that its tedious BS memorization)\nWorkload:\nmidterm, quiz, final\nthe final took full 3+hours wanted to kill myself.  I did not do as well as i would have liked but I dont care just happy to be done with that class\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "February 16, 2010",
            "review_content": "\nI had Professor Giuliano for International Politics and I was overall pretty happy with the class.  Yes, she's not the most stimulating lecturer, and she didn't have any powerpoints so she just read off her notes, but she did manage to get the concepts across well.  The classes are basically a summarizing of the readings assigned for that week, so if you go to class, there's not a huge need to do the readings.  I did though, since I found them to be both interesting and useful.  The reading isn't bad at all (maybe three articles for every lecture), and if you have the time I suggest you do them since they'll help you participate better in discussion section, and do better on the exams.  \nI feel like I really walked away from this class with a good grasp of what international relations was all about.  The first half of the course focused more on concepts (realism, constructivism, etc) with the second half applying those concepts to real world situations (political economy, Islam, terorism, etc).  \nOverall, I would recommend her if you're looking for a straightforward international relations intro class.  \nWorkload:\nThe class didn't have any essays which was nice.  There was one in-class midterm, and in-class final, and a quiz (which I didn't like since it was 25 minutes and worth 15% of your grade, and you are basically just given a list of terms to memorize - some of the TAs are quite harsh in grading it too).  Discussion section was mandatory and counted for your grade.\n"
        }
    ]
}