{
    "prof_info": [
        {
            "prof_name": "Li Qi",
            "prof_id": 2588,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "East Asia's Dynamic Economies",
            "review_date": "September 04, 2005",
            "review_content": "\nI didn't think the class was that hard, but I did learn A LOT from it.  The information was presented in a way that was interesting and easy to understand.  I really really enjoyed the class.  I took a lot of EALAC classes before and not take as much away from them as this one.  The reason being that she does not overdo it with the information presented in the lectures or in the reading assignments.  It was  one of the few classes that I did all the work because there really wasn't too much of it.  I definitely recommend the class and the prof.  She is a great professor and very easy to talk to.\nWorkload:\nNot much at all.  1 midterm, 1 final, 1 group project/paper, and 4 quizzes.  About 200 pages of course work reading for the whole class, in addition to any reading you need to do for the group project.   \n"
        },
        {
            "course_name": "East Asia's Dynamic Economies",
            "review_date": "July 10, 2005",
            "review_content": "\nThe course is full of excellent material which Li Qi attempts to present in a very clear and organized manner.  She complements the material with occasional film clips, charts, graphs, and pictures.  However, what one quickly realizes is that Li Qi is quite possibly the most boring lecturer in the world.  She stands in front of the class asking questions throughout her monologue, with no intention of students answering them.  They are retorical questions not asked in the correct manner.  She then goes on and on by herself lecturing and writing and lecturing and writing.\nOverall, if you do the reading, which no one does, you can do quite well.  She gives out a teacher evaluation for the midterm, so she gives a ton of extra credit, and the test is simple.  The final was just a compilation of all of the quizes.\nWorkload:\nVery little homework.  Piece of cake midterm and a pretty easy final as well.  The paper topic is hyped up for months, is really easy, but the grading is questionable.  Since the tests have right and wrong answers, this proves to be the only subjective aspect of the course.\nParticipation (sign in 10 times) 10%\nMidterm 20%\nQuizes (top 3 out of 4) 10%\nPaper 30%\nFinal 30%\n"
        }
    ]
}