{
    "prof_info": [
        {
            "prof_name": "Jay Sethuraman",
            "prof_id": 2026,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Operations Research in Public Policy",
            "review_date": "August 21, 2016",
            "review_content": "\nThe subject matter in this class is incredibly interesting, however, the execution is quite poor. The course consists of reading an OR research paper for each class. The research topics are pretty cool, like apportionment, OR in homeland security, hospital ER rooms, etc. The class is broken down into groups, and each lecture, one group will teach the whole class by summarizing and explaining the findings of a paper. Students not presenting are supposed to have read the papers ahead of time, but since it's not enforced, typically nobody reads the papers and nobody pays attention to the lecture either. Jay did lecture the first few classes, which were probably the best classes of the semester and people actually paid attention to. \nI personally was part of the 10% of the class that actually read papers ahead of time and paid attention during lectures so I felt that I got something out of the class. However, the other 90% of people simply were on their phones the entire class (if they even chose to show up). It's quite disheartening to look around and see pretty much no one paying attention in class. I think Jay is restructuring the class soon (hopefully). Overall, very easy class with potential to be very interesting. You get out of it what you put in. Please don't be part of the majority of people who are disrespectful and pay zero attention in class.\nWorkload:\nLight\n"
        },
        {
            "course_name": "GAME THEORIC MODELS OF OPERATIONS",
            "review_date": "August 16, 2016",
            "review_content": "\nJay’s Game Theory course was intense but very rewarding. Beware of getting comfortable in this class. The first 3 weeks are fairly straightforward, as it takes some time to shift from the traditional OR mindset to a game theory mindset. However, homework quickly got complex and tough. \nThe class is split into two parts. The first ¾ of the class is on game theory (which is split into 4 sections) and the last segment is on auction theory. While game theory is somewhat nuanced and difficult, Jay does a good job of elucidating the important concepts in class, and providing examples. The homework in this part of the class becomes tough because of the jump from the classroom examples to the homework. For example, in the classroom, we would find a Nash Equilibrium when each player has a finite number of options, whereas on homework, we were asked to do this when the players had unaccountably many options. He would give hints on how to do this, but you would really have to make sure you understood the concepts in the classroom example, and then use some different math to account for the jump from discrete to continuous. As usual, Jay is very dedicated in his office hours, as is his TA Irene, and that means there was plenty of help. Jay also records his lectures which is very helpful when tackling homework. It is important to look at the homework as soon as it is released, as you will need time to ponder the problems, get stuck, etc. The problem sets were definitely hard and long but if you work your way through them you really understand the material, and you are ready to tackle his notoriously difficult exams, which are similar in style to his other courses. \nThe auction theory portion of the class was rough. Jay was sometimes unprepared, and the material is significantly more confusing than game theory. The combination led to a large amount of confusion. When you combine this with the fact that some differential equations got thrown in, people were quite disheartened. Jay is planning on re-doing this portion of the course based on the experience with our class, but whenever you get to auction theory, make sure to strap yourself in, because there are lots of things to wrap your head around, and the provided textbook isn’t the most useful, though it is nice to use on occasion. \nIgnoring the auction theory part of the course, the class was difficult, yet interesting, challenging, and illuminating. It is also extremely useful because it forces you to approach problems in a way that differs greatly from the traditional OR mindset, and that in and of itself is extremely useful and much more applicable from a job point of view. The class average is generally quite terrible as seniors don’t like to show up to a Monday morning class, so that helps in terms of grading.\n\nWorkload:\nWeekly Problem Sets (start easy, but then they get long, especially if you try and do them without just copying from office hours)\n1 Midterm (moderately difficult)\n1 Final Paper (easy)\n1 Final Exam (difficult)\nStart the homework early each week!\n\n"
        },
        {
            "course_name": "Mathematical Programming",
            "review_date": "January 04, 2015",
            "review_content": "\nI honestly don't understand the poor reviews of this professor. Perhaps he was not good at teaching other classes but, as far as the undergraduate version of Math Programming is concerned, he was one of the best teachers I have had. \nProfessor Sethuraman is very good and providing the conceptual/economic explanation for the math that you do in this class, and he goes to great lengths to ensure that you understand this base intuition. This is extremely valuable in a class that would otherwise seem to be a class where one blindly applies algorithms. Jay realizes that computers can do the ugly computations nowadays, and so, rather than spending time on 9x9 matrices, we only do small computation to get an idea for how a specific algorithm works, and then we spend lots of time discussing the underlying methodology of an algorithm, situation in which it might no work, and what certain states of the algorithm can tell us. \nWhile Jay is not a ball of energy in the room, he has his own personality that makes class enjoyable, and he does a good job of raising interesting questions about the material that make you think about the nuances or corner cases of the algorithms. \nUnlike most professors, Jay appears to understand his students. He can tell when his students are confused and is willing to repeat a concept or explain it in a different manner if students don't get it. He also understands student questions quite well, and welcomes them in lecture, which makes it easier to pay attention, and makes the material clearer. I think a great example of Jay's dedication to his students is the way he approached the final exam. In his office hours, Jay asked his students what they thought the best way to administer the final exam would be, given certain guidelines. While he originally was not going to allow a formula sheet, after he asked his student, he decided to allow a formula sheet in order to allow us to spend time studying the concepts rather than memorizing formulas. The fact that he took time to think about his students needs and discuss the exam structure with them speaks for itself. \nAnother example of how he understands his students: In one class, after students complained they couldn't see the board due to dying markers, Jay attempted to switch markers. Upon discovering that every marker was dying, he paused class and sprinted to his office to grab a new set to ensure that students in the back could see for the rest of lecture. There are many other examples of his dedication, but I'll leave them out for the sake of space.\nDespite what I've said, this class isn't a walk in the park. It's not killer, but it's not a breeze. Even after paying attention in class and skimming the textbook, one might need to think about the homework questions for a bit (depending on the assignment), which is how I think it should be. His exams are fair, but are not easy. I would qualify them as moderate or moderately difficult. He will never pull something out of thin air. If you don't know how to solve a problem, you will at least walk out of the test knowing it was a fair question (this happened to many people on the final). His practice exams are fairly on par with the difficulty of his midterms, but the final is more difficult than the midterms, so it is important to understand the concepts underlying the algorithms. If you understand everything in your notes, you will be set for the final.\nLong story short, if you actually pay attention in class instead of going on social media, and you put in a bit of time outside the classroom, you should be able to master this material. People who claimed that some final exam problems were unfair were, in my opinion, unjustified in their claims, since every problem came from concepts that were emphasized multiple times in his notes, lectures, and slides. Overall this is a great class, with a great professor. If you don't like this class, IEOR is probably not your jam. \nWorkload:\n9 Homeworks. 3-4 hours each, occasionally 5. All fair. (1 equivalent total)\n2 Midterms. (1 equivalent each)\nFinal (2 equivalents)\nThe top 4 equivalents constitute your grade. Curve seems to be a high B+, not 100% sure. \n"
        },
        {
            "course_name": "Intro to OR: Deterministic Models",
            "review_date": "December 27, 2010",
            "review_content": "\nThis is a tricky review to write. The material is interesting no doubt, but I agree that it is made to look harder than it is. Sethuraman is not terrible. He's just ordinary. Monotonic, repetitive, and not very organized. He's a nice chap, no doubt, and is said to be helpful in his office hours, but you take a class for the in-class experience, and at 9:10am, I didn't have a very pleasurable one. He often fumbles while explaining concepts, and averts questions by saying \"he'll get back to it later,\" without ever doing so. The material could have been taught in a much better way, and his TA Tulia did a great job in doing so. Assignments are fairly arduous. And exams are fairly tricky as well. Mean on the final was around 60%, and that on the final was around 50%. The class was not as smart as it should have been though, and so it's not impossible to do well. \nTo sum it up, he's not as bad as other reviews suggest, but definitely could have been clearer.\n\nWorkload:\nQuite a pain. Weekly assignments that take 3-4 hours at least. Open book midterm and final. The weightage of the exams and homework was undisclosed, so make sure you don't slack on the homework. \n"
        },
        {
            "course_name": "Intro to OR: Deterministic Models",
            "review_date": "December 23, 2010",
            "review_content": "\nAVOID AT ALL COSTS IF YOU CAN. ONE OF THE WORST PROFESSORS YOU WILL EVER ENCOUNTER. Jay is definitely a smart man and a distinguished scholar from MIT. But he lives in his own world and this will drive you insane if you take his class. He thinks everyone has the same aptitude for understanding the subject matter as MIT Phds. He is also socially inept and as such often confuses teaching effectively with trying to quiz and fool the class. He will often leave questions unanswered just so he can test the material. Confusion is part of the syllabus in that there is no consistency in textbook, or notes, or where the homework is assigned from. If you want to feel a little crazy by all means take this class. Jay is very disorganized. BEWARE. \nWorkload:\nHeavy not difficult but made very difficult because of the confusion. \n"
        },
        {
            "course_name": "Intro to OR: Deterministic Models",
            "review_date": "March 11, 2009",
            "review_content": "\nI read the other reviews, but I took this class in 2008 and really enjoyed it.  Professor Sethuraman seemed very well prepared for class, and although some examples were more theoretical these were not the basis of the course.\nI was afraid of taking a class from this professor based on the reviews, but I'm glad that I did (besides, the class is required anyway).\nWorkload:\nReasonable- you need to work for an A.\n"
        },
        {
            "course_name": "Production Scheduling",
            "review_date": "July 21, 2006",
            "review_content": "\nWe basically didn't cover all the material we were supposed to cover because nobody understood the material. After giving the midterm which 90% of the class bombed, he gave a second midterm on the SAME material. I guess that does show that he's concerned with having us actaully learn the material. We lost two weeks and subsequently cut two chapters out of the course, rehashing the material covered in the first midterm. Performance was much improved as the test was less conceptual and more quantitative. We skipped three lectures and never made any of them up on top of the two weeks worth of review for the second midterm. One entire lecture was spent have the class bitch about how difficult the midterms were and how we should approach the final. He just didn't seem to care about the class at all and curved very generously (course was mostly seniors). I walked away with an A.\nWorkload:\nWeekly problem sets which are difficult but solutions are easily found online. There was a project element that we also cut from the class. Final was easy (perhaps because it was abbreviated). There WILL be proofs.\n"
        },
        {
            "course_name": "Production Planning",
            "review_date": "June 27, 2004",
            "review_content": "\nYeah this course is pretty awful but because everyone does poorly in it its not too hard to get a decent grade in it, honestly.  The course material actually is pretty interesting but the lectures were just too basic and would simply skim the material whereas the homework and tests were VERY VERY HARD and you were lucky to receive any points on the homeworks.  It just doesn't make sense that the homework solutions don't even follow the methods in the book or methods given from the lecture.  The book is so worthless and the TA could barely do problems from the book.  The solutions to these damn problems were solutions that you'd have to have your phd in IEOR to be able to conjure up.  But everyone does poorly, honestly even the smart kids, so just go to every lecture and get all you can out of it and get through it.\nWorkload:\nhomeworks are hard but don't spend too much time on them becuase it really is impossible to get the answers to some of the problems.  midterms and final aren't too hard.  there are a couple gimmees on the tests but the other problems are very very very very hard so just know the basic formulas and you can get the mean grade.\n"
        },
        {
            "course_name": "Production Planning",
            "review_date": "May 15, 2004",
            "review_content": "\nThis guy is awful. This course is awful. The book is awful.  The TA is horrendous.\nThe tragedy lies in the fact that this is a required course for IEOR majors and so you will  most probably be stuck with this guy. I will try my best to describe and justify my opinion of this class but let me just say that nothing compares to the actual experience of being in the class. At the most basic level, this class is incredibly inconsistent. Methods/variables used in lecture rarely match up with those in the text book and the recitation is completely useless (other than the fact that it is where you hand in your hw, but don't worry one of your friends can just drop it off for you), as the TA skips dozens of intermediate steps and is barely comprehensible. Also, the \"lectures\" page on Sethuraman's website contains little more than a list of the dates class was held and a vague 1 or 2 word \"description\", so don't let those e-mails about how the \"lectures page was updated\" fool you. That doesn't mean anything. \nAnd now for the book. My god, what a useless resource. Most of the crucial topics have little in the way of examples and unless you are willing to hit up the Mudd library stacks to find some obscure paper written by Goofus and Gumpus (1971), the book will be of very little help. \nLet this review not deter you. Being in SEAS you should probably be ready for this level of mediocrity and just consider it a rite of passage. Stumble out of it with your C and just be thankful you get to take Managerial Behavior and Corporate Finance your senior year. \nWorkload:\nuhh...2 midterms (both hard) , problem sets every week that are ridiculous, and a final (also hard)\n"
        },
        {
            "course_name": "Intro to OR: Deterministic Models",
            "review_date": "April 12, 2004",
            "review_content": "\nA very smart professor who thinks that everyone in his class should be as smart as him. After all, he's from MIT, and he has yet to realize that Columbia is no MIT!!! He tends to waste too much time dwelling too deep into a topic, leaving half the class lost.  He comes to class, coffee in hand, but unprepared and gives impromptu lectures, writing stuff on the board as it comes to his head. He may seem organised and present to you an impressive timeline on the first day. However, don't trust him to follow the schedule nor the syllabus, as he will soon dwell too much into a topic and fall miserably behind time. \nWorkload:\nWeekly homework which is very tedious and hard. Midterm and final exams are killers. The textbook is ok, but don't expect him to faithfully follow the textbook!\n"
        }
    ]
}