{
    "prof_info": [
        {
            "prof_name": "Bettina Gramlich-Oka",
            "prof_id": 4415,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium on Major Texts - East Asia",
            "review_date": "January 04, 2009",
            "review_content": "\nBGO is new to Columbia, but her decades elsewhere - God knows where - seem to have given her a head start in the qualities - pedanticism, decrepitude, boredom, condescension and laissez-faire superiority when everyone seems to care as little as she does - required to teach this class.  I didn't do ninety percent of the reading.  Hardly anyone else did, either, but you had to participate - it was the main part of your grade - the result being that comments in class were alternately half-witted attempts to sound smart, or smart attempts to sound half-witted.  The brutal irony of the entire ordeal was that BGO herself hardly participated.  When a seminar stagnates, a teacher ought to intervene; when a seminar is stagnant for the better part of fifteen weeks, a teacher ought to re-evaluate her entire approach; BGO did neither, forging idiotically ahead into uncharted waters with her annoying and unsupportive TA in tow.\nThis name probably came up because you were looking for some way to fulfill your major cultures requirement - or whatever the hell it's called today, Global Core or somesuch.  If you must take this class, with its staggeringly thick array of boring books, take it with someone else, but be forewarned that there are much better ways of getting this stuff out of the way (Latin American Literature with MacAdam comes to mind) that don't make you want to reach for the gin and crossword puzzles for two hours once a week.\n\nWorkload:\nInsurmountable amount of reading, epic weekly posts, two annoying papers where you're encouraged to be as dull and conservative as possible, oral presentation in lieu of a final that's easy only because everyone's expectations are so low.  Did I forget to mention the compulsory participation?  Do so at the danger of your grade.\n"
        }
    ]
}