{
    "prof_info": [
        {
            "prof_name": "Ralph Zito",
            "prof_id": 3193,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Acting Social Comedy",
            "review_date": "September 10, 2009",
            "review_content": "\nGreat, fun course.  Ralph knows his stuff, and is a great teacher: he can tailor his lessons to the individual experience/skill of each student in the class.  You'll learn a lot and enjoy it.\nWorkload:\nStudents will have one in-class rehearsal each week, and are expected to prepare (rehearse?) for these rehearsals liberally outside of class.  This can be a lot or a little, depending on how seriously you and your partners want to take your study of acting.\n"
        },
        {
            "course_name": "Acting Social Comedy",
            "review_date": "April 18, 2007",
            "review_content": "\nRalph Zito is awesome. He is funny and will help you be funny. Really, excellent actor training. Very knowledgeable and caring and good at teaching. He knows what to say to help you improve your craft.\nWorkload:\nRehearsing scenes with scene partners outside of class.\n"
        },
        {
            "course_name": "Acting Shakespeare",
            "review_date": "March 20, 2007",
            "review_content": "\nI took Ralph's class the first semester it was offered, and I felt honored to be under the tutelage of such a brilliant professor. Ralph is a visiting professor from Juilliard, and we are so lucky to have him here. His first semester was a little haphazardly organized - he was on a trip for three weeks, and tried to make it up to the class by scheduling weekend classes at Juilliard. We never got the chance to perform as many scenes as were on the syllabus, and very few people had the chance to perform their soliloquies, but I'm told that the organization has become better in later semesters. Ralph is excellent at close readings of Shakespeare - he'll have you go word by word through an entire scene, teaching you where to pause, when to breathe, and where to place emphasis for the meaning to come across. The class also helps you become comfortable with rehearsing in front of an audience (important skill). If you want to act Shakespeare, it would be difficult to find a better professor than Ralph Zito.\nWorkload:\nMemorization and performance of 3 scenes (could be different now), and memorization and performance of one monologue. You are expected to do the bulk of rehearsal outside of class with your scene-partner.\n"
        }
    ]
}