{
    "prof_info": [
        {
            "prof_name": "Jennifer Lena",
            "prof_id": 11193,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Culture in America",
            "review_date": "February 28, 2012",
            "review_content": "\nI am not one to write a review but I want to warn anyone who is thinking of taking Lena's class that it won't be super-hard but it will be weird and not entirely intellectually fulfilling. Lena's lectures are filled with nonsensical references, anecdotes and weird humor that I wouldn't mind on occasion, but hers don't drive the point home and two, are irrelevant and don't connect with the main theme/subject of the class. I was confused at what she was trying to teach most of the time. She jumps from one idea to another often and confusingly and I heard this from several students. Lena's weakness is that she is an average lecturer at best but what's worse is that she thinks she is amazing. This arrogance and her often weirdly defensive stance makes for a very sub-par class.\nSave yourself the weirdness and avoid her class. If you don't believe me, Google \"Jennifer Lena Vanderbilt\" and go to the \"Rate my Professor\" website and see her reviews from her previous university, Vanderbilt. Yes, not great at all. I wish I had done that before I took her class. \n\nWorkload:\nMid-term (fairly easy), Two Papers graded pretty harshly. Final paper that was I think 10 pages, double spaced.\n"
        },
        {
            "course_name": "Senior Research Thesis",
            "review_date": "December 02, 2011",
            "review_content": "\nI'm only writing this in response to the previous review. I've never written a CULPA review before, but I felt compelled to after reading this review.  I apologize if it seems defensive - I'm a little thrown back by all of these accusations in light of my own experience with Professor Lena. \nProfessor Lena is currently my thesis advisor, and let me tell you, she is absolutely nothing but a wonderful mentor.  Delivering quality material to her is not an incredibly hard task because she carefully outlines what is expected of her students at all times. I truly cannot imagine that Professor Lena taught her students something \"wrong\".  Take a look at her resume and educational accreditation. \nI do agree that sometimes what she says can be confusing, especially when you are talking about complex ideas.  But at this University, it is a requirement to think critically about what is being said to you and logically tie it into a comprehensive whole without having your hand held.  Whenever I took a few minutes or even an hour to really think about what she was saying to me I was able to successfully tie it all together, if you will.  Also, no professor wants to be told that they've said something they haven't. The more appropriate and professional way to approach that kind of situation is to come to her and ask her for clarification on the subject, not accuse her of saying something she probably didn't anyways. I learned that same lesson too (quite literally, the exact same one), and the fitting reaction would be to reflect on how you as a student handled the situation, rather than making really harsh accusations against Professor Lena.\nIf you don't actively pursue learning from her, and continue to ask questions, she's not going to drag it out of you. I think she believes, as do I, that you are responsible for owning your education (in a professional manner, no less).  If something is unclear, ask. If you have a question, ask. If you want help tying together the works, ask. And be professional and informed when you do so, otherwise it's offensive. \nMoreover, Professor Lena has written me literally PAGES worth of emails answering every question I've ever had - even the \"stupid\" ones - which communicates to me that she is incredibly dedicated to the success of her students.  She is nitpicky about meeting with her in person because she doesn't want her time to be wasted. Do you blame her?\nI can't speak to her other classes, but in this Thesis class, all the readings are carefully chosen and directly relevant to what we are doing. \nWorkload:\nThe work is a lot and your thesis will be difficult no matter what, but it's more than clear what she expects, which places the responsibility on the student. \n"
        },
        {
            "course_name": "Culture in America",
            "review_date": "November 02, 2011",
            "review_content": "\nThis professor is new (hopefully only visiting) as of the 2011-2012 school year so I'm writing this review a bit early for those who are/will be looking to take her classes in the spring semester. \nDon't do it. Really, save yourself the energy. \nI am so appalled by her teaching that this is the first time I've actually felt compelled to write a review on culpa to stop any prospectives from taking her class. \nProfessor Lena may seem attractive at first because she seems like another Shamus Khan. Knowledgeable but can communicate information through pop culture/world issues and humor. Wrong, so absolutely wrong. \nFor one, the information she gives, though correct, often feels misleading. At least when it came to studying some classical theorists that sociology majors are required to study in depth through another class called Social Theory. For example, she may lead you to believe that two thoughts that the theorist had were connected when they're not and she lets students leave with a very vague understanding of the theories rather than concrete understanding of their main points, argument and thought process. On top of that, while you might understand what she is trying to get at after each class, you will never understand how each class connects to the other classes until you go to her TAs (which results in meeting with TAs every week in addition to going to her class twice a week). I'm not the only one making complaints, apparently the TAs are swamped with meeting with students and the reasons are all the same. \nReadings feel completely irrelevant. For example, why would she give us Marx's Contribution to the Critique if her lecture was going to be on Marx's theory of alienation? (Not to mention that she only teaches three clauses to his theory even though there are four) I could go on about this part... The only way they would connect to her lectures and theories in class is if she explicitly talks about the articles in her lecture. More or less, though, they usually do not act as a good example for whatever theorist she's talking about (Ironically sometimes I felt as though the reading would connect better with other theorists).\nClasses become tedious and never go anywhere because she allows her students to ask any and ALL questions they have no matter how big the tangent is. While this can be good in some aspects, she never gets around to finishing her lectures and she never picks up from where she ended the next class. Hence, students being confused half the time.\nThe part that really irks me though, isn't her terrible teaching... it's her attitude. \nI once went to her about something that she said in class that seemed confusing in light of information that I was learning in another class. Instead of engaging in conversation with a student who was thinking critically about the material (alas, isn't that was college is aiming to get people to do?), she replied with something sassy and irrelevant about how she didn't say it but that a student said it and she said that it was correct (didn't realize the technicalities were so important but I obviously meant that she led us to understand) and then proceeded to tell me that I was wrong without an explanation to tell me how or why or a clarification of what the theorist meant. This becomes extra frustrating as I begin reading and studying that theorist's actual writings (rather than writings that are semi-aligned with his work) and find that I was right all along (confirmed by another professor).\nOther emails, even for logistical issues were dealt with nothing but contempt and sass. I wish I could copy and paste some of her responses her but that would be a breach of anonymity. Essentially, don't ever expect her to be helpful without a dose of defensive retort. \nGenerally if you ask a question of clarification in class, she has the tendency of responding to your question with another question that, not only doesn't answer or clarify anything, but only makes you feel stupid for asking for clarification in the first place. Yes, what you thought was humor when you first started in her class turns out to be just a lot of unhelpful guff. \nI fully understand that many professors are cocky but usually those are professors are the best at what they do, have a lot of knowledge to back up why your argument is incorrect and/or a noble prize or something of the sort. She has a book. One published book. Which leads me to believe that her high and mighty attitude is a little undeserved. \nWorkload:\nAbout 60 pages of painfully irrelevant readings before class, midterm (reading IDs and essay prompt which she gives you in advance), take home final and 12 page final research paper.\n"
        }
    ]
}