{
    "prof_info": [
        {
            "prof_name": "Emily Breault",
            "prof_id": 1939,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 24, 2007",
            "review_content": "\nThough cold calling is always unpleasant, she is a great instructor. Her approach to the material as a very technical one, and she akss for substance, not bs, out of her students. She is very engaging, and nice, and her awkward attempts at humor can come off as condescending, but are not mean spirited. You will learn and mostly enjoy during this class.\nHer museum visits are great.\nWorkload:\nstandard. 3 papers, midterm, final. light reading\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 17, 2007",
            "review_content": "\nGood course, Horrific instructor!!!     Be warned...This TA is overwhelmingly patronizing, egotistic, dogmatic and disinterested in what her students have to say...she seems at times to derive an almost perverted pleasure out of constantly cold calling students, and then condescendingly ignores any comment she deems unworthy, despite being inanely unsure and unsteady in her own knowledge base. She seems to consistently contradict herself and maintains virtually no clarity in her most confusing and convoluted lecture style. \n   I find it necessary to point out, for the benefit of fellow  Culpa readers, that I am not some bitter student crying about a poor grade: I did not even finish the course (I dropped the course at the last possible moment) despite finding the workload to be extraordinarily manageable and the material fairly graspable...I simply could not stand the insane tone she took with students and ultimately found no remote interest or compassion on her part in the endeavor of teaching itself, but rather an aggravation and annoyance with her students that gave me a pounding headache after each and every class!!!\n    If you get this instructor, I would highly recommend switching sections...her antics are, in my opinion, utterably inexcusable! \nWorkload:\nFairly standard for the Art Hum core component.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 25, 2006",
            "review_content": "\nI went into Art Hum expecting to absolutely hate the class, but it turned out to be one of my favorite ever at Columbia simply because of Emily. She is a very smart and caring instructor. She really wants everyone to learn and gain insight into the material she teaches. She demands respect but is oftentimes fun and sarcastic. If you're in her section for Art Hum, consider yourself lucky. Emily is fabulous. \nWorkload:\nTypical Art Hum; make sure you take advantage of her willingness to meet with you to discuss your paper during office hours.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 14, 2004",
            "review_content": "\nAw, loved her!  Emily was extremely nice and approachable.  She is very young, so the information is fresh to her.  Sometimes she's not sure about facts, in which case she tells you so, instead of making something up, like some teachers tend to do.  She was really insistent that our class bonded and took us out to the Hungarian pastry shop after visiting St. John the Divine.  We also had a movie night, where we watched the Thomas Crown Affair and snacked.  She is a relatively fair grader-- take advantage of her offers to look at drafts before they're due.  \nWorkload:\nAppropriate.  Midterm & final that involve major memorization, but are otherwise fine.  3 papers with good topics. \n"
        }
    ]
}