{
    "prof_info": [
        {
            "prof_name": "Phillip Twilley",
            "prof_id": 2609,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 18, 2006",
            "review_content": "\nI struggled in this class, and Phillip was not much of a help. He tried, but I would reccomend taking a class with a native speaker. It was a huge difference for me!\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 16, 2006",
            "review_content": "\nLots of people don't like him.  I don't know exactly why, but I have an idea...Bottom line, though, he's a great instructor.  He's funny and does a great job of conveying meaning of Italian in Italian.  I learned a lot from being submerged in Italian.  If you're a good student, you'll enjoy the class, if you're not so great, you might find his methods annoying.  If you're the average student, there shouldn't be anything to complain about.  There are much worse.  That's my observation.  From what I've heard, he's tight about any kind of excuse for anything.  Four out of five stars.\nWorkload:\nThe worst part is the work because the Lab/Workbook stuff is kind of tedious and pointless and I got little from them.  The compositions are plentiful but helpful.  The quizzes are weekly but serve as a good review.  Standard midterm and final.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 22, 2005",
            "review_content": "\nwow. italian with twilley can be summed up in the first day: no introductions about himself, even though he's clearly not much older than anyone in the class, and asks everyone to speak in italian after we had only been learning it for three months, and AFTER that big 4 month summer vacation in between. it was a little ridiculous; everyone was baffled/out of it, but we sat there, in pain. twice a week. two hours at a time. seriously, if you want to remember why you liked the italian language (so much while keeping the workload to something sane), try to stay out of his class. or at least, get yourself into a class where the prof wont refuse to give you a check plus on your workbook exercises that you check YOURSELF. \nWorkload:\nfive compositions, weekly quizzes, weekly workbook and lab assignments, midterm, test, final...standard for a language class\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "August 29, 2005",
            "review_content": "\nProfessor Twilley was the most amazing teacher...He was hysterical and knew how to lighten up the classroom yet he always managed to keep the material organized and easy to understand..I highly reccommend his class\nWorkload:\nusual\n"
        }
    ]
}