{
    "prof_info": [
        {
            "prof_name": "Dawn Delbanco",
            "prof_id": 1693,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Arts of China, Japan & Korea",
            "review_date": "January 06, 2015",
            "review_content": "\nI had some mixed emotions on this course. While Prof. Delbanco is very knowledgeable on the topics she chooses to cover (and many more, of course), and I really appreciated the perspectives on non-Western art, I'm not sure in the end whether the class was worth its troubles. \nBut first, my minor issues with the course: \n- Expect a LECTURE course that focuses mostly on Chinese art with some relatively brief looks at Japanese (and even more rarely, Korean) art. If what you liked about Art Hum or other art history courses was the discussion, you won't really get much of that here. Any times students speak up in class is either to answer questions prof. Delbanco asks which are so obvious there's usually a good amount of awkward silence after them because no one wants to answer them, or when someone goes out of their way to ask a question to potentially analyze what we're seeing. In short, while you learn a lot, it's mostly through what she tells you and not what the class works together to find, which is what for hopefully many people, Art Hum was like. If you like to discuss things a bit more (specially when the class is in a dark room, usually early in the morning), then this may not be the ideal course.\n- She talks a LOT. Most of the class consisted of her droning on and on for the full 75 minutes (and as the semester unfolded, sometimes 5 or 10 extra minutes). This may not seem that bad, but as previous reviewers have said, this can get quite boring. She also reviews a lot, which is great but eats away at the time and makes her rush through things towards the end. Because she reviews and rehashes her claims over and over so much, you barely have to study that hard, the material is really ingrained if you attend. But again, people usually looked quite bored.\n- Like many other Columbia courses (specially art history courses), this is obviously NOT a survey of all art in China, Japan, and Korea. While a lot of the themes I assume extend from period to period (she will make the case that this is so), you definitely won't come near to seeing a large amount of art. Instead, you'll learn really in depth on a smallish selection of topics. This also sadly means that literally more than half the course is composed entirely of pottery. May not seem that bad, but 14 or 15 lectures on ceramics can get to be a bit... much. And we actually didn't even move beyond the 12th century or so with Chinese ceramics, so there was still a lot to say.\n- The class feels a little bit too involved at times. There's two papers (involving Met trips and, for one of the papers, sketching two landscape paintings), and the final includes two essays, one of which is a topic of your choosing you have to pre-clear with her, so you're really writing a third paper itself for the final. On top of that there's two other Met trips that are not mandatory right before the midterm and the final, but I'd say 90% of the class attended. There was also a tea ceremony we attended which was nice, but also did take up a bit of a Saturday afternoon. In all, expect a moderate amount of time dedicate to the class.\nNow, my major issue with the course is that, while I really appreciate art and art history, most of the class felt like a stretch. It was actually a bit frustrating in how predictable some of the statements were (\"At first glance these paintings look radically different, but I'm going to show you how they're actually quite similar...\"; \"In essence, these two traditions then are not so different...\") I almost would have liked for something a little more unexpected from this course than the typical art history analysis. It's like Delbanco pulls every trick in the book of talking about art history.\nOther times it honestly just felt a bit too much like a stretch: \"this calligraphy character is in essence an abstract representation of this central mountain in this painting\", \"it's as if these trees become a self-portrait of the artist himself\", \"He places his signature with his inscription close to the trees as if saying 'look here are the trees; this is an image of me'.\") This really may not be that big of a deal, but trust me, by the last several weeks, it gets tiring.\nLastly, it felt like there wasn't much room for free thought in the papers or the class in general. For the papers, if you went to her office hours with an idea, she would not-so-gently suggest not to do that and instead, write something that she would pretty much write out for you on the topics she chose (for the second paper, she said she only thought one painting in the Met was worth writing about, so there wasn't even a choice there). This is great in that she almost writes the papers for you and tells you specifically what to focus on, but it felt more like her imposing her viewpoint in very leading essays, and it also meant that if you didn't go to office hours, or made a statement in the paper that she didn't in essence pre-clear, your grade might be affected because the analysis just wasn't what she had thought of. \nIn a way, I almost learned not necessarily how to think about Asian art, but how to think about what Dawn Delbanco thinks about Asian art. Now, if that's the mainstream way of thinking about Asian art, then great! You've learned it. But sadly, it was hard to tell sometimes.\nTo be fair, I'll end with the positives:\n- You learn a lot\n- She gives you ample opportunity to learn and discuss outside of class, with Met trips, office hours, etc. (That may translate to the class being too involved, but if you need it it's there)\n- She's really smart and seems like an authority on the subject\n- The grading is weird (she said she doesn't like giving many grades above a B+ early in the semester), BUT it's fair and she CURVES so it's not that hard to do well in the end. Don't worry if at the beginning you're seeing B's and B+'s on your papers or midterms.\nTL;DR: Though there are some positive elements to the class, like the tea ceremony, and how in-depth she goes into the class, and for some the lack of discussions may be a positive (though you still need to attend lecture, she takes attendance!), I'm still not sure if I'd take this class if I knew from the beginning what it'd be like... I'm not saying don't take it, because it's still a good class academically-speaking, the material is interesting and worth studying, and the workload isn't horrible at all (most weeks you won't do anything at all other than show up for class, which you have to do because she takes attendance and she'll spew out the answers to what she asks you in essays and tests), but it really may not be that enjoyable... All in all I give the course a B-... It's okay, but it could be a lot better. Others have raved about the course, so this was just my impression, but this course may not be for everyone.\nWorkload:\nModerate: Two papers (20% each), Midterm (20%), Final (40%). Two optional Met trips before each of the two tests, plus a Japanese tea ceremony (also optional, have to pay $5-10). Attendance mandatory. Readings not essential (I probably wouldn't bother even getting the books).\n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "May 10, 2013",
            "review_content": "\nI had a generally positive experience with Dawn Delbanco. For starters, she is EXTREMELY knowledgeable in all facets of the class. The trade off is that her lectures are at times very dry and boring (I would rather watch paint dry) so it sometimes makes it hard to go to class. Despite her style of lecture, you still can get so much out of the class. Not taking Western Art seemingly put me at a disadvantage, but she is extremely clear on what is important and not so important. The material covered is mostly Chinese based with Delbanco, as we had another instructor come in who was more biased towards Japanese, but after hearing the other professor, it made me appreciate Dawn much more. Again to emphasize, she is extremely clear on what she is looking for and the important aspects of the material. Class set up is as follows. First half of the class is ceramics and statues. Second half is paintings. Ceramics is the least interesting of the topics but very straight forward and honestly very simple. Second half is more interesting but the level of difficulty is increased (as having to identify artist, painting title, country, and date as opposed to type of ceramic, country, and general period of creation) but it is completely doable. Overall, if you want a class where you do not need to do much outside reading or not to buy any textbooks, take Dawn's class, you will not regret it. \nSUMMARY:\nPAY ATTENTION IN LECTURE\nTAKE GOOD NOTES\n\nWorkload:\n2 Papers, Midterm, and Final.\nThe Papers are relatively straightforward. One important aspect is to mention as much information as possible (I got a B+ on my first paper, only reason why I did not get an A is because I went in more detail in smaller aspects instead of covering more overall themes). Just follow the instructions on the paper assignments and you will do fine.\nMidterm: 5 Comparisons/10 minutes each. Identify Ceramic type, country of origin, time period, and write a comparison between the two. May or may not conflict. This midterm is difficult due to only 10 minutes per slide, so you have to write fast and be able to id the pieces very quickly. If you paid attention in lecture and took good notes, it is totally doable.\nFinal: Comparisons and 2 Essays. One essay is based on a topic of your choosing, but no notes or images are allowed. I have not taken the final as of this review, but likely it is the same strategy as the midterm, except on paintings instead of ceramics. The other essay is going to be some themes from the entire class and must write on a theme. Again, as long as you pay attention in lecture and take good notes, totally doable. \n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "May 02, 2011",
            "review_content": "\nThe professor is very effective in presenting lectures that are organized and easy to follow. However, it seems at times she herself doesn't know the subject matter she is teaching and as if she hasn't seen some of the pictures before (e.g. she'll say oh I don't know what X is used for in the picture and ask the TA's if they do). The readings are useless, but the lectures are necessary if you want to be able to repeat the information back for midterms and papers. However, throughout the semester you'll get more and more disappointed with the class and feel the urge not  to go to class because the information she presents is very vague and does not seem to be grounded in anything.\nWorkload:\n The coursework is light. 2 papers. 1 midterm. 1 final.\n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "May 14, 2010",
            "review_content": "\nIf you're thinking about taking this class for Global Core... DO IT!\nI took this class having not taken Art Hum and really enjoyed it. Professor Delbanco is extremely knowledgeable about the course material and can answer almost any question in a matter of seconds. She uses the words \"orthogonal\" and \"counterbalance\" a lot that even the TAs laughed at themselves at the end of the semester when they started saying it. She is extremely approachable and is willing to help a lot.\nDONT BOTHER BUYING THE BOOKS. The readings are never referenced... i repeat NEVER so don't waste your money. If you miss a lecture make sure to get notes from someone in your class because otherwise you might be a little lost. \nFor the midterm and the final, there isn't that much historical memorization. She is much more concerned with you being able to critique art in an intelligent way than to memorize dates. \nThough this class is not exactly the easiest (the papers are graded pretty harshly), the TAs will definitely acknowledge you if you participate in the weekly section. If you miss one of the weekly sections/discussion groups (50 minutes every week), you have to write a one page paper about the lectures of that week. \nWorkload:\n2 papers (each 4-5 pages) about objects from the Met, midterm, final (5 comparisons, 1 theme essay, 1 essay that you get to prepare beforehand)\n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "May 11, 2009",
            "review_content": "\nProfessor Delbanco cares deeply about both the subject of the course and her students.  Her lectures, which mostly consisted of going through slides of artworks, were engaging and often funny.  She is a tough grader and expects you to know what you're talking about on papers and exams.  However, this is not rote memorization as you are expected to know a lot about relatively few pieces rather than a little about a ton of them.  We took 2 field trips to the Met, and one to a Japanese tea ceremony in addition to a workshop on calligraphy and scrolls. Both papers were based on pieces at the Met.  The midterm was a series of 5 slides which we had 15 or 20 minutes to describe, and she sometimes threw in pieces we had not encountered before but that related to those that we had seen.  The final was the same as the midterm plus an essay which we were allowed to prepare prior to coming to the exam.  Even though I knew next to nothing about Asian history, culture, or art, I feel like I learned about it from Professor Delbanco.  I highly recommend this class and Professor Delbanco.\nWorkload:\nMidterm, Final, and 2 Papers around 6-7 pages each.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 17, 2006",
            "review_content": "\nProfessor Delbanco is the greatest! ever, hands down. This was my favorite class of the semester and probably favorite professor of all my semesters here. She isnt like all the other art hum teachers, where you learn slide after slide. For her class, you actually learn how to analyze art and you feel like you know so much more at the end of the course. I am so glad I had her, as my interest in art has greatly expanded. She is brilliant. Take this class if you care about learning how to view a painting intelligently. She is the best!\nWorkload:\nnot bad at all. dont have to do the readings, no slides to memorize, just a few analytical papers, couple trips to the met (not required) and analytical midterm and final\n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "November 12, 2005",
            "review_content": "\nI LOVE Professor Deblanco. She's interesting, caring, and down-to-earth. The work load is not hard at all...in fact, there is barely anything to do. Just go to class, pay attention, write your papers, and study for your exams. I heard that the other sections had to remember all the dates...she doesn't care. What matters is that you understand the concepts and that you can tell her where a specific piece of pottery came from. The field trips...AWESOME!!! She also teaches Masterpieces of Western Art. A++++++\nWorkload:\n2 papers, midterm, final. Fieldtrips. :)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 11, 2004",
            "review_content": "\nAMAZING.  first of all - she doesn't teach art hum as a survey course - so don't worry about having to make the stacks of 200 flashcards that all your friends will.  she teaches art hum as an in-depth discussion of several pieces (+/- 20: she spent two and half weeks discussing the coliseum) so if you want to be able to name every piece in the met, she isn't for you, but if you want to be able to really think carefully and speak intelligently about several masterpieces of art, then dawn's your prof.  i didn't skip art hum once the entire semester - she's that good.  very little bullshit, fair grader, interesting and very smart, extremely knowledgable.  does look for comments in class.\nWorkload:\npractically none.  couple of short papers, easy-to-moderate midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 21, 2004",
            "review_content": "\nProf Delbanco is a less than exciting lecturer but she has impressive knowledge. The papers were difficult to write because it was so hard to know what she wanted you to write. Criticisms usually were about points you had failed to make, rather than incorrect points you had made. The paper length was only four pages, yet when after the second paper she sent an email with what she would've considered a complete answer to the questions, her concise answer came to six and a half pages.\nWorkload:\n3 four page papers which require a visit to a cathedral or the met, 2 other class visits to the met\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 06, 2003",
            "review_content": "\nGood lecturer.  I think her specialty is in Asian art so her breadth of knowledge in art hum (all Western) was impressive.  Her paper topics and exam questions were fair and related to what she discussed in class.  Her grading was generous but a little strange.  She can't make up her mind about grades and it is not unusual to receive a 'B+/A-' on a paper.\nOn the first day of class she told us not to bother doing the reading.  However, she gives suggested readings and her lectures usually draw from them so they are valuable if you didn't understand something or missed class.  And she only made you know dates to the nearest century.  She focuses more on the meaning of art studied than memorization.\nMy only real complaint is that we spent so much time on the Parthenon that we missed a lot of topics that other sections covered.\nWorkload:\n3 short papers, easy midterm and final.  Optional readings.\n"
        }
    ]
}