{
    "prof_info": [
        {
            "prof_name": "David Lurie",
            "prof_id": 132,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "INTRODUCTION TO KAMBUN\t",
            "review_date": "August 07, 2013",
            "review_content": "\nSince I'm probably one of the only undergraduates to have gone through the modern Japanese - Bungo - Kanbun series, I thought I might as well give a review of how to get here if you're not a graduate student.\nKanbun is the logical follow-up to Bungo after you've done two semesters of the latter. Prof. Lurie teaches this exclusively, I believe, even though you're likely to get bounced around different professors for Bungo (as of 2013, that'd be Shirane-Suzuki-Lurie in order of likelihood).**\nPre-requisites: \nYou can find this on the department website, but if you're jumping in as opposed to plodding up through the courses, I'd suggest going in to see him. He's wonderful and will give you a good idea of whether you're ready. Personally, I found that an ability to remember kanji relatively well with the help of an electronic dictionary, strong grammatical recall, and a willingness to spend about 2-4 hours pouring through dictionaries for every class is what you need most. The class is taught in English, with a huge number of dedicated graduate students, and (at least in my case) a general sense of doomed camaraderie on days when you get hard readings. Everyone's in it together and willing to probe deeper (or stall infinitely). \nClass structure and textbooks:\nKanbun is a dead-zone for current textbooks. You get two major PDF versions of out of print editions, one in English and the other in Japanese. They're easy to understand and thorough, but are outdated/have errors in many areas, all of which will be cleared up in class. The first half of the semester will go towards working through the basic grammar and getting acquainted with reading short texts. The latter half of the semester involves a reading or two each week with no grammar. \nYou'll be expected to do all exercises before class. The format for grammar lessons is: Lurie teaches, invokes examples, gets a student to read. Then you hit a passage, which is done round-robin format in a fixed order. You are responsible for knowing how to read all kanji in the examples and passage. He will be sad and frown at you if you're called up in turn and can't do the work. It's very reasonable, just tedious. \nThe latter half of the semester is supremely enjoyable. Lurie makes it a point to moderate between classic pieces that you'll want to have read, and obscure stuff that's usually hilarious or interesting. He also is huge on learning how to use dictionaries and resources, which you may think is silly until you spend 5 hours trying to figure out a passage and then realise that you could've been looking for annotations and answers somewhere else. You'll be a much better linguistic and historical scholar for it, trust me. \nThis may be one of the least useful classes for anyone who isn't planning on being a scholar of Japan, but anyone who is - or who has a serious interest in Japan or the language - will find it hugely rewarding. For one, the class atmosphere is small and filled with people who are intent on what they're doing. Lurie is seriously, seriously good at what he does, super-knowledgeable, and doesn't act like he's teaching a classics course at all. You'll learn how to take your scholarship seriously, and hold yourself to higher standards. Plus, you're going to spend a lot of time learning verbs about beheading, riding horses, and camping. It's Kamakura time!\n** Note on the sequence for people who want to complete this in an undergrad lifetime: \nTo get to Kanbun, you have to do the following:\nFirst + Second year Japanese (at least, usually up to Third) --> Bungo I and II (grammar and readings \nAssuming you have no Japanese background, it'll take 2 years to even clear modern Japanese, 1 to clear Bungo, and then half a year to do Kanbun. This is assuming nobody goes on leave and nobody denies you entrance to a class, which is perfectly likely to happen. If you're serious about wanting to get to kanbun, a) talk to the EALAC departmental head, who'll know when people are going away or not teaching, b) talk to Lurie and Shirane, c) get to finishing Third Year as quickly as possible. Take a summer abroad sometime in your first two years - the Kyoto programme is great, and will help you advance. \nAlso remember that Bungo and Kanbun suffer from We Teach It Whenever We Want-itis, and often are taught only every other semester. Good luck! \nWorkload:\nHomework:\nExpect to spend a good few hours on dictionary lookup alone. It's a way lower workload during the grammar section of the semester, but that'll end fast. The moment you're on to passage readings, you'll be best friends with your denshi jisho. Get a good one.\nCaveat here to say that having great modern Japanese helps, but that helpfulness terminates in Kanbun way earlier than it does in bungo. You're in a world that has far funkier grammar, MUCH funkier word-use, and is as likely to use a character for a sound as for its meaning. Don't use it as a crux - people who do in class are very obvious, and obviously suffer for it.\nQuizzes/exams:\nAll in-class question asking is done in English, readings are done in Japanese, and all of it is oral. You are not allowed to reference any notes when asked to answer questions, but he (generally) overlooks you FURIOUSLY CHECKING THE DICTIONARY as you count down to your turn. \nExams are going to be partially things you've done in class (an easy way of earning points) and then a blind passage with no annotation whatsoever. You will be expected to write out the readings (you may not in the final) and then provide a sound English translation. Lurie is picky, and rightfully so, with these exams. Getting an A isn't difficult in the sense that you need to guess what he wants from you: it's just a matter of knowing the stuff well. You'll mostly be working against the clock. He allows any kind of dictionary you can fathom, including an honour-system of letting you bring a laptop in to use jisho.org or other resources.\n"
        },
        {
            "course_name": "Bungo I",
            "review_date": "December 20, 2011",
            "review_content": "\nWhere I do I begin about Professor Lurie? Though this was apparently his first experience teaching introduction to Classical Japanese, I couldn't have asked for a better prepared or more enthusiastic professor. Lurie manages to be hyper-intelligent *and* comprehensible *and* funny at the same time where most only manage one out of the three at best. He's incredibly responsive via emails, wonderful in office hours and very approachable.\nThe material is not the most exciting in the world; Professor Shirane's Grammar is methodical but slightly soul-crushing. Lurie knows the material inside-out and is eloquent about it. Is also unashamed about making pop culture references when doing semi-ridiculous readings. \nClass usually operates as an introductory lecture before turning into a round-robin translation circle. You prepare beforehand; Lurie requests that you do not rely on a crib sheet but isn't particularly strict about enforcement. \nWorkload:\n- Biweekly grammar exercises until you run out of material\n- Quizzes during the initial 2 weeks of class; he hates them more than you will\n- Midterm and final were half-open book: he gives you the questions in advance for the closed book section and you're allowed free access to material (including the internet) for the open book section. \nWas generous enough to allow the class a complete redo of the midterm because of generally poor performance.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "October 21, 2011",
            "review_content": "\nI wish I had had Prof. Lurie's version of Intro to Japan in my freshman year.  I have taken a number of courses in Japanese civilization and culture and I find now that I've had Lurie's course, I have a MUCH better understanding of the historical context than I had before.  His version is a very good survey course of Japanese history from prehistory to the present day, without the dumbing down you sometimes encounter in big sweep surveys.  (I'm a history major, so I know whereof I speak.)  He introduces major events, issues and personalities, and tries to keep an eye on continuities between periods as well as the distinctive characteristics.  The readings are appealing, although as always the value of the weekly discussion sections depends on which TA you get.  This is not one of those mickey mouse \"get rid of an area requirement\" courses, which you forget  the minute you've finished the final exam.  It's a legitimate Ivy League course which should increase your interest in and understanding of things Japanese.\nWorkload:\nModerate reading.  The two textbooks aren't bad.  You should read them, even if your TA doesn't discuss them (as mine didn't).  The other readings are very interesting--mainly primary sources.  We had to post a weekly two- or three-paragraph reaction to the readings before the discussion section.  My group took this fairly seriously and it worked out pretty well.  Midterm and final, plus two papers on topics of your choice.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "August 23, 2008",
            "review_content": "\nJust to keep things current, he's still going strong as of Fall 2007.  This course is essentially a history lecture, with some literature and architecture/urban studies.  He's a top notch lecturer, responsive to questions during lecture and in office hours, and gives fun and worthwhile assignments.  If the first lecture bores you, drop the class because he's going to keep teaching at the same rate, tests cover lecture material in depth, you will not do well if you didn't pay attention, and there are tons of kids dying to get into this class who will happily take your spot.  If you are really curious about Japanese history, here's a great introduction.\nWorkload:\nDescribed below.  There's a 50 minute weekly session plus readings, midterm, final, and two little papers.\n"
        },
        {
            "course_name": "Japanese Civilization",
            "review_date": "August 30, 2004",
            "review_content": "\nA truly interesting class. Lurie packs his lectures with tons of information and gives you a fast, but intriguing glimpse into one of the most unique Asian civilizations. The latter part of the course is especially interesting when you get to the transition from the isolated Japan to the eminent Asian power prior to WWII. It is organized like an introductory history class. The packet readings are far more important than the text readings, although those are also interesting. Lurie's interest in Japan is infectious and his quirky style definitely adds to the charm of the material.\nWorkload:\nDiscussion groups that meet once a week. Infrequent book report type writing assignments. Exams are more analytical, and will be explained thoroughly. Weekly online postings.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "May 15, 2004",
            "review_content": "\nLiterature majors (or even non-lit ones who love to read) who don't take Colloquium on Major Texts (aka Asian Hum) with Lurie to fulfill the MC requirement are shooting themselves in the foot. An assistant professor with possibly the most immaculate goatee known to man, Lurie is phenomenal. True, he doesn't talk much in class and tries to give as little context as possible so that students can discuss their most visceral reactions, but he's funny (he once tried to count the number of orifices in the human body out loud), incredibly smart, and very helpful in office hours. \nThe class is a lot of work - it's 4 points and meets once a week, so expect readings on the level of an English or History Department seminar - but there are only two short 5-7 papers and the Famous Asian Hum Oral Final (which is, as everyone says, easier than you think - for half of mine we talked about things totally unrelated to the class). The readings are interesting, for the most part (you read everything from the Tale of Genji to Confucius) and while a lot of them are dense and difficult to relate to, Lurie knows enough to help you through the rough spots. One of the few classes at Columbia that truly is a discussion (even more than Lit Hum or CC). Come having done the reading and you'll be rewarded by a fairly stimulating two-hour discussion (provided you get good classmates)\nWorkload:\nA lot of reading - as much as 200 pages a week from cultures that you're probably not used to, most of which is worth doing. Class participation definitely counts and is helpful once you get to the oral final, which isn't that bad. \nTwo 5-7 page papers with a lot of leeway, and one Courseworks posting (you start off class discussion one time).\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "January 04, 2004",
            "review_content": "\nA few friends who I took Japan Civ with used to say I could be a David Lurie scholar for a living. He can really be a riot sometimes, facilitated by his George Steinbrenner lecturing style Â– seeming not to take a breath for 75 minutes. HeÂ’s great about sticking to the syllabus, and the readings follow right through with his lecture material. The TAÂ’s for this class can be annoying, and therefore youÂ’ll really want to keep up with the work Â– prepare for discussions, keep your TA updated on the few projects of the semester. Prof. Lurie will give you his personal opinions on everything in current events about Japan, and heÂ’s a severe liberal, very critical of most newspaper articles and documentaries, which electrifies the class period. Gotta love him. \nWorkload:\nA research project (make sure you follow the directions!), a section presentation, a midterm and a final. Reading, if you do it all, will rival Lit Hum in quantity. \n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "December 16, 2003",
            "review_content": "\nGreat class for getting an introduction to Japanese history. The lectures were a bit boring as all he did was stand there and talk but he's very enthusiastic about the subject and just a plain nice guy. The information presented, however, is very interesting when you go back to review it. The second half of the semester got better since the information was more modern.\nWorkload:\nWeekly readings and posting about the reading (takes about 1.5 hours), 2 short papers during the semester (graded leniently), midterm (pretty easy), and final\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "May 21, 2003",
            "review_content": "\nGreat lectures.  Lurie is very engaging.  He also knows who the boredoms, guitar wolf and shonen knife are.  Maybe he even likes them...  I would recommend this course to anyone trying to complete their major cultures requirement.  \nWorkload:\ntwo \"papers\" (first one 1-2 pages, second 3-5), midterm, final.  loads of reading, but you don't have to do all of it becuase class lectures are pretty comprehensive\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "May 19, 2003",
            "review_content": "\nLurie is a great prof, one of the best I've had in my 2 years here so far. He's genuinely excited about teaching and he finds the material fascinating. The entire class is lecture, but he shows lots of interesting slides of places and artifacts from Japan so you can actually see what you're learning about. You can tell he puts a lot of time into the lectures and actually wants you to learn something, as opposed to a prof who just wants to get teaching out of the way so he can get back to his research. And Lurie knows his stuff too, he doesn't just spit out historical facts one after the other, he ties events together into larger themes and you learn a lot about Japanese culture too. Like most of the people in my class, I just took this to fulfill the major cultures requirement, but I'm definitely going to take a B or C list course about Japan now, especially if he teaches any more courses. This is definitely one of the best major cultures courses out there!\nWorkload:\nnot bad at all, weekly coursepack readings but the material's only important for the midterm and the final and even then you don't have to do all the readings, you can just read the good ones and skip the boring ones. weekly recitations with a TA where you talk about the coursepack readings, ask questions, etc. Midterm and final aren't very hard, mostly based on notes from class and essay that has to refer to coursepack readings, but graded fairly leniently, as long as you study you'll get an A. as for papers, one response paper about a museum visit or movie and one 3-5 page paper about any topic that you have to research using a whole bunch of ealac resources, again graded pretty leniently.\n"
        },
        {
            "course_name": "Intro to E. Asian Civ.: Japan",
            "review_date": "May 19, 2003",
            "review_content": "\nProfessor Lurie is amazing, his lectures are clear and ultra-concentrated, so if you can handle taking very fast notes for 75 minutes, you've got to take a class with him.  He's very excited about the material and makes every attempt to make it interesting, insightful, and funny.  The book and coursepacks reading were a little heavy, but lectures could make up for the book reading so a couple of the coursepack readings required for section will suffice (yes, you're required to go).  He's always approachable and is very happy to answer questions.  I know several people who took this class with me and decided to become Asian Studies majors because of him.  Anyway, there's a major cultures requirement to finish, so you might as well do it.  One of the best profs I've had at Columbia.  \nWorkload:\na lot of reading, but interesting and some that only need skimming, easy midterm and final, super-easy grading on 2 short written assignments (NOT thesis papers)\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "May 14, 2003",
            "review_content": "\nLurie's a great teacher. He's really into the material & passionately cares about his students. This class is also one of the only true discussion classes at Columbia, where Lurie barely ever talks and it's almost all student run. Don't get the best understanding of the material, but rather a very personal one that Lurie will encourage you to explore in your papers. Very intelligent when he does say something and always answers question the best he can without bullshitting. \nWorkload:\nReading can get kinda heavy (and boring) at times, though not always..100-200 pgs./week. presentation. 2 5-7pg response papers. oral final. exacting but fair grader\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "May 10, 2003",
            "review_content": "\nProf. Lurie is a fantastic, caring teacher.  He faciliates the class discussions well, although you sometimes wish he would contribute his insight more.  I can see how this class might go wrong if you have a bad mix of students because of the freedom he gives you to just spout off and go on tangents.  But overall, it's a solid section for Asian Hum, with a good syllabus and taught by a thoughtful professor.\nWorkload:\ntwo 5-7 pg papers, oral interview for final (Asian Hum tradition), all fairly easily graded\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "May 18, 2002",
            "review_content": "\nProf. Lurie is an awesome teacher. The readings that he selects are very interesting (although sometimes a little long) and he poses good questions to our class, which makes for excellent class discussion. He is also an incredibly understanding person. He is very flexible with deadlines and encourages students to rewrite their papers. He met with me on multiple ocassions to discuss my papers and his suggestions were very helpful. Because of Prof. Lurie, Asian Hum was a very enjoyable experience. \nWorkload:\nweekly online responses, two 5-7 page papers, an oral final\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "May 04, 2002",
            "review_content": "\nLurie is an enthusiastic professor who has a genuine interest in the reactions of his students to the readings. He takes a secondary role in the classroom and fosters great student-led discussions. Lurie is very nice and approachable, and is flexible with issues like paper rewrites, missed readings, etc. Definitely a great way to fulfill the major cultures requirement.\nWorkload:\nlengthy weekly readings, weekly postings on courseworks in response to readings, 2 papers (5-7 pg), oral final exam.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "December 31, 1999",
            "review_content": "\nde Pee is very boring, David Lurie only slightly more interesting, but the readings make for great student-led discussions. The professors generally refuse to speak, only writing down everything said. Both are very friendly and seem fair.\n"
        }
    ]
}