{
    "prof_info": [
        {
            "prof_name": "Gaja Sekskuni&#285;i",
            "prof_id": 2290,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Esperanto",
            "review_date": "February 18, 2005",
            "review_content": "\nThe class was easy, but be warned. Gaja (or as I like to think of him, the little man) can be very flirtatious with his students.  At first is may seem fun and flattery, but don't be fooled.  It's all an ego game.  As I write this, hot tears run down my cheeks and I lacerate myself to subdue the emotional agony of my ruined heart.\nOf course, he is an intoxicating performer, illustrating the rolling of  his \"rrrrrrss\" with a little shake of his hips, and pulling his underwear out of his jeans to illustrate the Esperanto term for \"unmentionable\".  And he will get touchy-feely, too.  He actually put his arm all the way around one student's shoulders, practically cuddling the poor, defenseless lad in front of the whole class.  Needless to say, the victim spent the rest of the class with a folder in his lap.  \nOh, but who could really claim that such innocent pranks are inappropriate, when little Gaja is so @%&$#@*  loveable.  So loveable, in fact, that I've begun stalking him.  I now know where he lives and where he shops for his groceries.  In the guise of a friendly conversation after finals were over, I managed to gather all kinds of factoids about his schedule and also about his personal life. He was remarkably forthcoming.  \nYou may think I am obsessed, but after the twelve pages of love poetry and short story centered on a dominance/submission theme that I penned for him were so well recieved (he told everybody in his department about it, the braggert!), I believe I am entitled to at least two semesters of stalking.  Oh, I also found out where he buys that underwear. I plan to stuff a package of it into his male slot...uh....I meant mail slot.  \nHe is MY turtle dove.  So stay away from him.  If he tries to touch you in class, remember that.  Slap his hand.  I have to go now.  He is going to be on the 116th street subway platform in ten minutes.  \n"
        },
        {
            "course_name": "Complete Esperanto",
            "review_date": "December 15, 2004",
            "review_content": "\nGaja was an absolutely amazing professor. I came to the class after many frustrated attempts to pass the language requirement - I'd been to the French department, Spanish department, Italian... etc., and all had failed me. So it was a great relief to discover this course which lets you satisfy the requirment in one semester. It was so easy!!! For a start, no conjugation tables because all persons conjugate the same way in Esperanto. And there's only one type of verb (-i), instead of -er, -re, -ar, -ir, blah blah blah of other languages. And easy vocab as well! By the end of the semester I was basically fluent, even having done hardly any of the work outside class. Oh, and Prof Gaja is the best. We even had an Esperanto Symposium at the end of the semester. Definitely take Complete Esperanto if he's teaching or even if its available with someone else. You will  not regret skipping 4 semester of French or whatever.\nWorkload:\n4 class test throughout the year (easy), 4 short stories (half-page), a midterm, a final... just go to class and you will be fine (he even lets you do your stories in class!)\n"
        }
    ]
}