{
    "prof_info": [
        {
            "prof_name": "Thomas Humensky",
            "prof_id": 12003,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "General Physics I",
            "review_date": "May 27, 2015",
            "review_content": "\nI was instructed by Professor Humensky for the Physics I and II cycle this past academic year. Unfortunately I cannot recommend him as a professor at this or any institution. An amiable enough guy, its clear that after 4 or 5 semesters of teaching that it doesn't suit him. Via reports from my peers who were with him during his first semester, back in the spring of 2013, he has made little to no improvement in his lecture style or the format of his course. Please note that I did well both semesters, receiving grades in the \"A\" range, so this is not the review of a slighted, disgruntled student.\nProfessor Humensky is unable to do what I feel is the most important job of a professor in the sciences: distill complex information from the text into meaningful, understandable ideas that the eager student can use to navigate problem solving. While lecturing, he stays exclusively to his prepared notes which he reads almost as if they were a script. Later, these notes are posted to courseworks; the language and structure of the notes, and thus his lectures, are almost carbon copies of the textbook. What's wrong with this? We already have the textbook, which of course we have paid an inordinate amount of money for. To sit in lecture where it is read back to us, equations derived in turn with little additional explanation, is a disregard for the value of the instruction that should be expected. I had a hard time understanding the ideas in the text, as many students do. In an ideal world, lecture is able to help decipher what seems on first read to be a foreign language, but instead I was left to spend excessive time finding quality instruction via youtube videos. The interesting thing is that quality instruction IS out there, as evidenced by what I was able to learn with youtube supplementation of the text. Student questions in lecture were often met with the Humensky 1000 Yard Stare, as he was forced to grapple with the information himself instead of merely restating it to the class.\n20% of a student's final grade is determined by weekly problem sets, which everyone has the answers to; in this way, your homework grade can only hurt. The other 10% is decided by mandatory prelecture quizzes on the expensive WileyPlus online learning tool, which also seems to only be able to hurt your grade. Humensky defends this meaningless 30% of your class grade by actually arguing for the utility of assignments that give incentive via their ability to hurt you. A student is only able to distinguish him or herself through the midterms and final. Here, Professor Humensky is mostly fair: you are allowed to drop 1 of your three midterm grades, and with one exception the exams were composed of 1.5 to 2 dot-level problems (difficulty scale per the textbooks) which were extensions of the ideas reinforced in the problem sets. The exception to this was the Physics II final exam, where he chose to put several 3-dot problems on the test which were not reflective of applications of the course material emphasized at any point in the semester. Two of the problems were taken verbatim from the textbook, I learned upon later review. If this isn't intellectual laziness, I don't know what is.\nProfessor Humensky is institutional failure personified. Again, I cannot recommend him as a professor at this or any university. It stands to reason that I cannot recommend his class. Consider all other options first and then be ready to find outside sources to supplement your understanding.\nWorkload:\nWeekly problem sets, with 3-4 problems due to turn in and biweekly prelecture quizzes. Of course the problem sets can be copied right from the solutions manual or found with an account on chegg.com. Understanding the material well enough to do problems on your depends on your previous level of exposure to the material as well as your general aptitude. I can see a scenario where 10-15 hours/week are needed to solidify the material, and extra time the days leading up to an exam.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 03, 2014",
            "review_content": "\nProfessor Humensky was a good instructor.  His lectures were ambiguous at times (especially when solving some of the examples that were intended to supplement/clarify concepts).  However, he reviewed the theory and math behind all of the important concepts, and didn't base his tests on the material that wasn't covered in a thorough fashion.  I believe the biggest strength of the course was the amount of practice material made available for review.  Homeworks and pre-lecture problems reappeared on the exams, with slight variations.  Furthermore, the Professor instructed his TAs to be very generous with partial credit for work, emphasizing method and conceptual understanding over mathematical calculations (plug 'n' chug).  This class was certainly challenging, but not impossible by any means.\nWorkload:\nFairly time-demanding workload: online pre-lecture questions based on textbook readings (10%), weekly homework assignments (20% total, lowest homework dropped), best two out of three midterms (each worth 20%, the third is dropped), and a three-hour final (30%).  Midterms and final were a combination of conceptual multiple choice questions and long-answer problems.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 12, 2013",
            "review_content": "\nProfessor Humensky genuinely tried to be a good professor. He made us use WileyPlus (which is ridiculously expensive considering you can only use it for one semester) and he assigned problem sets and posted the answers on his coursework's in a timely manner. From his class design, he had the makings of a solid professor. The problem with his class is that he would only go over how to do problems during the class period rather than go over theory. Those promises he made to go over topics people had difficulty with in the pre-lecture problems were never fulfilled. He does seem to be a nice, down to earth guy, but he isn't an effective professor. There was no balance between teaching theory and going over problems. The redeeming quality of the class is that if you can do the problem sets he assigns, you can do the tests. I was in his first class of General Physics I and so we didn't have any practice tests or material to prepare for exams. The class has a generous curve since the average is somewhere between 50%-60% for each test. If you're premed, I would highly encourage you to take Shaevitz instead of Humensky. Humensky is not an easy A (you can get an A, but it won't be easy) and he does not make it easy to take his class with Mowshowitz bio as he unwittingly has  tests scheduled for the day before Mowshowitz bio tests. He's not the worst option and it really depends on what you're trying to get out of the class. If you're just looking for an easy A, this isn't the class.\nWorkload:\n20% problem sets of varying lengths, 10% pre-lecture problems, 40% tests (best 2 of 3), 30% final\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "July 29, 2013",
            "review_content": "\nI have to admit I was at first hesitant about taking Humensky's section of Intro Physics; he was a new professor but I decided to give his class a try. At the end of the semester, I have to say I was pleased with my decision. Not only do I feel extremely prepared for the MCATS but the tests were pretty fair. His teaching methods improved throughout the semester, thankfully. The workload isn't that bad and the quizzes made sure you were keeping up with the material. If you actively understood the material, and didn't just cram for the midterm/final, then you didn't really need to study at all for the exams.\nIn comparing Shaevitz and Humensky, I would definitely recommend taking Humensky if given the choice. You actually LEARN the material in his class, compared to getting a \"GPA booster\" class and stumbling on the MCATS which actually matter. I never had taken physics before, so it was a struggle learning everything with Mowsh's class, but it was worth the pay off. The class average was around B+/A-.\nWorkload:\nModerate, what you put in is what you get. \n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "July 11, 2013",
            "review_content": "\nI really enjoyed the class.  A lot of material was covered in this course, and he was good at streamlining it and focusing on what were the most important. He also explained concepts and answered student's questions well.  He derives formulas in a way that is intellectually satisfying for students with a math background, without intimidating those who didn't, which seems like a nice compromise.  He was also nice enough to provide his lecture notes on Courseworks, which was really helpful when studying for quizzes.  The demos in class were entertaining as well.  Humensky also just strikes you as a decent, nice, down to earth guy, for whatever that's worth.  \nWorkload:\nAn optional problem set of about 15 problems every week, with solutions provided.  While optional, it would be unwise to skip them or go directly to the solutions without making an effort to solve.  A quiz every week with the lowest 2 dropped.  1 midterm and obviously a final.  About 2.25 chapters of reading every week, i.e. rarely (if ever) less than 2 chapters, and sometimes 3.\n"
        }
    ]
}