{
    "prof_info": [
        {
            "prof_name": "Nicole Marwell",
            "prof_id": 438,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Latino Communities in NYC",
            "review_date": "April 14, 2007",
            "review_content": "\nThis is the second course I have taken with Prof Marwell (Intro Latino Studies was the first).  In this course (since it is only 15 people), she is more open and willing to be personable, which is at times not her style.  She is still cut and dry, but she continues to try to extract the most clear cut points from class discussions.  The background readings on anthropology and sociology fieldwork helped those of us out who are new to the field.\nThe course is extremely interesting with various components of work, such as reading 100+ pages of reading a week, responses on courseworks, mini fieldwork assignments in two neighborhoods of your choice with a partner, and a final original ethnographic fieldwork in another neighborhood on a certain topic.  It has a good variation which helps the course go by quickly.\nHowever, there were two points that I had problems with: She made us read her work, right after spring break no less! I personally hate reading the work of the professor in the class if it is in an intimate setting where you need to participate.  She wanted to know what we thought of the work and made it the center of discussion for the class period.\nSecond, she tends to play favorites. She was particularly rude to this one girl who always tried to BS her way through everything.  Even though the girl obivously did not do her reading (she told us, the students) and pretty much talked about whatever in a general context in order to get her participation points in, Marwell did not have to treat her as badly as she did with saying that she \"didnt know what she was talking about,\" etc.  She could have just shifted the conversation. It was irritating because it took away from the class itself.\nWorkload:\nread above\n"
        },
        {
            "course_name": "Latino studies",
            "review_date": "January 11, 2007",
            "review_content": "\ninteresting class but definitely not an easy A, more like a somewhat hard B. Marwell asks about 7 questions for the midterm, 3 which were ridiculous statistics that she expected us to somehow remember, the other were basically question that you could easily BS as well as the essay. I didn't read anything until the take home final and  didn't really need to in order to participate (which is actually 15% of the grade). The class is pretty chill as you dont have to do the reading and you'll never be bored. There is a presentation that everyone has to do with a partner. I thought that this would be fun but it was quite intimidating. I never felt that marwell liked me very much, when people participate she stares at them with a serious face. \nThe take home final was easy- two 5-6pg essays(I did it in one day) although I suspect that I got a B. This is a perfect class to P/D/F but if you choose to take it anyway just study some useless statistics for the midterm.\nWorkload:\nnot bad at all, such a laid back class-->participation, midterm, take-home final-2 essays(5-6 pages), class presentation \n"
        },
        {
            "course_name": "Intro to Latino Studies",
            "review_date": "December 06, 2006",
            "review_content": "\nI am not quite sure why there are so many negative reviews about Prof Marwell. She knows the material well and her presentation is clear and concise, without the pretentious wordiness that some professors rely on.  Since Latino studies is a realtively new field, she likes a lot of class participation in order to add to the scholar discourse. She challeneged many students to think beyond norms and vague terminology such as \"mainstream,\" \"culture,\" and the black/white dichotomy. \nHowever, she is cut and dry. At times, she seems unapproachable, but if you are confident, she tends to open up more about and be more lively.\nThe material is extremely interesting (Im passionate about it). There are many readings that tackle different ideas such as, what is Latino studies?, migration patterns, and US imperialism and the marketing of Latinos in the US market.\nThis course is definitely recommended!  \nWorkload:\nReadings for every class period (usually between 15-40 pages depending on topic), class participation or postings on discussion section on courseworks to compensate for lack of participation, midterm with short answer section and 4 essays in which you chose 2, and take home final (two essays 5-7 pages each)  \n"
        },
        {
            "course_name": "Latino Communities in NYC",
            "review_date": "May 26, 2006",
            "review_content": "\nI've taken 22 classes during my time at Columbia so far, and two of these has been with Professor Marwell. I am signed up for a third because they have been some of my best classes.  Above all, she knows what she is talking about and she is very organized and committed to getting through the material.  She's funny, down to earth and really personable if you take the time to get to know her.  She always made herself very available outside of class to chat or help with questions about class/work.  WARNING: She is not to be bullshitted as she can tell when you haven't done the reading or are making things up on the spot, and she is not afraid to call you on it. Do the reading, go to class, participate, and you'll be fine.  The workload is extremely manageable, I found myself wishing this class was twice a week instead of some of my other ones.  The fieldwork was extremely enjoyable and if you were committed to it the final paper came easier than you might think.  Overall, she is one of my favorite professors so far, this was one of my most enjoyable classes so far, and I would defenitely recommend it to someone who is interested in the topic.\nWorkload:\n100 pages of reading per week & online readers response; two mini practice fieldwork exercises; fieldwork & final 20pg paper.\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "April 11, 2006",
            "review_content": "\nAfter reading all of Marwell's CULPA reviews, I was damn confused.  After taking Marwell's class, I was daaaaamn confused.  \nSike!  Let me set the record straight, though.  Marwell is not the most personable professor in the world, but that's fine because I, unlike some apparently, don't need my theory relayed to me like cocktail party conversation.  She is straightforward, has defined lessons and doesn't seem to skip a bit or fall behind in the syllabus.  She asks questions, expects answers and appears genuinely interested in our responses.  She was also careful to point out that we were welcome to come talk to her about graduate school and sociology in general.\nEverything about the class was fair.  The weekly quizzes kept me on top of the reading.  Three questions were posted ahead of time on Courseworks, one of which (generally the most obviously revelant) was chosen.  The midterm was on point, as was the final.  No surprises.  The reading was dense, though short (generally no more than 50 pages per class) and it all seemed essential.\nI think it's almost impossible not to come away from Marwell's class without having a solid grasp of the theories presented, provided a certain diligence is there on the student's part.  This semester I'm taking a graduate seminar on cultural sociology, and I can only imagine how lost I would be if I hadn't taken Marwell's class.  \nWorkload:\nDoable readings, weekly quizzes, take home midterm, final.  \n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "January 09, 2006",
            "review_content": "\nThis was one of my favorite classes. The readings can be a bit long and are not always exciting, but I learned a LOT. Prof. Marwell is clear and goes into an amazing amount of detail in a short time. She doesn't mind digging deeper in to questions about the reading and getting into discussions. Reading for this class is mandatory since there are weekly quizzes on it (but they are not bad at all).\nWorkload:\nWeekly quizzes (2 are dropped)1 take home midterm1 final in-classNo papers\n"
        },
        {
            "course_name": "Intro to Latino Studies",
            "review_date": "January 07, 2006",
            "review_content": "\nAWFUL class. Marwell seemed incredibly biased and didn't know her stuff. \nWhen asked questions on what she said in class, she either answered wrongly or circumvented the question without really answering the question. I would not recommend this class.\nWorkload:\nBoring, biased. \n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "January 24, 2004",
            "review_content": "\nGive it a rest, guys. This sudden outburst of defense for Marwell fingers you as those \"pompous assholes\" who dominated (and yes, I'll admit, ruined) the class. Let's just stick to the facts. Compared to the rest of the Sociology department, Marwell stands out for her rigid, cold, and yes, boring approach to Sociology. And yes, I know that such material as this is hard to make completely enthralling, but believe it or not, I've seen it done.\nWhat gets me about Marwell is her own foolish idea that she has the \"right\" answer when it comes to this stuff, when in fact they boil down to more than one. I also agree that she was never so detailed as when she told the life stories of the various authors; and can anyone say that that last unit about current Columbia professors per the Classical authors was NOT a waste of time?\nGood professors require good rapport and overall passable social skills when it comes to their students and the communication of their lessons. Marwell doesn't have any of that, doesn't even come close, so that automatically requires the less-than-fawning reviews you will find from those students bright and brave enough to post them. For those calling all of us \"pricks\" and other such nonsense, I would say that you have made yourself look more of one than we have. These reviews are supposed to reflect upon the teacher, and not berrate other reviewers.\nOverall, don't take this class if you don't have to. And if you do, dno't be surprised by your average grades.\nWorkload:\nLots of reading that is essentially pointless, weekly quizzes. If you've taken Imagination, and hopefully you have, as well as CC, those notes will tell you everything you need to know to answer the quizzes and will fill you in on everything that Marwell won't.\nTake-home midterm (graded quite arbitrarily), as well as a long-winded final that makes no sense and only requires that you nearly break your hand. Doesn't matter what you write; unless she writes it, or you took verbatim notes in class, it's not gonna get a perfect score.\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "January 20, 2004",
            "review_content": "\nI also can't figure out where these negative reviews are coming from.  It's true, Marwell comes across as a cold sort of person, but she *does* know her stuff, and she's not boring.  She does have students answer each others' questions, but she guides the discussion firmly and well.  The readings are, of course, dry and old, and could be boring, but she did a very good job of making them interesting and relevant.  This was one class I almost never skipped, and I'm a pretty big slacker, so that says a lot.  The only bad thing about this course were a couple of pompous assholes in it who thought they knew better than her, and obviously feel very defensive because she shot them down when they repeatedly said stupid and incorrect things during class.\nWorkload:\nThe reading is hard, but there's considerably less of it than most other courses at this level.  Weekly quizzes (she gives 3 possible questions in advance and picks one) were generally easy, especially if you come 10 minutes early the day of the quiz and go over your prepared answers with other students - aceing the quizzes is no problem.  Fair takehome midterm. The final was long and obnoxious (4 essay questions of about 5 pages each = aching hand) but again, fair questions.\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "January 02, 2004",
            "review_content": "\nI am shocked to read so many negative reviews.  One reviewer assures readers that one mustn't read the course material.  Then why take the class?  Idiot.  Another accuses Marwell of a negative and bland teaching style; this is not the case.  She aptly and deftly explicated the theories of the three \"canonical\" social theorists.  \"Theory\" doesn't necessarily mean apply Marx to feminism, aesthetics, and media theory.  Keep in mind that this is an introductory class' as such, theories are to be grasped instead of to be utilized.\nThis class is relatively easy if you attend the lectures and do the reading.  The take-home midterm is not very time consuming (that's relative...it's about 10 pages when completed, and the questions are more than fair).  The final is graded with little scrutiny and may be finished in under 2 hours easily.  The quizes are also not extremely challenging, though they are very beneficial to achieving understanding of the material.\nBig ups to Marwell.  If you don't like her, you (a) don't like social theory but claim to still like \"sociology,\" or (b) must be a pretentious asshole who namedrops in class and assumes greater self-knowledge than you actually have.  While you spew solipsistic diatribes, I will use the hand I am not slapping you with to awkwardly applaud Marwell.\nWorkload:\nain't a thang.  whoever complained about the reading obviously ain't ever taken a class in any social science dept. over the 2000 level.  never more than 50 pages per class, often less.  dense readings with adequate explanations in class.  take-home midterm (3 questions).  in-class final (4 questions).\noh and ps.  a big sociological F-U to the haters.  and word to the TA.  son knew his business, for real doh!\n"
        },
        {
            "course_name": "Intro to Latino Studies",
            "review_date": "January 01, 2004",
            "review_content": "\nProfessor Marwell can initially come off as intimidating, but stick around a while and you'll realize she's actually quite kind and funny.  This class challenged me to be concise in my work and to keep up with the material, however, the workload was not at all unreasonable and she was a very fair grader.  This class was not only insightful and engaging, but fun, too.  Daily presentations on the material helped to break up lectures, but lectures were lively and kept you on your toes.  Class participation is a must, but she really just wants you to say what's on your mind in a thoughtful and concise manner and exhibit that you have even the most elementary  understanding of the material.  \nWorkload:\nin class midterm, take home final, one presentation- interesting, fun, not difficult, reading is very reasonable.  grading also reasonable.  class participation is a must (15% of grade)  but also fun!  perk:  she likes doing the class dinner thing so free food one night towards the end of the semester is a major plus...had a great time.\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "December 27, 2003",
            "review_content": "\nUnfortunately, this class too closely resembles the syllabus of the intro Sociological Imagination class, though the latter has more interesting course material. This class was mind-numbingly boring, and Marwell's know-it-all attitude as well as the frequent fawning of a select few underclassmen over her \"expertise\" made for a pretty negative experience. I still can't understand why this class exists, let alone why it's a requirement for Soc majors -- in Imagination, the readings were very engaging, and Polletta was a very approachable and dynamic lecturer. Marwell seems only to know the biographies of the different authors down pat, and discourages any interpretation of the theories that do not wholly reflect her own. All in all, she's pretty intimidating, and going to class was more a chore than a pleasure. This was the one class that made me reconsider my Soc major; however, I'm sticking with it, confident that the rest of the department can't possibly be as overbearing and unpleasant regarding the use and application of the material.\nWorkload:\nLOTS of reading -- don't bother with it, just go to the lectures and she'll tell you what she wants you to know. Each week you're given 3 questions relevant to the reading, and one is chosen each Wednesday as a quiz question. 12 quizzes, get to drop 2. Take home midterm of 3 essays that takes forever; be sure to use your notes from this class to write the essays or she'll choose to disagree with you and lower your grade. Regrades of midterms are structured so that your grade can be raised, lowered, or unchanged. The final was 3 hours of comparative essays; she told us there would be 3 when there were in fact 4. In other words, stay away from this class unless it's required, and if it is, then choose the other section.\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "December 27, 2003",
            "review_content": "\nThe only mind-blowing conclusion she ever came to was that class was over. While Marwell's approach is organized, her interpretations lack depth and bar any conclusions about the theoretical material outside of her myopic ideas. She'll tell you that you're wrong when in fact it is hard to err completely in a course like this, where the theory can be viewed in any number of ways. She claims that \"social theory will allow you to expand your mind in different ways\" while simultaneously lowering your grade or humiliating you in class if you even dare to think outside of her own ideas. She encourages participation by skirting questions asked of her and making other students answer them. It appeared to me she did this because she did not know the answers herself. She \"teaches\" with a false air of mastery over the material, she also needs to smile once in awhile. I have no clue why she was allowed to teach this course, it just goes to reinforce the fact that Columbia will let anyone teach regardless of their skill or merit as an instructor. I got nothing out of this course except a most unpleasant deja vu. This was like bizarro \"Sociological Imagination,\" opposite it in every way: boring, dry, and poorly taught. I did well in this class but I can't overlook the fact that I could have gotten more out of it had I not been subjected to Marwell. The TA, on the other hand, deserves the credit for making me care about the class and for actually knowing what he was talking about.\nWorkload:\nWeekly quizzes, tons of reading, take-home midterm and a final. It's a pretty heavy load that would be more worthwhile if better explained. \n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "November 21, 2002",
            "review_content": "\nI don't think anyone could exactly accuse Prof. Marwell of being a particularly warm or nice person, but what a teacher! Her lecturing style may be a bit frustrating at first--she repeats herself a lot and very obviously underscores the important points--but she's so thorough, so organized, so easy to follow, so enthusiastic, so engaging, that you'd have to be a moron not to leave the class with a full understanding of the books. Plus she's a great discussion leader, and she ends each class with an invariably mind-blowingly brilliant conclusion. For the last few weeks of the class, we read work by the Columbia sociology faculty and tie it in with the classics, which is a really neat approach. A lot of work, but well worth it. Marwell is a gem.\nWorkload:\nTons of reading, with weekly quizzes and enforced class participation (she loves to call on students randomly), so you can't fall behind! Take-home midterm (long and difficult, but not unreasonable), in-class final. Midterm and final graded by Marwell very fairly, quizzes graded by the TA in a manner most arbitrary.\n"
        },
        {
            "course_name": "Latino Communities in NYC",
            "review_date": "May 10, 2001",
            "review_content": "\nMarwell is one of the most demanding professors I've had. She leads discussion sessions as if she was doing surgery--the result is clean, insightful comments that you will actually learn from, instead of suffering through. However, she is very nice and is very interested in the subject matter. As there is not a lot written on Latinos in NYC (suprisingly) and you do orriginal field research (ETHNOGRAPHY), you feel like you are actually contributing something. The reading, while heavy at times, was all facinating and well thought. Also, as there are no pre-reqs, you can talk your way in (as I did), which is rare for an ethnography class.\nWorkload:\n150 pg + a week, plus a typed response paper (ungraded) two mini field work assignments (3 hours in a neighborhood with a partner) and the final paper, 15-20 pages, pased on your own field work. Is a lot less work than she leads you to believe, just a HUGE time committment. \n"
        },
        {
            "course_name": "BC3082 Introduction to Social Theory",
            "review_date": "December 31, 1999",
            "review_content": "\nThe first day, Marwell seems pretty tough and mean, but that's generally to weed the weaklings out. Nevertheless, you'll never be able to shake the feeling that she's an angry/cynical person (or as one person said to me, a militant activist under self-restraint). No doubt this will come to mind as she grades class participation (15%) by calling on people randomly and putting questions to them. That aside, this is the most straightforward class I have ever taken--the readings hit you hard, but are really interesting (Marx, Durkheim, Weber, DuBois, and Gilman, plus examples of social theory articles). Likewise, the lectures are INCREDIBLY organized but only to go over the reading, though there's always a discussion waiting to happen. Grading is quite reasonable and fair. All in all, you'll end up quite acquaintted with the material.\nWorkload:\nWeekly quizzes (keeps you up on the reading), take-home midterm, and final. Readings can sometimes be a bit much.\n"
        }
    ]
}