{
    "prof_info": [
        {
            "prof_name": "Abdi Ega",
            "prof_id": 10620,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "November 03, 2010",
            "review_content": "\nThis class was UNREAL. As other reviewers have mentioned, the class is structured in a way so that you need to attend exactly two lectures for the entire semester. Even as someone with an interest in Anthro (although not an Anthro major) I found this class incredibly painful. While Mamdani is no doubt a very intelligent man, this proved to be his main downfall, as his lectures were terribly disorganized and very difficult to follow. To be honest, the first few were very interesting and far clearer than his later ones, and I suspect he started working on a new book or something because his lectures turned shit toward the end, and his missed a lot of classes.\nAgain, as mentioned by others, the grading is entirely dependent on your TA and due to the absolutely enormous size of the class, there is a huge variation in TA quality and grading criteria. My section was absolutely infuriating, and our TA completely incompetent. In our section, half of the class commented irrelevantly on \" white people vs. Africans\" this, and \"well, because I'm half Jamaican\" that, while the other half either texted on their Sidekick phones or were absent. The TA turned every class over to the \"student presenters\" of that weeks readings (which no one ever did) and would interrupt whoever was bullshitting some response to lecture us on \"the way things actually are.\" This was the worse class I have ever taken at Columbia and a massive disappointment. \nTRUE STORY: I was told to come to my TA's office hours because I had missed to many sections. I walked all the way up to Knox, waited while he met with another student for 20 minutes, then sat down with him and explained that I had IN FACT not missed more than 4 sections. His cell phone rang, and he took a phone call. He hung up and said that he was sure that I had missed a lot of classes. I asked him how he knew this, seeing as he does not bring a single pen, pencil, book, notebook, or scrap of paper to class, let alone take attendance. He replied that he knows who should be there when he sees empty seats in the classroom. Then he called me Christina, that is not my name. That is not anyone's name in our class. \nHe also accidentally emailed everyone in our section's grades to the entire class. \nWorkload:\nApprox 200 pages of reading per week and weekly coursework responses-- sort of optional; it was rare for more than 12-13/18 of the section to turn one in on any given week.\n2  Medium-length essays graded by the TA and not returned.\nPresentation in discussion section-- I missed the class where I was supposed to give mine, and never made it up or explained myself.\nI got an A in the class. Bullshit\n"
        }
    ]
}