{
    "prof_info": [
        {
            "prof_name": "Kate Levin",
            "prof_id": 900,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "April 25, 2013",
            "review_content": "\nIf you are a first year student who just found out they have Professor Levin for Women and Culture, you should be ecstatic. I chose to take women and culture because I thought I would get a good professor--and it worked. Professor Levin is absolutely fantastic. I loved her english class so much that I took her seminar the following semester, and it was just as great. I came to college not realizing that I didn't know how to write a paper, and when I figured that out, I was scared. Professor Levin helped me through the process and by the end of the course I really felt like I could write at a college level. She gave extensions, came in to meet with me during her own free time, and allowed me to submit about 5 different thesis paragraphs till it worked. Her goal is really to help you write well. She will make you work: there is plenty of reading to do and probably more writing than other classes, but it is nowhere near excessive and very manageable as a first year student. I found class discussions to be excellent in large part because of Professor Levin. You also don't need to be into English to enjoy this class--I'm a math major and I loved it. \nThe bottom line with this class is that you will get enormous amount out of it as long as you put in the effort, and Professor Levin will really help you out along the way. \nWorkload:\nfy english: reading for every class, 3 papers (1 short one, 1 creative one, 1 research paper)\nfy seminar: reading for every class, 3 papers (1 close reading, 1 personal criticism, 1 creative project). the last two papers were really fun. \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "November 11, 2011",
            "review_content": "\nTake this class! Professor Kate Levin is extremely approachable and caring. Because she is a mother herself, she understands how students feel and is lenient if you are sick, will be late to class, or need an extension.\nYou don't necessarily have to read all the books but if you want to participate in class discussions you should read them. She spaces them out over a course of about 2 class periods so it's not that hard to finish a book.\nWe read: Hymn to Demeter, Antigone, Metamorphoses, The Pillow Book of Sei Shonagon, Kebra Nagast, Marie de France: Lais, The Canterbury Tales (General Prologue & Wife of Bath's Tale), Shakespeare's As You Like It, Sor Juana Ines de la Cruz, Chinese poets, Aphra Behn's The Rover.\nIf you are bombarded with midterms, she will let you have an extension! You also get 3 extra credit opportunities to improve your grade.\nYou should get a binder for this class because she gives out a lot of handouts.\nBefore you write your papers, she holds conferences that can really help you organize your ideas and formulate a thesis. In total you write 2 essays (4-6 pgs) and 1 research paper (8-10 pgs). You write a draft for each before the final is graded. Not hard at all!\nGrades: 85% papers (paper 1. 25%, paper 2. 25%, research prospectus/bibliography 5%, research paper 30%), 15% attendance & class participation + considerable weight toward improvement during semester\nWorkload:\n2 essays (4-6 pgs)\n1 research paper (8-10 pgs) - prospectus, annotated bibliography, outline\nYou write a draft for each before the final is graded.\nNo final.\nNot hard at all!\n"
        },
        {
            "course_name": "Women and Culture Seminar and First Year English",
            "review_date": "May 07, 2010",
            "review_content": "\nProfessor Levin clearly enjoys what she teaches, and the effort she puts into the course shows. There are three papers for Women & Culture, and she collects ungraded first drafts on which she gives AMAZING feedback. She comments throughout the paper and gives about a paragraph of very constructive criticism at the end. \nThe final project is also really fun and creative. Professor Levin will push you beyond your comfort zone a little bit, but she knows what she's doing.\nThe class time itself is also really helpful, although I think it depends a lot on classmates as well. Professor Levin asks provocative questions, and facilitates very interesting discussions. A great class!\nWorkload:\nThe workload is not bad. Read the books, write the essays, and you will be rewarded!\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 27, 2008",
            "review_content": "\nProfessor Levin is a great Professor.  At first I did not like her teaching style.  I though she was not  \"brilliant\" enough to be an English professor at such a well regarded institution, but my opinion quickly changed.  Though she may come off as somewhat of a unsure, non-helpful person, she is quite the opposite.\nProfessor Levin is ALWAYS there when you need her.  She is helpful, and always willing to come in and work with you on your papers.  If you have a question she can't answer off the top of her head she will find the answer and email it to you within hours.  Even things that are somewhat trivial!  She is willing to grant extensions on short notice (provided you have a really good reason), and wants to make sure that you are doing okay both academically and otherwise while at college.  \nFrom what I have gathered from reading other students' papers, she is a tougher grader than a lot of the other First Year English professors.  While she doesn't inflate grades, she does tell it like it is - meaning she gives you the grade you deserve.  If you put the effort in you will do well. \nWorkload:\nThree papers.  Rough drafts are NOT graded!!  A fair amount of reading (it's an English class!).  Come to class.  \n"
        },
        {
            "course_name": "First year english",
            "review_date": "December 12, 2008",
            "review_content": "\nThis course really improved my writing. Professor Levin was clear about what she expected and was always available to make time outside of class to help out her students. She is a good Prof and knows when to let students run with the discussion and when to take the discussion back to its focus. She is accomodating and I know will give you an extension if you need it. She is clear about what she expects from papers. \nThe reading for class varied, some was great, some was ok. Either way the discussions tended to be interesting and inclusive. There wasn't a competitive atmosphere in the class. Recommended!\nWorkload:\ntwo 8 page papers, 1 final research paper (10 pages)\n"
        },
        {
            "course_name": "Women and Culture II",
            "review_date": "June 14, 2004",
            "review_content": "\nI dreaded going to this class. Professor Levin is nice enough, but she seemed more interested in talking about facts and grammar and less interested in making the material relevant to her students. Our discussions were awkward and stilted. While she wrote all over my papers, I felt her comments were unhelpful and her grades were inflated. Conferences with her were frustrating. When I came to her with an idea I was excited about, she said \"good\" and sort of nodded at me. I wanted to discuss my paper topic with her but she just seemed intersted in ending the conversation. She tried to discuss creative ways of structuring papers, but if I understand correctly the role of Barnard's first-year curriculum is to create an academic/scholastic foundation. This Kate Levin did not do. I wanted her to say \"This is the traditional method of structuring a paper\" and then say \"Now here are some more creative methods.\" We never learned the traditional method. Goind to the writing center helped more than going to her. We watched the movie The Hours (we didn't read the book) and discussed its relationship to Mrs. Dalloway. One girl asked about the female relationships and \"the kissing.\" Kate Levin's response? She talked about how Virginia Woolf and Vanessa Bell were sister so it was weird that they were kissing. I wanted to leave the room. Try and get out of her class if at all possible, especially if you want a prof who will challenge you to be a better writer instead of coddling you.\nWorkload:\n3 papers, I think. You hand in (ungraded but marked-up) rough drafts for the first two papers but not the last. A final \"creative\" project at the end about \"what the course meant to you.\"\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 16, 2003",
            "review_content": "\nProfessor Levin is caring, sweet, and ready and willing to help. She is very accessible.  I found her to be very helpful with my writing, she really walks her students through the process and makes writing a research paper practically painless.  She also makes a different student lead the class discussion everyday.  Despite that, there were too many long, awkward silences when no one had anything to say.  Overall, a good class, just not the most exciting one.\nWorkload:\n2 4-6 page essays (each with a ungraded first draft), 8-10 research paper, and maybe 50 pages a week.\n"
        },
        {
            "course_name": "First year english",
            "review_date": "November 16, 2003",
            "review_content": "\nLevin is someone who puts a lot of work into her classes but handouts dont make a course. She is knowledgable about backround on texts but is unimpressive when it comes to analysis believe it or not.  She also has quite a lot to say which can be good and bad.  She goes to town on your papers but dont expect to improve anything dramatically.\nWorkload:\ntwo 5-page papers, one 8-10 research\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "November 16, 2003",
            "review_content": "\nProfessor Levin works very hard for her classes but information packets do not make a course.  She is very informed of scholarly opinion and background information but has little worth remembering in the way of analysis.  She talks a lot, often at the expense of your ideas, and goes to town on your papers, but dont expect to improve your writing dramatically, especially by her standards.  Get used to the phrase \"B+ is a REALLY good grade in MY class.\"  and also empty out your inbox for her flood of emails...Shes not the worst teacher in the world, and obviously appeals to some students, but i found her class an excruciating experience.\nWorkload:\ntwo 5-page papers and one 10-page research paper\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "August 31, 2003",
            "review_content": "\nI loved this class!  Prof. Levin expects a lot out of her students, but she puts an amazing amount of work into the class.  She definitely kicked my writing into shape.  Although a couple of the required texts weren't terribly stimulating, we always had great discussions in class.  Prof. Levin has plenty to say and is incredibly knowledgeable, she is also great at facilitating her students.\nWorkload:\n2 5 page papers, 1 10-12 page paper, lots of reading.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "May 10, 2003",
            "review_content": "\nShe went to Yale and will somehow find a way to work that into  every lecture. While she is very sweet, the class is extremely dull unless you make something of it. She tries to help, always available for office hours, but if you are looking to radically improve your writing, it most likely will not happen.I would not recommend taking the class based on the syllabus, by the end of the semester I dreaded going to class.\nWorkload:\nmoderate- about 4 papers, rewrites on all of them- only the second draft is graded.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 15, 2002",
            "review_content": "\nShe's a really sweet lady who is a great writer/editor. However she takes her job to seriously and gives you lots of work. She is very opinionated and you need to figure out what she's thinking all the time and what she's looking for from a text. She is big on class participation. Overall, she does improve your writing.\nWorkload:\nThree major papers, 4 to 5 responses, read a book a week.\n"
        }
    ]
}