{
    "prof_info": [
        {
            "prof_name": "Rene Testa",
            "prof_id": 1063,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Structural Analysis",
            "review_date": "August 08, 2012",
            "review_content": "\nThe way Testa teaches this class is a huge improvement over how he teaches Mechanics. He is more organized, speaks directly to the class instead of sitting down and writing on the projector, and actually tries to help the students understand the material. The course itself is not very hard and just reinforces and expands upon a lot of what you learn in Mechanics of Solids. You have to take it for the major, but it is definitely less painful than some of the other required classes.\nWorkload:\nWeekly problem sets, two midterms, and a final. Nothing too hard if you pay attention and understand the examples.\n"
        },
        {
            "course_name": "Mechanics (Statics & Dynamics)",
            "review_date": "January 17, 2012",
            "review_content": "\nBy far the worst professor I ever had, made me reconsider taking a minor in civil engineering. He is very organized, uses an unfriendly book, as well as teaches from a different book and sequences the chapters randomly. It is hard to figure out which chapter he is one, as he combines concepts from different chapters and jumps randomly back and forth between chapters. His notes are unorganized, and his methods are unclear. He could make a kindergarten class challenging. DO NOT TAKE HIM, YOU WILL REGRET IT.\nHis grading is random, you could answer things right on the exam and he could still take away points, then you can go and talk to him about and he would say that you are testing his teaching methods and tell you that these points don't matter and you should focus on the material!\nFinally if you have taken the material before in another institution you will be fine because his exams are not hard but BEWARE!\nWorkload:\nhomework problems are simple in theory but the wording is hard to decipher. It is hard to understand what he wants.\n"
        },
        {
            "course_name": "Mechanics (Statics & Dynamics)",
            "review_date": "December 19, 2011",
            "review_content": "\nTesta is hands down the worst teacher I have ever had. The material is highschool level physics with some vector analysis worked in, but he finds a way to make it difficult, mainly because he does not teach out of the book, words all problems as ambiguously as possible, is a disorganized and uncharismatic lecturer, and refuses to help you during office hours (He actually gave me the silent treatment when I asked him a question). If you ask him a conceptual question regarding a problem, he tells you to look at the math, or repeats it back to you. This is fitting, because all he does during lecture is read the equations that he is illegibly scrawling out. To top it all off, he butchers vector notation for the fun of it\nTests are as ambiguous as the homework, which is fantastic because his so-called conceptual questions are usually worth a third of the points, and include gems such as \"Tell me something about point A\". All of the actual problems that he gives are incredibly easy, both on homeworks and tests, once you figure out what he's asking for.\nIn short, save yourself the pain and take this class with Hone in the spring.\nWorkload:\n9 homeworks 2 midterms 1 final (50%)\n"
        },
        {
            "course_name": "Mechanics (Statics & Dynamics)",
            "review_date": "January 05, 2011",
            "review_content": "\nThe Good:\nTesta is a native speaker of English, and he'll tell you what's on the test if you show up the day before a holiday. Also, this is fairly easy material - you could get an A by knowing perhaps 6 equations and being willing to scramble a bit. He claims that if you've done poorly on a single test, he'll weight that test less than the others in your final grade (though this is obviously very difficult to verify).\nThe Bad:\nTesta's teaching skills are among the worst I've ever encountered. Therefore, the class seems much harder than it really is.  Material on the blackboard is organized illogically or not at all. Examples jump from board to board in a very nonlinear fashion, and there are no sequential, step-by-step explanations of methods (a particular tragedy because this class is basically a series of recipes). Testa's handwriting is very unclear, and he does not vary his tone, volume or body language to emphasize important points. When examples are demonstrated on the board, you will never, ever be told what the purpose of the calculation is until after the whole example is worked out. This means that you sit taking frantic notes for 15 minutes before you understand what you're trying to find. The questions on homework and tests are very, very ambiguously worded. \nIn Conclusion:\nIf you already know statics or get a tutor to explain things, you'll probably dominate this class because everyone else will be confused by the poor instruction. Otherwise, it'll be a long, hard slog of trying to fathom Testa's meaning. Dynamics is a given short shrift and squeezed in at the end. \nWorkload:\n2 \"Quizzes\" (really midterm tests): Ambiguously worded problems, but can be finished in 1/2 hour if you know what you're doing.\n1 Final: Barely longer than the midterms, hugely biased toward the very end of the semester.  Also quite vague. \nWeekly problem sets, typically three multi-part problems each. Easier than HW for other engineering classes, but much harder to figure out what the HW is asking. \n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 22, 2010",
            "review_content": "\nill get right to the point do not take this class with Testa\ni had test for engineering mechanics the topics and material covered in the class are easy it is all basic physics like newton, mechanics and work energy. however, testa finds a way to make this a lot harder than it needs to be. he is a very boring teacher and the notations he uses are difficult to understand so going to class just sucks but it pays off. i did not go to class and was able to read the textbook and learn that way but he asks stuff on tests that is qualitative stuff that he says in class so it is some what worth going to class. one question on each quiz(out of 3 or 4) is very ambiguous for example one of the questions said tell me something about point c\nDo not take this class with him it is hard and boring and you don't really learn anything in class.\nWorkload:\n10 homeworks(mostly pretty easy some hard) worth 10%, 2 quizzes(pretty hard averages were like 60 and 73 on them) each worth 20%, and the final worth 50% (hard)\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 21, 2010",
            "review_content": "\nTesta means well but conveys the subject matter in a very cluttered, convoluted manner during lectures. The course's subject matter is not difficult but can be challenging to learn because of his teaching style and the discrepancy between what is taught in class and what is supplied by the textbook (Testa does NOT like the textbook and especially in the last third of the course, and deviates in theory. He also teaches the manner in a way that jumps around the book in a non-sequential manner which may bother some---you'll have to search for the corresponding topics to lectures). \nThat said, if you go to Testa's office hours, he can be a bit more helpful.\nWorkload:\nSmall. Weekly problem sets that account for 10% of your grade, two midterms and a final.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "January 06, 2005",
            "review_content": "\nTesta is awful. He seems interested in the material, but just flat out doesn't know how to teach. He does however seem to care about getting his points across (he basically yells the entire lecture), but again he never makes any sense. this is a fairly easy topic, but he twists the second half of the semester into a collection of  garbage formulas.\nWorkload:\nweekly problem sets, never ever a break from them. 2 midterms and final\n"
        },
        {
            "course_name": "Design of Bridges, Buildings, and Spacecraft",
            "review_date": "May 16, 2004",
            "review_content": "\nI took this class because I'd like to become an architect and the name of the class sounds really cool right? Well it's too bad, because this IS the most boring class. Almost all my friends in this class agreed. No matter how interested you are in civil engineering or architecture, you will dread going to class, and most likely end up skipping it altogether (which most of the class did). Testa could make this class so enjoyable: we could look at slides and learn about the design aspects, and possibly design and build our own stuff. Instead, we do boring physics, test the compression and tension of steel and concrete, and learn about law!! If you are interested in all of that, then by all means take this class, but if you are truly interested in designing stuff, take another preprofessional class.\nAlso, most preprofessionals curve to around an A- because they are meant to get someone interested in the field and are typically easy. For instance, almost all my friends in different preprofessionals (such as ChemE) got As. However, Testa curves to a B-!!! When I told my friends in the class that, they were flipping out! \nWorkload:\n~7homeworks, which are are very difficult (20%), 2 midterms (Each 20%), final (40%)..his wording on exams is very unclear and confusing\n"
        },
        {
            "course_name": "Design of Bridges, Buildings, and Spacecraft",
            "review_date": "May 07, 2004",
            "review_content": "\nDon't let the title of the course fool you.  You won't be doing anything more interactive in this pre-professional class than watching a block of concrete get crushed in the Mudd laboratory.  What Rene Testa does is lecture, repeating himself in a monotone.  Did I learn some civil engineering?  Yes.  Could the class have been more informative, exciting, involving?  Definitely.  The professor is typical; nothing special.  \nWorkload:\nHe never tells us how the grading really works.  There are problems that are very toughly graded (I got 3/10 on many of the homeworks).  But those apparently don't really count.  There are also two quizzes but there is no curve that he gives, so who knows how well you are doing?  And a final exam of course, and still no word how much it counts towards the final grade.\n"
        },
        {
            "course_name": "Design of Bridges, Buildings, and Spacecraft",
            "review_date": "April 18, 2004",
            "review_content": "\nTesta is a really nice guy, too bad his lectures are boring. Most of the class passes out in the first 15 min (even the most attentive students). He repeats himself so many times that it is just as well if you only caught the first 15 min of lecture, or the last 15 min for that matter. If you have an immature side, you can find ways to amuse yourself. After the hearing stiff, member, shaft, and errect all in the same sentence multiple times, one can't help but let his/her minds wander and giggle just a little bit. The guest lecturers are more interesting only becasue their lectures are less general than Testa's. The guests are usually from the Civil department and talking about their specific fields. The labs are pretty cool though, if you are into bending steel/concrete beams or simulating earthquake failures. Bottom line, you have to really be into the whole structures and bridges thing to really get anything out of the class. There is not text and if you are not interested you'll sleep right through the notes.\nWorkload:\n7-8 HW assignments (3-5 of them are labs, WAY EASY), 2 Quizzes (insulting to the intelligence), Final (No sweat!!!)\n"
        },
        {
            "course_name": "Design of Bridges, Buildings, and Spacecraft",
            "review_date": "January 30, 2003",
            "review_content": "\nAww, come on, Prof. Testa is not so bad. The course itself is an introduction to the discipline, so naturally you end up hearing over and over things that are common sense, but eventually you will probably have a pretty good idea of what this field is like. Or not. The material just barely grazes the surface, never really letting you appreciate the complexities of the design process. Expect many guest lecturers (moslty from the department) concentrating on their individual areas of expertise. \nWorkload:\nWeekly or biweekly homeworks. Not difficult at all. Midterm, final.\n"
        },
        {
            "course_name": "Design of Bridges, Buildings, and Spacecraft",
            "review_date": "May 08, 2002",
            "review_content": "\nProfessor Testa is very boring. He teaches at the slowest pace possible and will review each topic of discussion at least seven times before moving on. Then he will review it again at the next lecture. The guest lecturers can be very interesting, however.\nWorkload:\nVery light, 2 Homeworks and 2 lab \"write ups\", 2 quizes\n"
        },
        {
            "course_name": "Design of Bridges, Buildings, and Spacecraft",
            "review_date": "May 01, 2002",
            "review_content": "\nThis is a boring man. He makes little or no effort to motivate an interest in the material, and when he does try he fails utterly. He seems to assume we all have an interest in the topic incoming (maybe he should notice that the course is one of the ones on the list of pre-professional ones). He is extremely reliant on powerpoint slides, and about two-thirds of the class is taught by guest lecturers on assorted \"specialty\" topics. He has a penchant for asking some extremely broad questions, and then some very specific ones on other topics. But most of all, he is boring.\nWorkload:\n4 fairly short homeworks, two quizzes, and a final.\n"
        }
    ]
}