{
    "prof_info": [
        {
            "prof_name": "Imre Bartos",
            "prof_id": 12578,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "July 28, 2015",
            "review_content": "\nDr. Bartos is basically all kinds of nice. Did his best to be helpful, was friendly, approachable, certainly not the type to yell or call you out. I dozed off a few times in his seminar and I felt so terrible about it, and he was probably secretly judging me on the inside, but he never said a word about it. \nIt must be so terrible for a genius like him to teach a course as basic as FroSci. I mean I liked FroSci for being a class I could relax in, but it was so terribly boring. Seminar sessions would get so painfully awkward because only one person would really participate, and she was basically participating out of pity. \nHe's not going to make your life difficult, and he's probably as good of a FroSci instructor you could get. \nWorkload:\nWeekly homeworks graded based on completion, midterm, final; for the lecture, there were weekly readings that basically no one other than a few of us did (but I still think it's a good idea to read them!), and attendance is required for the lectures and seminars. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "November 24, 2013",
            "review_content": "\nWhile Imre is incredibly nice, a forgiving grader and pretty hunky, he is not the world's best lecturer. He stutters and stammers from time to time, and had a hard time fielding questions from the obnoxious kid in our class (you know the one). I didn't mind his section though; he's pretty nice to look at and so are his slides. On several occasions, he let us leave pretty early as well.\nThe problems with FroSci stemmed not from the discussions but from the course itself. Yes, it's incredibly easy, but also mind-numbingly pointless. While Brain and Behavior was enjoyable, and Physics had engaging lectures, the Evolution section was just awful, both in lecture and seminars. Advice to the FroSci: keep the easy, lose the stupid.\nWorkload:\nWeekly homeworks, graded for completion. 1 quiz per unit, very lenient grading. Midterm and final, both with a cheat sheet allowed so yay.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 12, 2013",
            "review_content": "\nIf you just found out you got Bartos as your FroSci section leader, go find the registrars and make out with all of them. Imre is basically cute as hell, the kindest person ever, and casually on the Forbes list of Top 30 Under 30 in science (google it, shawty studies black holes and mosquitoes).\nHis PowerPoints are graphically wondrous and he breaks down everything important from the lecture in an organized list of key questions. He smiles a lot and stutters sometimes and his eyes are the color of a sea made of Brita filtered water okay I'm done. \nWhen he has office hours for you to turn in your homework, don't hesitate to ask him questions about anything you didn't totally get. He sits and works with you and then you can stare into the Brita filter\nWorkload:\neveryone in FroSci has the same homework, and Bartos only grades for completion, which is adorable. He is a ridiculously forgiving grader on the quizzes you'll have for each of the four units. He includes bonus questions...last quiz I got a bonus point for the question \"draw a wolf\"...\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 31, 2012",
            "review_content": "\nImre is a nice guy who has a good understanding of his subject matter. He's sort of adorable and ridiculously cheerful, so ladies, prepare to swooooooon. In a word, he's 'goofy,' but in the most endearing way possible.\nHe accepts homework late (as long as you've done it, he's happy, as always) and grades leniently, probably right around the way most FroSci professors do. His slideshows are amazingly helpful. I also like that he sticks to the syllabus while still throwing in tiny interesting bits of information here and there.\nHe has a bit of trouble engaging the class, despite his puppy-dog eyes. A lot of the time it was just a few sympathetic students raising their hand to kill the silence, or the one lone asshole who spends 15 minutes of class having a discussion about things that nobody else understands or cares about. (Hint to the kid who wouldn't shut up and move on: GO TO OFFICE HOURS) While his slideshows are great, they only work if the class is awake.\nAll in all, if you're in this section, relax. You've got a good teacher who grades fairly and enjoys the subject. He seems like the type of guy who would be happy to discuss science with you for years if you're so inclined or are having trouble.\nWorkload:\nExactly the same as other sections. Weekly homeworks, quiz at the end of each topic. Make sure to write something for every question because he seems to give partial credit for proto-BS.\nWe did the FroSci term paper MUCH earlier than other sections, which definitely was to our advantage. Some of my friends were doing their papers while studying for finals, when ours had been due weeks before. Hats off to Imre for not allowing the procrastinators to leave the work until reading week.\n"
        }
    ]
}