{
    "prof_info": [
        {
            "prof_name": "Christopher Heyde",
            "prof_id": 1220,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction To Statistics: Probability Models",
            "review_date": "December 11, 2005",
            "review_content": "\nYou had better already know why you'd want to study probability coming into this course, because you're going to have a hard time connecting what you learn in this class to applications in science or economics.  Professor Heyde used only a handful of examples, even of the toy sort that inhabit most probability books.  When he did work these (straight from the text), he would often pause for long, uncomfortable stretches, as though not sure where to go.  You will spend most of your class time following him through proofs.  If you don't know the meanings of the fundamental concepts (which are often simple to state), you will not learn them in class.\nThere are two texts for this class, the brilliant (though spare) Durrett and the hopeless and foggy Bean.  Homework was assigned almost exclusively from Durrett.  Buy Durrett and ignore the Bean, which does a poor job of explaining most concepts and often leaves important parts of a topic as an excercise for the reader.  Also, if you're not going to be an actuary, the pervasive actuarial topics in Bean are depressing.\nThe practice exams are much more difficult than the real exams; don't let that frighten you.  Seeing the math done in lectures was sometimes illuminating if your math is as rusty as mine.  \nIn Heyde's favor, he is looking for evidence you understood the probability concepts rather than mastery of the calculus.  This is fortunate, since it seems most of us this term were quite deficient in the \"tedious technical manipulation\".  Setting up the integrals correctly and making an effort to solve them is really all you need to do.  If you make an effort and write neatly, you'll get an A-.\nIf you're motivated enough to study the textbook until you grasp things but you're not a first-class math stud then this class is a decent warmup for more strenuous statistics courses.  If you can hack it, take a more advanced course instead.\nWorkload:\nAs noted, 6 homeworks (doing 4 of 6 problems earned an A this term), two quizzes, a midterm, and a final.\n"
        },
        {
            "course_name": "Probability Models in Statistics",
            "review_date": "December 31, 2003",
            "review_content": "\nThe lectures in this class were not very helpful, since I had to read the texts to figure out what was going on. Professor Heyde did no sample problems, only theoretical stuff and also some tangential material which was worthless. The homework assignments were taken from the texts, which was fair. However, Professor Heyde liked to get creative on the exams/quizzes and sometimes put on questions that surprised the class because the material had not been covered. I do not feel that I learned much in this class, I would not recommend it.\nWorkload:\naround 6 homeowrk assignments which weren't extremely difficult, three quizzes a midterm and a final exam\n"
        },
        {
            "course_name": "Time Series and Statistical Inference",
            "review_date": "October 07, 2002",
            "review_content": "\nI am a graduate student in the GSAS MAFN. Out of all the professors I have ever had during my four years as an undergraduate economics/computer science major and my one and 1/2 years as a mathematics graduate student, Professor Heyde is by far the worst professor I have ever had. He seems like a nice enough guy when you first walk into his class, but appearances are deceiving. He rambles all over the place during lectures, and pulls bits and pieces from 3 different books over the semester. He assumes that you already know much of the material, even though time series is a very obscure topic. He speaks in a monotone voice, pauses very frequently, and almost seems to be stalling for time. He teaches more of a theoretical approach to the subject than anything else but expects you to understand practical applications too. His blackboard writing is extremely messy. I have taken many math classes where professors have outlined complex proofs in a concise, logical fashion. Unfortunately that wasn't true for this class. I didn't enjoy this class at all.\nWorkload:\nDifficult. Long, tedious problem sets that consist of a lot of proofs and provide no foundation for an intuitive understanding of the subject.\n"
        }
    ]
}