{
    "prof_info": [
        {
            "prof_name": "Evgenia Papathanasopoulou",
            "prof_id": 7535,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 27, 2010",
            "review_content": "\nAwesome. Awesome awesome awesome. Nina is easily one of the best teachers I've had in any academic setting thus far. She brings tons of knowledge of the classics, especially the Greek readings (she's Greek herself and takes a special interest in Aristophanes) to the table, as well as a thorough understanding of the works read later on in second semester. Every class it is clear that she has prepared to facilitate a great discussion with good talking points to bring up, but lets students take the reins. Also combines a good mix of classwide discussion with group work (smaller groups discuss a topic, and then when the class regroups to discuss it that group sort of leads). Really sweet and understanding personality. About half the time she posts questions online for you to be ready to discuss in advance, and the rest of the time asks students to create their own discussion questions about a passage they're interested in. Grading is extremely fair; for the papers, it's clear she gets to know your writing style (at least if you have her both semesters) and grades both on content and on the effort you've exhibited. Also, the midterm was very fairly put together. The passages she chooses aren't utterly obvious, but if you've completed the reading and payed attention to what she highlights in class, you're golden. She's very understanding concerning the coursewide final-if it includes a passage we didn't completely discuss in class/focus on, she takes that into account in grading. She can take a good joke in class, too, although sometimes doesn't always understand the references to American pop culture, which makes for some funny moments. She's a PHD candidate in the classics department (I think), along with her husband. Can't for the life of me figure out how old she is, but she's got an adorable daughter who's about 1, so take that as you will. She's just amazing.\nWorkload:\nRegular Lit Hum-about a book a week with discussion questions to prepare for (sometimes you come up with your own), two essays, midterm (passage ID and analysis), coursewide final (passage ID, analysis, essay). \n"
        }
    ]
}