{
    "prof_info": [
        {
            "prof_name": "Nicole Gervasio",
            "prof_id": 12804,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "March 27, 2016",
            "review_content": "\nNicole was a pleasure to have as an instructor. At the beginning of the semester, she relayed to us that her forte was not in the classics, rather on queer literature, and that she would be learning with us. It was evident throughout the semester that she worked as hard as, if not harder than the students. She made sure to have one-on-one conferences about our writing throughout the process, and comfortably managed to get everyone to speak up during the seminar. Her feedback is so helpful, making clear suggestions for improvement and showing much interest in our work. She used multiple forms of media to teach in class, including mediathread (online image/art-type program), references to pop culture, a visit to the Met, and a class trip to an off-off Broadway version of A Midsummer Night's Dream. The way she pushed us to improve our skills managed to provide new lessons even for students who had already experienced the literature we were working on.\nMajor takeaway: Nicole is clearly interested in the work she teaches and in her students, and it is clear that she expects us to improve our skills in whatever capacity we can.\n\nWorkload:\nHomework at least once a week, usually short responses to passages related to the piece of literature being studied.\nThree major essays, one opportunity for \"perfecting\" one essay a second time to improve the class grade.\nField trip to the Met for extra credit, and an opportunity to see a show with other FYE Legacy students\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 04, 2014",
            "review_content": "\nNICOLE GERVASIO IS A GODDESS. I AM UPSET THAT SHE DOES NOT ALREADY HAVE A GOLD NUGGET. HELLO? IT'S BEEN LIKE 2 YEARS.\nTaking UW with Nicole is what inspired me to be an English major. She is so approachable and dedicated to making her students better writers. She is available as a resource at every step of the way, from random ideas and breakdowns to a full-fledged ~progression~. \nShe is also just in general a really chill person and I've kept in touch with her since leaving that class! If you have taken the intro to the English major, ENGL 3001, you know it is pretty much the 7th circle of hell if you don't have a good seminar leader. I'm taking it this semester and I am genuinely sad that I can't take it again next semester (Spring 2015) and have Nicole as a seminar leader!! So if you're taking it in the spring, there's no other option. You're welcome.\nWorkload:\nomg it's the same as every other UW teacher calm down\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 09, 2014",
            "review_content": "\nI took University Writing: Human Rights with Nicole Gervasio, and will DEFINITELY try to take another class with her, if she teaches one in the future, (fingers crossed).\nNote: Taking a themed based University Writing is seriously the way to go, because you get the opportunity to write about a topic that matters to you!\nIf you can, PLEASE take a class with Nicole Gervasio. First of All Nicole is a brilliant teacher who relates the class material to students so well. She provides an often needed serious approach to human rights issues, but also knows how to incorporate activities that provide levity to the classroom environment.\nMy writing improved immensely through Nicole's meticulous comments on each of my drafts coupled with visiting her during office hours. She's truly approachable & so experienced. I could not believe this was her first time teaching the course.\nNicole is a PhD student at Columbia (for English I believe) and does a brilliant job managing her time, really dedicating her all to teaching, it is obvious she truly cares. A really cool thing about having a PhD student for a teacher is that she often brings in material from her PhD courses, which really helps her undergraduate students!\nA huge plus is that Nicole truly cares about Human Rights issues, and that sentiment is delivered during each class as she fosters a respectable environment where students feel empowered to discuss and share.\nU Writing in general as a class will be a lot of work no matter who your teacher is, but having Nicole makes it 1000 times more manageable. She is flexible & understanding & doesn't take requirements too far, often adjusting where she sees fit for her students.\nI wish I could take this class 100 more times. I learned more than I ever have, I have a newfound appreciation for studying human rights issues, and am confident about my writing ability.\nNicole answers emails so fast, and is such an accessible faculty member, quite relatable and even allows students to call her by her first name.\nShe is a 5-star teacher, and any student is more than lucky to have her. Get this, she even purchased a portable projector to aid with class presentations, and truly made our tiny, awkwardly located classroom work well.\nNicole will get a Golden Nugget in no time, I know it's true!!!!! \n\nWorkload:\n(I think this is probably the U Writing standard, but I shall include it anyway)\nProgression 1: Critical Inquiry Essay (1500-1800 words, 15% of grade)\n(4 mini homeworks published to your own tumblr page, all based on article readings) also given published student essays to read\nEssay outline, formal draft, final draft\nProgression 2: Conversation Essay (1800-2100 words 25% of grade)\n(3-4 mini homeworks published to your own tumblr page, again based on article readings & choosing an exhibit to analyze) given published student essays to read\nEssay outline, formal draft, final draft\nProgression 3: The Research Essay! (2500-3000 words 35% of grade)\n(4 readings, a few mini homeworks, research library session for gathering evidence, annotated bibliography)\nProgression 4: Op-Ed (750-1000 words) \nObjective of this is to either 1. Choose a topic you explored in a previous essay and write an opinion piece on it, can include first person OR pick an entirely new topic. Also! Really cool, you MUST submit to a newspaper, website, magazine etc. to try to get published! Which is really cool (being published as a freshman is awesome! Nicole really encourages this)\nThere is no formal draft due for the op-ed, but if you submit something to Nicole she will edit it and give feedback as fast as possible.\n**only final drafts count for a grade, everything else is just for completion, will be penalized for late outline and formal draft unless given extension. (Just turn it in, her feedback really helps)\nAbsence Policy: 0-3 unexcused absences, or 5 excused absences (must notify Nicole about which policy you will be using at the beginning of the semester) Excused absences just mean you notify her before the class\n\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 07, 2014",
            "review_content": "\nNicole is a really amazing teacher for UW. I took her Human Rights themed section and it was clear from the start that she was very passionate about the topic. But that wasn't the only thing she was passionate about - she cared so much about each and every one of her students. On top of her weekly office hours, she is always willing to schedule an additional meeting outside of class whenever it works for you. She is very into being fair, and will almost always offer you an extension when needed but is also diligent about returning papers on time. She also goes out of her way to read first and even second drafts if you send them to her and give you feedback before you have to turn in a final graded copy. But honestly, I'd say the biggest reason to take her class is that it's just super interesting. Between her knowledge of the subject and the cookies she would bake for our class, everyone loved her, even the students that usually slack off. \nOne thing to consider is she's really cool about letting people do their own thing, and believes that some people work best while multitasking, so she lets people open their computers during class and says she \"trusts you.\" So not 100% of the class was engaged the whole time, but for me, it wasn't a bother. The people that had something to say spoke.\nWorkload:\nNormal workload for UW. Each class either a homework assignment (the exercises leading up to each essay) is due, or a draft, or the final paper. Pretty standard.\n"
        }
    ]
}