{
    "prof_info": [
        {
            "prof_name": "Sean Hallowell",
            "prof_id": 5600,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "August 13, 2010",
            "review_content": "\nThis was all that anyone could hope for in a Music Hum class. Sean is a funny, adorably erudite musicologist with a hipster vibe who always made class something to look forward to. It made a class I was dreading into one of my favorites of the semester. He approaches the \"Great Works of Western Music\" from an historical perspective - you'll be reading excerpts from primary sources (very very short) instead of the usual textbook - his comp lit background comes through a lot in what he focuses on (which means you won't spend the first week learning about what a treble clef is, etc.). Highly recommended. Consider yourself very lucky if you get Sean. \nWorkload:\nMinimal reading. Easy, straightforward exams. A few short papers generously graded. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 06, 2009",
            "review_content": "\nThis was a really great class. As a student with very little interest in studying music academically, I was pleasantly surprised to find myself not only enjoying the class but also doing well in the class. Sean was able to make the material accessible and enjoyable to learn. I highly recommend taking Music Hum with Sean. The workload is not outrageous and the midterm/final are doable. Fantastic class and teacher! \nWorkload:\nweekly responses, for both the midterm and final there was an in-class section (multiple choice and fill in the blanks) and an out-of-class essay (which was counted as part of the test). \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 15, 2009",
            "review_content": "\nSean Hallowell is a cool dude and a great teacher. He doesn't delve into music theory, as many music hum teachers are wont to do, and chooses to focus instead on music history, or how the various composers participated in the European art-music tradition. He's insightful and super funny. My one criticism is that there were a lot of life-long learners who seemed determined to undermine the class, wasting time with silly questions and inane comments, and Sean's niceness only encouraged them further--I wish he would have done more to keep discussion from straying off course.\n\nWorkload:\nWeekly responses (to a set of primary documents, a critical article, and the music itself), midterm, final, concert report.\n"
        }
    ]
}