{
    "prof_info": [
        {
            "prof_name": "Enrichetta Ravina",
            "prof_id": 5418,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Corporate Finance",
            "review_date": "May 24, 2011",
            "review_content": "\nThis was one of my favorite classes this year; Professor Ravina came to class prepared with a length slideshow (also available online) that fully and in great detail explained parts of how to value companies. She is a very sweet person and her lectures amply display her knowledge and willingness to teach her students. She makes learning valuation pretty interesting and I looked forward to her class every Monday and Wednesday even though it was at an odd time slot.\nIf you want to go into investment banking, definitely take this class with Professor Ravina; I had heard horror stories about other teachers who were dry and unhelpful, but Professor Ravina is very approachable and it excites her to see energetic students who wish to learn the material. \nThe course itself is sort of limited in its scope in that it only teaches how to value companies, so it is only practical for investment banking.\nWorkload:\nnot a lot; you are in a group of 4-6 of your classmates and you have to turn in problem sets (we had 3) which are done individually and cases (i think we had 4?) which are done with your group.\nThe first problem set is fairly straight forward, the next two problem sets are simple valuations.\nThe cases are more in-depth valuations but still pretty straightforward (follow the template she lays out in class, just make sure to take note of the small subtle differences, like including deferred taxes or whatnot!), and you get the benefit of working with your group.\nIn-class midterm, fairly simple, testing (easy) concepts (though there aren't that many concepts to test..), though I feel that the midterm was somewhat harshly graded; out of 120, more than half the class got above a 95.\nTake home final, to be done individually, another valuation that is pretty straightforward, with difficult questions at the end. Professor Ravina said to take 5 hours; but you might be pressed for time (I sure was!)\nIf you receive over a 85 overall (so over 85% on all aspects, problem sets, cases, midterm, final, participation), you will receive an A.\n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "April 29, 2011",
            "review_content": "\nThis class is a must for anyone interested in banking. It is extremely practical and by the end of the semester you feel you actually learned something which can be applied right away. The class is filled with people who have done internships, or who will do so, so expect a rather competitive environment.\nRavina's presentations of financial concepts was extremely clear, witty and she managed to make even the driest subjects interesting. The use of cases makes the learning process very interactive. The professor is lively, her Italian accent is charming and she responds to emails promptly. I definitely recommend this class!\nAlthough Financial Accounting is not an official requirement for this class, it will be very useful to take it before Corporate Finance. Although an accounting tutorial is given, it is way too weak to cover all the accounting knowledge necessary here. Plus, if you are interested in banking you should take accounting anyway.\nWorkload:\nThree problem sets, four cases, a traditional midterm and a take-home final (case format). Graded very fairly!\n"
        }
    ]
}