{
    "prof_info": [
        {
            "prof_name": "Jonathan Rick",
            "prof_id": 3053,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 20, 2012",
            "review_content": "\nProfessor Rick is an absolutely amazing CC professor! He is engaging and really interesting and definitely knows what he's talking about. I was initially worried about taking CC but he made it really interesting and relatively painless. And he's definitely really accessible and willing to help you if you have any questions on the material - he has tons of office hours and is really good at clarifying the material. You should be glad if you get to take CC with him!\nWorkload:\nmidterm, final, 3 papers.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 07, 2012",
            "review_content": "\nI cannot say enough good things about Jon. He is exactly what I wanted out of CC. I had a terrible first-semester CC prof, and I'm so thankful that I got into his spring section.\nJon is really passionate and knowledgable about the CC material. For me, what's even more important than that is the fact that he is  wonderful teacher. Jon leads class artfully by creating a perfect blend between his own fascinating lectures and class discussion. He is able to guide us without forcing us or babying us. He helps us understand complex concepts, and then leads us to think about them more broadly.\nIf you want to put in a good amount of work and deep thought, then Jon's CC section is for you. I applied to Columbia to take CC, and Jon was the perfect instructor for it. \nWorkload:\nPretty normal CC. Jon is thoughtful enough to cut down on some readings, since he knows that they're generally way too long. He'll tell us which sections or chapters are suggested rather than required. \nGrade Breakdown: \n15% Participation & Discussion Board Posts\n20% 2 Short Papers \n25% Longer Paper \n20% Midterm\n20% Final Exam\nJon let us double our first short paper grade if we preferred, instead of having to write the second. He is a tough -- but fair -- grader. His exams test us on our understanding of class material and ability to critically analyze and write. He's not out to trick us (there aren't quote ID's).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 25, 2011",
            "review_content": "\nIf you're considering choosing Jon's section for CC, do yourself a favor and read his negative reviews. They are spot-on, 100% accurate.\nJonathan Rick is one of the most boring instructors I've had the displeasure of having at Columbia. He lectures ceaselessly in his pretentious, monotonic voice and doesn't give a shit whether you have something genuinely interesting to say. To that end, I have never been in a class where class discussion was so paltry. Jon does NOTHING to stimulate class discussion; he might occasionally ask a basic question about the course material, but he always manages to refine your answer and has trouble getting somebody to answer his question in the first place. He peppers in some jokes and curse words to make things entertaining, but that just didn't really do it for me.\nGranted, he does have a mastery of the material better than most professors. He explains everything well--if your attention span can manage to listen to him--and often uses helpful diagrams on the board to aid in his explanation.\nBut I just can't get over how bored I was this past semester in CC. Maybe I was spoiled by my Lit Hum instructor, but I dreaded going to CC each Tuesday and Thursday, and each class seemed to last forever. His midterm and final were difficult and extremely specific, so you better know your shit coming into it. There's some element of choice, but you do have to know really well some of the material.\nThe papers were both the best and worst part of the class. The topics are all given to you--and extremely, extremely specific (picture a ten-part question outlining the philosophies of Locke and Hobbes)--which makes it easy to write the paper, but you have literally NO license for intellectual creativity in this process. Because of their specificity, they were harshly graded. Jon does give you a two-day extension for one of your papers, which is really nice of him.\nI mean, take this review with a grain of salt. Jon is not the teacher for me, but you might love him...? Just keep in mind that class discussion sucked, he can be semi-funny, and there's not too much work compared to most sections. In a word: mediocre, but I've had great core experiences and refuse to settle for two semesters of this.\nWorkload:\nNot too bad: standard CC reading, weekly discussion postings whenever he feels like it (he often feels like it), two short papers (600-800 words), one long paper (5-7 pages), midterm, and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 03, 2011",
            "review_content": "\nI would have to agree with the reviewer who has a tendency to put words in all caps when she wants to STRESS something. So I won't copy her; I just wanted to stress that Jon Rick is an amazing teacher and individual. You'll learn a lot in an incredibly relaxed and enjoyable manner and undoubtedly come out of his class with a much stronger (if not first awakened) love, nay- eros of loving wisdom. \nWorkload:\ntwo short papers, one long one. Predictable midterm and final, no passage id's\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 17, 2011",
            "review_content": "\nJonathan Rick is a remarkable person who is sincerely committed to his students' progress. He understands that not everyone does the reading and he knows why; he's always aware of the stress level at different points in the semester, and he adjusts the workload based on this. \nI am always impressed at how well he breaks down complex ideas and makes them accessible. Even when I come away from the readings understanding almost nothing, I come away from class with the kind of understanding CC is designed to give you. Jonathan understands when the class isn't grasping the material well enough to talk about it, and when that's the case, the class is as much as 70% lecture. However, when the class has some facility with the material, he's really excited to get us talking. He also sends out discussion questions for many of the readings, which can be several pages long and are EXTREMELY helpful in understanding them. \nThe class atmosphere is comfortable and fun, but seldom veers out of control (as discussion-based classes have a tendency to do). Jonathan rarely goes on irrelevant or useless tangents, but when he does they are brief and extremely entertaining. \nI enjoy this class. It is the perfect balance between work, serious analysis, open discussion, and comfortable group conversation. Jonathan Rick is an excellent professor who is probably easy to take for granted because he doesn't have an accent or a gimmick, but should really be appreciated.\n\nWorkload:\nThree 600-800 short papers with detailed, specific prompts. (One of these was dropped and he let us duplicate our higher score from the first two.) One five-page paper with detailed prompts (these are extremely helpful). Discussion posts the night before some of the classes, basically at his discretion. One \"presentation\" per student where s/he had to develop discussion questions on one of the works and compile relevant quotes, posting this information on Courseworks. This \"presentation,\" coupled with participation, were a large part of the grade. Midterm/final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 16, 2010",
            "review_content": "\nJon Rick is exactly what I wanted out of CC. His lectures are interesting, and even though he certainly tries to encourage participation, you'll fear interrupting him because you want him to keep talking. His class notes are very clear, and he goes through the effort of sending out notes in emails for a lot of the readings which was really nice. In addition the other reviewers aren't lying when they say he says funny things, he can be laugh out loud hilarious at least once, if not multiple times per lecture. Sure if you take him the wrong way you might feel like he's picking on you sometimes, but he doesn't mean it that way, and he does it to pretty much everyone equally. Moreover, he's very reasonable when it comes to assigning papers and work.\nWorkload:\nReally nice in my opinion, at least when I look at some of my friend's in other CCs... three short papers one of which was optional (only 600-800 words each) and one standard longer 5-7 page paper. Standard CC reading, which you can sometimes get away with not doing, but don't make a habit of it. Easy short discussion posts sort-of-weekly (as in when he feels like it.) Midterm+Final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 12, 2010",
            "review_content": "\nJon Rick is incredible. As a philosophy major, I've taken a few philosophy courses here at Columbia, and Professor Rick is able to clarify complex arguments more intelligibly than any of the tenured philosophy professors I've encountered here. But what is more impressive, from these clarifications, he raises challenging questions that truly engage meaningful class discussion. Habitually, I would walk into class not truly understanding the significance of an assigned text, then I would walk out of class thinking that same text was the best thing I've ever read. Professor Rick is absolutely brilliant. \nClasses are the perfect combination of lecture on discussion, and Professor Rick tries to focus on what the class is interested in and stay away from things the class is not interested in. Lastly, he is hilarious. He not over-the-top funny, but every once in a while he will just say the funniest things. \nHe's also really available outside of class, and enjoys meeting with students. And talking to him about a paper before you turn it in will really help your grade. Though overall, Professor Rick is a really fair grader.\nBasically, this teacher is fantastic. I don't know why he's not teaching more classes at Columbia at the moment, but as soon as he teaches another class, I'm signing up for it. \nWorkload:\nTypical CC readings, three short papers (2 pages) (Professor Rick made the third one optional), occasional discussion posts, 5-7 page paper, midterm, final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 14, 2007",
            "review_content": "\nBleaugh.\nI don't know what it is. He knows his way around the material backwards and forwards, and he's a pretty nice guy, really, but:\n* He alienates students with random jerky behavior\n* His vocabulary is overly loquacious to the point of tedium. Har har, right, but there is NOTHING he can say without dropping a five-dollar word in the middle. Nothing! He can't even talk about pizza without saying \"a certain, uhm...\"\n* For some reason, he's unable to get a discussion going on anything but the most controversial topics\nI can't explain it, but something rubs me the wrong way in here. But he's not a bad PERSON. And he's certainly not the worst CC professor, so give it a shot, maybe you'll like it more than I did... moreso if you're a philosophy major, I think.\nWorkload:\nTen one-page papers, which you can write when you want. That's a nice thing. Two long papers, standard CC midterm and final. He's a fairly forgiving grader and doesn't penalize you if you put the effort in.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 28, 2007",
            "review_content": "\n    Jon Rick was more than a good teacher, he changed my life.  It wasn't until I heard his description of Homer that I at last understood that Homer had relevance to today, that in many ways, Homer was speaking to me personally.      As he explained the wrath of Achilles, Jon Rick seemed to channel the primitive emotions of the ancients, whose hirsuteness he has somehow inherited.  The grimaces he made, his bombastic waves of the hand, the veins that bulged in his neck all screamed the uncanny Greekness of his passions: he is a man who does not simply teach, he inspires, just as, one can only imagine, Socrates inspired his students (and it is a well known fact that Socrates too was a hairy man).\n    Each class with Jon Rick was a pulsing merry-go-round of emotion, I cannot recommend this budding star enough, the mellifluous tones of his voice set his students' heart aflutter, as they strapped themselves in for the wild ride of his explanations of Augustine's \"City of God\".       Listening to this man speak, at times, I felt as if I were Anchises, carried from burning Troy on the shoulders of a hero, my thighs squeezing his throbbing ribcage beneath me.  \nWorkload:\nThere was a bit of work (papers, classroom discussion), but there's no amount of work his students would refuse him.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 01, 2006",
            "review_content": "\nJon was, at best, mediocre. He is not very good at keeping a class discussion and occasionally made a joke (albeit funny) to wake people up. There is not really much to say. If his section is the only available one, don't worry; the experience won't be miserable (just do the reading and participate a little bit). If, on the other hand, you have a choice I recommend staying away from him. \nWorkload:\nTwo papers, a midterm and final. Standard CC reading with 10 required 1-page posts. \n"
        }
    ]
}