{
    "prof_info": [
        {
            "prof_name": "David Cohen",
            "prof_id": 1388,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 07, 2012",
            "review_content": "\nMaybe I had a Cohen's evil twin for music hum this semester, since his previous reviews don't make any sense compared to what I experienced.\nVery few pros: \nCohen is incredibly passionate and knowledgable about the music. He's also a generally well-meaning and kind person. He's cute and nice in a grandfatherly way. Truly, I WISH he had been a good teacher. I hate trashing such a nice guy, but I think all of his future music hum students should know what they're getting themselves into... so they can switch out of his section.\nSo many cons:\nCohen is a TERRIBLE music hum professor. Let me explain....\nHe should not be teaching students who have no prior music knowledge. He gets visibly frustrated when we ask naive questions, even though music hum is supposed to be a class for beginners. Rather than teaching on broad concepts that might help us get a grasp of classical music, Cohen focuses on tiny details - and tests us on them! It is incredibly frustrating for me, especially since I genuinely wanted to come away from music hum with an appreciation for classical music. All I've done is stuff my brain with random facts and tunes that I'll regurgitate for the final and forget 2 days later.\nCohen is also ridiculously disorganized. He takes so long to teach every little, minute concept that we ended up barely covering anything outlined in the syllabus this semester. On our Courseworks site, the syllabus says that our grade breakdown is: \nClass attendance and participation: 15%\nOne written listening report: 10%\nOne written concert report: 10%\nQuizzes: 20%\nMid-Term examination: 20% \nFinal examination: 25%\nHOWEVER, we've only been evaluated twice this whole semester: two incredibly detail-focused quizzes. Listening report? Concert report? Mid-term? LOL. As it turns out, we'll also be having a final exam...which he announced about a week before it was scheduled to take place. We've asked him how much the final exam will weigh for our final grades, and he replied with \"I'm not sure exactly, but a lot.\" WTF. I'm not kidding. The thing is, I'm all for learning for the love of it, but the way Cohen conducts this class is just not fair. We deserve to have clearly outlined expectations.\nOn that note, Cohen does indeed give out extremely detailed \"listening guides\" for the pieces we'll be tested on. Don't be fooled by these \"gifts\"....they are (and he is!) INSANE. He literally expects us to be able to recognize specific seconds of specific movements of specific pieces. I've never been expected to learn anything in such detail. Cohen will email us 3-4 times per week correcting his previous 2-3 emails, saying that we should be focusing on seconds 20-45, not 19-42. Again, not kidding. He ALSO expects us to know pieces that we haven't even covered in class because we ran out of time and couldn't cover them. Again, UNFAIR in so many ways.\nIn sum: Do not take Cohen's section of music hum. He is a nice guy, but an AWFUL instructor. I wish I could go back in time and take someone else's section. I had such a wonderful art hum experience, and I've been so disappointed by music hum. I know for a fact that other music hum teachers make the course worthwhile.... Unfortunately, Cohen's not one of them.\n\nWorkload:\nHe emails us 4-5 times per week with EXTREMELY detailed \"listening guides\" and homework assignments that you don't really need to complete. Nothing gets handed in at all. We were assessed on 2 quizzes that were ridiculously detailed and nit-picky. Also having a final.\nStudying for the quizzes and final is a huge bitch. Otherwise, during the semester, there's no real work. Class is incredibly boring. Not rewarding at all. Blegh. Disappointment. \n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "September 10, 2009",
            "review_content": "\nProfessor Cohen's course is very difficult, and very rewarding.  He is rigorous and intense, both in-class and with the homework workload.  He takes the subject matter seriously, and expects his students to do so as well.  Professor Cohen clearly cares about teaching, his course and his students.\nHe states at the beginning of the semester that he believes the best way to learn is to do, and the homework assignments are drawn up with this thought in mind.  They are often tedious, long and difficult.  However, they are doable, and they WILL teach you diatonic.  Take this course if you have a serious commitment to music--you will find it rewarding.\nWorkload:\nIntense.  2-3 assignments per week, each can take 2-3 hours (sometimes more, rarely less).  One final take-home project at the end of each semester that takes many hours.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "July 09, 2009",
            "review_content": "\nThe negative reviews of Professor Cohen are not a reflection on him but on the rest of the music theory sequence at Columbia. Rigorous and thorough curricula should no be confused with meanness. I learned more from his class about how music works than all the other classes combined.\nWorkload:\nRigorous and at times tedious, but well worth it if you are actually interested in the subject matter.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "April 01, 2008",
            "review_content": "\nWhen I started this class last semester (year-long course), I hated professor cohen. I had been warned that he was a harsh grader, and gave a ton of homework. And it is true. But after being in the class for some time, my mind was changed completely. \nHe is a genuinely good person,he makes a point of saying 'hi' and having a casual conversation every time you happen to run in to him, or happen to be in class early. \nTrue, he does give a lot of homework. But all the assignments are worthwhile and really help you learn the subject.\nTrue, the assignments are torn apart once handed in (sometimes in front of the class) with long comments that can be taken as a bit insulting. But if you just ask him what he meant by some of the word choices, he explains what he meant, and that it's not as mean as you thought. Besides, his long commentaries really show that he takes time with each homework assignment, taking the time to correct everything to make sure everyone learns the subject. He has the best intentions at heart. \nHe is a harsh grader. If you are worried about your GPA more than learning, his class is not for you. (My section dropped in half, from 12 to 6, from fall to spring) \nThat being said. After taking his section of Diatonic, I feel like i have learned much more than students from other sections. Honestly, the other professors are good, but cohen really is the best.\nNow, I kind of wish he was teaching Chromatic Harmony and Counterpoint next year! \nWorkload:\nPlan on spending at least an hour on each homework assignment, and there is a homework assignment due every class. \n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "March 17, 2007",
            "review_content": "\nWithout getting into the question of evaluating Prof. Cohen, I'd like to note that it is not the case that \"all but four\" students switched sections in the spring. Several students did switch but considerably more than four remained. Also, Diatonic is taught on both M/W and T/Th, so a few of the switches could be people with schedule issues.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "January 17, 2007",
            "review_content": "\nYou know, I have REALLY tried to come up with something good to say about Professor Cohen ... and I keep coming up short. Is he a good professor? Sure -- if you are a natural at music theory and grasp concepts the first time you hear them. Not every Columbia student is this gifted, and Professor Cohen is not very patient with those who are not.\nHis workload is insane -- at first, I thought I was the only student spending anywhere from 4-8hrs. per assignment (3 assignments a week!), but I was not alone on that. I am not exaggerating in the slightest. His grading is equally harsh and feedback is informative, yet very often seems rude and insulting.\nThis is a class for the theory natural, NOT for someone who needs some extra help. Please know this going in. He has the potential to be a great professor, but one is not considered \"great\" in my book unless he can cater to all of his student's needs, especially in such a small class.\n(fyi - all but four of my original class switched sections in the Spring)\nWorkload:\n3 assignments weekly, occassionally graded and very lengthy.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "May 11, 2005",
            "review_content": "\nCohen is the man, hands down.  Beyond being a music theory expert, he is a lover of all knowledge, and loves to use just the right vocabulary words for whatever he is describing.  The homework is tedious--harmony exercises from a workbook and counterpoints--but just like Cohen says, this is the type of work that makes you learn the information.  He has the notorious reputation for turning back homeworks so late that you forget that you did the assignment that semester, and I didn't get my first semester grades until far into second semester.  However, these are trivialities.  He knows his shit and will get you to know it too.\nWorkload:\nHarmony exercises or counterpoint composition every class.  No final exam, but a final project that is really just a bunch of the regular homework assignments smashed together.  Extra lab period with a T.A. which is quite helpful.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "January 09, 2005",
            "review_content": "\nI struggled in this class and dreaded the counterpoint assignments, but I must say that Prof. Cohen is a great professor. He's clear and extremely knowledgable and although he comes off a little harsh in the beginning, he's a really good person. From what I hear he is much better than the other Diatonic profs. \nWorkload:\nCounterpoint assignments every class (can be quite frustrating) as well as theory from the workbook (much easier). You will put in a lot of time. No midterm or final, but one large assignment at the end. \n"
        },
        {
            "course_name": "Diatonic Harmony",
            "review_date": "December 26, 2004",
            "review_content": "\nProfessor Cohen is a very effective instructor.  His depth and breadth of knowledge of music theory and history is impressive.  His teaching style is motivated by a desire to communicate ideas well, rather than to cover as much material as possible.  I often found myself  gaining deeper insight into musical concepts I thought I already understood.  In class, plenty of musical examples are discussed in depth and played on the piano (Professor Cohen can play quite well).  The aural aspects of the theory are not skipped, so even though this is a theory class, I found my ear improving despite not taking a complementary ear-training lab.  During lectures he manages to convey a sense of excitement in the analysis of music, and discusses different ways to interpret passages, often taking suggestions from students.  While he does criticize people in front of the class, this is not motivated by spite but from a desire to see his students increase their performance and not repeat mistakes.  I can say firsthand that it works.  Never does the class get off topic or out of control, as do many classes which have student input.\nN.B.- Professor Cohen also has a fantastic command of the English language; your vocabulary will improve.  He also knows Latin, and possibly Ancient Greek.\nWorkload:\nThe course has a heavy workload, as Professor Cohen himself will admit, but the work does pay off.   The assignments are challenging, often requiring hours of diligent thought, but the pace is thoughtfully set to reduce the amount of tedium.  The homework assignment sheets are typed up by the professor himself,  often spanning pages and offering helpful suggestions and warnings about approaching the homework.  I remember that at the end of the semester, when he asked about whether he assigned  too much work, students responded that the workload was justifiable.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "December 17, 2004",
            "review_content": "\nProfessor Cohen is fabulous! He has a great sense of humor and really apprciates hard work. Cohen gets so excited about music theory during our lectures. It's so great to see someone so passionate about the class. One-on-one he's a little intimidating. Cohen reiterates counterpoint and voice leading rules so often that they are practically drilled into your head. Since he does this so much, Cohen also expects his students not to make those same mistakes over and over and sometimes gets frustrated when they do. He's very friendly and availble for help outside of class. Syllabus is a little vague and I'm not quite sure how grades will work out since only 3 homeworks actually had grades. Overall, I really loved Professor Cohen's class and highly recommend it to others. He's a great guy!\nWorkload:\nDifficult, frustrating counterpoint and harmony homework every class. Expect to spend hours writing counterpoint, finding a mistake and starting over from scratch. Homework graded on a check plus, check, check minus system. One final project which is just a huge homework assignment. Workload very difficult but manageable. You need to put the time in to get stuff right. \n"
        },
        {
            "course_name": "Diatonic",
            "review_date": "May 06, 2004",
            "review_content": "\nProf Cohen is a wonderful instructor.  The pace of the course was very consistent, examples from 'real music' distributed evenly throughout, and above all, Cohen was completely attuned to the individual and collective needs of the students in the class.  Regarding this point; it is a remarkable tribute to Cohen's abilitiy that this class was apparently able to please people at both ends of the spectrum of musical experience.  There were some who entered this class with quite a significant background in music, both in harmony and counterpoint, and others whose background was almost exclusively derived from the one semester-long; \"fundamentals\" course.  Obviously, putting these two types of students in a room (with a healthy chunk of us in between, of course), and trying to please everyone is going to be a challenge for any instructor.  But, Cohen handles it remarkably well.  The class, it seems, was neither too slow for the 'whiz kids,' who can derive significant joy, it seems, from asking and answering Cohen's questions, but neither was it too fast for the students with less formal training in music.  Cohen took time, throughout, on reviewing all sorts of musical base knowledge...'reminding' us patiently of what we should know already.  And, questions of the more basic variety were welcomed patiently as well as those that came from a more advanced understanding.\nSome students might object to use of the adverb 'patiently' in the above.  But, to be honest, I happen to think these students (like one review posted) are totally wrong in their portrayal of Cohen as a grumpy guy who hates people who don't know about music.  The man is incredibly patient with his students.  He has a very deep appreciation for the importance of musical education at this entry level, and it comes through in how he approaches the class.  But, try to be on time to class.\nWorkload:\nHomework for every class.  Graded on an ambiguous Check/Check minus/Check Plus scale...No midterm, no final.  Just a final project which is sort of just a big version of a normal homework assignment.  Demanding, and occasionally frustrating counterpoint and harmony excercises might even put one solidly on the path towards becoming a musician.\n"
        },
        {
            "course_name": "Diatonic 2319",
            "review_date": "January 04, 2004",
            "review_content": "\nAdmit it, Cohen is the God of music theory. If classes didnÂ’t have to end sometime, neither would he Â– such an extraordinary understanding of every aspect of music and structure this man has. He and his TAÂ’s are tough graders, but youÂ’ll still keep getting better and better. Diatonic could actually be a vocab class now and then if Cohen is your teacher, he loves inventing new semantics for expressing opinions about and interpretations of music. He is a very busy guy, and heÂ’ll often come in disheveled, unprepared, and is sometimes a bit forgetful Â– like you havenÂ’t seen that before. Just suck it up and deal, heÂ’s gone miles beyond his contract to make the curriculum better. Take him if you can. \nWorkload:\nLong HW exercises for just about every class, and a project at the end. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 08, 2003",
            "review_content": "\nWhen I first began taking this class with Cohen, I was overwhelmed by his attention to deal and all the technical stuff he was going over. By the time I finished the course, I was astounded at how much I had learned. The bottom line is, this class may seem like a lot of work in comparison to other Music Hum classes, but if you would rather discuss what's actually happening in pieces of music rather than discussing what you think you hear or feel about it, this is the way to go. Cohen isn't the warmest of people, and he can have a bit of a temper sometimes, but all in all he manages to get you to love the music as much as he does; that is, if you want to love it. \nWorkload:\nWeekly reading/listening exercises in the book (not a big deal); there was one paper, previously supposed to be 3 but we got so behind (he spends a long time on pieces) that we only had time for one. A few one-hour tests and a final. He gives you lists of pieces you need to study. Getting an A in this class is not hard if you go to class and pay attention.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "December 26, 2002",
            "review_content": "\nHmm...not a thrill to say the least.  He explains the most trivial detail so much that you either stop listening or become more confused than when he had started speaking.  Fairly nice but a bit condescending when answering questions.  If he didn't like what you had to say, he would cut you off and not listen.  Creativity is not very welcome in this class either.  I guess everyone has to go through the basics.  The TA (Paul) was much better, but Cohen did not stay coordinated with him.  Whatever...I strongly dislike Cohen, but the class is pretty light.\nWorkload:\nEh...not bad.  The exercises are sooo tedious.  If you want to make your exercises perfect, you CAN spend a long time on them.  I usually didn't find it to be worth it, because most were graded with checks, check-pluses and check-minuses.  There was no midterm and a minimal final project.  Very few homeworks were given a letter grade (two over the semester, maybe).\n"
        }
    ]
}