{
    "prof_info": [
        {
            "prof_name": "So Young Park",
            "prof_id": 1132,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 23, 2006",
            "review_content": "\nI loved having Professor Park for Literature Humanities and for any of you lucky enough to get her as your professor for the year, take advantage of her knowledge.\nThe workload in the class was standard, and probably a little less, in fact, than most of the other sections of the class. The midterm both semesters was to identify and expand on themes found in 8 of 10 quotations (1 page per ID max). The finals are coursewide, so nothing can be done there.\nHer grading style was extremely fair and very on point. \nWhile the grade one gets might seem a little low at first, after taking the time to discuss the papers with Professor Park, the grade does seem quite acceptable. She has a great ability to find flaws in papers, point them out to students, and have them work on correcting them in the future. From my own personal experience, I had many a conversation with Professor Park discussing a range of topics related to my papers and as a result of her careful discussion, I truly feel my writing has improved. Professor Park is also very open to paper topics that students have created for themselves, despite the fact that her topics are broad and provoke many original ideas. \nProfessor Park has seemingly earned a reputation of coming off as cold or bitter towards students who hold different opinions of the text than she does. I personally feel that this is an unjust characterization and that she does in fact care about her students. Attendance and regular discussion are important to Professor Park and the added effort of doing the reading definitely shows. If you take the step of actually doing the syllabus reading and coming to class prepared with the ability to discuss and provide evidence, Professor Park will become immediately warmer and more receptive. In addition, her treatment and preference of the texts matches many of the sentiments of students, making going through the texts easier and more enjoyable.\nIn addition to having a great knowledge of the texts and being a fairly young professor, she has the ability to connect with students both in and outside the classroom. \nProfessor Park holds make-up sessions for those observing religious holidays and understands personal situations that might require extensions or other remedies. She would always be available to help with questions about the texts and held extra classes to discuss better reading habits.\nOverall, Professor Park is a fantastic professor and would gladly recommend her to anyone looking to take this class.\nWorkload:\nFall: 2 papers (5-7 pages each), 3 reading responses (300 words max), 1 midterm (all ID identification), 1 in-class presentation and the coursewide final.\nSpring: 2 papers (5-7 pages), 10 reading responses (300 words max), 1 midterm (all passage ID and 1 \"most influential text\" paragraph), 1 in-class presentation and the coursewide final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 22, 2006",
            "review_content": "\nAnyone can benefit for taking LitHum with So Young Park for the entire year. She is immensely organized and efficient; her study questions are actually rather helpful (and a quick glance over them after the reading will prepare one very well for the class). Some previous reviews have suggesting that class participation is not a big deal with Professor Park, however, this is not necessarily true. Attendance counts, so go to all of them, and don't use more absences than allotted (typically 3). In addition, Professor Park seems to really appreciate those who regularly comment on the texts-even if you haven't read the entire text, focus on what you know. The person I sat next to all year didn't necessarily read everything, but he commented regularly and did great in the class. Her paper topics are interesting and pretty broad (typically a series of questions under each possible topic, any of which you could expand or elaborate upon). You can also propose a new topic, and meeting up with her to discuss your paper (typically you'll be required to at some point or another anyway) will really help, so take the time to trek over to philosophy and be rewarded for the effort!\nIn response to the charges that Professor Park is cold or unreasonable about other ideas, this is simply not true. She is a younger professor who has probably been taken advantage of before, and her assignments are rigid (hence few extensions, the ten response paragraph rule, etc.). Therefore, it takes her a while to warm to the class--you can remedy this easily by being a ready participant with strong opinions about the various works. \nAlso, bring up issues you have with assignments in a timely fashion. She is very professional, but she is certainly not cold. As far as class discussions, in my experience, she was always willing to address any adequately defended ideas. Having evidence helps a lot. If you get her, feel fortunate! If you're looking for a reliable, knowledgeable, friendly and accessable professor's section to transfer into, Professor Park is fabulous. \nWorkload:\nTwo papers per semester. Fall '05, 2-3 response paragraphs (300 words max.), Spring '06, 10 response paragraphs (300 words max.). Infrequent quizzes, which are essentially anounced, and are generally inspired by a lackluster discussion during the previous class (for example, after Don Quixote). Typical LitHum syllabus, plus Frankenstein in the spring. Attendance counts. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 27, 2005",
            "review_content": "\nS. Park is a very professional, business style teacher who genuinly is interested in her students.  She is accessible and friendly if you want to talk to her outside of class.  Much of the class is centered around study questions she presents and on textual analysis, which I personally enjoy a great deal.  Sometimes one feels as though she is controlling the discussion a bit too much and that more freedom could be given to ideas and topics outside of her lesson plan.  She can give pop quizzes ocassionally, so keep on top of the reading.  She is somewhat of a tough grader, but usually she is fair, although its not easy to get an A on a paper.  It doesn't appear as though class participation counts for very much, it is just the exams and essays, of which there are two of each.  If you expect there to be some kind of fudge factor or inflation of grades, which many other teachers do....there isn't, what you see is what you get.  \nWorkload:\nquotation and textual analysis on the midterm, standardized final, two 6 page papers.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 27, 2005",
            "review_content": "\nI'm compelled to write a review just to balance all the overwhelmingly positive things said about Prof. Park on CULPA. She is not an awe-inspiring, life-changing professor; in fact, there are quite a few lit hum sections that provide a better experience than the one you will find in her class. She is, at best, average, and at worst, an uninspired killjoy.\nA few things need to be noted. She is fair and not overindulgent with extensions. The way she chooses to pace the syllabus and the discussion is very sensible. The workload is relatively light and manageable, and you can learn from her assignments.\nHowever, she has this habit of subtly but insistently forwarding one specific interpretation as the only possible reading of certain passages. She's cold in and out of the classroom. Even when she eventually becomes friendlier, you get this distinct sensation that she never really likes anyone in the class, with maybe one or two exceptions. During discussion, she has a vaguely condescending air towards students' comments, making you feel as if you have to prove yourself to her - and often, she doesn't even react to what you have to say. She doesn't embrace ingenuity, and she prefers meticulously organized papers with obvious but specific thesis statements to well-written papers with creative/risky theses. All of this criticism is focused on her underlying tendencies, none of it is overt at all. \nSo, as much as I wanted to, I could never really like her a great deal, and I don't think she ever really liked me. That being said, I do feel that I've learned a lot from reading the texts and being in the class. Good luck with her.\nWorkload:\ntwo papers (4-7 pages), a straightforward midterm, occasional response paragraphs. she does not inflate grades at all.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 07, 2005",
            "review_content": "\nSo is definitely a keeper when it comes to LitHum. For someone of a more mathematical/scientific background like myself, So made the class pretty laid-back, which is what I liked. There would be many days in which more than half the class wouldn't do the reading, but there would always be those few who you could rely on to keep the class somewhat interesting.  While the class could drag at times, it was always nice to hear So's insightful and articulate points about the texts--these points sometimes became mini-lectures.\nAlthough she may seem stern at first, you will learn very quickly she is very kind and understanding. Overall: Good\nIMPORTANT: The class is pretty much made up of going over passages from the texts. Highlight every passage she goes over, these will be the key IDs that you will most likely see on the Midterm and Final.\nWorkload:\n4-6 page paper, Easy all-ID Midterm (hit or miss), 6-8 page paper, and Decent Final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 28, 2002",
            "review_content": "\nSo is easily one of the best, if not THE best teacher that I have ever had. Not only is she incredibly articulate and knowledgeable when discussing the works, but as the semester progresses, she totally opens up to the class, making the envirnoment not only very illuminating, but warm also and personable too. So may seem distant at first, but this seems to be her way of establishing authority, and she will cut short discussions if she requires more time to get through the texts in their entirety, however, her mini-lectures are always helpful when the complex subtleties of the harder readings are elusive. I attribute my conversion to the English major to So. She speaks the language better than anyone I have ever met in my life, and she raised the intellectual level of the class to a degree I have rarely encountered. If you are lucky enough to be taught by her, pay attention, because you are so lucky.\nWorkload:\nStandard Lit Hum. Very few additional works, but expect to go into detail with the ones on the syllabus. A one page-ish response is due for every book (easy if you put some thought into it and are honest about the work). So only cares about the number of pages you write, so you can actually turn in one 15 page paper if your want and be done with it. Fairly graded, but not necessarily easy. A none-too-hard midterm and final, if you study and pay attention in class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 03, 2002",
            "review_content": "\nShe was nice. It doesn't get better then that, especially in terms of lit hum. She had a good attitude every time she stepped in the classroom. She was so nice that you felt bad falling asleep. But overall she concentrated on the main points of every novel and left alot of place for class discussion and participation. Fair-grader. Overall she's a definite keeper\nWorkload:\nFall term: three essays with pretty easy topics, midterm (few IDs, passage analysis, essay), 1 pg response paragraph to each book due in class, final (just like midterm) Spring term: 100 words response per book emailed to her, 11 pages of essays (you work it out with her how many essays you want to write), midterm (just IDs), final (like final from fall term)\" \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 21, 2002",
            "review_content": "\nSo is a great teacher in a department where good teaching is surprising. She is nice and understanding, a fair grader and a good iniciator of class discussion. She is also accessible and not pretensious about her knowledge. As for the subject matter, she really tried to make it interesting and she did a good job. You'll fall asleep a few times, but that's more the books' faults, not hers. She's also eager to take you out for opera or food! If you get So, stick with her - she's worth it.\t\nWorkload:\nFall term: three essays with pretty easy topics, midterm (few IDs, passage analysis, essay), 1 pg response paragraph to each book due in class, final (just like midterm) Spring term: 100 words response per book emailed to her, 11 pages of essays (you work it out with her how many essays you want to write), midterm (just IDs), final (like final from fall term)\n"
        }
    ]
}