{
    "prof_info": [
        {
            "prof_name": "Christina Ferando",
            "prof_id": 2571,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 14, 2013",
            "review_content": "\nChristina is an excellent teacher. She's very approachable and easy to talk to and has a good sense of humor about art and about life in general. Her lectures were always interesting and well planned out. She normally allowed just the right amount of time for class discussion and did a pretty good job of involving the quieter students and limiting the more loquacious ones (which was no easy job in our section). That said there was no pressure to participate if that's not your thing. Just make sure you go to class and take good notes.\nChristina gives a bit more work than other Art Hum teachers -- there were 2 ungraded one page assignments early in the semester. But I really believe she does it because she wants her students to be better prepared for the graded assignments and exams. She definitely has high expectations as far as writing ability, so those who have said she's a tough grader are correct. If you're a math or engineering major hoping to coast through art hum, she's not going to give you an easy A. Also her exams are challenging -- totally fair and totally doable, but not cake. However I think she was pretty generous in her grading of exams (at least the midterm, haven't seen my final grade yet).\nThe reading for this class is minimal. After the midterm I stopped reading altogether, and I don't think it really mattered much. Everything important is covered in the lectures. Also some earlier reviews mentioned having to memorize dates. She must have changed her approach because we were only required to know an approximate date for each artist. She's primarily interested  in your ability to do visual analysis -- there's a lot of \"comparing and contrasting.\"\nOverall I'd say stick with Christina if you get her, unless you're a weak writer. If you're actually interested in art you'll enjoy her class and if you're not you won't hate it.\nWorkload:\n2 short ungraded assignments; 2 3-4 page papers, one on a painting the other on a sculpture; final project, which was a 15 min powerpoint presentation (you record a voiceover, no in class presentations); midterm and final.\n"
        },
        {
            "course_name": "Art Hum",
            "review_date": "December 27, 2012",
            "review_content": "\nChristina is a tremendous lecturer and incredibly enthusiastic every class. Not only does she give great lectures (with the right balance between information and student participation), but she also makes sure to thoroughly research any questions she can't answer in class. \nHer tours in the museums are captivating (with the option not to go to one, and always the possibility to go a saturday or sunday) and she will always meet with you.\nHowever, if you are going for an easy A class, this may not be the right fit for you. The A is possible, but you actually need to work for it: do most of the readings, participate every class (stay awake/ don't text) and show a genuine interest in the field. She is a tough grader, but if you work hard throughout the semester, you should be fine. \nI'd advise everybody to take her class, the progress you make and things you learn with her as a teacher is worth all the hard work she pushes you to do. Honestly, you won't regret taking her class.\n\nWorkload:\n- Reading almost every class\n- Two papers and one final project \n- One midterm\n- One final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 01, 2007",
            "review_content": "\nAvoid this woman at all costs. She WILL NOT grade you according to your ability to analyze and think deeply about art, rather, will dwell over totally irrelevant bullcrap such as sentence placement in papers and meaningless dates (to the year) that provide absolutely no form of enrichment or value. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "September 05, 2006",
            "review_content": "\nChristina is a very interesting lecturer and a great instructor. Be aware, this art hum section is most definitly not an easy A. She is a graduate student in 19th century art. Her met museum trips are great. \nthe papers can be difficult because you are not relaly sure what she is looking for. \nyou will learn A TON about art and art history, it is definitly worth it to take this class. \n\nWorkload:\ndaily reading - it must get done2 papersmidterm and a final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 12, 2006",
            "review_content": "\nLike all teachers, Christina has her strong points and her negative points. What is important:\nGOOD\n- she is fun and has a sense of humor\n- she presents the material in an easy, straightforward manner\n- she makes an effort to be available out of class/at museums for those who want extra help\n- she clearly knows the subject really well\nBAD\n- she is a tough grader\n- her classes can ocassionally get a little boring when spending hours looking at the same picture\n- the exams were a lot of memorizing dates to within +/- 2 years... kind of pointless considering  no one is going to remember any of it in 10 days time\n\nWorkload:\nstandard for art hum - i.e. more than most classes, but not terrible. 3 papers (4-5 pages) + midterm and final (both a lot of memorizing). \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 02, 2006",
            "review_content": "\nA very good teacher who is unfortunately a harsh grader. If you are willing to enjoy your Art Hum class and would not mind getting a bit poor grade, Christina will be great for you. She loves art, works hard to make the class easy and enjoyable, is very approchable and willing to help, prepares study sheets for the exams, and is a nice person to know. I went in the class as art stupid and indeed learnt to appreciate art. She offers extra resources for art-savvies so no one can regret taking this class in terms of how much they learn. But that's one side of the coin.\nThough Christina always say that how much you learn in the course decides your grade rather than your essay grades, don't count on that. Even if you attend all class actively, do well on the exams, and work hard on the papers, your course grade will be the plain average of harsh grades you receive throughout the semester. Be prepared to get one-third or two-thirds of a letter grade less than what you belive you should have gotten at the least. In other words, of your class participation, exams, and essay grades, the lowest will be your course grade.\nStill, there are lots of harsh graders and bad teachers in the Art Hum dept., and Christina is definitely better than most of them since she teaches well at the least. You should not  try switching out of this section if you are in since probability is high that you will get someone worse.\nWorkload:\nStandard. Three papers all requiring visit to art museums. Decent exams on trimmed down syllabus, and preceded by distribution of useful pre-exam handouts.\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "June 04, 2005",
            "review_content": "\nChristina is a gem.  You should feel really lucky to have her.  I liked her section so much, because she was really good a presenting difficult material in an efficient and interesting manner.  She is extremely patient and is always happy to meet with students outside of class.  I worked hard for her section, but it definitely paid off, because I learned a ton about 20th Century art.  Christina is also just a funny, sweet person, who is fun to be in the same room with.  \nWorkload:\nKrauss assigned a huge amount of reading.  \n"
        }
    ]
}