{
    "prof_info": [
        {
            "prof_name": "Alessandra Russo",
            "prof_id": 3410,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Hispanic Cultures I",
            "review_date": "December 03, 2012",
            "review_content": "\nI am someone who enjoys school and enjoys being challenged in the classroom to learn things outside of my comfort zone. I do not mind getting less than an A if it is a subject that is particularly difficult for me (which this was). But I hated this class.\nI am a science major, and I therefore do not have the humanities background that most of my classmates had. I accepted that I was going to be behind in this class, but I was willing to work a bit harder. I asked for help at the beginning of the semester, as I had done with Roxanna Sooudi, who gave me useful advice. Instead of this, Professor Russo questioned whether or not I was qualified to be in the class (I was) and told me that I should be taking another Spanish class (I wasn't) to make up for the fact that I wasn't particularly strong in Spanish. I soon accepted that I was not going to do particularly well because I didn't have the time to put into getting a good grade beyond the already heavy coursework that existed. This attitude seemed to be atrocious to Prof. Russo, but I still wanted to try and to learn within my abilities. Instead, I was largely ignored by the professor and treated disdainfully whenever it was that I did manage to get up the courage to participate. For whatever reason, she doesn't think that encouraging students to talk will make them better at speaking and understanding.\nBottom line: Because I was not up to Prof. Russo's standards before entering the class, I was treated as someone who didn't belong there rather than allowing me to learn by trial and error in an encouraging environment. Trust me, if I could have dropped the class by the time I realized what a horrendously severe person she was, I would have.\nWorkload:\nMandatory museum visits on your own time, 7 compositions, 3 exams, fairly involved readings. You are expected to all of it completely and carefully.\n"
        },
        {
            "course_name": "Latin American Humanities I",
            "review_date": "September 04, 2010",
            "review_content": "\nProfessor Russo is by far one of the best professors I have ever had. True, her class is difficult and the reading load is huge (and she WILL expect you to read and WILL know if you haven't), but it's completely worth it. Her knowledge of the subject material is simply ridiculous and amazing, and her ability to make connections and force you to consider alternate viewpoints is invaluable. She is a tough grader, and strict in her class about not paying attention and cell phones, but she is still very fair, and works hard to ensure that the level of work you put into her class is reflected in your grade. She also loves the students who are most inquisitive and contribute the most in discussion, so if you have something to say, say it. Also, her English is not perfect, but she is never difficult to understand, and if she doesn't know a word she can say it instead in Spanish, Italian, Portuguese, French, probably German and most likely Nahuatl; otherwise she will ask you for the word- in this respect the class is also nice because she accepts that she is also learning new things. To top it all off she has a fabulous wardrobe.\nWorkload:\nHigh in terms of reading, but interesting and entirely worthwhile\n"
        },
        {
            "course_name": "Latin American Humanities II",
            "review_date": "April 14, 2010",
            "review_content": "\nI kind of have a huge girl-crush on Professor Russo. She's just so freaking cool. She's so intelligent but never makes you feel inferior and is sassy without being rude. She speaks, no joke, about 7 languages - most of which she taught herself - and is very knowledgeable about the course material. I found myself constantly amazed by the connections she made to our assigned texts using a whole array of genres - she particularly loved bringing in connections to our text from art and film which made for some very interesting and relaxing classes. We watched several movies in class and she takes us to visit 2 or 3 museums during class time as well. She really tries to vary the tempo.\nThe reading is HEAVY for the first half of the semester but slows down significantly. We started with about 18 students in the class but ended up with only 9 because other students freaked out about the amount of reading. This was fantastic for me because the setting was so intimate but unfortunate for those who got intimidated. If you are able to keep up with the reading until the midterm, it's smooth sailing from there because there is no final and thus, no need to read everything. However, you find yourself wanting to read the texts in the second half of the semester because she's just that interesting. Seriously, take this class!\nWorkload:\nTwo 6-8 page papers, 1 in-class presentation (about 25 minutes, fairly simple), midterm, and a final project (she changes the project each semester - this semester each student is writing a small section of a larger class anthology, also seems fairly simple)\n"
        },
        {
            "course_name": "Latin American Humanities I",
            "review_date": "December 17, 2009",
            "review_content": "\nI made the mistake of thinking this would be a bullshit major cultures class I could sleep through, but it ended up being more work than I bargained for. \"This is a four credit class\" she reminded us repeatedly. There is a lot of reading, nowhere near the amount for Lit Hum, but still substantial. Towards the end, the reading slowed down. Lots of responses and mini-assignments, expect to spend time on this course. Two 6-8 page research-y papers for which you choose the topic. Group presentation where you make a lesson plan and teach a portion of the class. Take home final project.\nI found her grading to be exceptionally fair, although some fellow students complained. Midterm was kinda Art Hum + Lit Hum: image ID, term ID, dates, passage ID, essay. Reasonable difficulty, I got an A and only studied for one night. Participation is VERY important.\nShe is incredibly intelligent and doesn't let people bullshit, aka, will readily interrupt you if what you're rambling on about is historically inaccurate or somehow anachronistic.That makes her a little intimidating at times, but she is generally endearing. Meets with everyone individually to discuss midterm/paper grades.\nApproach is interdisciplinary: we watched movies, went to museums, looked at art, read primary sources and secondary sources. To be honest, I had little interest in the subject matter, but the way she taught it made it seem far more interesting than it could have been. A history class about this subject would have been unbearable, but this approach made the class interesting (or, at worst, bearable). Some of the readings were great, and I genuinely think I learned things.\nIn sum: good professor, significant workload, relatively interesting presentation of material, fair grading, would recommend to those looking for a history-light, art/literature focused major cultures.\nWorkload:\nModerate/Heavy.\n"
        },
        {
            "course_name": "Latin American Humanities II",
            "review_date": "March 08, 2008",
            "review_content": "\nProfessor Russo is one of the greatest professors I've ever had in my four years at Columbia. She is super cute, so nice, and extremely knowledgeable about Latin American history and culture... she also speaks like 10 different languages fluently. She is extremely sweeet, and her 2 hour seminars are well structured. She also makes the seemingly impossible workload easy. Russo is really open to student opinions in terms of workload, and she does her best to accomodate everyone. Her classroom environment is very laid back and fun. \nAll in all, she's a gem!\nWorkload:\nMidterm, final. 8 coursworks discussion postings, lots of reading, and one midterm and one final essay each 5-7 pages. \n"
        }
    ]
}