{
    "prof_info": [
        {
            "prof_name": "Frederique Baumgartner",
            "prof_id": 11508,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 28, 2015",
            "review_content": "\nProfessor Baumgartner was a good teacher. We all understood perfectly the material that we were meant to be learning, and often had interesting conversations about the pieces. The only downside is that she is very soft spoken and at times the class felt slightly flat. However, if art is a topic you are naturally interested in, the pieces and her guiding analysis of them were good. \n\nWorkload:\nNormal for an art humanities class. Daily readings and one or two random reading quizzes that were no problem if you'd done the reading (usually around 20 pages and interesting enough). The midterm and final included memorization of names and dates of pieces and the ability to answer analysis questions about them, and then two guided essays -- one on a known piece and one on an unknown piece. Three essays throughout the semester. Grading was fair. \n"
        },
        {
            "course_name": "18th Century Art in Europe",
            "review_date": "May 08, 2014",
            "review_content": "\nI took 18th Century Art in Europe with Professor Baumgartner this past semester. She is a wonderful teacher! At first, I did not think I would like her organization of the course (thematic, as opposed to chronological). However, upon reflection I've realized that this was a really intelligent way to structure the material. I feel like I have learned so much. I can walk into the Met, look at an 18th Century painting and be able talk about the work in depth having never seen it before. \nProfessor Baumgartner's accent matched with her occasional lack of projection made it sometimes difficult to understand or hear her. And the readings she assigned were super long, but overall this course was definitely worth it. I hope I get to take another class with her again!\nWorkload:\nWeekly long readings (skimming is fine but you will need a handle on them for the midterm and final), two pages (2-3 pages, 4-5 pages); one midterm and one final where you have to memorize lots of images (i.e. name, exact date, artist, location if applicable), two mandatory museum visits (the Met, the Frick)\n"
        }
    ]
}