{
    "prof_info": [
        {
            "prof_name": "Ronald  Neath",
            "prof_id": 13065,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Bayesian Statistics",
            "review_date": "May 10, 2017",
            "review_content": "\nProfessor Neath is one of the best professors in the Department of Statistics. His explanations in class are very clear and he's very friendly. Even though the homework can be challenging, he actually walks through the problems in class and is also very helpful during office hours if you still don't understand. He is also quite lenient with homework deadlines.\nThis class requires that you have taken Statistical Inference and that you have some experience with R (if you've taken Linear Regression Models, you should be fine).\nWorkload:\nProblem Sets - 40% of the grade (all involve coding to some extent)\nMidterm - 20% \nFinal - 40%\n"
        },
        {
            "course_name": "Probability and statistics",
            "review_date": "May 11, 2016",
            "review_content": "\nHard af \nWorkload:\nNot much \n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "September 09, 2015",
            "review_content": "\nProfessor Neath is a little quirky, but his lectures are very organized and complement the textbook well. For a subject like statistics, I was pleased to find that Neath was engaging and made the information interesting. I would highly recommend him for STAT W1111. In terms of work, the project was fairly simple to complete, and all of the homework assignments were straightforward and definitely helped prepare you for the exams.\nWorkload:\nGrade is weighted as follows: eight homework assignments 2.5% each, project 10%, midterm exams 20% each, and final exam 40%; with the lowest score(s) dropped or down-weighted by up to 10%.\n"
        },
        {
            "course_name": "Intro to Statistical Inference",
            "review_date": "May 14, 2015",
            "review_content": "\nNeath is a satisfactory instructor. His classes are standard lectures in which he writes notes on the board and occasionally asks questions directed to the class.\nI found the notes to be quite helpful sometimes. The textbook (Hogg, Craig, McKean) was rather dry and his notes helped to clarify the important parts and provided examples. His explanations are also generally helpful. Finally, he is generally responsive to emails in a timely manner. \nOverall, not an amazing professor, but he's pretty good. He also smiles a lot and wears jeans all the time. \nWorkload:\nProblem Sets (20% of grade) - taken from the book, and usually given every two weeks. There were 7 problem sets for the semester.\nMidterms (20% each) - can be challenging, but no real big surprises. \nFinal (40%) - it was okay.\nThere is a curve applied to the overall grade.\n"
        },
        {
            "course_name": "Linear Regression Models",
            "review_date": "January 21, 2015",
            "review_content": "\nI was skeptical of Ronald at the beginning but I grew to like him. Don't be thrown off if you do poorly on the first homework (he says he's a tough grader) but once you get used to his style and the sort of details you need to include, it's doable to get almost full credit on every homework after that. \nI've HATED every stats prof I had before this (1211, 3105,3107) and I finally started to appreciate Ronald as a breath of fresh air (Tests that actually reflect the homework we do! The average is not 50%! Wow!). He was receptive to homework questions over email and I felt comfortable asking clarification questions during class. He followed the textbook which was pretty good for concepts so definitely don't get too behind on the readings (He likes True/False questions and the book is really helpful for those!). He is open to not including highly computational chapters on tests (like matrices or stuff that can't really be done outside R) but you have to push him a little to explicitly say something will not be covered or emphasized beyond basic concepts. \nR is an easy program to use, and homeworks are 100% doable on your own (also refreshing, as I felt like I couldn't get through 3105/3107 without looking most answers up on Chegg). Ronald goes through examples in class that help a lot with homework (again, what a luxury in the stats department...). \nAlso, he had soft deadlines on homework, which was pretty awesome if you were stuck on a particular problem or had to focus on another class that week. \nI did average on the 1st midterm, above average on the 2nd, got around 95% on homeworks after the 1st one, and I'm guessing average/above average on final and got an A (my first as a stats major).\n\nWorkload:\nHomework in R (Not weekly- Due about every 3rd class, but again, soft deadlines, especially if he felt the class was struggling on particular concepts. We only actually got through 7 of them, and 8 was posted but not graded over reading week.)\nMidterm 1: Half T/F, Half short answer problems. No direct coding problems (almost entirely conceptual with a few minor computations in short answer). Average around 85. \nMidterm 2: This one was all short answer/ short computations. I think average was still around 85. \nFinal: A LOT of T/F ( around 75%) and only 2 short answer. If you've done every HW yourself and read the book well, you should understand the concepts enough to do fine on T/F. \n"
        },
        {
            "course_name": "Linear Regression Models",
            "review_date": "January 20, 2015",
            "review_content": "\nRonald Neath is the best Statistics professor I have ever had at Columbia  (unfortunately there isn't much competition). He came in excited and energetic everyday and was a clear and thorough lecturer. During class he would take notes on the board and later he would post handouts that would help us complete the homework assignments. Take him if you can!\n\nWorkload:\nVery reasonable. 7 assignments, all requiring R programming. Typically he would explain how to do any difficult questions the class before it was due. Midterms were multiple choice with some short answers and covered only material we learned. 10/10 would take again.\n"
        },
        {
            "course_name": "Linear Regression Models",
            "review_date": "January 05, 2015",
            "review_content": "\nThis was a great class and Prof. Neath is a great instructor. Maybe not the best lecturer (IMHO Elbarmi is the best) but the best instructor overall considering lectures, assignments, availability, extra materials, exams and grading. If possible, I would take any class in the Statistics major with him. If you have the chance to fulfill a requirement taking one of his classes, DO IT. \nWorkload:\n7 applied HW assignments in R, two midterms - one final, everything doable.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "November 16, 2014",
            "review_content": "\nNot bad. He may come off as boring. And well he kinda is. But this is stat. And the class did seem 3 times as big during midterms. BUUUUUT. As soon as I started going and paying attention beginning to end, I was really really really happy I did. He is a great guy with a strong grasp of material. He explains what he wants you to know attentively and clearly. He rights basically everything on the board. Most importantly though, he's very straightforward. No surprises here. Went to office hours once, he explains things even better. I definitely recommend using that resource. I was gonna drop the class in the beginning, glad I gave him a chance.\nWorkload:\nproblem set a week\naround 4 hours\ngot easier as the year progressed\n2 midterms and a final\nvery straightforward\nall in all, reasonable\n"
        }
    ]
}