{
    "prof_info": [
        {
            "prof_name": "David H. Newman",
            "prof_id": 3365,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Topics in Biology: Introduction to Clinical Research in Emergency Medicine",
            "review_date": "May 11, 2012",
            "review_content": "\n*Full Disclosure: Postbac Student*\nIf you have any interest in understanding how to read a clinical research paper, I highly recommend Dr. Newman's class. He takes one of the dullest, most uninspiring parts of science and makes it engaging. The funny thing is, the majority of his lecture notes and assignments are very bland on their own and without context. He makes a PowerPoint for most classes, which are posted online, and all the slides that have test-relevant information have an asterisk at the top. Were it not for your attendance accounting for 30% of your grade, you could probably just read the slides and do well on the tests.\nWhen Dr. Newman explains things, though, he has a great amount of energy that draws you in and keeps you engaged. Since most of the lectures never take too long to explain, a lot of the time will be spent discussing what he assigned you to read and then going off on an interesting tidbit of medicine related to that. In addition to his extensive knowledge about clinical research, he is an emergency physician at Mt. Sinai, so has plenty of amusing anecdotes about interesting patients who can illustrate a point he is trying to make. He is very humorous, although that sometimes turns into condescending sarcasm. Still, I cannot recall a class where there wasn't at least a mild outbreak of laughter.\nThe course is normally one point, so won't affect your GPA much. If you want to take this course for two points, you have to participate in the Academic Associates Program, either at the Mount Sinai or St. Luke's-Roosevelt hospitals. In addition to the once a week class, you'll spend eight hours a week enrolling patients in an emergency department into clinical studies, which is as fun as it sounds. If you are squeamish at the sight of trauma or have anxiety about making people angry, which will happen when you ask someone with head trauma to fill out some forms, you will probably be unhappy. On the other hand, if any of you premeds are burning for clinical hours, this will give you about 70, so take that as you will.\nBoth tests are fairly easy, with the grades for our midterm and final averaging 87.61% and 91.56%, respectively, both without curve. They have the same layout of ~21 fill-in-the-blank questions from a large word bank and then a few open answer questions related to an attached research paper, followed by some bonus questions. For homework, you'll be asked to read the New York Times' Science Section and read a research paper or two he assigns, wherein you will meticulously pick apart all their flaws as a class. You don't actually have to raise your hand, but if you look interested, sign the weekly attendance sheet and don't fall asleep, you should be able to get full participation credit. At some point, you'll need to read from a book he assigns that is rather dull, but it is only 60 pages and if you read it once before the midterm and once before the final you should be fine.\nTo put it simply, Dr. Newman does not care what grade you get. He said he is quite happy to give everyone A's if they earn them, and considering the class average was 92.94%, he made good on that promise. He is much more invested in making you an educated reader of scientific literature so that you can tell when a paper is bad or trying to cover up poor data. If you plan on going into any science, be it hard or soft, you will benefit in some way from this class. And for the rest of your life, you will never forget that a p-value \"PRESUMES THE NULL HYPOTHESIS IS TRUE.\"\nWorkload:\nOne midterm 35%, one final 35%, and sign a weekly attendance sheet, read the NYT Tuesday Science section weekly, read one or two clinical research papers he assigns weekly, read 60 pages from a book he assigns once and find three articles on a topic he assigns once, all of which fall under \"Participation\" 30%.\n"
        }
    ]
}