{
    "prof_info": [
        {
            "prof_name": "Stefania Albanesi",
            "prof_id": 2951,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "May 24, 2011",
            "review_content": "\nProfessor Albanesi has her pros and cons. On one hand, the material is mostly reasoning rather than math, which makes it an easy class as an economics elective. That doesn't mean it isn't interesting, by the way, because I found that it usually is, especially the parts about regulation that other reviewers seem to dislike. That said, her presentation is a bit off-putting. In the first few classes she tried to use a digital pen that quickly proved useless, she can be somewhat... continuous in speaking, forgetting to take in some air, which is annoying. But overall, I think she tries hard to make this class pleasant, is always willing to explain, and is generally a nice person.\nI think bringing in someone from the Fed for a lecture was a nice touch, and close to the end of the semester there was also a screening of \"Inside Job.\"\nWorkload:\nSix problem sets (kinda tedious), midterm and final that are a pile of pages each but generally easy if you go over the problem sets and past exams.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "May 24, 2011",
            "review_content": "\nProfessor Albanesi has her pros and cons. On one hand, the material is mostly reasoning rather than math, which makes it an easy class as an economics elective. That doesn't mean it isn't interesting, by the way, because I found that it usually is, especially the parts about regulation that other reviewers seem to dislike. That said, her presentation is a bit off-putting. In the first few classes she tried to use a digital pen that quickly proved useless, she can be somewhat... continuous in speaking, forgetting to take in some air, which is annoying. But overall, I think she tries hard to make this class pleasant, is always willing to explain, and is generally a nice person.\nI think bringing in someone from the Fed for a lecture was a nice touch, and close to the end of the semester there was also a screening of \"Inside Job.\"\nWorkload:\nSix problem sets (kinda tedious), midterm and final that are a pile of pages each but generally easy if you go over the problem sets and past exams.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "January 18, 2007",
            "review_content": "\nBy all means STAY AWAY FROM HER. Money and Banking sounds very practical if you are interested in finance and such, but this instructor can totally destroy your hope of learning anything useful with her dry and dull presentations, and horrible accents. The class mainly focuses on the REGULATIONS in the money market history, and has almost nothing to do with banking. The fact that you don't need to hand in the problem sets may seem appealing at the beginning, but without solutions you actually can't learn anything. Then you look at the midterm and final, and can't even realize where you have learnt the stuff. She is also very rigid when she deals with students' questions and concerns. \nWorkload:\nas below.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "May 22, 2006",
            "review_content": "\nAll her lecture notes were available in Courseworks, but I recommend you go to class because some stuff she covers isn't found on the slides.  Read the Mishkin text and make sure you understand the fundamental concepts.  But more importantly understand her lecture notes.  The exams were analytical.  It isn't pure regurgitation.  You had to think critically and apply what you learned analytically.  There isn't any hard math like calculus, but you should understand any concepts that use graphs.  Also there is required reading that you should be familiar with as well.  And make sure you understand the problem sets well.   This course teaches you to think critically.  And if done correctly you should come out with a decent grade.  Good Luck.\nWorkload:\n7-8 problem sets, but not required to hand-in.  Midterm/Final.\n"
        }
    ]
}