{
    "prof_info": [
        {
            "prof_name": "Cary Plotkin",
            "prof_id": 532,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Romantic Era",
            "review_date": "September 06, 2014",
            "review_content": "\nThe only way people stayed awake in this class was if they were actually taking notes... like me. But soon taking notes turned into doodling or checking email. Unfortunately Plotkin is a very boring lecturer, though his choice of authors is stellar. He is clearly very knowledgeable and does not assign a lot of readings. I went to his office hours once to discuss a final paper topic, and he was much more engaging there. \nOverall, this is an easy class, but a very boring class. If you want any kind of engagement in lecture then this is NOT the class for you. On the other hand, if you just need a literature class to fulfill a req and you really don't care, then go ahead and take this class. \nDon't bother buying the books, most of it can be found online or in the library. seriously, i spent over 100$ on books for this class and later realized all the poems and novels could easily be obtained online. it was a dumb freshman mistake. \nWorkload:\nhardly any reading, and you can even skip the reading and totally get away with it. midterm essay (6-8 pages) and final essay (8-10 pages). he is a fair/generous grader. I wrote an essay that deserved a B- but he gave it a B+\n"
        },
        {
            "course_name": "Renaissance Colloquium",
            "review_date": "May 14, 2012",
            "review_content": "\nI'm not sure how Professor Plotkin managed to make a course with Donne, Shakespeare, and Rabelais on the syllabus so miserable, but he did. Any good points the class might have had were elided or forcibly shut down so that Plotkin could reinforce a thuddingly weak one that he made in a facile reading. He was more prepared to complain about feminism or misspell Latin on the board than provide more than an illusion of preparation on the material, which, given the stupendous amount of reading every week, seemed to be the only thing in common for both Plotkin and the class. It's an easy but hardly painless ticket out of one half of the colloquium, only advisable if you're willing to repress regular eyerolling in order to stay awake.\nWorkload:\nThe reading can either be one or two sizable texts a week or whatever you need to write weekly two page papers. One mind-numbing chart on all the reading, which everyone does in the last week, and one 8-10 page paper.\n"
        },
        {
            "course_name": "Romantic Era",
            "review_date": "April 16, 2012",
            "review_content": "\nTerribly boring, and the course becomes an opportunity for him to brag about his knowledge of German, Greek, and Latin. It seems he plans his lectures around the words which he can break down into their Latin and Greek origins.  The class is a straight lecture, with few chances for students to raise their hands and participate.\n90% of the time he is hunched over his notes as he stands at the podium, and reads lines of the poem as he comments on them, rarely looking up at the class. The other 10% he takes notes on the board in a very unorganized manner, generally just writing down random words, names, or dates as we come across them.  Many of the words he writes he will break up and ask the class if we know what they mean in Latin or Greek (which no one ever knows), and then he goes on to explain.\nHe is an unnecessarily tough grader. His comments on your paper come off condescending and arrogant, as if to say, 'I have studied literature my whole life, and there is no way you will be able to produce a work of quality being only an undergrad.'\nI wouldn't take the course again, and I had a very negative experience.\nWorkload:\n2 papers, 1 1250 pages, the other 2500 words. That accounts for 85%. 15% is attendance.\n"
        },
        {
            "course_name": "Junior Colloquium: The Enlightenment",
            "review_date": "March 30, 2012",
            "review_content": "\nProfessor Plotkin's class is perhaps the worst I have taken at Columbia or Barnard in my three years here.  As a major I am required to take this colloquium, and to be fair, the Enlightenment has never been my favorite literary area.  However, I have taken enough survey literature courses to know that a good professor can make any book interesting if he/she is interested in and knowledgeable about the material, and is engaging in discussion.  Professor Plotkin meets none of these criteria.  I don't believe he wants to be teaching the class or is at all interested in the readings; it often seems that he hasn't even done the reading himself.  He'll make a point, and it will be so blatantly false that someone in the class will correct him and point out a clear example of the contrary.  He will respond by blushing and brushing off his mistake.  He is not at all engaging in discussion; he'll occasionally ask questions, but the way in which he lectures during colloquium is unbearably boring.  Never have two hours a week seemed so long.  Finally, he is a completely arbitrary grader.  I once approached him about a response paper that I did not feel deserved the middling mark that it received.  I discovered that many of the questions he had about my response were a result of his failure to spend any time reading the paper carefully; he misread sentences that were clearly written because he breezed through them.  Furthermore, he essentially told me that he \"skims\" the papers ten minutes before class, and if he comes across a sentence that needs more than a modicum of thought to understand he will simply mark it with a red pen and bring the person's grade down.  All this is evidenced by the fact that our grades appear on Courseworks ten minutes before class begins.  It's so frustrating; you can write essentially the exact same style of response two weeks in a row and receive a 4/4 on one and a 2/4 on the next.  Personally, I do not feel inclined to put effort into a paper if my professor will not put effort into grading it.  I would not recommend this class to anyone, and it disappoints me that professors of this caliber continue to teach at Columbia.  \nWorkload:\nNot particularly intense, especially because no one in the class does the reading.  A two page response paper every week, for which minimal reading needs to be done because his favorite type of response is one that makes huge, sweeping generalizations with little to no textual evidence.  One optional paper, 4-5 pages, close reading.  One term paper, 10 pages, with topics assigned.  A big table that you have to fill in with information from all of the works that makes no sense (just get together with your classmates during reading week and fill it out together).\n"
        },
        {
            "course_name": "First-Year Seminar: Legacy of the Mediterranean II",
            "review_date": "January 30, 2012",
            "review_content": "\nI've heard and have many mixed feelings about Professor Plotkin. These reviews scared the Dickens out of me. Yet I found his class quite enjoyable. When you present a point, he backs you up and grows on it, making it a nice seminar. I hardly got bored in the class (perhaps because I am a big classic literature nerd and participated the most in his class). He is very knowledgeable and knows a lot about language the the subject matter which he teaches.\nThat being said, he is a bit of a harsh grader, and you also don't really know how you are graded in the class. He says that he evaluates how much you have improved, though I didn't improve much. He gave us six different categories on each of our papers and graded each category (paragraph design, diction, syntax, etc). I received mostly Bs (some minuses, some pluses) and got a B+ in his class. I talked to a lot of my classmates and found that he also gives A-s but didn't hear about anyone getting a solid A. When I went in to meet him about my papers, he gave the advise of not using the plot but the idea to construct the paper. I tried and tried to do this, but never got the hang of what he was trying to say. He is very particular about what he wants (I haven't even mentioned the fact that he expects the typical five paragraph essay, which I haven't done since the beginning of high school, along with a thesis paragraph and foreshadow).\nOverall, don't be too terrified if you get him for first-year English/seminar. Some people love him and are taking his Romantic Era class. Some people dislike him and never look back to their first-year English/seminar. He's definitely laid back and very stereotypically Ivy League.\nWorkload:\nFair. Five \"papers\" (two real ones, two rough drafts, and an optional re-write or new essay). Participation in class encouraged (though I'm not sure if it is amounted in his grading process), but you don't have to go overboard.\n"
        },
        {
            "course_name": "Romantic Era",
            "review_date": "November 11, 2010",
            "review_content": "\nI'm unfortunately going to have to agree with everyone else who gas reviewed Professor Plotkin...he is PAINFULLY boring. In fact, I write this review as I sit in his class. however, he is an INCREDIBLY nice man - he's helpful, charming (as the person before me said), and clearly knowledgeable. He's just terrible at lecturing. Do take the course if you're interested in the subject matter - this guy knows his shit. But be prepared to be extremely bored.\nWorkload:\nPretty minimal. You can go without doing the reading. One short paper towards the middle of the semester, and a final longer paper. \n"
        },
        {
            "course_name": "Romantic Era",
            "review_date": "December 27, 2009",
            "review_content": "\nDo take this course.\nI don't know if Prof. Plotkin read Culpa and went through a radical metamorphosis, but there is very little truth in a lot of the reviews here.\nProf. Plotkin is a charming, brilliant, profoundly cultivated, inspiring, and helpful professor. Right after I had signed up for this class, I dropped it immediately after reading Culpa. I then spoke with a friend of mine who had been to only the first class and told me to register again. I'm glad I did.\nProfessor Plotkin's lectures are full of historical detail, philosophical rigour, quotation, and yes, his passion for etymological roots. It was a small class, and it could have  turned into a seminar, were we sitting in a circle, possibly? Whatever the case, he always encouraged discussion and participation from his students.\nI'm not going to lie--a lot of the students expressed confusion at his lectures--not being able to understand his slight accent, not being able to follow his philosophical concepts, etc. but even though I let my mind wander from time to time and my brain grew a bit sore with each mention of Fichte, there was never a class where I didn't learn something of value. I am not an English major, but I learned more from this class relating to my major than I had done in classes from my major's department . It seems like an exaggeration, but the source of this was, not only his lectures, but what his lectures inspired me to read. This class definitely expanded my knowledge on such topics as Nature, the Self, idealism, aesthetics, etc. For my term paper I ended up reading a barrage of Plato, Spinoza, and early German Romantics, which I don't think I would have been inspired to in any other class.\nThe material of the class was very varied--there was a Romantic \"arts\" class, which some found a bit superfluous, but I found it slightly entertaining, particularly a student's crass remarks about Georgiana Duchess of Devonshire's \"rosy nipples,\" but that is another matter...\n(and both superfluous and crass to have included here?)\nThe class covered Pope, Goethe, Longinus, Schopenhauer, the British Romantic poets, Schelling, Fichte, Kant, Burke, and others. The class is what you make of it. You could go without doing the readings, or get really passionate about them.\nHe is very broad and lenient with essay topics, so you can naturally concentrate on what you really like.\nI must make the note that Byron was treated a bit cursorily here (perhaps it is because Prof. Plotkin prefers things with a philosophical bent, and Byron is a bit of an airheaded s--- most of the time). As a Byromaniac, though, I cannot say i wasn't a bit disheartened.\nI don't know about his grading, but I did hear  lot of people surprised at what they got (positively). He is very kind, helpful, and open during office hours. Go to them.\n\nWorkload:\nyou COULD technically go without doing the readings, but they're generally really good, so I personally wouldn't, not that many readings anyway (a few poems to be read closely, two novels I think, and some philosophical selections--he explains them all in class though), just two essays (one 5-6 I think, the other 6-8 or 8-10--can't remember), fair grader, although possibly also easy grader (I don't know--I was really passionate about my work, but I did get higher than I expected, maybe because I'm used to my major's grade deflation)\n"
        },
        {
            "course_name": "Renaissance Colloquium",
            "review_date": "December 16, 2009",
            "review_content": "\nThis class was...well, interesting. Plotkin is obviously very intelligent and knows his Renaissance literature. Sitting for two hours while he talked at us was a little much though. Doing the reading was not specifically necessary, even with a response paper due every week. I tried to read as much of it as I could, but sometimes reading 300 pages of prose poetry was too much to stomach. Plotkin also never really gave a straight answer, and wasn't the best at responding to emails. Just be forewarned!\nIf possible, I would recommend taking this class with another professor. Plotkin can be very witty and enjoyable at times, but his classes are so very boring. If you do take it with him, I would recommend bringing other work to class, possibly your computer and definitely a caffeinated beverage. You'll need it. \nWorkload:\nten weekly response papers (2-3 pages) due the night before class. One optional essay that comes during midterms (bad timing), and a mandatory term paper that's 10-15 pages. Overally not too bad. He is a stickler for good writing, so make sure your grammar is in check!\n"
        },
        {
            "course_name": "Junior Colloquium (Renaissance) and 17th-Century Poetry",
            "review_date": "November 09, 2009",
            "review_content": "\nProfessor Plotkin has scarred me permanently in terms of my ability to write. I was always an exceptional writer and he completely ruined my confidence, I really do not understand what he wants in a paper but he always found something to rip up about mine. I would strongly advise you, DO NOT TAKE A CLASS WITH THIS PROFESSOR. Every other English Professor at Barnard gave me a grade A except for this dude who thinks he is something special. \nWorkload:\nWeekly response, one big final essay. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 13, 2009",
            "review_content": "\nProf. Plotkin is probably a very intelligent and knowledgeable fellow, but none of that came out in this class. Instead, the students who could have benefited from some writing instruction were too busy sleeping, watching the clock, or doing other homework (Plotkin didn't appear to notice) to listen, and the students who could already write didn't need to be lectured on how to build a five-paragraph essay.\nThe reading list was great (if you like classical lit), but Plotkin spent most discussion time talking about his own opinions and calling on the people who usually agreed with him, which meant that a) discussions sucked, and b) reading was basically optional.\nI will say that he gave a very interesting 10-minute lecture on Greek roots, and seems like a kind person, but those are the only positive things I remember about the class. And I feel like he managed to bring up fertility symbols every other class period (interesting, given it's a Barnard freshman seminar...)\nWorkload:\nIn theory: about 100-120 pages of reading each week, three essays (10th-grade writing level gets an A), and a couple of summaries (read: third-grade-level book reports). In practice: show up to class and laugh at his (terrible) witticisms.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 24, 2008",
            "review_content": "\nThis class only had 3 paper assignments however, he is a very harsh grader. the class is torture to sit through! Everyone is watching the clock and waiting for it to end. \nWorkload:\n3 papers, reading homework\n"
        },
        {
            "course_name": "Victorian Poetry and Criticism ",
            "review_date": "May 30, 2005",
            "review_content": "\nAllow me to disagree. I think that Professor Plotkin is an exceptional professor who has an amazing amount of knowledge and insight to offer with each class. If you want to simply read and write, perhaps another class is for you. This professor has so much more to offer and teach than could simply be retrieved from a book. If you are at all interested in the Victorian Era this class is a must. Prof. Plotkin cares about his students' writing and conferences are helpful - never hurtful. \nWorkload:\n2 papers - difficult but worthy\n"
        },
        {
            "course_name": "Renaissance Colloquium",
            "review_date": "December 29, 2004",
            "review_content": "\nHorrible class. In my opinion Plotkin is more interested in himself than in his students. Every two-hour class (with only 8 students)was filled with his constant lecturing which would drone on while students fell asleep. The only interruption to his incessent lecturing was the totally unrelated tangents that he would go on to tell us about the latin/greek/french roots of words. Discussion NEVER happened. Anytime students (when they weren't sleeping) became slightly interested, Plotkin would stifle discussion before it occurred. The only good thing is you don't have to do the reading this way. He is simply NOT one of those teachers who really cares about his students and wants them to do well. Having only two grades in the class makes it difficult to know what you'll get in the end. We didn't receive our first grade (which was a paper) until AT the final! English Majors take this required colloquium with anyone else but Plotkin. If all of them are full, wait until next semester!\nWorkload:\nHeavy reading, about two books/texts per week, but you can get away with not doing it, very few grades, one 7 page paper, one final with about 18 ID's on every text you've read that semester\n"
        },
        {
            "course_name": "BC1201 First Year English",
            "review_date": "May 19, 2002",
            "review_content": "\nTo sum it up, this man is a turd. While most first year english professors were out giving many assignments that included an 8-10 pages research paper with a manditory 8-10 sources (this is the first year english requirement), Plotkin gave 3 essays (only one of which was actually based on a text read in class), and the research paper was a maximum of 8 pages, with 3 sources being \"more than necessary\". Needless to say, I still have no idea how to write a research paper. Not only, in my opinion, did Plotkin shirk the responsibilites of a first year english professor, he managed to make students cry during individual meetings. Perhaps one of the most arrogant people I've ever come across. Take first year english with someone else.\n"
        },
        {
            "course_name": "Major English Texts II",
            "review_date": "January 18, 2002",
            "review_content": "\nBoring. You have a sense that he's thinking of something really amusing sometimes but he doesn't end up saying it. There might have been about 3/4 wonderful insights thruout the semester - but no more, and not enough to take the entire course. probably just not a good lecturer - and maybe it was my problem too for not understanding his accent or his illegible handwriting. He is kind of nice though answering questions but the lectures were too mild to provoke us into thinking. He likes to refer to the texts a lot. \nWorkload:\nA few papers, midterm and exam - easy/fair grader.\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "November 04, 2001",
            "review_content": "\nHe's not nice. At all. Individual conferences are sometimes helpful and sometimes demeaning. He's good at destroying your confidence. Avoid at all costs. There is no reason to put yourself through this. There are better places to improve your writing.\nWorkload:\nFine. Boring.\n"
        },
        {
            "course_name": "Major English Texts II",
            "review_date": "December 31, 1999",
            "review_content": "\nGod, I did not like this pretentious man. He affects \"quirky\" mannerisms that he probably picked up from a movie somewhere, like starting his lecture midsentence as he walks into the room. He spends half the class blathering on about the historical context of everything you read, which is how he manages to give Short-answer tests in an English class, for Christ's sake. Because he likes the sound of his voice and honestly believes that his students are complete idiots, all the quotes on the tests will be ones he's read aloud in class. That makes the reading completely optional. Try to show up for the class on Robert Burns, when he is likely to burst without warning into a Scottish ditty.\nWorkload:\nYeah, if you're a freshman, you obsess over the impossibility of it for a while, and then the realization hits -- YOU DON'T HAVE TO DO IT. And your collegiate academic career truly begins. \n"
        }
    ]
}