{
    "prof_info": [
        {
            "prof_name": "Marina Graham",
            "prof_id": 4611,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 06, 2013",
            "review_content": "\nBest teacher I have ever come into contact with. Hands down. If you get lucky enough to take lit hum with marina you will leave the class having become a better writer and thinker. She is absolutely lovely to be around and one year later after being in the class i swear to god miss it more than anything. I would pay a lot of money to be in a class with her again. God bless her. \nWorkload:\neach student teaches class one day, a blog where you post several evaluations of readings over the course of the semester, 2-3 papers, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 01, 2011",
            "review_content": "\nMarina is/was totally awesome and rules.\nShe is very British, but this does not mean that she is uptight or anything.  In fact, she is incredibly down-to-Earth and willing to talk about any topic or idea a person has in class.  She is not afraid to reference bad movies in class (see: the Cagey classic Face/Off when talking about The Odyssey), and you will not feel intimidated by her mannerisms in any way.  \nShe maintains control of the class not by dressing in suits or lecturing extensively (although most classes have an extreeeemely helpful 20-minute history/background she leads, which would have been more helpful before we read the book), but by being ridiculously knowledgable.  She is scary smart.  I think she mentioned once that she spent her graduate years at Oxford toiling around reading obscure theology.  If someone is discussing theology, philosophy, or literature as a whole, Marina will respond and develop the ideas.\nThe format of the class is all discussion, and Marina does a pretty good job facilitating.  While our talks were somewhat dominated by one or two folks, she recognized this and tried to encourage other people to contribute as well (and loved when they did).  \nMarina basically made lit hum what I wanted it to be when I came to Columbia.  I wanted to come to class (at 9 AM!!) every day, and never missed one.  \nTo end I'll leave some Marina quotes.\n\"Today, we're going to talk about dildos.  That's right, dildos.  And you can't escape it.\" (As we walked into class for the Lysistrata)\n\"His crazy-ass nutso awesomeness was pretty interesting\" (In regards to William Blake)\n\"If you don't like people, you won't have friends, and maybe will blow up a federal building.\" (In regards to who knows what).\nI didn't write every one of them down, but there's usually one or two quotes every day during class that will make you laugh.  \n\nWorkload:\nLit hum. Second semester she added two choice texts, but replaced Don Quixote with a cool Shakespeare play.  Three essays per semester, one is a creative paper (fun!).  Papers are weighted heavily  while midterm and final are not much of the grade (40% maybe).  Participation is 10%.\nFirst semester she graded tough, 2 As, 3 A-s, everyone else lower (21-person class). But second semester I think she realized her folly and offered extra credit, and seemed as if essays got more easily graded.  Go to her office hours about the essays, she helps a lot.\nGET MARINA.\n"
        }
    ]
}