{
    "prof_info": [
        {
            "prof_name": "Charles Hailey",
            "prof_id": 373,
            "total_reviews": 42
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "January 08, 2015",
            "review_content": "\nProfessor Hailey was an atrocious professor for this course. I was excited as hell when I saw the silver nugget. Do not make this mistake. Hailey makes it painful to attend his totally unorganized lectures in which he'll spend more time attacking students for their questions than teaching correctly. You never really do figure out what's important and what's not, and you end up studying solely from his problem sets, which are never graded on time, and his practice exams. In fact, his problems sets are typically graded AFTER the relevant exam grades have been posted. His problem sets would be appropriate difficulty for this level if he EVER taught the material that he tested us on, or he EVER gave us relevant readings. \nIt would have been far more useful to have a single, unified textbook for this course than the hodgepodge of irrelevant notes that Hailey posts on Courseworks. The little optics handbook was actually quite useful. The modern physics textbook we used two chapters of and had to pay over a hundred dollars for. Hailey is always going on about his important research and how great of a professor he is - why doesn't he just write the relevant textbook? \nNo matter how much I disliked Hailey as a person/professor, I do have to respect the fact that he had basically a 24-hour office hours policy where you could knock at any given time and ask him about something, or shoot him an email, etc. That sort of policy is something that really good professors put into play, and I'm pleased that Hailey, at least outwardly, makes that effort. But that's sort of muddled by the fact that any time you ask a question that he deems too \"simple\" or even too \"advanced\", he'll throw it under the rug and launch into some ad hominem attack on other majors or something. It's a shame to see such a good policy in use by a professor that simply does not make it work.\nI definitely learned a lot from this class, but I think I would've learned as much by just buying a modern physics textbooks and doing some practice problems. I don't think that's supposed to be the point of the course. I really think this course needs a major overhaul.\nWorkload:\nA total of 7 or 8 extremely confusing problem sets that require a hell of a lot of group work. These are typically graded 1-2 months after the fact; or, if you prefer, 1-2 weeks after the exam for which it's necessary to study the problem set. There were two midterms - the first was in-class, and was difficult but fair; the second was take-home and a lot easier (and still fair). The final was pretty easy, and pretty short.\n"
        },
        {
            "course_name": "Classical & Quantum Waves",
            "review_date": "December 04, 2014",
            "review_content": "\nChuck Hailey is not a good teacher. He struggles with teaching. Worse, however, is his struggle with interpersonal interaction. He is by far the rudest professor I have ever had, and he frequently discourages students. Taking a class with him was a highly unpleasant experience and in the future I would refrain from taking a class just to avoid having him as a professor. He was also a complete mess, organizationally, and a nightmare as a lecturer. Nobody ever knew what he was talking about except for two kids who had taken more advanced classes than everyone else and would always ask questions, and he would frequently get in some sort of childish rage and start to be really combative with them instead of just answering their questions, to which he often - even admittedly - didn't know the answers. I learned very little in the class, because I spent all my time pouring over poorly organized notes (for lack of a course textbook) to figure out what his pointlessly ambiguous problems were asking for. Chuck Hailey seems like the kind of person who has made a lot of people cry with his words over the years.\nWorkload:\nNot a lot, and yet way too much. You'll spend a very large amount of time being frustrated and confused, not so much time learning physics.\n"
        },
        {
            "course_name": "Classical & Quantum Waves",
            "review_date": "February 01, 2014",
            "review_content": "\nI am hoping that the previous review was written by some giant troll, because Professor Hailey is tied for the worst professor I've had so far at Columbia, and I really can't imagine having a worse instructor in the future.  He told us early on that he's very sensitive to the difficulties that students can have learning physics, which would be great if there was any truth to that statement whatsoever.  I've never seen a professor overcomplicate simple concepts to the extend that he did.  He'll dive into the discussion of some topic without ever giving a basic definition or motivation for what we're talking about.  In fact, I don't think he defined a single term the entire semester; rather, he'd just start using some term that we've never heard before and assume we could figure out what it meant.  For example he'd say something like \"okay now we're going to start geometric optics,\" and then he'd immediately jump into some random, poorly explained problem based on an unclear sketch on the board.  Asking questions wasn't the solution, as the professor didn't really stop for questions, and clarification questions are generally nonexistent.  The only time people asked them was when they thought something written on the board was incorrect, and most of his questions were met with the response \"I'm sorry but you are mistaken\" and without any further explanation whatsoever.  His blackboard presentation was generally too disorganized and taking clear lecture notes was difficult.  This all made it very difficult to gain any understanding from attending lectures.  In fact, if you understood what was going on in lecture, you probably already had a sufficient understanding of the subject for the course and didn't need to be there.  \nA natural response in many classes would be to keep up with the readings for the class, but there was no clear reading schedule provided, and the professor never told us what chapter he was covering at what time.  In fact, many times he was covering material that wasn't in the books, or the coverage was too different to be helpful.  This might not have been a problem if he had presented the material clearly or at least gave us enough information to read about the topics on our own, but he typically did neither.  His approach to doing derivations was to skip a great majority of the steps, often without telling us that he was skipping steps.  He told us on the first day that he wasn't very rigorous with his derivations, with the defense that we have the textbooks if we want to go back and fill in all the details.  This made lectures even more difficult to follow.  It typically seemed that he was just stating random results one after another, without any intuition, motivation or justification.  There's absolutely no order to his presentation of topics; he'll start one thing, move on to something that seems completely unrelated (without completing the first topic or telling us he's changing gears).  Then he might return to the topic several lectures later, or \"revisit\" something that was never covered.  He also made a really big deal the two times during the semester when he thought what were doing was mathematically rigorous, and he usually prefaced it with a speech arguing that despite the pain of working through this math, it is important to know how to use this to solve problems, or something along that line.  Seeing as the purpose of this class is supposedly to help students transition to more advanced physics classes that make use of a lot of math, I don't see why he made such a big fuss about having to work through something of that sort.  It was clear that he preferred to spend lectures on \"applications\" and \"intuition.\"  \nThe homework assignments were equally poorly designed and mostly felt like busy work.  Most of the problems required no understanding of any of the physics, but just required some meaningless algebraic manipulations.  I am well aware that tedious algebra comes up in a lot of physics problems, but in this case that's all there was.  It wasn't necessary, or even helpful, to have any understanding of the topic in the problem; just compute the random derivative, integral, taylor expansion, or solve some ugly system of equations.  Other problems just required copying a derivation directly from the textbook or finding the magic formula and rearranging it.  This is true both of the problems from the textbook and the handwritten problems that the professor gives out.  Additionally, the problems that the instructor handwrites are often very unclear or contain errors.  Finally, you have to be careful about just downloading the problem set after it is posted, as he has the annoying tendency to add problems to the assignment without ever indicating the original posting was incomplete or notifying us about the addition of new problems.\nThere were different TAs for recitation, grading homework, and grading exams.  However, they all seemed to have in common the fact that they had no idea what was covered during class.  Recitations were scheduled in the middle of the day when many people had other commitments, but I heard from people who attended that I wasn't missing anything, as the TA often was clueless about what was going on in class. \nOh, he also acts so arrogant during lectures.  He spends so much class time talking about himself and his research accomplishments.  I get that some people find this entertaining, but I found this attitude really distasteful.  For example, on the first day, he told us that he picked new textbooks for the class this semester because he found the ones he used last year too difficult.  He told us that he really liked the book on waves, except for the fact that it doesn't use complex notation to solve differential equations.  He then speculated that the reason they don't use complex notation is because the author of the book comes from a lesser schools than Columbia (the University of Texas, to be exact), and that the author might have made this decision because he thought complex notation would be too difficult for the students at his school.  I was a bit shocked when he said this at the time.  Once I got the book, I realized that the author explained in the preface his reasoning for his choice in notation.  (It had nothing to do with the ranking of his university.)  I guess that's also a nice indicator of how much thought Hailey put into this course.\nI really don't think this class was a productive experience in any way at all.  If you were to ask me at this point what the class covered and why this material is important, I still couldn't tell you.  I don't doubt that there is a lot of valuable material that this class could cover, but I don't feel like I learned any of it, as it was simply reduced to plug and chug exercises in this class.  Don't get excited about the introductory quantum mechanics unit at the end of the semester, as it's way minimal to be of any value.  \n\nWorkload:\n20% Homework Assigments: There were a total of 8 homework assignments.  They were generally poorly written.\n20% Each Midterm: The great majority of what was covered was not tested.  The averages were all in the high 70s or low 80s.  Any \"conceptual\" (non-calculation) problem involves regurgitating something he said in class.\n40% Cumulative Final: He decided to make the final non-cumulative at the last minute and only cover the basic quantum we had covered.  \n"
        },
        {
            "course_name": "Classical & Quantum Waves",
            "review_date": "January 01, 2013",
            "review_content": "\n(This review might not be worth much, since Hailey taught 2601 this year for the first time in over a decade, and I have no idea whether he'll teach it again anytime soon.)\nI took 1600 freshman year and found 2600 a lot easier to manage.  The subject matter itself is pretty small in scope: the first part of the semester is spent learning a lot about waves, then the second part is spent applying the things you already learned to Quantum Mechanics.  Hailey told us the first day that as long as we really got the fundamentals at the beginning of the semester, the rest would fall into place pretty easily, and that was true for me.  We didn't do any physics too rigorously (though waves require some complex math [literally, ha!] to really understand, the most we really needed to be able to do was single-variable calculus).\nProblem sets could be difficult and time-consuming, but not unreasonably so.  Most of the book problems were pretty much applying formulas, with a couple hard ones each week leading to a lot of stress.  The problems Hailey wrote were actually helpful for learning, because his hints led us through them in a way that felt like a teaching exercise more than a problem to struggle with.  Exams were even simpler, because Hailey focused on only the important concepts, but studying was important to both figure out what those were and understand them completely.  I liked that on each exam, there was one qualitative question, which made sure we actually understood to some degree what we were learning.\nThe whole style of the class was very distinct from 1600 with Millis or Dodd.  It's much smaller and designed mainly for physics majors, so it feels more like an upper-level class.  Hailey is almost conversational with the class even though there's not really any student involvement during lectures, so his lectures are peppered with interesting asides about history, applications, and his own research.  I felt much more interested during lectures, probably because of the combination of Hailey's personality and teaching style and the material itself (that's not to say I never felt lost, but the really confusing stuff tended to be derivations that we didn't need to understand).\nWorkload:\nProblem sets weekly (one dropped), two midterms, and a final (exams are \"curved\" right away, so you know your letter grade as soon as the exams are graded. Averages were B+/A- range).  \n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 13, 2012",
            "review_content": "\nCharles Hailey's class is great for people aiming for a B- to B+ kind of grade. You could never go to lecture and as long as you just do the homework and maybe understand what you're doing you'll get by with the grade you're looking for. \nHowever, if you came to Columbia to achieve more than mediocrity, then this is a class to avoid. Not only is Hailey one of the worst teachers I have ever encountered, but his grading is completely unfair to students who do significantly better than the average. \nFirst about his lectures. I went to his lectures for the first third of the course and found his teaching style very ineffective. He wastes time doing complex proofs of formulas which you never need to know again, and he makes the simplest concepts seem like rocket science. My grades on exams actually improved after I stopped going to class.\nAbout his grading, you can get something like a 65-70 on a test and get a B+, but if you get a 93 you're stuck with an A-. The range for an A/A+ is literally between 96-100, regardless of what the average on the test was (this was an example for a test that had an average of 60%). \nGod knows why this excuse of a professor has a silver nugget on CULPA. Hailey is a terrible lecturer and a completely unfair grader, and I can't recommend him to anyone who's not a slacker.\nWorkload:\nNot bad at all. A problem set every couple of weeks with homework problems that were pretty similar to stuff you would see on a test. \n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "January 07, 2012",
            "review_content": "\nGood person, very likeable.  Very passionate and caring about his students and their learning.  That being said, not a great lecturer in my opinion.  It's clear that he wants us to know the material but his lectures are all over the place.  I went to every lecture, but never reviewed me notes once because it would be pointless.  Some of his examples would be specifically related to astrophysics (since he's an astrophysicist) that would be completely unnecessary for the actual class.  It was hard to follow his examples all the way through.  He doesn't post lecture notes online.  The course itself moves at a quick pace. That being said, I didn't find the class difficult enough to go to any office hours.  (Also, I took AP Physics Mech in HS, so I had background knowledge.)  Overall, he's not the best but definitely not the worst; like I said, he's very likeable, and I personally found him to be an adorable professor.  Also, the class is curved to a B+ so a fair amount of students, I think, get that.  He hates giving low grades. (I got a B+, even though I thought I was gonna get an A-)\n\nWorkload:\nLight.\nA reasonable amount of problem each problem set. (approx 9 problem sets)\nTwo midterms, first one easy, second one more difficult.  (Do the practice tests that he posts!!!!!!!)  Both are well curved.\nFinal was reasonable as well.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 25, 2011",
            "review_content": "\nCharles Hailey will derive, integrate, and re-derive equations until half of the class has been induced into a sleep coma. Don't be fooled by his degree in Astro-Physics, Hailey actually has a PHD in Inception. In his class, your dreams will have dreams!\nThe homeworks are manageable; just don't leave them for the night before as I did once, which proved to be one time to many. Start the assignment early, finish a few problems a night, and you'll be golden. That way, if you get stuck on any particular problem, you can chat with Hailey or classmates to solve it.\nIf you want to do well on his midterms and the finals, study the problems in the practice midterms that he posts on CourseWorks. Some of these problems will be exactly replicated on the midterms, and others will be very similar. \nDon't spend too much time studying problems from the book because Hailey has his own way of approaching problems, and if you want to do well in his class, you must adapt this way yourself.\n\nWorkload:\nWeekly Problem Set, 2 Midterms, and a Final.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 21, 2011",
            "review_content": "\nDon't believe the bad reviews!! Hailey is the sweetest guy ever, and go to his recitations, he can be really helpful and he's a cool guy to talk to. Granted, his lectures can go over your head, but that's why we have textbooks, which you should really read. Don't be afraid to ask questions, and laugh at his jokes. My favorite quote that no one caught was, \"let's say we have a glass of soda, which is water and some poison of course.\" \nHailey is funny and adorable, but the best thing to do to get through the class is do the practice midterms, and then do them again, and again.  \nWorkload:\n2 midterms, one final, weekly homeworks which vary from 10-15 problems\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 21, 2011",
            "review_content": "\nProfessor Hailey is hands down the worst professor I've had at Columbia. He's quite clearly a brilliant guy and a great asset to the physics department for his research, but he has no business teaching a 1400-level physics class, let alone 2 of them. His understanding of the material is phenomenal and he's way above and beyond the basic principles covered in 1401, but his presentation is awful and the care with which he handles the class from a logistical point of view is horrible. Sure, the curve is nice and if you study you'll do just fine getting a B+ or higher in the class, but you won't learn physics. He rushes through concepts, goes off on tangents about irrelevant material, is unclear about what and what isn't accountable for the tests and his solution guides and practice problems for assignments and exams are riddled with errors, simply written quickly on a piece of paper, scanned, and uploaded to courseworks. He's an interesting guy and obviously a brilliant physicist, but his teaching skills are subpar and I thoroughly hated taking his class.\nWorkload:\nOne 10-15 problem homework assignment from the book each week (~3-5 hours), reading (if you do it...), a midterm, and a final (both moderate difficulty, but definitely easier than the homework). The curve is generous.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 21, 2011",
            "review_content": "\nProfessor Hailey is really good. I don't know why there are a lot of negative comments below. He's a top notch lecturer who is obviously really enthusiastic about what he teaches and what he does. The lectures are on the quick side, you keep moving throughout the whole class, but he explains things well, so, as long as you're paying attention you'll get everything. It also helps in spades if you read the textbook before going to his class, then the lectures will be crystal clear. Hailey also stops to answer questions during the class (even tangential ones), which a lot of teachers don't in a class of 150. He also is more than willing to schedule appointments outside of class if you're not getting the material and I'm pretty sure he's nocturnal because I've e-mailed him at 2am sometimes and he'll respond. The homework sets aren't too difficult and there's no negative side to collaboration. The midterms are challenging, but fair and there is a very, very generous curve.  Hailey said the final would look similar to the midterms and practice midterms and it actually ended up looking exactly like them, so, it wasn't difficult.  I would definitely take this class if this is your introduction to physics or even if like me you were a bit rusty from high school physics. \nWorkload:\n-2 challenging but fair midterms\n-1 final that is extremely similar to the two midterms\n-1 weekly problem set anywhere from 8-15 questions long (a couple hours)\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "September 04, 2011",
            "review_content": "\nJust to be honest here, I loved Hailey in 1401. Even though he threw a fit when we all did well on the first midterm (people, it was really easy). But in E&M;, I felt I was completely lost; it just wasn't worth it going to class. If I had something better to do, I didn't regret skipping class. Like the review before said, reading the book and taking your own notes was much more beneficial. I also stopped handing in homeworks for E&M; because the deadline simply did not work for me, plus I couldn't depend on his notes to figure them out. Also, the homework problems were not really like anything he would test us on. It didn't hurt my grade that much. The experiments he did in E&M; were so pointless, and confused me even further. Perfect curve for E&M;, I got B+ and B for the midterms. I think that was perfect considering that I didn't know what the hell was happening. I studied for physics only before every exam. Also, while I was studying for the MCATs, I realized in 1401 Prof. Hailey never taught us anything related to sounds and waves. Well, they're not as easy as I thought they would be.  I took this class because Hailey supposedly was awesome when he was a visiting professor at Barnard in Spring 2010.\nWorkload:\n2 midterms, and a final. \n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 30, 2011",
            "review_content": "\nIf you plan on taking Professor Hailey's Physics courses, you might as well label yourself a complete masochist. Out of all of the teachers that I had freshman year, none have given me as much of a headache like Hailey has. Like many others in my class, I fell prey to the silver nugget that sat beside his name on CULPA. On the first day of 1401, we steamrolled through 3 chapters and, for the most part, maintained a pace of 1.5-2 chapters per lecture for the rest of the semester. In lecture, Hailey demonstrates that not only does he have no clue about the prerequisites for his course (assuming that Calculus II students know about line integrals and partial differentiation - something covered in CalcIII and IV), but he is easily annoyed if you magically don't know these things. When he brought up using partial differentiation to approach a problem, someone asked what exactly is a partial derivative. Hailey's response was a rather bitchy one, as he expressed surprise that a room full of CalcII students didn't know how to do multivariable calculus. \nWhat's worse than the lectures are his exams. Every midterm that we had this year dissatisfied him. In 1401, our first midterm had a mode of 200, which pissed him off. This induced a rage within him and caused him to make the second midterm hellishly long and difficult, causing the average to be much much lower than the first. The scores were so bad, that 15/200 was a C. (You literally had to just walk in the room, write down some formulas and leave). During E&M;, our first midterm had an average around 130/200, still making him sad that it wasn't near 140. And finally, our second midterm average was around 110/200, and this (unsurprisingly) pissed him off. So there's no satisfying Hailey. If he were actually wondering why we did so poorly, it was probably because his teaching skills are subpar. It is almost impossible to create a comprehensible set of notes. I was better off not going to lecture and reading the book (seeing as I got a B+ and B on the midterms). Finally, as a smaller note, expect lots of spam from Hailey as he tends to email the class a lot.\nIf you are feeling brave, adventurous and extremely masochistic, then by all means, take Professor Hailey's class. However, if you have the opportunity to take it with anyone else, do so. Hell, you'd be better off taking 1600 rather than Hailey. At least the difficulty level there is probably more appropriate than with him.\nWorkload:\nWeekly PSets (varying from plug-and-chug type questions to WTF-leveled questions); 2 Midterms (Averages ranging from 50-65%) with an un-escapable B range, 1 Final.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 10, 2011",
            "review_content": "\nI had a very negative experience in his class. Professor Hailey is unclear, condescending, and rude. He provides a lot of demos in class, which is nice, but doesnt explain them well! He expects everyone to just follow what he says no matter how complicated he makes it.\nI did all of my learning from the textbook, which is fortunate because if i had to rely solely on lectures I wouldve failed. He does not teach well and does not help clarify when questions are asked - instead he scoffs at you for asking and reminds you how smart he is and how dumb the class is.\nHis grading policy is as he sees fit when he sees fit. He has percentages listed on the syllabus, but he does whatever he wants. Theres always a curve (because no one learns in his class) but its ridiculous if you want to get an A - really work for it.\nOverall, he knows his stuff - but he could benefit from just being nicer and not constantly talking down to all his students!\nWorkload:\nWeekly problem set, 2 midterms, final - all of which unclear as to their worth\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 01, 2011",
            "review_content": "\nSnarky, subversive, egotistical, and hilarious.  Prof. Hailey is a fascinating guy and makes the material relatively interesting.  Although sometimes he spends too much time rehashing the textbook and not enough time teaching his style of problems, which differs a little from those of the textbook.\nI like the textbook, but it's really not sophisticated enough for this course.  Thankfully I have a different physics text to go to when I have questions.  Halliday Resnick is clear and simple, but doesn't cover all of the derivations done in class.  Maybe it's time to think about another text, even if it's a different one from 1201!\nBetter, more useful recitations needed, especially around exam time.\nTake this course with Hailey over Shaevitz or Tuts, etc.\nWorkload:\nAverage to heavy.  E&M; is tough.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 20, 2010",
            "review_content": "\nIt is questionable how Hailey got good reviews in the past, considering most of the students this year consider him to be their worst professor. Hailey is an overall good man, although his sarcasm and arrogance get the better of him in lecture. Lectures are generally unclear, making even the most detailed note-taker question exactly what they are writing. I would look at my notes and not understand absolutely anything, which just went to show how completely worthless going to lecture is. The practice exams and the formula sheets on exams are entirely hand-written in Hailey's barely legible and typically frenzied handwriting. Practically everything in the course was taught haphazardly, particularly thermodynamics and simple harmonic motion. The second midterm was intentionally made to be very difficult, and while he claimed it was \"just long, not difficult,\" the solution set he sent out had three out of seven answers incorrect. Also, grades are not posted to Courseworks, so it's up to you to guess what grade you have. After sitting through a lecture taught by Dodd as a substitute, it was clear how a good physics professor teaches. \nHailey makes the most simple, straightforward parts of physics seem abstract with hard to understand derivations and practically incomprehensible lectures. Only take him if you have an extremely good understanding of physics already. \nWorkload:\nWeekly problem sets that generally take longer than you expect, 2 midterms, final \n"
        },
        {
            "course_name": "Physics II: Electricity & Magnetism",
            "review_date": "September 21, 2010",
            "review_content": "\nI took E&M; with Professor Hailey at Barnard, and as he explained to us this class went very differently than a large Columbia lecture would. Nevertheless, I thought he was an amazing professor and highly recommend him under whatever circumstances.\nHe is a very inspiring person. He has such a thorough knowledge of physics, and sitting in his class you can tell that he loves what he does, and that is infectious. He successfully can communicate what he knows to students, and if we told him that we didn't understand, he ALWAYS stopped what he was doing and went back and expained until the students understood. He never seemed annoyed to go back and explain anything a student didn't understand. He is very respectful of his students as people-I could go on and on about this but I can also just give the example that once he said in class something along the lines of \"I always say that students can be just as smart as professors, it's just that professors have experience in their pockets.\" He never underestimated the abilities of anyone and he fully recognized when people thought of something really bright. In many ways he is very modest about himself, because from the stories he tells, and his teaching, and his outlook, and what I know of what he has done, he is really a brilliant scientist and thinker and a extremely respectable person all around.\nJust in terms of work and difficulty his class was completely reasonable, problem sets were very reasonable, exams were incredibly straight forward, there were no tricks, in fact, he would give a practice exam before each exam and say that the problems on the exams would be more or less the same as the practice exam, and that was true. He was open to holding review sessions always... he really did hand a lot of things to the students that he did not have to.\nOther people may give other criticisms, you can read about them, but it's hard for me to give them because I just had a very positive experience in his class.\nWorkload:\nsee above!\n"
        },
        {
            "course_name": "Physics II: Electricity & Magnetism",
            "review_date": "June 03, 2010",
            "review_content": "\nProfessor Hailey is amazing. He is an extremely fair and considerate teacher, and he really seems to care about his students. He replied to all of my emails, no matter how sporadic they were, and he even took our schedules into account when timing the midterms. \nI took this E&M; class with him at Barnard, where the class size was about 25-30, much smaller than the usual Columbia classes that he teaches, so I don't know how relevant this is, but he always answered student questions and even held informal exam review sessions before every exam. I imagine that a TA would do most of this in a Columbia class.\nHis lectures can be somewhat strange or confusing, but, like I said, he always answered our questions and returned to the material if he felt that he didn't do a good enough job teaching it. Still, I must admit that I did most of my learning straight from the textbook because Professor Hailey talks very fast and his written notes on the chalkboard are very disorganized. I guess it would be better if he wrote more information down on the board, and in an organized way. \nNevertheless, by seeming to care about us as actual real people, and in caring more about whether we learned and understood the material than about how good our exam scores were, Professor Hailey inspired me to learn just for the sake of learning physics (this is true no matter how cheesy it sounds).\nIn summary: Professor Hailey = always willing to help, makes you want to learn physics. And no trick questions. \nWorkload:\nA problem set every week or two, with fair questions that make you think\nTwo midterms with good review problems\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "December 09, 2008",
            "review_content": "\nBy far the best physics professor I have had. Unlike the other teachers in the department who come up with esoteric and ridiculous exams ,he actually tests concepts that he has taught. His lectures are fascinating and very clear. I would definitely recommend taking any physics class with him. \nWorkload:\nHomework due about every other week. If you study for tests you will be good. Make sure to take detailed notes because he usually takes a similar question from them ( he likes rewarding people who go to class). I had friends who didn't study for his tests and bombed them, so don't slack off, but otherwise it isn't a big deal if you prepare.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 22, 2008",
            "review_content": "\nProfessor Hailey may be a physics genius, but sometimes what he does in class is hard to follow.  Often I'd look back at my notes and not remember what exactly they meant--this must have held true for a lot of people, because the curves were so wide on teh midterms that you had to get below 10-15% to actually fail.  However, he's very enthusiastic about what he's teaching (and about other branches of physics that he'll go off on tangents about), making class bearable.  He always tries to answer students questions to the best of his ability.  Before the final I went to his office hours, though, and it seemed to blow his mind to see a student at his door.  He gives weekly problem sets, but the grades on them mean very little, they basically just affect whether you get a B or a B+, for example, in the class.\nWorkload:\nWeekly problem sets, two midterms, final\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 19, 2006",
            "review_content": "\nHailey is a wonderful lecturer, and a highly facile email tutor.  I never went to office hours, he just explained all my questions on email even on weekends and late at night.  I am a post-bacc, so I haven't seen math for awhile- but his class was very reasonable.  It isn't hard to do well gradewise in this class- the mean is a B (probably due to the fact that some people who are not trying at all may get Cs). I think the median is a B+, so just about everyone is going to get a B+ or better in the class. The midterms are almost exactly like the study sheets he gives, and the first midterm this Fall semester 2005 was not as hard as other reviewers say it was, if you actually listened to the man say in lecture he would test us on nobel prize winners and would include short answer questions.\nHe tells you in class- \"this is a problem I love to give on exams\" or \"i would not be surprised to see this on an exam\" so if you pay attention to his lecture- you're as good as gold.  Jeremy Carlo the TA was a rockstar- just don't bother emailing him, he doesn't do email.  The homeworks were much harder than the exams, don't worry about them- just hand them in, it doesn't even matter what you get on them.\nWorkload:\nWe had less than 1 hw due per week- approximately 8 questions on each hw- the TA basically gives you the answers.\nTwo midterms, one final- everything is curved to a B, it should not be hard to get a B+ or better in this class.  He is an easy grader.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 02, 2006",
            "review_content": "\nProf. Hailey is a great teacher, he takes a somewhat bland and difficult subject and makes it fairly interesting. The class spends a deal of time on derivations, but the examples are extremly useful for exams. I'd say about 1/2 of the final came right out of his lecture notes. He does care about students, holding review sessions and helping to comensate for a bad midterm.\nWorkload:\nThis class is hard, no way about it... expect to spend a good chunk of your weekend on the problem sets. The first midterm had a 30% average, and was pretty killer. There are 2 midterms and a final, and homeworks collected now and then.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 02, 2006",
            "review_content": "\nI found Professor Haley's sarcasm to be so refreshingly sarcastic, it made up for the fact that his exams are VERY challenging.  The good side is that he curves generously and is a GREAT lecturer.  You learn a lot of physics, even for this \"premed\" level course.  Overall, I would reccommend Professor Haley.  He is very intelligent and actually cares about his students even though he has every right to be snob with his 100 million dollar grant from NASA.  \nWorkload:\n2 exams and a final.  Weekly homeworks that don't count for anything really (will bump your grade up or down by a +/- if really good or really bad).  If you flunk the two exams and do well on the final, he rewards you with the grade on the final only.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 21, 2005",
            "review_content": "\nTake the time to study his review sheets, do the problems in the book whether assigned or not, attend TA sessions, and you'll do well.  He's quite accessible.  He may at first seem abrasive and dismayed at your lack of understanding this or that concept, but give him time to loosen up.  You'll find that he is engaged, will take the time to explain, and is encouraging.  I agree with the November 21 reviewer that it is unfortunate he will not be teaching this class second semester.  \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "November 20, 2005",
            "review_content": "\nWhen I found out he wouldn't be teaching second-semester premed physics, I felt like someone in my family had died.  Hailey's class is pure delight.  He brings so much enthusiasm and wit to the lecture, and somehow he creates an intimate, informal atmosphere in the 200-person class.  He makes a lot of self-deprecating jokes, but -- come on -- he's GOT to know how awesome he is.  We all know it, and we're nowhere near as brilliant as he is.\nWorkload:\nWeekly homeworks.  Two midterms and a final.  The tests are tough, but he posts practice problems to courseworks beforehand.  TAs hold frequent recitations.  If your TA is Jeremy C., the recitations will be well worth attending.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "April 22, 2005",
            "review_content": "\nJust a word of caution if you ever take 2801 with this man.  Professor Hailey made his intentions very clear at the beginning of the year: first semester exists to weed out those who are not serious about physics.  If you can hack your way through the jungle that is K&K;, it is clear sailing.  You will have a better, more complete and deep understanding of mechanics than any of your peers and some of those 3003 kids.  This comes at a steep price: time.  Be prepared to spend at least 4-5 hours outside of class for each hour in class.  And that is just studying the book and your notes to understand what went on.  The homework is a whole other story.\nAs other reviewers noted, Azfar, the TA, is almost solely responsible for the midterms passed, the homework understood and the general good feelings about these classes.  \nThe textbooks are, by far, the best introductory physics texts I have seen.  They will lead you down trails that you never knew existed and are very readable.  Well, the notable exception is that god-forsaken intro waves book \"Six ideas that shaped modern physics.\"  So incredibly simplistic as to be laughable after K&K; and Purcell.  \nWorkload:\nKiller.  Pure and simple.  This has been noted in previous reviews and so let me just emphasize it: you will have no life if you take this class.  Make friends early in the year with someone who isn't going to wuss-out half-way through and go do 1600.  Support each other, set up study groups, you will make it and be a better person for it.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "April 19, 2005",
            "review_content": "\nIf your thinking about taking this course you don't belong in it.  You either have the balls to take it (or so the gender ratio would leave you to believe) or you will get buried and drop out.  The going percentage of people who don't make it through the year waivers around 50-70%.\nThat said there are some interesting facets to this course that are good to know:\n1)  Hailey is a research professor, not a teacher.  This considered his lectures really aren't that bad, he tends to get lost a bit though but chances are you won't understand what he's teaching until a week later anyways.  His lectures on relativity are very nice.\n2)  The books for this course are incredible, buy them, love them,  sleep with them; they will serve you well.\n3)  Azfar the TA is awesome, his reviews will save you from bombing the tests.  Hope that he stay on this course.\n4)  You can't fail this course, 0-30 is a C+\n5)  If your one of the lucky few to complete this course you are a leg up on everybody for the rest of college.  It exposes you to all sorts of math and concepts not touched in the regular phyics path and you'll have seen a lot of material that will reappear in your math and phyics courses later on.\n6)  The class forms into an ad hoc frat by the end of the year, this makes up a tiny bit for all the friends you didn't have a chance to make due to the workload.\n\nWorkload:\nKiller.  Not in the usual sense tossed about by some disgruntled students.  Killer in the sense this class will pull years off your life.  Be prepared to give up well between 10-20 hours a week.   All nighters to be expected if you don't budget your time well, learn to like coffee, maybe take up smoking while your at it.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "January 04, 2005",
            "review_content": "\nIf you are interested in physics and want to challenge yourself, I STRONGLY recommend that you take this class. \n1) Lectures: Lectures are essentially straight from the textbooks, so I'll speak of lectures, the professor, and the textbooks in this section. Overall, I enjoyed the lectures and found them valuable. Much of the material is confusing, but this class is meant to expose the students to physics at an advanced level early on, and I tend to appreciate that sort of mentality.\nProfessor Hailey seems far more comfortable with special relativity and electricity & magnetism than he is with mechanics. Although for the most part I liked his presentation of Kleppner & Kolenkow's sometimes baffling text, Hailey can sometimes get a little lost with what he is trying to say and is consequently prone to errors when deriving results and solving problems. Some people were annoyed at his lectures' periodic lack of fluidity, but I found the mechanics lectures generally acceptable and worthwhile.\nThe relativity lectures were fantastic. Hailey seems to understand and explain special relativity far better and more intuitively than the textbook does. There's not much else to say other than that I really enjoyed this part of the course, and I think many others did, too. \nThe e&m; lectures that we did so far are involved and difficult, especially if you have never seen the material before. Hailey himself said  during one of the lectures, \"I expect neither you nor I to understand Purcell at this point in our careers,\" which was both entertaining and true. Purcell's book is very sophisticated, and his writing is sometimes too involved for a first-time e&m; student. However, once you really study his text you can at least follow some of it, and the part that I did get I found valuable. I'm sure this book will serve as a useful resource in the future, too. \n2) Homework: The homework is extremely difficult and time-consuming. Even if you feel you follow the lectures, the textbook problems are still challenging. I strongly advise working in groups for the homework. \n3) TA: Our TA (Azfar) is awesome. Before every test, there was a fairly universal sentiment that Azfar would save us. He always helped with the homework, and his review session for the final was excellent.  \n4) Exams: Honestly, our exams really weren't that bad. The mechanics exam was far easier than K&K;, although I think at that point in the year all of us were expecting an impossible test; we (maybe just I) were thrown off by how straight forward some of it was and were consequently unable to think clearly and coherently. It happens. The special relativity test was directly from the notes - if you know Hailey's lectures, and if you're in a good test-taking mode that day, you'll do fine. The final was, I have to say, disappointingly easy. That isn't to say that I did well on it - at the time of this writing I have no idea what my grade is - but the mechanics questions were high school AP material. The special relativity questions were all right, and the question on general relativity was kind of confusing, to me at least. The e&m; questions seemed doable, but at that point in the year I was not very confident about the subject and therefore was very uncertain on the test. We did get to drop our two worst questions on the final, though, which was quite nice. \nOverall, the class is definitely worthwhile. Hailey's teaching also sometimes gives the lectures a small infusion of astrophysics, which is usually interesting. \nNear the end of the semester, we did a lesson on the expansion of the universe, and he went on a hilarious rant about the Nobel Prize. Anyway, if you're thinking about studying physics, I recommend that you at least try the class - you can always drop it later.\nWorkload:\nHomework: Long, extremely difficult. Grader is stingy, but the tests are what count.\nExams: 2 midterms, one final. They're not impossible, and the averages on each of the two midterms were 59% and 60%, respectively, which were each curved to a B+. Extensive formula sheets are given with each test - use them. \n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "December 25, 2004",
            "review_content": "\nA mildly confusing lecturer. He forgets to identify variables (whose significance changes quite a bit in a course that covers so much materials). The classes are also very long, and sometimes he likes to hold them a little longer than the alloted 2 hours, which can grow a little tiresome.\nHiowever, he's fair, and very explicit about what will be tested, besides the occasional odd problem. You'll find yourself learning more than you even need for problem sets and tests, which I guess is a good thing. While the class is demanding, the more work you do, the better you'll do, so the class isn't unconquerable.\nWorkload:\nVery hard, time-consuming problem sets. 2 midterms and a final. (Curved).\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "November 10, 2004",
            "review_content": "\nVery hard class.  Lecture does not teach you anything, either.  Books almost incomprehensible.  BUT, it can be done, for the tests are not too bad and the curve is high (b+).  \nWorkload:\nSOOOOOOO much time on weekly assignments.  Ridiculously hard and long.  Two exams and a Final.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 18, 2004",
            "review_content": "\nHe's a pretty boring professor. His handwriting is hard to read, and the TAs are slow at getting exams back (though homeworks are given back within a week). Demonstrations are always fun, though. By the way, he drinks Diet Coke. It was a question on the final.\nIf you took AP Physics and had a basic understanding of it, this course will basically be review. There is some new material, like expansion of the universe (mostly for extra credit) and an introduction to quantum physics.\nWorkload:\nWeekly problem set (5-15 questions). 2 midterms, 1 final. Not too easy, but not that hard, either.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 12, 2004",
            "review_content": "\nHailey is king.  The man is very easy to approach, quite friendly, easygoing and generally nice. I loved his in-class demonstrations especially since they most often went wrong providing a break from the montony of lecture and reviving the class . One problem I had with him is that when he's lecturing he doesn't like to stop to answer questions, he just ignores your hand if it's raised. But in his defense, most of the questions kids asked were irrelevant musings that they threw out in an attempt to impress themselves on the teacher and show that they had read the book. The course is hard, but that is not Hailey's fault. He races through the stuff he expects us to know from high school but takes pains to make sure we understand the interesting stuff like special relativity and dark matter. He made me want to switch from SEAS to CC just so I could be a Physics major, yes that is the power of  the king. \nWorkload:\nweekly problem sets that were easy and probably didn't even count in the end. 2 midterms, both of which were fairly ok. And a ridiculously difficult final. If your prepared to practice questions like crazy, you could probably ace this class, but for most of us who have a life, a job, and four other courses, the course will be quite challenging indeed.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 19, 2003",
            "review_content": "\nIf you took AP physics in high school, and passed the test, this class should mostly be a breeze, as far as concepts go.\nHailey is a very good lecturer, he could keep my attention for an hour before I had to look at the clock, and the remaining half hour wasn't too bad. I thought he made the topics very clear and comprehensible. In class, this guy is great.\nBut other than his lectures, this guy sucks. The homework sets were very easy, and the problems on the homework were not even remotely similar in format to those on the midterms or final, so they didn't help at all. Not to mention that only having 10 problems to cover an entire topic is not enough to learn it, and since his tests are vastly different than what the book has for problems, going through the book and doing problems on your own is a waste of time.\nThe curve in the class is ridiculous. If you're satisfied with a B, you'll have no problem in this class, i think 2/3 of the class gets between a B- and B+, but if you want an A- or A, you'll have to work like hell, already know physics better than he can teach it, or just be really really smart. \nThis review is mostly useless, because he is starting his research project over in Japan, so I don't think he is even going to be here next year. \nWorkload:\nhomework sets easy, especially in a study group, 1st midterm was hard, 2nd was pretty good but the curve was ridiculously high, and final was pretty representative of what was focused on on the midterms. \n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "November 18, 2003",
            "review_content": "\nLet me start by saying that I am not a total science person and that physics is a hard subject for me, and it does not come easy. After saying that, this is my review for Hailey:\nI LOOOVE THIS MAN! I had a  horrible physics professor in high school, and this man made me love physics again. He will go into really cool topics and by the end of the class you'll know what you need to know plus al ot of other things that are very interesting and great for impressing friends (if your friends are into physics...mine aren't). Take this class if you have taken physics before. I am switching to the lower physics track but mainly because he is not teaching 1602...Sincerely, one of the best professors I could've come across. Because of that class, I might be an applied physics major.\nWorkload:\nproblem sets are super-hard (if you know physics they wont be that hard), midterms are ridiculously hard, final hard...the only reason I really stayed in this class is because of Hailey. The 1400 teachers are all horrible, 1600 is a worthlessly long and incomprehensibly hard track and 2800 is academic suicide. But the truth is, with Hailey I actually learned physics...\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "January 21, 2003",
            "review_content": "\nLet me start of by saying I strongly dislike science-- but we do have that pesky requirement, so physics for poets seemed to be the most logical choice for me. Physics became my favorite class of the day and prof. Hailey quickly became the greatest prof I have ever had. No joke, he makes the materiel so interesting and easy to grasp. There is a fine line between being too condescending and not simplifing the materiel enough, and Hailey never dipped into either territory. He is remarkable accessible for such a world renowned physicist. I personally went to his office hours at least once a week with no questions relating to class, just relating to the world and universe at large and he gladly spend hours chatting with me. Once, we were even late for class!! Take a class with him if you can!\nWorkload:\nBi-weekly problem sets, which are replicas of the 2 midterms and final. VERY generous curve.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "October 06, 2002",
            "review_content": "\nWhat a great prof!! His enthusiasm for physics is absolutely contagious and he is really funny too. Prof. Hailey makes it hard to not absorb what he teaches you because he presents even the most difficult concepts in such a straightforward and simple way-- and for such an accomplished scientist he is very accessible and eager to help out his undergrads understand the very simplest of concepts.\nWorkload:\nbiweekly problem sets, midterm, final. standard\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "February 22, 2002",
            "review_content": "\nHailey is a good teacher. He is easy to follow and derives everything -- which is definitely a good thing. He moves quickly so dont zone out in his class. You might wake up 5 minutes later and not quite understand what is going on. He's pretty funny and has a few quirks about him. But perhaps the best thing about him is that he shows the class how the basic stuff applies to cutting edge physics. For example, Keplers Third Law applied to prove the existence of dark matter. Or the existence of dark energy, lambda fields, the negative mass of the universe using Work, Pressure and Energy theorems. He manages to mix the utterly profound with the most simple things in physics. Also he is not arrogant at all. You can come up to him and ask him questions, schedule appointments, and he will make sure you get the stuff. \nWorkload:\nWeekly problem sets (10 probs - full of derivations and proofs). Allot about 4-6 hours per week for these. 2 midterms and a final. 1st midterm was EZ. Second midterm was dreadful. Final was good.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 17, 2002",
            "review_content": "\nProf. Hailey's lectures are mediocre and often times boring. If you like easy-to-follow physics professors you might like him, because Hailey derives everything. He's a quirky guy (he kinda reminds me of Kramer from Seinfeld) but overall pretty impersonal and sometimes arrogant.\nWorkload:\nWeekly problem set, two midterms, final. This class is not difficult but beware of engineer curve-breakers.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 17, 2002",
            "review_content": "\nCharles Hailey is a decent professor. His lectures are generally interesting and often interspersed with material from modern physics (dark matter, etc...). His demonstrations are usually vastly amusing (even when they don't work). Hailey's focus on relativity at the end of the semester is one of the hi-lightes of the class (although one of the most confusing elements of it as well). Watch out for the midterms! If he tells you they are easy, dont believe him (ever!).\nWorkload:\nWeekly problem sets from the book (watch out there are a lot of derivations here!), 2 killer midterms, decent final.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 15, 2002",
            "review_content": "\nProfessor Hailey is a really good teacher. His lectures are almost always interesting and his explanations are great. He takes basic classical mechanics concepts (like the Universal Law of Gravitation) and shows you mathematically and conceptually how these relate to the existence of dark matter, X-energy, lambda fields, Xenon nuclei-neutralino collisions and such. Though he doesnt test you on this material, its really cool to listen to. He is well organized in his proofs and is an overall great guy. He has a good sense of humor, is easy to talk to, and understands the problems that a freshman physics student might encounter. He always talks of how he was once a struggling freshman physics student as well and how he wasnt the greatest physics student there ever was. OVERALL: really good teacher, funny, and engaging.\nWorkload:\n1 problem set a week (takes about 3-6 hours depending on difficulty of problem set). Each problem set contains about 10 questions. Reading in the textbook is optional though sometimes useful. GO TO CLASS. If you go to class and pay attention, you will learn most of the material. 2 Midterms and the Final are fair.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 01, 2002",
            "review_content": "\nHailey gives fairly interesting lectures. He often goes off on tangents to discuss related material in contemporary physics. Don't worry -- you're not responsible for that stuff.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "August 14, 2001",
            "review_content": "\nAlthough the material IS difficult, it is very interesting, and Hailey is good at explaining extremely difficult stuff in a straight-forward manner. Also, the tests are pretty easy (much easier than you'd expect from the difficulty of the lectures) and he grades with a HUGE curve. In other words, go to class, take OK notes, ignore the reading, (there's no HW), study for a few hours before the final, and you'll get at least a B+ if you are even the least bit intelligent. And if you insist on getting an A, he gives great review sheets that if you just memorize will be enough to get you an A (I did it once when I needed to raise my grade). But that's not necessary if you're happy with a B+/A- (as I was). Oh--Also, he's a great guy, worth getting to know -- get him to talk about how he worked for the US government on nuclear weapons...\nWorkload:\n2 midterms, final. No other work.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "December 31, 1999",
            "review_content": "\nHailey is at best an absent-minded source of cheeky tidbits on new developments in physics. At his worst, he's a bore and a doof who can get downright hostile when students don't submit to his will (by disputing a grade, for example, or missing an exam for good reason). This is a prime case of the blue book leading poor underclassmen astray again: You may be a poet, but that doesn't mean you belong here. Many general physics students who observed the workload and materials of both classes said Poets was harder. That said, if you genuinely want to come out with an understanding of every major phyics development from Niels Bohr to quantum leaps to the Einstein-Rosen theory of black holes, go for it. But if you hate the idea of relativity taking up space in your brain and are not satisfied with a B, then stay away.\nWorkload:\nCompletely varies - 2-10 hours/week, depending what you want your grade to be.\n"
        }
    ]
}