{
    "prof_info": [
        {
            "prof_name": "Lisa Hollibaugh",
            "prof_id": 3215,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "April 19, 2010",
            "review_content": "\nShe is an amazing professor and mentor. She knows how to lead a discussion and will not hesitate to cut off someone who goes of on a tangent about ____ and ____ and ____ books she read in high school (a common phenomenon of these first year seminars, I've found). If the conversations goes off topic, she knows how to guide the discussion back to the important points. I have to admit, I did not read all the books thoroughly and rarely completed them but class discussion was always entertaining to follow and, for someone like me who didn't read, almost like sparknotes--just better, more insightful, and with unique perspectives. Dean Hollibaugh really values your opinion and won't make you feel stupid for your unique interpretation of something. \nShe's a true inspiration and it's crazy how dedicated she is to her class and individual students when her job (as Dean of First-Years) requires her to care about the entire freshman class. Take her class at marvel at her grace and brains. Just the best.\nWorkload:\nYou read To the Lighthouse, Frankenstein, Paradise Lost, Heart of Darkness and others (can't remember) and a couple of papers. Very manageable and enjoyable readings of books you should read sometime in your life anyways.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 18, 2008",
            "review_content": "\nLoved her!! She is a fantastic teacher and a great dean. She was able to lead or steer discussions without dominating them, and she always had interesting insights but she was open to everyone's ideas. She's not the least bit pretentious, and admits when she has no idea what's going on. As other reviewers have mentioned, she gives copious comments on everything you write and will definitely help you to become a better writer. Moreover, I did not find her to be a difficult grader - she's not easy, but I think her grading was always fair. Plus she lets you revise papers, and the revision grade replaces the earlier grade, so even if you do badly at first you have another shot, and she will help you revise if you go to meet with her. I highly recommend taking this class with Hollibaugh\nWorkload:\nNormal for Legacy...read a book for every 2/3 classes, write one ungraded response per week, write two longer papers.\n"
        },
        {
            "course_name": "First year english",
            "review_date": "April 10, 2007",
            "review_content": "\nAn interesting class. However, she's possibly the hardest grader ever. No matter how hard you work on your essays, don't expect an A. But she definitely helped improve my writing. Overall, good professor, but a hard grader.\nWorkload:\n3 essays, the last one was a giant research paper. \n"
        },
        {
            "course_name": "First year english",
            "review_date": "March 31, 2007",
            "review_content": "\nI had her last Spring for The Americas, Barnard's first year required English class. Professor Hollibaugh was fantastic! The classes themselves were a bit boring sometimes, but usually it was due to students' lackluster comments rather than any fault of the professor. The reason that I liked Professor Hollibaugh so much is that she really helped improve my writing. Looking at the difference between my first paper and my final paper, I see a very large improvement. My writing wasn't bad to begin with, it's just that Professor Hollibaugh was able to help me see ways to significantly improve it. She is a hard grader and unafraid to give low scores on papers; however, if you ask her for guidance on how to improve she will be more than glad to help (and, unlike other professors, will actually be able to). \nWorkload:\nI think the syllabus was the standard one for Barnard's first year english classes, and so were her assignments--3 papers, one day leading class discussion. I think there were also some sporadic small assignments to help us understand the readings better. Oh yeah, and peer editing others' papers. That was very annoying (I think it was the main thing I didn't like about the class!)\n"
        }
    ]
}