{
    "prof_info": [
        {
            "prof_name": "Joseph Howley",
            "prof_id": 11435,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 28, 2016",
            "review_content": "\nProfessor Howley really is the best professor one can ask for. He is a very very very nice person, someone who always genuinely cares about his students. He's a classics professor with a specialisation in Roman literature, so he can actually connect Latin/Greeks words and Roman history with what we are reading. When the class went to the MET together we all saw how obsessed he is with his stuffs.  His class is truly engaging, in some magical way everyone actively participates. There's not a sense of dullness in his class at all, never. Professor Howley has a ton of personal charm, it's never boring to talk to him/be in his class. He really knows his stuffs but never appears to be condescending or lecturing. Also, he's very loose with extensions, if you ask, there's no way he won't give you a lot more time to write as long as you tell him what happened. He also is a very fair grader, mostly people get A- on papers and same with midterm, but he ends up giving higher final grades. Not that he's just laid back, but he really knows how to encourage students and make sure they are rigorously trained at the same time. He's strict when he needs to. If you get him as your lit hum professor I'm impressed by how lucky you are. Or if you are taking a classics class, I strongly recommend you take it with him. He's a perfect professor in every sense, whether you are just starting to get into classics or deeply familiar with the material. Everyone in my lit hum class LOVES professor Howley, have never seen any exception.\nWorkload:\ncommonplacebook (short analysis of passage excerpts of your choice for every class), one midterm, one 5-6 page paper, one 7-8 page paper, a final, an optional MET tour, extra credit bacchae play watching\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 14, 2012",
            "review_content": "\nI wholeheartedly I agree with the brilliant reviews given below me for Professor Howley with a number of additional comments. Whether it was using frequently the resources on the Core website or the Batskolnikov comics or the video game Dante, I loved the way he encourages students to think outside of the box when it comes to literature as he often connects the works to other artistic mediums in a very entertaining and interesting manner.\nMoreover, he does an outstanding job, especially with the Roman-Greek works, in placing his students in the adequate context and thus strengthening the cohesiveness of the Core narrative. For instance, his introduction to Thucydides and Herotodus proved to be essential for understanding the zeitgeist these works represented and made the readings much less fragmented than they seem. I also loved the concise but surprisingly informative account he gave of Roman history just before we tackled the Aeneid.\nAbove all, I would like to echo some of the comments on how easily approachable and relatable Professor Howley is, especially when it comes to small digressions about video games and college life :)\n \nWorkload:\nRefer to below\nBe on the lookout for extra credit here and there!\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "May 25, 2012",
            "review_content": "\nProfessor Howley was an awesome Lit Hum professor!  Literature Humanities is every Columbia student's introduction to the Core Curriculum, and in many ways, Columbia itself, and I was very fortunate to have such a great experience in this class.  The class was interesting and engaging, and Professor Howley really made sure we contributed a lot to the conversation; this class was definitely not a 2-hour lecture, though he would contribute his knowledge of the texts to help give us context and a starting point for discussion.  Especially during the first semester, Professor Howley never hesitated to give a \"latin lesson of the day,\" as the classics are his speciality.  He was always available to meet with, either via email or outside of class, whether it be to discuss your essay or just questions in general.  Everything is fairly graded, and often will have a rough draft or always will have a review session before exams to make sure everyone knows exactly what to expect.      \nAs the class progresses from the Greeks to the modern world, Professor Howley does a great job connecting all the works of literature into one long continuous story.  It becomes clear how the more modern works, for example, are influenced by the older ones.  His enthusiasm for the course really comes across in his interest and knowledge of the material, and his love of the texts certainly rubbed off on us.  I can almost say with confidence that everyone in my class had pretty much the same experience as I did, and really enjoyed Professor Howley's class.\nAnd to anyone who loves video games, he is an enthusiastic gamer, especially when it comes to Skyrim.                                   \nWorkload:\nStandard Lit Hum workload: 2-3 essays per semester, midterm, and final.            \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 25, 2012",
            "review_content": "\nI'm going to start this review with a quote, against all writing advice: \"You bludgeon a cow, and then you bury it, and then bees.\" This is a pretty accurate summary of how Prof. Howley teaches. It's just sort of vibrant. He's passionate about teaching Lit Hum--he's a classicist by training, specializing in reading during the Roman period, so a lot of the material is his what he would be studying anyway--and is really interested in hearing the ideas of the class. Whenever someone would make some really great point, he would try and get either them (or the class) to expand on it, but it didn't just increase the class' understanding. It seemed like he was learning along with us. (Not in any bad way. Maybe it's because I had him during his first year at Columbia...) Anyway, this kind of teacher, at least for me, is exactly the kind you want for Lit Hum. He's young enough so that he's relatable (he was still telling us stories about his college roommate), but knowledgable enough that he could really teach, not just connect. You're lucky if you're assigned to his section. He really cares about Lit Hum (we begged him to teach CC, to no avail), and he really cares about how much of his class gets out of it.\nI haven't put much abou how he actually teaches in this review, I guess because I didn't think it was too important. I'm not saying that he wasn't a good teacher, but that his teaching was informed by his personality. Howley controlled the classroom and connected to the class through his youth, through his vibrancy, and through his passion. He facilitated discussion for most of the 2 hours, with lecture ONLY WHEN NECESSARY, and, if he did lecture, it was always brief and to the point. \nOverall, this was a great class. Be happy if you get it, but be ready to participate.\nWorkload:\nstandard lit hum, with lax deadlines and what seemed like moderately easy grading\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 16, 2012",
            "review_content": "\nI loved this class. Prof. Howley is smart, personable, and eloquent. He is a classicist with lots of enthusiasm for Greek and Roman literature, but does not fall short in the second semester with the modern works. He facilitates class discussions, and walks the fine line between teaching and allowing students to develop their own opinions. It's possible to go through the course without reading all the texts, but he does not go over all the plot points of each book, so you really need to do the readings to know what happens. By doing so, he allows discussions to be guided by ideas rather than facts in a way that makes the class fascinating. Throughout the year we would draw connections between what we were currently reading and what we had previously read, and creating an understandable progression from Homer to Virginia Woolf. My notes are filled with little phrases he's said during class that provide tremendous insight into the books and are food for thought even after we've moved on to other works.\nConsider yourself lucky if you're sorted into his section, and if you have the chance to switch in, do so!\nWorkload:\nStandard for Lit Hum. Three papers per semester, and often we would have to submit some sort of draft before the due date. Grading is very fair. He provides thoughtful feedback, be it through meetings, paper comments, or even just email.\n"
        }
    ]
}