{
    "prof_info": [
        {
            "prof_name": "Piia Mustamaki",
            "prof_id": 9945,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Western Theatre Traditions: Modern",
            "review_date": "March 10, 2014",
            "review_content": "\nIt's odd to read these reviews. Dr. Mustamaki is very nice, but most lectures aren't lectures at all, but discussions led by the group presenters assigned for that class date. We've had no guest lecturers and in fact Dr. Mustamaki herself usually sits and merely guides the discussion while fellow student's present most of the contextual information and critical questions about the authors or plays. \nThe play selection is good and wide reaching across European and American Modernism, with a quick lecture about the beginning of the industrialist period.\n-Textbook note:REQUIRED TEXTBOOK HEAVILY USED, YOU WILL ACTUALLY NEED TO BUY IT\n-Play note: Tickets for Machinal were arranged through ArtsLink at a deep discount, not covered by the professor/class. play attendance was not required.\n-Attendance: taken every class, incorporated into grading (see below)\nFinal Grade:  For students whose attendance/participation is acceptable, final grade in the course will be no lower than the figure determined by this formula: Papers 50% (1-15%; 2-35%), Final Exam 35%, \nPresentation and Discussion Board Entries: 15%.\nWorkload:\n-Readings: Plays and other assigned materials must be read in their entirety prior to discussion in class. (1-2 plays per week + introduction to the play and playwright in the Anthology.)\n-Writing: Two papers (1. 4-6 pages and 2. 6-8 pages.) due in class on the day assigned, typed.  I will deduct half a letter grade a day for papers handed in late. Appropriate research, and/or secondary reading required for your paper should be discussed with the instructor; all reading that bears on the submitted paper must be acknowledged.\n-Exams: There will be a final examination given during the examination period. The examination will be a mixture of identifications drawn from the readings and an essay. \n-One presentation with a group.  \n\n"
        },
        {
            "course_name": "World Theatre",
            "review_date": "September 11, 2013",
            "review_content": "\nPiia is one of the best professors I have had at Barnard. She is incredibly understanding and knowledgeable and brings in amazing guest speakers/performers. Her lectures made the topics fresh and exciting even when the readings were a little dull. The class was pretty big and easy to hide in if you didn't do the readings, which helped, but even if I hadn't done/finished the readings, I enjoyed class. I would definitely take this class again!\nWorkload:\nA short research paper, a long research paper, a group presentation, weekly discussion postings, a final exam, and you're expected to go to class and do the readings. Piia was the easiest grader I had in college (I literally wrote fifth grade-level research papers and did well) but her final exam was killer - I'm pretty sure no one did well and she ended up curving it.\n"
        }
    ]
}