{
    "prof_info": [
        {
            "prof_name": "Elizabeth Blackmar",
            "prof_id": 89,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "May 01, 2016",
            "review_content": "\nI learned a wide knowledge base into the world of the making of our built environment in America. It was extremely interesting and Blackmar is an excellent lecturer with vast knowledge in her field. I learned about irrigation, consumerism, Taylorism, modernism, roads, landscape architecture, parking lots, tourism, and how to identify features of the built environment through our Scavenger Hunt. Blackmar is absolutely brillant. That said-- the lectures will be some of the best you've heard. She is engaging and frequently asks questions of the class. She makes connections that you wouldn't have thought of previously. She is even giving us feedback on our final paper. She offered office hours every week and cancelled class one time in order to meet with all of us that desired to meet with her on our final papers. A great professor! Feel lucky w/ Blackmar. I learned so much especially through my research paper and Scavenger Hunt. The hunt facilitated my knowledge of the course through my own discovery of the environment around me. The lecture slides were especially helpful in making connections and taking notes post-class period. They provided a comprehensive review! I loved this class and I would recommend it to anyone wanting to learn more about the world around them. It made me a non-passive observer. She is deserving of her silver nugget. \n\nWorkload:\nA lot of reading ~100 pages per week and a discussion section, midterm, final, final paper (10-12 pages), Scavenger Hunt (10 pictures of built environment// whatever you want) \n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "May 01, 2016",
            "review_content": "\nI learned a wide knowledge base into the world of the making of our built environment in America. It was extremely interesting and Blackmar is an excellent lecturer with vast knowledge in her field. I learned about irrigation, consumerism, Taylorism, modernism, roads, landscape architecture, parking lots, tourism, and how to identify features of the built environment through our Scavenger Hunt. Blackmar is absolutely brillant. That said-- the lectures will be some of the best you've heard. She is engaging and frequently asks questions of the class. She makes connections that you wouldn't have thought of previously. She is even giving us feedback on our final paper. She offered office hours every week and cancelled class one time in order to meet with all of us that desired to meet with her on our final papers. A great professor! Feel lucky w/ Blackmar. I learned so much especially through my research paper and Scavenger Hunt. The hunt facilitated my knowledge of the course through my own discovery of the environment around me. The lecture slides were especially helpful in making connections and taking notes post-class period. They provided a comprehensive review! I loved this class and I would recommend it to anyone wanting to learn more about the world around them. It made me a non-passive observer. She is deserving of her silver nugget. \n\nWorkload:\nA lot of reading ~100 pages per week and a discussion section, midterm, final, final paper (10-12 pages), Scavenger Hunt (10 pictures of built environment// whatever you want) \n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "November 13, 2011",
            "review_content": "\nProfessor Blackmar truly cares about her students. She is more than willing to meet one on one to work on papers etc. and actually reads EACH of her students papers and gives extensive comments! Blackmar met with me several times to work on my research paper (the first history paper I had written in college) and each time we met for at least an hour. She even met with me 3 times in one week. All of this and she is brilliant and super accomplished. In addition to being great one on one, Blackmar is a truly insightful lecturer. In fact, I often felt I couldn't write fast enough in lecture because everything she said was so interesting. This was my first history class at Columbia, the class that convinced me to change my major to history! A great class for anyone interested in the built environment and a unique way to study U.S. history. Its a lot of reading (not all of which is amazing) but totally worth it! \nWorkload:\nSignificant reading paired with discussion section and posts for section. A sizable research paper, a midterm and a final exam. \n"
        },
        {
            "course_name": "Historian's Craft",
            "review_date": "December 23, 2010",
            "review_content": "\nHaving just come out of this class, I can say this is one of the most difficult but rewarding classes I have taken at Columbia. The seminar meets once a week (it's the fall thesis prep course for juniors going abroad in the spring, basically). The first few weeks of the course is spent just reading various types/genres of history-writing and learning how to critique different authors' use of sources, writing styles, and conceptions of historical phenomena. This part of the course is sort of weird because no one really has a handle on the material because everyone's historical specialization is different and the reading load is pretty heavy. But I think I got a fair amount out of it when I wrote my final paper. The rest of the course is preparing your prospectus (a research proposal for your thesis). It's daunting and a ton of work to do on top of weekly reading and responses, which continue throughout the semester. There are various checkpoints along the way though to make sure you are keeping up (topic statement, bibliographies, primary source analysis, etc.) \nProfessor Blackmar is, like the class, both intimidating and amazing. I have never met a professor (let alone an academic bigshot) sit down with you for over an hour to help you. Her factual knowledge is awe-inspiring and she challenges you to think critically in a way few professors at Columbia have. That said, you need to keep up with your work and your research because she will tear you apart with questions if you don't. But she's really a wonderful person who really cares about her students and sees them as scholars-in-training (even though we were all just fumbling through). If you have any interest in doing a senior thesis, take this class! It's absolutely traumatic but you will come out feeling accomplished, which in most classes I definitely don't. And she didn't seem to grade to harshly, which is a plus. \nWorkload:\nHeavy. \nResearch project work: 15-page prospectus (not that bad if you do the research), tons of research (plan on SKIMMING- do not read everything. i made that mistake- hundreds of pages each week, including archival research), progress reports (bibliographies, primary source analysis, etc.). \nOther work: weekly reading for most of the semester (300+ pgs/wk), weekly response (1-2 pgs), participation\n"
        },
        {
            "course_name": "American Society in the Age of Capitalism 1819-1897",
            "review_date": "February 06, 2005",
            "review_content": "\nThis class was the most traumatic experience of the past three years of my college career.  The workload was rediculous, in addition to being rediculously boring.  Reading 250 pages of absolute crap will really take a toll on you.  Perhaps I am being too harsh, but everyone who I have spoken to about this class agrees that they spent all time associated with that class in a total daze.  The lectures were so abstract and confusing that the TA's admitted that half the time they had no idea what was going on either.  The readings were no less abstact and pretty much as confusing and useless.  We read a couple of pretty good books, but spare yourself the pain and go read them on your own.  The papers consisted of the TA's busting your balls and the final gave you the fun task of putting a sememster's worth of incoherent lecture and readings that had nothign to do with one another into some sort of coherent argument.  I wish that I was just an angry person without any backing, but if you ask anyone who took the class, they will agree...Just thinking about the class brings me to a panic.  Also, the grading was insane.  I don't think one person in my section (perhaps the whole class) got an A or an A-, or so it would seem from the multitudes of history majors who I took the class with.  We pretty much hypothesized that whether you did none of the work or spent 30 hours a week toiling over the total bs that was the Age of Capitol, you either got a B or a B+.  Towards the end of the semster, as students had dropped out of lectures like flies, we were informed that the class had in fact been conducted and graded like a graduate class.  While I enjoy the revelation and the excuse we were provided for the pain we had endured, It was no consolation since 1. I've taken graduate courses and they are nowhere near as painful, and 2. It was nice of them to tell us so far into the semester that we had no choice but to continue to endure the trauma.  Finally, the TA's were nice people but unfortunately, willing accomplices to the crime...the graing and torture they provided was unbearable.  For the course evaluations we all wrote that it wasn't that Prof. Blackmar was abstract and incoherent, but that we were probably too stupid to understand her.  Well, there's no way 100 students (plus TA's) were that stupid.  My friends and I have all developed Post Traumatic Stress Disorder due to this class.  Believe me when I say the pain is not worth it.  I used to think it was because nothing interesting happened in the 1800s, but even when we got to the civil war and the progressive era, the pain continued.  Thus anything i may have possibly learned in this class is repressed far back into my unconscious, and all I can do when something unfortunate reminds me of this class is cry.  Take Foner's class on radicalism...sort of the same topic, yet feels like heaven.\nWorkload:\nThe one good thing this class has done for me is give me such a great appreciation for the classes I'm taking this semster.  Only 200 pages of reading for a class?  Readings that are compelling and humorous?? Surely i must be dreaming.\nAll I can say is pain pain pain.  If you are a masochist, you will love it.\nI'm actually pretty content with the B+ I got, so don't think that this is an angry diatribe...its a serious warning.  I wouldn't be so angry if I had learned something, anything, from this class, but I didnt.  All I got were weekly lashings.  Blackmar is a nice person and her crush on Henry Adams is really amusing...but not worth taking the class.\n"
        },
        {
            "course_name": "American Society in the Age of Capitalism 1819-1897",
            "review_date": "January 18, 2005",
            "review_content": "\nThis class is really far too sophisticated to be taught at the undergraduate level, or at least the 3000 level.  Blackmar is brilliant, and if ever you should have the chance to take a class with her,  jump at it.   Just be sure it is not this one.\nThe reading list was VERY heavy, but fabulous.  She is the first historian thanked in many of the acknowledgments at the beginning of several of the texts, so she has a firm grasp on many of the concepts here.  Problem is, they are all disparate and markedly distinct concepts, so in trying to synthesize them into a coherent final examination (in which you had to incorporate 7 of the readings), frustration abounds.  Furthermore, I am utterly baffled at how a 19th c. history course is taught at the UNDERGRADUATE level (!)with not a mention of the Civil War! \nBlackmar, hear this: your lectures were inspirational and listening to you, as an academician, take what seemed like personal responsiblity  for the utterly incomprehensible election results is a moment that I will forever be humbled by.  I attended each and every lecture, hoping that I would begin to believe what you believed about this course.  Please go back to the drawing board and drum up some more tangible themes before teaching the course again.\nWorkload:\nMidterm paper (5-7 pages), final paper (10 pages), IMPOSSIBLE final (questions ahead of time), section.  \n"
        },
        {
            "course_name": "American Society in the Age of Capitalism 1819-1897",
            "review_date": "December 23, 2004",
            "review_content": "\nBlackmar is an absolute star.  And I really didn't want that to rhyme, but i could think of no other word.  She is absolutely brilliant, and this class was wonderful. However it was easily the hardest class I have taken at Columbia.  Not so much because of the work, but because of the concepts--the readings are impossible, and therefore the papers are impossible.  This was the first time she taught the course, so it was lacking somewhat in the continuity department.  Nevertheless, Blackmar is exceedingly nice, and extremely helpful in office hours, and REALLY REALLY cares what her students think.  She is off next semster, but when she teaches this class again next year, make sure you take it.  Incidentally, it's also a nice foil to Foner's classes--you sort of get all of the internal, social struggling that he leaves out.\nWorkload:\nlots of hard reading that you really need to do to understand the course, midterm paper, final (you get the impossible questions beforehand), and a posting every week for disc. section.\n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "June 23, 2004",
            "review_content": "\nProfessor Blackmar is a good teacher; she clearly knows a lot about the subject, has put together a good syllabus that seems to hit the high points of historical writing about the landscape without veering too far afield into urban studies, sociology, or political history, and has a large collection of slides relevant to the subject, which she uses to link her more theoretical lecture topics to concrete reality of the American landscape.\nUnfortunately, a long lecture with extensive use of slides, in a midmorning class, is just going to make students fall asleep.  There's nothing to be done about it.  Couple this with what seemed like some nervousness in early lectures (odd in a professor of Blackmar's tenure) that had her continually interjecting \"um\", and what sounded like incipient laryingitis starting sometime around midterm (she mentioned at the end of one lecture that she had a cold she just couldn't seem to shake and hoped she'd be able to lecture at all next time!) and it's not too hard to see how the class could become rather painful for some students.\nBut the reading was great, and skipping lecture would have been pretty stupid: it simply isn't the same to read someone's academic writing on a given subject as it is to actually see extensive visual documentation of it., and there were some topics, like early suburban commercial development, that weren't covered in the readings at all.\nI'd be curious to take a smaller course from Blackmar to see if the actual class time were more fun; I have to expect that it would be.  As it was, I was happy with the course and satisfied, though not overjoyed, with the lecture experience.\n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "May 15, 2004",
            "review_content": "\nJust one thing about Prof. Blackmar that no one's mentioned yet: She reads and comments on every word her students write.  She is also more than happy to read drafts if you ask her to, and she'll talk with you after class or during office hours for as long as you want.  Everyone I've talked to agrees that she's one of the most highly involved professors in the department.\n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "May 13, 2004",
            "review_content": "\nProf. Blackmar is a really sweet woman. She loves the material and cares about the students. Still, she's not that dynamic a speaker. About half of every class is slides, and I found it hard not to sleep through her monotone, which is too bad, cause the material itself is great. It's a also a cool idea for a course, though a little broad. I'm not a history major, but I really enjoyed learning about the material. She also edits the syllabus and we read a lot of good stuff. I reccomend this, with my only reservation being that she personally could have been a little more exciting.\nWorkload:\nMidterm, Final, and a term paper that is really fun as papers go. As for the reading, it's a book a week, but she only assigns the chapters that we actually need to read. A lot of care goes into everything she does. \n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "May 10, 2004",
            "review_content": "\nBlackmar is amazing. She's a wonderful lecturer, a nice and warm person, a brilliant wit and she isn't pretentious or stuffy. Blackmar likes to lecture about things based in reality... no airy-fairy mental masturbation in her class. Come expecting to learn an amazing amount about an astounding variety of things. \nRarely are professors this good. Take her class.\nWorkload:\nThere's a lot of reading, but nothing too difficult. The assignments are interesting... wouldn't you rather do a 10 page paper you enjoy writing than a bornig 5 page one? Midterm and Final aren't hard if you've done most of the reading.\n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "May 09, 2004",
            "review_content": "\n  Prof. Blackmar is the most modest, engaging, charming, intelligent, and truly caring professor I have had at Columbia.  Her knowledge of the American landscape is further complimented by her extensive slide collection (which she shares with her class).  She will truly change the way that you look at America (she even gave me slide film to take photos during spring break).  Her class is interesting for historians, art historians, economists...pretty much any social science major.  Blackmar is more than willing to meet outside of class and the texts are in no way overwhelming.  Take this class or any class with Blackmar! \nWorkload:\nA book a week (long, but interesting and fairly easy reading).  One 10-15 page paper. Midterm and final.  Not bad at all.\n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "April 28, 2004",
            "review_content": "\nI cannot say enough good things about Prof. Blackmar.  In every lecture I was completely riveted.  She packs a ton of information into the first 15-20 minutes of lectures and then illustrates her points using slides, so you can actually see the trends in the built environment that she's talking about.  You can tell that she's passionate about cultural geography and landscape history.  She is also an extremely kind professor who really tries to get to know all her students, and although this isn't easy in a class of 100, if you go to her office hours she'll never forget you and you'll learn a lot as well.  Also, she gets really good TAs, so make use of them.  This was a great class, an absolute pleasure.\nWorkload:\nThere's a lot of reading but if you like the subject of the class you'll really enjoy the books.  Also Midterm, final, 10-12 page term paper on an aspect of the built environment of your choice (very open-ended), 2-3 page field report.  Nothing Columbia students can't handle.\n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "March 07, 2004",
            "review_content": "\nWithout fail, about 15 minutes into lecture I would wind up wanting to stab myself in the ear just to not hear her talk anymore.  Although Blackmar seems absolutely brilliant, she is unable to go through 2 words without saying \"uhm.\"  Seriously, I made a point of counting the \"uhms\" one lecture and I was up to 700+ in about 40 minutes. \nThat said, the readings are great and so are the TAs which makes the class is worth taking only if you make a point of not going to lecture (which wont impact your grade, I promise -- the number of people in the lecture dwindles everyday when evryone realizes the same thing -- she is impossible to listen to).  I hope she reads this review and works on her lecturing style to improve the class. \nWorkload:\neasy -- midterm and final worth about 20 points each.  Paper worth the most plus section and short visit to a NYC neighborhood.\n"
        },
        {
            "course_name": "Historian's Craft",
            "review_date": "April 11, 2003",
            "review_content": "\nThis is a brilliantly organized seminar. The readings represent different subjects, eras, and approaches to constructing history. Prof. Blackmar is a genius and the nicest professor I have had at Columbia. If she is teaching a course on the history of the Albany, New York phonebook, take it. She has the ability to make any subject interesting. \nWorkload:\nAbout a book per week with responses due before class. Final paper on independent research 15-20 pages.  \n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "January 25, 2003",
            "review_content": "\nProfessor Blackmar is the top professor in the History Department in my opinion.  I found this class amazing and it transformed my view of modern American History.  She is brilliant and though there is a substantial amount of reading, most of it is interesting and complemented by wonderful, interesting lectures.  About 1/3 of the lectures are taken up by slides, which is more interesting than being constantly lectured at.  Also, Blackmar is incredibly approachable making as much time as needed to talk to students via email, after class, or in her office.  I cannot say enough about how nice, intelligent, and approachable Professor Blackmar is.  I would recommend her to all interested in an inter-disciplinary approach to American History.\nWorkload:\nNot unreasonable. A fair amount of reading, which is interesting.  Sections, a paper, midterm and final (which are easy).\n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "January 25, 2003",
            "review_content": "\nProfessor Blackmar is the top professor in the History Department in my opinion.  I found this class amazing and it transformed my view of modern American History.  She is brilliant and though there is a substantial amount of reading, most of it is interesting and complemented by wonderful, interesting lectures.  About 1/3 of the lectures are taken up by slides, which is more interesting than being constantly lectured at.  Also, Blackmar is incredibly approachable making as much time as needed to talk to students via email, after class, or in her office.  I cannot say enough about how nice, intelligent, and approachable Professor Blackmar is.  I would recommend her to all interested in an inter-disciplinary approach to American History.\nWorkload:\nNot unreasonable. A fair amount of reading, which is interesting.  Sections, a paper, midterm and final (which are easy).\n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "January 25, 2003",
            "review_content": "\nProfessor Blackmar is the top professor in the History Department in my opinion.  I found this class amazing and it transformed my view of modern American History.  She is brilliant and though there is a substantial amount of reading, most of it is interesting and complemented by wonderful, interesting lectures.  About 1/3 of the lectures are taken up by slides, which is more interesting than being constantly lectured at.  Also, Blackmar is incredibly approachable making as much time as needed to talk to students via email, after class, or in her office.  I cannot say enough about how nice, intelligent, and approachable Professor Blackmar is.  I would recommend her to all interested in an inter-disciplinary approach to American History.\nWorkload:\nNot unreasonable. A fair amount of reading, which is interesting.  Sections, a paper, midterm and final (which are easy).\n"
        }
    ]
}