{
    "prof_info": [
        {
            "prof_name": "Todd Rouhe",
            "prof_id": 1696,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Perceptions of Architecture",
            "review_date": "May 01, 2015",
            "review_content": "\nI have mixed feelings about this course. Firstly, there is the whole three professors thing. Ralph taught Monday lectures and then the class was split into three sections for Wednesday seminar. The professors rotated the sections as the semester progressed, so you got each one for several weeks. At first, I hated this chaotic organization but I came to appreciate the fact that, unlike most classes with discussion sections, the seminars weren’t in addition to the M/W periods.\nThe workload is fairly heavy and attendance is required. There are approximately 60-80 pages of reading a week and “reading response questions” due every Sunday night at 7PM. The majority of your grade, however, is determined by two short writing assignments and a term paper. The two writing assignments require off-campus visits on your own time (one to an exhibit at the MoMA; the other to the Seagram Building). The term paper is due progressively over the second half of the semester. The first draft represents the first half of your paper; the final draft represents your entire paper. Finally, you are twice required to co-lead the Wednesday seminar along with another student in your section. Each of you must present one of the readings for that week. \nArguably the most annoying thing about this course is the due date for written assignments. Hard copies of all written assignments are due Friday mornings by 10AM on the fifth floor of the Diana Center. Submission deadlines at the end of the week take some adjusting to, not to mention that it’s difficult to drag yourself out of bed after staying up until 4 in the morning finishing said assignment. \nThe course also entails two site visits, one to the Lower East Side (led by Todd) and one to New Haven (led by Ralph). Both excursions were incredibly informative and fairly well organized. My only complaint was the unfortunate weather conditions on both occasions. The Lower East Side visit was on a cloudy day in late February, so the cold was to be expected. The New Haven trip occurred in the middle of a late-winter snow storm. It is difficult to appreciate New Haven's architecture with snow blowing in your eyes.\nThe professors themselves each have their own quirks. Ralph is pretty straightforward, always attempting to present as much material as possible in lecture. He is amicable and genuinely interested in the material, wishing to instill this same interest in his students. Leah is a bit more abrasive and will not hesitate to correct you in seminar. That being said, she knows her stuff and truly cares about her students. Todd...well, Todd is Todd (do read his CULPA reviews). He is approachable, light-hearted, and just so sassy.  He always wears a smile and rarely speaks without even the slightest comical intent (dry humor to say the least).\nWorkload:\nYour grade is broken down as follows:\nparticipation in the 12 Wednesday Seminars\t\t12%\n     (you must speak at least once each week!)\nweekly reading response questions\t\t\t12%\nseminar presentations \t\t\t\t\t16%\nwritten assignment 1 (400-500 words)\t\t\t10%\nwritten assignment 2 (400-500 words)\t\t\t10%\nterm paper outline\t\t\t\t\t5%\nterm paper drafts \t\t\t\t\t15%\nterm paper final submission (2500-3000 words)\t\t20%\n\n"
        },
        {
            "course_name": "Introduction To Architectural Design and Visual Culture",
            "review_date": "December 05, 2014",
            "review_content": "\nProfessor Rouhe (or simply Todd, as his students call him) is hilariously sassy and overwhelming amicable. He effectively taught the basics of model-making and hand drafting, emphasizing a clean and careful technique. In terms of project content, he provides explicit guidelines but is intentionally vague in describing what the final product should be. In this way, he allows the student to wield tremendous artistic license (which is particularly refreshing for SEAS students like myself). He provides helpful and constructive criticism during desk crits and pinups, but is careful to let the student work through his/her own ideas. With the exception of final pinups for a particular project, reviews were meant to help students at any stage in their creative process. The overall emphasis seemed to be on a step-by-step progression of ideas. \nWorkload:\nThis course is a major time commitment. Expect to spend many hours in studio, especially in preparation for final pinups. The key is dividing a project into small chunks. There are four main projects and one site visit (during the class period). Honestly, I don't think anyone knows exactly how your grade is calculated in this class, but from what I understand, Todd wants to see a concentrated effort on the part of the student.\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "April 19, 2010",
            "review_content": "\nTodd can be a little square--especially in comparison to Madeline Schwartzman--but he's a fantastic intro studio professor. In his class you will learn the basics of hand drafting, something that I feel is often overlooked in the intro studios of other professors. He can be very nit-picky about craft, line weight, and specificity of material and form but I really appreciated that rigor. It returns so much of the architectural discipline to a program (Barnard+Columbia architecture) that leans heavily towards the experimental and abstract. You will not learn any computer programs in this class and I get the feeling that Todd generally dislikes renderings anyway.\nHe is very careful about giving everyone the time that they deserve. He can be painfully slow at getting around to everyone in class but if he doesn't get to you in one class, you will most definitely be one of the first people he sees in the next class. He won't leave your desk until you are both satisfied with the discussion of your work. He is very encouraging and never snarky. He also makes efforts to defend students when the critics attack. When he critiques your work, he remembers everything you two have discussed and really tries to see your work from your own perspective. It's easy to get discouraged in this department with the heavy workload, sleepless nights, and creative frustration but the things you learn in Todd's studio and his guidance make the architecture major worth it.\nWorkload:\nBe prepared to pull many all-nighters on the days before studio. You also MUST put in studio time over the weekend. You get two large projects that are completed in 3 or so parts. He is pretty strict about deadlines so if he says something is due... you better have it completed.\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "July 07, 2009",
            "review_content": "\nTodd is an amazing person. Do not get discouraged if you had him for the Perceptions lecture (I know, BORING) but his studio course is his baby and he is incredibly approachable and understanding. Obviously you have to work hard (it is studio) but after having Madeline you will be so grateful for Todd. Work hard, show up on time and have fun with it.\nWorkload:\nSleepless nights before critiques and as much work as you are willing to put in. Unless you love what you are doing you should not stay it is not worth it, but if you love camaraderie and surprising yourself with artistic abilities you did not even know you had then stick with it and you will benefit greatly. Good Luck! \n"
        },
        {
            "course_name": "Perceptions of Architecture",
            "review_date": "May 10, 2009",
            "review_content": "\nI honestly don't know why this class is required for the major. Not a good or fun way to be introduced to the theory/history of architecture. Some of the topics seemed interesting but the lecture and discussion sessions make them extremely boring. To architecture minors and civil engineers: if this class is not required for you, do not take it.\nWorkload:\nreading assignments for every week, two midterm papers and one final paper\n"
        },
        {
            "course_name": "Perceptions of Architecture",
            "review_date": "April 26, 2009",
            "review_content": "\nthe lectures are ok and some of the articles are interesting, but most of them are boring and not conducive to great discussions.  they assume you know something about architecture so dont take this if its your first architecture class. lots of pretentious tools too\nWorkload:\nthere are two essays with drafts and weekly readings. the essay assignments dont seem that hard, but theyre pure bullshit\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "January 16, 2005",
            "review_content": "\nTodd's studio class is top notch; he has this strange, opaque way of speaking that often makes it difficult to understand exactly what you're supposed to do, but he really does know what he's talking about and once you figure it out the semester really does start to make sense.  He is indeed very opinionated, which means that he didn't always agree with the equally opinionated TA, but as long as you can come up will a reason for your artistic decisions he will give your work the respect it deserves.   Perhaps his most redeeming quality is his willingness to defend students work to attacks by guest critics.  He really does remember the crap you made up to defend your project and will kindly explain it to the incredulous guest critics (a particularly memorable moment of the semester was when he got into a battle with his wife, our first guest critic, over our work). Still, while I found him to take our work very seriously, class was pretty laid back.  He has a very dry sense of humor that definately made classtime more enjoyable.  Overall, a very safe bet for first year architecture.  \nWorkload:\nIntense.  Students all put different amounts of time into their projects, but the effort (or lack thereof) that you put in really does show.  There are something like four projects, but they are all due in different stages, so unless you manage your time a whole lot better than most people you can expect to pull at least 5-6 all nighters just before a deadline during the semester.  Still, we seemed to do a bit less work than Madeline's class.\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "January 11, 2005",
            "review_content": "\nOverall, I enjoyed this class and thought Todd was a good professor to have for my first studio course. At the beginning he and the Sam, the Swiss TA, will ask if you can draw or do this or that, and then they'll say, \"Oh, don't worry. We'll teach you.\" Well, no, they don't. You don't have to draw much anyway, and sketches are allowed to look crappy in the world of architecture. So don't worry, you'll be fine. One thing that bothers a lot of people is you have no idea what grade you will get in the course until the semester is over. I think Todd looks for progress in quality and ideas as the semester goes on. It's often your first time working with mylar and chipboard and such, so just get used to it. Everyone puts in tonssssss of hours and he knows that. \nAs far as critiques,  Todd and Sam, the Swiss TA, gave various ideas along the way. For the in-class project critiques, I thought Todd was very fair and defensive of students' ideas whether successful or not (he is certainly more positive than most of the guest critics.) All in all, good class. The key to this class is time management skills, which apparently, no one had. Oh, Sam is Swiss, not French.\nWorkload:\n5 Projects or so. You will do more work for this class than any other you have.  Buy some coffee, maybe some No Doze (or brand x Stay Awake pills)\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "January 10, 2005",
            "review_content": "\nTodd has been my best Columbia professor.  He has a good sense of humor and really cares about his students' work.  The projects that he assigns are designed for students who care equally as much about their work, a quality which seems to get students ahead.  He cares about both effort and talent, so if you find yourself lacking one, you can find hope in the other.  Todd gives wonderful advice during both desk crits and pin-ups, and if you want honesty (which you'll get in a euphonized version no matter what), tell him to give it to you straight.  I definitely recommend him for a first year studio course.\nWorkload:\nStudio course, so lots of work. Todd expects around an hour a night, so if you're not planning on committing so much time, work quickly.\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "January 04, 2005",
            "review_content": "\nAlthough Todd is a bit dull at times and often presents terms and architectural jargon without supplying definitions, those are grievances that can easily be dealt with. He does not spend a lot of time lecturing, so boredom in the Abstraction class only lasts for a brief time. As for not defining terms, one can always ask him about them or just look them up after class. The main problem with Todd, I would say, is his lack of respect for students and their work. Often times, he will offer advice that he will later call into question or criticize during pin-ups. Additionally, he does not allow for creativity, choosing instead to offer so much advice and \"suggestions'' to the point that you find yourself working on a drawing or model that does not reflect your ideas in any way. And that you don't quite understand how to make, either.\nTodd is good at coming up with wry, sarcastic comments regarding your work though. So, on the bright side, you won't only be buiding models of \"negative space\" until three in the morning, you'll also receive a complimentray lesson in humility.\nWorkload:\n5... 6 projects? Something like that. He gives you plenty of time to work on them, but, more likely than not, you'll leave it to the night before along with the rest of the class. \n"
        },
        {
            "course_name": "Perceptions of Architecture",
            "review_date": "January 08, 2004",
            "review_content": "\nTodd certainly puts a lot of time in preparation.  However, lectures do get a bit boring, and are condusive for sleep.  Each lecture, you walk in and take a slide list, and then the lights go off.  What happens when the room is dark?  Students naturally want to sleep, of course!  Then he starts talking about his slides.  What he has to say is certainly interesting and relevant, and perhaps even fascinating.  But he has this kind of unenthusiastic way of talking that makes you fall asleep, which is rather unfortunate.\nThe class is structured so you have lecture on Tuesday and discussion section on Thursday (or Mon/Wed), where the class is split into three sections.  They're quite boring, since many people don't feel like talking, and the discussion leaders don't seem to be particularly good at leading discussion.  You'll have to present readings a few times and lead discussions.  It's a great situation if you love to hear your own voice, but don't expect animated feedback.\nOverall, the class is well-designed and thought out, but the execution is not up to par.  Oh, and don't forget, there's a field trip, but unfortunately it doesn't live up to expectations.\nWorkload:\nA couple hours of readings a week, some presentations for dicsussion sections, three reasonable papers, one mandatory (but pointless?) Saturday field trip.\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "September 01, 2003",
            "review_content": "\nTodd is, in my opinion, easily the best first-level studio teacher. He treats your work very seriously, not skipping a beat in remembering the general goal and concept behind your project (in other words, you needn't make yourself a little blurb to parrot every time he comes to your desk). Oh, and he offers very RELEVANT criticism; he also understands the difference between a well-executed project and overly meticulous flim-flam (ahem). Plus, he will often stand up for you during pinups when guest critics who have never seen your project before give stupid advice. He is certainly opinionated, but if you know your stuff and honestly care about the material you can have a great discussion with him.\nWorkload:\nVaries: some projects involve many drawings, and some seem deceptively easy (but he is much more brutal about those).  In other words, he keeps a close enough eye on your work to spot cut corners, both in the finished object and in the conceptual development.\n"
        },
        {
            "course_name": "Perceptions of Architecture",
            "review_date": "August 30, 2003",
            "review_content": "\nhe is boring. very. the class is made up of lectures and discussion groups. the lectures are once a week in which todd would just show slides of various architectural buildings/sites/things supposedly relevant to the readings we were supposed to have read for that class. however a lot of the readings are so esoteric and stupid - how is this architecture? he sounds a little nervous and monotonous, and as a discussion group leader - he isn't very much willing to accept opinions not coinciding with his. he is a nice guy, and tries to help you out with assignments and work if you ask... but he definitely didn't spark my interest in architecture.\nWorkload:\ndecent - about 2 readings every week that should be able to discuss in groups..and 3 medium-sized papers and a mandatory field trip one saturday.\n"
        }
    ]
}