{
    "prof_info": [
        {
            "prof_name": "Charly Coleman",
            "prof_id": 12597,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 09, 2013",
            "review_content": "\nProfessor Coleman is hands down one of the best professors I have ever had at Columbia (if you are the kind of student who takes core classes seriously and wants to learn a lot from them).  I had him for both semesters of Contemporary Civilization last year, and I already knew after the first month of class that this was a professor whose section I wanted to stay in.  While last year was his first year teaching here, I never felt that he lacked experience or could not command the class effectively.  He is extremely intelligent, but is very humble and always willing to help his students.\nThe class structure is as follows: opening (10-20 min) of historical background on the book/author/philosopher and some context, then discussion, 5 minutes break, finish discussion.  Obviously, it is recommended that you do all the reading if you want to get the most out of this class.  As the semester progresses and the students in the class get to know each other better, your class experience will improve as well.  Sometimes (like other reviewers mentioned), Professor Coleman's dry jokes will come out--and they're a great relief during some drier moments of lecture.\nOne thing I really appreciated is that Professor Coleman would clear out entire days of his schedule (mostly Fridays) to meet with students and discuss their papers or any unclear concepts from our readings--literally, one Friday, I joked that I must have inconvenienced him by arranging a short meeting on Friday, but he told me that he had the whole day booked with student appointments.\nProfessor Coleman generally grades very fairly.  Your essay grades will not only reflect the clarity and development of your ideas, but also your effort and participation (i.e. going to office hours, talking about the essay with the professor, emailing him drafts).  Take advantage of the sending drafts option!  Not many professors at Columbia will allow this.  Professor Coleman's revisions and feedback on drafts can be very helpful in getting you the better grade.  Lastly, the midterm and final are very straightforward: 1 passage ID section, 2-3 short essays, and 1 long essay.\nOverall, I would really recommend taking CC with Professor Coleman!\nWorkload:\nTwo 7-8 page essays, one midterm, one final. Graded pretty fairly, but with high standards.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 22, 2013",
            "review_content": "\nProf Coleman is a wonderful professor -- I can't say enough good things about him. This was his first year at Columbia and teaching CC and I think he will only get better as he spends more time here. \nHe begins each class with a historical background of the writer/text (he's a history prof so it makes sense) and then we spend the rest of the time discussing the text. He occasionally directs the conversation if he feels we stray from the topic. While we didn't debate the merits of each philosopher's arguments or what the \"proper way to live life\" is, we spent a lot of time dissecting what each writer was saying and comparing his/her ideas to other writers we've read. I found his historical background to be very helpful in situating the texts next to each other and understanding how philosophical thought evolved over time and was affected by the circumstances of the writer's time period and country. At the end of each text he would give a conclusion to recap and lead into the next text.\nWhile the class may seem dry or boring at first, I found his classes to get more and more interesting as we all got used to each other and got to know each other. The second semester I thought was really fun. Prof Coleman also has a dry humor that I thought was hilarious even though it doesn't come out that often. He is also super nice -- I could tell that the class was important to him and he always was willing to make time to meet outside of office hours and answer questions. I had trouble with some of the texts but he never made me feel stupid for not understanding them. He can be a tough grader but I think once you get used to what he expects from papers/tests/class that it becomes easier. Also, he was always willing to look at paper drafts and give feedback which I found very helpful in terms of getting a better grade and also understanding better how to write about philosophy. He also was very receptive to feedback after the first semester and did make some changes (i.e. gave us two longer papers instead of three papers) for the better.\nThis is a class where you are really rewarded for doing the reading and participating. The only thing I would have liked to see is if he would also give an overview of each text's main idea at some point because sometimes I would come out of class/finishing a text understanding some of the writer's smaller arguments but fuzzier on the bigger picture.\nOverall -- Prof Coleman is the best Core professor I've had so far, and I'm really thankful to have been in his class.\nWorkload:\ntwo 7-page papers\n1 midterm, 1 final (not coursewide)\nplus participation\nworkload is pretty standard with CC, it's a lot of reading, but it's a lot no matter whose class you take. exams are straightforward, no tricks.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 15, 2013",
            "review_content": "\nProfessor Coleman is by the far the smartest person I have encountered at Columbia. The introductions and conclusions to all of his sections are inspiring and comprehensive, and he makes a huge effort to create connections between a wide range of works and trains of thought we examined all year. He's super nice, really cares about how you do in the course if you care, and can hit you with a joke every once in a while. If you're looking to really understand the works we read and become a better writer and thinker he is the best teacher for the job. Don't be discouraged by the at first dry-seeming tone of the class, read the books and become interested and the class will definitely shape your educational experience here. \nWorkload:\n2-3 papers around 7 pages long, 1 midterm, 1 final both really straightforward. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 10, 2013",
            "review_content": "\nColeman is amazing. Absolutely the kind of professor you want to have for Contemporary Civilizations (unless you don't care/aren't interested, in which case he is not who you want). Coleman has an incredibly high standard for writing and class discussion, and he will demand that you really get into the text. You will get a lot out of these texts and the class generally with him. He is not the most exciting professor, but he is the smartest I have had here, and I got an immense amount out of his class. If you want to go deep into CC, take his class. \nWorkload:\n 2-3 essays a semester, he's a tough grader. Midterms and finals lots of passage explication.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 21, 2013",
            "review_content": "\nWhile it may take him a bit of time to open up to the rest of the class, do not be intimated - Professor Coleman is definitely one of the nicest professors at Columbia. Completely understanding and willing to offer as much help as he can. As for the structure of class: Opens with a bit of historical content (he's in the history department), followed by an outline of questions to be covered in class that day. Leads discussion fairly well, and will guide the class if necessary. Often tries to end the discussion by linking the text to previous works. If you write down what he says you should have a fair coverage of the texts and be prepared for the exams. Very simple midterm and final (noncumulative) based on passage analyses. There are two long papers, which he grades rather difficultly but beforehand offers to look at a draft. That being said, submit a draft! His comments are extremely detailed and helpful (will definitely boost your grade). Basic CC workload, but extremely kind and intelligent Professor with a commanding knowledge of the material. \n\nWorkload:\n2 papers, 25% each. A midterm 10%, final 20%, and participation 20%. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 09, 2013",
            "review_content": "\nNote: I have only taken one semester of CC with Prof. Coleman so far, but I feel like I know enough about him at this point to write this review.\nProfessor Coleman is fantastic. He is extremely intelligent, articulate, and organized. His lectures predictably follow in this fashion: for the first twenty minutes or so, he lists off points about the historical background in which the author was situated and the personal history of the author (skipped if this is not the first class on this author), then he spends a few minutes listing off key questions to be answered over the course of the class and taking general questions from the students, and the rest of the class is spent talking about the work assigned for reading, its themes, connections to other works we've read, etc. It ends up being just the right balance of background and discussion of the actual text.\nProf. Coleman leads his class with a firm but gentle hand. He offers just enough guidance to allow us to arrive at the point he is trying to make mostly on our own. He normally has a good sense of when a digression is worthwhile and when it is time to return to the text (although he has been known to let a tangent or two go on a bit too long). He also occasionally makes brief jokes (which are actually quite funny) to lighten the mood without distracting the class too much.\nFor the papers, he usually gives you a choice of 4 well designed, fecund paper topics for each. I suggest you meet with him for all of them, because he will definitely steer you in the right direction. From what I can tell, he is a fair grader on these.\nMidterm and final have pretty much the standard CC format--explicate a few passages, their significance, themes, connections to other works, etc. Grading is fair on this as well, but beware: he docks points if you leave out key information. (So even if everything you said was correct, if you left out something important, you won't get full credit.)\nOverall, a nugget worthy professor if I ever saw one.\nWorkload:\nThree 5-page papers, a midterm, and a final.\n"
        }
    ]
}