{
    "prof_info": [
        {
            "prof_name": "Edward Steinberg",
            "prof_id": 3314,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Principles of Economics",
            "review_date": "August 10, 2012",
            "review_content": "\nHe started the class with two jokes about how boring economics is.  Maybe I have a bad sense of humor in not finding them funny, or maybe I'm right to think that the job of the instructor for an introductory course in any field is to attempt to inspire some enthusiasm for a field.  Either way, this joke might have been funny once or twice, and some of his jokes actually were, but once he ran out of original jokes (which didn't take long) and started recycling the same jokes over and over again, this class became increasingly painful to sit through.  He even joked that he took a six month course on how to make Principles of Economics interesting and learned nothing from it, but honestly, I wish he could've replaced some of his jokes with interesting content that might inspire us to take more economics courses.\nAs I read through the positive reviews, I am starting to wonder if he taught the summer session differently than how he teaches during the year.  To be fair, I am not the typical student who enrolls in this course, as I am a SEAS student who had a significant background in economics yet had to take this course due to a technicality.  \nHere's my biggest problem with the class: I've been familiar with professors slanting an entry level course towards their personal or research interests, which sometimes adds a nice touch to a course, but Professor Steinberg took this to a new extreme.  Other people might not notice this because this is their first course in economics, and therefore they might not be sure what an entry-level economics course should teach (i.e. what really are the principles of economics).  However, any student who knows this much will be very disturbed with the macroeconomics portion of the course, at the very least, and as a result the lectures will be painful to sit through.  However, you really don't have a choice, as the exams exclusively cover lecture material, much of which cannot be found in the book.  Additionally, Professor Steinberg often fails to give important concepts names (for example, during the microeconomics portion of the course, he touched upon concepts including Marginal Rate of Substitution, Technical Rate of Substitution, Edgeworth Boxes, and the Lump-Sum Principle without ever explicitly stating any of these names.  I only knew these names because of my previous economics background.) and the disadvantage of not naming the concepts that are used in class is that it makes it difficult to look them up or even refer to them later.  \nThe syllabus that he emailed out to us prior to the first class seemed perfectly reasonable to me.  However, as the course progressed, and particularly as we got into the macroeconomics half of the course, the instructor became decreasingly faithful to this syllabus, and that essentially is what caused the course to fall apart.  For example, the syllabus set aside one day (keep in mind, this was summer session, so lectures met for two hours a piece) aside to talk about \"Employment and Unemployment,\" which I though sounded reasonable.  In reality, he spent four lectures talking about these statistics, including two on the BLS unemployment survey and two on the payroll survey.  During this time, he passed out endless numbers of tables and reports to the class and explained to us why the numbers were either inaccurate or unrepresentative of what they were trying to measure.  Another example of his deviations from the syllabus was the final lecture of the course was supposed to cover \"Aggregate demand and aggregate supply.\"  In reality, he mentioned that the model existed at the beginning of class, talked about it for literally two minutes, told us there would be no exam questions on it, and proceeded to spend the lecture talking about the Federal Reserve, which he had also discussed during the previous lecture.  He added that if we planned to take future courses in economics, we should read up on the model of aggregate demand and aggregate supply.  \nThere were two major problems with his substantial deviations from the textbook: 1) it rendered the textbook essentially worthless, as looking through the chapters he assigned often provided no information about the material he covered and 2) his lectures were quite literally the only source of material.  This second point might not be such a problem if there had been problem sets or suggested problems to ensure that we had internalized the material, but neither existed.  Additionally, Steinberg doesn't make much use of the blackboard at all (nor did he use powerpoint slides), especially when he is covering material that is not in the textbook.  He'll write an occasional term or draw a graph during the microeconomics portion of the course,  but the monotonous lecture style makes it difficult to separate the pointless digressions from the ones that are going to be tested.  This was particularly true during the macroeconomics section of the course, during which a large portion of lectures consisted of him passing out handouts full of data and reading from them to us.   \nThat being said, the exams were not difficult if you could pay attention in class and avoid silly mistakes.  The midterms each consisted of 10 true/false questions (explain if false) worth 60% of the exam and 2 short answer questions (from a choice of 3 or 4) worth 40% of the exam.  The final exam consisted of 10 true/false questions worth 40% of the exam grade and 3 short answer questions (from a choice of 4) worth 60% of the exam.  They were essentially an exercise in regurgitating what he said and did during class.  The true/false questions mostly emphasized facts, details and definitions rather than understanding of concepts.  For the written problems, if the problem was a numerical one, he had done the exact same problem during class with different numbers.  If it was a written question, it was something he had stated in detail during class and wanted regurgitated without any thought.  For these questions, rather than asking for five reasons, we were asked to \"explain fully,\" which is difficult to do on a topic that he spent two hours rambling about, but still there was no thought in copying the ideas that he had stated during class (provided that you remembered them).  Again, the exams were your only chance to evaluate your understanding of the material presented in class, as there were no problem sets, suggested problems,  reading or lecture notes that were in line with what was covered and emphasized in class.  \nUltimately, my recommendation is to take this class if and only if you need it to satisfy a requirement, have no interest in economics, and are willing to go to every lecture and pay attention.  If you are genuinely interested in economics for any reason whatsoever, take this class with different instructor who will thoroughly present the principles of economics.  If you consider yourself an independent learner who doesn't learn much from lectures, or you like to employ multiple pathways to learning material, you will find this class quite frustrating.  \nPersonally, I took this class as a Columbia SEAS student, both to fulfill the requirement and to be eligible to take more advanced economics classes.  I like economics, and I believe it is a subject that everybody should take during their time at college, regardless of their major or eventual career plans.  That being said, after taking this class, I question why SEAS requires all its students to take this particular course, as it is a class that requires little thought, emphasizes memorization over problem solving, and superficially treats many topics due to the disallowance of calculus in the course.  As to this final point, I understand that eliminating calculus from the course makes it accessible to people of all disciplines and all backgrounds, but it also leads to superficial treatment of material.  (For example, one time he wrote up a formula on the board relating quantity demands, price elasticity of demand and marginal revenue, and when someone asked where the formula came from, he admitted that he pulled it out of thin air.  Then he said that it could be derived with calculus, but that we weren't responsible for that.)  If a class is going to insist on treating material superficially in order to make it accessible to all students, that is fine, but such a course should not be required of students who are capable of understanding the material when presented more rigorously.\nNote about the assigned textbook: The instructor sent out an email a week prior to the start of class telling us to buy a custom edition of Robert Hall and Mark Lieberman's economics publications containing chapters from both their microeconomics book and their macroeconomics book.  After failing to find the ISBN code on Amazon, I just purchased a used edition of \"Economics: Principles and Applications\" for less than $20, figuring that a textbook for such a fundamental class as Principles of Economics couldn't really be customized.  I later found out that the book he expected us to buy was only for sale at the Columbia bookstore for over $150, and this customized book had no index.  Therefore, I was glad I bought the book I bought instead of the one he told us to buy.  The only disadvantage was the need to do a little searching when the instructor or the syllabus referred to a page number or chapter number.\n\nWorkload:\nThe grade was evaluated as follows: 30% Midterm 1, 30% Midterm 2, 40% Final.  Exams were not cumulative.  No work was assigned outside of class, except for recommended readings from the textbook (see above for note).\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "March 04, 2009",
            "review_content": "\nI enjoyed Steinberg's economics class.  In fact, I took Principles expecting to hate econ but appreciate the information.  Steinberg's lectures were clear, informative and engaging.  Some of his jokes were funnier than others, but they all helped me remember the information and took the edge off of a late evening econ course.  \nI am now majoring in economics and have taken intermediate micro and macro.  I felt completely prepared in both courses.  I'd even say that the strong foundation Steinberg gave me in his intro course gave me a leg up over some classmates. \nThe keys to Steinberg's course are keeping up with the material and listening to what he says in lecture.  If something is important, Steinberg will emphasize it and repeat it.  I understand that some were not happy with his exams, but if you go to class, it's not hard to gauge what he will ask for.   \nWorkload:\nNot much--two problem sets and three exams (none cumulative)\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 17, 2008",
            "review_content": "\nI would avoid this class if at all possible.  Steinberg is not a terribly engaging professor, so you're inclined not to go to class.  The problem with that, however, is that his exams are based solely on the lectures.  And the exams include at least 6 11-point true/false questions that are inherently tricky.  People in this class will either do really well or really poorly (the grade distribution for As on the exams was about the same as for Cs).  I would take Prinicples with Gulati.\nWorkload:\n2 exams (25% each, non-cumulative), final (40%, non-cumulative), 2 short homework assignments (5% each)\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "February 25, 2008",
            "review_content": "\nProfessor Steinberg is a pretty funny guy. He knows his stuff and is an amusing lecturer to say the least. You definitely learn the concepts pretty well as long as you follow his lectures with the readings in the book. His exams only cover what he says in class and not the book, so it's a good idea to take notes down seeing as how he'll pull all his midterm questions from what he says. His midterms are okay if you listened attentively in class however the 6:10-7:25 timeslot might turn some people down. The class was curved at the end but not sure how. Take his class if you're looking for little to no work, however be warned, it is extremely easy to mess up on the midterms or final.      \nWorkload:\nNon-existent, 2 problem sets, 2 midterms, and a final. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 30, 2008",
            "review_content": "\n  What I found in professor steinberg was a serious economist and a pretty likable guy but a scattered and inconsistent teacher. Lectures go all over the place, with Steinberg going off on a tangent about his days at the Fed in the middle of an explanation about a key concept. However, I found his stories and dry (read: awkward and jewish) sense of humor enjoyable. \n  The tests seemed more concerned with arbitrarily picked minutia and definitions than overall economic understanding.  This means if you took good notes and memorized them you were pretty much assured a good grade, but if you missed a class, reading from the textbook or asking his TA's was pretty much useless.  This expressed itself in the oddest grade distribution I've ever seen, with pretty much equal numbers of As, Bs, and failing grareview_content  review_content sessions pointless.  Little to do with what's going on in class.\n   Overall he's no Gulatti, and you'd learn more from a few issues of the economist, but Steinberg isn't too bad of a proff. to have. \n\nWorkload:\n2 ridiculously pointless 15-min PS.  2 midterms and final.  \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 24, 2008",
            "review_content": "\nI think it's safe to say that most of Steinberg's class would have liked to be in Gulati's class instead, but it served the purpose of fulfilling the Principles requirement for econ majors relatively painlessly.  His dry sense of humor and sarcastic jokes added some personality to the course, which he admitted is probably not the most exciting class at Columbia.\nHe also used to work for the Federal Reserve, so he brings in lots of interesting articles and publications that relate to the textbook material, though this information was certainly not tested.  Plus, the exams weren't cumulative, so only a small amount of material was covered on each test.\nWorkload:\nTwo midterms and a final, two short homeworks consisting of questions taken from the textbook\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 14, 2008",
            "review_content": "\nProf. Steinberg is a very easy-going and entertaining lecturer (he has a witty/cheesy self-deprecating kind of humour). However, this is sometimes distracting as he often jumps from topic to anecdotes to lame puns and back. I would say that his lecturing style is almost like graduate-level, as he doesn't have slides and hardly writes on the board. I went to recitation just to get a more comprehensive overview of the material. He seems to focus more on theoretical than practical problems, and since he used to be (I think) a statistician or something, he's enthusiastic about ways of collecting data.  \nHe's very open to class participation, even in a class of around 200 kids, and was willing to answer questions at the end of class. \n\nWorkload:\nVery light, but exams were adequately challenging. Only 2 short problem sets worth 10%. 2 midterms and non-cumulative final. Grading is not curved, and the T/F questions can be tricky. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 13, 2008",
            "review_content": "\nUnfortunately, Professor Steinberg thought that the Pupin lecture hall was his weekly stand-up comedy stage. Avoid him at all costs.\nWorkload:\n3 true/false tests that are easy to bomb, 2 homework assignments that make up 10% of your grade\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 08, 2008",
            "review_content": "\nI personally really liked Professor Steinberg. I found him to be clear and for his lectures to be engaging, for the most part. These aren't particularly difficult topics in this class, but he explained them very well. He was clearly especially interested in the basic macroeconomics stuff that comes at the end of the course, and these were his best lectures. He's pretty funny (sort of dry, off-the-cuff jokes often), and while the class time (6:10-7:25) is brutal in my mind, he made it OK. I wouldn't hesitate to take him again. \nWorkload:\nNot bad at all. 2 midterms, a final, and two simple problem sets (directly from the book). Each midterm counted for 25%, final for 40% and problem sets for 10% (combined). Midterms were about 10-12 true/false (about 70%) and 1 problem (around 30%). Final was similar format. Overall tests not too hard, but they were a bit tricky. Definitely easier than the other Principles classes, although I have no idea if there was a curve/shift or not as it didn't affect me. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 08, 2008",
            "review_content": "\nThis guy really knows his stuff coming from his background working for the Fed and all, but makes the information basically approachable. A little difficult, but a pretty fair teacher. On the first midterm, the class did worse than he expected and therefore the next midterm (there were 2) he added 5 points to all of our grades. He can be a little bland and boring and his same continual jokes don't get any funnier throughout the semester, but overall a very fair class. It's a good idea to get a good TA and go to all the sessions.\nWorkload:\n2 problemsets that will not take you long at all. Never read the textbook except when studying for the two midterms and one final (all NOT cumulative). Because you don't have much work and don't need to read the textbook, you will have a lot of studying to do before the exams.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 27, 2007",
            "review_content": "\nSteinberg is funny.  For the first few days at least.  Then...it gets kind of old.  He reuses the same jokes/phrases far too often.  He covers the material capably enough, its just that students often have trouble staying awake, which is partly due to the time of day (6:10-7:30), and partly due to his teaching style.  I would not recommend skipping his lectures, as his tests are based almost entirely on lecture material, which neither covers the same material nor puts emphasis on the same points as the textbook does.  Also, he sometimes does not show up to lecture (two or three times during our semester), so his TAs cover for him.  \nSo, basically, take Gulati's class if you can, and, if not, well, I guess it could be worse...\nWorkload:\nWhat workload?  Two assignments at 5% each, two midterms at 25% each, and a final at 40%.  Tests are based mostly on the lecture, not the book reading.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "October 21, 2007",
            "review_content": "\nSteinberg thinks he's a standup comedian.  The only reason he teaches the class is because he has an audience.  We have started to tally how many times he says:\n\"Is that acceptable?\" \"Can we agree...\"\n\"Why the hostile looks?\"\nAnd also how many times he pulls up his pants.  They never seem to fit.  He also talks about his wife all the time or goes on really bad tangents about jokes that have no economic relevance whatsoever.  \nHe kinda looks like the penguin from Batman.  He's going to pull out an umbrella one day.  We're just waiting for it.  \nIn truth though, he teaches the material - but not well.  Homework is EXTERMELY light and he seems to mean well and actually care about how his kids are doing.\nWorkload:\nTwo homework assignments, two midterms, one final.  Tests are not cummulative.\n"
        }
    ]
}