{
    "prof_info": [
        {
            "prof_name": "Trevor Corson",
            "prof_id": 13105,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "August 24, 2016",
            "review_content": "\nPrepare yourself. Trevor's class will be hard. As in, when you compare your UW assignments to your friend's, you will realize that yours require more work and writing. He's a tough teacher and will push your writing very far. The workload is tough and time consuming and not really in line with a 3 credits course load. Trevor's class will feel like 4 credits. That being said, I love Trevor. His class is my favorite taken thus far at Columbia. He's an amazing teacher and is incredibly invested in improving every single person's writing. Class discussions are really good (be sure to participate!), and the small size of the class will make you feel close to everyone in no time at all. Trevor is a strong proponent of peer review and one-on-one sessions (two are required). You work in depth with your classmates and learn so much. Thankfully, everyone is pretty interested in the focus of gender and sexuality. The readings are great, but do require multiple rereads. I would note that Trevor's class is a little different from other specialized sections in that he prioritizes writing and improving everyone's writing ability over learning about gender and sexuality. However, I wouldn't have it any other way. I'm such a more confident writer now because of this class. In short, his class is pretty difficult and will require lots of work, but your writing will be elevated to such a great extent! For transparency's sake, I received a B+. My friends who had previously taken UW said my essays would have been more of an A- level in their classes, but that's okay with me. If you end up with Trevor, keep him! He's funny and endearing and a little awkward and will terrify everyone the first day with the textbook length syllabus and policy about coming to class late, but it was such a rewarding experience. He also does this great thing where he will edit your progressions via video, so you can understand \"his experience as a reader\". His feedback is invaluable; if you try to follow most of his advice you'll do just fine. \nWorkload:\nTypical UW workload and then some (P1, P2, P3, P4). Your P4 doesn't have to be about gender/sexuality. Two mandatory one-on-one sessions with Trevor. Multiple exercises per each progression that are lengthy but make you think critically about your writing style and skills.\n"
        },
        {
            "course_name": "UWriting - Gender",
            "review_date": "April 15, 2015",
            "review_content": "\n\"I'm a mean professor.\"\nTrevor Corson\nHe describes himself accurately and he's arrogant. Take Glenn Gordon instead; Glenn will give you an A.\nWorkload:\nSame as all the other UWriting classes.\n"
        }
    ]
}