{
    "prof_info": [
        {
            "prof_name": "Carolyn Ristau",
            "prof_id": 2240,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 22, 2005",
            "review_content": "\nshes a brilliant lady that has no idea how to teach. she wants everyone to do well but she's just so freaking smart she has no idea that this class is HARD.  she shouldnt be teaching an intro level class- shes a seminar.\nWorkload:\nannoying textbook, impossible tests.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 01, 2005",
            "review_content": "\ndo not take this class.  if you don't absolutely have to, don't take it with this woman.  seriously, her lectures are erratic, her exams incoherent, and her stubbornness obsurdly rude.  in my opinion she has no interest in compassion or being reasonable with grading because she finds us all too privelaged for that.  she's one of those \"even if you ALL agree on the answer to a question and got it wrong, you're still wrong and i know it because i know i'm right\" teachers.  this happened on about 1/3 of the poorly written questions on her exams.\nWorkload:\n2 midterms and a final, textbook readings, also readings of extremely difficult primary sources, half of them her own incoherent publishings\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 31, 2004",
            "review_content": "\nThis is the classic case of a successful researcher who can't teach.  Despite the fact that Professor Ristau is well-meaning, I have never encountered such a headache of a class in my three years at Barnard.  There was a 25 point discrepancy between my first two test grades although I studied exactly the same for both exams.  I couldn't believe the material she felt was fair game for the test; you cannot just hastily scribble a formula on the board and neither explain it nor use it in a practical application and expect students to correctly use it on a test.  I have never encountered such ambigiously phrased test questions or confusing test format; on the final, we must have corrected at least six different wrongly phrased test questions (not to mention having to erase two sections of questions because she numbered the test wrong, grrr).  Also, she made us copy all these articles from books that are no longer in print and placed scant copies on reserve.  It's a shame I dreaded this class all semester because some of the material was quite interesting.\nWorkload:\nTwo midterms and a final.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 29, 2004",
            "review_content": "\n     She was the worst professor I have ever encountered. I've taken courses with professors that people have complained about, but she is by far the worst of the worst. She makes the material more confusing than it should be, and is more interested in showing us pictures of apes and birds than actually teaching us any material. She is disorganized and very annoyinig to have to listen to. I feel like I can teach the course better than she did. Good luck trying to figure out the correct answers on the exams... you probably have a better shot at a better grade guessing than actually giving a proper response. \nWorkload:\nAssigned readings from books, and articles she wrote (some stuff are on reserve - ie. ONE article available for the whole class...); 3 exams\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 27, 2004",
            "review_content": "\nTERRIBLE!!! No one even went to class. I missed class for a week because I had the flu I asked about three people about class NONE of them had gone! The tests were horrific except for the final. She was even confused by the questions on the exams. I wouldn't recommend anyone to take this class with her. The material was very interesting but she ruined my experience. \nWorkload:\n2 exams and a final\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 24, 2004",
            "review_content": "\nTo be honest, I didn't find the course material to be particularly hard. In fact, it was one of my least challenging psych courses. But (and this is a big but), Prof. Ristau really has no clue how to deal with student complaints and grading or even how to teach the material comprehensibly. Most of the time she ends up confusing the students way more than the material itself can ever do. I basically just disregard everything she says and read through the text on my own. And her slides on courseworks are only about half of the slides she goes over in lecture (and even those are only partial slides with a bunch of ??? where certain key words are suppose to be) cuz she wants students to come to class rather than just print out slides from lecture. What ends up happening is students who actually realize she's showing the \"missing slides\" are just frantically copying down the stuff (a lot of which are graphs) cuz she flips through them so fast. I mean, if she has to resort to these little tricks to get students to show up to class, she should really reconsider her own teaching ability. Her exams are formated differently from one to the next, so how you should study for each varies. I thought the first exam was extremely easy (way over-studied for it). The second exam was harder but not too bad material-wise, but her questions were really poorly phrased and caused a lot of rightful uproar in the class. And then she makes this big to-do about going so out of her way to make things easier for us and really putting herself out there to accomodate our needs, where in reality she barely did what was expected of professors teaching a course. I mean, if she would have given her own questions a second thought (or even a second glance) she would catch the errors and ambiguities herself instead of having students bring it up to her after the exam and her having to change everyone's grades due to her own mistakes. The third exam was so much longer than the first two and included some stuff from the previous exams yet itz weighed the same. There were a lot of last minute additional readings not on the syllabus, which made it really confusing what to study for on the third exam.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 20, 2004",
            "review_content": "\nI did think that this class was quite difficult, as well, but I would like to just mention that Professor Ristau was really kind, and I found that she was quite considerate of her students. Towards the beginning of the semester she was more difficult and rigid, but I think it says a lot for her that she did hear what we had to say (which is a lot more than I can say for some profs), and she changed in response to her students' feedback\nWorkload:\nfine, book reading and articles on reserve in library\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 19, 2004",
            "review_content": "\nI thoroughly  agree with the other review of Carolyn Ristau. I found that I couldn't even bring myself to call her a professor because she didn't do anything during this class that resembled university level teaching.  I do not doubt her intelligence, but I strongly doubt her ability to coherently share her \"smarts\" with a class of undergraduates, who have no previous experience with the (sometimes) difficult course material.  Her scatterbrained demeanor in the classroom was frustrating and clear evidence that she is far better prepared to study chimps in the jungles of Nigeria(her former occupation) than to interact with real live human students in her psych class.  Frankly, a professor who thinks that spending 45 minutes of class handing out papers is effective time management,  is a joke. She also tried to make the lecture class a discussion section, which TOTALLY didn't work out, especially since she would have needed to teach us the material before asking questions.  \nWorkload:\nManageable because, whether you do all of the reading or not , her test questions still won't be coherent!\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 13, 2004",
            "review_content": "\nI cannot agree more with the previous reviewer. Professor Ristau is the single most worst teacher I have ever had in three and half years at this college. She is absolutely horrible. She cannot keep facts straight and will teach material incorrectly and then announce that if it appears on the test and you mix it up she will not take away points....well, that is just wrong in general because she should get the material right, but you will find out that that is a big fat lie. She will take points away from you and be very happy to do so. Her tests are incoherrent, make no sense and cannot even be understood by other Psych professors. She will take points away from students after marking their answers correct and then deciding it was not a right answer, gets annoyed at students for using their intellect and arguing with her that her answers are not right from tests. As I am sitting here, attempting to study for her final, I am realizing that she does not even know the material, but seems to lift it straight from the book, almost word for word, and obviously does not even possess the intellectual capacity to come up with her own examples. She treats her students like infants and has a tendency to make you feel like you are in seventh grade again. She discovered that students did not do the reading for the class right after an exam and then proceeded to test us in class and pick out individuals to see if they had done the reading. As a senior Psych major I was forced into taking this class this semester. If she ever teaches this class again, DO NOT take it! You should suffer through Balsalm rather than subject yourself to the insanity of this teacher.\nWorkload:\nDoesnt seem bad at first but as she realizes that students are not doing the reading she will add more and more each class to the syllabus. She will announce pop quizes the night before class covering reading she assigns at the same time.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 12, 2004",
            "review_content": "\nI completely agree with the review above. I went to a public high school in a not-so-great neighborhood and even there  never encountered such an instructor. Not only does she clearly have no idea what she's talking about (as several times the slides she posted were wrong and needed to be redone) but in my opinion she is irrational, and completely unwilling to compromise. Her exams are ridiculous as oftentimes the answer would contradict what the text said or her own notes. For example, she gave us an equation in class (not in the book) and tested us on it having forgotten to mention to the class that a proportion needs to be used in the equation. She often forgets THE MOST IMPORTANT part of an experiment or any given theory. Also, the last test was clearly not measure for time: the entire class ended up staying a half an hour later and her instructions were insanely unclear (she didn't even show up to class on the exam date). When I met with her she hurried me out after five minutes (after having me wait for ten) saying she needed to meet with another student. Going to class is an utter waste to time since her lectures and notes don't make any sene. Also, we wasted entire classes arguing with her about how she marked correct answers incorrect to no avail. She's awful. Avoid Ristau at all costs.\nWorkload:\ntwo midterms (incoherent and she marks things the book had said were right as incorrect), quizzes announced on courseworks the night before, and a final. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "November 30, 2004",
            "review_content": "\nI came to this university in order to avoid classes with professors like this.  Just about everyone who was not required to take this course dropped it and those who didn't deeply regret it.  I have never met a professor so clueless, so overwhelmed, and so out of her league as this one.  The lectures are unstructured and confusing.  During one lecture Professor Ristau actually became so confused that she announced to a flabbergasted classroom that she was glad she didn't have to learn this material because she found it very confusing.  The tests are even worse!  Not only are the questions often not from the material covered by the course (there is therefore no way to study), but the answers are also often wrong, causing much class time to be wasted as the entire class argues their grade.  While she might be a perfectly nice person Professor Ristau has no pity for the students and is unable to help them although she will be more than willing to meet with you.  As unreal as this review may sound it is the truth so do yourself a big favor and DO NOT take this, or any course, with Professor Ristau.\nWorkload:\nThe workload gets progressively larger as the semester goes on due to constant last minute additions to the syllabus.  Emails announcing quizzes and homework assignments will often be posted on Courseworks the night before class.  \n"
        }
    ]
}