{
    "prof_info": [
        {
            "prof_name": "Xin Yan",
            "prof_id": 1164,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "January 23, 2014",
            "review_content": "\nXIN WAN IS THE BEST THING TO HAPPEN TO COLUMBIA. every time I went to calc II he was there with a bright confused smile to help me through this course. without his adorable optimism and happy face, I would have hated calculus. BTW HE SENDS ADORABLE APOLOGETIC EMAILS ABOUT CULPA REVIEWS. ok it says this review isn't long enough and ihave to go so                                                                                                                                                                                                                                                                  fjkLE/JKLT4OP5490595 FDWOT LOGN TDOES TS TEXT HAVE TO BE JEEZEE OUSSSIIEEEE\nWorkload:\n1 problem set a week. 2 mid terms. 1 final. so reasonable\n"
        },
        {
            "course_name": "Stat W1111 Recitation",
            "review_date": "May 15, 2004",
            "review_content": "\nXin is a great TA: extremely nice, easy to understand, and lenient with extensions or any problems you may have. \nWorkload:\nSee Intro to Statistics 1111\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "March 25, 2003",
            "review_content": "\nI don't agree with the first evaluation. Xin helped me once at Butler and was nice to me when I came to her office hour. \nBesides, I don't think her appearence was that bad. She has Chinese accent though.\nWorkload:\nsame as all W1111 sections. One project, 2 test and one final.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "June 11, 2002",
            "review_content": "\nAn easy course overall! The material is comprehensive and does not require much work. No tough Math involved. But Xin is not at all willing to help you out outside class. Extremely irresponsible and lazy plus broken English. She intentionally dresses up for every class meeting, but be prepared to see awkward and out-of-date appearance with an obvious sense of self-appreciation. \nWorkload:\nWeekly Pset. Two midterms and final.\n"
        }
    ]
}