{
    "prof_info": [
        {
            "prof_name": "Eleanor Boeschenstein",
            "prof_id": 9561,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "August 19, 2011",
            "review_content": "\nShe did the best she could with a class of people who, for whatever reasons, could barely compose a coherent sentence without whining. Nell was more than fair, she was NICE--far more than I would have been under the circumstances--and not only extended deadlines, but basically spoon fed the material to the class. \nI'm sure it's no one's dream to teach UW, but she managed to make an otherwise tedious and asinine waste of time and tuition money into something that was, at the very least, a bearable burden.\n\nWorkload:\nThe usual UW crap: essays not worth the paper they're printed on responding to hyperbolic and overwrought BS with the occasional diamond in the dust.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 30, 2011",
            "review_content": "\nWe're talking about UW here so the pedagogical pros and cons of its graduate student instructors are mostly for anecdotal purposes, you know? Most of us simply end up with whom we end up. That said . . . \nNell, as she is known, was wonderful. If you have a chance to take a course with her, do it. I want you not only to take any criticisms of her written on this page with large grains of salt, but to be highly suspect of any authors of such criticisms. And if you ARE one of said authors? I hate to break it to you but you're probably just a terrible writer; this is not Nell's fault. Her honest feedback is what your tuition is paying for.\nI found Nell to be not only useful to my writing in a general feedback and critique kind of way, but also incredibly insightful into the finer details of what it was that I was trying to accomplish in my papers. As a result, I was able get out of said papers what I ultimately wanted. Not bad for silly old UW.\nOh, and she's totally nice, completely casual; not bad when you're a grad student having to deal with the kind of sloppy, embarrassing dreck that was being passed off (poorly, I might add) as writing by some of my classmates. Her job is one that I don't envy, but her abilities are such that I do.\nThanks again Nell!\nWorkload:\nStandard UW. In class exercises, paper progressions, etc.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 11, 2011",
            "review_content": "\n\"nor silver-shedding tears could penetrate her uncompassionate sire\" sums this MFA grad student up nicely\n\"writing can be painful and endless\" writes \"professor\" Nell in a class email on March 14th, 2011; taking this required course with this \"write by the numbers professor\" will surely make you feel that way. She is not clear in any of her assignments, gives everyone quizzical looks and says \"so what?\" and is the most disinterested writing instructor I've ever had. Be sure to check out her blog though- the fable about her pitbull is awe-inspiring publication... gag\nWorkload:\nwhatever she assigns is ambiguous; might as well write about pound dogs as your \"lens\"...\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 06, 2010",
            "review_content": "\nNell is a lovely professor. She is really sweet, and approaches the class with good humour and a fairly relaxed attitude. It is a fairly standard UW class, but she does pick good readings and choose stimulating pieces of journalism to facilitate discussion. She is always open to what the class has to say about texts and manages peer marking well.  If you want help from her, she is definitely available and will work her schedule around you.  She makes this class as painless as possible, and is a fair marker.  In conclusion, this is quite a good class for UW, and if you can take it with Nell, you should.\nWorkload:\nAverage UW\n"
        }
    ]
}