{
    "prof_info": [
        {
            "prof_name": "Pietro Ortoleva",
            "prof_id": 12991,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 02, 2017",
            "review_content": "\nTook micro with him -- best econ class ever taken at Columbia. This wonderful professor truly cares about his students getting the intuition behind the concepts that he is teaching. I completely agree with the previous review -- he deserves a golden nugget. \nWorkload:\neasy \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 01, 2017",
            "review_content": "\nProfessor Ortoleva is a fantastic professor, and I highly recommend him if he’s available to take for microeconomics. He’s such a great lecturer and he’ll break down a topic until he’s sure that everyone understands it. The first three homeworks were fairly straightforward, but the last two were a little harder. Though, I thank him for assigning them as they prepare you very well for the final. He’s also a super nice guy and very understanding, so I highly recommend going to his office hours if you need extra help. His TAs were also really great. Very highly recommended!!\nWorkload:\n5 Homeworks (20%), 1 Midterm (30%), 1 Final (50%)\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 24, 2016",
            "review_content": "\nIntermediate Micreconomics with Pietro\nPros:\n-- Super sweet, kind guy - very funny, and very understanding towards personal circumstances\n-- Entertaining lecturer -- pretty good/straight forward slides (that are all posted online)\n-- Exams are relatively straight forward\n-- Problem sets are very doable, nothing crazy \n--Distribution is amazing... approx. 80% of the class gets some sort of A or B..\nCons:\n-- Can't think of many.. \n-- Doesn't give out too many psets (not enough practice for the exams?!) - but this is accounted for in the curve, so it's ok\nOverall: Highly recommend. Put in the work, you'll do well. \nWorkload:\n1 Midterm\n1 Final\n5 psets \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "October 12, 2016",
            "review_content": "\nOrtoleva is the best professor ever. He is incredibly cute, sweet, funny, friendly, accessible and makes the material so much easier!!!!I used to hate economics classes but thanks to him and his terrific method of teaching this, rather mundane course, I started to actually enjoy my major. He gives super cute examples about his grandma, pizza making and chalk manufacturers, his Italian quirks are hard to resist and overall he is a great person and an engaging lecturer. He deserves a gold nugget. \nWorkload:\nEasy homeworks!  \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "November 13, 2014",
            "review_content": "\nI took microeconomics with Ortoleva second semester last year, and overall it was an enjoyable experience. It was his first semester teaching, but he was a good lecturer and fairly engaging. His jokes were corny, but a nice touch to lecture. Most of his material is based off powerpoints, which he goes over in class. These powerpoints are all posted onto courseworks, which makes studying for the class very straightforward.\nI found the class to be straightforward, as you knew exactly what was expected out of you. The first midterm was hard, but it was probably because he was new to teaching. The second midterm and final were straightforward and easy.\nI recommend the class to those who are looking for a good grade and a relatively easy workload.\nWorkload:\nRelatively easy compared to Elmes.\n"
        }
    ]
}