{
    "prof_info": [
        {
            "prof_name": "Louise Rose",
            "prof_id": 748,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style",
            "review_date": "October 08, 2006",
            "review_content": "\nI liked Louise as a person but not as an instructor. She seemed to feel that the whole class revolved around her and her oldschool New Yorker persona. Her written comments were illegible so instead of bothering to write more clearly, she just asked anyone who needed to know what she had written about their writing to stay after class so she could translate. If you had somewhere you needed to be, too bad. She didn't seem to like any writing with even a little experimentation in it and would complain if we wrote about things she couldn't relate to. I'm not sure what she expects considering she's probably forty years older than most of us. She had more to say in conferences but the workshops were just unhelpful. Basically you're paying to mostly get feedback from other people who are there to learn, not from the person who is supposedly there to teach.\n"
        },
        {
            "course_name": "Structure and Style",
            "review_date": "December 18, 2003",
            "review_content": "\nI really enjoyed Louise Rose' class, especially compared to some of the other horror stories you hear about some of the S&S; profs. Both her class and Leslie Woodard's are usually the first to fill up, which shows you just how popular of an instructor she is. Prof. Rose is great with criticism - she always knows what works and what doesn't, even if you can't really articulate, and she has a good sense of humor. The workload wasn't really difficult and it's rarely tedious. Some people in the class felt that she pushed her own preferences towards writing at the expense of more experimental work, which is probably a valid criticism given that she focused heavily on realism and didn't have as much to stay about more unusual pieces. Also, it's nearly impossible to get an A in Structure and Style, and she keeps up that departmental policy. Other than that, I found Prof. Rose to be a great teacher for S&S; and I highly recommend her class, which turned out to be my favorite of the semester.\nWorkload:\nA few poems, short stories, and a one-act play, along with some short stories to read and a few creative exercises like character sketches and stream-of-consciousness compositions. S&S; doesn't require a lot of work, and maybe about half of what you write gets workshopped. However, you're basically guaranteed to *not* get an A, and getting an A- is difficult, though I don't think worrying about the grade is the right perspective to take with regard to a creative writing class.\n"
        },
        {
            "course_name": "Structure & Style",
            "review_date": "May 03, 2003",
            "review_content": "\nMy initial excitement about the class was completely quashed by Prof. Rose - she generally offered shallow praise, and was quite harsh on pieces that left the \"normal\" undergrad subject matter in any way.  She said I had no \"personal philosophy\" coming through in my work, then inquired about my age, decided I was too young to have a personal philosophy, and then graded me down for not having a personal philosophy in my final story.  Although she was very nice during everything.  And she has a good sense of humor.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "March 19, 2002",
            "review_content": "\nProfessor Rose is phenomenal. She has re-fueled my desire to become a writer. She encourages tough critique of pieces, but isn't reluctant to give praise where it's due. There is more reading involved in this class than in my previous Structure and Style course, but the reading is ALWAYS amazing and really helps your own writing. Professor Rose is very big on personal experience informing your writing. This slant on writing has been incredibly beneficial to my work and really improved my voicing and style. Definitely get to her office hours if you can. My one-on-one time with Professor Rose has been priceless. She's really easy to open up to about everything and anything (and i mean ANYTHING). Don't worry about censorship of your work...it doesn't exist here. Rose doesn't care what you write about, as long as it's written well. Being an entry-level course, the class is a mixed bag of really talented writers and not-so talented writers. This can be frustrating at times, but your own writing will improve exponentially nonetheless so who cares?!?! TAKE SOMETHING WITH LOUISE ROSE!!!\nWorkload:\nThere's something to do for every class period. There are two writing \"exercises\" in the beginning of the semester which were actually two of my favourite assignments. Readings for most classes are light and enjoyable. Being Structure and Style: 1 narrative poem, 1 short story, 1 one act play. What I like about Professor Rose is that she allows you to continuously rewrite your pieces and fine-tune them throughout the semester. A final draft of each is due at the very end of the semester. As a rule every single thing you write is workshopped. If, however, certain things are too personal etc...you can opt to pass on workshopping something.\n"
        },
        {
            "course_name": "Structure and Style",
            "review_date": "November 11, 2001",
            "review_content": "\nProf. Rose is an ideal writing teacher. She is honest and critical, but not harsh, and extremely encouraging. She asks a million questions and really makes you think about what you're saying. Big on honesty and personal experience. She kept our two-hour class going quickly and it always ended before I was ready. S&S; brings in writers of all levels, and the serious and talented are often frustrated and only receive substantial feedback from the professor herself. She will tell you if she thinks you're not putting enough effort in, and her no nonsense attitude is important for making the format of the class work. She's also funny and has plenty of reading recommendations for her students. I cannot recommend her enough.\nWorkload:\nShort writing assignment each week, she hopes we work on it for at least 15 minutes/day. No exams.\n"
        }
    ]
}