{
    "prof_info": [
        {
            "prof_name": "Kevin Griffin",
            "prof_id": 2179,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Introduction to Sustainable Development Seminar",
            "review_date": "May 12, 2011",
            "review_content": "\nThis is class is a relatively unsubstantial introduction for the Sustainable Development major/concentration, and as a 1-point course, this is to be expected. I've heard some students complain that it was a waste of time, or that they didn't really learn anything, which is kind of true. BUT, in all fairness, the class does exactly what it's supposed to do: introduce you to the major and everything it entails. And that it does a very good job.\nProfessor Griffin is great-extremely nice, approachable, and very willing to meet with you in office hours if you have any questions. The Earth Institute is also available if you need more guidance. Generally speaking, the class meets 50 minutes per week and consists of a series of quick I-Clicker questions [surveying the class opinions, not testing on information] followed by a speaker who is brought in to talk about the topic of the day [internships, study abroad, jobs in profit/non-profits after graduation, Peace Corps, professors of other req classes for the major, etc]. It is very low-key and at the end, a few people usually volunteer to ask questions or discuss their views if they want. Homework is minimal. The class is run through an online blog and homework consists of weekly assignments that take 5 minutes...usually writing a paragraph on your opinions or making 2 comments on other people's opinions. I believe it's graded on completion but most people put in decent effort. The last homework is an open-ended group 2 minute video where each person talks for 20 seconds. Obviously this class is in no way stressful or strenuous. \nThat being said, if you're interested in Sus Dev, go ahead and take it. Even if you're not, you might learn something and it's a slight/easy GPA booster. However, also don't let this define your understanding of Sus Dev the major because this class is more about the logistics than the actual content. \nWorkload:\nI-Clicker attendance [30%], Completion of blog assignments [70%?]. No midterm/test. No final. 5-20 minutes a week usually.\n"
        },
        {
            "course_name": "EESC 2300 Earth Systems: Life, and ENV 2200 Environmental Biology II",
            "review_date": "November 03, 2010",
            "review_content": "\nThe second semester of Enviro Bio was so so so different from the first, they should hardly be considered part of the same sequence. I, too, enjoyed this semester more, but mostly because the I preferred the material and the laid-back character of the professors. \nMatt Palmer is awesome (too bad he's married now, though!) and he does a really great job breaking material down so that students can understand both the details and the big picture. He very intelligent, and therefore can move through material very quickly, but slows down for in-class questions.\nPaul Olsen is very old. I found his lectures incredibly random and disorganized. I would often look up from 15 minutes of gchatting to see a massive purple and pink \"dinosaur recreation\" on the screen, listened for a few minutes to see if what he was talking about was at all related to the image, discovered it wasn't and then returned to my online dalliances. This said, I understand that Olsen knows his stuff about dinos and rocks, but the technology (ie PowerPoint and iClickers) really seemed to get the better of him.\nKevin Griffin is also a very smart dude. He tends to do more \"big picture\" stuff and assumes that his students can get the details elsewhere. His research is pretty interesting and his kids are really cute (they make it into about every other lecture). \nShaena is the shit. Again, super smart but also cool and very helpful in lab because most of the assignments appeared to be designed for precocious 6th-graders (read: making phylogenies of LEGOS and counting beans for genetics). She made coming in for 3 hours to do the silly \"labs\" okay, because she tolerated extensive Tim and Eric Awesome Show breaks.\nOverall, this is a good class, and if you have the discipline to stay offline in class, you can learn a lot. Hopefully the organization of the whole thing will get better, and the labs will get more college-level. \nWorkload:\nFairly light. Some textbook and article reading, which is super redundant if you took Enviro Bio I. Just skim the stuff before the midterms.\n3-hour weekly \"labs\" in which you get a head start on the \"Lab reports\" and then forget about them until the night before they are due.\n3 field trips, of questionable educational value.\n3 midterms (one after each section). Fairly easy, but study with others because the answers will come from notes, so try to fill in the gaps with classmates.\n"
        },
        {
            "course_name": "EESC 2300 Earth Systems: Life, and ENV 2200 Environmental Biology II",
            "review_date": "May 15, 2010",
            "review_content": "\nI enjoyed this second half of environmental biology far more than the first half.  I guess I just don't really like the grueling rote memorization of DNA replication processes and of central body systems.  This class was actually quite fun, though, and I liked all three professors we had.  \nThe first section (photosynthesis and respiration) was the most difficult, both in terms of exams and labs, but nothing was particularly difficult.  I have never met anyone so excited about photosynthesis and respiration as Kevin Griffin, and it makes lectures much more enjoyable.  He teaches the first section of Life Systems/Environmental Biology II in great detail and relies heavily on the Raven et al textbook.  Read the textbook!  \nThe second section was a paleontological look at life systems on Earth.  This includes a brief (two lecture) history of the universe, a similar history of the earth, and looks at dinosaurs, etc. It's fun, and some of it fits in nicely with the Climate Systems course, and it would be helpful to have taken Solid Earth Systems before this or at the same time (I haven't yet taken it).  Of the three professors, Olsen had the least clear lectures, though most of the time I could follow along.  His discussion of the greater carbon cycle (including through rocks, etc.) I couldn't at all follow, but it didn't show up much on the exam.  Olsen did not follow the textbook much, so pay attention to and study the lectures, and you'll do fine. \nThe third and final section (evolution) was taught by the much loved Matt Palmer.  Seriously, this guy is great.  He's young, engaging, hilarious, and generally a really fun professor.  This section is the easiest, and the labs are easy and short.  You've learned a lot of it before if you took the first half of environmental biology.  \nLabs were generally terribly written.  There were field trips at the end of each section (though it had to be cancelled for Palmer's section), with longer lab reports due for these, requiring some outside research through the literature.  Normally, however, the lab reports just required you to fill out the answer sheet instead of writing a full lab.  \nWorkload:\nWeekly lab (usually with an answer sheet), 3 (we only had 2) full lab reports.  Three midterms, one for each section.  No cumulative final.  \n"
        },
        {
            "course_name": "Life Systems, Plant Ecophysiology",
            "review_date": "January 04, 2005",
            "review_content": "\nGriffin won the mentoring award at Lamont, with good reason.  He is one of the best professors I have ever had because he is knowledgeable, humble, patient, and enthusiastic.  His powerpoint lectures are clear and easy to follow, he is always happy to answer questions, and he is just in love with the material (which makes a huge difference of course).  I wasn't very interested in plants before, but now I think that photosynthesis is one of the most incredible processes in the world!  Griffin is a TERRIFIC professor and he always makes the material interesting, if not fascinating.  \nWorkload:\nLife Systems - weekly labs were graded by the TA.  Take-home essay exam.\nPlant Ecophysiology - weekly abstracts, light reading, research project.\n"
        },
        {
            "course_name": "EESC 2300 Earth Systems: Life, and ENV 2200 Environmental Biology II",
            "review_date": "October 16, 2004",
            "review_content": "\nProf. Griffin is another nice professional, and like the other professors, brings to the class his dedication and enthusiasm for the subject.  He is also around the world working on his tree projects, and he includes some of his work in his presentations when he covers the biology of life systems.  The labs are also interesting.  If you have done Environmental Bio I, you should have little problem with this, but if you are new to environmental biology, you need to learn quite a bit about microscopic systems such as photosynthesis, energy cycles, and have a general idea about elements that cycle in the environment, such as carbon.  Between the good text (by Raven et al.) and the hand-outs, you have everything you need to learn, and he will tell you what you need to learn, since there is a lot of detail to these systems.\nWorkload:\nThe labs can be completed in class, although most people seemed to finish their reports at home.  There is reading and studying of these basic systems, but really a pleasant winding down of the class, after the intensive hours at the beginning running around the various scientific institutions of the city.  Perhaps harder for those new to the subject, so you should make sure you know what you should be taking from the class and be prepared to know for exams.\n"
        }
    ]
}