{
    "prof_info": [
        {
            "prof_name": "Maria Sonevytsky",
            "prof_id": 3320,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "July 21, 2010",
            "review_content": "\nIt is clear that Maria is new at teaching.  As I expected, she assumed everyone had a more advanced knowledge of music than they did.  There were a few students that played music, and had a musical background, and it was clear she catered toward them.  I suspect the previous poster was one of them.  If you aren't a fan of classical music, you will not enjoy her class.\nThe class had three unrelated sections.  The book, her assigned readings, and her lectures.  She wouldn't reinforce the material in the book, and because there was only one example for each term, you could easily be confused.  This is like someone telling you there is this genre called Rock and Roll.  Then they only let you listen to Billy Joel and say he is rock and roll.  Now you think ALL of rock and roll sounds like Bill Joel, which it clearly does not.\nShe gave us a quiz, which everyone asked her what to study, or what to expect, and she said not to worry.  Surprise surprise, we should have worried.  Most people did poorly.  She often says one things and writes another, and does not explain the formats of tests well.  Suddenly you have 100 terms to study over the weekend.  \nMaria was very inflexible with meeting students.  I was eager to make time with her between the quiz and midterm, but she wasn't available between the two, leaving no ability to improve, though I will admit she was good about email.\nMaria takes off points on the exams with no explanations.  She can take half of the points off an essay with only one small comment.  \nThe papers have nothing to do with music, which is nice because she doesn't teach it well, but again she takes off points for nothing.  \nTowards the end of the course, she played youtube videos sometimes half of the class time.  \nWorkload:\nThis course had 2 papers, a midterm, a final, and a quiz.\nThe first paper and midterm were 15% each, the second paper and the final were 20% each, and the class participation, listening journal, and quiz added to 30%\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 09, 2007",
            "review_content": "\ni don't usually write culpa reviews, but i need to share this with you:\nmaria was the best grad student instructor i've ever had. \nshe was better than any professor i have ever had at columbia. i had her as a TA a previous semester and as an instructor this semester. i never thought i'd get so lucky! i am a junior at columbia and i have never loved a class so much as this one. i didn't even think it was possible. \nmaria puts so much effort into this course. it is obvious she really wants us to learn and enjoy it! she was so kind and so helpful with anything you ever needed or asked her. she is always accessible, always emails you back in a timely fashion. we would start every class with a piece of music she picked out and we would jot down notes/\nanswer a question she asked about the piece and its relation to our discussion. she took the time to find a song, that we would all enjoy, maybe even recognize, and compared it to what we were studying! she would always try and find videos at the library for us, to make it more visual than just aural.\n she's just so great. it's hard to imagine a grad student, someone so young, and with so much already on their plate to be able to teach a course so well and so constructively. i learned so much in this class that i will take with me forever. i see music in a totally different light now, and it's a great perspective! maria wasn't just a great teacher, she CHANGED MY LIFE. \nWorkload:\nthis class was worth every second studying. i just took my final today and i'm just so sad this class is over... we have a concert/musicking report (3-5 pages) and a final paper, a couple hw assignments, a fair amount of reading but they were always pretty fun (but i'm serious.. they were really interesting) and a midterm and final. they were straightforward and fine if you studied hard. \n"
        }
    ]
}