{
    "prof_info": [
        {
            "prof_name": "Dmitry Zakharov",
            "prof_id": 5498,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "January 26, 2010",
            "review_content": "\nHe knows what he's teaching and what to expect from students of that level.\nRotated his shirts and khaki pants in three-week term. You can count, that's another fun taking a class from him.\nA genius, very nice and kind, open to questions. I'm majoring in math after taking the class from him. \nHomework: all in the big textbook.\nExams: fairly easy and also difficult. \nEasy because questions that appear on exams are mostly from the textbook with slight changes in numbers. If you do your homework (not relying on websites and etc), you will know how to solve them. \nDifficult: He likes experimenting with one very tricky question which is labeled as 'extra credit' question at every exam. If you do score it, you'll get A+ (or guaranteed A). \nCompared to other Cal1 classes, I'd say it's medium to heavy load. But he is quite generous in terms of grading (on my transcript it says almost 50% of the class got As-including + & -). You won't have any problem taking Cal 2-3-4 if you take 1 from him. Solid foundation.\nWorkload:\nWeekly problem sets, lowest score dropped\nTwo midterms (first one was easier to me)\nFinal, not easy\n\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "March 07, 2009",
            "review_content": "\nPhenomenal.  Many of my classmates and I were surprised to learn that it was his first semester as an instructor because of the quality of his lectures.  \nFrom Russia but his accent does not impede\nVery careful with what he chooses to say so he does not confuse\nVery rarely made errors \nGENIUS and does ridiculous calculations in his head\nA bit goofy\nThe best math professor I have ever had...ever\nSome of the homework can be challenging but the math lab is good for that and if you can do the homework you should have no problem with the exams\nIt was NOT open book and Homework only counted for around 20%.  Some of the other sections had open book exams and homework counted for 40% in one of the sections.  I had to work for this class but it was easy to do so because he was a thorough and clear instructor.  I highly recommend him.  Especially if you are taking the course to learn something.  It is great prep for physics, advanced level math courses, etc.  If you want an easy A, perhaps you should try someone else.\nWorkload:\nWeekly Homework assignments...he dropped the lowest one so that we could skip one week.  I recommend doing the work.  I usually did my homework at the math help lab because he did put some tricky problems but that way I was able to ask any questions I needed to while I was working.  The homework follows the lectures and is very similar to what you can expect on the exams.  The homework is good practice for the exams...I didn't really need to study for them once I had done the homework.  He gives a practice exam before each exam and holds a recitation section to review it.  If there were problems there that I didn't remember how to solve, I simply reviewed those concepts and did really well on the exams.  \n"
        }
    ]
}