{
    "prof_info": [
        {
            "prof_name": "Matthew McKelway",
            "prof_id": 3330,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Arts of Japan",
            "review_date": "November 21, 2016",
            "review_content": "\nI took Professor McKelway's course on the arts of Japan and would say that it was a bit of a mixed bag. First off, he is a really smart guy and knows a ton about Japanese art. Whenever he lectured it seemed like the information just rolled off the top of his head in a way which conveyed that he had a clear grasp of the subject matter. One of the things I appreciated about his style was that instead of making us memorize huge amounts of objects, though memorization was still a big part of the class, he tried to take time with each object and allow people to make comments, effectively running the course like a large Art Humanities class instead of an introductory lecture. This was interesting to me because I had not taken Art Hum at the time and so I was able to really learn a lot about how art is discussed at Columbia and in academia in general. \nDownside to this though is that we did not make it to the Edo Period in Japanese art. In fact we barely made it through the Momoyama period. This is a huge concern, because we didn't even touch the last 400 years of Japanese art in a course which is supposed to be an overview of art from the country. This disorganization also showed up in courseworks where the readings were not listed in a way which made it easy to tell which reading was for which week and at the end of the semester I carefully went through the readings he posted and compared them with the syllabus and am totally certain that some readings were never uploaded. This points to his lack of consideration for students, e-mails often went unanswered and classes or museum visits were cancelled. Also, and this was a first for me, we didn't do all of the assignments on the syllabus. He had listed three papers and we only did 2. He can be helpful in office hours but I found that often the conversation would turn to personal chat too quickly or he would give me way too much information on a question I asked and I wouldn't be able to ask all the questions I had. \nSummation, he isn't awful by any stretch. You will learn a lot about Japanese Art and how to look at and talk about art in general. As long as disorganization and going off syllabus doesn't bother you it will be worthwhile. All the grading was done my the T.A.'s so I can't say how harsh a grader he is.\nWorkload:\n3 Papers\nMidterm\nFinal\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 16, 2010",
            "review_content": "\nI have to say, I enjoyed his constant self referential anecdotes and occasional politicised comments. Generally entertaining, and at the very least a distraction from the utter inanity of this class.  To be fair, I think most of the shortcomings of the class were more down to the concept and format of Art Hum than any real fault of his.  As a lecturer he's perfectly adequate and straightforward - not particularly engaging or sparkling, but knows his stuff and gets the job done. \nOrganization wise I would guess he has improved immensely - the lecture notes were generally up promptly, and the class was extremely well organized and integrated with Courseworks in general. Really well supported by the Art History department's Art Hum multimedia/further information site.  We did however get fairly behind with the syllabus, and ended up spending almost no time on the very last section - a throwaway hour (at very most) on Frank Lloyd Wright.  Not that you can miss classes though - any more than two will immediately drop you a whole grade.  Class participation is graded too. He doesn't seem to expect much of students, and the most basic of descriptive responses (ie \"what is in this picture? a woman with a child on her lap. great!) will probably get you pretty far.\nOtherwise, decent enough grader, though a stickler for proper grammar and, oddly enough, formally addressed emails.  To sum up, Art Hum with McKelway is pretty much a formality - not excruciating, but not particularly enjoyable either.  Not a semester ruining choice but if you're looking for that mythical illuminating Core experience, or even one that isn't utterly forgettable a few weeks later, look elsewhere.\nWorkload:\nStandard for art hum.  Tedious group projects that are easy if irritating, and  a couple of very short (1-2pg) papers. Midterm and final - you are expected to know the artist, medium, date and title of every work (including comparison examples from other artists), briefly identify some terms and make educated guesses (or wild stabs) at some unknowns.  Fine once you know what he's looking for (ie memorize a lot, don't bother with context or similar - none of the answers require any depth).  Biweekly readings from (online) reader that are neither necessary or interesting.\n"
        },
        {
            "course_name": "Arts of Japan",
            "review_date": "December 19, 2008",
            "review_content": "\nMatthew McKelway is a pretty good professor. He clearly knows his material very well, which sometimes devolves into a barrage of information during class. I advise you to bring a laptop to class and try to note down everything you can get because come exam time, you will need those notes because looking up Japanese art, even through Google, is a big pain. He's a decent lecturer, sometimes ends up rambling but you can just tune out. He also asks questions in class, but nothing too difficult. He will take roll call until he knows your names -- and he will remember if you're not there, or late. He can be a bit of a jerk for example, he'll be snarky if you pronounce a Japanese word wrong even though his accent isn't that hot either (I have Japanese-speaking parents). \nA previous review of McKelway said he's not very organized, especially on Courseworks. I think he's improved remarkably as the Courseworks postings were explicitly clear and well-ordered. He posted up every lecture slideshow before class and emailed us about it. He also compiled these \"study guides\" for each topic we covered, listing the works of art (with date, artist, medium etc) we should be familiar with, events and definitions.These guides sometimes left out information, and were composed a little strangely, but you could still follow them. However, the powerpoints themselves were a little lacking. I needed to study with the slideshows, but the lack of captions on most of the slides was aggravating, and needlessly so.  \nMy biggest gripe is the exam style. First, McKelway insists you know all the works of art, their dates, mediums, artist if any and location. That is an excessive amount of memorization even if the final isn't cumulative, and it's only made harder by the fact that not everyone is familiar with romanized Japanese. He then proceeds to test about 2% of the material you learned for the exam, often throwing in pieces of artwork NOT covered in class in the exam. When I say that, I mean there was a section for unknowns, and he put in unknown works in sections that were meant to be identifiable from class. \nOverall, despite the length of this review, I'd say take this class. It's not an easy A, but you'll definitely learn a lot (even though we didn't finish the syllabus) and it's some pretty cool art to boot. McKelway as a lecturer is good as long as you can put up with some of his quirks. He's approachable, will meet during office hours, teaches clearly...what more do you need? As long as you can face the prospect of always overstudying for exams that barely skim the material taught and don't give you a good chance of showing you're knowledge, you'll be fine. \nWorkload:\n3 written assignment (2 pages, 4 pages, 6 pages respectively), midterm, final, museum visit\n"
        },
        {
            "course_name": "Introduction to Japanese Painting",
            "review_date": "December 16, 2007",
            "review_content": "\nProfessor McKelway was a massive disappointment.  While he has a clear command of his subject, he is utterly incapable of structuring a lecture, let alone an entire course.  At times I wondered whether he had ever taught at all.  In addition, his mannerisms and utter self-involvement made the lectures a fairly painful experience.  He could not go more than a sentence or two without stopping to make an inane reference to how a particular work might have intersected with his personal life at some point.  He is far more interested in hearing his own voice than he is in introducing his students to Japanese Painting.  \nOne of my biggest complaints about McKelway is his lack of organization.  For whatever reason he had great difficult in learning how to use CourseWorks, and ended up posting lectures and notes in the oddest fashions, further disjointing the course.  This made studying for the midterm and final extremely difficult, especially given that he refused to offer a slidelist.  He honestly expects you to be familiar with all the images he shows you in class, which is a tall order, especially given that he often fails to include complete information, if any, when he presents an image during lecture.\nDo not take a course with this professor unless you are extremely patient.  \nWorkload:\nThree papers, midterm, final exam, museum visit\n"
        }
    ]
}