{
    "prof_info": [
        {
            "prof_name": "Kristen Gore",
            "prof_id": 12194,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 31, 2013",
            "review_content": "\nTotally chill and super nice instructor. Really patient with questions if you want concepts clarified. Kristen clearly cares about the course as she dedicates a lot of time outside of class to answering questions in extra help sessions and over emails. \nMidterm and final were super easy- they were basically questions we had seen in some form in class or in homework.\nThe homework grading was also ridiculously lenient. I have no idea how she grades her homework because there were a couple of times when I went over the graded homework and realized I got full credit for questions that were done completely wrong.\nBasically, if you're not getting an A range grade with the combination of Kristen being super available to answer any questions you have, her TAs' ridiculously lenient grading, and random bonus points at every turn, you're doing something wrong.\nWorkload:\n1 problem set a week, which got more tedious as the semester went on in terms of amount of time you need to spend on them. 10 problem sets in total. 40% of your grade. They are never that bad at all, and very leniently graded.\nMidterm (30%) and Final (30%): super easy, no curve balls.\nShe also gives you bonus points on the final if you've missed 2 classes or less all semester, and also an extra problem set at the end of the semester to replace the score off 1 problem set if you screwed up.\nAlso, she showers you with extra practice problems before exams, with problem types that appear on exams.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 24, 2013",
            "review_content": "\nProfessor Gore was a great instructor.  Her teaching style is very easy to understand, and she did an excellent job of injecting examples for every concept into her lectures - a great way to reinforce the new material as we went along.  She was much more concerned with conceptual understanding than mathematical computations, which showed in her generous grading system for homework.  Professor Gore also made herself available for extra help sessions before both the midterm and the final, and provided practice problems for both of these tests.\nWorkload:\nStraightforward, moderate workload: Weekly homework assignments (eleven in total, drop the lowest one) for 40% of the course grade.  One midterm and one final, each of which comprises 30% of the course grade.\n"
        }
    ]
}