{
    "prof_info": [
        {
            "prof_name": "Sheela Kolluri",
            "prof_id": 10529,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Stats with Calculus",
            "review_date": "January 19, 2017",
            "review_content": "\nIgnore the negative reviews below. If you just care about an easy grade and not learning, this class is perfect. Anyone complaining is lazy and doesn't know how to work for themselves. \nPros-\n1. Only meet once a week\n2. No homework\n3. No research paper (which other stats sections have)\n4. No programming needed\n5. Ridiculously easy quizzes every class meeting (lots of time to complete, 1 question, collaboration is allowed)\n6. 3 exams (including final) and none of them are cumulative. they are extremely straight forward. you are allowed a cheat sheet, and 2 cheat sheets on the final which is not cumulative. \n7. 3 exams means less material on each exam than compared to just a midterm and final\n8. very generous class curve\nCons-\n1. kolluri not very email responsive\n2. she reads straight from her slides (not really a big deal because the slides are fantastic)\n3. boring, but you can literally do whatever you want in class \nOverall: Highly recommend if you just want the easy grade. Relative to the other stats sections, this class is MINIMALLY stressful. \nWorkload:\n3 exams - all are non-cumulative\nweekly attendance quizzes which are jokes, 10% of grade\n"
        },
        {
            "course_name": "Calculus Based Introduction to Probability and Statistics",
            "review_date": "January 18, 2017",
            "review_content": "\nThis woman was easily the worst teacher I have ever had, and I spent two years in community college before attending Columbia. She will come in to the class each day, read directly off of slides (which are copied word for word from the text book) for 75 minutes, do no examples, give maybe 5-10 questions to study, and leave. I approached her with questions several times, and did not receive satisfactory answers. There was one day that she was not present for, so the TA taught that class, and he was a far better lecturer than her. The class actually applauded him at the end.\nThe icing on the cake is the fact that each day there is a \"pop quiz\" that covers the material being taught in class. That means that you have to have read and understood the relevant chapter in the book so that you can then come to class, have it read to you again word for word, and then be quizzed on it.\nIf not for the fact that I had to drop the course to preserve my GPA (taking a bunch of other math classes and have never gotten less than a B+ btw) I would have filed a formal complaint with the school.\nShe should not be teaching. Her contribution to the class is worth nothing. I highly recommend that you avoid this class.\nWorkload:\n10%- \"Pop Quizzes\"\n30%- Midterm\n30%- 2nd Midterm\n30%- Final (Non-Cumulative)\n"
        },
        {
            "course_name": "Intro to Stats with Calculus",
            "review_date": "October 16, 2016",
            "review_content": "\nDespite some negative reviews, this course really wasn't bad at all. All the material for the exams is covered in class and readily available on her slides. It's true she doesn't try tremendously hard to make it exciting but it's intro stats after all and nearly everyone is taking it as a prereq for some other department, so this is to be expected. If you go to class, actually do the optional problem sets, make a comprehensive cheat sheet for each exam, and have a decent math ability, you'll do great. I'm not a math genius but I still pulled out an A+ mostly by copying the whole book onto a double-sided piece of paper for the exams. Probably the least workload of all my classes this semester.\nWorkload:\n2 midterms, 1 final. All exams are each 30% and noncumulative. weekly optional problem sets (you should definitely do all of them since most exam questions are derived from problem sets), most annoying part was quiz in every class for attendance but was very easy and everyone just cheated by looking at their notes/googling, quizzes are 10% of grade\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 22, 2014",
            "review_content": "\nThe worst prof I have ever taken, this woman should be fired. I've never met a professor who cared less about her class, was less approachable, or was less engaging. To the reviewer below me, I'm not going to argue that her class isn't doable. It is, especially since you get a cheat sheet and the exams aren't cumulative. It's just such a HORRIBLE, HORRIBLE, experience:\n- Doesn't hold office hours, like ever. She says she isn't on campus except to teach so she only has OH for the ten minutes before and after class.\n- Doesn't give homework or problem sets so virtually no practice. Before each exam she gave us a number of questions in the book, but wouldn't provide us with the answers to these practice problems (only half of the answers were in the back of the book)\n- Most monotone voice ever. Basically reads from her slides without inflection. \n- She took attendance by having us take a 'pop quiz' every class. If you are complete shit at teaching, either learn to teach better or at least let people skip your class in peace. Talk about 75 minutes of hell twice a week. I'm guessing in previous sections no one showed up to her class so she instituted that. What bullshit.\n- You basically teach yourself everything... and stats is not a fun subject to teach yourself. I know plenty of people who took AP Stats in high school so fine you don't have to deal with this, but for people who have literally never learned stats before and have to do it (probably for econ requirement) it's pretty difficult. And then you have to go on to take econometrics and if you don't have solid stats foundation (and who could, if all you have is Kolluri's shitty teaching to go off of?) you're doubly screwed.\n- Grad level TA was totally useless. She was really nice... but she couldn't do some of the questions on the exams because she said \"she only knew how to do those problems in programs\" which is pretty unhelpful for a class where you have to know how to do things by hand. Undergrad TAs even more useless -- they didn't hold office hours, only came to proctor exams. Not sure how TAs are distributed among the stats dept.\n- Questions on the exams would be phrased in a way that they could be interpreted in multiple ways and Kolluri told me that \"part of learning a subject is understanding which way to interpret the question\" ... which might make sense in your head but really makes no sense practically. \n- She's totally lazy. Refused to give homework cause she didn't want to grade it. I had to push her to provide extra practice problems. And she refused to provide answers, and specifically asked the TA NOT to provide answers. Don't get that one.\n- I could literally go on forever about all the fucked up things she's said and done as a professor... but I'll spare myself the torture of spending any more time thinking about her existence.\nI hear the entire Stats department sucks, so maybe this one's the one to take. Maybe not. I personally would avoid at all costs. \nWorkload:\n3 exams, non cumulative, 30% each\n10% quizzes\nVery stressful class, in my opinion. The exams are totally doable (and for the record, I got an A-, so it's not like I did horribly and am really bitter about it). I'm really just bitter because she was such a shitty, shitty professor, probably at least 10 times worse than any other professor I've taken at Columbia, and she ruined a subject that I thought I could really get into (the first class we watched this video, the Joy of Statistics, and I actually really enjoyed it, then Kolluri squashed any hope of joy in her class). Also doable or not doable, it sucks to scramble before every exam because you realize despite being forced to show up to class twice a week you have learned absolutely nothing and are completely unprepared for every exam (like starting from zero).\nAdvice: go to class, take the dumb quiz, plug in your earphones and read the book during the class so you don't fall behind, or switch off with a friend to skip class and take the quiz for each other. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 15, 2014",
            "review_content": "\nKolluri's section is completely doable. Don't be fooled by the bumbling cries of the people who appeared to have staggered their way through the asphyxiating smog of their own inability to figure out how to take a stats class. You are taking a statistics course - it's different than your typical math course because there are a ton of equations but only a few relatively simple concepts needed to use them. Kolluri's section is the one to take, and this is why:\n1. There are 3 equally-weighted tests and no final.\n2. None of the 3 tests are cumulative. This might be one of the biggest reasons to take this section, as chapters 1-13 in the stat textbook comprise a lot of material if you take a look.\n3. Kolluri gives you a good amount of practice problems before each test, and some of them just show up on the test, verbatim. The point is to do more than she assigns - this is not hard to do, since most problems are structurally very similar and not that hard.\n4. The tests are short. You have the full class period of over an hour but many people finish in under an hour.\n5. This section is not a can of worms. I have heard other sections can be. If you read the book, do the practice problems, you'll realize there is only ever 5-10 different types of problems that can be asked per test, so know how to solve the kinds of problems and you won't end up moping about how this professor is unfair. Because she's probably the most reasonable.\n6. There is not a big emphasis on using Calculus.\n7. You get to use calculators on tests. This means this class is not big on proofs. The emphasis is on word problems, which involve number crunching.\n8. You get a sheet of notes to bring in to each test.\nTake this class. Kolluri teaches it well and it is as straightforward as it gets if you set aside the time to study.\n\nWorkload:\nNo homework. Simple quizzes each class that make sure you were listening during that class, so make sure you always print out the notes because she often just asks you to write down something from some part of the lecture. Quizzes are 10%. 3 equally-weighted straightforward tests, 30% each. No final. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 09, 2014",
            "review_content": "\nI have to say that out of all the professors I have ever had, Prof. Kolluri was definitely the least dedicated to teaching by far. It was absolutely clear throughout the entire semester that she did not care about the students at all and was putting very minimal effort into teaching. Her lectures were directly lifted from the book. And when I say directly...I mean WORD FOR WORD...not even paraphrased or anything. Her lectures were actually like an audiobook of the textbook. And it always amazed me that she had so many typos/errors in her lectures. She teaches this class every single semester (sometimes she didn't even change the date on the title page of the lecture so we would get something like Feb. 24 2012 or something like that)! The fact that she doesn't even go back to modify very clear typos/errors that she surely must have noticed when giving the lecture in previous semesters is really indicative about her lack of care for the class. Some professors really are just interested in their research and teaching is merely a requirement that they have to trudge through, and Prof. Kolluri is definitely one of these professors. She also has an incredibly boring lecture style. She is not an incredibly expressive person so it was very painful for me to force myself to pay attention instead of surf on my computer or play on my phone (which I did anyways). She also had a semi-annoying habit of saying \"right?\" after her explanations in order to hammer in her point. But I digress...\nOH another incredibly annoying thing was the in-class quizzes. What the heck. There was a quiz every single class, which was incredibly frustrating. Most of the quizzes were really easy so basically they were like attendance points. But professor, if you are going to require attendance, shouldn't you make your class worth attending? Why require attendance if you are just going to read the book aloud to us? (as I said previously...WORD FOR WORD).\nHaving said all this, I found the class to be fairly easy/straightforward. There are absolutely no surprises on her exams, and sometimes she even used problems that were almost exactly the same as ones from the practice problems. I ended up with an A+ without studying too much (but I am a math/science person). I only read through the lectures and did all the practice problems she assigned in the textbook (and I did no extra problems). However, I will also say that Statistics is not an easy subject for everyone. In fact, I believe a lot students really, really struggled with it and probably got very low grades. So your grade will probably largely reflect your natural aptitude for math/quantitative subjects. \nWorkload:\nLight-Medium. The HW problems are not required, but you should probably do them anyways. Some of the problem sets take awhile, but they are not too bad. The exams were medium difficulty, in my opinion. But the exam averages were something like 60%, so clearly they were harder to others. There were no surprises, really, but a few questions  were challenging. I think I probably had around a 93-95% overall average and I received an A+, so there was clearly at least a little bit of curve. I have no real sense for how large it was though. I am guessing that if that was enough for an A+, though, that you could have probably gotten 85%ish for an A.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 09, 2014",
            "review_content": "\nA class and a professor have never wasted my time as blatantly as STAT1211 with Sheela Kolluri. \nHer lectures are not lectures. They are storytimes during which Sheela gets to show off her comprehensive reading skills by literally reading 60+ slides VERBATIM at us. Oh and did I mention most of her slides (also posted on courseworks) are copied pasted DIRECTLY from the textbook? So basically you're paying some $150 per class PLUS wasting an hour an twenty minutes of your time twice a week to have the textbook read for you. I found this absolutely unacceptable. So why not just skip lecture and read the textbook yourself right? WRONG. Each class Sheela gave us \"quizzes\" (they hardly qualify as quizzes.. she would write a question or two on the board at the end of each class and we basically had to scramble through the slides to see which slide she wanted us to copy down.. whispering with neighbors was absolutely fine.. even if it wasn't we all did it anyway, she couldnt be bothered to care). These \"quizzes\" count for 10% of your grade.. basically Sheela's way of making sure she isn't reading to an empty lecture hall each class. \nThe rest of the grade came from 3 noncumulative exams, each worth 30%, each covering anywhere from 3-5 chapters of the textbook. You're allowed a cheat sheet, 8x11 piece of paper front and back for each exam.. If I hadn't put nearly EVERYTHING from the textbook onto that cheatsheet I probably would have failed each exam. Basically studying for the exams for me consisted of making that cheat sheet starting like 2-3 days in advanced of the exam. Exams had some fill in the blank, some multiple choice, and some short answer. If your cheat sheet was good it shouldn't have been too much of an issue. That being said since I was basically just regurgitating information, I have very literally understanding of the underlying concepts and retained very little knowledge of statistics.. \nThere is no homework but for each chapter Sheela, out of the goodness of her heart, gave us \"recommended problems to do\" out of the textbook. Some of these problems, you guessed it, were copied and pasted directly onto exams (yeah did you really expect her to come up with her OWN problems? Heavens no that would involve effort). \nI stopped paying attention after exam 1 (I literally brought my laptop to class and watched TV shows..) and I ended up with a B+ in the class. \nYeah the stat department and Sheela Kolluri should probably work on getting their sheeeit together.. \nTerrible, terrible class.. If this is a major requirement for you like it was for me, I'm very sorry, you'll get through it! If you enjoy having your time wasted or if you're looking for a cozy lecture hall in the basement of Mathematics to watch Breaking Bad in, by all means take this class! Otherwise please run far and fast!   \nWorkload:\nNo homework. Quizzes every class that like barely qualify as quizzes--10%. 3 noncumulative exams--30% each. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 02, 2014",
            "review_content": "\nI don't think I could have taken a more boring, useless class. Professor Kolluri does not teach anything, literally nothing. She reads off of the slides and thats it. We did absolutely no examples in class...not one example.\nShe teaches absolutely nothing and so her exams are difficult because you have absolutely no idea what to study and her questions basically assume that you magically learned everything yourself.\nWorst professor. Worst class..oh and worst curve. She curved it so a c+/b-\nWorkload:\nno homework...so you are assumed to keep up on your own. no work basically\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "October 09, 2013",
            "review_content": "\nIf you have no background in statistics whatsoever, even with a solid grasp of calculus, this class is difficult. If you have taken AP statistics in high school, it is much easier.\nIf you have to take this class, and fall into the first category, be prepared to more or less teach yourself statistics; as mentioned in other reviews, the professor largely regurgitates information off of power point slides, which are more or less carbon-copies of the material in the textbook.\nIf you are looking for rigorous proofs of specific properties of random variables, probability distributions and cumulative distribution functions, WolframAlpha, Khan Academy, and a Google search is your winning combination. \nMy section of the class had only one TA, who was somewhat difficult to communicate with. It appeared as though the TA was performing said role for more than one section or course in the statistics department - overburdening as such led to less-than-thorough explanations of material and a general feeling of imposition when clarification was asked for. I'm unsure if there is a deficit of human resources in the statistics department, but it seemed to be the case. \n\nWorkload:\nLight, but difficult. Three equally weighted, non-cumulative exams (30% each). One deceptively easy \"quiz\" during each lecture, summed for a total grade of 10%. Homework is suggested, but not graded.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 23, 2013",
            "review_content": "\nI don't think Prof Kolluri is that bad.  Sure she's boring, but Stats is a rather dry subject so it's kind of expected.  On one hand, she just regurgitates her slides in lecture, but on the other hand, her slides are actually quite good and pretty much cover everything she expects you to know for exams.  The exams test your knowledge of the concepts; no trick questions or anything like that.  Do the homework problems and reading and you should be fine.  Boring or not, Sheela is a fair instructor and grader.  I was about top 25% in the class and got an A- so it seems the class is curved to about a B average.\nAlso, I was in Calc II when I took this class, and there are certain areas of the course that require taking partial derivatives and double integrals (things taught in Calc III/IV).  I picked up the techniques pretty quickly, but the more comfortable you are with Calc, the better.  People who stopped taking math classes after Calc 1 may struggle.\nWorkload:\nLight.  about 1 chapter of reading per week, a project, and maybe 6-8 homework assignments which are 5% of the grade (but helpful to do). \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 09, 2012",
            "review_content": "\nThis class is extremely boring. Actually, no. This class is downright painful. The material, the lectures-- everything is so dull, it's difficult to be motivated. However, you're not going to be the only one who has no interest in the class. Most people in STATW1211 are fulfilling a requirement, and so the suffering is collective.\nThat being said, Kolluri is really sweet and approachable. She seems to realize that most students are uninterested in the material, and makes the class as convenient as possible. Workload is minimal, and her exams are really straightforward. Towards the end of the class, the material gets more complicated, but Kolluri's exams stay simple. As long as you understand the concepts, read the book, and have done reasonably well on the homeworks, you can easily get above the median. The lectures are a waste of time, but I went sometimes when I felt like I had neglected the class too much.\nI've tested out a few other STATW1211 classes. Trust me, if you have to take it, take it with Kolluri.\n\nWorkload:\nAverage-Light.\n6 Homework Assigments, won't take you more than a few hours. (10%)\nGroup Project, straightforward and easy. (15%)\n2 midterms, final. (25% each)\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "April 28, 2012",
            "review_content": "\nProfessor Kolluri is a sort of a disgrace for a scholar lecturer. I have never met an instructor like her before; she really couldn't care less about how one performs in the class, or one's level of understanding of the material, or any question or concern that one might have about the course or the assignments. It simply seems that she performs this job because she must. Never even once showing a sign of interest in anything. She explicitly informed the class in the first meeting to not email her, as she simply does not check her email, ever! She reads off PowerPoint slides adding an occasional \"similarly\" or \"conversely\" to â€˜spice-upâ€™ the atmosphere in the classroom. I had to hold myself from not falling asleep during her tedious monotone reading of the slides in each and every class meeting. Honestly, I could have saved the $4176 that this course cost me and just not take it at all; or, as professor Kolluri loves to say, \"conversely\", I could have just taken a self-taught course, and would have probably achieved a much better understanding of the material. I developed absolutely zilch from this course, besides an awful taste of bitterness and contempt for her, and an extreme repulsion from statistics as a whole. Her lack of information-oriented personality and approach is a great measure of her sheer failure in trying to convey anything. When asked a question, when one taunts to challenge her boredom from the so-called â€˜teachingâ€™, she gives the vilest and most belittling look possible, then turns to the board and scribbles something impossible to decrypt, and in most cases, she never really answers the question, but rather goes around it and smoothly continues to read off her slides. When approached with questions about exam grading she always takes several long moments to answer each question, as if she encounters with it for the first time, and when finally coming-up with an answer it is always with a patronizing demeanor that makes one feel exceedingly unwise. \nIt requires a prodigious unique lack of fortune to have matched a TA that is such a daunting meticulous replica of the awful style and approach that the instructor herself so greatly demonstrates. His utter ambiguity with the material is beyond eloquent; he simply has no clue to what is going on. When asked a question, he usually tries to mumble a word or two and then just says that he needs to check because he, admittedly, simply doesnâ€™t know the answer to almost any of the questions posed.\nWorkload:\nOn the bright side, the assignments were really the only way to survive this course. Obviously, the professorâ€™s lack of interest, to say the least, continued with the exams as well. About sixty-five per cent of the exam was taken from the textbookâ€™s assignment questions, which was the only way to PASS, not succeed, in this course. The rest of the exam is simply for those who are better in learning a complex and arduous subject as statistics (with calculus applications!) from a book by themselves. Nevertheless, the true color of the professor is not to be pleasant, informative, or graceful in anyway and therefore the graded homework are never corrected nor properly checked. A despondent narrative to this befalling is when a homework question was asked in an exam, but was never corrected nor even discovered by the grader when checking the graded assignments, resulting in the recurring of the same mistake on my behalf in the exam itself where points were gladly deducted claiming that it is my responsibility to discover these mistakes. Really?! How is that even possible when there isn't a single soul that can help?\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "March 24, 2012",
            "review_content": "\nKolluri is so boring and unhelpful. She reads her powerpoint slides word for word and does not explain the material. STRUGGLE to get through the textbook. Think twice before taking this class. Statistics is fairly straightforward but I don't know how you would get through this class without having taken a previous stats class or with a friend who has... or a tutor. \nTests are straightforward. \nDo not bother going to lecture. I went to lecture expecting different results: 'Oh maybe she will teach something today or contribute some insight'... WRONG\nIt was like being hungry in the middle of the night and checking the fridge after you have already looked and seen that nothing was in there.... disappointing and a waste of time. \n\nWorkload:\nProblem Sets can be really long and time-consuming. She also zoooooooms through the book. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 14, 2010",
            "review_content": "\nSheela in a word: boring. Her powerpoints are really complete and structured and are posted on courseworks. That's all you need; she just reads them in class, punctuating the monotonous flow of endless formulae with the occasional \"right?\" Unfortunately, this is not enough and at times classes will be like hell if you try to understand the material. Though the class starts with some very easy material, high-school level for most internationals, it becomes increasingly complex. Sheela never gives real-life examples, so it's extremely dry. Actually, the course would be much more useful if we learned to use statistics software rather than see pages of code on a powerpoint.\nDespite that, she is quite nice and will probably try to help you if you see her after class... Many people didn't bother to show up in class, as attendance was at times painful. \nWorkload:\nThe upside: Sheela's tests (two quizzes, lowest grade dropped, and final) are surprisingly easy and she's a fair grader. There are five problem sets which can be quite time-consuming. There is also a group project. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "October 30, 2010",
            "review_content": "\nAn extremely nice woman, she was always willing to take the time after class to explain what she had just gone over. She has a good grasp of the subject matter but still knew how to simplify things for a beginner. Her classes can be on the boring side as she tends to read from the slides--however if you don't understand what she went over asking her helps as she will be willing to stop and explain in another manner on the board. Tests were fairly straightforward and shouldn't be an issue if you read the lectures and know how to match up formulas to different situations.  \nWorkload:\nHomework once a week. Tests were straightforward. \n"
        }
    ]
}