{
    "prof_info": [
        {
            "prof_name": "David Walker",
            "prof_id": 2566,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Alternative Energy Resources",
            "review_date": "December 25, 2009",
            "review_content": "\nWhat an annoying class. Seriously. \nI had to take this class for my EEE requirement, but it shouldn't be mandatory. I can't imagine anyone who would take this class for fun. The material is interesting and relevant but the lecturers are not very enthusiastic and there's really no reason to go to class. I found the material in the book (which you do not need for the course) more interesting. \nThere is no reason to go to this class, or take it at all unless you are REALLY interested in alternative energy and willing to listen to dry presentations. \nThe midterm and final are stupid. They give you around 5 problems that are completely ambiguous- the ones you think are easy end up being hard, and the ones you thought were hard were able to be solved easily. \nProfessor Walker is generally very unhelpful and I also found him to be rude. A big NO THANKS to ever taking one of his classes ever again. \nGenerally a very frustrating class. There are SIPA people who also take the class as well (I guess its both a 2000 level class and a 4000 level class)... which is all fine and dandy unless you end up with the one who was in my class who couldn't really shut up. I would advise against taking it, and if you have to take it for EEE... well then good luck to you... it's gonna be one unpredictable semester. \nWorkload:\nThere is homework- which is ungraded and will not help you with the midterm or the final. \nMidterm and Final- a bunch of bs, literally. You don't need to go to class, you just need to be really resourceful with wikipedia and hope you are guessing right. \n"
        },
        {
            "course_name": "W4076 Geologic Mapping",
            "review_date": "May 27, 2005",
            "review_content": "\nDave Walker was by far one of the best professors I've met at Columbia. He had the whole class up to his house in the catskills for two weeks. The class was really quite difficult if you don't have an excellent structural geologic background, but he still makes you learn alot. He was really chill about letting everyone sleep at his house, even cooked for us some nights. He sure loves geology and it shows, even if sometimes he seems to be asking too much of you, you'll have a hard time not liking him. \nWorkload:\nIncredibly Heavy, but only after the semester is done. 4 weekend excursions that kill a weekend day in april (8-7 usually) and then 2 weeks at his house working in the field 8-5 and then 7-10 on your maps. Not an easy class, but if you take it you'll learn alot. \n"
        }
    ]
}