{
    "prof_info": [
        {
            "prof_name": "Aladar Kogler",
            "prof_id": 1156,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Fencing",
            "review_date": "January 23, 2008",
            "review_content": "\nAladar is the man.  Seriously.  Okay, the dude has a Masters' in fencing (I didn't even know those EXISTED before this past term) and a double doctorate in sports psychology and something else...and he's teaching fencing.  To a bunch of klutzes like me.  At Columbia.  Of course he's amazing!  Fencing itself is a lot of fun, and he does a really great job of teaching you the (sometimes tedious) basics of footwork and defense while letting you have fun waving around a foil in a highly controlled manner.  Really great class, really great teacher...why would you not want to take this?\nWorkload:\nShow up twice a week and fence.  It's pass/fail like all the other gym classes, and basically, as long as you don't miss more than six classes, you pass.  It's sweet.\n"
        },
        {
            "course_name": "Fencing",
            "review_date": "November 12, 2006",
            "review_content": "\nAmazing.  he was the coach to the us olympic fencing team for like fifteen years, and now he teaches the fencing pe class to completely untalented beginners.  where else are you going to get an opportunity like that?  he's truely passionate about fencing and about you picking up fencing well, and his age, accomplishments, and eastern european/russin origin/accent demand respect.  not without a sense of humor either.  he says some truely funny shit that's all the more funny because he says it with an accent and you wouldnt expect it from his serious demeanor.  one of my best experiences at columbia and something that i will brag about for the rest of my life.  \n"
        },
        {
            "course_name": "Fencing",
            "review_date": "June 08, 2002",
            "review_content": "\nOne of my goals in coming to Columbia was to expose myself to experiences that I otherwise would not get to experience in the real world. Taking this course helped me work towards this goal. You won't learn how to fence worth anything - can you imagine learning to speak French from only 2 hours a week of class, for one semester, with no time outside of class expended? - but Kogler realizes this (and says so), so organizes the class based on this, so that by the end of the semester you are able to perform the basic moves and techniques used by real fencers, albeit rather sloppily. The early part of the semester is a bit slow, as you're learning the footwork, but once you pick up the foil, it becomes more interesting, until at the end, it's free fencing. The class is divided between periods of lecture/demonstration and periods of practicing moves in pairs. If you miss class, you'll fall behind, unless your partner can fill you in. Overall, it's a class that I'm glad that I took. Oh, and besides being the Columbia team's head coach, Kogler is also the coach of the U.S. Olympic team. Just cool to know. \nWorkload:\nIt's phys-ed. If you spend one minute practicing the sport outside of the 50 minute period, you should get yourself a real major.\n"
        },
        {
            "course_name": "Fencing",
            "review_date": "January 30, 2002",
            "review_content": "\nIf you think you're going to be like zorro think again. All you learn is hand positions, and the ways to step. Plus, you wear dirty masks and gloves filled with OPS (other people's sweat) Some people in the class are too aggressive and you can get hurt if you are scrawny or weak. If you're an advanced fencer Adlar is supposed to be a European Fencing Champ or something of that nature. Steeped in rich tradition. Recommend for the motivated fencer.\nWorkload:\nmiss 6 classes\n"
        }
    ]
}