{
    "prof_info": [
        {
            "prof_name": "Patricia Kitcher",
            "prof_id": 767,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Kant",
            "review_date": "December 11, 2013",
            "review_content": "\nPatricia Kitcher is an expert on Kant, so it's hard to hope for a better person to explain what's going on in the critiques. She was also helpful one-on-one in discussing the papers. The only thing I would criticize is that in lecture, she sometimes has a tendency to take the class's silence as a signal that everyone is following her. She often starts her sentences with \"does everyone see that...\" and tends to assume that people do. With Kant, sometimes you yourself don't even know when you have a question or need to clarify, so I get that this is hard to gauge. I don't know if I would say that she presented a whole lot beyond explicating exactly what is going on in the text, but she did that really, really well. In general, Prof. Kitcher's lectures made Kant's writing clear enough that I was able to reflect on it in greater detail on my own and with friends in the class. I definitely would say that I understand Kant as well as I probably could hope for after a first reading of the first and second critiques.\nWorkload:\n3 short papers (2-4 pages) and a final paper (mine was around 10 pages, but it's up to you). The pace of the reading varies. Often page-wise it's not too much, but it's Kant. Towards the end we had to speed things up and so I didn't end up finishing the Critique of Practical Reason (I had been more or less caught up most of the semester), but my impression is that that part isn't as worth reading as most of what preceded it. We read almost all of both the Critique of Pure Reason and the Critique of Practical Reason.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 19, 2011",
            "review_content": "\nPatricia Kitcher quite probably is one of the worst professors I have had at Columbia. There is no doubt that this woman is extremely intelligent, as mentioned in previous posts about how quickly she answers questions and with the great ease that she does so. Her breadth of knowledge is extremely extensive, as she has even written a couple books on Kant, etc. Basically it is like she expects her students to just KNOW and easily understand philosophy in the same light she does. If you challenge a view she has, most likely you will be wrong. Before this class, I had no previous exposure to philosophy or any of the texts we studied so I was actually looking forward to learning it. This woman deterred any interest I may have had AT ALL. I have come to despise it because of her evilness. In essays and the midterm/final, if you steer away from any of her arguments she made and come up with your own ideas/challenge the philosophers, you will most likely get a terrible grade. She comes across as this sweet old lady and then will completely screw you come the midterm/final. I cannot tell you how many people I knew in that class that thought they ACED the tests and then would come back with C's and D's. This is a CORE CLASS aka WE HAVE TO TAKE IT, and Professor. Kitcher acted as if we all were some brilliant philosophy students that should have known everything she was talking about and been able to recite it back to her verbatim. DO NOT TAKE HER CLASS! That is, unless you are familiar with philosophy and LOVE it. Kitcher makes herself feel smarter and more brilliant by rejecting her students' ideas and giving them barely passing grades. Aren't you supposed to want your students to do well? She is a woman on a power trip and I went through 2 semesters of HELL in her class while all my other peers raved about how great their CC classes were. Seriously, this woman sucks.\nWorkload:\n2-3 essays per semester, 2 questions about the readings due each class (couple paragrahs long), and a midterm and final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 02, 2011",
            "review_content": "\nA few caveats, most of them already mentioned before: Professor Kitcher is a philosopher, and she does not try to hide the fact. She is incredibly well read: even if she does consistently try to summarise out-of-class material for her students, you're going to get a more than a few references to something you may not understand. She's breathtakingly quick on questions -- both asking them and answering them. Be prepared for a full 2 hours of paying attention and taking notes if you want to tackle her essay questions and exams with some confidence.\nOn the other hand, Professor Kitcher is an incredibly approachable professor. She genuinely cares about her students, and tries her best to cater to your needs. More than that, she honestly cares about the Core -- about the texts you read, about why you're reading them, about the texts you *aren't* reading and why you should care about those too. The readings she added to the usual semester's work were some of the best I've read, even though I'd never have thought of picking them up myself.\nProfessor Kitcher grades anonymously, a fact I respect her for. Papers are submitted electronically, so you won't have to even try with her south-paw scrawl (?!?!?!, is my reaction to anything she writes by hand). Exams are also graded anonymously. \n\nWorkload:\nDoing the readings is best for you; that said, listening carefully in class goes a long, long way. Weekly responses take the form of writing down two questions about the day's reading. Essays are definitely drawn from topics discussed in the classroom, and tend to require you do a close reading or analysis rather than a broad discussion.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 13, 2006",
            "review_content": "\nI agree that Prof. Kitcher  is a mind-numbingly brilliant teacher - certainly one of the best I have met at Columbia. His knowledge of the texts is ABSOLUTELY EXTRAORDINARY. This guy is a magician. His ability to make use of a mere two hours to give us a complete, clear, interesting appraisal of texts must be the envy of the entire scholarly world. \nThe only disappointment was that he wasn't teaching both semesters. But then, hey, who steps in, but his wife! An equal, or even greater superpower in philosophy, but a marginally less-skilled teacher. You would be incredibly lucky to be taught by her, and to be taught by both would prove in most books the existence of a benificent God, had not they dispelled that notion in class. Taken together, this CC sequence is the gem of the department, even Columbia. \nWorkload:\nTwo 3-7 page papers, final + midterm, class questions. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 14, 2006",
            "review_content": "\nProf. Kitcher has her definite ups and downs. If you're looking for a CC professor who is actually a philosopher and not an anthropologist, for example, then she's the right choice. If you don't give a hoot about philosophy, then stay away. With Prof. Kitcher, you'll be talking about philosophy with no digressions all the time, but this might also consist of a couple of philosophy-enthusiasts taking over the class and having most stuff go right over your head. Her paper topics are very challenging, as is her grading policy -- she told me herself that she won't give an A to anyone unless they've said something so witty it surprised her. Most B+ papers are \"perfectly fine\" with no mistakes, which is pretty frustrating. The good thing is that she's very available and very fair -- she will help you improve and consider your improvement in the course heavily. She's understanding of one bad paper or one bad exam, too, which is nice. Just be aware that she's tough, and if you don't care about philosophy, then this class can be very tedious. It might be better to have a bad prof. who will get you the easy A if the subject matter doesn't concern you all that much, but that's really a personal decision. A good professor, definitely knows her stuff, but much tougher than most.\nWorkload:\n2 papers, each about 5 pages long. 2 questions based on reading for every class (this is how she takes attendance) and the midterm and final are standard -- IDs, short and long essays. \n"
        },
        {
            "course_name": "History of Philosophy II: Aquinas to Kant",
            "review_date": "May 12, 2006",
            "review_content": "\nI do not recommend this class for people who are not philosophy majors. There is a TON of reading for each class, which she spends all of class going over so you do not really have to do it. However, the material is not interesting and her lectures are quite boring. The papers and exams are graded harshly by the ta's. \nWorkload:\nDaily reading assignments which don't need to be done.  3-5 page paper, 5-7 page paper, midterm, final...she weights the second paper and final more which is nice. The work is graded pretty harshly. \n"
        },
        {
            "course_name": "Philosophy of Psychology",
            "review_date": "June 06, 2005",
            "review_content": "\nI guess I'm in the minority of CULPA reviewers, but I didn't think Kitcher was too great (why did I take 3 courses with her then? I don't have a short answer to that).\nThe good parts: She's an easy grader. Just turn in average papers of adequate length and you'll get your A minus. \nThe bad: All texts covered are interpreted through the lens of the philosophy of science. Science is GOD (she'd hate me writing that, since she absolutely despises religion of every form and lets you know it at least a couple of times each lecture. She's ALWAYS making fun of Leibniz, for example. I'm not religious, but I find people who are so vehemently opposed to the religious mindset to be more deluded than even religious fundamentalists - but that's just me). And like most people in awe of science, she has an idea of almost inevitable progress in all things, including philosophical thought. The latest stuff is almost always the best. Well, that may not be a bad aspect of a professor for everybody, but it was for me. What else is bad? She seems to get lots of things wrong - or at least dumbs them down to the point where the author's point is completely obscured. She'll find fault with every position she teaches (don't worry, she's not so critical in grading student papers and will let stupid arguments pass if you write enough pages). I didn't find her very good at answering student questions, either. The really good professors can think on their feet and quickly tell which questions are stupid and which are worthy of consideration. Kitcher can't do this. Often, in response to a question she does not understand, she just restates what she said in lecture a minute ago, hoping the student will politely nod and go away. Other times, she'll concede a huge point that's completely devastating to the text she's teaching, only to come back next class to explain why the crticism did not apply (there were a couple of examples of this from Kant, but I've forgotten them - but someone who really knew her Kant would have been able to right away see the problem the student was pointing to and explain why Kant wasn't making that mistake). I've gotten the impression, after taking all these classes with her, that Kitcher does not have a great a grasp of the texts she teaches. She has her set lectures and she'll guide you through the main points of the text, but she doesn't have the thorough command that a really great professor has. I'd give her a B plus.\n"
        },
        {
            "course_name": "Philosophy of Psychology",
            "review_date": "January 27, 2004",
            "review_content": "\nPatricia Kitcher ia able to convince students that she knows what she's talking about without intimidating the hell out of them. Her lectures are always insightful and bring clarity to even the most obscure of texts (by way of saying, Kant's Critique of Pure Reason isn't exactly a page-turner). She is also extremely approachable, and her patience in answering questions is a great resource. A thoroughly wonderful professor. \nWorkload:\nKant: 3 short papers (2-3 pg), 1 long paper (10 pg); Phil of Psych: paper (8 pg), midterm, final. Grading is on the generous side of fair. \n"
        },
        {
            "course_name": "Kant",
            "review_date": "December 16, 2003",
            "review_content": "\nKitcher is simply a model teacher.  Very  devoted and enthusiastic, generally, and clearly devoted to the care of her students - just what a Chair ought to be.  She is non-intimidating, kind, and goes out of her way to be sure that whatever is presented is understood.  Her real charm is her ability to communicate very complex material in a coherent manner, which was certainly no easy task in this class.  She's also quite likeable, and is warm and compassionate in the classroom and office hours.  Just a top-shelf professor, here.\nWorkload:\nThree short papers with flexible deadlines.  One longer, final paper.  Lots of required reading.\n"
        },
        {
            "course_name": "Kant",
            "review_date": "December 08, 2003",
            "review_content": "\nProfessor Kitcher is phenomenal (But how is she noumenally you might ask? [please shoot me]). Actually, with a few islands of serenity (the introduction and the second analogy) the text may as well have been written in Greek, or German for that matter. Professor Kitcher provided vital translation services and guidance as to which of LeibnizÂ’s absurd theses Kant was currently debunking (for the/a guy who invented calculus, he wasnÂ’t the philosophically sharpest knife in the drawer).  Anyway, with KitcherÂ’s explanation the Critique actually makes sense which is a testament to her understanding of said tome of mystery and the context in which it was written. An essential course for the philosophically inclined. Others might reconsider. \nWorkload:\nthree short (2-3 pg) papers due \"whenever\" and a 10 page termpaper. Oh, and 600 pgs of confusion.\n"
        },
        {
            "course_name": "Philosophy of Psychology",
            "review_date": "July 13, 2003",
            "review_content": "\nGreat Course.  Hard Work.  Kitcher is very organized - with each class lecture titled and well structured (and she does her best to stay on topic despite the material, which lends itself to digression).  The material is fascinating, and, at times, difficult if you're not a philosophy major, but she does a great job of clearly explaining key points and concepts.  She's a rough grader though, and this is no easy A.  But if you're at all interested in either topic, then it's definitely worth it.\nWorkload:\nMidterm, Final, 1 Paper 5-10 pages.Heavy Reading. \n"
        },
        {
            "course_name": "Philosophy of Psychology",
            "review_date": "November 23, 2002",
            "review_content": "\nClasses don't come much more straight-forward than this. Enter class... take notes... leave class... read book... It was a completely average experience. Kitcher does indeed know her stuff... and gets her kicks by disagreeing with EVERY philosophical theory that is out there (honestly, she will find something wrong with any theory). The class focused much more on the philosophical and not the psychological -- that is, things were approached philosophically and not psychologically -- which seemed totally appropriate. But psych students beware -- this will not be the behaviorism fluff you learned in Scherm. You'll be expected to think now (horrors!) The readings and the lectures did seem dry... I think it was mainly the fault of the readings. There was too much material to cover in 15 weeks -- we were forever behind -- and we never engaged in conversation (yes, it was a lecture... but only about 15 people). Most of the readings presumed an extensive background in a number of fields (nothing any undergraduate is expected to know -- definite field-of-study issues). This made it difficult to get at the crux of any agruement/theory. All in all, a lot of interesting ideas were presented... just nothing happened after that...\n"
        },
        {
            "course_name": "History of Philosophy II: Aquinas to Kant",
            "review_date": "April 28, 2002",
            "review_content": "\nYou will not love this class. You may like it, you may think it's ok, but you won't think it's great. I cannot say anything against Kitcher as a person: she's very nice, approachable, and extremely tolerant of her students' absolutely moronic and masturbatory questions that often monopolize the class and totally divert the discussion, precluding you from actually learning anything. That's one problem anyway: she never shoots anyone down. What should be a lecture often becomes a FIFTY person seminar-- not exactly a good way to learn. Her lectures are easy to follow, but in no way systematic. I found her clarifications helpful, but wanted a more in-depth and detailed account. Another problem: the philosophers we studied at the beginning of the course (Spinoza and Leibniz in particular) are maddeningly obtuse. Anyone interested in making accusations that philosophy is pointlessly speculative need look no further. On the other hand, the material gets better: Hume and Kant are brilliant, and do a lot to undermine the ridiculously stupid positions of their predecessors, which is fun to watch, in a vengeful sort of way. Moreover these texts have a lot of intrinsic value. Studying Kant in particular has exposed me to a whole knew way of thinking about things. In the final analysis, though the class was pretty mediocre, it gave me the introductory information I wanted. It could have been better, but so what?\nWorkload:\nnot bad, assuming you don't fall behind, like I did. about 6 hours of reading per week in a massive and unwieldy text book, two papers, 4-6 pages, and 5-8 pages, midterm, final. light grader.\n"
        },
        {
            "course_name": "History of Philosophy II: Aquinas to Kant",
            "review_date": "April 24, 2002",
            "review_content": "\nTrue, Prof. Kitcher just goes over the readings, but I liked that. Something about hearing each philosopher's views again, in a different format and from a different angle made the stuff make more sense to me. Hey, this is an intro course, what do you expect. Prof Kitcher REALLY cares about her students. I missed a class and she went over her whole lecture for me in office hours. If you're someone who sometimes falls behind in the reading - she's the perfect professor because she doesn't assume you understood anything. This attitude is especially good for Kant, because chances are we students missed something important even if we read the stuff. Bottom line: great intro course, especially for someone who just wants some fundamentals in philosophy and not necessarily major in it.\n"
        },
        {
            "course_name": "History of Philosophy II: Aquinas to Kant",
            "review_date": "March 27, 2002",
            "review_content": "\nAs the previous review says, Prof Kitcher is a very nice woman. While the material in this class can leave you shaking your head at the concept that anyone ever believed some of the nonsense from people like Spinoza, the professor is good at acknowledging points that she believes are weak in the author's argument and trying to explain the strengths where she believes them. There is no dogmatic defense of every author in this class. While the class can get a bit large the professor tends to deal well with questions, in many cases actually answering the student's question rather than something tangentially related to the question as so many of my professors have. The readings can get repetitive, look out for the small type in the reader that makes some of the assignments look short, but you do not need to do them in-depth as long as you cover each of the major topic points that are conveniently pointed out by the reader. Attendance is very useful in this class as the tests are almost entirely from the classroom summary of the reading. A fair grader and eminently approachable.\nWorkload:\ntwo short papers (4-6p), midterm, final \n"
        },
        {
            "course_name": "Philosophy of Psychology",
            "review_date": "November 14, 2001",
            "review_content": "\nA very nice lady, always willing to talk to students. Teaching is acceptable but not good. Lectures are not exciting. She tends to scribble unintelligibly on the board and the stuff she writes is too concise to mean anything alone. So you have to be a very conscious and attentive notetaker (which I think everyone knows it painful) or you may as well not take notes at all (if you can beat that fixation). Fortunately you can very well survive without taking much notes. The course itself isn't that difficult. Concepts are hard but not impossible. Reading the reader beforehand and going to office hours definitely helps a lot for this class.\nWorkload:\nTwo papers, one short, one long. Reading is dense but it's philosophy. And you can pick topics to write papers on, so you can skip quite a lot of the reading if you aren't in for knowledge (but in that case why would you take this class?) Overall workload is lighter than average, and very much depending on what you want from the course.\n"
        }
    ]
}