{
    "prof_info": [
        {
            "prof_name": "Charles Doubleday",
            "prof_id": 1276,
            "total_reviews": 33
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 15, 2016",
            "review_content": "\nProfessor Doubleday's lecturing style can be dry at times and reading the textbook was a must but in my opinion, he made orgo as painless as possible. I had Campos for orgo I so in comparison, Doubleday's class was more laid-back. He is very clear about what he expects you to know for his exams. The exams are moderately difficult but just make sure you study the practice exams intensively. The exam problems are more difficult than most of the assigned McMurry hw problems so after a while I just stopped doing McMurry and studied the practice exams exclusively. However, I would recommend using McMurry to practice mechanisms as Doubleday seems to draw upon those for his exam questions. To practice syntheses, studying the practice exams was key. The final was the most grueling 3 hours of my life (18 pages long) but if you study the first three midterms and all the practice exams you will make it out relatively unscathed.\nHe is not very good at inspiring the students so less than 50% of the class showed up toward the end of the semester (personally, I thought it was a refreshing change of pace to not be swarmed by a bunch of overeager pre-meds at lectures and office hours though). He is very responsive on Piazza and he was generous about offering extra office hours before the 3rd midterm and the final. I would take his class if you are the type of student who learns better by reading the textbook and studying on your own. If you're planning on taking orgo, chances are you've already had a good amount of experience in science/pre-med classes at Columbia so Doubleday's class won't be any different. \nTake-away: \nOrgo will be difficult no matter who you take it with but at least Doubleday's class is straightforward.\nWorkload:\nWorkload: \nNot bad for 3.5 credits. Orgo lab was 10X the amount of work and less than half the credits. 6 recitation quizzes (best 4 are counted). Quiz grade only counts if it helps you. 3 midterms (lowest one dropped).  One excruciating final, which counts as 3 midterms. The means for midterms 1,2, and 3 were ~75, ~55, ~55  respectively. I got an A by reading the textbook, going to most of his lectures, and studying the practice exams. Make notecards for the reactions and know those reactants front and back because there are A LOT you have to know for the final. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 18, 2015",
            "review_content": "\nProf Doubleday is a genuinely nice enough professor--if you understand organic chemistry. If you don't get it, he tries, but the level of impatience escalates exponentially; and then he's pretty much useless (particularly as the class progresses) because he cannot seem to explain things on a level other than for the A student. I have seen it happen to people. And, let's face it, we aren't all gifted in the same way. But, I'm sure if you are here you have your gifts. So I'm celebrating them by telling you be sure you need to take Organic Chemistry before you take it. It's not just for shits and giggles. \nIf you are one of those who likes to cram for exams, well this is not the class to take. In fact, don't take Organic Chemistry at all. Just move on to something you're passionate about. You'll be A LOT happier, and anyway, as interesting as Organic Chemistry is, it really isn't for the tangential polymath. You can't merely just be \"interested,\" sadly.\nHis first exam was a piece of cake. (See stats of previous review as they are accurate.) The second exam probably shocked most people as being significantly harder than the first. The third exam is about the same as the second. And the final was just ridiculously and unnecessarily long and tricky for no good reason; not to mention repetitive. I cannot fathom why this final exam had to be 15 pages long. Maybe to compete with Cornish's? I heard her exam was even longer. Regardless, I was bored to tears and pissed off because I had another exam to take; and I was sleepy and petulant by the end.\nThe work load, I feel, is heavy. Some geniuses might disagree. I also feel that he spends too much time on beginning concepts and not enough time on synthesis/mechanism stuff, which is where the class begins to fall apart in my humble (well maybe not so humble) opinion.\nDoubleday is grandfatherly in his teaching style in class, which I found endearing. He also spends more time outside of class helping students than any other professor in the sciences (besides my physics professor: Humensky and Schaevitz). As the class progressed his lectures got a little bit more scatter-brained, and he starts to talk to himself and laugh directly at the blackboard without paying any attention to us. It's some sort of angel and devil on the shoulders dispute he has going on, which can be humorous at first, but gets very old and annoying particularly if the concept at hand is difficult and requires careful and focused delivery.\nBottom line: Doubleday is likable, and in fact, lovable if you're doing well. If you're not I'm sure you will find him annoying and you will complain about everything in the class--from his kowtowing to the textbook, to his overt internal dialogue, to his exams, to his office hours where all the sycophants gather weekly like hens to the roost. But maybe you'd find any professor annoying if you weren't doing well. You'll really have to soul search for the answer to this. I can be of no help there.\nA word about the TAs: All TAs as you know are not created equal. This class was insanely unfair because of it. One TA gave her students plenty of help (via handouts and extra problems). The other did nothing of the sort, and was a poor lecturer. The quizzes were easy if you just read the notes again and did a few problems. I'd like to see statistically how the students faired in the class overall by TA. But that will probably never be allowed to happen at CU because they have a stick up their asses about grading and policy and an ballooned ego the size of the Hindenburg. \nWorkload:\nHours and hours of tedium, weekly, unending until the last moment of the aforementioned excruciatingly long final. About 10-15 hours/week for the one class. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 18, 2015",
            "review_content": "\nProf Doubleday is a genuinely nice enough professor--if you understand organic chemistry. If you don't get it, he tries, but the level of impatience escalates exponentially; and then he's pretty much useless (particularly as the class progresses) because he cannot seem to explain things on a level other than for the A student. I have seen it happen to people. And, let's face it, we aren't all gifted in the same way. But, I'm sure if you are here you have your gifts. So I'm celebrating them by telling you be sure you need to take Organic Chemistry before you take it. It's not just for shits and giggles. \nIf you are one of those who likes to cram for exams, well this is not the class to take. In fact, don't take Organic Chemistry at all. Just move on to something you're passionate about. You'll be A LOT happier, and anyway, as interesting as Organic Chemistry is, it really isn't for the tangential polymath. You can't merely just be \"interested,\" sadly.\nHis first exam was a piece of cake. (See stats of previous review as they are accurate.) The second exam probably shocked most people as being significantly harder than the first. The third exam is about the same as the second. And the final was just ridiculously and unnecessarily long and tricky for no good reason; not to mention repetitive. I cannot fathom why this final exam had to be 15 pages long. Maybe to compete with Cornish's? I heard her exam was even longer. Regardless, I was bored to tears and pissed off because I had another exam to take; and I was sleepy and petulant by the end.\nThe work load, I feel, is heavy. Some geniuses might disagree. I also feel that he spends too much time on beginning concepts and not enough time on synthesis/mechanism stuff, which is where the class begins to fall apart in my humble (well maybe not so humble) opinion.\nDoubleday is grandfatherly in his teaching style in class, which I found endearing. He also spends more time outside of class helping students than any other professor in the sciences (besides my physics professor: Humensky and Schaevitz). As the class progressed his lectures got a little bit more scatter-brained, and he starts to talk to himself and laugh directly at the blackboard without paying any attention to us. It's some sort of angel and devil on the shoulders dispute he has going on, which can be humorous at first, but gets very old and annoying particularly if the concept at hand is difficult and requires careful and focused delivery.\nBottom line: Doubleday is likable, and in fact, lovable if you're doing well. If you're not I'm sure you will find him annoying and you will complain about everything in the class--from his kowtowing to the textbook, to his overt internal dialogue, to his exams, to his office hours where all the sycophants gather weekly like hens to the roost. But maybe you'd find any professor annoying if you weren't doing well. You'll really have to soul search for the answer to this. I can be of no help there.\nA word about the TAs: All TAs as you know are not created equal. This class was insanely unfair because of it. One TA gave her students plenty of help (via handouts and extra problems). The other did nothing of the sort, and was a poor lecturer. The quizzes were easy if you just read the notes again and did a few problems. I'd like to see statistically how the students faired in the class overall by TA. But that will probably never be allowed to happen at CU because they have a stick up their asses about grading and policy and an ballooned ego the size of the Hindenburg. \nWorkload:\nHours and hours of tedium, weekly, unending until the last moment of the aforementioned excruciatingly long final. About 10-15 hours/week for the one class. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 18, 2014",
            "review_content": "\nProfessor Doubleday is a decent lecturer and makes himself readily available to his students.  He strikes me as having genuine passion for the material and wanting his students to do well.  He holds 3 review sessions during exam weeks in addition to office hours and private appointments.  He seems friendly and approachable in lecture, however, I found him to be surprisingly abrupt during office hours. \nHis exams are straightforward for the most part.  He provides the previous 5 years of exams and borrows heavily from these (although I hear he may draw less from old exam questions going forward).  The final exam was more difficult than anticipated and the medians reflected this.  Generally you'll find one or two unexpected question types.   My approach was to master the practice exams and do the chapter problems twice.  \nMedians on the midterm exams were ~90,~70,~70.  Medians on the final (which itself constitutes 3 midterms) were lower.  The class median this semester including all drops and adjustments was a 77, which curved to a B.  Above an 88 (and possibly a little less than an 88) should've gotten you an A.\nWorkload:\nModerate to heavy.  Know the practice exams cold!\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "May 26, 2014",
            "review_content": "\nOrgo is a very hard class that requires a lot of work to keep up. I didn't enjoy orgo and didn't enjoy Doubleday as a professor.\nPros of taking Doubleday:\n1) he teaches almost directly from McMurry. I got by in this class by pretty much memorizing the textbook, which is a lot of work and time consuming! But I found Doubledays lectures to be a complete waste of time, and towards the end of second semester I stopped going to lectures completely--it was a better use of time to read McMurry and do the (millions of) assigned homework problems. \n2) Doubleday provides 5 years of previous exams, which are a pretty accurate representation of what your exam will look like. However, in contrast to a review below, I did think that in each exam there was at least one \"curveball\" questio that always threw me off. I recommend absolutely ACEING the early midterms because they only get tougher.\n3) Doubleday is very willing to hold office hours and is helpful as long as you have specific questions.\nCons:\n1) The poor quality if the lectures. He is very boring and hard to understand and there is no organized format to his lectures. My lecture notes were not helpful at all, and I never used them to study for exams. Unless you have read the chapters before going to the lecture (which I managed to do for about 3 weeks in first semester) then you will not understand what he is talking about at all.\n2) Doubleday is a bit pompous--one of those professors who doesn't understand how his student might not understand material that to him is so easy.\n\nWorkload:\nVery heavy.  20/25 hours of studying a week.\nLong homework assignments that aren't handed in, but I recommend doing.\n3 midterms and a 3-hour final. One midterm OR one section from the final is dropped. \n7 quizzes--lowest two are dropped--which are 10% of final grade, only if they help you.\n"
        },
        {
            "course_name": "Organic Chemistry I and II",
            "review_date": "May 04, 2014",
            "review_content": "\nI got an A+ first semester and am expecting an A+ for the second semester as well. Professor Doubleday is an awesome guy. He will spend a lot of time with you to make sure you understand the material. I think he's very friendly and easy to approach. His exams are extremely reasonable (no weird tricks) while still challenging (in a good way), and he gives you many old exams to work from. \nLike any orgo class, it takes a lot of practice and a wide exposure to problems to be able to do well. Overall, here's what you need to do to be successful: 1) You should definitely THOROUGHLY read McMurry, especially if you don't go to lecture. The details in McMurry are necessary to do well. When you read McMurry, take your own notes on the chapter and rewrite the \"summary of reactions\" sections at the end of the chapter. Hold on to these notes, don't throw them out. There were many times this semester where I referred back to my old textbook (and class) notes from last semester. 2) Try to do the end of chapter question problems. If you struggle doing the end of chapter questions, then get Klein's Organic Chemistry textbook and read up on the sections where you're struggling (or Organic Chemistry as a Second Language). You should be able to do the McMurry end of chapter questions without any issues until you get to mechanisms. McMurry is awful for learning mechanisms. Get Klein's books. 3) Once you've got the material down, do Professor Doubleday's practice exams. If they're too hard for you, then do all of the relevant end of chapter and in text questions from Klein. You should be able to tackle any problem at that point. 4) Go to his office hours, especially his marathon office hours on Friday before the Monday exams. I went a lot last semester and they were helpful (with MCAT studying, I had no time this semester to go to office hours).\nAll the people I know who did not do well in his class did not allow themselves enough time to study. They didn't do enough problems and they did not get through all his practice exams (which is foolish not to do). His practice exams are absolutely necessary study tools.\nWorkload:\nI probably spent 4 hours each day doing orgo. On weekends before exams, I spent at least 12-14 hours studying each day. Orgo in general will take a lot of time and practice.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 02, 2014",
            "review_content": "\nI couldn't agree more with the most recent positive review below me. I also felt the need to post on this forum because the reviews I saw for Doubleday were overwhelmingly negative, and I really can't fathom how that's possible. As the reviewer below me wrote: DOUBLEDAY MAKES THE CLASS THE EASIEST IT CAN POSSIBLY BE. It's not an easy class, especially second semester, but Doubleday is enthusiastic and clear most of the time, tho he does have a tendency to look at the board and mutter sometimes. He gives previous years exams for you to review (five per test - that's like, unheard of!) and he is absolutely straightforward about what he will test on, and best of all, THAT'S ACTUALLY WHAT HE SPENDS HIS TIME TEACHING. Both semesters I have relied almost exclusively on Doubleday's lecture notes and the practice tests, only reading the textbook when I was confused or needed clarification on something very specific. I got an A first semester, and found the class relatively straightforward and sort of easy, doing about 4-8 hours of studying per week. Flashcards for reactions are critical at least for me, and I spend a lot of time writing and reviewing those. Don't do what I did and get cocky from good early exams though - the class is very cumulative in what is learned (tho only the final is actually 'cumulative') so you must keep up and don't rely on good grades on the easy early stuff!\nWorkload:\nModerate. 8 hours per week studying. There are optional quizes which end up counting for 10 percent of your grade only if it helps you, otherwise they are wrth nothing. 3 exams and a final, onf which one exam or 1/3 of the final will be dropped, based on which is lowest. All exams and 1/3 of the final are worth the same respectively. DO DEM FLASHCARDS YO!\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "March 20, 2014",
            "review_content": "\nTaking Orgo with Doubleday is legitimately the easiest the course could possibly be. I truly believe that the people who are complaining about how difficult his class is would not be complaining if they had ANY basis for comparison with other Orgo classes. Yes, Orgo is a difficult class...not sure what these people expected and why they feel the need to blame it on Doubleday. He legitimately will announce during class things like \"I would never test you on that, it's just too complicated\" or \"If I asked you about that, that would just be mean, wouldn't it?\" He legitimately only tests on the most simple and some slightly more difficult iterations of what we learned. He has absolutely no desire to trick or surprise us. I'm not sure what was going on in the previous years referenced, but this for this entire year the averages for exams have been between the high 70s and mid 80s which is really high for an O chem course. I have been meaning to write this review for a while because when I saw Doubleday's reviews last semester all the other professors were full and I was really really upset that I was stuck with this incredibly difficult professor. Being forced to stick with Doubleday turned out to be the best choice ever. Even if Cornish/Campos exams have averages of 50s/60s and end up curving to be \"equivalent\" to Doubledays uncurved but easier exams, I'd rather not spend a semester feeling like crap taking exams that demoralize me, memorizing crazy things like pKa values (which Cornish makes you do and doubleday would NEVER). Even if an A student in Doubleday turns out to be an A student in Cornish/Campos etc. as well (which I think is probably the case after curving/test difficulty are taken into account), I promise that taking Doubleday will be a much less stressful experience overall.\nWorkload:\nA fair amount but not nearly as much as with other O Chem professors. If you read the textbook there's no need to attend class.\n"
        },
        {
            "course_name": "Organic Chemistry I and II",
            "review_date": "January 09, 2013",
            "review_content": "\nIf you are taking Orgo with Doubleday, I have two things to say:\n1. DO NOT TAKE IT WITH HIM IF YOU DON'T HAVE TO. Period. He was the worst professor I've had, in terms of  teaching ability, effectiveness, and in simple, basic ability to inspire students to be interested in (and dare I even say passionate about?) the subject at hand. This material in a brilliant professor's hands could really ignite the intellectual fires of many students. There's none of that here. Just boring, awkward lectures that made me wish I was at the library studying instead.\n2. If you have to take it with him, buy David Klein's Orgo textbook (the same guy who wrote Org Chem as a 2nd Language). \nThe only reason I got an A in this class was because I not only fully completed Klein's \"Organic Chem as a Second Language\", I googled Klein, found out he wrote his own book, and shelled out an additional $250 to get Klein's full textbook and solutions manual. They were absolutely, 100% invaluable. The McMurray is still necessary, so that you can phrase everything in McMurray's specific terms (in terms of reagents used, mostly), but honestly what I would do is this: I would check the syllabus to see what we were supposed to study before the lecture, and then I would find that subject matter in the Klein textbook. I would read the Klein chapter in full, doing every single example problem along the way (without looking at solutions), and taking notes. Then I would do every single Klein example problem at the end of the chapter. I would then attend the lecture, and then I would go home and simply read through McMurray casually, noting differences in reagents or language. This is vital for the initial gen chem review, and for understanding: formal charges, nucleophilicity, electrophilicity, acids and bases, and most importantly....synthesis and mechanisms, with synthesis being most vital. (side note: if you are not skilled at moving 3D objects around in your mind, you should get one of the molecule model sets. Draw a square with a straight line sticking out diagonally from one of its corners. Now try to imagine its mirror image, without drawing anything. Now imagine these two images: the one you drew and its mirror image, and decide if whether or not these two separate structures are superimpose-able on each other. Now multiply trying to do that by 100. That's what you'll have to be able to do without hesitation in this course). \nIn the Klein text, there is an entire chapter, chapter 12, devoted only to organic synthesis. This chapter changed everything for me, because Doubleday's exams are 70% synthesis. The mechanisms are very important too, but if you do all of the practice tests, you get used to Doubleday's favorite tricks (ring openings and changes, hydride and methyl shifts, etc).\nThis class is a TON of work. Whether you are undergrad or post-bacc. I see a lot of undergrads on here complaining that post baccs can put so much work into the course - well, sure they can, if they don't have jobs!!! Most of us have full-time jobs, like me. I work M-F, from 9am in the morning until at least 6 or 7 in the evening, and there is no time to study at my job. So I had to learn all of this before 9am and after 7pm every day, and then all weekend. I had no social life at all from late Oct through the final. I would say you should expect to study at least 15 hours a week for this course. At least. \nMost important: Get the klein text, do ALL of the practice exams, when you study begin and finish with doing problems - don't ever just read and think that will help you. It won't. \nDoubleday was affable, but useless as a lecturer. And it's true - there is absolutely no curve, at all. Don't be fooled if you get a 70 on an exam and he tells you the median was a 50. That's the *median*, not the mean. It's like other people have said on here: you have to know the concepts and the reactions perfectly. There is no room for error. If you miss one synthesis problem or one mechanism, you're screwed out of an A (and it usually means you'll end up around a C). \nAnother thing that helped me is that I made a friend in class, and we would study together from time to time. It is so helpful to have someone to talk to whose eyes don't cross when you say \"nucleophilic substitution\". I really recommend having a study partner.\n\nWorkload:\nMost work I've ever done for a course (I did my BS in psychology at Chapel Hill, which was no joke). Recommended study time: two to four hours a day, every day. Don't get behind....if you do, there's no hope.Sounds dramatic, I know, but it's just the objective truth.\n"
        },
        {
            "course_name": "Organic Chemistry I and II",
            "review_date": "May 12, 2012",
            "review_content": "\nJust finished a year with Doubleday and got a B both terms (I mostly get A's in my other classes)\nHere's what you should know for his class:\n1) He teaches straight from McMurry (the text), so you don't HAVE to go to class. If you have as little time as I had this term, then it is sometimes a good time management decision to skip class and be more productive with your time by doing whatever else you have to do.\n2) He doesn't curve. For example, my average for the second term was about an 80, and the midterm medians (note: averages are ALWAYS lower than medians) were 67, 64, and 51...and with my 80 average I got a B. In other words, there is a pretty good chance you will end up with a B- or lower. If I had to make a rough guess, I'd say 40% of the class gets a C+ or lower. I know for a fact that he gave fewer A's and A-'s last term than Professor Mowshowitz's biology class (and Mowshowitz is somewhat notorious for the difficulty of her class).\n3) There is no way of getting around memorizing McMurry COLD. If you miss one mechanism problem and one synthesis problem on an exam because you forgot a step and you're completely stumped (very little partial credit is given), then at best you will get an 80 on that exam, assuming everything else is perfect (in reality that means you're at a 75 best, because nothing else is perfect). \n4) Organic chemistry in Doubleday's class is about being able to know reactions so well that you can see their mechanisms in your head walking down the street (and for spring semester, knowing them in reverse). I call it \"overwhelming familiarity.\" Can you recite your social security number in reverse in under 3 seconds without thinking? Could you do the same if you had to memorize 75 SSNs? 100? What if you had to combine them in different ways? You essentially need to be a living computer in this class: high processing speed (there is no thinking in Doubleday orgo, the vast majority is complete reaction (you should know the answer immediately), memorization (your ability to memorize with be stretched to its limit), attention to details (there is no room for mistakes when the class isn't curved). Orgo feels like bootcamp.\n5) The workload is tremendous. I made around 150 extra large notecards and about 20 pages of review sheets in addition to doing all of the homeworks, practice exams, etc. and even seeing a tutor fairly routinely...and still got a B. \n6) Snyder vs. Doubleday: Snyder teaches you more about the WHY and HOW, and Doubleday teaches you more of the WHAT. In other words, Doubleday is essentially descriptive. I don't think too many people come away from his class thinking organic chemistry is a terribly intellectual discipline. I think most people just think it's one step above memorizing the dictionary. That's a bit harsh but fairly accurate I think. In addition, I have never heard anything negative about Snyder, and most people say that he is a wonderful professor (brilliant, approachable, etc.) . Moreover, I think Snyder curves his class to the B/B+ interface, while it seems as though the median in Doubleday is a B-. I'm not sure about that, but from what I've gathered, that's probably correct. Snyder is an actual professor at CU, and Doubleday is a lecturer, so Snyder feels like he has a stake in your success. Everyone (almost) raves about him, though Snyder does assign problem sets, so if you don't have time to do formal problem sets, then that's a negative. But then again, problem sets are basically a way of studying for the exam, so maybe that's not such a negative.\n7) Doubleday himself is nice enough. He's \"medium\" in his approachability, but at the same time I don't think he cares about students to the same degree as Snyder. He does have ample office hours before exams which is nice, and he's very upfront about what's on the exam. He won't, however, tell you how he intends to grade the class (I think most people are disappointed when they see their final grades- \"hey I'm consistently above the median with my 73 average, so I'm doing well, right?\"). He doesn't seem to grade statistically. It's not like gen chem. where your grade depends upon your number of standard deviations above or below the mean. A 70 on an exam with a 55 median is not good. It's still a 70 and probably a C+.\nWord to the wise: if you take Doubleday (I would take Snyder in retrospect) get Snyder's lecture summaries from a friend in Snyder's class. They tell you WHY stuff happens the way it does, so that orgo doesn't seem so arbitrary. In reality, there are some principles in orgo, and Snyder does a better job of pointing them out than Doubleday. I have heard Organic Chemistry as a Second Language is a helpful supplement as well. If you have a subpar memory like myself, preview the material before the course begins. You will be thankful when you don't get a C.\n\nWorkload:\nI thought it was tremendous in terms of preparation (homework is merely recommended). I also have a subpar memory, so take that with a grain of salt. Regardless though, I would expect to spend 10 hours per week on this course MINIMUM. 15 would be better. You're a pre-med, so don't whine- do it. Post-bacs will be.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 10, 2012",
            "review_content": "\nMy advice is get out of this class while you can. While I think Doubleday truly means well, I think he is one of the worst professors I had while at Columbia. He is a terribly disorganized lecturer, and I had a hard time following even the first lecture, which was all review. Imagine how hard it was to understand him come the more complicated, new material. Fortunately, Doubleday teaches by the book, so McMurry is enough to know the material on the exams. However, since the exams are quite difficult, it takes a lot of reading and re-reading McMurry to do well. I thought this class was quite unfair, because it met at night, and thus had quite a lot of post-bacs. These postbacs were clearly on top of their material as they put a lot of time and effort in this class. For an undergrad like me who was taking 5 other classes and had 2 jobs, it was very hard to keep up. Although that would be a problem for orgo in general, I would really stay away from this class, as it is all about self-teaching. \nIf you do end up taking this class, make sure you do really well on the first midterm. If you don't, it will be nearly impossible to do well in the end! (For grading guidelines, see the other reviews)\nWorkload:\n3 midterms, one final (worth 3 midterms and graded as 3 separate midterms), 1 component out of the 6 is dropped. the medians were in the high 60s low 70s, except for the first midterm, in which I believe the median was 90%.\nweekly quizzes in discussion section count for 10% of the final grade if they're better than your average in class-- so make sure to do well on these quizzes!\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 24, 2010",
            "review_content": "\nLooks like Doubleday hasn't had a new review since '06, which is probably because nothing has changed in the last four years. He is about as straightforward a professor as you can get, which is great if you're a person who likes to have the option of learning from either the book (McMurry) or the lectures, or to have them reinforce each other. He did teach a couple of things that weren't in the text, but prefaced them by saying they wouldn't be on the exam since they weren't in the book (at which point everybody would temporarily check out). I personally liked him a great deal, I thought he did an excellent job of teaching organic chemistry, a subject which I found to be fascinating. The reviewer below me noted that he doesn't curve individual exams, but rather drops your lowest of six exams (three single exams and one final that counts as three). Doubleday said that in the last year he rearranged the exam material to be more fair (medians were 86, 82, 82). The exams are pretty straightforward and similar to both the McMurry problems and the problems from last years' exams, which he makes available with answers. You can also bring a model kit into the exams, which is extremely helpful. I've heard he is always available for help in office hours although I did not take advantage of this.\nWorkload:\nSuggested weekly problems that are not graded\nThree exams, one three-part final that counts as three exams, with your lowest of the six parts dropped. Six recitation quizzes...drop two, the quizzes count as 10% if they are higher than your exam average or 0% if they are not.\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "September 09, 2006",
            "review_content": "\nI took Doubleday both terms this past academic year, and thought he was as straightforward as you can expect given that it's orgo.  For the sake of disclosure, I got a B+ 1st term, and an A second term.  I spent 12-18 hours a week study for this class 2nd term, and much less 1st term, esp at the start. \nAs another reviewer said, one thing to watch out for is the grading where he just adds up all the points and treats all exams equally regardless of what the median score was... \nThe averages were around 90+ Exam1, 70+ exam 2, and 50+ exam 3... Bottom line, don't screw up the first exam, or the second.  You'll need those points and have an uphill battle getting them back.  That's what happened to me first term, because I didn't study hard enough from the beginning.   I did around 20 points above the median on exam 3, but that was only a 70 something, so no cigar.  \nThe competition is a little harder given that it's a lot of post baccs (yeah, me too).  \nOverall, I studied really hard 2nd term, and that included studying extensively from Leighton's exams.  Doubleday's were more straightforward.  Of course, there are all the usual orgo complaints, not enough time on exams, questions you couldn't have anticipated -- but  Doubleday comes out looking good compared to the other orgo profs.  Orgo and orgo exams are just not straightforward.  \nOne helpful thing, he gives out tons of practice exams.  That doesn't mean you won't be stumped on the real thing, but it does help.  \nWorkload:\n10-15 hours a week.  Do all his practice exams, he gives out lots. \n"
        },
        {
            "course_name": "Organic Chemistry I and II",
            "review_date": "May 12, 2006",
            "review_content": "\nProfessor Doubleday gets lots of bad reviews on here, but if you do the work in the class you won't have a problem with him.  I took him for both semesters, and he makes it clear that only what is important will be tested on the exams, and what is very helpful is that he only tests what's in the book-- no extras.  He doesn't make you hand in any type of problem sets either so it cuts out all the extra tedious side work so that you can really study what is important.  \nAbout Doubleday, he is a really nice person and is ALWAYS available if you have ANY questions.  I went to him before every midterm and the final to go over old exams and homework questions.  He also gives out all his old exams before hand so every student is on an even field when it comes to who has what.  \n\nWorkload:\nthere is no way around the amount of work, but it is doable\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "March 01, 2006",
            "review_content": "\nNo! is all you need to know.   He is by far the worst teacher I have ever encountered at Columbia; Doubleday simply can't teach.  You will have to teach yourself everything and by that I mean Everything. I am an undergrad and took his class due to a conflict with Katz's and was too scared to take Cornish's and I almost wish that I had taken Cornish.\nDoubleday is awkward and can be very mean.  When it comes to grading, he has the strangest way of assigning one.  He does not take the average or the median on his exams into consideration, he simply adds up your points and assigns you a grade you based on his expectations. \nWhen it comes to dropping your lowest exam, he simply drops your lowest raw score (not normalized).  This means that if you don't get a 90 plus on his first test (which has an average in the 90s) or if you miss it for any reason you will be screwed for the rest of the semester because there won't be any chance to collect those lost points, as the average on his 2nd and 3rd midterm was a 70 and a 50.  \nDo yourself the favor of taking Katz.  My friends who were lucky enough to take him ended up with As and A-s without too much drama. I worked my butt off and ended up with a B due to Doubleday's grading scheme.\nWorkload:\nHe gives problems from the text and posts many sample exams. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 12, 2006",
            "review_content": "\nDoubleday is a great professor in an otherwise terrible department. He makes the material easy to understand and is always willing to address questions inside of class and outside of it. \nHOWEVER, don't get tricked into taking his class if you have a heavy courseload or can't spare several hours per day to memorize the text book and do every problem in it, because that's exactly what your General Studies classmates will be doing. This results in midterms with a mean of 96% and NO curve. I was one of the few lowly undergrads in this class, and have never been more frightened of my fellow students in my entire academic career. \nIf you're a world-class orgo whiz or have ample time to compete for a good grade with eighty hungry pre-meds only taking one or two classes apiece, I highly recommend taking organic chemistry with Dr. Doubleday. If you're a swamped undergrad who doesn't know Gilman from Grignard, RUN. \nWorkload:\nA dozen (not collected) practice problems per week, recitation quizzes that get dropped if they don't help your final grade, three midterms and a three-part final (and the lowest of the six parts gets dropped).\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "November 27, 2005",
            "review_content": "\nDON'T take it with him!!! There is no curve and when the average is a 71 that means most the class is getting screwed this semester.  He says everthing we need to know is in the book, but then we get our exams and it looks nothing like any problem in the book?  Take another section and save yourself the migraine\nWorkload:\n6 exams and one gets dropped....recitation quiz that doesn't need to count but could help your grade if the TA's weren't psycho\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "November 05, 2005",
            "review_content": "\nI loved Doubleday.  He was so nice and friendly and was there to help.  His lectures were fun.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "August 10, 2005",
            "review_content": "\nI LOVED this man and I LOVED this class!!!!  Don't let the other reviews scare you- this happens to be my most favorite teacher and class from the whole of my college experience (I will be a Junior) .  Meanwhile, I walked in on day one fearful that he would be this horrible teacher because of what all the other reviews said, not to mention that this is orgo and supposed to be the hardest of all the pre-med courses.  Not only did he prove me wrong, he was the most patient and helpful teacher I've had here.  He was great about answering questions in class and was sooooo wonderful with helping people during office hours (he stayed four hours with me once before an exam answering every single one of my questions).  He really cares about our understanding of the material and wants to help us do well.  He even reserved friday classes for doing very helpful problems he posed on the blackboard.  The best was that he posted a whole bunch of his previous exams on courseworks so that we could do them, make sure we truly grasped the concepts and had practice with them, and so we would know what to expect on the actual exam we were to take (i wish every teacher did this- what's so bad about being prepared and knowing what to expect!).  True, he can be a bit quirky and his explanation of some of the latter material was a little unclear, but he was so nice and so helpful that as long as you put in the effort (and make sure you do), you should be fine.  Also, even though there isn't a curve, I felt so prepared for the exams that it didn't matter much.  Plus, his lectured were great and allowed me to truly visualize what he was talking about.  I ended up getting an A+ and thoroughly enjoying the class, the teacher and the material. The only real negative was that the author of the textbook spent more time warning the readers to study than actually explaining the material to be studied!  Nevertheless, Prof. Doubleday's great instruction more than made up for any inept textbook explanations.  Definitely take Orgo I with this man!\nWorkload:\n3 midterms and a final composed of 3 exams-  one of the exams is dropped, leaving five exams each worth 20% of your grade.  The tests are very fair and he gives partial credit.  Still, the questions are challenging and you should definitely practice and make sure you are well prepared. The final was long and challenging, but doable.  This is one of those classes where all your work pays off and you finish feeling satisfied and loving all you've learned.  Also, no extra homework, hand-ins or quizzes!\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "July 13, 2005",
            "review_content": "\nThis guy is a terrible teacher. It wasn't even worth going to class.  I just read the book over and over and over again. The only good thing I can say about this class is that studying the text book  will allow you to pass. If you can, avoid this man's class at all costs. If you do have to take it, forget lectures, get some extra study books, and do the practice exams he posts online a few times. \nWorkload:\n3 midterms and a final from hell that is worth most of your grade\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "May 18, 2005",
            "review_content": "\nSo what can I say to be somewhat civil towards the worst Professor I have ever had in my life?  He told us the first day that attendance was not necessary because everything will be in the book.  Then we witnessed his HORRIBLE lecturing abilities. He spent half of the class period worrying about the appearance of his chair conformation than making sure we understood the chemistry.  You could dream a more effective orgo lecture sleeping in than attending his class.   By the middle of the semester there were less than half of the class that actually went to class.  Trust me and take someone else!  The class was so bad and there were no curves. I felt like I taught myself everything I actually learned.  I love chemistry and I want to major in chemistry since highschool but if I have to take another class with this man I will change my major.... NO JOKE!\nWorkload:\n3 mid-terms....and a MASSIVE final that is worth most of your grade\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "May 18, 2005",
            "review_content": "\nProfessor Doubleday is among the worst professors I have yet to have.  Although he seems rather friendly, as a teacher he fails to present the material in a comprehensive manner.  After taking his course, I do not feel I have any understanding of Organic Chemistry.  I would not suggest taking his course unless there are no other professors offering it.  \n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "May 04, 2005",
            "review_content": "\nFirst and Foremost, I can honestly say I do not remember the last time I went to class.  I remember the first day of lecture, first he tells us that everything that we will be tested on will be in the book.  Then we all witness his lecturing skills.  He is very disorganized and does not know how to lecture properly.  When I went to office hours to ask a question, he answers everything but the question.  I feel that for a professor to be successful in teaching, they have to have a passion for what they are professing and also a passion for teaching.  Doubleday has neither.  I most def. reccomend that you take a class with another professor!\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "April 07, 2005",
            "review_content": "\njust say no kids- he is a nice enough man but our class is getting killed this spring semester (even though it was smooth sailing to an A during Fall semester)- and let me tell you, when the mean is a 67 and the dude doesn't curve that means that about 75% of the class is completely and totally f'ed- either we are all stupid or he simply can't teach 2nd semester orgo in a way more than 20 kids in the class can understand-- take Nuckolls or Leighton.\nWorkload:\n3 midterms (2 dropped), 6 recitation quizzes (2 dropped), 3 part final.\n"
        },
        {
            "course_name": "Organic Chemistry II BC3231",
            "review_date": "January 05, 2005",
            "review_content": "\nIf he knew how to use the technology to write on all 6 boards at the lecture hall, he'd be a great teacher. He wanders off sometimes, causing your notes to be a little messy, but if you follow him and take the text as your bible, you'll find learning orgo not too hard. You need a lot of self-discipline to get this, unless you are just an O chem genius. \nWorkload:\n3 midterms, final exam made of three midterms. \n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "January 04, 2005",
            "review_content": "\nProf. Doubleday is a very nice man. He seems to want his students to do well, and he probably does some really important research. However, he cannot effectively teach orgo. His lectures are all over the place, he fills the boards with pieces of reactions that you have to later decipher on your own, and he simply is not clear in his explanations. The only good part is that he follows the book (horrible though it may be) page by page, so you will be able to teach yourself the material. Simply put: this class was an extremely frustrating experience for me, both sitting in lecture and the long hours I spent teaching the material to myself. I ended up doing well in the class because I taught myself the material - so you can too.\nWorkload:\nProblem sets on each chapter which are not collected, and which are harder than the exams. Do them!  Once you've mastered the material, his exams aren't that bad. My tip to you: read the book and take notes on it. Use both the book and your lecture notes to study (and of course do a million problems). Good luck!\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "December 29, 2004",
            "review_content": "\nIt is easy to get lost in Doubleday's lectures, or to forget the point of what he is explaining.  He does not offer insight into complicated mechanisms unless there are specific questions from the students.  The emphasis of his exams are on text book material, and he often shows incorrect mechanisms on the board because \"that's how Jones explains it.\"  Although he clearly loves chemistry, he has difficulty making his student's excited about it because they are often too confused to appreciate what they are learning.\nWorkload:\nno mandatory problem sets.  three 100 pt. midterms.  one final which counts as three 100 pt. exams.  the lowest exam grade is not counted.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "December 29, 2004",
            "review_content": "\nI disagree with the negative reviews of Professor Doubleday. I can understand why some people would dislike his lecture style, it can be unorganized and have strange periods of silence while he's trying to collect his thoughts, however I thought the material was very understandable and do-able. The reactions were not very hard, and the class was mostly memorization. I may not be the most impartial person because I love orgo, but I think it's important to let people know that the class is not impossible.  The exams are very similar to the practice exams that he gives to the class, there are no surprises in the exams, and Doubleday is very accessible during his office hours and can explain things very well if you ask him to clarify something.\nWorkload:\nThree mid-terms and a final split into three exams, and he drops the lowest of the six grades. There are problem-sets for each chapter, but I didn't think that they were really necessary. He gives five practice exams for each mid-term and I thought that was generally enough to study from. I hardly ever looked at the text book, and studied almost exclusively from class notes.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 24, 2004",
            "review_content": "\nHe doesn't go in depth about very many subjects. I didn't feel like I learned nearly as much as in Orgo I. On the plus side, this class is much easier  than Orgo I, and I felt emphasized memorization way more than application.  \nWorkload:\nFair. Just do his old practice exams and book problems. Sometimes he takes test questions from them!  Problem sets were harder than his actual tests. TAs were no help; don't even bother.  DD can be helpful @ office hours. He's very accessible.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 16, 2004",
            "review_content": "\nAlthough he is passionate about the material and appears to be knowledgable, Doubleday is one of the worst orgo professors on campus. As an undergraduate pre-med student who works hard and receives good grades in most science classes, I want to say with some authority that his class will make you dispise orgo. There is no curve! WTF, no curve in a science class, especially in orgo? Surprisingly, people do earn about 90 points on the exams, mainly the bright post backs and a few undergrades. Also, the number of stupid post backs clearly out number the bright ones. A plethora of annoying questions alway interupt each lecture.    \nWorkload:\nForget it. Don't take the class. \n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "July 16, 2003",
            "review_content": "\nBy far this was the worst premed class I ever took at Columbia (even worse than Gchem).  I went to office hours once to ask questions about a lecture, and I left feeling incredibly stupid.  Doubleday made me feel as if I was wasting his time, and he was incredibly arrogant in answering my questions.  Take someone else if you can for Orgo.\nWorkload:\nyou basically have to learn from the book.  3 exams plus a not too bad final\n"
        },
        {
            "course_name": "Organic I & II",
            "review_date": "May 13, 2003",
            "review_content": "\nSo, he was great first semester. Prof. Doubleday had this knack for demonstrating really foreign concepts and making them clear.  But then second semester things changed because [CULPA CENSOR] He'd come to lectures and spend more time pausing and sighing or running frantically from one end of the chalkboard to the other than he spent teaching.  Of course, he's a really nice guy who actually feels passionately about organic chemistry.  Now, whether that's a good thing or a bad one is your call.\nWorkload:\nNo homework.  No recitation that's mandatory (PS: TAs for this class were laughably bad both terms.)  Three (3) 100pt midterms; final is structured to be three (3) 100pt tests.  One (1) of these six 100pts is dropped. \n"
        },
        {
            "course_name": "Intro to Organic Chem I",
            "review_date": "November 19, 2002",
            "review_content": "\nnot many people know about doubleday. good prof - teaches the important parts of every section well in class. he answers questions (and there are a lot of stupid ones since there are post bacs) well too. his motto is \"if it's not in the book, i won't test you on it\". pretty sweet when you consider how much extra info he could be dumping on you. plus the class is gs so it's in the evening. gives you previous exams for practice and his tests follow the same format. a good and fair teacher, fair exams, good partial credit if you're ta is cool, but the class is NOT curved, but 1 exam is dropped. the only bad thing is that it's full of post bacs and unless a scheduling conflict happens so that all the seas bme kids are in the class too, you'll be the only undergrad out of 150 post bacs who only take 2 classes, sponge off mom and dad, and complain about how much work they have to do. they tend to do really well in the class, but there's no curve so it doesn't affect you at all - but you do have to sit through their inane questions. \nWorkload:\noptional problem sets for every chapter and an optional recitation. 3 - 1 hr midterms, 1- 3 hr final, the lowest \"hr\" (exam) gets dropped. to at least pass, do the problem sets at some point before the exams and go to every class.\n"
        }
    ]
}