{
    "prof_info": [
        {
            "prof_name": "Susan Thames",
            "prof_id": 937,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style II",
            "review_date": "November 14, 2006",
            "review_content": "\nI don't understand why there are more negative reviews of Susan than positive. I loved her class, even more than Structure and Style I, which I loved as well. She does show a little more of her own opinion than I have seen other writing teachers do, but still lets everyone else contribute to the discussion, so this is not a problem. In fact, not being afraid to voice our opinions created a very open and warm class environment. She was extremely helpful to me personally, and seemed to show real interest in our work, outside of just leading the workshop. I found her perspectives on things interesting; she also often recommended things for us to read that related to discussions in class. She was tough and sweet in just the right mix, opinionated but not domineering. I hope I can work with Susan again in the future.\nWorkload:\nOne piece every week (I really generated a lot this semester), some extra readings which she phased out, portfolio at the end\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 19, 2003",
            "review_content": "\nAllowing students to critique each other's work was a positive aspect of this class, because the ideas of many were able to be expressed instead of a professor having a narrow-minded approach to the class. She seemed to be partial to some works over others, although she said that she wasn't.  The \"class dating\" approach worked really well IMO, because the students got to  know about one another and it make the environment much more conducive to improving and getting along. \nWorkload:\nweekly readings and one writing assignment per week, and a portfolio at the end of the semester\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "February 03, 2003",
            "review_content": "\nA- for arrogance.  Unfortunately I realized this when it was too late to drop the class, namely the second week.  The first week I thought: Oh wow, a crunchy old dyke with a tattoo: I didn't think sacharine, I thought spacey; I didn't think arrogant, but opinionated.  Basically, if she doesn't like your kind of writing which is anything that isn't AIDS/RAPE/INCEST (i.e. nature, in her eyes) related you're fucked, and trust me, you don't want that.  Prepare to hate the students she favors--they are often just as self-absorbed as she is.  This is a particular breed of arrogance which doesn't stem from intelligence or mental masturbation like Conan O'Brien's does--it's quite humorless. Writing for this woman is like throwing shit against the wall. What a lovely wall, she'll say. But wait, what's that smell?  Not me, is it? No, this is just not me! But never fear: It's not so much a grades issue, so don't worry if you too made it to the add/drop date before realizing what i did, you'll get a lot of writing done, and  comments in response that will be easy to laugh off--which is harder to do when one has a teacher who is capable of formulating opinions and ideas about anything more than two inches from herself.   That's where the minus comes in.\nWorkload:\nI got a lot of writing done in this class which was important to me. One \"thing\" per week.   \n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "December 25, 2002",
            "review_content": "\nAbsolutely incredible. Susan is both tough and caring at the same time. If you want theory or a regimented writing class, this class is not for you. There is little structure-you are basically free to write whatever you want within the genre, and Susan will give you helpful comments. The class is largely up to the students-Susan encourages free discussion and most time is spent critiquing each other's work. She's not embarrassed to discuss any subject, and cares about and encourages her students as both writers and as people.\nWorkload:\nvery light, interesting reading. 1 assignment due each week, you have to workshop once a month, and hand in a portfolio of 4 revisions at the end. You also go on a date each week with a classmate, to get to know them.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "May 17, 2002",
            "review_content": "\nSusan is your stereotypical head in the clouds writer who has a lot of ideas about writing and what a writer should be. Unfortunately she doesn't seem to be open to other ideas, though she claims to be a very open minded person, it is obvious that she comes from a very flightly background. Her classes are good though she obviously plays favorites giving over an hour to workshopping poems of people she likes, and spending fifteen minutes on other people's poems. The people who like her did like her, but they tended to write about sappy emotional subjects. If this is not your area of interest don't take her class. Her comments are marginally helpful, though often they just reflect her inability to step out of her \"writers\" box. \nWorkload:\nThe workload was also large with a short story, or poem or dramatic piece due everday. Her grading was fair if you consider it on a curve, but if she doesn't like your type of writing, you will not get above a B.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "January 23, 2002",
            "review_content": "\nMore or less the way you imagine the class to be, people sitting around a big table reading each others work .... which ranges from more garden variety coming of age type work to work that you can't believe people of our age wrote. Sometimes the class felt like group therapy- Susan (never Professor Thames, always Susan) goes around at the beginning of class and asks you individually how you're feeling and asks if you had a \"date\" the previous week- as for that, she wants you to hang out with a person in the class outside of class every week so that you all know each other better- an eccentric idea that can lead to many an awkward moment but can also make the peeps in the class more comfortable with each other. Susan is really good about leading discussion and getting peoples criticisms and compliments out without naming them as such (which part of this work is most effective? Least effective?). Her comments are often helpful, she picks up on the things you thought nobody would pick up on. She can be blunt but that's fine, she mixes it with equal parts of sweetness and it's better than being coddled. the semester is divided into three parts: poetry, playwriting and fictionwriting, with one assignment in whatever genre you're in every week. The class itself is not that hard- you just need to take it seriously and say stuff in class. And how hard can that be when all you have to do is say what parts of a poem you liked or didn't like and why? Overall, i would definitely recommend her class. You've got a ton of freedom here, and if you're motivated enough about using it and pushing yourself, Susan will notice. \nWorkload:\nOne assignment per week, portfolio due at the end. \n"
        }
    ]
}