{
    "prof_info": [
        {
            "prof_name": "MIchael Teitelman",
            "prof_id": 1340,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 07, 2005",
            "review_content": "\nProfessor Teitelman was great! I really enjoyed the class and feel like I got a lot out of it. Teitelman is brilliant and gives a lot of  useful background information on the readings, which made the works a lot more accessible. His class really challenged me and was definitely one of my favorites at Columbia. Overall, if you can get into his class, definitely do. \nWorkload:\naside from the reading, not bad. 2 4-6 page papers; we got the paper topics for the midterm the night before, making it very wasy. The final was a bit more challenging but still not impossible.  The grading is very fair and office hours are also very useful. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 11, 2004",
            "review_content": "\nA very disappointing professor/class.  He actively stifles discussion and does not respond to students' comments; he definitely believes that his students have nothing to add to the class.  His lectures are full of irrelevant tangents, and his lack of notes shows.  No break.  He is to be avoided.\nWorkload:\nFair; weekly reading responses and a couple papers.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 13, 2003",
            "review_content": "\nGreat professor with an absolutely amazing amount of contextual knowledge, making the books come to life. Quite tolerant, very casual and nice, and somewhat an easy grader. Classes focus on the \"big picture\" rather than specifics and are more interested in understanding the authors' arguments than being critical, which I guess is why CC is called a survey course. Overall, highly recommended.\nWorkload:\nAbout 10 reading responses (typically 1-3 questions) due before class that again focus on the big questions and require a little thinking to summarize the texts. Also help you focus on the issues to be discussed in class. The RRs are really to spread out the workload throughout the semester and so for your own good. Midterm was cancelled indirectly because of snowstorm; final was challenging but not impossible. Plus two 5-page papers.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 19, 2003",
            "review_content": "\nThis man was a mess! When classes first started, I was so happy because he seemed like an easy professor. But, beware! He's been out of the teaching field for 20 years so he's a bit rusty and goes on these REALLY long, and mostly useless tangents. We spent 2 whole days talking on feudalism. Guess how much that appeared on the midterm and final. Get my drift? He also has his \"favorites\" in the class, and after he's chosen them, forget about getting a chance to speak in class. It's in one ear, out the other. BUT, all in all, he is a really easy grader, so if that's all you want, then he's not so bad. I can't say I got very much out of this class, despite all the acclaim CC gets. \nWorkload:\n3 papers (5-7 pages), 1 midterm, 1 final. The final was ridiculously difficult. The midterm was a joke. I don't know what he was thinking. We also have 6 reading responses (1 page or so), where he provides questions for you to answer pertaining the reading. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 11, 2003",
            "review_content": "\nIf you're looking for a good CC teacher, Teitelman is your man.  Friendly, inciteful, intelligent...a nice guy who cares about his students.  Classes are relaxed, with a tangent here and there, but still informative.  I really feel like I learned about the books through his teaching of the course\nWorkload:\nStandard...2 essays, reading responses, midterm, final...and he's a pretty easy grader, \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 13, 2002",
            "review_content": "\nProf. Teitelman came back to teach CC after twenty years away. I loved... LOVED... him for the first half of the semester, but then I started to question why, exactly, he was teaching the class. Ultimately, it seemed like he was teaching it for himself, not for us. He's very scatterbrained, and classes are sort of all over the place. At the same time, he's really brilliant, and classes were definitely fun, and he's a very very nice guy. He frequently espouses his ultra-liberal beliefs in class, and allows others to do the same. He also calls on the class-pedants all the time, and will skip over intelligent people who have something to say. He's also pretty bad with emails, always comes late to office hours, and is relatively unreliable. However, if you can deal with all that, he's really an awesome teacher, that fully comprehends all of the texts, and places them in their historical context. \nWorkload:\nSix of Eight \"reading responses\" which are 300-600 words, and you basically just have to regurgitate what the readings said. Two papers. MIdterm. Absolutely brutal final.\n"
        }
    ]
}