{
    "prof_info": [
        {
            "prof_name": "Sharon Hoffmann",
            "prof_id": 10720,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 05, 2013",
            "review_content": "\nI don't know if Sharon is ever going to teach this class again, but either way, she deserves a good review.\nGood discussion leader who actually manages to make a somewhat pointless class actually interesting without making it a time sink. She does a few things differently from most sections that greatly improve your FoS experience. She announces quizzes three weeks ahead of time, lets you hand your assignments in at the end of the week, rather than during the seminar, drops TWO of the ten, and reduced the paper from 2000 to 1500 words. She also allows for plenty of extra credit opportunities (though I don't think it mattered much in the end). Although she was somewhat slow in grading, she more than made up for it in quick responses and feedback to anything you had to ask both during and after class. People who are science majors may be put off by the fact that Sharon entertains every question, no matter how basic, but it's no worse than what you would get in other sections.\nGrading-wise, she's really fair. The SD for the midterm in our class accurately reflected the range of scientific backgrounds, and overall, grading was not harsh at all as long as you wrote a decent amount. My one complaint was that she wasn't very clear about letter grading, even when I asked. Most of the other sections have 40-45% in the A-range, so I can only assume. We also never got our final scores. Sharon is much more concerned with how much we learn and get out of the class though, so it's understandable. Overall, great section leader, and I hope she gets tenured soon.\nWorkload:\n8/10 short answer homeworks graded on completion, 4 quizzes - you're guaranteed at least an 8 even without the reading, midterm (long), final (fair)\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 21, 2011",
            "review_content": "\nI really hated Sharon at the beginning of the term, but she did grow on me. She was nice, understanding, and a generally good person to be around. She grades a little harshly, but she'll make up for it in the end - she wants her students to do well. She is a bit awkward sometimes, but generally she's OK. I can't say what other FroSci professors are like, but Sharon was totally fine/adequate. She also gave us a break to get snacks mid-class. Much appreciated.\nWorkload:\nnormal stuff for frosci\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 11, 2011",
            "review_content": "\nSharon was a new prof but totally great.  She is fantastic and incredibly enthusiastic about science, and even if you totally hate science she will at least get a few laughs out of you. Occasionally she is awkward in class, but that was partly due to a class that didn't talk too much, Really helpful if you need it, always willing to make time to explain things to her students.  If you get her as a teacher for frosci, keep her.\nWorkload:\nStandard frosci stuff, reading, lecture, WIA, midterm, final.  \n"
        }
    ]
}