{
    "prof_info": [
        {
            "prof_name": "Bethany O'Shea",
            "prof_id": 3503,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 22, 2009",
            "review_content": "\nOK, everyone knows Frontiers is crap, but having Beth isn't so bad.  She's very friendly and her Australian-ness is a lot of fun (she brought us \"fairy bread\" once: buttered bread with sprinkles).  Just get through Frontiers and be nice to Beth.\nWorkload:\nShe definitely grades harder than others, but her personality makes up for it.  She's also very helpful during outside of class.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 21, 2008",
            "review_content": "\nBeth is a pretty good seminar leader, compared to the horror stories I heard. To be quite honest Frontiers sucks as a class overall, I hate that it is a part of the core. I myself am not a math or science person at all. And Beth's grading can be pretty tough and the material can be overwhelming. I will give her this...she is very approchable and flexible in finding time to meet with you. I wish I had more time so that I could actually show up to her office hours. She grades the homework a little hard, but its usually shorter than other classes' assignments. I really wish I knew what was going on with the material in this course half the time. Beth was pretty interesting, even when the material was boring she tried to make it fun. Overall if you get her you are lucky to have an fun seminar leader who has a cool Australian accent...but she can be an extremley tough grader. \nWorkload:\nWeekly Homeworks (that get annoying) and she grades hard, \nWeekly readings that are often boring but necessary to help understand lecture and seminar. \nShe gives random pop quizzes to see if you went to lecture.\nAn impossible midterm\nAn O.K. Final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 09, 2008",
            "review_content": "\nBeth is an interesting professor with a fun Australian accent who acts enough like a kid that you won't be too bored in class. Frontiers as a course sucks but Beth isn't too bad at doing seminar. She seemed to grade a little tougher than some of the other professors but that may be because she went over the material pretty well in seminar so she expected more. I've heard much worse things about other people's professor so I think Beth turned out to be a pretty good choice. She is very approachable and not intimidating at all so if you don't understand something you can ask her very easily.\nHowever, her curve is not very generous so you might actually have to understand the material to do well. Hope that you don't get a very good group.\nWorkload:\nhomework every week, a reading most weeks, midterm and final both graded by her a bit tougher than other professors (so i've heard)\n"
        }
    ]
}