{
    "prof_info": [
        {
            "prof_name": "Margaret Ellsberg",
            "prof_id": 287,
            "total_reviews": 48
        }
    ],
    "reviews": [
        {
            "course_name": "Literary Approaches to the Bible",
            "review_date": "May 13, 2016",
            "review_content": "\nI loved this class. Professor Ellsberg isn't so great at staying on topic, sure, but she is the most caring, wonderfully funny, and knowledgable professor. Coming from a religious background myself, I learned a lot about the Bible and hearing her views on the subject was fascinating. Class discussions were terrific, and her writing tips and grading was super helpful. I look forward to taking more classes with her. She's great. \nWorkload:\nPretty easy; about 5 essays, all short in length. Lots of reading, but it's super interesting, so it's totally worth it. \n"
        },
        {
            "course_name": "Major English Texts II",
            "review_date": "September 10, 2015",
            "review_content": "\nProfessor Ellsberg was one of the most humane, full of life, kind, creative, and interesting teachers I happened to meet in my time at Columbia. As an international student, I came having very little knowledge of English poetry and literature. Professor Ellsberg opened my eyes to this world, and turned her class into my favorite part of the week. \nI also loved Professor Ellsberg's choice of readings, like Jane Eyre for example. However, she was so easy going and wanting her students to enjoy the class that she would jokingly tell us we could watch the movies for assigned readings if we ran out of time. Essentially, we never got tested on the content of the readings so they were really only used to enrich our knowledge and love of literature. \nTo say her tests were fair game is an understatement. Professor Ellsberg's tests consisted of quotes/passages she took directly out of poems we read in class. EVERY single quote was taken out of a poem she told us explicitly would be on the exam. Therefore, if you became familiar with the poems she mentioned would be on an exam you could easily ace it.\nIn short, take this class - you will not regret it!  \n\nWorkload:\nVery minor - 2 500 page papers, 1 midterm, 1 final. \n"
        },
        {
            "course_name": "Major English Texts II",
            "review_date": "September 10, 2015",
            "review_content": "\nProfessor Ellsberg was one of the most humane, full of life, kind, creative, and interesting teachers I happened to meet in my time at Columbia. As an international student, I came having very little knowledge of English poetry and literature. Professor Ellsberg opened my eyes to this world, and turned her class into my favorite part of the week. \nI also loved Professor Ellsberg's choice of readings, like Jane Eyre for example. However, she was so easy going and wanting her students to enjoy the class that she would jokingly tell us we could watch the movies for assigned readings if we ran out of time. Essentially, we never got tested on the content of the readings so they were really only used to enrich our knowledge and love of literature. \nTo say her tests were fair game is an understatement. Professor Ellsberg's tests consisted of quotes/passages she took directly out of poems we read in class. EVERY single quote was taken out of a poem she told us explicitly would be on the exam. Therefore, if you became familiar with the poems she mentioned would be on an exam you could easily ace it.\nIn short, take this class - you will not regret it!  \nWorkload:\nVery minor - 2 500 word papers, 1 midterm, 1 final. \n"
        },
        {
            "course_name": "Ethnicity and Social Transformation (First Year Seminar)",
            "review_date": "January 20, 2015",
            "review_content": "\nThe texts were all right, but my experience was overall not so great. \nProf. Ellsberg was consistently 5-10 minutes late, and a bit disorganized as well. She often went on long tangents that, while interesting, had nothing to do with the class. Consequently, we spent maybe 20 minutes per class actually discussing the reading, which was incredibly frustrating for me, and we were way behind schedule. Additionally, she often forgot whether she had handed back papers or not (usually the answer was no), and she never knew any of our deadlines (literally we'd all have our essays and ask whether she wanted them at the beginning or end of class, and she'd sometimes seem surprised that they were due that day).\nShe often made the class environment feel unsafe for several students of color, myself included (I have not discussed this subject with the white students in our class, but on some occasions they were quite vocal about disagreeing with some of the casually racist things she said). I honestly don't believe that she knew the impact of what she was saying, but sometimes what she said was totally inappropriate and quite offensive.\nOn the upside, she didn't penalize us for her disorganization and tendency to run behind, adjusting her syllabus as necessary to fit. Additionally, she gave good feedback on our essays--I do believe that my writing improved over the course of her class. We workshopped several papers in class, with Prof. Ellsberg explaining her reasoning for making changes and often having us suggest changes by the end of the term, so we could do the same thing on our own as we wrote our papers.\nShe also had us take field trips to various museums around NYC on our own time, which I really liked. \nWorkload:\nNot too bad. The reading is a lot to do if you try to do it in one day, but it's not bad at all. The papers are all short (2 pages). You write two essays and one field journal (2-3 pages), along with revisions for each, and then a couple of book reviews.\n"
        },
        {
            "course_name": "First-Year English (Workshop): Legacy of the Mediterranean I",
            "review_date": "February 16, 2014",
            "review_content": "\nI am also writing this as an alum. While taking Freshman English, I also struggled with the eccentric Ellsberg, trying to figure out what she wanted and how to get an A in her class. The workload was easy and the class, it seemed, a breeze, a cop-out to the more difficult professors offering the course.\nNow as an alum (who majored in English and now teaches English) I can say conclusively, no one at Barnard helped improve my writing like Ellsberg did. She was brilliant, teaching us to cut the self-important, self-indulgent \"intellectual\" nonsense out of our papers and condense everything into two pages. She taught us how to cut the superfluous out and say what you need to say as effectively and concisely as possible. She taught us that good writing was easy to comprehend, effective at conveying a point, and free of pointless popcorn words. \"Simplicity is genius,\" as Einstein said, and Ellsberg taught us how to apply that to our writing. Super grateful I took her course and highly recommend her. Sure she was late sometimes, went in tangents, etc but she was so effective and taught us so much, I have no complaints.\nWorkload:\n2 page papers. Regular reading per week.\n"
        },
        {
            "course_name": "Major English Texts II",
            "review_date": "August 16, 2013",
            "review_content": "\nFull disclosure: I am a Barnard alum. I graduated in 2011. I'm writing this review tonight because I stumbled upon my copy of Songs of Innocence and Experience in my bedroom and decided to read through it again.\nAs I read, I realized how clearly I could see Blake's London in my mind's eye: the grimy cesspool of repression and hypocrisy, the vast seas of filth siding up against glimmering palace walls, the tiny children with their shorn heads and lungs full of soot. And then I remembered Byron, and Shelley, and Hopkins, and Eliot, and the Brontes, and I remembered that it was Prof. Ellsberg who brought all of this work to life for me.\nI was a Biology major at Barnard. But you know what? I think Prof. Ellsberg's class was the most important one I took. It's certainly the one I remember the best, and the only one whose material I expect to revisit from time to time for the rest of my life.\nIt truly saddens me to see so many negative reviews of the course on here. Perhaps Prof. Ellsberg is different in seminars, but in my experience, she was never very late to class, and though her lectures were rambling, she rarely talked about herself. She was far more likely to plumb the depths of her IMMENSE knowledge of literature and history and bring in a ton of interesting stories and quotes (she seems to have adhered to the old-fashioned tradition of memorizing a large amount of texts by heart, which I find very noble). \nI'm confused as to why so many people were disappointed with this class, and all I can guess is that perhaps they weren't really letting the work into their heart. I certainly saw a lot of my classmates blowing off even the minor workload. Our final assignment was to memorize a poem, and most people chose Blake's \"The Tiger\" or \"The Lamb\" and could barely even get through those. If you're not going to respect the material, well, of COURSE you're not going to like the class.\nIf you're the kind of person who loves to see history brought to life through literature, take this class. Go to every lecture. Listen. Let this beautiful work into your heart.\nOh, and my final poem was Hopkins's \"Spring and Fall.\" I still remember every word.\nWorkload:\nVery light, but that's as it should be. This class is about intellectual curiosity, not pointless drudgery.\n"
        },
        {
            "course_name": "Literary Approaches to the Bible",
            "review_date": "January 31, 2013",
            "review_content": "\nI find myself in a continual crisis of faith as to the legitimacy of my will-be-broke-forever college loans. A good 90% of this crisis was due to taking a class with Ellsberg. Now, I'm quite fine with discursive egomaniacal professors as a rule: at least thus far in my collegiate experience, they've tended to be intelligent and knowledgable enough that I learned as much from their tangents as from their actual lectures. Ellsberg, however, although she is no doubt intelligent, ONLY LECTURES ABOUT HER SINGLE FAVORITE TOPIC. That topic is MARGARET ELLSBERG. Anyone interested in actually learning things about, I don't know, say, Literary Approaches to the Hebrew Bible, FLEE WHILE YOU STILL CAN! I'm serious.\nA final note: the other students apparently don't care that she she apparently doesn't care about teaching her students, because they apparently think she's funny and charming. Weird. Also, she's freakishly easy because it's a seminar and she does all the talking. So expect a bunch of \"disagrees,\" and take her if you want to learn absolutely nothing.\nWorkload:\nHa! Who discusses the assigned books in a SEMINAR CLASS these days, anyway? So passe.\n"
        },
        {
            "course_name": "Major English Texts",
            "review_date": "November 15, 2012",
            "review_content": "\nTake this course because Margaret Ellsberg is a really nice, funny, intelligent professor who knows her readings. The course is not hard at all and can be quite entertaining. The professor often comes to class late (by late I mean 10-15 minutes) but its probably because she's printing off 100+ quiz sheets.\nNotetaking in class isn't necessary but it does help because she sometimes includes random facts/info that she says in lecture in her quizzes. All quizzes are graded in class by your peers. You must write them in pen and any crossed off marks will be counted as wrong (to prevent/minimize cheating). A crossed out answer is only ok if you ask her during the quiz. This year, due to the hurricane and cancelled classes, recitation was optional/extra credit. You basically need to memorize and recite a few lines from any text that you had to read in class in front of your peers.\nAll in all, take the class!\nWorkload:\n8-10 pop quizzes, 1 3-4 page paper, 1 recitation, no midterm/final\n"
        },
        {
            "course_name": "Major English Texts II",
            "review_date": "April 25, 2012",
            "review_content": "\nThe best class I've ever taken. More than manageable, great way to fulfill your literature requirement, and you leave actually learning a lot. I always enjoyed her lectures; she is hilarious and brilliant and wants you to leave with a \"treat bag\" of knowledge that you can pull out at a cocktail party. This isn't the class for you if you want to learn how to analyze poetry. This class is more about learning to identify the most famous English poets, their most renowned works, and fun/interesting facts that will make you never forget them. You learn references that you will always be able to use and are forced to memorize them because of the quizzes. The quizzes often repeat poems; there are certain works she wants you to remember and so they will show up on many of the quizzes and she stresses them in her lecture. Ellsberg also always throws in her own anecdotes that always make the class laugh. TAKE THE CLASS. Did I say take the class?\nWorkload:\nReading that is not necessary. Go to class- you need to know the poems she references (and only those) for the quizzes. There are 10 pop quizzes that are identifications of lines from poetry (12 questions long, it is possible to get 120 on them). She drops your two lowest. One 3-4 page paper. One recitation (memorize a poem and say it aloud). \nThe workload is great- just come to class, take notes, and review them before each class so you are ready for the quizzes. Great class, you learn a lot. All you need to do is make sure you do well on the quizzes (most people do).\n"
        },
        {
            "course_name": "Ethnicity and Social Transformation (First Year Seminar)",
            "review_date": "April 03, 2012",
            "review_content": "\nAVOID HER.  Given the nature of the seminar (integration of everyone into America, acceptance of diversity), you'd think this class would reflect the same. Yeah right.\nThe things Professor Ellsberg says are beyond inappropriate for a classroom setting, and just in general.  She will constantly throw out racist jokes and comments that make the entire class uncomfortable. It is ridiculous that she is even employed here because she's gotten so many complaints and bad reviews.  But unfortunately, she created the seminar and has been at Barnard too long for anyone to fire her.\nShe has her \"Five Great Writing Laws\" that are absolutely ridiculous. The most ridiculous one? You're not allowed to use the verb \"to be\" in any of her essays. Uh..that's the most common word used. Ever. You won't learn any writing techniques because the whole time you will just be scanning your paper for any \"is\", \"was\" or \"being\"s and looking up synonyms in the thesaurus.\nShe's always late to class, I didn't learn a thing, and now my impression of the English department at Barnard is forever tarnished.  She goes off on too many tangents about her life, her beloved horses, and her successful children.\nThe only good thing about the course is that it was in-residence, so I got to know the girls on my floor quite well, especially since we suffered together. Oh, and her crazy outfits are always amusing. But that's pretty much the extent of it.\n\nWorkload:\nNot bad, read a couple books. 4 essays, no more than 2-3 pages each. Some field trips, which were fun.\n"
        },
        {
            "course_name": "Ethnicity and Social Transformation",
            "review_date": "January 22, 2012",
            "review_content": "\nI had the misfortune of being assigned Professor Ellsberg for my First-Year Seminar. If you are looking for a \"blow-off\" class and you get Peggy, you're in luck. \nShe is never on time and is rarely prepared for the lesson (leading her to run off and make copies, which wastes even more time). She is highly self-righteous and brags constantly. It is not without merit, as when she does buckle down and teach, she is a brilliant woman. However, this is all veiled by her inability to stay on topic, leading interesting discussions to be lost due to her tangents about her kids (and their many achievements) and other irrelevant information.\nSome of the reading you are supposed to do is never discussed, leading most people in my class to often skip it or fall behind (which is unfortunate as they are great texts). You'll spend the first fifteen minutes of class listening to, dissecting, and discussing a CD that each student makes of their two favorite songs. The relevance of this was lost on me, but it was a nice way to get to know the girls on my floor (This class was in-residence when I took it).\nWhile her workshopping and commentary on writing is excellent, she rarely gives back papers. I only got some of my papers back a few days before the final assignment was due. She is also very vague as to what she expects of your work. So if you feel like you're scrambling to understand what she wants, that's perfectly normal.\nI was pretty appalled when I found out that she has worked at this school for so long. Her lack of punctuality and inability to prepare for a lesson alone makes me wonder why I pay so much for this school. Also, she did not give us our grades until the second day of the next semester. \nI'm sorry to those who read this and have no choice as to who their professor is, but that's just one of the many failings of the FYE program. Basically, just take all her advice, participate, and write your essays using her guidelines (which in my opinion, remove all the individuality of the writer's voice). \nYou get to do some cool field trips, which is nice. But that's where my praise for this class ends. \nWorkload:\n5-6 novels, plus two movies, and a few short stories. Not terribly heavy considering you don't really have to read most of it. Skimming will do. 4 papers (one of which will be workshopped in front of the entire class). All of them are graded at the end of the semester. \n"
        },
        {
            "course_name": "Major English Texts I",
            "review_date": "December 14, 2011",
            "review_content": "\nProfessor Ellsberg was entertaining and interesting. She emphasizes the historical background of each of the texts and speaks a lot about the authors' personalities. I finished off the semester with learning a lot of new things I've never heard of before her class. The readings are interesting as well. Not too long or dense. You can just skim them. She gives about 10-12 pop quizzes through out the semester, which consists of ID's or random fact questions that she mentions in class, which is why it is important to take notes. She will even say what will be on the quiz. This was a great way to fulfill the literature requirement. While the pop quizzes might be annoying it definitely beats taking a 4 hour midterm at the end of the semester. \nWorkload:\nLight, short weekly readings, 10-12 pop quizzes (can drop 2 of them and each one equals to 120 points), 2 short papers (2-3 pages), and 1 recitation of a poem or sonnet \n"
        },
        {
            "course_name": "Major English Texts",
            "review_date": "November 16, 2011",
            "review_content": "\nquiz material is very unpredictable and unfair to those who actually read the texts. the workload is light, though, which is nice.\n\nWorkload:\nlight-2 papers, 10-12 quizzes\n"
        },
        {
            "course_name": "Major English Texts I",
            "review_date": "December 21, 2010",
            "review_content": "\nEllsberg is total mess. She is ALWAYS late to class, sometimes by 10 minutes, and i very confused. Obviously you can tell she knows a lot about English literature and the best moments in this class are when she delves into strange details or insights, but most often it is just incredibly lacking in structure and substance. The class works like a lecture, and she basically talks about anything that goes through her head, so it was not unusual to see her talking about her family or her time at Oxford, instead of actually focusing on the texts. Also, you will be reading an anthology and Wolf Hall, which is contemporary literature about medieval English; I believe it would be much more interesting to actually read medieval literature in a class on that subject!\nI didn't dread this class, as I could just go and text friends during the class, it most often didn't make a difference, especially if you had basically knowledge of medieval literature. Also, Ellsberg claims she can find some really smart conclusions from her language skills and would many times say things in French or German. Unfortunately she didn't really speak them that well and made big mistakes about the origin of words.\nWorkload:\nThe upside to all the chaos: the workload is VERY light. There are many quizzes during the year where you basically have to identify passages, which is very easy as we don't see many authors. There are two essays, TWO pages each, which are fairly graded.\n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "November 16, 2010",
            "review_content": "\nI took this class last semester and it was utterly disappointing. I don't think anyone in the class actually improved her writing. Mostly, we spent our time reading New Yorker articles and talking about the various dramas of the Professor's life--she is always late for some fantastic excuse. She doesn't ask much of us (10 typed pages for the whole class), and doesn't give much back either (she frequently loses papers and only returns them towards the end of the semester). \nIf you actually want to learn how to write, do not take this class. Also, don't take this class if you are a non-native speaker, have an accent, or are first-gen college. She will be condescending. Take this class if you want to engage in petty conversation about horses and whatever other anecdotal poo poo the class decides to share. It's a pity that she's teaching at this school.\nWorkload:\nhardly anything. \n"
        },
        {
            "course_name": "Ethnicity and Social Transformation (First Year Seminar)",
            "review_date": "April 06, 2010",
            "review_content": "\nShe was always late and constantly unprepared. But she knows her shit and has a lot of really interesting things to teach. My writing became much more concise because of her.\nIt's easy to get an A if you stay on her good side. She tends to ramble about random things,but just accept it and be entertained.\nShe wears the most absurd outfits ever and I'd recommend taking her class JUST to see the outfits. They are that crazy.\nThe essays are peer-edited and you get a grade at the end.\nShe was always late and constantly unprepared. But she knows her shit and has a lot of really interesting things to teach. My writing became much more concise because of her.\nIt's easy to get an A if you stay on her good side. She tends to ramble about random things,but just accept it and be entertained.\nShe wears the most absurd outfits ever and I'd recommend taking her class JUST to see the outfits. They are that crazy.\nThe essays are peer-edited and you get a grade at the end.\nWorkload:\n4 essays, all graded at the end of the term. \n"
        },
        {
            "course_name": "Major English Texts",
            "review_date": "December 28, 2009",
            "review_content": "\nProfessor Ellsberg is the most intelligent and entertaining professor I have ever had at Columbia. Unlike most professors at Barnard/Columbia, who seem to compete to have the most ridiculous and unmanageable workload, Professor Ellsberg focuses more on inspiring her students to enjoy learning about the subjects discussed in class. She is incredibly smart and engages her students in exciting facts relevant to the readings. Ellsberg is a rare entity at Columbia. I am a Sociology major, and have already taken 3 of her classes, just because she is so fascinating! If you are considering taking an English course at Columbia, definitely look to take something with her. You will not be disappointed!\nWorkload:\nVery manageable. Her goal isn't to overload you with pointless busy work. Instead all of her assignment (the few she gives) are aimed at improving your writing and reading skills. \n"
        },
        {
            "course_name": "Ethnicity and Social Transformation",
            "review_date": "December 10, 2007",
            "review_content": "\nWhile Peggy oftentimes went off topic in class, telling stories about her horses and show-poodles, it was okay, because this isn't the type of class where the professor lectures on a subject/information for you to regurgitate in a midterm/final. The basis of this course is to improve writing skills, not necessarily learn facts (although I did learn a lot about immigration, ethnicity, etc). And Peggy really does an amazing job at improving your writing skills. the essays she assigns are short (like 2 pages), but that's only in order to focus on technique, grammar, style, and syntax. My writing improved dramatically from this course, and I looked forward to attending class because of how entertaining Peggy is. Seriously, take one of her classes just for the peggy experience. \nWorkload:\nmoderate; the books we read in class (6 in all) were books I would have read for leisure; the essays (usually two pages) were easy; workload less than many other classes\n"
        },
        {
            "course_name": "Major English Texts II",
            "review_date": "July 15, 2007",
            "review_content": "\nHorrible.  Disorganized, digressive, *always\" late.  You won't learn anything from her class.  Worst teacher I've ever had, including high school.  Only good point: she's an easy grader.\nWorkload:\nLighter than air.  She actually *encouraged* us to skim some of the texts instead of read the whole thing!\n"
        },
        {
            "course_name": "Major English Texts I",
            "review_date": "April 16, 2007",
            "review_content": "\nEllsberg is the single worst teacher I've ever had--high school or college.  I'm not even sure where to begin, but let's try...\nShe was late to 90% of the classes.  Usually quite late (5-15 minutes).  Often obscenely late.\nEvery class started with a long, rambling story that had nothing to do with literature.  On the day that we were to discuss Hamlet--you know, one of the signal works of Western literature, that Hamlet--she spent the entire *first half* of the class telling a story about her horse.\nOne day, she spent about an hour talking about the structure of fairy tales--even though it perilously little to do with the book she was \"lecturing\" on.  Then, a few weeks later, she gives *the exact same* talk on fairy tales, gobbling up another hour!  There was this surreal, twilight-zone feeling in the class: \"Wait, didn't she already talk about this...?\"\nShe didn't learn anybody's names at the start of the semester, but then, *halfway* through the semester, one day at the start of class she suddenly said, \"today I'm going to learn everybody's names!\"  But instead of just learning our names, she spent the *whole class* riffing on people's names and where they came from.  (\"John Doe, oh, I knew a Doe in such-and-such place once, what a guy, blah blah blah...\")\nThe whole of the writing is two two-page papers.  Easy, yes, but also kind of embarrassing.  But she has a lot of ridiculous, petty pet peeves about essay writing--which she springs on you *after* you've turned in the paper. Ah, almost forgot!--she returned the midterm *one week* before the final.\nShe made a number of factual mistakes in her lectures--\nwhich made my lecture notes totally worthless.\nPlus, the lectures were preposterously disorganized.  It's hard to say that there were \"digressions\", because \"digression\" implies a coherent central argument from which one digresses.  Is it possible to have speech which is nothing but digressions?  Ellsberg put this philosophical question to the test.  I finally started taking notes on my computer, and treated her lectures like a puzzle: the challenge was to use select-and-drag to assemble a coherent line of reasoning before class ended.  It wasn't easy!  It was like a super-hard kind of tetris.\nThe ID-only exams are a joke that certainly don't encourage any kind of careful reading of the texts.  And at one point in the semester, she seemed to actually discourage us from doing the readings, saying something like, \"You know, one of the great skills in life is to get an idea of a book without actually reading it...\" (wink, wink, nod, nod).  This came before one of our longer readings, and it basically amounted to telling us, \"Just forget about reading it!  Who cares?\"  Is this really what we're looking for at one of the most famous and expensive schools in the world?\nAnd generally speaking, Ellsberg is just a profoundly disorganized individual.  I don't know if there's some deeper problem, or what.  But she is a spectacularly terrible teacher.  Take a shambles, and then shamble it again, and then you have something almost as shambolic as Ellsberg's class.\nHer class made me ashamed to be a student at Barnard/\nColumbia.  One day a classmate invited a really bright friend, a smarty-pants undergrad from a prestigious school in England, to sit in on the class, and I just burned with shame at somebody seeing something so shameful associated with Barn/CC.\nI have no idea why this professor received any positive reviews.  Stay away.  Trust me.\nWorkload:\nAs much or as little as you'd like; it's all kind of a joke in the end.\n"
        },
        {
            "course_name": "Major English Texts I",
            "review_date": "January 17, 2007",
            "review_content": "\nA strange, yet entertaining professor. From the first class, she makes clear that she wants the class to be easy. There is a lot of reading, although truthfully you don't have to do much of it and she knows this. It's a lecture class, meaning there is little student participation. Ellsberg spends most of the class talking about the historical background of literary periods, or biographical information about the authors. Little attention is paid to the actual writing, though the class is still interesting. \nWorkload:\ntwo papers; midterm & final (not cumulative), both of which consist of IDs (naming the author and work of quotes from the readings); recitation of 14 or more lines from something read in the class \n"
        },
        {
            "course_name": "Freshman Seminar- Ethnicity and Social Transformation",
            "review_date": "November 12, 2006",
            "review_content": "\nGreat teacher!  She is funny and lively, and yes, known to go off on a few tangents every class.  She is very picky about grammar and is in love with Strunk & White's Elements of Style (buy it!).  She improved my writing so much and taught the class how to critically pick apart their writing and make everything succinct.  She is a little crazy, but that's what makes her so great.  We usually went around the class and read stories out loud or just talked about the great literature we read for this class. Take this class: great books, improves your writing, easy workload, fair grading. \nWorkload:\nA few short (2 page) papers on the reading, a fieldwork paper (travel somewhere in the city and write about it). Everyone in the class has one of their papers workshopped (read through paragraph by paragraph).  Can revise your essays, not graded when you first hand them in- fair grader.\n"
        },
        {
            "course_name": "Major English Texts",
            "review_date": "January 16, 2006",
            "review_content": "\nI'm an english major and I was very excited for this class.  I had already read half the material, but I thought the excitement of Prof. Ellsberg would add to my previous knowledge of the texts.  However, I found her to be a total nut-job.  She seemed to have decided to hate me for no reason, making fun of me in front of other students (insulting my intelligence, writing style, and general existance).  I knew she chose favorites, but I didn't know she chose students to hate.  She has a very distracted teaching style, chattering to herself across the classroom and back again.  She was also always late.  NOT WORTH THE ANXIETY!\nWorkload:\nA joke.\n"
        },
        {
            "course_name": "Ethnicity and Social Transformation",
            "review_date": "January 11, 2006",
            "review_content": "\nThis seminar was the most enjoyable class I have ever taken. In high school I received positive feedback about my writing and I have always considered it one of my strong points. Still, Professor Ellsberg made me realize right away that I had a lot to work on. More important, in a single semester with Ellsberg my prose improved far more than it did in the past four years combined. Her Â“Ellsberg Style SheetÂ” is the single most important handout I have ever received. Now, I seek conciseness above all, abhor Â“to beÂ” verbs (Â“TheyÂ’re boring! Interesting verbs carry the weight of your essay!Â”), and worship the serial comma. Ellsberg points out small, easy-to-fix details that improve the quality of writing considerably. \nOther than that, the books were fantasticÂ—Jhumpa Lahiri comes to mind, but we also read Philip Roth and E. L. \nDoctorowÂ’s RagtimeÂ—and occasionally we watched appropriate, intriguing films. A fieldwork paper comparing two immigrant neighborhoods in New York rounded out the course nicely. Above all, Ellsberg is hilarious and quite quotable (every class I found myself jotting down her hilarious comments in the margins of my notebook). I would name her the best teacher I have worked with. Take her course, you wonÂ’t regret it.\nWorkload:\nVery manageable. Four two- to five-page essays (in many cases, two-pagers trump five-pagersÂ—the woman is all about elegant brevity), three revised, all to be collected in a final portfolio in which extra revisions are welcome (and encouraged). Reading is manageable and appropriate for an English seminar class. and you will want to read these books.\n"
        },
        {
            "course_name": "First-Year Seminar: Ethnicity and Social Transformation",
            "review_date": "December 18, 2005",
            "review_content": "\nShe's disorganized, she digresses like it's her job, she specializes in amusing stories, and she is one of the more excellent writing instructors I've had.  She teaches through the editing process-- gives you her basic Five Great Laws and Ellsberg Style Sheet and holds an in-class writing lab for each person's paper throughout the semester and, bam- you're bound to come out at least a slightly more concise, sharper writer.  Almost ALL the reading is pleasurable, too.  And she once said: \"If you wake up ANY English professor in the middle of the night and ask them, 'Who's your daddy?' they'll surely say 'Strunk and White's Elements of Style!' Seriously.\" \nWorkload:\nTotally manageable.  The books will be your semester's pleasure reading.  You don't HAVE to read all of them toward the end when you have more options.  Only criticism- no grades until really near to the end of the class, which is a pain for all of the anal retentive Barnyardians.  But she'll push back a deadline upon request and is tremendously fair/accomodating.  Take a class with Pellsberg!\n"
        },
        {
            "course_name": "Major English Texts II",
            "review_date": "June 10, 2005",
            "review_content": "\nShe is a fantastic teacher with SO MUCH to offer. I highly reccomend the Major English Texts series with her as she will open your mind in so many ways. A real pleasure.\nWorkload:\ncourseworks postings, a recitation, a final essay. follow the ellsberg style sheet and you will be fine. \n"
        },
        {
            "course_name": "First-Year Seminar: Ethnicity and Social Transformation",
            "review_date": "January 17, 2005",
            "review_content": "\nThis was an overall enjoyable class.  Professor Ellsberg is a good teacher but she has a tendency to tell A LOT of stories about nothing.  Her comments on papers are excellent.  I felt like I learned a lot of general writing skills which is the point of first-year classes.  Definitely take this class over any other first-year seminar. \nWorkload:\nVery managable.  Six (excellent) short novels.  Two critical analysis papers, one narrative, final paper all 2-3 pages.\n"
        },
        {
            "course_name": "Literary Approaches to the Bible",
            "review_date": "January 03, 2005",
            "review_content": "\nPeggy Ellesburg lectures well and the subject matter was very interesting BUT - the problem is the class was a seminar, not a lecture, and she didn't seem to know the difference.  Other students have mentioned the fact that she plays favorites...and I'd have to agree...she'll love you if you've gone to bible school or have other arcane religious knowledge (although only if it's of the western persuasion).  I am usually a talker in seminars...I enjoy taking part in lively discussion - but it was basically impossible in this class - because Ms. Ellsberg talked the entire time.  By the end of the semester, although I had fastidiously done all of the work (probably more than most students had done) I couldn't figure out how she could grade me because there was no place in the classroom where I could have exhibited any knowledge.  \nOn the positive side, she's funny and interesting - quite a character - and tells great stories.  BUT - I think that she's not what I would call fair.  I think a grade from her is pretty arbitrary.  Ultimately I was glad I took the course because I found it engaging - but I ultimately I also lost an amount of respect for her teaching.  I guess what it comes down to is that she's a bit self-absorbed.  \n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "December 04, 2004",
            "review_content": "\nBEST CLASS I HAVE EVER TAKEN!!  barely any work and all essays you write are short and fun.  she will improve your writing more than you can even believe and the classes our always enjoyable and exciting.  \n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "December 04, 2004",
            "review_content": "\nBEST CLASS I HAVE EVER TAKEN!!  barely any work and all essays you write are short and fun.  she will improve your writing more than you can even believe and the classes our always enjoyable and exciting.  \n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "September 07, 2004",
            "review_content": "\nProfessor Ellsberg is GREAT!!  She is the sweetest lady, and loves what she does.  Whether you're one of her favorites or not, you should easily receive an A.  \nWorkload:\n4 two-page personal essays with rewrites, no homework, all in-class readings.  Very easy.  \n"
        },
        {
            "course_name": "Major English Texts I",
            "review_date": "February 03, 2004",
            "review_content": "\nI took this class to fulfill my general ed literature requirement, so I am speaking as a non-English major.  In the beginning of the semester I was very frustrated with the class, most of the time the lectures had very little to do with the readings.  The lecturers were mostly the history of the time period of the readings.  But once I came to terms with that I actually found myself enjoying the class.  What I liked best about this class was that I could put it on the back burner while I did the work from my harder classes.  I basically only did the readings when it came time for the midterm/final and papers.   The material in the lectures was really never tested.  I would recommend this class to people who want an easy English class.\nWorkload:\nOne midterm  and one final, which each consisted of 2 parts, an inclass quiz - 10 ID's of quotes from the readings, we just needed to give the work and author. The second part was a take home essay.  There was also one paper about 4 pages in length.  She was a pretty fair grader. \n"
        },
        {
            "course_name": "Ethnicity and Social Transformation (First Year Seminar)",
            "review_date": "January 26, 2004",
            "review_content": "\nAll of the other reviewers seem to feel very strongly one way or the other, but I found the class to be firmly rooted in the middle.  I was not inspired by Ellsberg, nor did I perhaps learn as much as I could have in the class, but she was very approachable and friendly.  It is true that she was perpetually tardy and I don't think my writing improved very much.  However, I found her anecdotes and discussion topics to be informative and interesting so I generally looked forward to class.\nWorkload:\nFour short papers, one of which we each read aloud in class.\n"
        },
        {
            "course_name": "Major English Texts I",
            "review_date": "January 18, 2004",
            "review_content": "\nThe readings were dry at times, but the lectures were interesting.  Prof. Ellsberg isn't the best lecturer I've had, but she seems very knowledgeable and it's clear that she enjoys the subject.  Other reviews have said that she favors certain students, but I don't think that's true.  While she seems to know some students better than others, as far as I could tell, favoritism wasn't reflected in her grading.  This is a good introductory course for anyone who would like to be an English major.\nWorkload:\nreading everyday (but it's not overwhelming), a 5 page paper, recitation of 15 lines or more (you can choose from anything that was read in the class), a midterm, and a final (These exams are composed of a take-home, timed essay, and a short in-class quiz on quote identifications and extra credit.)  \n"
        },
        {
            "course_name": "Major English Texts",
            "review_date": "October 18, 2003",
            "review_content": "\nTo put it simply, I love this woman. Everything from her excitement about the material to the way in which she runs the course makes her class an absolute joy to attend. Let me include that this review is being written BEFORE any grade has been received, which I indicate only for those readers who are quick to judge a professor strictly on the merit of the grade they earn. Whether I end up with an A or a B, this woman still rocks and I recommend any class she teaches, as her perky, fun, not to mention ridiculously knowledgeable attitude is sure to carry over into anything she does.\nWorkload:\nmid-term, final, paper, and recitation. attendance is necessary to fully understand the readings, which are often complex but always rewarding\n"
        },
        {
            "course_name": "Major English Texts (Barnard)",
            "review_date": "July 27, 2003",
            "review_content": "\nAWFUL!  Ellsberg is not only always (ALWAYS!) late, she's also a horrible teacher.  Class time is spent describing the mannerisms of authors and their probable apparel (basically, it's useless information).  She rarely actually gets to the text assigned so you often have no idea what she's looking for in a paper or test!  She does invite guest professors, who are SO much better.  The funny thing is, she never sticks around to hear what they say so it's not like she can test you on their lectures!  She DEFINITELY plays favorites...you better become her buddy or risk getting a bad grade.  You'll no doubt notice a bunch of her favorites sitting at the front of her classroom (they will receive the A's...YOU WILL NOT!)\nWorkload:\nShe assigns a bunch of reading that she never gets to in class...so just read it for the paper/exam.  Most of my class got by on simply reading the notable texts (ask others what they think is important too!)...sometimes, she'll clue you into what she considers to be important (though you'd never really know it from her \"lectures\").\n"
        },
        {
            "course_name": "Major English Texts",
            "review_date": "May 21, 2003",
            "review_content": "\nI took both semesters of the course with a year in between.  The first course was pretty easy -- she was fun, understanding, and graded essays pretty leniently as long as you put time and effort into it.  The second semester was hell.  For some reason she is now overly stingy in grading essays (her favorites, I noticed, got As in the first essay while the rest of the students got  split grades (ie. A/B-, or content/structure or some obscure grading style she doesn't bother explaining).  The lectures can become boring and tedious, and although she isn't a bad lecturer per se, I was severely disappointed with her change in grading 'policy' (and I use the word policy loosely) in the most recent course I took with her.  If I knew that she was going to be so picky and have favorites, then I wouldn't have bothered taking the course.  But if you're a stellar essay writer and don't mind sucking up to her, have fun.\nWorkload:\nMidterm (excerpt identification, essay), final (same format), 1-2 essays\n"
        },
        {
            "course_name": "Major English Texts II",
            "review_date": "May 16, 2003",
            "review_content": "\nEllsberg is a horror story!  DO NOT TAKE HER CLASS!!!  She is extremely full of herself and favors students who kiss her ass!  She frequently has guests come in to lecture but she thinks that means she doesn't have to show up.  When she does show up, the classes are even more meaningless.  Basically, you have no idea what she expects you to learn because she never teaches anything herself AND she's never there to hear what the guests lecture on either! ....[culpa censor]....\nWorkload:\nShe never goes over the readings in class--instead, you hear about the clothing people wore in different time periods.  Somehow, you're expected to pull together a paper and study for a final.  (She cancelled the midterm--yes she is a flake)\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 12, 2003",
            "review_content": "\nGreat class.  The material really grows on you and you'll even find yourself enjoying it sometimes - Candide, come on, it's great.  Prof. Ellsberg is great, so great in fact that you'd wish she's stop being late and TEACH more.  However, the material she teacher is extremely fascinating/relevant/helpful.  Really improves your writing and teaches you what not to do ever in barnard, such as include the word states in your essays.  If you're going to take this class, take it with her.  Soooooo low stress, fun class.  People actually voluntarily chose to add an extra class to the end of the semester.  Definitely will take another class with her.\nWorkload:\n3 2-page papers, rewrites, cool reading, not too much.  Very low stress.\n"
        },
        {
            "course_name": "Senior Seminar: Shores of Refuge",
            "review_date": "April 30, 2003",
            "review_content": "\nThis woman should not be allowed anywhere near a classroom of students over age 12 or so. She is the living embodiment of why teachers were forced to quit their jobs after they got married and had kids. Yes, she is educated (presumably), yes, she is funny (sometimes), yes, she is fun to talk to. She is someone I would love to have over for dinner, but she is a HORRIBLE teacher. \nTo begin with, she was late for class EVERY day. It got so that I stopped coming on time altogether. Then, she would waste close to half of every class (2 hrs, once a week!) talking about her children (she once spent almost an entire class session asking us for \"therapy\" about how to handle some crisis her kid had at school), her horse, her dog, her vacations, etc., etc. When we finally got to discuss the texts, she openly favored those who'd taken her classes and kowtowed to her before. (I felt like I was back in third grade, fighting for hall monitor privileges.) She interpreted the texts in the way SHE wanted to, without encouraging - or, indeed, brooking - disagreement. \nI learned absolutely NOTHING about Jewish-American literature this semester that I had not known before. And I don't know that much. The points and \"insights\" she introduced in class were ridiculously obvious, considering it was a senior seminar and most of us SHOULD have been expected to have some knowledge about this literature. \nShe is disgustingly self-indulgent, wasting our class time on discussions about her own life; she creates the impression of a little girl who never had any playmates as a child and now - haha! - she has a captive audience who HAVE to listen to her, they NEED her for their grade, their GRADE, see, ohhhhh yeahhhh!\nWhat a horrible class - despite the fact that I loved the reading list.\nWorkload:\nA fair amount of reading, but it's really easy and fun to read; Some reading-responses during the first weeks - which have to be written according to her own totally arbitrary (for the most part) guidelines; A greatly reduced required quantity of pages for the final thesis, but then, it has to be written according to her \"Ellsberg's Style Sheet\".\n"
        },
        {
            "course_name": "Major English Texts I",
            "review_date": "April 18, 2003",
            "review_content": "\nTerrible...*CULPA censor* The woman said \"syllabuses\" during the first lecture and I knew I should have run.  The most obscure facts about authors are discussed to DEATH and nothing is said about the texts until 10 minutes before the end of class...and even then it's minimal and at a 10th-grade level.  BLEH...take it if you hope to become a Jeopardy! champion, not an English major.\nWorkload:\nA lot of dry reading that she made no effort to make more interesting...and it was embarassing that the high-schoolers I was tutoring at the time were reading the same things...\n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "January 19, 2003",
            "review_content": "\nEllsberg is a strong professor but her strengths are outweighed by her perpetual lateness. Her class focuses on building editing skills which are helpful, but a general consensus is that there are not enough assignments in the class to be effective\n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "January 03, 2003",
            "review_content": "\nThe lady is smart and throughout the course, she tells you more than just a few Jeapardy worthy facts.  As far as improving your writing, this class will certainly help, but you will have to tolerate Prof Ellsberg's perpetual tardiness and saccharine sweet stories about her family.  She is an engaging lecturer and classes are enjoyable and go by fast.  It is just too bad this class has to be graded because it would function better as a nonevaluative writing workshop...any grades are a subjective evaluation of who you are, and if you roll your eyes everytime she talks about her daughters like I did, don't expect an A.  \nWorkload:\nOnly four essays all semester with multiple revisions.  Watch out for the end of the semester when an essay and five- page introduction (an excuse for Ellsberg to read glorifications of her class) are due in a matter of days.\n"
        },
        {
            "course_name": "Major English Texts I",
            "review_date": "November 16, 2002",
            "review_content": "\nShe's a funny lecturer, but she never really sticks to the texts...she prefers to talk about her family or her time at Oxford. The guest lecturers are usually not half as good as Ellsberg, and she had another professor grade the midterms, which I found a bit strange...still, it's an easy class. The texts get more interesting as the semester goes on.\nWorkload:\nMidterm, short paper, final. \n"
        },
        {
            "course_name": "Major English Texts II",
            "review_date": "October 01, 2002",
            "review_content": "\nThis professor is fantastic. She takes a very humanistic approach to the material and teaches you the things about English you always wanted to know but were afraid to ask. She cares about her students and is very fair. Contrary to other opinions, she does not play favorites. Take this class, but only if you can handle thinking outside of the box.\nWorkload:\none easy paper, lots of good poetry, midterm and final \n"
        },
        {
            "course_name": "Major British Texts II",
            "review_date": "June 01, 2002",
            "review_content": "\nShe was a \"gold nugget\" teacher on CULPA, but she ain't no gold nugget, shes lucky if shes even a diluted mercury atom!!!! SHES A HORRIBLE PROFESSOR. First of all, this is strictly a class where one takes notes on random facts about her Radcliffe days and history tidbits that would be more useful on Trivia Pursuit (then anything else). Second, shes doesn't even grade most of the papers. Shes too busy babysitting her daughter to grade the papers-- she leaves it to a lowly TA who mysteriously never answers phone calls regarding the comments he makes on the papers. She doesn't help you analyze the text at all---but, tests you on ID's. Furthermore, for all of you who've heard that this was an easy A class, DO NOT BELIEVE IT!!!!!!!! Yes, she gives As-- to girls who go to her house for dinner and kisses up to her little daughter in class. For all you other people, its a B or below. She's not approachable and don't even bother to ask a question in class. She'll shoot you down in a second with something to insult your intelligence. Let me say this again, THIS IS A HORRIBLE CLASS. Your grade is pretty much subjective, therefore you better make yourself likable (to her) or you're dead meat! BEWARE!!!!\nWorkload:\nCouple hundred pages of poetry, Couple of books. Midterm, paper, final. Grading is SUBJECTIVE (pray to god that she likes you). \n"
        },
        {
            "course_name": "Major English Texts",
            "review_date": "August 14, 2001",
            "review_content": "\nHave you ever taken an English class that had absolutely nothing to do with books? Well, if you haven't then sign yourself up for Major English Texts. Even my most anal note-taking friend had about 5 pages of notes for the entire semester of this class. The woman can spend an entire class talking about leeches. Make no mistake, Ellsberg is a great professor to take a class with and an even better person to be friends with. She's funny, warm, caring and obviously intelligent. If you're looking for a class where you're guaranteed to laugh and stay awake, take this one. If you're looking for a class where you actually hope to learn about Major English Texts, look elsewhere.\nWorkload:\nThere is a light reading list, a midterm, 4-5 page paper and a final. Do the reading at your own paces, and if you can manage to put together two coherent sentences, you should get an A on the paper. Overall, this class was an easy and enjoyable A.\n"
        },
        {
            "course_name": "Major English Texts",
            "review_date": "August 14, 2001",
            "review_content": "\nHave you ever taken an English class that had absolutely nothing to do with books? Well, if you haven't then sign yourself up for Major English Texts. Even my most anal note-taking friend had about 5 pages of notes for the entire semester of this class. The woman can spend an entire class talking about leeches. Make no mistake, Ellsberg is a great professor to take a class with and an even better person to be friends with. She's funny, warm, caring and obviously intelligent. If you're looking for a class where you're guaranteed to laugh and stay awake, take this one. If you're looking for a class where you actually hope to learn about Major English Texts, look elsewhere.\nWorkload:\nThere is a light reading list, a midterm, 4-5 page paper and a final. Do the reading at your own paces, and if you can manage to put together two coherent sentences, you should get an A on the paper. Overall, this class was an easy and enjoyable A.\n"
        }
    ]
}