{
    "prof_info": [
        {
            "prof_name": "Gregory Wawro",
            "prof_id": 585,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "The American Congress",
            "review_date": "December 20, 2016",
            "review_content": "\nAwful awful awful awful. First I thought the course would be interesting. Only midway did he decide to make us suffer and talk of topics that are in no way instructive on Congress, especially for people taking this as an intro to congress level (meaning talking about spatial theories of voting, and committee theories and so on). I am not American and wanted to learn about Congress, yet all I came to realize is that this class was just horrible and I truly learnt NOTHING.\nLecture: boring dry hard to follow not so much american politics, probably more of a mix between american politics and research methods/math methods for poli sci\nWorkload:\nThe amount of readings he assigns are preposterous. Around 13-15 chapters from 4 DIFFERENT books every two weeks. All books talk of the same thing so he clearly just wanted us to suffer even more and just assign four books on the same topics.\nExams:\nNit-picky IDs from readings. Truly NO ONE in the class answered a few that showed up on the exam because it was neither spoken of in class, or in the books (which I have on Kindle so I did a control+f, and nothing came up). So again, just a really ridiculous move on his hand.\nGrading: meh, ok not too strict, but then again you have to make sure to answer every part of every question and god forbid you forget to mention a tiny little bit you'll pose 1/2 the points.\nOverall: save yourself and your time and please do not take this class. I promise you will not learn ANYTHING about congress and just realize that you made a huge mistake\n\nWorkload:\nNoted above\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "April 10, 2012",
            "review_content": "\nI'm not sure what class some of the other reviewers took but Professor Wawro's American Congress course was as good as a survey course on Congress can get. Wawro is VERY knowledgeable on the subject and it is clear that he is on the cutting-edge of research on Congress. Take this class if you want not only general information on Congress but also insight into the newest theories. I can only see lectures as being boring to one with no interest in the American political system, in which case I do not see the point in taking a polisci elective. \nDespite the size of the class, Wawro also did a good job of encouraging participation, which made the 75 minute lectures go rather fast. The readings are well-chosen and interesting but not at all necessary. The midterm and final were almost completely based on lectures and if you take good notes and retain the information you'll be fine. \nThe research paper that's due on the last class is on any number of interesting questions that examine relevant current events in Congress. It's graded by TAs and not especially harshly. \nWorkload:\nReadings that are not necessary but interesting.\nA midterm and final that are essays and IDs.\nA 10-12 page research paper due on the last class. \n"
        },
        {
            "course_name": "The American Congress",
            "review_date": "December 21, 2011",
            "review_content": "\nThe other reviews of Professor Wawro might make you think his class is boring -- it's not, just about a dry subject that I think he did his best to teach. It's no doubt that he knows his stuff -- he published a book recently -- but it isn't ideal that he reads his lectures from pre-prepared notes because some of the more exciting and interesting facts came out when he wasn't reading. \nI will say that most of the class is very straightforward and not very challenging. There are four textbooks assigned, and the reading isn't entirely necessary most of the time. One of them had bolded terms at the end of each chapter that was good for review. I will say that I didn't study much for either exam and I did really well on both of them, as did most of the class. Although whether or not this is due to the incredibly generous grading or the entire class knowing the material (or both) may never be known. \nIf you're interested in Congress and want a light workload that you'll actually learn something from, take this class. Wawro's a cool guy and the TAs seem like they know their stuff. \nWorkload:\nVery little. One midterm, one final, and an 8-10 page research paper due at the last lecture. All graded very generously.\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "January 18, 2009",
            "review_content": "\nLame, lame, lame. The topics covered in Wawro's disorganized lectures were extremely elementary. Do you know that Congress is bicameral? Well, then you shouldn't come to lectures. However, the midterm and final IDs were waayyyy out of leftfield and were just obscurely mentioned in the readings. I really didn't like this class. Boring, boring, boring, and Wawro doesn't seem to give 2 shits about teaching. Take something else, please. .\nWorkload:\nMidterm, final, 8-10 paper selected from four possible topics. \n"
        },
        {
            "course_name": "American Congress",
            "review_date": "December 29, 2008",
            "review_content": "\nWawro is a surprisingly charming lecturer. If you doze off in class or don't show up (which was the case for most of our classmates) you're actually missing out. He's got a great, dry sense of humor and he presents the material in a straightforward manner. And if you go to class, you barely have to do the reading -- just skim it for the boldface words before the exams.\nHe also works really hard to make sure the class is relevant. When the financial crisis broke out, he suspended the syllabus for a few days just to discuss Congress's response, and one of the essay options had to do with the 2008 race. I'd definitely recommend the class to anybody remotely interested in current events or Congress.\nWorkload:\nMidterm, Final, and an 8-10 page paper\nIf you need a hand, talk to the TAs -- they're really helpful\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "December 10, 2008",
            "review_content": "\nProf. Wawro is actually an engaging lecturer if you actually listen to what he's saying. The first class seemed to be a bit cut and dry and to the point. I decided to stick around for one more class and found myself pleasantly surprised by Wawro's style and wit. The material itself is interesting and, although Wawro could be less monotone, he actually has a very witty sense of humor. He'll definitely surprise you with a comment inserted in the middle of lecture (albeit in the same monotone voice) that will completely take you off guard but will definitely make you smile (or even chuckle). And he also presents the material in an easy to understand manner. You won't leave class being unsure about something that he said. Perhaps its not the most invigorating class, but it is a topic that is very pertinent and useful to know about today and Wawro doesn't do a bad job at presenting it (as the other reviews suggest).\nWorkload:\nIn class midterm, in class final during the designated time, 10 page research paper\n"
        },
        {
            "course_name": "Theories and Debates in American Politics",
            "review_date": "January 11, 2005",
            "review_content": "\nIf you are looking for a round up of American Politics topics of interest, don't look here. This course is lazily composed by the instructors, with no real thread except taking exciting topics such as the presidency and congress, then sucking any interest out completeley  by boiling them down into their constitutuent theoretical parts. It was a sad moment of the course when towards the end of the semester a professor of law guested, and was clearly much more interesting than either Erickson or Wawro. \nThey are not bad professors as such - but they don't put in enough effort to make it interesting, and if this is an introduction to american politics, for god's sake make it a little more relevent. I have nothing against theoritical political science as such, but by divorcing it from  'historical' analysis (eg, the news), there isn't a way in for interested novices.\nThere must be a better intro than this.\nWorkload:\nSlim - best thing about the course, as if that was a reccommendation! They don't check up, so you can get away with murder.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "June 13, 2004",
            "review_content": "\nProfessor Wawro is a very good professor, overall.   I really enjoyed his class, and found him to be quite knowledgable.  At the beginning of the semester, he used power point slides, but he later gave this up and lectured without them.  His lectures, the course readings, and the term papers were quite thought provoking.  He brought in great outside speakers.  Though there was a lot of reading, it was manegable.  All in all, if you must take this class, Professor Wawro is a good bet.  Just watch out for the mediocre TA's (don't be afraid to shop around for discussion sections)\nWorkload:\nWeekly Readings, Midterm, Final, 8-10 Page Term Paper (Really interetsting topics)\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "May 26, 2004",
            "review_content": "\nI took this course to get a good grade to boost my GPA, like most people that arent poli sci majors.  I heard that it was really simple and straightforward but i found out that this guy isnt!  First of all I had the TA from hell.  Our class really studied for the midterm and he gave our disc section a avg of a 76!  I went to this guy's OH and he gave me the run around, you must make it plainly clear that you want an A.  From then on I got an A+ on the Final Paper and probably an A or something on the Final because I ended up with an A as a final grade.  But this didnt come without some anxiety.  Just stick with it, since the lectures SUCK!!!!  He is so uninteresting and boring.  The moral of the story is get a good TA and just go over the highlighted words in the main textbook.  \nWorkload:\nmidterm(5 out of 8 ids and 1 out of 2 essays), final paper (8-10 pgs), final (7-9ids and 2out of 3 essays)  Not bad at all!\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "May 20, 2004",
            "review_content": "\nI know that a lot of students don't think too highly of Prof. Wawro's style, but I have to disagree. I like his use of powerpoint in the lectures, I think it's easier to take notes when the main points are right in front of you. He is very easy to talk to in and out of class.\nWorkload:\nModerate\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "May 10, 2004",
            "review_content": "\nI took his class and regret it. Don't go over on your paper length. I went over by two pages and was deducted half a grade.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "May 10, 2004",
            "review_content": "\nWawro doesn't get enough credit.  Given he's no Gulati, he is still an open-minded, intelligent teacher who's very open in class.  The class is a little a boring but so is the material.  Basically the class wasn't bad and Wawro did a good job under the circumstances.  Word of advice: the TAs grade everything, so maintain contact with yours and attend the the discussion sections.\nWorkload:\nbetween 60-100 pages of reading a week with the textbook reading mostly summarized in class lectures; one midterm consisting of ID's and one essay; 8-10 page thought-provoking policy essay; and the final is the same as the midterm only on the second half of the semester--one major con from the class were the madatory discussion sections\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "March 24, 2004",
            "review_content": "\nwawro just plain sucks.  probably the most boring professor that i've had at columbia, he is also bad when it comes to exams.  Midterm ID's consist of either ridiculously broad topics, or ridiculously narrow ones.  Literally reads WORD FOR WORD from a powerpoint presentation and refuses to put the powerpoint slides online.  Bottom line, if you have to take intro to american politics, wait until wawro isn't teaching it.\nWorkload:\nMidterm, Final, Paper.  The reading is easy but the exams don't reflect it.\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "September 29, 2003",
            "review_content": "\nForget about idiotic....Wawro is hands down one of the two worst professors at Columbia.  His lack of care for teaching is only surpassed and further demonstrated by the fact that he never graded a single paper or exam the whole semester.  He didn't even show up to proctor any of the exams.  All work was done by his TA including teaching some of the classes.  His lectures are beyond boring and could be compared to anestesia.  The definition sections on the exams were taken from one line definitions that he threw at you in class and never revisited again, or from some obsure section of one of the boring required books.  The questions were never appropriate, pertinent or fair to the students even if they did all of the readings and attended every tedious lecture.  He is unapproachable outside of class and will not help you if you miss a class.  He has every lecture that he does in a slide presentation which he reads from verbatim in class, but will not share it with any of the students for fear that yet less will attend his stiffling classes.  If you want to work extremely hard for a terrible grade and be insulted, then take this class.  Columbia University should be ashamed to have him call himself a professor and should never have made the mistake of hiring him.  *CULPA censor*   I give this class and the professor an overall F\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "August 18, 2003",
            "review_content": "\nMIndless. Wawro is hands down the worst professor I have had here. If you are looking for engaging, thought-provoking material and insights, don't bother. However, if you want an easy class, take it with the understanding that Wawro's existence here at Columbia will make you wonder about the institution at large. You can do well without reading a single page. \nWorkload:\n1 paper; midterm; final.\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "August 18, 2003",
            "review_content": "\nProfessor Wawro's lectures were incredibly difficult to sit through; he read his lectures word-for-word from powerpoint slides, and most of the information in those slides was background information on the organization/workings of congress, which can be learned in an intro class.  The only thing that made the class at all worthwhile was the paper.  There were interesting topics that left room a more more in-depth/scientific analysis than we ever did in class.  Wawro didn't seem very approachable outside of class, but fortunately, the TA was great.  She was willing to discuss anything, and she was extremely knowledgable.\nWorkload:\nMidterm, 8-10 pg. paper, Final (our class didn't have weekly sections)\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "May 24, 2003",
            "review_content": "\nBring your laptop to class so you can mindlessly copy Professor Wawro's PowerPoint slides.  He refuses to put these slides up on the web for fear fewer people come to his already empty class.  If you have to take the class to fulfill your political science major requirements you'll just have to deal with it.  If you want to take an American government class for fun, however, this isnÂ’t the place to look.  The only saving grace was interesting paper topics.\nWorkload:\nMidterm, Final, 8-10 page paper, weekly sections that count towards your grade\n"
        },
        {
            "course_name": "American Congress",
            "review_date": "May 20, 2003",
            "review_content": "\nI have to disagree with the other reviews. I found Professor Wawro's lectures to be very clear and informative. While the class moved a little slow at times, in general, it was very interesting, and I really learned a lot. Not a stressful class at all--just take good notes and you are assured an easy A.\nWorkload:\nmidterm, final, and an 8-10 page research paper\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "May 19, 2003",
            "review_content": "\nI find American Politics to be intersting in itself, so the review may be a bit biased as a result. Prof. Wawro used powerpoint during his lectures, and he essentially read off the screen. He was knowledgable, and also seemed like a nice guy. The ID's on the exams proved to be the biggest problem, because they were somewhat obscure terms from the readings. \nWorkload:\nWeekly readings, 10 page paper, midterm exam, final exam\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "March 26, 2003",
            "review_content": "\nAh, another wonderful professor in love with the sound of his own voice.  Mr. Wawro proves his excellent reading skills each lecture when he reads his obsessively detailed and yet moronic PowerPoint presentations right off the screen.  For you punctual folks out there, don't worry, Greg is always five minutes late to class and feels there is no issue with running over.  Of course, intro classes can be dangerous, but this one affords no interesting upshots, like acquisition of knowledge.  You can buy the textbook and teach yourself the material.  The reading is excessive.  The class is generally populated with athletes and people like this unwitting senior who thought she'd get off easy with an interesting but simple intro course.  Alas, the IDs on the tests draw on solid familiarity with the reading & the kicker is the \"term paper.\"  The idiocy of this class will make you feel like you're back in high school.  Of course, it is possible that this is a required class for aspiring poly sci majors.  If so, enjoy a semester worth of mumbo jumbo that will numb your mind and make your ears bleed.  \nWorkload:\nMidterm, final, one 8-10 paper due at end of term.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 22, 2003",
            "review_content": "\nGood lord, do not take this class with prof. Wawro. He is uninteresting, boring, and what he says is crap I learned in my high school government class. He uses power point, and then just reads out to us what is written there. He doesn't put the notes on the class web site because he knows if he did, noone would come to class. If you have to take this class, just wait a semester and try to get someone else.  \nWorkload:\nstupid \n"
        },
        {
            "course_name": "American Congress",
            "review_date": "May 06, 2001",
            "review_content": "\nForget about pain killers and booze... Wawro will instantly put you to sleep. He is the most boring lecturer. Some like that \"I'll bore you to death\" style... I don't... and I have a feeling you won't either. If you have a pulse, take another class. You will get nothing out of this class.\nWorkload:\nWorthless reading... midterm.. final and paper.\n"
        },
        {
            "course_name": "The American Congress",
            "review_date": "April 09, 2001",
            "review_content": "\nSooooooo boring. Wawro is entirely uninsightful and speaks with an unbearable monotone. This man should not be teaching at Columbia. A total disgrace. Do not, under any circumstances, take his class.\nWorkload:\nTypical.\n"
        }
    ]
}