{
    "prof_info": [
        {
            "prof_name": "David Moerman",
            "prof_id": 2022,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "May 16, 2016",
            "review_content": "\nThis was absolutely the worst class I have ever taken. I was drawn to it by the minimal workload of 2 6 page essays, a  weekly blog post, and an oral final. But Do not be fooled! The readings are boring and confusing. They all ramble about the same thing but are inherently different and make no sense. \"The way of dharma is through action and nonfiction. Being and nonbeing\"... WTF!?\nMoerman sits at the front of the room and says, so what are your thoughts. And expects students to just talk for 2 horus about nothing. He is useless. His essay comments are nonexistent... a question mark here or there and a grade at the end ... one of my papers he said made no sense and didn't even bother grading it.\nThere is nothing enjoyable about the class, and nothing to be learned. Warning: stay far away. \n\nWorkload:\ntwo 6 page papers\nweekly blog post\noral final\n"
        },
        {
            "course_name": "Lotus Sutra",
            "review_date": "December 10, 2009",
            "review_content": "\nProfessor Moerman is great. \nSome of his other reviews indicate he may not be a great lecturer, but in a seminar format he is very comfortable. He has a self-deprecating sense of humor, which I can appreciate. He's fairly relaxed and open to letting class discussions go wherever the class takes them. That said, this is graduate level class, so for the most part the discussion stayed on track.\nThe class is firmly bedded in the Lotus Sutra. You're not going to get a survey of other related texts or general background on Buddhism in this class. Therefore it is helpful to bring a general understanding of Buddhism to the seminar. If you have no knowledge of the religion you might feel a bit lost. That's not to say you couldn't do it, just be prepared to do some extra reading to flesh out some of the more general points. I should add that Prof. Moerman was very open to anyone coming into the class. There were even a couple of freshmen in the mix who seemed to do just fine. About half the class were undergrads with varied majors, the other half were PhD or Masters students from the Religion or East Asian Studies Depts. \nBeing a seminar there was quite a lot of reading each week with a short response required on Courseworks. Each week one person acted as the discussion leader and wrote a longer review of the readings, and posed some questions for discussion in class. At the end of the semester a final paper was due. For undergrads it only had to be 10 pages. For grad students it was 20. We were required to hand in rough drafts by the last day of class. He reviewed the papers and gave helpful suggestions on how to improve them, and the final copy was due at the end of exam week. Nb. There were no exams in this class.\nI highly recommend this class.\nWorkload:\nFairly manageable... \nWeekly postings on Courseworks (1 page) with an extended post (2-3 pages) one week in which you act as the discussion leader.\n1 Final paper (10 pages for undergrads / 20 pages for grad. students)\nNo exams  \n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "January 21, 2008",
            "review_content": "\nJudging by the reviews, people are torn on the issue of whether he's actually funny, on whether his class is actually interesting--his sense of humor is dry and sarcastic, and it's not like he jokes the entire class session.  All the same, he's flexible, approachable, and a nice guy once you realize that most of what you see is sarcasm.  He doesn't always lead the discussion in the most interesting directions and it's sometimes frustrating when he lets other students ramble on, but overall he's a nice guy.  Compared to the experiences of friends who took other sections of this class, my experience sounded less stressful, more relaxed, and more enjoyable overall.  \nWorkload:\nweekly 1-page papers on courseworks (which other sections don't have, but he's lenient about making them up later if you miss a couple), two 8-page papers, and an oral final\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "April 16, 2007",
            "review_content": "\nProfessor Moerman's class isn't the most exciting or engaging because it's a lecture in an overheated room (which made it difficult to stay away at times). Still, if you want to fulfill your core requirement this is a relatively painless way to do it. It is a bit boring in the beginning, but about midway through the course the material becomes more interesting. Yes, there is an emphasis on Buddhism because it's Prof. Moerman's specialty, but I still found it fascinating.\n     The reading is a bit much at times, but I got away with skimming through a lot of it. If you come to lecture and take good notes, you wont need to read too carefully.\n     As for Prof. Moerman himself, he's a pretty laid back guy with a funny sense of humor. I didn't have a problem with him at all. The TAs in this class were pretty chill and not too demanding. Overall, I would recommend this class.\nWorkload:\n2 papers, take home midterm and take home final\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "August 17, 2006",
            "review_content": "\nProfessor Moerman has an incredible sense of humor, which is why I was so surprised to find that he has the personality of a rock as soon as class begins.  He does not, I think, give a good outline of East Asian History.  It is easy to get a good grade in the class without reading the texts.  It is superfluous to ask to go over essays or exams with him, because he does not respond to e-mails.  I can sympathize with the fact that he teaches a course which most students take to fulfill the core, but the class falls short so often when there's an opportunity to exceed expectation.  For example, the samurai class was bland, and the course on sexuality was cancelled.  Furthermore, I lost points on essays for using words that, it seemed, exceeded professor Moerman's vocabulary.  I do not recommend this class.  \nWorkload:\nAverage for a Columbia class, less than other EA Civ classes.  A few essays, and a take home final.  Reading every week of about 50-300 pages.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "May 14, 2006",
            "review_content": "\nNot intimidating by any means and always approachable.  The day to day readings can be extensive, however, he spends every class summarizing all the readings due.  A lot of people don't show up to class, however, I would advise against this.  If you show up and take really good notes (force yourself to stay awake), you won't have to read ANYTHING.  Just type word for word what he teaches and his take home midterm and final will be a sinch.  The paper is of your choice and is easy to bullshit through.  Difficulty in grading depends on your TA.  Overall, a painless way to get rid of your major cultures requirement.\nWorkload:\nTake home midterm and final, 1 paper (not bad).  Lots of day to day reading but he spends the class summarizing it.\n"
        },
        {
            "course_name": "Japanese Civilization",
            "review_date": "February 12, 2006",
            "review_content": "\nProfessor Moerman seems to be a really nice person. Some CULPA reviewers have mentioned that attendance at his lectures is very low.  Perhaps Professor Moerman could alter the content of his lectures slightly--from devoting the bulk of the period to rambling exegesis to a lecture presentation more connected to the relevant socio-political-cultural-economic conditions that influenced the creation of the course's selected texts.\n"
        },
        {
            "course_name": "Japan Civ, Colloquium on Major Texts",
            "review_date": "August 10, 2005",
            "review_content": "\nProfessor Moerman is awesome.  No question.  Take his Major Texts class - it was one of my favorite classes at Columbia.  He is funny, chill, and is open for any kind of discussion during classes.  If you put in the time to do your essays and do the reading, you will get a lot out of his class.  HIGHLY recommended professor and classes.\nWorkload:\nFor Japan Civ: Take home midterm and final, one 6-8pg essay.  Lots of reading but can get by with reading selectively.  For Colloquium: Tons of reading, 2 6-8 pagers, and a 15 minute oral final (basically talk about anything you want).  \n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "May 27, 2005",
            "review_content": "\nI'd have to disagree with the reviews citing this professor as engaging and funny. Lectures consisted of Moerman reading often word for word from the coursepack, and then offering slight summaries of what he had just quoted. He spoke in monotone, as though having decided that most people would sleep through or avoid the course no matter how he lectured . An example of his \"dry wit\": he interrupted class to ask a woman reading the Spectator in the back row if she would save him the crossword section. Har. \nWorkload:\nPostings on courseworks, take-home midterm and final, and a ten page paper on any primary source. Terrible text book. One might get away with reading  only the sections pertaining to whatever source one chooses to discuss in the take-home tests.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "May 18, 2005",
            "review_content": "\nReally nice and funny.  You didnt really need to go to the lectures, although they were extremely helpful and if you went to them, you didn't need to do the readings.  Mandatory weekly discussion sections and postings.  The TAs were really nice and chill.\nWorkload:\nWeekly coursework postings on the readings (not graded, just had to be done).  Take home midterm and final.  8 page term paper due the last day of class.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "May 03, 2005",
            "review_content": "\nWhile Moerman is sometimes funny and always tries to be, the moral of the story is that you won't learn a whole lot from this class.  It's not so hard (everything is take home and he discusses the readings in class), but after attendance begins to dwindle, the TAs start marking people absent.  Section was usually significantly more entertaining than lectures.\nWorkload:\nTake home midterm and final (5 pages each); one paper (8-10 pages), tons of assigned reading\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "April 27, 2005",
            "review_content": "\nProf. Moerman is without a doubt my favorite professor so far at Columbia.  As someone else said, the first half of the course might as well be called \"Japanese Buddhism\", so if you love religion, you'll be in heaven.  The class actually dragged toward the middle of the semester, and Prof. Moerman was getting a bit upset at the dwindling attendance; however he is totally open to opinions and suggestions, and his lectures were truly engaging towards the latter half of the semester.  As with any other history class, this course covers so many aspects of Japanese history and culture, so don't stop coming to class just because you found a lecture boring; it's probably just that day's topic.  You will be amazed at how much you learn, and I already knew quite a bit about Japanese history.  The TAs for this course (Federico, Matthew, Collin) were really good as well, and I feel that grading was fair--yes, just as almost any other introductory course, your grades are totally up to your TA, so be sure to attend discussion. It's only 50 minutes a week, and extremely useful. This is a great course to fulfill a requirement, or to take out of personal interest.  It's definitely worth knowing about the Japanese and where they come from, especially today, considering present day China-Japanese relations, and that they might join the Security Council. \nWorkload:\nWeekly postings (very short), take-home midterm, take-home final, 8-10 page research paper on a primary source.  Lots of reading, which is expected for any history course--if you choose not to do the reading, be sure to go to lectures, Prof. Moerman rehashes the main points, but if you did do the readings, he won't be exactly be summarizing everything so no worries, you won't be bored.\n"
        },
        {
            "course_name": "Major Texts, Japan Civ, Japanese Religious Landscapes",
            "review_date": "March 23, 2005",
            "review_content": "\nI am NOT a Japan concentration or a Japan major even, but he is definitely one of the best professors at the university. He makes every class enjoyable and educational, and amidst all of the whining laziness that are us students, he manages to extract some pretty good work, for the most part. Most of all, he is a reasonable human being, which is more than can be said for many professors on this campus so, yes, while he is serious about your learning, he's not crazed in his perception that Japan and all things Japanese should consume your life and your entire semester. He does expect a certain level of work from his students, though. But you'll pleasantly find that you're more than happy to produce it. He is also extremely approachable and will more than happily guide you or answer your questions should you raise them in class or during his office hours. \nWorkload:\nPostings (weekly), readings (not bad), papers and midterms (more often than not take home, so you can spend time working on them)\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "June 14, 2004",
            "review_content": "\nThis was without a doubt my favorite class this semester. At first, the class seemed dry, but I found that as time progressed the only thing dry was Professor Moerman's sense of humor. Some memorable moments include an entire class on prostitution and sexual practices in Edo, and a propaganda video from World War II. There was a bit too much emphasis on Buddhism for my taste, but if Religion is your thing, you'll be in heaven for the first part of the semester. I highly recommend this class. The TAs were also great.\nWorkload:\nTake home midterm, take home final and a term paper due a couple of weeks before the final. The paper requires the use of some \"primary text\" on Japan, but the definition of primary text is extremely loose (Simpsons Episodes anyone?). Otherwise, it's all reading. The textbook isn't too bad and some of the reading in the coursepack are more interesting than others.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "April 30, 2004",
            "review_content": "\nProfessor Moerman is great. This class had the potential to be the most boring requirement ever conceived. Instead, it was fun, engaging and--yes--even educational. The texts we read covered a wide range, and Professor Moerman has the rare ability to share his expertise and his sense of humor. He's also good at keeping the discussion going, letting every get their opinions out . The workload is more than reasonable. Yeah, there's a bit of reading, but this is college. It's really a great class taught by a great professor. And I've heard really horrible things about the other ones, too. Columbia definitely needs more professors like this.\nWorkload:\nReadings, online postings. a couple of papers. nothing killer. \n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "April 26, 2004",
            "review_content": "\nMoerman is the Man. I took this class to fulfill my Major Cultures requirement, and it was most fulfilling. Moerman is great at leading discussions, at asking good questions, at keeping the pace going, at making almost any text complex and interesting. Mind you, my section was particularly engaged and intelligent, so no promises if you have a class of dullards. I knew very little about Eastern philosophy and literature and had never studied it formally; I now want to take some more electives because of Moerman. The weekly online postings were at first a little annoying, but in the end, they made discussions so much better and the class much more structured. Plus, Moerman is so warm-hearted that I needed extensions on them for a week or so and he was very understanding. He's witty, interested, and interesting. I had so much fun in this class and learned so much; I looked forward to it every week, and I'm really going to miss it. Columbia needs more Moermans. \nWorkload:\nA lot of reading, but worth it. About a book or so a week, plus weekly online postings (which really made this class the best discussion based class I've ever taken here). Two papers of independent topic and unspecified length. Oral final. You'll survive.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "April 20, 2004",
            "review_content": "\nProf. Moerman is a pretty good professor, and this is from experience, since I took two semesters with him. He is very casual to the point where he doens't have a heart attack about a late paper or discussion question. I found East Asian civ very interesting, after taking a class with this professor. There is a diversity in the reading, as he doesn't stick to a topic for too long. Instead, the readings range from philosophical to fun, like Confucius to Japanese Ghost Stories. The response questions were a burden, so was the writing fellow but overall I have no other complaints.\nTake this class, you will have a great time, especially if your looking to get out of the Major Cultures requirement without suffering. You will love his personality and good humor!\nWorkload:\nTwo 6pg. papers (any topic), Weekly response questions, Participation, and Oral Final\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "April 09, 2004",
            "review_content": "\nD. Max Moerman is a very nice guy...jokes around a bit, takes class very casually (ask to implement a \"snack attack\" system).  The workload was pretty light, and I found working with the Barnard writing tutors helpful (which was required, to the dismay of a few students).  However, I cannot say I learned very much.  Moerman kept the discussion going about as well as your average professor, but did not often bring to light any wonderfully enlightening ideas.  You get to watch some movies, and can probably pull off a good grade without too much trouble.\nWorkload:\nsomething like... weekly reading responses, 2 5 page papers, no midterm, 2 3/4 page papers instead of a final.\n"
        }
    ]
}