{
    "prof_info": [
        {
            "prof_name": "William Zajc",
            "prof_id": 163,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "September 10, 2009",
            "review_content": "\nProfessor Zajc is a good professor, a great one compared to Physics instructors in general.  He's better than usual at understanding a student's area of confusion, and is always patient and willing to explain things again and differently.  His lectures are worthwhile: while they don't always demonstrate problem-solving techniques, they will explain the concepts you need to learn those techniques yourself.  If you're not a Physics Person, you'll probably find this course a bit intense; if you are, then this is the course and professor for you.\nWorkload:\nModerate.  1 problem set per week (time/length depends on your own level of physics experties), two midterms (of variable difficulty) and a final.\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "June 19, 2009",
            "review_content": "\nFun story -- today is June 19th. School ended more than a month ago.\nMy 1602 grade was posted this morning.\nApparently one of the TAs just walked off with most of the even-numbered homework assignments; after more than a month of frantically trying to contact him (her?) Zajc finally gave up and calculated our grades based on the remaining assignments. Of course, the \"drop two\" rule remained in effect, meaning that one could conceivably have stopped doing homework halfway through the semester and still gotten a perfect homework score.\nAfter the first semester we got used to long delays in grading, but I believe this is a new record.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 26, 2009",
            "review_content": "\nZajc is a legitimately nice guy and a brilliant physicist, but a sub-par lecturer at best. The lectures are entertaining for the wild and crazy rides he takes you on during them despite having little to do with course material (\"You could just solve it by introspection, but we can prove it through a triple derivative! Let me show you exactly how!\"). The lectures are otherwise fairly useless. If anything, go to Zajc's lectures to get a look at those ridiculous forearm muscles. \nA few homework problems can be legitimately challenging to nigh impossible; go to the recitation sessions to ask how to do them. They are a godsend. Test grading is based only off of the class mean and standard deviation, meaning if everyone does really well on one test (e.g. the first midterm), you won't do nearly as well on it as you would for a fairly mediocre score on a brutal test (e.g. the second midterm). You can drop one, but it's in your best interests to take both. In our case, a 100% on the first midterm was the equivalent of about a 50% on the second. The final is fair and comprehensive, be prepared for some substantial calculus usage though. Thankfully, the tests are open book (which doesn't help as much as it sounds) and the course grade is extremely generously curved (which definitely helps as much as it sounds).\nMore than half of this class dropped to 1402 second semester, for what it's worth.\nWorkload:\nWeekly problem sets comprised of 10 medium/hard problems, 2 5-problem midterms (one is dropped), and one 10-problem final. As stated above, recitation sessions are a godsend for homework.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 17, 2008",
            "review_content": "\nProfessor Zajc is an interesting person.  His lectures are not particularly relevant to the problem sets that you have to complete since they are largely derivations of the concepts that you'll have to apply; however, they are quite amusing.  Zajc' puns, peculiar vocabulary (\"here we have the vectoriness of the velocity of this massy thingy\"), and general behavior are really quite funny.  Sometimes you do wonder, though, why he's derived the universal law of gravitation for a third time in two class periods. Otherwise, he's quite a nice guy.  If you have any difficulty, go to recitation and get your questions answered - Ali Hanks does quite a good job as recitation instructor as well as \"guest lecturer\" when Zajc is traveling.\nWorkload:\nWeekly problem set of 10 questions, 2 questions usually being very difficult; Lowest homework grade dropped; counts 35%. 2 open-book, open note midterms (4 questions); the better grade counts 30%.  Final (10 questions) also is open book, open notes; counts 35% of final grade. NOTE: open-book, open notes does not help much unless you've done the problems given ahead of time.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 16, 2008",
            "review_content": "\nHis lectures are interesting but completely useless. He does ridiculously complex and irrelevant questions, but he can be quite funny at times. I basically go to class to write down quotes of him.\nWorkload:\nThe workload isn't bad: a 10 question problem set due weekly. Problems are hard, the textbook is absolutely dreadful, but if you go to recitation and the help room, you're fine.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "May 24, 2008",
            "review_content": "\nZajc is incapable of sticking to any sort of schedule.  He mumbles to himself about material that is more advanced than anything necessary in an introductory physics sequence while writing on the chalkboard in illegibly small chicken scratch.  While there is nothing wrong with introducing supplementary material, it is a problem when it is done at the expense of material that is supposed to be covered and that is necessary for future courses.  For example, there were 4 chapters we were supposed to cover in 1602 that Zajc did not have time to teach at the end of the semester because he couldn't keep to a schedule throughout the semester.  I suppose this wasn't that big of a deal since his lectures weren't any good anyway.  Be prepared to teach yourself everything out of the regrettably inadequate Fishbane book.  If you read the book and take careful notes, you should be reasonably prepared for the homeworks, which vary in difficulty.  Recitations are helpful as well.  When studying for exams, redo all of the homeworks and don't even think about wasting your time reviewing the chapters themselves.  Just do practice problems.  Rigorous theoretical knowledge is not tested on the exams, but complex problems are.  1601 was significantly easier than 1602.  I honestly don't know why Zajc teaches the introductory sequence for physics majors.  I came to Columbia thinking I would be a physics major, but Zajc's class certainly changed my mind.\nWorkload:\nWeekly homeworks, 2 midterms (he drops the lowest one), and a final; homeworks and exams vary wildly in terms of difficulty - the average score on the exams ranged from 46 to 77\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "February 18, 2008",
            "review_content": "\nZajc's is so nice its hard to chide him, but the lectures in the class are totally useless. He doesn't do any practice problems and only derives equations.  The midterms and the final were all hard, but he drops one of the midterms  so he only counts your highest one. The class has a generous curve as well. I would reccomend his class if you are intrested in pure physics and the derivations behind the formulas.\nWorkload:\nWeekly problem sets(~10 prob) which are always difficult, two midterms (Tough but he drops one) and a final which was really difficult. It all works out though, as the class has a VERY generous curve.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 14, 2008",
            "review_content": "\nWell, this review is kind of pointless as Prof Zajc was the only section for Physics 1601. I found this lectures very pointless and boring. (He tends to talk to himself, a bit, while he gives long proofs of stuff on the board...) Furthermore, pretty much none of the stuff he taught in class was helpful in doing the homework sets, which ranged from easy to hard. \nHis exams are kind of unpredictable in terms of difficulty. The good thing is, he will only count your best midterm mark out of two. I scored well enough on the first one (which was easy) to skip the second one (which was apprently killer). The final was a fair and comprehensive. \nWorkload:\nWeekly problem sets, 2 midterms, 1 final. All exams are open book, but you shouldn't expect them to be easy. \n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 08, 2008",
            "review_content": "\nBeing very straightforward, Professor Zajc is an amazing instructor, but not in the literal sense. He is amazing because he does try his best in class to answer everyone's questions. Please note that this course in particular is excellent for physics majors, hence its course_name ('For Physical Science Majors'). Zajc's teaching style involves many, many derivations of equations and many explanations of how these equations were even thought of in the first place. What he teaches is mostly appropriate for physics majors only. Zajc is always welcoming students during his office hours and explains the answers to your questions fully. Recommended for physics majors only.\nWorkload:\nOne problem set per week (10 problems from the textbook). Two midterms, one of which he drops. One final... somewhat difficult.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 31, 2007",
            "review_content": "\nProfessor Zajc, rhymes with heights, may be a good teacher but the content of the class is so linear and boring that reading the book and going to recitation to work out practice problems is just as good if not better than going to lecture.\nIn fact, you will probably end up reading the book instead of going to lecture.\nThis class is approximately equal to AP Physics C.\nWorkload:\nOne ten question homework assignment each week. Two non-cumulative midterms with the lowest one dropped. One cumulative final exam.\n"
        },
        {
            "course_name": "Thermal & Statistical Physics",
            "review_date": "January 25, 2005",
            "review_content": "\nZajc tries so hard that you feel badly if you don't reciprocate.  You don't have to, as the class is easy enough, but you'll definitely feel like a bit of a heel when Zajc berates himself for not being a better teacher.\nHis teaching style is organized conceptually if not physically on the blackboard.  If you follow along, you'll notice that everything fits together very well in your notes.  You'll learn the subject on a conceptual and computational level but you'll miss out on any deep theoretical issues.  This is good or bad, depending on your perspective on physics.\nHe's the nicest physics professor I've had here (and I've had 'em all...) and he's certainly not out to get you.  Do the homework and come to his office hours a couple of times.  He'll give you a good grade and he'll probably even remember your name afterwards.\nWorkload:\nProblem sets every 1.5 weeks that are neither too difficult nor too easy.  Two midterms and a final, all radically different.  The first midterm was easy, the second was only slightly harder but had some surprise topics on it, and the final had a few hard questions and a few deceptively hard questions.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 14, 2004",
            "review_content": "\nFace it. E&M; is an unbearable subject. Fortunately, Zajc is a decent prof, who, if he doesn't succeed entirely in communicating the material to you in lecture, nevertheless makes sure you get it through homeworks and exams. Homework sets range from moderate to impossible. I honeslty remember handing in sets with more than half the questions undone or incomplete. Exams are usually well-written, based very closely on the practice exams he distributes before hand. Master every aspect of the practice exam and you will own the real exam. This also applies to the final.\nWorkload:\n1 pset per week. Budget 2-5 hours. 2 midterms, 1 final, no drops. Study the practice exams carefully, and you will do just fine.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "April 30, 2004",
            "review_content": "\nI never noticed the body building part...Zajc is more a nice family man.  He definitely cares a lot about students and his teaching, and seems frustrated that he's not a better teacher, but I really had no complaints.  He genuinely wants to help you learn, presents the information logically in well-organized lectures, and uses all different colors of chalk.  (The colored chalk is so diagrams are less confusing).  \nKim substitued a couple of times, and Zajc told us that Kim is a better teacher...and I guess he kind of is.  But overall, if you're taking this course with Zajc, you're going to be miserable because of the course content, not because of him.\nWorkload:\nweekly problem sets, 2 midterms, final\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "April 18, 2004",
            "review_content": "\nAs with most physics classes, boring, boring, boring. However, Zajc is a great guy. He'll admitt that he is not the best prof. in the world, but is willing to help you in anyway to make up for his short comings. And, he'll definitely admitt that most of the stuff they ask in the text he can't even do himself. His curves are great!! Always centered around a B or a B+ and the standard deviations are insane: anwhere from 16 to 22 points. (Caution: watch out for the 1600 kids who drop down at the last minute and mess up the curve)\nWorkload:\n10 problem sets (10%), 2 midterms (20% each), Final (50%)\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "April 18, 2004",
            "review_content": "\nAs with most physics classes, boring, boring, boring. However, Zajc is a great guy. He'll admitt that he is not the best prof. in the world, but is willing to help you in anyway to make up for his short comings. And, he'll definitely admitt that most of the stuff they ask in the text he can't even do himself. His curves are great!! Always centered around a B or a B+ and the standard deviations are insane: anwhere from 16 to 22 points. (Caution: watch out for the 1600 kids who drop down at the last minute and mess up the curve)\nWorkload:\n10 problem sets (10%), 2 midterms (20% each), Final (50%)\n"
        }
    ]
}