{
    "prof_info": [
        {
            "prof_name": "Paul Siegel",
            "prof_id": 12548,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "May 25, 2015",
            "review_content": "\nProf Siegel is funny, good natured, and someone who'd enjoy a beer and discussing Star Wars and Comic-Con.  That being said, I would NOT recommend him for anyone who has no previous experience with Calculus.  Much of his lectures are a combination of \"Math-speak\" and pretty complex \"examples\" which seem more for his amusement than to teach foundational concepts.  If you've read any other reviews, his weekly written homework will make the math tutors at Milbank 333 cringe!  Honestly, the written HW takes up a lot of time and I didn't learn a thing from it since he often includes material that you'll never encounter in Calc I (e.g. Hyperbolic functions).  If you're a math major and just have to take calc again, go ahead and take this class.  If you're anyone else (like me), you'll end up watching hours of Khan Academy or YouTube to teach yourself!  Which by the way, check out Professor Leonard on YouTube -, he's an instructor at some small college in Georgia, but his explanations are clear and concise.  If it wasn't for him, I would have failed this class miserably.\nAnd lastly, Prof Siegel is not very organized, if you have to ask him something, talk with him before or after class or during office hours.  I emailed him multiple times over the semester but never received a reply.\nWorkload:\nWeekly Web-Assign and BEASTMODE written HW (even on exam weeks), 2 mid-terms, final.\n"
        },
        {
            "course_name": "Topology",
            "review_date": "May 17, 2015",
            "review_content": "\nThis was definitely one of the best classes I’ve taken at Columbia.  Paul Siegel put incredible amounts of effort and enthusiasm into teaching this course and this played no small part in making the course such great experience.  \nProfessor Siegel is an excellent lecturer who presents the material at a reasonable pace with high levels of enthusiasm in addition to a good amount of involving the class.  He’s very organized also does a great job answering questions without getting sidetracked.  While the material can be very dense, he does a great job keeping a relatively light tone with humor and interesting asides.  \nAdditionally, he typed lecture notes that paralleled the lectures for the entire course, and these were extremely helpful.  They totaled to about 50 very dense pages by the end of the semester.  As the previous review mentioned, the material was related chapters 1-5 and chapter 8 of Munkres, but he also added several topics and examples of his own choice that were not in the textbook which greatly enriched the course.  It was clear that the put so much thought into what he covered into this class, which was a refreshing departure from professors who essentially read from the assigned textbook during lectures.  \nThe same creativity extended to the choice of homework problems, but this often meant that the homework assignments could be very difficult.  He definitely went out of his way to choose interesting and relevant problems, and many of these were great.  At times he was a bit too ambitious, but he acknowledged this after the fact and made adjustments for future homework assignments.  He also wrote great solutions for all of the homework assignments. \nThe exams were very straightforward and he made it clear that he didn't want them to be stressful.  We were given a good idea of what to expect from each one, and he wrote practice exams to help us prepare.  The problems he expected us to solve for the first time were orders of magnitude easier than the homework problems, and there were also problems from the previous homework on the exams.  \nI only have one complaint, and that’s the this was the only upper-level math class he has taught here!  I know that many of us would've love to take more classes with him in the future.\n\nWorkload:\n40% Homework Assignments - Interesting but usually very time consuming\n25% Midterm Exam and 35% Final Exam - Both were very reasonable and straightforward.  \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "May 08, 2015",
            "review_content": "\nI'll get the important stuff out of the way first:\nUnless you are a math (or related) major and/or coming fresh out of an exceptionally rigorous AP Calc course, do not take Calc I with Paul. \nNow that we have that out of the way, here's the \"nitty-gritty.\" Paul is an exceptionally nice guy, he's very approachable, and he hasn't been grown to hate teaching yet. He really loves math (and fun dorky jokes peppered throughout his lectures). But if you don't know from experience already, mastery of a subject doesn't always mean that you can impart this knowledge in digestible terms to newcomers. \nThe beginning of the course is a fairly comprehensive (albeit, short) review of key pre-calc and trig concepts. If you don't know them already, don't expect him to take the time to stop and explain it to you. Not only will you most likely end up more confused than you were, but you'll also be leaving less time for him to explain the heaping pile of material he crams into one period. Your best option is to scribble a note about the things you don't understand and take care of it on your own time. \nAbout that \"own time,\" though: don't expect to have too much of it. Written homework and WebAssign problems are assigned every week. The WebAssign problems are annoying (due to the strict syntax you have to use when inputting answers), but shouldn't take you more than 2 to 3 hours, max. The written homework is an entirely different animal. On average, I spent 7-8 hours on written homework, per week. Rather than enforcing newly-learned concepts through repetition and slight variation, Prof. Siegel likes to use problems that are \"exceptions to the rule,\" or that hinge heavily upon identities that were either, a: never introduced in the class, or b: brushed over during a lecture. As a result, you most likely will not completely learn the course's material unless you spend a lot of time practicing it in your free time.\nI can hear you already: \"This guy writing the review is an idiot. There's no way the class demands that much time.\" An idiot I may be, but I can safely say that I was among the majority in experiencing these difficulties with this class. When he posts homework, a deluge of his students populate the Math Help Room, and they steadily comprised the majority of the population for the entire semester. The TAs in the room constantly comment about how difficult the homework problems are, and often, THEY have trouble solving them. On more than one occasion, a group of us have worked through a problem with a TA for over two hours. It got to the point where I was greeted with groans and \"oh god, I'm sorry...\" when they heard which class we needed help with. \nDifficulty aside, the other main problem with Professor Siegel is his lack of communication. Emails go unanswered for weeks, his office hours are so densely populated that they turn into a pseudo-tutoring section (which is sometimes extremely helpful, but more often serves to confuse), homework isn't handed back for weeks (usually after the exam for which it would be most relevant), and the grading policy is as clear as a puddle of mud. He explains at the beginning of class that the entire course (not individual assignments) will be \"curved somewhat,\" but doesn't explain what it will be curved toward. Given that the average grade on the first exam was a \"D-,\" and the second only improved to a \"C,\" hopefully the curve is pretty generous. Regardless of the curve, this should be a big blinking indicator that your students are struggling. \nI'm sure that if you have an extremely solid foundation in calc, Paul is an instructor who will challenge you and help you to investigate the less common components of a calculus curriculum. If that doesn't describe you, find another professor. I have never encountered a more demanding course.\nWorkload:\n6+ hours of homework per week, 2 midterms, 1 (comprehensive) final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 13, 2015",
            "review_content": "\nI'm not sure that Paul Siegel is the best Calc I teacher, but I would definitely recommend him for taking Calc I. I came into the class having taken High School Calculus (which is easier than AP Calculus AB), so I had seen about 80% of the material we learned in class. However I did not have the greatest grasp of it. The class starts off with a long review of pre-calc and at times for me this felt very roundabout. However maybe for others with no calc experience this was helpful... The class starts with pre-calc and ends with integration (volumes, polar coordinates, substitution). There are two midterms. The first one is on pre-calc and limits. The second one is on derivatives (derivation rules, implicit differentiation, related rates). No midterm covers integration and this part of the class is brief. Because of this integration is the most challenging subject of the class.\nHowever Paul is a great teacher that actually cares for his students and he doesn't want anyone to fail. His office hours are the best for HW help and he's willing to talk to/work with struggling students. Paul gives written and online HW; the written HW is hard (however if you look online you can find solutions to the problems.) One note is that the TAs for this class are completely useless. The only place you can reach them is in the Math Help Room, however once you go there it's hard to recognize they are the TAs for the class because they don't distinguish themselves from the other helpers at the Math Help Room. Sometimes the TAs would not even know how to solve some of the problems on the homework! Worst of all the TAs grade the homework and seem to arbitrarily grade. Paul would show one way to solve a problem in office hours, then the TAs would mark the problem wrong without indicating where points were taken off.\nThis class was definitely harder than my high school calc class. There may or may not be a curve at the end of the class. For class we had a slight curve. I had an 83% raw grade which was given a B+. I know this isn't the best, but I'm going to try harder for Calc II.\nWorkload:\nOnline and written HW each week. Online HW is easy, wrtten HW is hard. HW is 150 points (30%) together (WHW 75 points, OHW 75 points), lowest written HW dropped.\n2 Midterms. Each midterm is 20% of grade.\n1 Final (HARD). Worth 30% of grade. Average for final was 49/75. I got a 56/75.\n\n"
        },
        {
            "course_name": "Topology",
            "review_date": "December 22, 2014",
            "review_content": "\nPaul is a great guy whose enthusiasm both for teaching and the material is very obvious.  He moves through lecture at a pretty reasonable pace and often asks the class questions about what they think the next step in a proof might be, etc.  He is always well-prepared and very organized -- over the course of the semester he typed up 50 pages of notes (updated at least weekly) that detailed nearly everything done in class (complete with proofs, examples, and exercises) and these were enormously helpful.  That said, we covered a lot of material (I believe approximately Chapters 1-5, 8) in Munkres and I found the homework to be quite challenging, especially some of the Algebraic Topology at the end.  Overall, though this class was probably harder and more work than I'd expected after hearing people who'd taken it previously with other professors, it was very well done and Siegel is very helpful and responsive both via email and in office hours (where he will often go through the idea of the proofs of hw problems). \nWorkload:\n1 Problem Set/Week (generally challenging)\n1 Midterm (5 problems, this was straightforward and almost entirely from notes.  There was one problem from a homework (the hardest on the test) and one that we had not seen before\nFinal: 8 problems, each consisting of a definition and then a related proof.  Most problems seemed fairly straightforward but the material was harder than the midterm and a couple of the terms were things we'd only seen/used once.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 18, 2014",
            "review_content": "\n...by far the most incredible math instructor I have ever had. If there is proof of God's existence anywhere on Earth, I'll be damned if this man's teaching ability is not it. I have a newfound appreciation for mathematics and I've never considered myself good at it.\nWorkload:\nExams are easier than the problem sets; that's a very good thing. Then there's WebAssign which is as simple as it gets.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 28, 2013",
            "review_content": "\nI hated math in high school, but calc with Paul was actually fun. You can tell Paul is passionate about math and teaching; he actually wants you to understand the material well, understand how it's applicable, and do well. He's also funny.\nThat being said, this class was not by any means a breeze if you aren't already comfortable with calculus. Even with his Big Lebowski quotes (\"You can't just do whatever you want. This isn't Nam. There are rules.\"), sometimes I just didn't know what was going on. Paul loves abstract math. He loves the theoretical and conceptual. I never understood these sometimes long-winded explanations, but he would always follow up with many, and different problems to showcase the concept. \nThe WebAssign was fair - if you can do the WebAssign, you'll be fine for the exams. The written homeworks were a different story. Paul makes them up himself, and many of them are proof-based, so good luck trying to google the answer. A few of them were okay, but most of the time they were a joke. I went to the math help room a few times, and none of the students could figure out Paul's homeworks. Go to Paul's office hours for help. He will help. You will be fine.\nThe first exam was mostly precalculus and some limits, somewhat tricky. The second exam was absurdly easy. Paul told us himself he wanted it to be as predictable as possible. The final was reasonable. Paul also gives practice exams which were extremely helpful in preparing for the exams.\nPaul might be too smart to teach calc I, but he's an awesome teacher nevertheless. I will definitely try to take his class if he ever teaches calc III. \nWorkload:\nWeekly WebAssign and written homework, two midterms, one final, also opportunity for extra credit at the end of the semester\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 26, 2013",
            "review_content": "\nThis course was fine, but definitely not great. Professor Siegel believes in giving very challenging homework, and very easy exams, and I'm not sure yet whether that was a good thing or a bad thing. Monday nights before the homework was due were incredibly aggravating. Office hours were held in a tiny room, so some students got a seat in the room while other students would line up outside the door as Professor Siegel essentially taught a whole class on how to solve the written homework problems. Every so often, he would rotate students out of the room who had been there for a while and take more students from the hall. A few times, my trip to office hours took over an hour despite having one tiny question about a problem. The math help room was usually extremely helpful (often more helpful than office hours), but sometimes the TAs there could not explain as well as Professor Siegel. Professor Siegel encourages students who cannot come to office hours to make meetings with him privately, and apparently he is an amazing teacher individually!\nNonetheless, the exams were great. The first exam came as a surprise - I ran out of time and definitely could have studied more effectively. However, the second exam and the final were super easy (and I swear, I am not a crazy math genius - I did take part of Calc. I already in high school though, so I had already been exposed to the material before this semester).\nWorkload:\nWeekly homework: about 10 webassign problems and 3 written problems\n2 exams and a final exam\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 23, 2013",
            "review_content": "\nProf. Siegel is a good professor, though if you had a decent calculus experience in high school, it really isn't necessary to attend his lectures. The class starts off in a really slow pace (almost half of the semester was spent reviewing pre-calc material) and then the actual calculus topics are rushed at the second half of the semester. Prof. Siegel really tries his best at teaching, even tries to make jokes here and there. No matter how entertaining he tries to makes the class to be, it's always going to be dry and boring. Try to sit near the front of the room so that you can actually see the example problems he is scribbling because that's what he is going to do the entire class. It's the effort that matters, right?\nHis written homework are literally so ridiculous. About half the class goes to office hours, though every time I go, I leave almost just as confused with the HW as I was coming in (lectures don't help with the hw). The math help room is usually filled with his students trying to figure out the written hw. Sometimes you're better off just scribbling some equations and derive some equations in an attempt to receive partial credit. The online HW were much easier, though they become more difficult near the end of the course (partially because the end of the semester and the actual calculus material feel rushed). His midterms were the exact opposite of his written HW. They were easy. As I've said, if you've had a decent calculus background, you will most likely do well on his midterms. If you don't, focus your studying on the practice exams. He always posts practice exams which are very similar to the actual exam. If you can do those well, you'll do well.\nBecause this is calc I, there really is a large range in the class: some have never taken calculus and some have a good calculus background. He tries his best to help those who are having more of a hard time (hence why we spent so much time with precalc) so he offers extra credit to students who received below a B on the midterms. He is a great professor overall, though I just hope he planned the timing of the course better so that we could have learned more calculus.\nWorkload:\nwritten and online HW every week, two midtems, one final\n"
        },
        {
            "course_name": "Calc IV",
            "review_date": "December 11, 2013",
            "review_content": "\nPaul Siegel made Calc IV my favorite class in all of my Columbia career. Seriously, this man is a gem in the Columbia math department. He is approachable, organized and very clear in presenting the material. The course is a challenge but he makes it so much more fun and surprisingly enjoyable. The weekly homeworks can be scorchers but go to his office hours and crowd in with 20 other students while he takes you through the hard proofs but yet allows for you to learn and figure it out on your own.\nSeriously, this man is an AMAZING PROFESSOR and TRULY deserves the golden nugget!\nWorkload:\nWeekly problem sets. 2 Midterms. 1 Final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 09, 2013",
            "review_content": "\nPaul was great, but definitely we suffered because of his Calculus IV background. The lectures were coherent, but our examples were quite difficult from the get-go and thus some concepts are going to be hard to learn for you if you are not familiar with calc prior to this. The written homeworks were impossible, and resulted in 30-60 (ranging each week) of us going to his one two hour office hour session. These homeworks definitely led to a lot of academic dishonesty because they were so difficult. WebAssign was decently easy, 1st midterm ridiculously hard, 2nd one average. Yet to take the final, but hopefully fair. TAs are VERY generous on homework. I just don't think Paul has realized how hard he makes the material in his class sometimes, especially when none of us have seen calc before. I feel like I haven't learned as much calc as I'd like.\nWorkload:\nMedium. 11 written and webassign homeworks. 2 midterms (1st hard, 2nd all right) 1 final. Must do the homework because it's a decent part of your grade!\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "May 21, 2013",
            "review_content": "\nPaul is truly exceptional. He is a great professor who takes his teaching role very seriously and does not make anyone feel incompetent. I certainly asked my fair share of feeble-minded questions, but he was never condescending or impatient. On the contrary, he sees every question as an opportunity for him determine what you have yet to learn and to tailor an explanation especially for you. He is awesome in this way; he will usually try a handful of approaches and analogies (these are often funny and make students laugh, another major reason to enroll in his section). \nThe day before homework is due he holds office hours where he goes over all the problems as many times as he is asked! He is also available for questions after lecture and if you email him to set up a time outside of office hours. He has a natural kindness and sincerity to him and he is always happy to meet with students and to help in a meaningful way. Did I mention that he is American? In case you have a phobia of Eastern European or Asian math professors, he is your savior. With that said, I would take his class irrespective of your mother tongue because he is honestly incredible in so many ways. His humility, humor, ability to explain the simple and not so simple in a straightforward way make him a very \"student-friendly\" professor, if you will. He will pepper his lectures with story time about mathematicians (if he forgets, remind him to tell you about Fourier and the wine cellar when you're in Calc IV), will rig his problems to have pi as the solution on March 14th, and will engineer a fun \"orientometer\" to help you with Stokes' Theorem. \nCome to class on time, he doesn't waste your tuition money and invariably starts on the dot. He puts lots of time into the course. He writes lecture slides which he posts before class. You can print these out and take additional notes during lecture. I wouldn't recommend skipping lecture though since he works out useful examples. I referred to these when I worked on the homework. He writes the written homework problems, two practice exams before each midterm and similarly before the final. He posts solutions to everything in a timely manner. By the way, the written homework is doable, just takes more time than the online (which is based on textbook exercises). Since written homework is less computational, I was afraid that I would be struggling with cryptic proofs, but they were not unreasonably challenging, and if you're stuck just go to office hours and you will feel better, guaranteed. \n I am usually nervous around professors but he doesn't have a forbidding presence. He is very nice and is eager to help you. In addition, he is young, so you'll understand his cultural references. He is unique in that he can bridge the accessible and the abstract. Oh I almost forgot... his self-depreciating comments about brain damage are endearing at times, but always so unfair. So what are you waiting for? Do you want a professor with an acute mind, a gentle heart, a teddy bear build, and a boyish innocence to educate, enlighten, and entertain you biweekly? Go register for his section while you can!\nWorkload:\nWeekly online and written homework; all together we had 11 online assignments and 10 written assignments. He drops the lowest written HW score. Homework is worth 30%. The final is also worth 30% percent and the two midterms are 20% each. No late HW's, no extra credit. \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "May 20, 2013",
            "review_content": "\nSiegel is the man. Great guy, and one of the best math professors that you can have. \nOverall, Siegel's an extremely effective teacher. Going to lecture is really worth your while because his lectures are logical and relatively easy to understand. He puts his lecture slides online, but the problems aren't solved in the slides because he solves them in class. He is great at explaining concepts and answering students' questions, so again I'd recommend going to class. He's also a really funny dude, and he's fairly young so he relates to his students well.\nWe were required to buy Webassign ($75), but the online homework was never too difficult and was very useful for learning basic concepts. On the other hand, the written homework could be difficult at times (I think he writes some of it himself), but if you worked with friends in the class it wasn't too bad.\nBefore the two midterms and final, Siegel uploads two practice exams with solutions, and the actual exam is very similar to these. If you can do the practice exams, you should be fine for the exam because there really aren't any surprises. The material gets pretty hard after the first midterm so make sure you keep up with the work. You really can't learn the material the night before an exam.\nSiegel's also pretty accommodating. He'll let you hand in homework late if you have a good excuse, and he offered an alternate final exam date for people with busy exam schedules.\nIn conclusion, I highly recommend taking Calc IV with him.\nWorkload:\nWeekly online homework (not too difficult) and written homework (more difficult).\n2 midterms and a final - similar to the practice exams.\n"
        },
        {
            "course_name": "Calc IV",
            "review_date": "January 22, 2013",
            "review_content": "\nPaul Siegel was the best Math professor I've had so far in Columbia. His lectures were straight forward and well explained (which can be challenging to achieve in Calc IV) and the hw/exam questions were similar to his examples. He had organized power points but the real benefit of attending lectures was that he had great examples. If you take notes on those the homework should be quite easy.\nHe is also quite funny, friendly and an extremely nice guy.\nIn the beginning of the semester he was not going to curve our grades but as we progressed and some students talked to him he accepted that it would be unfair not to.\nThe exams were not bad if you went to class and followed his examples, and he is usually accommodating with office hours or if you have any extra questions.\nHe had us sign up for webassign, which sucks because it costs 75 dollars, but those problems were usually not very hard.\n\nWorkload:\niWeekly online and written homework, the online one is considerably easier but he'll give you hints on the written one the class before it's due. 2 midterms, the first one was easier but both are manageable and one final similar to the second midterm. \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 16, 2013",
            "review_content": "\nVery solid professor. Overall he explained things fairly well and was crystal clear on what would be on the exams. He speaks English, which is an increasing rarity in the math department. He showed up to office hours and would occasionally explain a hard homework problem the class before it was due. The class was heavily computation-based and Siegel frequently taught the class from a physicist's/engineer's point of view (as opposed to a mathematicians.) Proofs only showed up in the written homework assignments and were usually doable, and Prof. Siegel was more than willing to answer questions before/after class and in office hours. There was no surprises on the midterms or on the final. Most of the difficulty in the class stemmed from the material itself rather than from the way Siegel presented it. (Ex: Stokes theorem is a buzz kill.) If you're registered for Siegel this semester you're in luck. \nBefore you register for Honors Math, consider taking Calc III or Calc IV (depending on how much multivariable you've had in high school.) You'll save yourself hours of banging your head against a wall listening to esoteric lectures on proofs. \nWorkload:\nOne online homework (easy) and one written homework (ranging from somewhat difficult to occasionally very challenging) per week\n2 Midterms \n1 Final \n(The syllabus claimed there'd be announced quizzes but I never had one) \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 21, 2012",
            "review_content": "\nTake a class with this man as long as you have the chance! Paul is a very clear lecturer, incredibly fair, speaks perfect English and even has a good sense of humour. Usually, having just one of these qualities is enough to elevate a math lecturer to \"above average\", so you can understand how excited I was about having Paul as a professor. \nTo give you a better sense of the actual classes, he usually would spend about the first 15 minutes on the intuition behind a concept and the rest of the time on examples; so basically, there are a lot of examples. If you're one of the rare people who do really well with math theory and want to know the details behind all the theorems, this class might not be ideal for you, but I loved it. On the plus side, you'll also never be expected to prove something or solve a theory question on the exams. Paul was very clear about what was going to be on the exam, and if you've been going to classes you will encounter no surprises. Calc IV is probably not the hardest class in the world and you could teach it to yourself, but I went to every single lecture, and I never once actually opened the textbook because everything was so clear to me, and I do believe that Paul can take most, if not all the credit for that.\nHe's also kind of cute, and pretty funny. And super nice, if you go to his office hours he will definitely help you a lot with the material or the weekly homework which can be a bit challenging at times (as it's more conceptual than the lectures and the exams).\nIn short, if you have to take Calc IV, then Paul is probably your best bet by far right now.\nWorkload:\nWeekly straightforward online problems that you can redo, so everyone basically always gets 100%.\nWeekly written homework that can be a bit challenging, but he will help you out if you ask him.\nIncredibly fair exams; he gave us practice exams for all of them that mirrored the actual content very closely. I also found that thanks to the weekly practice through the online problems I had to put in barely any studying for the exams and still did well. Overall, not bad at all and you will definitely not run into any unpleasant surprises during this class, which I highly appreciated. \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 20, 2012",
            "review_content": "\nProfessor Siegel is the best math professor I've seen in Columbia. I've taken about 6 math courses so far, and he is THE BEST!! I am quite surprised that there is no reviews about his classes yet. \nHe teaches really, really well. He is very willing to help, has a nice humor, and has everything you would expect from a good professor. His classes are fun and very productive. Columbia should make clones of him and let them teach all the math classes. \nWorkload:\n5~8 WebAssign problems (relatively simple) and 3~5 written assignment problems (harder, but he covers it in the class before the deadline) per week.\n2 Midterms and a Final (master the practice tests and you will be fine)\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 11, 2012",
            "review_content": "\nThis is a strange man, and a very good instructor. I never felt confused about any of the material and he presented everything clearly and succinctly. He also kept the class entertained with short stories from time to time. Always responded to emails, was easily available, and exams and homework felt very fair. He also gave written homework that I think he made up, which seems like a pain and sometimes was but also enhanced my understanding of the material. He definitely went above and beyond as an instructor. I really recommend this guy! \nWorkload:\nWebAssign homework which is basically an automatic A, written homework, two midterms, final. All expected and normal stuff.\n"
        },
        {
            "course_name": "Calc IV",
            "review_date": "November 14, 2012",
            "review_content": "\nThe best math teacher that I have had at Columbia so far. Genuinely nice guy who cares about his students and has a funny sort of geek persona. I wouldn't say that the class is necessarily easy,  especially because the students tend to be pretty competent, but it is very reasonable and Paul isn't aiming to make our lives difficult.  He is not the sort of professor who will go to mind-beinding lengths in order to show you why the stuff you learn is interesting. But he teaches you the basics that you should be expected to know in a dependable, steady fashion which also means, thankfully, less self-studying if you are the sort that goes to class regularly and pays attention. I would take this class if you are looking for a solid Calc IV which, essentially, isn't going to kill your workload and which you can still learn something in.\nWorkload:\nNot bad. We get a couple of generally easy questions on Web Assign then three written ones which are more proof-based. Two midterms and a final as usual. The class tends to do well in these so it is challenging in the sense that the averages are high, but the exams themselves are not bad. \n"
        }
    ]
}