{
    "prof_info": [
        {
            "prof_name": "Catherine Savini",
            "prof_id": 3339,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 20, 2007",
            "review_content": "\nProfessor Savini was a really good professor.  She would give us assignments that actually led us to something that would help with our progressions (crazy, I know).  Also, her availability is pretty good, if you need her help, and since she's the head of the writing center, you know that the help she gives is decent.  When you conference with her, instead of her directly telling you what to do, she helps by asking questions which lead you to discover for yourself what it is that you really need to be doing.  I feel like the grading may be slightly harsher than others, given that she is the head of the writing center, but at the end of the semester, I definitely knew different writing moves and methods that my friends in other classes did not know.\nWorkload:\nGenerally three assignments per progression, plus three drafts.  Grades are calculated as 25% for the first essay, 30% for the second, 35% for the third, and then the fourth progression (which has no surrounding assignments) is 10%\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 20, 2007",
            "review_content": "\nCatherine is a terrific instructor. She makes what is usually an awful class surprisingly bearable.\nThe only problem is the nature of the class itself. It gets boring and repetitive.\nCatherine, however, will do her best to make you a better writer. She comments scrupulously and tells you exactly what you need to do to make a paper better.\nWorkload:\nFour essays. Worth 25, 30, 35, and 10 percent. She offers an opportunity to rewrite either the first or second at the end of the semester. There are daily ungraded assignments which are usually interesting. Make sure to turn drafts in on time because she really does help you write a better paper.\n"
        }
    ]
}