{
    "prof_info": [
        {
            "prof_name": "Maria del Pilar Valencia",
            "prof_id": 1266,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Spanish 1202",
            "review_date": "September 17, 2008",
            "review_content": "\nPilar is an amazing and wonderful professor. She is a true golden nugget at Columbia.  Pilar takes teaching to heart and wants to see students learn, understand, and enjoy the language.  If you can take the long summer course -definitely do, because it is like personal tutoring when there are few students registered.\nPilar is an engaging person and teacher and keeps the course material interesting and up beat. The workload is fair, maybe lighter than other Profs. however, you MUST know all the course material up to your course level, so if you had it easy before you will have to fill in the gaps in your Spanish knowledge during the course. Pilar explains everything very systematically and clearly.\nMoreover, do all the assignments because you will feel bad for showing up to class without your work -not from fear or worry, but because you would just personally feel really bad if you disappointed Pilar.\n\nWorkload:\nRealistic (not tons like other teachers) - knowing and understanding the material/topic is more important. weekly chapter work, 6 movie/topic essays, department midterm, final.\n"
        },
        {
            "course_name": "Intermediate II",
            "review_date": "June 30, 2008",
            "review_content": "\nAs someone with little to no real interest in taking a language credit having Pilar was an amazing gift. She is by far the nicest Professor I have ever encountered at Columbia. Always available to help and never impatient, Pilar proved my previous distate of language Professors whotly wrong. I almost considered continuing my Spanish studies...almost.\nWorkload:\nAn exam following each section, homework that actually helps.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 11, 2007",
            "review_content": "\nShe is an absolutely amazing teacher. Her class is always engaging and amusing. Pilar tends to be more enthusiastic about the books than the students, but it makes for a great discussion. As a grader, she at first tends to be difficult on discussion posts and papers. However, she always gives helpful advice to improve your them, and as you take that advice to heart, the grading definitely improves as well. The midterm created by her is extremely fair and as long as you read, it will not be a  problem. Overall, she is the best Lit Hum teacher ever!\nWorkload:\nThe usual reading with a discussion post once a week. Two to three papers dispersed throughout the semester.\n"
        },
        {
            "course_name": "Spanish 1202",
            "review_date": "January 04, 2005",
            "review_content": "\nIncredible. The nicest lady I've met; she made me excited to come to a Friday morning class, even when I had to wear sun glasses and sip water the whole time. Pilar helps out her students and clearly enjoys her position. A native spanish speaker, she absolutely knows what she's doing and does an excellent job helping her students to understand Spanish structure. Her antecdotes and personal stories made the class highly enjoyable. She seems to be a close friend as well as a teacher, however she maintains her authority when it is needed. She is very approachable. If you are going to take spanish, take it from this goddess.\nWorkload:\nEasy. Homework each class, but it takes maybe 15 minutes to do online. \nQuizzes every two weeks (a breeze), a midterm an oral final and a final. 3 - 5 essays, the hardest part of the class. She's a loose grader. \n"
        },
        {
            "course_name": "Intermediate I, Intermediate 2",
            "review_date": "May 25, 2004",
            "review_content": "\nPilar is just fantastic. She is young, energetic, cheerful, helpful, and all about getting her students to enjoy the Spanish language. She is not above giving very encouraging grades. She talks quite quickly, so definitely pay attention on the listening parts of quizzes, but she makes it very clear that her number one priority is to help her students. She comes from Colombia and has a lot of interesting stories. I wish she were teaching higher level Spanish classes so that I could just stay in her class for the rest of my college career. TAKE HER CLASS!\nWorkload:\nNot too bad. Varies, actually. In intermediate 1, we had relatively easy homework almost every day, but in level 2, we literally had almost no homework. The compositions might seem long (500 words or so), but she is not a cruel grader. \n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "January 14, 2004",
            "review_content": "\nProbably the best professor I've ever had.  Incredibly enthusiastic, dedicated to her students, and very knowledgable about Latin American culture and, most importantly, the Spanish language.  She always seemed excited to teach class and made me happy to be there.  Do not miss having her as your professor.\nWorkload:\nEasy biweekly quizzes, a few annoying lab exercises in the workbook, and daily workbook assignments.  Easy midterm and easy final.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "November 19, 2002",
            "review_content": "\nPilar is a great professor! I was wary of taking Spanish five days a week and cutting out my totally-free-Fridays, but she is totally worth it. She's always completely energetic, very approachable, she makes sure she gives a good balance of language and culture, gives practical advice on your spanish speaking skills to prepare you to use it in everyday life, and is just completely sincere in everything she does. Class is never boring and not difficult at all. Plus if you're shy and hate speaking up in language classes like me, she calls on each student equally so everyone is forced to participate and everyone screws up once in awhile.\nWorkload:\na few workbook exercises each night that take about 5 minutes, around 5 easy quizzes where the lowest grade is dropped, a couple compositions, weekly language labs that take one hour each, and an easy midterm and final.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "November 18, 2002",
            "review_content": "\nPilar kicks major ass. She's straight from Colombia, so shes obviously fluent, and the entire class is taught in Spanish. She is young and pretty and stylish - just this tiny little ball of Spanish speaking energy. She jumps around the classroom speaking a thousand words a minute, and the weird thing was that I could understand every single thing she said. She's an awesome teacher - I came to the class knowing nothing and after one semester, I can get by pretty well and understand nearly everything that an average Spanish speaking person would say. And plus, her class is easy as PIE. It's partially because she teaches so much in class that studying is not necessary. I got an A and I didn't do much. TAKE THIS CLASS and not only will you fall in love with Pilar and want to have her as a professor for the rest of your years here, but you will also love spanish.\nWorkload:\nEASY EASY homework every day that is just gone over in class, 5 or 6 quizzes (don't even study for these), language labs, a midterm, a final, and an oral exam. Don't be put off by the work - almost everyone did it an hour before class.\n"
        }
    ]
}