{
    "prof_info": [
        {
            "prof_name": "Kathryn Neckerman",
            "prof_id": 198,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "V1202 The Sociological Imagination",
            "review_date": "December 31, 1999",
            "review_content": "\nThe subject material is pretty interesting. This is a course focused around a reading list of approx 5-6 books. The class lectures and discussions themselves aren't exactly intriguing, but that also depends on the students. A fair amount of work considering the reading and papers. Expect a TA to do the grading.\nWorkload:\n5 papers (3-4 pages), final.\n"
        },
        {
            "course_name": "V1202 The Sociological Imagination",
            "review_date": "December 31, 1999",
            "review_content": "\nI really got screwed with the grading in this class. The TA was this really incompetent grad student who seemed to have tremendous difficulty in understanding anything more than a simple sentence. Take this class at your own risk.\n"
        },
        {
            "course_name": "V3225 Sociology of Education",
            "review_date": "December 31, 1999",
            "review_content": "\nProbably will be a big lecture, but she makes time for discussion, and if you're not shy, it's easy to get in an opinion. She doesn't mind being interrupted with questions as do some professors, which is nice. The material is spread out, and some may say spread thin, but I think for a survey course it does justice to the major topics...especially the sickly state of many public schools in non-suburban, non-white districts. It pays a lot of attention to inequalities and performance disparities. Lectures are on target. Neckerman is knowledgeable and capable professor.\nWorkload:\nWon't send you reeling....2 papers: 1 short and 1 long. Very flexible with submission tardiness. Final is not that tolling if you've done the reading. And even if you didn't do the reading during the semester, the material is accesible and interesting, so cramming the night before is a viable option for the lazy at heart!\n"
        },
        {
            "course_name": "V1202 The Sociological Imagination",
            "review_date": "December 31, 1999",
            "review_content": "\nGreat class! Neckerman is an engaging lecturer who does not mind interrupting her lecture for thought-provoking discussions. Very lenient policy on late papers. Some of the readings are dense and dry, but most are fascinating. Highly recommended.\nWorkload:\n2 papers (5 pp.), group research project (8 pp.), midterm, final.\n"
        }
    ]
}