{
    "prof_info": [
        {
            "prof_name": "Edward Pomerantz",
            "prof_id": 2109,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Filmwriting ",
            "review_date": "January 31, 2008",
            "review_content": "\nDO NOT TAKE THIS COURSE. I got an A- in the class so I am speaknig from honesty when I say Pomerantz is insane. He will constantly put you down in front of the whole class and when you have private meetings with him. He puts all his anger and frsutration on his students. The guy is nuts, seriously. He will yell like crazy in class and trust me its not in a good or entertaining way. Its scary. I am still feel the trauma I once did when I was in his course and that was a couple years ago. You will dread going to class, stay away from this man. Take David M instead, I heard he is amazing. \nWorkload:\nLike any filmwriting course...twenty some pages by the end of the semester. \n"
        },
        {
            "course_name": "Filmwriting Workshop",
            "review_date": "November 14, 2004",
            "review_content": "\nHe's a good guy, and he genuinely cares about teaching. He knows what he's doing because he's been through it. Can be a little flighty at times when he really gets going, but even then its because some sense of drama has hit him. Check out his movie or novel \"Caught\" if you want to know more about his work/experience. I own the movie and its pretty good.\nWorkload:\n20-25 pages by the end of the semester. If you really want to learn to screenwrite, however, write as many pages as you want. He'll read them, and he'll meet with you every week. And he'll teach you.\n"
        },
        {
            "course_name": "Filmwriting Workshop",
            "review_date": "May 21, 2004",
            "review_content": "\nHe can come across as stern and borderline gruff at times, but only because he cares deeply about what he's doing and takes it very seriously.  Once the class gets under way, however, he becomes charming and very personable and generally will join the class in laughing heartily in response to a funny scene or some joke.  He reviewed basic screenplay formatting for about the first 30 minutes of the first class, then ceased structured pedagogy for the remainder of the semester, repeatedly stating there is no formula or proper way to write a story.\nStudents regularly goofed around and shouted out things in class and he seemed to relish this.  Having written a produced script, he knows what he's doing and has a keen eye for finding problems in your work, and will almost always do so with supportive and helpful remarks.  This class was a load of fun and very illuminating.\nWorkload:\nExpects you to hand on pages on a semi-regular basis and comments on them without grading.  Grades are largely contingent on your final work, which is 25 or more pages, and some class participation.\n"
        }
    ]
}