{
    "prof_info": [
        {
            "prof_name": "Michael Shaevitz",
            "prof_id": 1768,
            "total_reviews": 25
        }
    ],
    "reviews": [
        {
            "course_name": "General Physics I",
            "review_date": "June 03, 2013",
            "review_content": "\nShaevitz was a nice break from the Mowsh Bio, as you knew what to expect on the quizzes, midterm, and final. Make sure you put in the time for each quiz and the midterm+final will be just review, making it much easier. Going to class is not a necessity, since he really did not explain some of the concepts that well. I received an A+ by studying and getting near perfects for each quiz + doing all of the problems, and understanding the concepts behind them, acing the midterm and missing little on the final. Honestly, the great thing about this class is that you can predict what kind of questions Shaevitz likes to ask and understanding the theory behind them. I feel like I am confident in physics, but maybe still not confident as I am biology for the mcat even though I did not do nearly as well in biology. Take advantage of this class since biology will most likely drag your GPA down. All in all, this class was a great class and I would take it again in a heart beat. \nWorkload:\n12 Quizzes, Midterm, Final. Keep up with each and you should be fine. Does not really curve, as the averages are in the high 70's. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "February 07, 2013",
            "review_content": "\nSo I really don't understand how Prof. Shaevitz earned his silver nugget. He isn't an awful professor. (I've had worse.) But he isn't particularly good in lecture. Sure, I will admit that his section of premed physics is probably the easiest section at Columbia. (How often is it that 20+ people get 100's on a midterm?!) And maybe the lack of GPA-induced stress in Shaevitz's section explains for his \"popularity.\" But that shouldn't make this man deserving of a silver nugget. I have the MCAT coming up this semester, and I don't feel particularly well-prepared in physics (based on what I learned in Shaevitz's section). Learning how to plug and chug numbers into equations is not equivalent to learning physics. If anything, Shaevitz's section does not feel like a legitimate physics class. Rather, it feels like a throwback to my old high school science classes. (Some people feel that their AP Physics classes in high school were harder than Shaevitz's class. Mine certainly was.)\nAn earlier review describes the professor's lectures as stale, and I totally second that. Below is what happens during just about every lecture: \nShaevitz comes into class. -> He flashes a wide smile. -> He writes a bunch of derivations on the board.  People occasionally ask him to explain the derivations that he writes on the board (assuming the class is actually engaged). -> Oh, you don't need to know that for the test, we are told. -> He flashes another wide smile. -> Prof. Shaevitz does a demo. (Without fully explaining the relevance of the demo.) -> The demo doesn't quite work. -> Oh well, says the professor. -> He flashes a toothy grin. -> Then he proceeds to write more derivations on the board. He skips a bunch of steps in the derivation. -> A few minutes later (midway through the derivation), he tells the class (he clearly thinks we are math-phobic): \"We know what to do when we have differential equations! We plug in the answer!\" -> A wide smile is flashed. -> The professor skips even more steps in the derivation. He makes a bunch of logical leaps and finishes the derivation. -> The class is confused but no one bothers to raise their hand. (These derivations are obviously not going to be on Shaevitz's tests, so why bother paying attention?) -> Sooner of later, Shaevitz completes his derivation. -> Time for another toothy grin. -> Now it's time for another demo. -> The demo works this time and is actually kind of cool. (Though the relevance of the demo, once again, isn't explained.) -> Pleased that the demo worked, the professor flashes yet another grin. The toothiest and widest grin of all. \nWhile Shaevitz's class is relatively easy in comparison to other required premed classes, don't expect to develop a deep understanding of physics from this class alone. You are going to need to put in a lot of INDEPENDENT work, and if you are in Shaevitz's section, it is up to YOU to take the initiative to learn enough physics to be well-prepared for the MCAT. The professor seems to be a nice guy and is willing to help you. Prof. Shaevitz also has a wonderful sing-song voice and an even more wonderful smile. You may be charmed during your first few lectures. But it gets old kinda fast. \n\nWorkload:\nplug and chug for the hw assignments, plug and chug for the quizzes, plug and chug for the midterm/final\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 14, 2012",
            "review_content": "\nHe really sucks at explaining concepts so this class was basically taught by the TA during recitation and I had to work extra hard to do well on tests. Its easier to get a good grade in this class because he gives weekly quizzes which make up 35% of the grade, and you can drop two of those quizzes. However this was really stressful because I had to learn the material outside of class cause Shaevitz sucks.\nWorkload:\nWeekly quizzes, midterm, final\nHomework weekly but you don't hand it in\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "October 19, 2011",
            "review_content": "\nI thoroughly enjoyed this class.  I found his lectures to be very organized and clear.  I'm truly not good at math or physics, but Professor Shaevitz presents the material in a way so that anyone can understand it.  I was even able to follow his derivations, which helped me to further understand physics as opposed to just memorizing formulas (this helps with homework problems that are not clear cut).  People seem to be annoyed with the fact that he derives formulas but honestly it helps you understand the material better and if you honestly just want to memorize formulas and be done with it you can still do so without any consequences (he doesn't quiz you on derivations).  He just presents it for those who are interested.  Those who say his lectures are stale I don't agree with at all.  Its physics, so to some degree people who are not interested in physics will find parts of it boring, but Shaevitz tries to make it somewhat entertaining by doing demonstrations in class every lecture.  At one point he stood on top of a desk to prove a point about some physics concept. Shaevitz is also extremely friendly, patient, and approachable. He has no problem answering questions or stopping to explain something again if students do not understand.  I highly recommend this class if you have to take physics.  If you go to class and the recitation and do the weekly problem sets (optional, but I recommend doing them since material on the quizzes comes from hw) you can easily make an A in this class and don't have to read the text book.  So for premed students, you can make an A easily in this class if you do what your supposed to and still be very prepared for MCATS. \nWorkload:\n35 % Weekly Quizzes (2 drops and comes from homework problems) he gives weekly problem set (11-13 problems) but they are optional and he goes over almost all of them between lectures and the recitation (it very beneficial to go to recitation but its optional), 25% midterm (covers 1st half of semester), 40 % final (cummulative of entire semester).  probably takes up about 10-15 hours a week if you include lectures recitation and homework problem\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "May 09, 2011",
            "review_content": "\nI just finished Shaevitz's E&M; final and I am writing this brief review to fulfill an overwhelming need for catharsis. I will follow-up with a much more detailed review in the future: I will describe the advantages and disadvantages of enrolling in Shaevitz's section (vs. the other premed sections) and  suggest who would be best suited for his teaching style and approach to evaluation.\nLet me preface this review with two comments: (1) this review is not motivated by proverbial \"source grapes.\"  I performed well last semester and expect to do equally well this semester.  (2) Shaevitz has the best of intentions.  There is simply a real problem with his teaching style and philosophy.  He has also taught this course for too long.  His presentation is extraordinarily stale and he seems inflexible to adapting the course to the changing profile of his students.\nIt is a struggle to convey how extraordinarily mediocre both the class and the professor are.  This is a class in learning how to regurgitate, on an endless set of quizzes and exams, a limited set of problems which Shaevitz views as canonical.  It is possible to do extremely well in this class and gain little understanding of physics.  You are effectively learning how to solve Shaevitz problems and, while one could approach solving Shaevitz problems as an avenue to learning physics, this not encouraged or required. Consequently, what distinguishes an A and B student is not their understanding of the material.  Rather, one's grade is largely a reflection of how careful one is with algebraic manipulation, pluggging numbers into a caculator, and avoiding careless mistakes. The class has means in the 90s.  This is extraordinarily atypical according to all of my friends in the pure and engineering sciences. \nThe class in best suited for post-baccs (who, frankly, do not have the same aptitude as undergrads, don't care to acquire a genuine understanding of the material, and have endless time to do problems) and undergrad students who suspect that they will struggle with the physics.  It is a class where you can do extraordinarily well by just putting hours into solving Shaevitz's assigned HW problems.  If you are actually interested in physics, have any aptitude at all, I suggest that you choose another section.  You will only be penalized in this class for attempting to really engage with the material at a conceptual level.\nWorkload:\nHighly variable.  If you have an aptitude for the physical sciences, spend 2 hours a week on the HW assignment and 2 days studying before the final.  If you must have A+ (like most of the overachieving premeds and postbaccs in this class), budget 12 hours per week --- 4 to 5 hours reading the text, 7 to 8 hours doing, redoing, and redoing the HW problems. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 21, 2010",
            "review_content": "\nTo be honest, I was not impressed with Shaevitz's teaching ability.  He is a decent teacher, but for the harder stuff has a difficult time explaining things clearly- he'll write a bunch of derivations and then solve a few problems using variables, not numbers, and then give you a number at the end which is hard to tell where it came from.\nThe weekly quizzes you've read about are very much like the weekly problems-which can be difficult.  I recommend going to see the TA during his office hours since he solves the problems clearly in a different manner than Shaevitz does which is usually clearer to understand.  \nThe midterm was definitely easier than the final, but this is necessary because the quizzes are worth 10% and the class average on any quiz is usually about an 80, and Shaevitz does not want to apply a curve to an already successful class.\nEssentially, my experience with Shaevitz was fine, but I feel like I did not necessarily learn physics per se.  Instead, I can regurgitate the homework question techniques onto my quiz / test papers and do well.\nI say take Shaevitz if possible if you are just in it for the good grade.\nWorkload:\n10 weekly quizzes, worst 2 dropped, worth 35%, midterm worth 25%, difficult final worth 40%.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 15, 2010",
            "review_content": "\nShaevitz is an amazing professor. Cheeky and entertaining, while still very informative. He writes all his notes on the board and fields questions from the repeat (as some in the pre-med world would call) \"offenders.\" He is great at answering these or pushing off the ones that really will be covered later or the annoying girl in every lecture class just asks cause. \nHe intersperses the lectures with amazing demonstrations that he is passionate about. Once splashing himself with water and still proceeded to put on a hard hard, squat on a cart and propel himself with a fire extinguisher - all to explain force. \nReally a great clear and devoted professor. Even when he missed the last week and a half (leaving it to a cute TA) to go to the SOUTH POLE.\nWorkload:\nThe weekly problem sets assigned were sometimes tough - I had a friend help me on the harder questions - but completely doable. And Shaevitz provides the answers and a help sheet so you can get going and check your own answers. Problemsets are not collected, but the best way to prepare for the weekly quizes. The quizes are one question with a number of parts and are a good easy (if pesky) way to keep up with the class. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 06, 2010",
            "review_content": "\nHaving suffered through a terrible AP physics instructor in high school, I can only conclude that those who gave Prof. Shaevitz negative reviews either had their standards inflated by one of those rare brilliant high school physics teachers or are general Columbia misanthropes who love to complain about every required class. I found Prof. Shaevitz to be a wonderful instructor. He must have listened to the comments of the people who complained about too many derivations, because he only did one or two the entire semester and then apologized for doing so. I was shocked that such a brilliant physicist was taking the time to teach the most basic physics class at Columbia and not even half-assing it so that he could keep his tenure. Prof. Shaevitz was more than willing to meet with students outside class, conducted an optional recitation in which he helped clarify concepts and problems, and on top of that did review sessions before every test, even shortening his lunch break so that the majority of students would be able to attend. The problem sets, quizzes, and tests were very straightforward and didn't contain a bit of material that he didn't cover in class. My only complaint is that the assignments were easy enough that one had to score very high to beat the curve...it's my first science class at Columbia where an 89 was a B+.\nWorkload:\nTen quizzes, one every week. Midterm, Final.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "June 06, 2009",
            "review_content": "\nI'm personally very surprised at the favorable reviews of Shaevitz here. I found him to range from awful to mediocre. His lectures are dry and dull and rarely teach the material well; most of the class didn't bother to show up. I think part of the problem is that he spends his time doing derivations rather than examples of how to solve problems. On top of that, the textbook (Halliday) is mediocre to say the least. \nFirst semester (mechanics) was to me much, much easier than second semester (e&m;). In fact, this class began to absolutely torture me second semester, much in part because he couldn't/didn't adequately explain the concepts, and these concepts are NOT simple. \nThis review is not based off of my getting a bad grade (I got As both semesters) but because it was such a terrible experience. Try to avoid Shaevitz, if at all possible. \nWorkload:\nWeekly ungraded homework and weekly quizzes based exactly off the HW assignment. Quizzes are easy. Easy-moderately difficult midterm and very difficult final. It's not that the amount of work was so bad as that it was difficult to figure out the material because of his mediocre teaching skills. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "April 22, 2009",
            "review_content": "\nA genuinely nice guy. That being said, he is not the best of lecturers. Fortunately, Prof. Shaevitz is very aware that Physics can sometimes be very tedious and boring so he does make the course as straightfoward as possible. Personally I came into the class with absolutely no experience in Physics as I did not take the course in High School but I was able to follow along with the lectures (provided I did the problem sets) and managed to stay awake through most of them. If you are a Physics newbie like I was the material is quite intimidating at first but I promise it gets easier to understand as the semester progresses and Prof. Shaevitz is not out to get you with trick questions. He really wants to see that you understand the material through the weekly quizes (most calculations are very simple and he doesn't care about significant figures.) He is very approachable and answers all questions and e-mails. Don't expect to be won over by his oratory skills, but if you want a no-nonsense Physics course that won't kill you, this is the one to take. \nWorkload:\nThere is not much work to do for this class per se, weekly problem sets that are not collected but the weekly quizes are based off of the HW. So doing the problem sets more than once is always a good idea as the combined quiz grades count for 35% of your final grade. One midterm (he gives a practice one that is similiar to the actual one he gives out in class) and one final (again he gives a practice one that is similiar.) Very straightforward workload, no surprises.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 01, 2009",
            "review_content": "\nOutstanding professor.  You definitely should take this course if you can get in. Always approachable and answers e-mails.  Always positive and helpful.  Teaching for over 20 years so he has his system and you have to learn it (do homeworks and practice problems always -- do them multiple times).  Few, if any, curveballs during the semester on quizzes and midterm although the final did have some tricky problems and it's 40% of your grade.  That said, I worked like a dog because I did not have a physics background.  Attending recitations is critical to really understanding how to do the problems and ok (I would say recommended) to attend several recitations during the week.  Attending physics help room and getting some tutoring before exams is also useful.  What I was told is that the time you put into the course is exactly what you get out of it physics learning -wise and grade-wise and I would say that is 100% true here.  To me that's refreshing -- you don't have to worry about tricks and nuances.  Professor Shaevitz is as straightforward as you can get. Just learn the material/practice problems really well and you'll get a good grade.  I'm curious how Physics II will go as I heard the material is more difficult...\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 17, 2008",
            "review_content": "\nSets you up for success! You are never blindsided by material from left field on the quizes, tests, or finals. Wonderful set-up. \nWorkload:\nLow\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 16, 2008",
            "review_content": "\nI think he tries really hard to make the class painless because he knows this is pre-med physics, and people aren't actually interested in the subject. The weekly quizzes might be annoying, but they keep you on top of the material. The homework problems are all optional but helpful (and very similar to quizzes). He's a clear lecturer and takes the time to answer questions in class. You don't really need to go to lecture, since he does follow the book pretty closely, but he often goes over the trickier homework problems in class, so it's helpful just to hear his explanations. He genuinely loves physics. You can tell just by seeing how much fun he has with the live demonstrations in class. He seriously gets pretty excited about them. And the demos are probably the best part of the class anyway. He's pretty accessible by email and holds multiple office hours during the week, although he's not terribly helpful during office hours.\nEverything in this class is incredibly transparent, including the exams. He gives out practice midterms and finals, and they're usually pretty close to what he actually ends up giving. The midterm is cake, but the final is a little harder (though still reasonable - nothing impossible). He's also very fair about what material shows up on the exam. This is probably one of the easiest V1201 sections.\nWorkload:\nBarely any. Weekly uncollected problem sets (for which he provides answers and hints, but the hints are sometimes really confusing), weekly quizzes (very close to homework problems), midterm and final. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 10, 2008",
            "review_content": "\nHe's a nice character who seems genuinely interested in both physics and the students' performance. Makes a terribly boring subject painless with relatively lively lectures and fun demonstrations (although admittedly I went to class rarely toward the end). Quizzes are easy-peasy. Midterm was fair and pretty easy. Do the homework, it is very very similar to quizzes and exams.\nWorkload:\nLow. Weekly quiz and optional hw.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "November 06, 2007",
            "review_content": "\neasy A if you take the quizzes seriously and study the HW. Midterm is exactly like the practice one. Final can throw you off a bit, but it's not that bad. If you ace the quizzes and midterm (which is pretty easy to do) then even if you bomb the final, you will come out with a pretty good grade\nWorkload:\nweekly quizzes and problem sets. That are really helpful for the midterm. A final that is slightly more difficult.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 09, 2007",
            "review_content": "\nI really liked Prof. Shaevitz. He's a good teacher, he explains things well, he does good demonstrations (although not all of them work), and my favorite, he's always in a great mood; he's always smiling. The quizzes are okay, not too hard, and the exams are difficult but not too much so. He makes good study guides that you should do because the exams tend to follow them pretty closely. I'd highly recommend taking his class. \nWorkload:\nHe assigns homework, but he doesn't collect it. There is a short quiz every Wednesday in the style of the homework questions, and the top 9 out of all 11 are used to make up 35% of the grade. Then there's a midterm for 25% and a final for 40%.\n"
        },
        {
            "course_name": "Honors General Physics I ",
            "review_date": "August 09, 2006",
            "review_content": "\nI received an A+ first semester and an A second semester and here's my secret: I studied for all the quizzes and I did all the homework. You have a quiz every week, and since there are so many quizzes most people trivialize them. However, the quizzes are 35% of your entire grade so doing well in the quizzes is key to getting a good grade. Also, the homework is very important. If you can do most of the homework problems, then you will definitely do well on the test (Also, the quiz is usually almost identical to a homework problem). First semester is fairly basic and covers most of what high school physics courses cover in addition to a few new topics. The exams first semester are also simple: the midterm and the final are nearly identical to the practice tests. Second semester is definetely tougher. First semester my 98% in the class translated into an A, but second semester I did much worse (92% in the quizzes, 86 % on the midterm, and 75% on the final) and got an A. The key to succeeding second semester is, again, doing your homework. If you are doing badly on the quizzes (which I was initially) I suggest you   go to the weekly recitation sections (these are optional but help you do the homework). When test time comes I strongly suggest looking at the practice test.\nWorkload:\nWeekly quizzes worth 35%, one midterm worth 25%, and a final worth 40% of your grade. Yes, the quizzes are worth more than the midterm so be sure to try and ace each and every quiz.\n"
        },
        {
            "course_name": "Honors General Physics I ",
            "review_date": "June 08, 2005",
            "review_content": "\nNo, no, no, no, no.  Do NOT do this to yourself, no matter how easy someone tells you the honors class is.  As time went on, it became more and more apparent that this course's description is completely false.  It is not for students who want to have some calculus in their physics; the class is catered toward students who have a strong physics background from high school.  I'd go so far as to say that this class assumes that you already know mostly everything and is merely an opportunity for kids who took AP Physics to demonstrate that they haven't forgotten anything.  The rest of us just sit back and suffer.\nThe worst part is that you don't really understand that you are suffering until the end of the semester.  The quizzes are deceiving in their simplicity, the midterm is ok...but then comes the final.  With 8 questions worth 200 points, even getting every question mostly right results in a mediocre grade.  This class allows those who already know physics to freshen up and dominate, while everyone else writhes in agony.\nAnd just wait until the second semester, where all of a sudden nothing makes sense, and nothing is adequately explained.  It's pretty sad when you can't even do the tests with the answer key in front of you because you lack the knowledge of some basic concept.  \nUnless you have done physics before, this is what your experience will be---best case scenario:  You spend at least 3 hours a week trying to do the homework from the AWFUL textbook (if they keep the same textbook next year it is just proof that no one pays attention to the course evaluations, because EVERYBODY complained), spend an hour in recitation doing the problems you can't do, memorize all the answers, do ok on the quiz every week, do alright on the midterm, and then bomb the final.  \nThe best day of class that we had was the day where a substitute taught us.  He received ten minutes notice before lecturing and I learned more physics in that hour than at any other point throughout the year.  Shaevitz is a nice guy...but my praise ends there...you just won't learn anything.\nI am honestly convinced that I know no more physics now than I did in September.  Take 1200...at least you may get something out of it.\nWorkload:\nWhat you make of it.  You can work really hard and do badly, or if you know physics already, not go to class and do fine.  Weekly quizzes based on problem sets that you never learned how to do, one midterm, one final.  One bad grade and you're finished.\n"
        },
        {
            "course_name": "Honors General Physics I ",
            "review_date": "January 12, 2005",
            "review_content": "\nHe's very self amused.  Gives neat notes, easy to follow instructions, is very good about answering all questions honestly, even if it's 'i don't know.'  \nWorkload:\nweekly quizzes, suggested problem sets, no surprises\n"
        },
        {
            "course_name": "Honors General Physics I ",
            "review_date": "January 07, 2005",
            "review_content": "\nThis class was very surprising for me.  I am not a physics major, I'm premed, and I thought I was going to be a biochem major.  Then, I changed my major and thought, well, I'll take this class to have an edge.  I'm not so sure that was a good decision now.  He has fair, sometimes easy quizzes, the lectures are boring most times, entertaining sometimes.  He's a sweetheart.  His midterm wasnt impossible, he gives practice exams.  But the final....I just dont know what happened!  I did terribly.  Maybe I should have studied harder, but there were questions that I just didnt know what to do, and I dont think there was enough partial credit.  My final grade wasnt what I expected, but given the final, it couldve been a lot worse.  So maybe there was a curve, but I'm not so sure.  Even so, I didnt learn anything.  As far my recommendation, just take regular general physics if you're premed and you dont need 1301 for your major.  There's more people in the class, so there's a higher chance to get a better grade.  Or take honors physics, if you want.  But you better go to each and every one of the optional recitation classes to get the answers for the homeworks, because the book doesnt have solutions.  \nWorkload:\nRelatively easy quizzes, worth 35% of grade (pick best 9 out of 11), midterm 25%, final 40% (there's a practice exam for it too, but there were some questions on the exam that were totally different)\n"
        },
        {
            "course_name": "Honors General Physics I ",
            "review_date": "November 17, 2004",
            "review_content": "\nShaevitz makes me enjoy going to physics lecture despite my consistently plummeting quiz grades! He has a voice like Kermit the Frog, he makes cute excited sounds when he does demonstrations (every class), and he's pleased to have student input during the lecture. He writes neatly, explains clearly, is very straightforward about everything, and every once in a while he tries to explain relativity and dark matter (even though this is a class full of pre-meds). Hurray!\nWorkload:\nif you didn't take AP physics or something, the problem sets and quizzes will get increasingly difficult, so don't be fooled by the very, very easy first few weeks. but it's all manageable if you set aside enough time to go through the chapters and problems every week (i don't-- i have other important things to do.) anybody could learn this stuff with a (very) little calculus background and a bit of effort, though.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "January 08, 2004",
            "review_content": "\nA straightfoward lecturer, doesn't make exciting revelations not covered in teh textbook, but explains fairly well and his examples are succinct.  He enjoys his toys, especially all the tops he gets to bring in for demonstrations.  His arrogance shows through sometimes in snide remarks about the intelligence of the class, but definitely a likeable guy overall.  The TA, on the other hand, seems like an a stuck up... but at least he willingly solves homework problems for you in recitation.\nWorkload:\nWeek-and-a-half-ly problem sets of moderate length and difficulty; look over them and go to recitation to get the answers to the hard ones from the TA.  Midterm, final, both straightforward.  Decent curve.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 14, 2003",
            "review_content": "\nA mediocre professor, nothing special, nothing horrendous. The one problem is that he's usually a bit sloppy with the equations he puts on the board, so take a little more care when you're taking notes. Also, the practice exams were a bit less effective for having a couple of wrong formulae and errors in the solution set.\nWorkload:\nBiWeekly homework, midterm, final\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "November 18, 2003",
            "review_content": "\nShaevitz is a good professor.  He teaches out of the book quite a lot, but he does explain things well and his lectures are interesting and easy to follow.  He's also very funny; he seems to always laugh at whatever he is doing, which is hilarious, if you ask me.  Breifly, he is understandable and competent.\nWorkload:\nProblem sets every 2 weeks or so, fairly challenging (a bit like the C2801 sets).  Midterm, final.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "November 13, 2003",
            "review_content": "\nSince you probably have to take this class if you are reading this review, all I can say is that you could do much worse that Professor Shaevitz.  He is a generally nice guy, very approachable, and his lectures are easy to follow.  He writes derivations of the current material on the board, then does increasingly complicated examples until class lets out.  His considerable condescension towards his students manifests itself in a sarcastic demeanor that some find amusing and others resent, but he is sensitive to complaints and requests.  Problem sets are on the easy side for a non-introductory Physics class.  Exams are straightforward. Mechanics will not blow your mind, but if you like doing tricky mechanics problems you can enjoy yourself, and it wonÂ’t put too much of a damper on your social life.  Not an easy class, but in comparison to Quantum Mechanics or E+M it is a walk in the park.  \nWorkload:\n9 Problem Sets, 1 midterm, 1 final.\n"
        }
    ]
}