{
    "prof_info": [
        {
            "prof_name": "Darcy Kelley",
            "prof_id": 1955,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Neurobiology II: Development & Systems ",
            "review_date": "April 23, 2010",
            "review_content": "\nDr. Kelley is really quite remarkable. I don't think I've ever come across someone who has the same level of mastery of such a broad range of topics within a discipline. Ok, most professors at Columbia have their specific realm of expertise, and know their stuff within that, but her knowledge of all things neuroscience and biology is profound.\nClasses are interesting, she lectures from the top of her head - you never really know what she might say next. Expect a lot of interesting asides and anecdotes. She has obviously taught this class many times before, so the structure is very organized. That said, she still brings in plenty of very recent research into the lectures. Dr. Kelley clearly reads a lot of journals! \nShe will respond to emails, although she can be a little blunt, even gruff. It's hardly a let down though, she's a great lecturer and always happily fielded questions in class.\nThis is obviously not a course for history majors! Most of the class were neuroscience majors who are premed. The course is clearly geared to such people. That said, I am a psychology major with no background in biology, physics or chemistry and I was ok.\nThe papers we read for recitation were challenging at first read, but usually made sense after discussion in seminar. I'm glad I took this course - it's really broadened my knowledge base of neuroscience.\nWorkload:\n2 small weekly quizzes on Courseworks (to make sure you're doing the reading).\n3 tests throughout the semester (non cumulative - lowest score is dropped).\n1 final exam (respond to questions on 2 of 4 published papers handed out two weeks before the exam).\n\n"
        },
        {
            "course_name": "Neurobiology II: Development & Systems ",
            "review_date": "January 07, 2010",
            "review_content": "\nDarcy is an amazing teacher. She is funny, comes well prepared for the lectures and her breath of the subject is extraordinary. The exams are well made and thoroughly enjoyable. She has also started putting the audio recording of the lectures on courseworks along with the entire set of slides she shows in the lectures. I don't know of any other biology professor who takes her/his job that seriously.\nHer selection of the papers for discussion is also good. She does go a little overboard when explaining her frog sexual behavior stuff, but she usually doesn't give it unnecessary importance in the exam.  \nWorkload:\nAlthough there is quite alot of subject matter to cover, the grading is easy and you can do well in the exams even if you havent read the book.\n\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 05, 2005",
            "review_content": "\nProfessor Kelley is one of my favorite professors that I have encountered thus far in my 2 years at Columbia. I was wary of the course going in, since I'm not too fond of science in general, but Darcy made the material come to life. Her genuine enthusiasm for the subject was contagious, and I found that soon I was even reading Science Times to read about the breaking science news.\nI can see how people with a strong science background might be frustrated with the course, since even I was bored at some points by the simple material that people still didn't seem to get. But, I bet that those people could gain a lot by talking to Darcy outside of the classroom, since she loves talking about science in general.\nThe course itself did not involve much work. The problem sets were time consuming, but there were only 4 of them all semester. The readings are totally not necessary, but make sure you go to lecture since all the material from the problem sets will be presented there, and some of it even involves topics that the average science major won't be totally familiar with (quantum mechanics, etc.).\nIf you get assigned to Darcy's section, you will get a lot out of it - just go in with an open mind about science.\nWorkload:\n4 problem sets - grading is tough but all the information is in the lecture / common sense; weekly readings that aren't necessary; final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 18, 2004",
            "review_content": "\nI feel as though this review should focus more on the class itself than Prof. Kelley's particular teaching style, which plays only a minor role in the whole FroSci experience.  The newly designed science core course has many bugs to work out yet. The problem sets are easy, but very frustrating (there's a lot of independent, online research involved that gets tedious really quickly).  The lectures themselves were interesting and valuable, though their unfortunate placement on friday mornings meant I slept through many of them. \nAs for the discussion sections, they often had only nominal connection to the lectures. Prof. Kelley had some creative ideas in her approach to each subject matter, but often times our meetings were simply a bore.  She resorted to a lot of group and individual presentations later in the semester, which I got almost nothing out of. Don't get me wrong, she's a sweet lady whose passionate about the course, and her quirkiness is rather charming, but every aspect of the course retains a coarseness that needs to be sorted out.\nProbably my biggest problem with the course was how much the professors involved taught down to their students. The class claims to be designed for science and non-science people, but I can' t imagine that anyone who manage to get accepted to Columbia was as science-ignorant as they assumed us to be.  I sincerely hope this does not become a required core course next year, because if it does a ton of students are going to find themselves very frustrated.  That said, FroSci is an easy A for students with any scientific background.\nWorkload:\n5 problems sets (easy, but annoying), the grade from one of which you can drop; occasional discussion section assignments which were pointless but necessary to maintain your participation grade; one final, which was a little tricky but required practically no knowledge of what was covered in the course, mostly logic.\n"
        }
    ]
}