{
    "prof_info": [
        {
            "prof_name": "John Zhang",
            "prof_id": 9496,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Programming Languages: Python",
            "review_date": "December 14, 2009",
            "review_content": "\nThe instructor was very prepared with powerpoints, however the lectures were a bit dry and I didn't necessarily learn much from them.  \nThe assignments were good conceptually, however, the instructions were generally very confusing and in my opinion led to unfair reductions in grades.  Though I tried to get clarification both through emails and office hours, the emails did not necessarily help as following those responses led to point deductions and despite scheduling appointments at office hours the teacher was late.  It would have been helpful to get the test cases for the programs so that we could determine whether or not our programs correctly solved the problems.  The project guidelines were very ambiguous, and despite trying to get a feel for the \"creativity\" and \"originality\" for my project before I dove into it I was not able to learn much.   In my opinion  if we complete or at least reasonably attempt our proposal (with guidance from the instructor of course) then we should receive very high marks on the project.  The project should have been about finding something that was original, interesting, and useful to you.  However, the instructor failed to respond to emails about problems that I was having with the project and seemed to give the impression that he would dock points for our projects not being \"original\", though this is very subjective.\nIn my opinion the reason I took this class was to learn python - being required to turn in the assignments forced me to do that, though I don't necessarily attribute anything that I learned about python to being in class.  Rather the direction that the assignments pushed you forced you to learn python yourself through both trial and error and online tutorials.  Given that the workload in the class was definitely more than it should have been for a one credit course, I probably would have been better simply teaching myself python over break.\nWorkload:\nThe work was fun, but its definitely too much for a one credit course - especially when you are not getting an A for it!\n"
        }
    ]
}