{
    "prof_info": [
        {
            "prof_name": "Apoorv Agarwal",
            "prof_id": 12599,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Projects in Computer Science",
            "review_date": "April 12, 2015",
            "review_content": "\nThis review is for the course project COMS E6901.\nApoorv Agarwal is the most unprofessional person to work with. He has absolutely no proper schedules when it comes to working with project students, and is very demanding and inconsiderate towards other priorities such as coursework.\nHis goals kept shifting during the project and was different from what he discussed at the start. He is very disrespectful and rude. He is quick to blame without proof and sends impolite emails without giving you a chance to get back and reply. The meetings that are scheduled, usually left me waiting. He would change deadlines as per convenience and would expect you to work through vacations, and entire nights. In spite of communicating results, etc through emails and documentations, he ignores those and continues to ask for the same multiple times, which is annoying for the other person.\nHe keeps shooting work giving short notices and when asked for some time due to other coursework conflict, he would intimidate saying grades would be affected. He asked for writeup, other questions about the work I did after the semester ended. These are not clarifications  but those which had been explained during the semester. Though my deliverables were timely and documentation to support it, he still had many questions, often asked with sarcasm and insults.\nHe gets a lot of his work done from students for his PhD. Being a student himself, he treats students working with him with such disrespect. His advisor Owen Rambow was not involved at all in the project, but ended up coming on the research fair as if it is a project with him or at least you would expect he would be involved since he showed up and spoke with you, but that was not the case in reality.\nIt is a horrible idea to do a project with him in my opinion, it is a waste of your tuition money! It is like paying to do work rather than getting paid! I would strongly suggest taking up coursework rather than a project with Apoorv Agarwal. My purpose was to have a good research and learning experience, but was completely the opposite! \nWorkload:\nMore than 20 hours a week for 3 credits.\n"
        },
        {
            "course_name": "Intro to Information Science",
            "review_date": "January 13, 2013",
            "review_content": "\nI had pretty terrible expectations for this course since I am not a comp sci person whatsoever, but it surprised me completely. It was actually fun, interesting, and informative, and it was all because of what a great professor Apoorv was. He cared so much about his students and really tailored the class to our abilities. After seeing how terribly most of us did on the first homework, he slowed the pace of the class way down, which might have been frustrating if you had been really into comp sci, but let's be honest -- anyone who was would have skipped right to Java. For what it was -- a class that I was taking purely to fulfill a requirement -- it was really great. Apoorv is a genuinely nice guy, responds to emails almost immediately, and is always willing to meet with you if you're having trouble. He's young and cool and has lots of friends who work at Google. He also really cares about his students, and obviously wanted us to do well. Sometimes he isn't great at explaining concepts, but other than that, he's a seriously awesome professor and I would recommend his class to any humanities major who wants to get the Barnard Quantitative requirement out of the way in a painless (or possibly even enjoyable) way.\nWorkload:\nVery reasonable. Bi-weekly homework assignments that I occasionally needed to go to the TAs for help with, a midterm, and a final. Don't worry if you mess up the final -- if you've done well on the midterm, he'll weigh that more. I screwed up and got a C on the final, but after completely panicking, I ended up getting an A in the class because I did well on the midterm and all of the homework assignments and did a ton of last-minute extra credit.\n"
        }
    ]
}