{
    "prof_info": [
        {
            "prof_name": "Joseph Parent",
            "prof_id": 1457,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "American Foreign Policy",
            "review_date": "November 27, 2007",
            "review_content": "\nFirst off, he is intimidating. He seems to love nothing more than to scare the crap out of you with his ridiculously dense lectures and proclaiming the difficulty of his final. There is an ungodly amount of reading, which you will have to accept that you will never, ever complete. If you can get past these issues, then the class isn't half bad. For one thing, Parent is a very engaging lecturer, although he does have the tendency to use the word fuck quite unnecessarily and his sequences of ideas can be convoluted and hard to follow. You are also only graded on a midterm, final, and discussion section participation grade (which you get just by attending). While Parent claims that his standards increase exponentially between the midterm and the final, I somehow managed to go up an entire letter grade, so it can't be as cutthroat as he claims. Also, you don't have to do ALL the reading. I asked my TA to go over the core 20 or so, and just focused on those and did fine.\nWorkload:\nRidiculous amounts of reading. No papers or other assignments.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "July 22, 2007",
            "review_content": "\nJoe is a very good teacher.  I say this not only because he is an entertaining lecturer but, moreover, he picked a thought provoking syllabus.  Be forewarned:  there is a lot of reading in the class.  I am not a poli-sci major so, I tried to do it all.  I didn't succeed.  But I tried my damndest.  The funny thing is, those couple of articles I only skimmed, the things I read without taking good notes.  I kind of regret.  In retrospect, the course was really thought provoking about how strongly international politics/ threats/ strategy were fundamental in the shape and make-up of the country today.  Plus, there are fun readings like Wizards of Armageddon, which is just Doctor Strangelove but strangely and unfortunately real.  \nBelieve the hype.  He's a good teacher.  It's a great course no matter what your major.\nWorkload:\nA lot of reading.  200 pages a week and in between the entertaining stuff, some is really dry.  It's like trying to chew through pieces of cardboard to find a nice jewel of historical fact that changes how you look at the world.  In class midterm and final.  That's right kids.  That means if you didn't take notes throughout on all that long reading so that you can recite the thirty plus author's names and their major arguments to re-gurgitate on the in class essays...  you will be caught.  Read well.  Take notes well.  Consider this your warning. And, it's worth it.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "July 17, 2007",
            "review_content": "\nJoe is a no-nonsense kind of guy. He gives it to you straight, admits that he's biased, and lets you know that his class is hard. But as a lecturer, he's awesome. And he clearly lays out the expectations: \"My grading is exactly the university-wide mean, so you won't get punished [gpa wise] by taking this course but you won't get blessed either.\" And the exams are hard. But the reading was as fantastic as it was lengthy.\nI loved this class. \nWorkload:\nA lot of really good, really interesting reading. Grading is hard but not capricious. If you want an A, be prepared to do a lot of work. Also. he grades on a curve.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "June 26, 2007",
            "review_content": "\nI just finished Joe's summer class and I give him and the class two thumbs up.  This class should almost be a requirement.  It's just good stuff.  From the greeks, to American revolutionary history, the class goes inside and outside the forces that have shaped the country.  Double bonus--Parent is a nice guy and entertaining lecturer.  A lot of readings but doable.  It sucked as a summer course because there wasn't quite enough time to think about it.  But definitely a course worth taking and thinking about during the school year.  It's one you'll be glad you put the work into and wish you spent more time on.\nWorkload:\n100-150 page a week.  In class essays and ids for the tests.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "May 23, 2007",
            "review_content": "\nProf. Parent's lectures are impressive to say the least.  He comes to every lecture prepared and never loses a step through the 75 minutes.  The class remains interesting thanks to Parent on a number of levels.  I think this was his first semester as a professor, but he was so knowledgable on the subject and flawless in his lectures, it was diffucult to tell\nWorkload:\ngrade: 1/3 midterm 1/3 final 1/3 participation in disc. sessions.\n200+ pages / week (which are needed for disc sessions and final).  He posts most important readings, saving you a lot of $$$\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "May 15, 2007",
            "review_content": "\nAt first glance, this class looks really easy for a pol sci class.  Only a midterm & final & discussion section, which are worth 1/3 each.  However, the reading list is the most intense one that I have ever seen with over 100 pages per class.  I think the grand total of readings was well over 100.  Professor Parent does expect you to know these readings well & cite them on the exams (The final is also cumulative).  Prof Parent is the most down to earth lecturer I have ever had.  He is not that much older than us & speaks in every day terms, which makes really hard topics much easier to handle.  He does go off on tangents a lot & sometimes does not seem to have a point.  The work is very intense & Prof Parent is a very hard grader.  However, he definitely seems open to adjusting his teaching style as he gains more experience as a professor.\nDefinitely take his class.  In a few years, he is probably going to be one of the biggest names in Political Science at Columbia.  Just don't expect to get an A.\nWorkload:\nan impossible amount of readingmidterm- 1/3final-1/3discussion section- 1/3\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "May 08, 2007",
            "review_content": "\nJo is a fun person, but hardly your typical academic. Thing about Professor Parent is that he doesn't really \"tell the story\" well (i.e. narrating the past). Thus when he discusses the history of American foreign policy is rather uninspiring and haphazard. That said, once we reached the latter half of the course (on theory), he was more than up to the task. \nExams are fair but very challenging. You've got to keep up with your readings or be in a good section that does the work for you.\nWorkload:\nMedium\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "April 27, 2007",
            "review_content": "\nParent knows his stuff and is really interesting to listen to. He has a great sense of humor and brings that to his lectures (lots of jokes, sarcasm, etc.). That defintely makes the lectures go a little less slowly when you're sitting there.\nHe DOES move through the material like his a$$ is on fire, though. He'll clarify if you ask him to and is fully aware of how quickly he moves, but it makes for some difficult note-taking. He's totally up front about the course being about \"breadth, not depth\" though so be prepared for blank spots in your notes because sometimes you just can't write fast enough. The discussion sessions are really, really useful for helping with this though.\nWorkload:\nTONS of reading, not all of which is necessary, especially if you are attentive during discussion session. 1 midterm (Parent warns that it's extremely difficult, but don't be discouraged-it's actually manageable) and 1 final.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "April 24, 2007",
            "review_content": "\nParent's AFP class is run in a casual lecture format. At the beginning of each class he puts up IDs and Dates on the board that need to be taken down and help with the lecture outline. After the midterm the IDs begin to disappear, and the course moves from the history of AFP to focusing on theory. Some of the readings from the course are great, in particular the Gaddis and Kissinger readings really synergized, providing fluency with the history and theory of AFP.\nAt the start of the course I found Parent's lecture style refreshing, but as time progressed every class began to feel like the Daily Show. The cynicism grated on me a bit. Parent is a good professor, but you can't use the same shtick every single class for an entire semester and expect to hold attention.\nAlso, the course does feel incoherent at times. My TA did a great job but was often unsure of what we would need to know for the midterm, of which one essay is 80% of the grade.\nWorkload:\nDiscussion Group is a key component of the grade, largely based on attendance. There is a lot of reading, but much of it isn't necessary. Then again, it's hard to know what's necessary. Overall I would describe it as on the light side of average -- only requires a midterm and a final, no essay!\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 22, 2007",
            "review_content": "\nA great class, very interesting.\nHe is amusing and up front about what he believes.  The real work is in discussion section.\nDon't let the books and reading scare you....you dont need them.\nWorkload:\nif you read everything ALOT, if you do enough to get an A -- average\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 23, 2005",
            "review_content": "\nParent is by far the most intelligent and knowledgeable TA I have ever seen. He really has a good command of the material, and he knows current events and events of history very well. Organization is his greatest strength, so the material is all broken down really well in the recitation. He once taught in place of Prof Gartzke during one of the lectures, and he was so good at covering a large extense of material in a corny and funny manner which made it really easy to understand. His examples are also relatable. Also follow his guidelines on the in-class essays! They help a lot. I have the biggest problem with introductions, and so I followed his guidelines, and got a \"good intro\" commment by the grader. He may be a hard grader, but if he is one of the 4 TA's, your paper can be graded by him even if he is not your TA, since the papers are randomly distributed among TA's and instructors, so grading doesn't really affect the recitation experience. Parent is definitely recommended.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 21, 2005",
            "review_content": "\nPretty average TA.  In retrospect, we didn't actually discuss almost any material during sections.  He is however, open to answer any questions by students, and he will either have the right answer or think he has one.  He's not afraid to criticize a professors's shortcomings, which is nice.  Overall, don't shy away from him, but don't expect to be wowed.\nWorkload:\nVery few quizzes, almost all announced.  One medium paper, graded tough, easy midterm and final\n"
        },
        {
            "course_name": "Conflict Resolution In the Middle East",
            "review_date": "August 12, 2005",
            "review_content": "\nIn response to the first review, I don't think Joe was ever \"trying\" to be funny.  He's a very opiniated man and I don't think he's the type of person who cares what his students think of him.  He's also really witty and laid back as a person and can transform the tedium of the required discussion section into an enjoyable experience.  Not only that but he's very good at deconstructing arguments and going right to the heart of a text.  His grading standards are somewhat eccentrically rigorous, but the professor of this particular class gave out a high curve which turned at least a couple of Joe B's into A's.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "September 12, 2003",
            "review_content": "\nAttention female undergrads:  Joe wins as the best looking TA in political science!  (seriously, I mean really good looking not just better than your usual geeky grad student.  this guy works out!) Ignore the jokes and check out the biceps.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 20, 2003",
            "review_content": "\nJoe is the best TA around!  He is witty and intelligent and knows exactly how to present the facts in a CONCISE and understandable way.  Joe is educated enough so that he is able to give his own opinions and not necessarily be a pet to the teacher.  I loved his section, he was especially helpful with essay writing.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 19, 2003",
            "review_content": "\nJoe tries to be funny at the discussion sections, sometimes he is and sometimes he is a typical poli sci grad student dork.  He starts every section with trivia and gives out candy prizes which is thoughtful. He seems to really enjoy teaching and political science but he grades ruthlessly.  However your grades are based on improvement and most students do. He loves to use sexual metaphores and bar/dating senarios in a lame attempt to relate to students.  But he does speak perfect english which is important since many TAs are incomprehensible with their heavy accents. Also he makes himself available outside of class to discuss any questions or how to improve your papers.\nWorkload:\nridiculous amounts of reading, 2 5-7pg midterm papers and one final exam with one page front and back note sheet\n"
        }
    ]
}