{
    "prof_info": [
        {
            "prof_name": "Ryan Chaney",
            "prof_id": 3413,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 25, 2010",
            "review_content": "\nHe's pretty awesome. I definitely worked hard to earn my grade, but his class was interesting enough to make me work hard. The prompts he gave us for papers were really interesting. I truly enjoyed writing the papers, the discussion posts and participating in class discussions of the texts. He definitely knows his stuff. Lit hum was helll for me, I had the worst teachers. Thanks to Ryan CC has been a pleasant change of scene thus far. He's not easy, but he is fair. \nWorkload:\n2 papers\na discussion post due on courseworks every other week-it is due the night before class \nmidterm and final\n\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 22, 2010",
            "review_content": "\nWow... Probably the best professor I've had at Columbia. He makes me want to do the readings and he is so laid back that I feel as if he's both my professor and a really cool friend. The stories he tells in class are hilarious but aren't too distracting from the texts. Generally, we talk about interesting aspects of the text that are heavily debated during class. Also he is sooo sexy so it's a little distracting.\nWorkload:\nThe same as any CC class... a lot of reading. A discussion response every other week, two 5-7 page papers, a fair midterm, and a final... :)\n"
        },
        {
            "course_name": "The Road",
            "review_date": "April 13, 2010",
            "review_content": "\nThis course was very interesting in content, but I have to say that it was a very frustrating experience, as the reading deadlines and syllabus changed more times than I can count.  I agree with previous reviewers who said that discussion sections would be important.  It seems evident from the reviews below and from his demeanor in class that Ryan seems to have a rep with students as a \"cool guy\" (and that he knows it).  However in a class of over one hundred students, it just seemed like he had a friendly rapport with a handful of students who he frequently referenced having conversation with (is there some sort of secret student/prof hangout happening every week or something?!) and called on often in class, and that was also mildly annoying.  I hope that the disorganization of the course was due to it being the first semester it was offered, because if that improved, my experience would have been much better.  And maybe in a smaller class setting with Ryan, I too would call him \"the man\". After taking The Road, I can't say that I am convinced. \nWorkload:\n2 papers, one mid-term, some other class participation/non-graded assignments which were easy.  Overall not a hard class. \n"
        },
        {
            "course_name": "The Road",
            "review_date": "April 11, 2010",
            "review_content": "\nThis was a great course. During the time I took it, yes, it was underdeveloped, and probably should have been a seminar, not a large lecture class, but once Ryan had clearly grasped the amount of material we were going to be able to cover realistically, the course became quite interesting. The course is not for the participant who wants to be lectured at blindly, but rather requires that you think critically about the texts on your own so that you are able to follow the class and contribute effectively. The multimedia aspect was also well planned and interesting, watching film and listening to audio really rounded out the cultural aspects of this course. Yes, this course could serve with some narrowing, but Ryan Chaney is a wonderful professor and this course asks you to think creatively about interesting tasks. I recommend it highly. \nWorkload:\nWeekly readings, two papers, final. \n"
        },
        {
            "course_name": "The Road",
            "review_date": "December 21, 2009",
            "review_content": "\nThis class was probably the worst I've ever taken at Columbia. While Chaney seems like a nice enough guy and has an entertaining shtick, that definitely wasn't enough to save a course with no clearly defined goals and no unifying arc to speak of. (Beware reviews that start off by calling a professor \"the man.\") A lot of the material was independently interesting, but it wasn't organized in a way that accomplished anything. Additionally, the lectures were pretty terrible (Chaney often read from paragraphs of notes) and run as a partial discussion, which did not work at all. This class should by no means be taught again as a lecture. \nWorkload:\nWeekly readings, two short papers, a final from which some students were apparently exempt\n"
        },
        {
            "course_name": "The Road",
            "review_date": "December 16, 2009",
            "review_content": "\nRyan designed entire course with sophisticated concepts that are intertied and interwoven with each other in a way that helps memorization, the drawing of connections and the applicability to the real world and personal life.  He used music, films, poetry, guest speakers and photographs to make the concepts enter your brain with more of an applicability our life than texts. That having been said, the readings were all very useful and thought provoking. I will keep all the readings, which I saved to a folder from courseworks.\nHis syllabus, although difficult to keep up with, was quite brilliant. It took us through theory, smoothly into the American world, into historical figure's lives affected by the issues at hand, and then, in class we'd tie it all together to the best of our abilities. \nThere should be more courses like this one. I hope this isn't a product of a stray brilliant instructor, but a reaction to the need for courses that are as experimental as they are groundbreaking and thought provoking.\nI cannot emphasize how important discussion sections would be for this course or any course similar to it. It's OK that it's large, as the content is worth making available to as many people as possible, but discussion sections would make many more of those students gain much more from the course. The TAs were all friendly approachable and intelligent, as anthro TA's in my experience have been. \nRyan claims he won't teach this course again, but these reviews will surely make him realize the actual impact the course made on many who took it. \nWorkload:\nTwo prompted but for the imaginative, open ended 5 page papers and one final test. \nWould've been difficult to bullshit through it and get a good grade. But 'The Road' as one of 4 solid courses where you do the readings and put some thought into it (maybe an extracurricular study group) would be infinitely rewarding.\n"
        },
        {
            "course_name": "The Road",
            "review_date": "December 12, 2009",
            "review_content": "\nRyan Chaney is the man. He's absolutely brilliant but is excellent at explaining what can be convoluted material. as stated below he claims the class should have been a seminar and probably won't be taught again. i would recommend him for any other class as he does an excellent job of lecturing combined with leading a discussion. he has great stories that lend themselves well to the material and it is evident he really cares about the class and wants to get to the heart of the course and certain texts.he asks intelligent questions causing you to think rather than just write down whatever he says. take whatever class you possibly can with him\nWorkload:\n2 papers - final - reasonable amount of reading that is for the most part really interesting\n"
        },
        {
            "course_name": "The Road",
            "review_date": "December 10, 2009",
            "review_content": "\nwhile he says this course isn't going to be offered again (or, he isn't teaching it again), i figured it deserved a review anyway. the below reviews i think are quite accurate. while i never really dealt with him personally (TAs graded the assignment), i felt like he really took interest in his students and their opinions. he isn't cocky like some younger professors who are just out of grad school either. \nmy main issue was the sometimes lack of transparency with the syllabus. it was changed quite frequently because we were always behind, and i felt like he didn't always let us know. sometimes i wasn't sure what i was supposed to read for the next class. additionally, the second paper's due date was changed but no announcement was made; it was only changed on the syllabus. things like that are unsettling for some, but not for others, so make of that as you wish.\nbut other than that, great course and great instructor. the material was interesting and thought provoking, and ryan seems like a dedicated professor who can explain things clearly and has funny stories. even if he's not teaching this again, i would recommend him as an instructor.\nWorkload:\ntwo papers, the second of your own topic. easily graded (by the ta; i don't know how his grading was). reading that wasn't too heavy, although some kind of hard and some kind of pointless, and a final exam (there was going to be a midterm but it was cancelled). easy workload, i'd say. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 07, 2009",
            "review_content": "\nRyan is fantastic.  His class was all that CC should be and all that LitHum sadly wasn't.  He's a young, engaging, brilliant, and hilarious guy.  I have learned way more than I expected (after two mediocre LitHum profs) this year from him.  He always has interesting perspectives on the text, he can play devil's advocate to anybody... If you're in his section, you're very lucky.  \nHe cut crappy and/or token readings (Darwin and the Haitian Constitution, for instance), too.  \nAlso, he doesn't slack off with comments on papers.  He tells you what you did well and what could have been different, unlike a lot of lazier teachers.  And he grades very fairly (generously, but not to the point of giving all As).  \nWorkload:\n2 papers (5-7 pages, fun topics given, option to invent your own).  Normal CC reading, maybe a bit lighter than normal.  Had to post 2/3-1 page (single spaced) on courseworks once every two weeks about the reading (graded out of 10, almost every one will get a 9). \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 16, 2008",
            "review_content": "\nRyan's the man. You'll be lucky if you get him. The first review pretty much got it right and I don't really have much to add, I just wanted to say  Ryan is awesome. Basically, in class it'll be a good conversation, he'll bring up the reading responses that everyone does and ask people to comment (a 1 page max response each week is due on Courseworks, though it's not that bad - they're graded on a 1-10 scale and you pretty much always get a 9). By the way, he's great at providing feedback, so not only will you get extensive comments on your papers, but you'll also get good ones on the short responses you send in every week. \nRyan isn't the kind of guy you can BS on though, if that's what you want. I think the syllabus says that people who try to talk a lot but obviously didn't do the reading are worse than people who say nothing...I'm paraphrasing. Anyway, it's not as bad as it sounds but you should do the reading. I remember one class hardly anyone was saying anything (I guess we were swamped with other work) and so he goes, \"OK, I don't care what you say, I won't hold it against you, but raise your hand if you did the reading.\" Pretty sure one hand went up. \nWorkload:\nEasy 1 page max response per week, though you can write 1 paragraph and it's not gonna kill you. Midterm and final are what you'd expect. Participation counts. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 12, 2008",
            "review_content": "\nProfessor Chaney is one of the best professors I've encountered during my time at Columbia. He's a brilliant man and knows so much. His teachings are very thorough and really tries to make sure we understand each text as best as we can. He also embellishes class discussions by bringing up very funny stories about his babysitting experiences and whatnot, which liven up the class while simultaneously tying it back to the readings somehow. He also really takes the time to help out a student when he doesn't understand something in class by meeting frequently outside of class. He has passion in what he teaches and so has us read a lot of texts, but at the same time he really understands us as students as well as people, and thus, is lenient when it comes to writing responses late. Thus, I truly recommend taking professor Chaney as a CC teacher. You will learn so much valuable things from him and have a deep appreciation for the class.\nWorkload:\n1) Weekly responses every other week \n2) Two long essays\n3) Midterm and Final (both very fair)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 13, 2008",
            "review_content": "\nRyan Chaney rocks my socks. Not only is he a great teacher but he's a great person. He is always very well prepared for class and provides us with relevant exposition when we start a new reading. Although he is so smart, he is very deferential during class. He readily admits when he does not know something, thinks he might be wrong, or hopes that students who may now more about the subject will contribute. He is also intent on giving credit where credit is due, as his grading is very generous (but he always gives back papers with a plethora of helpful comments) and he never fails to mention the name of the student whose ideas he is reiterating in class. And if you are ever struggling in class to form an intelligent comment or if everyone disagrees with you, he is always quick to subtly rush to that student's defense. Most importantly, he is very lenient and understanding about extensions, attendance, etc. He also cares about us as people, and has offered me moral support on several occasions. Coming from someone who hates CC, I was lucky to get a great instructor. \nWorkload:\nTwo papersOne MidtermOne FinalA short response to one of the readings for each week\n"
        }
    ]
}