{
    "prof_info": [
        {
            "prof_name": "Kevin Erwin",
            "prof_id": 2936,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 11, 2009",
            "review_content": "\nKevin Erwin is a fairly terrible teacher. the quality of our discussions rested solely on how engaged or how much reading the students in the class had chosen to do that day. kevin does not really have a good grasp on the material, and so he does not really supplement the discussion with any additional info or useful comments. he does not facilitate discussion well, and he does not provide any sort of helpful conceptual information or useful guiding questions. he is a fair grader, but that doesn't really matter because you will learn only what you read in the books and on wikipedia and nothing more. if you don't understand it, then too bad for you because kevin can't help you. \ni talked a lot during class discussion, read most of the books, and wrote average papers, and ended up getting an A, but i still would have switched out of his class if i could, even if it was into a harder one, because he really failed to stimulate, engage, or enlighten me in any way. i heard that most people got B+'s though, so it's not really an easy A. switch classes if you can.\nWorkload:\nmidterm, final, a few papers, courseworks discussion postings, presentation project at the end of the term on book of choice.. pretty average for a CC class\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 21, 2008",
            "review_content": "\nKevin is a nice professor. After doing absolutely no participation or required online postings and getting average grades on papers and tests, I still managed to come out with a B. That being said, there was a reason why I did not participate in class or try very hard on his papers. Firstly, this class was pretty boring. I know Descartes doesn't conjure up the most interesting images for most people, but Kevin's classes were rarely structured at all. Secondly, we rarely took any substantial notes, unless you count the useless author bio information he loves to give. Mostly the class consisted of a few people discussing while everyone else who had laptops played games. Even if you did take notes on the student discussion, the topics were all over the place and did not give me a good overall idea of the texts. In a word, the experience was uninspiring.\nThat being said, Kevin is always available during office hours and is generally eager to help. Although I wouldn't want to have him as a professor again, I would advise anyone in his classes to be sure to visit office hours to preview your papers with him - he is a tough grader on papers, but not so much on exams. On the first paper the highest grade was a B+ for the whole class.\nWorkload:\n2 papers, take-home midterm, final exam, discussion postings online for participation grade\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "December 06, 2007",
            "review_content": "\nFor what it's worth, I had a very different experience with Kevin than the ones described below. I found him to be knowledgeable, energetic, creative and fair. In fact, I got the feeling that he genuinely cared if we understood the material and succeeded. It's true that he would sometimes get frustrated - though never losing his cool - with students who repeatedly complained that they didn't comprehend something. But mostly I found him a patient, approachable instructor. I thought it quite ironic that the reviewers below criticized Kevin's teaching style, since I've found the native instructors in the French department to be much more difficult to deal with. I'm just glad that, when registering, I kept in mind that my experience wouldn't necessarily mirror what I'd read. That said, it's also possible that Kevin has taken this criticism to heart. \nWorkload:\nFair. The usual grammar, which is mostly a review of/drilling-down into stuff covered in Intermediate I + short writing assignments and a final presentation.\n"
        },
        {
            "course_name": "1202",
            "review_date": "November 14, 2006",
            "review_content": "\nI very much agree with the reviewer who said that this instructor picks favorites. If he doesn't like you, he will go out of your way to pick at you and generally make you miserable whenever possible. I originally decided to take his section of the course because he appeared very nice for the first few weeks of classes and because he didn't seem to be as gung ho as some of the instructors who are native speakers, which was a relief for me since I don't plan to move to Paris and was just trying to fulfill my language requirement one way or the other. However, it became clear as the semester went on that appearances had been deceiving. Despite his calm demeanor when he's in front of the class, he can be fairly nasty when you speak to him privately. (Indeed, there were two separate occasions on which I was driven to the brink of tears talking to him. For his part, he didn't really seem to give a damn. It got to the point where I was embarrassed to even have to set foot in his classroom and completely uncomfortable around him.) He doesn't seem to be very sympathetic to students' problems, either, so if you have some sort of extenuating circumstances that will prevent you from turning in an assignment on time or that are interfering with your performance in the course, don't even bother trying to explain them to him. The best thing was he called me into his office hours right before I was scheduled to give an oral presentation in order to criticize me repeatedly, which I think was unethical because it really threw me off balance for the presentation, one that I think I would have done fairly well on otherwise. \nWhat's most unbelievable is that he's a teaching fellow, ostensibly hired for his great didactic ability. Avoid like the plague, unless of course you happen to be one of the students he likes, in which case you'll probably be okay. If you don't make that good impression in the first week of class, though, forget it.\nWorkload:\nTypical French 1202 workload. Tests, compositions, daily homework. \n"
        },
        {
            "course_name": "1202",
            "review_date": "June 18, 2006",
            "review_content": "\nI'm going to agree with everything the other student said and add a few points.  First, Kevin is the most defensive instructor I've had at Columbia.  He's astonishingly tense in class.  Whatever his intentions were, this seemed consistently to prevent him from teaching the material effectively.  Second, his lessons on grammar, usage, etc. were rarely structured well and never systematic.  Whenever students did not understand a grammar point after the first, often haphazard, explanation, Kevin would usually just respond with something like \"well, you're making it more complicated than it really is\", then start talking about something else.  In fact, he did not try to teach us much grammar at all and seemed a little confused over some of the more complicated points himself.  Instead, most classes consisted of him talking half in English, half in French about nothing in particular, with maybe some pointless group activity thrown in.  My French only improved this semester because I memorized the weekly vocabulary lists and did the assigned readings on my own several times.  I think I learned as much from the two women who filled in for him for one week as I did from him during the whole semester.  Really.  Also, he's American not French, and though he speaks fluent French--which, I suppose, is better than not--his accent  is more than a little off, which means you won't have practice conversing with a native speaker.  But all this would have been tolerable if Kevin had not been an unfair grader.  He graded our compositions much more harshly than other language instructors.  To give you an idea, the median for the essays, quizzes, and midterm usually seemed to be around a C+/B-, though most students ended up with a final grade that was slightly higher.  Again, holding us to a high standard would have been fine if he had taught well and held similarly stringent criteria for himself, but like I said above, he didn't seem to.  As a result, many students were unprepared for the departmental exams, which sometimes tested paradigms and distinctions in usage that had never been introduced at all.  The quizzes frequently covered topics that we had touched on for the first time that same class--i.e.only 15 or 20 minutes earlier.  He also clearly preferred some students to others, but I have no data on whether this affected anyone's grade.  The only positive thing I can say about this teacher is that he gave us an opportunity for extra credit at the end of the semester.  In the final analysis Kevin is just too defensive a personality to be teaching or grading anyone.  Luckily, the two textbooks we used, \"La grammaire a l'oeuvre\" and \"Panache litteraire\", are quite good, and the department has already made vocabulary lists for you; so if you're ambitious and have spare time you can learn a lot on your own regardless of your teacher.   \nWorkload:\nFive quizzes, one midterm, one final, 4-5 1-2 page compositions, one presentation.\n"
        },
        {
            "course_name": "1202",
            "review_date": "May 14, 2006",
            "review_content": "\nI find Kevin to be a complicated instructor. He is not picky about students speaking french in the classroom setting. In fact, I don't even think he is French. But that is not the point, I think he is an unfair grader. His quizzes and tests are graded very randomly and unfairly. The book and lectures he gives are also convoluted. Personally, I worked very hard in this class, and the results were not pleasing at all.  I do not recommend him. \nWorkload:\n5-6 quizzes ( difficult) 1 presentation, 5 papers, midterm, final\n"
        }
    ]
}