{
    "prof_info": [
        {
            "prof_name": "Phillip Usher",
            "prof_id": 2887,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Big Brother: Poetics of Power",
            "review_date": "September 17, 2009",
            "review_content": "\nProfessor Usher's Big Brother class was so refreshing. I took it last semester and really miss it now that it is over. It was a daring and exciting class where I felt invited to try out ideas and take intellectual risks. There was a good balance of lecture (approx 30-40 minutes per class) and other activities. Unlike many lectures that repeat generalities or seem disconnected from what I've just read, each of Professur Usher's lectures began with the text we were reading or with the film. The small details that I might have passed over were shown to be important. It was the first time that small details and big ideas, for me, were connected in a literature/film class. One other reviewer mentioned a lecture talking about a vase in a film that Prof. Usher supposedly interpreted as a vulva--I didn't miss a single class and such a comment was never made. Prof. Usher does stick to the details, for sure, and his comments on papers always criticized generalizations, but that is the point--to look at texts and films for what they're actually saying or might be saying rather than merely being content to talk about \"stories\" and the general picture. I learned way more here about reading and writing than in First Year Englih. If you're interested in politics, literature, and film, and if your're willing to abandon generalizations in order to really read, then this is a class for you.\nWorkload:\nFair. One paper, then a writing joural as a second paper, a final exam.\n"
        },
        {
            "course_name": "Big Brother: Poetics of Power",
            "review_date": "May 22, 2009",
            "review_content": "\nThis class was a waste of time. Prof. Usher may be a nice guy and all, but he certainly is not a good teacher. Every single class that I attended consisted of: \n1. 30 minutes of him rambling on hurriedly and incoherently about some obscure detail of a sentence or passage in the works we read (this was not necessarily a chunk of time, but rather small 5-minute interventions between other \"activities\")\n2. 30 minutes of trivia, useless anecdotes and \"class discussion\" -- were you turn to your neighbor and pretend to discuss intelligently some random and again obscure topic just marginally related to the readings or class\n3. 15-30+ minutes of a presentation where the students discussed, once again, some obscure article just marginally related to the spirit of the works and the class. As long as it sounded like a GRE vocabulary section, any presentation was a success.  \nProf. Usher is a smart guy, no doubt about it. He is also a generous grader. Yet the class did not add to my knowledge at all, and it was about the \"poetics of power\" as much as it was about \"lesbian utopias\"  (no, really!) -- as interesting as a concept as that might be. \nIn the end, all I took away from the class is an ability to \"analyze the text closely\" -- which in liberal translation is to see who can come up with the wildest and craziest interpretations of why a certain author used this particular noun in this particular sentence, or why this movie director chose to have the camera zoom in slower or faster. For example, on the final (three hours of in-class writing), one of the options (granted, there were plenty to choose from) was to write an entire essay on a movie captioning depicting a guy walking up the stairs. Another movie caption was a picture of a TV with the image of a guy on it. \nWhy did the director choose that particular vase in the corner? If you think to yourself \"well, that's one vase that came with the order they placed when they bought stuff for the movie\" or that the director did not even choose it, then you do not belong in this class. If however the vase reminds you of Big Brother and makes you think of a vulva, and you think it was suggestively placed there to indicate not only an oppressive environment but also the sad death of many who challenged the system -- yet without excluding the possibility that the vase is actually a visual depiction of the main actor's biographical past -- then you're in luck; this IS the class for you. \nA ton of BS, no real substance, but an easy A.  \nWorkload:\nVery light: Two 8-page papers, one 15-minute group presentation, three-hour open-book final. Just make sure you do a lot of \"close reading of the text\" to do well.  \n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "December 19, 2008",
            "review_content": "\nI thoroughly enjoyed my Intermediate I French class with Professor Usher.  He has a great sense of humor which is one of the main reasons why the class was so much fun.  I wanted to refresh my French after taking a year off from it and I was able to do just that in this class.  Also, I not only learned French grammar, I learned a lot about French culture.  We read a lot of poems by Apollinaire and looked at paintings by Picasso.  I liked the class discussions on art and literature.  The compositions that we had to write were creative and students can select something of interest, which makes writing the compositions easier.  Professor Usher is understanding and easy to talk to, especially with regard to assignment dates when necessary.  He also grades fairly.\n\nWorkload:\nThere were the usual textbook exercises and four compositions.  The midterm and final were tough but fair.  In addition, at the end of the semester, groups put on plays/scenes to demonstrate various concepts as a review session for the final. \n\n"
        },
        {
            "course_name": "Composition and Conversation",
            "review_date": "December 12, 2007",
            "review_content": "\nProfessor Usher is absolutely incredible. I took this class as a way to brush up on my French, which was already rusty after taking one semester off. This course was a great way to practice my French speaking in a safe atmosphere where I was never embarrassed to conjugate incorrectly or stammer on vocabulary. The class was easily my most consistently enjoyable class of the entire semester--I left on a regular basis with a huge smile on my face. Whether he asks you to write poetry, analyze videos, discuss current events or cultural differences, his classes are consistently well planned and engaging. I highly recommend this class to anyone looking for a not hard French class to polish old skills. But if you're looking for an intense, crash review course designed to finally get you to fluency, look elsewhere, or at least to a different professor. Usher is a very sweet man, but is potentially too lenient to really kick your French up to perfect proficiency.\nWorkload:\nNot bad. Five compositions, ranging from half a page to two pages each. Forty minute oral presentation, done with a partner, which is easily the hardest part of the course. Class participation a must, which requires staying up on the readings (when applicable) and watching movies when assigned, but the daily assignments rarely take more than an hour. Plus journal entries (two small pages, handwritten) once a week. Very manageable.\n"
        },
        {
            "course_name": "Composition and Conversation",
            "review_date": "June 05, 2007",
            "review_content": "\nPhillip Usher is the best French prof IÂ’ve ever had at Barnard/Columbia.  He is extremely good-hearted, extremely accommodating and friendly, and does his best to stimulate discussion in a class without any real topic.  The focus on this class is definitely not too heavy on writing, so donÂ’t worry about the workload because it is not very hard.  He seems timid at first but by the end we were all great friends and had little cheese parties for our presentations.  The class is good if you just want some opportunities to speak, though I didnÂ’t learn very many phrases or much colloquial French.  I was taking French in preparation to go abroad, and now that IÂ’ve been I think this type of course was better preparation that the subject courses I took since you are forced to speak.  If youÂ’re taking this course (or any other level he teaches), take it with Usher!\nWorkload:\nsmall assignments throughout, one long presentation.  very doable.\n"
        },
        {
            "course_name": "Composition and Conversation",
            "review_date": "December 16, 2006",
            "review_content": "\nI really loved this class! I highly recommend it... Phillip is a great professor and a great guy, and I always looked forward to classes - which kept me entertained. If you enjoy French and want to improve your speaking skills, take this class. The paper topics are original and therefore more interesting to do. \nWorkload:\nLight\n"
        },
        {
            "course_name": "Composition and Conversation",
            "review_date": "December 11, 2006",
            "review_content": "\nThis class is so much fun! Phillip Usher is funny and the class is such a pleasure to attend, however you don't learn much. Usher is very relaxed concerning grading and handing in papers and very nice to everyone. Despite the amount i enjoyed this class, i felt that my french actually worsened throughout the semester. I took this class as a first semester first-year, and felt that the class was no where near as informative or rigorous as my AP french class in high school. However, I would not advise against taking it. It's an easy A, and pretty entertaining\nWorkload:\n5  one page-long papers which are really easy, an oral presentation, and weekly journals. no final, no midterms\n"
        },
        {
            "course_name": "Composition and Conversation",
            "review_date": "November 14, 2006",
            "review_content": "\nPhillip is a great guy.  He is really enthusiastic about the French language and wants you to do well.  He balances discussing grammar, vocabulary, and pronunciation and tries to incorporate discussions of each of these as necessary.  He is relaxed about the structure of the class without letting it slip, so he is keeping people on task without making it seem like he is bound to the syllabus.  Phillip is really into writing and poetry and I liked that he was willing to accept very experimental and freeform compositions sometimes (as long as they were appropriate for the assignment).  I felt like I could actually try new styles of writing in French instead of trying to fit some guidelines for the good grade that my teacher had preset.  I feel like he is a really reasonable teacher who understands that you're busy students, as long as you do apply yourself in class.\nThe class itself is pretty much what the name of it says - a combination of speaking on various topics and writing compositions.  Some of the readings are recycled from other French classes, but you don't spend too much time on any one author or piece so it's not a problem.  You also get to learn some vocabulary that is useful in everyday conversations.  I feel a lot less self-conscious speaking in French in class and more confident in my French skills on the whole.\nWorkload:\nPretty light...a few compositions, no exams, one longer (30+ min) presentation in class but nothing too formal\n"
        },
        {
            "course_name": "Intermediate II",
            "review_date": "November 14, 2006",
            "review_content": "\nThis was by far one of my favorite classes this semester.  There is hardly any work involved, and Usher is a really nice guy.  If he calls on you in class and you don't know the answer, just say Je ne sais pas and he'll call on someone else.  The few quizzes we had were very easy, and he reviews the material for the first 45 minutes of class before the quiz, so it's almost impossible not to do well.  As long as you go to class and pay some attention, you should hardly have to study at all.  I didn't study at all for the midterm and made an A on it.  Definitely recommend taking this class with Usher.\nWorkload:\nA few short reading assignments(short stories, poetry), some vocab, a midterm, and a final, plus three 1-page compositions that can be written in about 30 minutes but he gives you a week to do them\n"
        },
        {
            "course_name": "Epic Travel: From Text to Road Movie",
            "review_date": "November 07, 2006",
            "review_content": "\nSo I signed up for this class in an attempt to fill my schedule and it ending up being the best class that i took all semester. Professor Usher is a really nice guy, he really cares about the students in the class. The books that we read were epics- so the aeneid, lancelot, the lusiads, oroonoko, candide, and ulysses + a translation that he did of the franciad. The material can be boring at times and on average its 50-90 pages of reading for each class. In addition to that we got to watch movies like apocolypse now, the wizard of oz, thelma and louise, and 2001 a space odyssey. The class is half lecture and half discussion of what we read and the movies we saw. It was really enjoyable and if you do the reading and see the movies you are completely fine. TAKE THIS CLASS. not only does it fulfill your literature requirement but it was extremely enjoyable and not very hard.\nWorkload:\nBi weekly journal entries which can be on anything and are only half a page each. A 10 minute class presentation on anything studied, and one final research paper. \n"
        },
        {
            "course_name": "Composition and Conversation",
            "review_date": "May 28, 2006",
            "review_content": "\nMind-numbingly boring course. Usher is a great guy, very friendly, approachable, and lax, but he was terribly unorganized! The course started off great and was very promising. The syllabus, co-created with Prof. Jouneau-Ferig, was filled with exercises and units that would supposedly encourage vocabulary development and in-class discussions. However, we barely ever followed the syllabus and our class discussions towards the middle and end of the semester seemed very forced and painful. You could tell that nobody wanted to be there, but because it was a language class, you couldn't skip. Moreover, whenever someone was speaking and would come across a vocabulary road block, s/he would ask him for the word, but he would say it so fast that the person ended up just mumbling through the word -- nobody ended up learning it.\nThe only good thing about this class was that it was really easy, the workload was totally manageable, and he wasn't anal at all. I think that the format of the course was on the right track, and had he stuck to the syllabus and encouraged vocabulary development, this course could've been excellent. If you're going to take French Comp and Convo, I strongly suggest you take it with another professor. His teaching style might be better fitted for beginning and intermediate courses.\nWorkload:\n5 Compositions, 1 30-minute in-class presentation (with a partner), occasional reading and translation (very short pieces), no midterm or final.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "April 18, 2006",
            "review_content": "\nUsher is great! He's really quirky and funny, plus hes a great french teacher. The class is never boring - he makes you do a lot of group work and little presentations each class. He gives you 3 compositions (1 page each), a midterm, a final, and a few shorter quizes during the semester. Hes also great about answering questions, and pretty lax about handing in work. The tests and quizes are always fair. A good class overall.\nWorkload:\nNot bad. (see above)\n"
        }
    ]
}