{
    "prof_info": [
        {
            "prof_name": "Austin Graham",
            "prof_id": 12491,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 27, 2015",
            "review_content": "\nProfessor Graham is a great teacher because of his class's structure. In class, there was an open and constant dialogue. There were very few instances where there was \"dead air.\" I think his idea to use different hand signals to indicate whether the next student wanted to introduce a new idea or continue on the idea being discussed was a great help to how well the class was run.\nOutside of class, I found Professor Graham extremely approachable. The two office hours I went to were extremely helpful in reshaping my understanding of the texts we were reading. In the office hours, Professor Graham listened to my interpretation of the text and then offered criticism on it. I thought his criticism was extremely helpful and admirable because he could have just as well said this is the way to approach the text and there is no other way to do so. In the office hours I also found Professor Graham very kind and respectful towards his students. He expresses a genuine interest in what every one of his students is doing outside of class. I would highly recommend Professor Graham for a class in LitHum.\nWorkload:\nStandard LitHum reading course requirements\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 15, 2015",
            "review_content": "\nThe scheduling conflict that made me switch into this section of LitHum is probably one of the best things that have ever happened to me. Professor Graham is extremely engaging and it’s obvious how invested he is in the course. \nThe class is almost entirely discussion about assigned readings. What I thought was most helpful was how much Professor Graham listened— as in, he makes sure he understands what everyone says, rather than assuming someone’s point or steamrolling it into the ground. A third of your grade is based on class participation alone, which is pretty great.\nHe’s also a pretty funny guy, very approachable, and visiting him during office hours is great for developing any ideas you might have. On your two papers during the semester, he leaves detailed notes for revision with your grade. It’s literally advice on getting an A handed to you.\nPay attention to discussions and make good notes. I’ll admit that I didn’t complete every assigned reading, but since the class goes over thematic elements based on close passage readings, it’s easy to form your own understanding of the text if you're listening. But, seriously, participate.\nWorkload:\nReadings, two papers a semester, one midterm and one final. Pretty manageable.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 15, 2015",
            "review_content": "\nProfessor Graham has been my favorite teacher at Columbia thus far. He has a strong command over the material, and is incredibly eloquent in presenting it. He is a “to the book” kind of professor, meaning he doesn’t believe in adding or subtracting from the typical lit hum syllabus. You know exactly what you are getting from him. \nIn terms of grading, Professor Graham is incredibly fair. Visiting his office hours before a paper is due is a must. He gives incredible advice and direction in his discussions during office hours. When he gives a paper back, he provides literally a page of feedback about your paper and how he thinks you are progressing as a writer. I have never seen a professor more dedicated to his student’s progression.\nPrevious reviews of Professor Graham state that you can get by if you just read sparknotes. While that may be true, Professor Graham loves delving into texts and digging up its meaning, so reading the books is incredibly helpful. \nIf you get Professor Graham, just know that means you have to participate in class discussions. A third of your final grade is participation, so that is definitely the difference between a B+ and an A-. \nIf you are a first year, stick with Professor Graham.  \n\nWorkload:\nStandard for Lit Hum. A lot of reading, 2 papers that are 5-7 pages, a midterm, and a final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 16, 2013",
            "review_content": "\nAustin is a great guy, and he's really passionate about Lit Hum. He is big on class participation, and, personally, I think that really helped his perception of people in the class (i.e. you talk a lot, you get good grades on papers). He isn't big on structured class because he emails you about the reading and what to prepare for the discussion. That being said, you can read sparknotes and be able to fully participate. He loves explications of the writing and digging into the text rather than talking broadly about it. Before papers, go to office hours and run ideas by him. He loves to know what you're thinking, and help you develop your argument. He also has great ideas, and if you can execute what he says, you can get A's. \nHis grading policy is:\n1/3 Class Participation (really the difference between a B+ and an A- in this class, so talk!)\n1/3 Exams (Midterm- use his emails to study, he likes to do ID's that are kind of tricky; Final- always the classic lit hum final)\n1/3 Essays (2 essays per semester structured like the essays on the final)\nIn terms of his essay grading, here's what Austin is looking for:\nIntro- an argumentative and interesting thesis, he doesn't want BS\nBody paragraphs with interesting arguments USING SPECIFIC LANGUAGE\nDevelopment\nConclusion \nHe keeps track of attendance and you get major points for just being on time every class. \nWorkload:\nGeneric lit hum with a flair of know what you're talking about in class the next day.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 26, 2013",
            "review_content": "\nAustin is a very nice and very easy instructor.  He is a recent PhD graduate from UCLA, so his area of expertise is still fresh in his mind.  Because of this, at times his reviews and discussions of books can be very \"Spark-Notey,\" i.e. they don't really go deep.  His class is structured as a complete discussion, no lecture.  He mainly just asks questions, students answer, and he builds off of this to move from point to point.  Never will you go into his class and be lectured about the content/meaning of a book, you are expected to figure that out for yourself via independent reading and class discussion.\nThat being said, he is extremely lenient on grading and is VERY helpful in office hours.  His reading can get daunting at times, but it truly is no more than any other Lit Hum class, and he follows the syllabus exactly (which means no extra readings).  \nHis grading policy is:\n1/3 Class Participation (Talk in class - if you don't, you will not get a good grade)\n1/3 Exams (Midterm and Final)\n1/3 Essays (2 essays structured like the essays on the final)\nIf you get Austin, DO NOT switch out.  He is knowledgeable, understanding, always willing to grant an extension (for a legitimate reason), and helpful in the end.\n***One note:  DO NOT, under any circumstances, ANY circumstances, even pretend to cheat.  He takes the honesty policy to the absolute maximum enforcement, and threatens to get students expelled if they cheat in his class.  Overall, however, this is not going to be an issue - if you do the reading and show up to class, you can pass his midterms and essays, and then you take the course final which is more of a joke than it is an exam.\nGood luck!!\nWorkload:\nTwo essays, readings, 1 midterm, 1 final.  Basic LitHum style course, no extra work outside of the syllabus.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 16, 2012",
            "review_content": "\nAustin graham is a great LitHum professor. He's young, flexible with the syllabus and rewards effort. A third of your grade is participation, a third on exams, and the rest is for papers. He's funny and everyday seems like an open class discussion. One thing though, USE PROPER GRAMMAR! It is easy to lose points on an essay for not using proper grammar and go to see him during office hours. Overall, I'd recommend him\nWorkload:\n 2 5-7 pg papers, 1 midterm, and the final \n"
        }
    ]
}