{
    "prof_info": [
        {
            "prof_name": "James Mirollo",
            "prof_id": 804,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 21, 2004",
            "review_content": "\nI can't believe all these reviews trashing Professor Mirollo. I'm a sophomore this year and this man is one of the best professors I've had, and THE best teaching a Core section. After sitting in with nihilistic, overeducated, pompous, depressing graduate students, Mirollo's brilliance is a welcome break. I stress the brilliance. He knows everything that can possibly be known about every single work we cover - in it's original language. He knows exactly which points to hit. The classes never drag. Taking Lit Hum with this guy is nothing short of intellectual nirvana.\nWorkload:\nTwo papers. Midterm and a final. Liberal office hours.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 08, 2002",
            "review_content": "\nI think the last review of Professor Mirollo is unfair. Sure, he is pompous and opinionated (what do you expect, he's been teaching lit-hum since before most of our parents were born) but in an amusing way that causes students to smile, not cringe. I think it is false to say that he is close-minded (though he is brilliant). He has his own opinions, but I wrote a smart-assed paper trashing a book he much admired and still got a B on it. While his use of foreign languages may get a little tiresome, it's not the hell that the last reviewer described. The class is certainly not for students who want to play teacher themselves though. Mirollo talks probably ninety-seven percent of class, and while he will eventually call on you, you'll have forgotten the comment you wanted to make. A lecture version of lit hum, which eliminates the smart-ass comments of pretentious students.\nWorkload:\nTwo papers, a mid-term and a final. no quizzes. He threatened to give a quiz once, but no one believed him and it didn't happen. Papers are graded easily and the mid-term and final are graded easily and fairly. It's possible to do well doing very little reading, but then with all his knowledge about the books, you'd be missing a lot of insight.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 17, 2001",
            "review_content": "\nWell, this man thinks so highly of himself that any more praise is unnecessary...and in my opinion, inappropriate. The quote I will remember was this one: \"Nothing good has ever been written in prison.\" He dropped that knowledge on Cervantes day. Speaking of dropping...well, you know where I am going. He has the most obnoxious habit of dedicating the first ten minutes or so of class to a recital of the work in the original language. I wish we could just sign a waiver acknowledging his linguistic skills (by the way, his spanish accent is piss poor) and get on with it. So overall, a horrible, close-minded professor. When he says \"I have been doing this for so long, you all are lucky to have me, blah, blah, blah,\" he really means \"I have been doing this too long to even care. My readings are outdated, biased and unproductive. Don't listen to a word I say.\" As you can tell, I loved the class.\nWorkload:\nWell, who cares? Either you recite his lectures in your papers, or you might as well turn in nothing. I essentially copied my notes into a blue book...that got my a solid A and nothing else (i.e. meaningful education).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 08, 2001",
            "review_content": "\nThe class can be summed up in one statement made by a friend, \"when you come for reunions, you'll say 'I had Mirollo for lit hum.'\" The man is an institution. he knows the material backwards, forwards, and in five different languages. As a result, the class is more of a lecture than a discussion, but you will be to busy gathering the perls of wisdom to miss your classmates smart-ass remarks. And, in spite of his attempts at intimidation at the beginning of the course, he is a very generous grader.\nWorkload:\ntwo papers 4-5 pages, midterm, exam (if you don't know, this is ridiculously light for Lit hum)\n"
        }
    ]
}