{
    "prof_info": [
        {
            "prof_name": "Gayatri Spivak",
            "prof_id": 476,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Derrida",
            "review_date": "January 30, 2007",
            "review_content": "\nProfessor Spivak was certainly harsh.  She had no tolerance for ignorance or inadequate language.  Though she gave vent to her personal philosophical vendettas at times without letting us know, it was utterly clear how intensly deep her knowledge is.  She can be very dissimulating, saying at times how she knows nothing of philosophy, she is just a little lady from calcutta, etc. but it is all a sham.  This scholar knows more than any of her students could ever pretend to.  And she will not shy away from making it obvious.  As one of 'the undergraduates' I was already in her good favor (oh how i pitied those grad students).  Nevertheless, she was human, and could have moments of lucidity in her lectures that made everything worth it.  Once, after ravaging, embarrassing, and utterly lowering the poor souls who did presentations first (word to the wise, it's near impossible to paraphrase derrida), she came back the next class and apologized.  Yet when a plucky student (unfortunately, too, a man) piped up with an attempt at humor on the subject, she snapped, \"noblesse can only oblige one way!\") Spivak is a genius, and if you are here, deciding whether to take her course or not, you shouldn't...because the best students will know already. just do it, because though it will pain, frustrate, and humble you, you need it.\n"
        },
        {
            "course_name": "Derrida",
            "review_date": "October 29, 2006",
            "review_content": "\nincredibly condescending, both directly and indirectly. for someone so concerned with self-aggrandization, intellectual foreclosure, and the dismal condition of the humanities as a discipline, it puzzles as to what pedagogic value might come from such harshness. felt more often alienated than educated; whether that is a lost object-lesson or some visceral hermeneutic exercise is up to you. truly a disappointing and disheartening experience.\nthat said, i can see why she might be great in a seminar. she's an incredibly meticulous reader, reacts quickly, and her anecdotes are both. disarming and endearing.\n"
        },
        {
            "course_name": "History of Literary Criticism",
            "review_date": "May 24, 2006",
            "review_content": "\nProf. Spivak is famous.  She is a bumbling old woman who wears a sari and tells stories like your grandmother would.  She has a rotator cuff problem that makes it impossible for her to open doors, so she just stands in front of doors until someone comes by and opens them.  She's absolutely nuts.  But her class was fine; not great, but definitely not unbearable.  The course material was so boring that all I wanted to hear were here anecdotes, which came pretty often so that was fine.  Guest lecturers were great for the most part, only 2 bombs in my opinion. This class is worth taking because of Spivak's unique insight into EVERYTHING.\nWorkload:\nPretty high for an elective class. One page response each week, graded really tough by the TA.  15-20 page midterm paper and same deal for the final.  \n"
        },
        {
            "course_name": "History of Literary Criticism I",
            "review_date": "April 21, 2006",
            "review_content": "\nA class with Professor Spivak is really a special experience. The subtext of her lectures tells you to read and read respectfully, give yourself over to it; let your identity fade away from the front of your mind so you may get closer to the text. If you are interested then you may experience thoughts or comprehensions or frames of thinking you had not before accomplished. She invites specialists on certain readings and in these you will hear her dialogue with them at some point in their lecture.\nShe is teaching a course on Derrida in Fall 06 for seniors and grad students only. If you do not fall under one of those two categories she will probably ask you to leave the class. But if you are a senior or grad student then you should take this class on Derrida from this professor who translated \"On Grammatology.\"\nWorkload:\nThere were weekly written assignments to fill only one page with something like a response/summary of each weeks readings. These are graded accordingly with how well you have grasped the text, I think. There was a 13 page essay form midterm take-home and we will receive the final as a take-home essay as well.\n"
        },
        {
            "course_name": "INTRO TO COMP LIT & SOCIETY Call Number 48458 ",
            "review_date": "December 16, 2004",
            "review_content": "\nSpivak team-taught this course with Hamid Dabashi. It's the required course for grad students who wish to join the Center for Comparative Lit. & Society (CCLS), and do comp. lit. Though perhaps Spivak prefers teaching undergrads, I simply CANNOT express WHAT A TOTAL NIGHTMARE AND UTTER DISASTER this course was. WORSE than useless, because if I hadn't taken it I wouldn't have been treaten badly, screamed at, insulted, given NO syllabus and had my final grade LOST for nearly a semester even though I submitted multiple copies of the final paper punctually! (I had to beg CCLS to finally issue my grade and had the distinct feeling that no one had actually read my final paper in the end). Spivak behaved like a prima donna throughout when she wasn't actively arguing with poor Dabashi. \nThe syllabus was never typed up and passed out... it lacked any kind of coherent structure and I never did understand why they'd chosen the items they did...and the logistical arrangements (once we were assigned a video--they refused to tell us the title in advance, then put it on reserve the evening before our 9:00 AM seminar of approx. 30 people, so basically no one could watch it, then Spivak yelled at us that we were \"self-infantilizing\" and useless) were delegated to Spivak's undoubtedly overworked secretary (Spivak apparently doesn't answer her own email). All this AFTER each of us practically had to go through a Broadway show audition to prove that we were worthy to be in the class. We also were placed in a classroom in east campus, which was locked and the keys weren't given to the instructors. Since they showed up late quite often (once Spivak didn't even show up and at that point Dabashi was refusing to teach simultaneously with her, so they alternated) we had to wait in a courtyard outside in the cold. Surely they could've planned that better?  I could go on, but I'll just relate one more anecdote: Spivak mis-heard (literally!! she must be getting deaf) a student's question, assumed he'd insulted people from the Third World, then yelled at him for a good 10 minutes. Dead silence, then he pipes up and explains that she had misunderstood. She didn't apologize, but said that she was done for the day and left. That was within the first 10 minutes of our once-per-week, 1.5 hour seminar. So since she hadn't told us our homework and there was no syllabus, we all just left too. Quality education!!!\nWorkload:\nIt varied: from a book to a photocopy to film assigned for a once-per-weekly seminar. Not too much time: it was a lecture format, not discussion, so no one ever checked that we'd done the work. Nor did we turn stuff in, except for the final paper. \n"
        },
        {
            "course_name": "Senior Seminar: Modernism (1996)",
            "review_date": "May 07, 2003",
            "review_content": "\nI learned more in this one semester seminar with Spivak than all of my other literature classes at Columbia combined; simply put, she is brilliant and freely shares her insight with her students.  She can be intense, but that's only because she is passionate about her trade.  Any English or Comparative Literature major who does not take the opportunity to study with her is really missing out.\nWorkload:\nHeavy, but reasonable.\n"
        },
        {
            "course_name": "History of Literary Criticism",
            "review_date": "December 31, 1999",
            "review_content": "\nI really enjoyed this course. The class is primarily a lecture although students have plenty of opportunity to ask questions and Prof. Spivak herself tries to gauge the understanding of the students by asking questions during the lecture. Her lectures are always informative and take you beyond a merely superficial understanding of the text to a questioning acceptance of the texts.    Spivak was very well organized and always prepared but that's probably due to her immense erudition more than anything else. Sometimes her lectures can be a little difficult to follow, though.    By including non-European literary criticism along with the texts that are more widely accepted as forming a history of literary criticism, Spivak gives this course an interesting flavor, linking thoughts and ideas across geographical boundaries. I found the content challenging and exciting. I took this class primarily because of the professor and I was very happy with my decision.\nWorkload:\nClass work consisted of weekly readings ranging from about 70 to 150 pages (more on one or two occasions). Readings have to be done since you also have to write a one page paper based on that week's reading that's due the day before class. Some of the readings are very difficult (e.g.  Kant, Anandavardhana and Abhinayagupta, etc.) and trying to summarize your  thoughts in a page can be challenging.  Other than the weekly readings and one page papers,  the only other requirement is a take home final at the end of the  semester. Prof. Spivak advises you not to spend more than three hours on  the take home final but it seems that most people do.\n"
        },
        {
            "course_name": "History of Literary Criticism I",
            "review_date": "December 31, 1999",
            "review_content": "\nYes, take this course but be forewarned: Spivak is a little odd, to put it mildly. She will go to any length to make her lecture interesting, even if that means extended strolls down her personal memory lane. Her devotion to her students and to the material are evident in her daily preparation and close reading of students' weekly commentary of the texts. While she actively seeks out class participation, a certain level of intimidation remains. Hey, she is the primary translator of Derrida. But all in all, a diamond in the rough known as the Columbia faculty.\nWorkload:\nweekly reviews of reading, class particpation, and a final...she's an exacting grader.\n"
        }
    ]
}