{
    "prof_info": [
        {
            "prof_name": "Asim Ansari",
            "prof_id": 3009,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Marketing",
            "review_date": "January 14, 2010",
            "review_content": "\nOverall a good experience. His into to marketing class was a lot of work - frequent quizzes, two midterms and a final. Pharmasim simalation tied into his class very well and improved the learning experience. Slides were good and complemented the textbook reading (enforced by quizzes!) well. Class very quantitative. He is a good professor and offers a well rounded class.\nI can imagine how the person from another review was disappointed with the quantitative part of the class - getting a good grade without strong math skills will be hard. That being said, it's basic high school math, and nothing overboard. \nWorkload:\nMedium to high\n"
        },
        {
            "course_name": "Intro to Marketing",
            "review_date": "July 27, 2006",
            "review_content": "\nHe is a decent lecturer but a very lazy professor.  Does not like to interact with students and never responds to emails.  Uses his MBA slides to teach the Intro to Marketing class does bother to edit for his target audience, which seems common sense for a Marketing professor.  The PharmaSim lab was interest and educational but professor based final on problem sets that he only showed once in class and was written with a higher degree of difficulty which he says he gears towards his engineering target audience but half of the class are other students without math backgrounds.  There is not math prerequisite for this course.  If you ask him for problem sets or homework to learn and practice these problems.  He says sure but is to lazy to ever actually follow through.  If you are not an engineering student his final will penalize you.  You will not have the same opportunity to do well in this class based on the final.  He keeps changing the weight of his final from 50% to 60% which screws you even more if you did well on the Lab.  He is not accessible to the students nor is he responsive.  Lazy, lazy, lazy instructor should not be teaching targeting and marketing since he clearly does not practice what he preaches.  He admits that he never reads the assignments he has you hand in for class, says he tells the students he'll read them just to force them to read the case studies.  LAZY!  Do not recommend this instructor--you will be asked to do a lot of work but get screwed in the end with the final he gives.\nWorkload:\nToo much outside group meeting for midterm simulation lab assignment.\n"
        }
    ]
}