{
    "prof_info": [
        {
            "prof_name": "Thomas Diprete",
            "prof_id": 2527,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Senior Seminar",
            "review_date": "May 13, 2016",
            "review_content": "\n4 things to note:\n1) His lecture is dreadfully boring - it is indeed painful. His reading assignment is interesting, though.\n2) He is incredibly flexible with assignments\n3) He is helpful as long as you are serious students\n4) Fair grader\nWorkload:\n3 summaries of weekly readings (only 3 weeks out of 13) + research paper longer than 20 pages\n"
        },
        {
            "course_name": "American Society",
            "review_date": "February 01, 2010",
            "review_content": "\nProfessor Diprete is the single worst professor I have ever had during my 4 years at Columbia. His lectures were incredibly dry, and often just read his notes aloud while simultaneously using a laser pointer to unenthusiastically point at the screen. While the workload was incredibly light (only three 7-9 page papers), the possible topics were incredibly ambiguous and oddly phrased. When I emailed the T.A. (Rosemary McGunnigle) and asked her to elaborate on the topics, or better explain, she seemed offended and annoyed to be bothered with such an absurd request. Both Diprete and Rosemary were beyond unapproachable. They seemed annoyed, superior, and incredibly cold. One day in class, the professor openly berated a student for asking what he clearly deemed to be a stupid question. In general, stay away from participating in this class, unless you are regurgitating his opinion. The paper comments were equally offensive. He encouraged students to use outside sources of interest while researching the paper topics, however, if the findings from the source were not in agreement with his political ideology, regardless if they were from a reputable source, he would mark you down for not agreeing with his theories. Never before, have I experienced such a negative and unkind professor. I STRONGLY advise you to not take a class with this man, if you can help it. If you're looking for an easy workload, please note the unpleasant experience above and reconsider. \nWorkload:\nFairly light. Three 7-9 page papers, with an optional fourth for extra credit. Readings are not necessary, but will help with papers. DO NOT STRAY FROM HIS OPINION. And trust me, you'll be very aware of his \"opinions\" during lecture.\n"
        },
        {
            "course_name": "Senior research seminar",
            "review_date": "September 12, 2007",
            "review_content": "\nI found Professor DiPrete to be unavailable. He was never less than 15 minutes late for our appointments, and was often 30 or even 45 minutes late. Once he didn't show up at all (although I left after waiting 45 minutes so maybe he was just 50 minutes late). During our appointments he would often pick up his cell phone to talk to his kids and several times asked me to leave the room for 15 minutes while he made phone calls. I understand he's busy, but maybe he shouldn't teach a class which requires individual appointments with students if he doesn't really have the time.\nHe is friendly and approachable and gives you the sense that he believes you can succeed. Perhaps he believes a little too much, as he would expect me to figure out complicated STATA stuff on my own which neither the TA for the class nor the Electronic Data Services staff could figure out. If you're planning on doing a project involving large data sets and STATA, I recommend you be comfortable and familiar with it on your own first, and seek out help very early on to see if you can get the help you need.\n"
        },
        {
            "course_name": "Senior Research Thesis",
            "review_date": "January 16, 2006",
            "review_content": "\nAt first Diprete can come across as critical and not open to your ideas if they are different. However, you will soon learn that he is trying to get you to think about your ideas in a larger context. He is so funny and approachable and provides great advice for refining your  topic. \nWorkload:\nSenior thesis - 25 page minimum. \n"
        },
        {
            "course_name": "Senior research seminar",
            "review_date": "May 10, 2005",
            "review_content": "\nProf. Diprete is great and understable.  He is somewhat flexible in term of paper submission.  Although the class requires a lot of independent research Prof. Diprete was very reacheble throughout the course of the semester.  \nWorkload:\nSenior thesis paper submitted at the end of the school year.  There was also a presentation done at the end\n"
        }
    ]
}