{
    "prof_info": [
        {
            "prof_name": "Alondra Nelson",
            "prof_id": 3613,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "June 15, 2014",
            "review_content": "\nI think the course was pretty good. This was the first time I ever interacted or even read academic feminist texts. I was familiar with a lot of the ideas presented -- intersectionality (probably the biggest one emphasized) -- but being able to read what the authors said in their own words was refreshing. \nHowever, I'm not sure how to actually *feel* about the course itself. Women's and gender studies is a very broad topic, of course, and there is a lot you can say about it, and I feel that Professor Ciolkowski and Professor Nelson really did try to cover the breadth of what they thought their primary audience would find interesting. I'll get back to this later. \nA lot of the people in the lecture and discussion were very financially well-off white women, also presumably cisgender and heterosexual (though I may totally be wrong). While this isn't necessarily a bad thing, I agree with the May 23 reviewer, that it was rather sad to sit in a room with white women and discuss the issues in Push, a book that deals very intimately with the experiences of a Black woman. \nThough my group seemed to have more diversity, there was *still* whiteness that came through. I remember very clearly hearing a white woman use the term \"colored people\" in the 11th or 12th week -- seriously!? Thankfully someone called her out right away (though that person was not white) but I was very surprised my TA did not pick up on that. \nGetting back to the material -- most of it was related to women and women of color. While that doesn't sound bad for a Women's studies course, I would have appreciated to see discussion on trans or non-binary issues (we read one article and a book chapter that dealt with this in depth, the rest usually did not even mention trans or non-binary) especially considering that this course is \"Intro to Women's and GENDER studies\". \nTo highlight the cis woman centric approach taken, we had a week called \"Women's health\". In no part did it mention trans women and the health issues they face. Instead, it was focused on the fight for abortion or the paternalism women faced while making choices about their own bodies. I repeat --- YES, these are important, but there really is no \"Intro to Gender Studies\" in this course at all. \nIn addition, I'd have liked to see more stuff relating to queer theory. Although I know that this course is not for sexuality/queer studies, the department is now called \"The Institute for Women's, Gender and Sexuality Studies,\" and I think their intro course should reflect that. We had one week (which I thought was absolutely fabulous) dedicated to queer theory, but ideally I'd like to see the course take on more sexuality and gender studies, and less women's studies. \nDon't get me wrong. Women's issues ARE important. But the way this course is set up, we read a ton of stuff about intersectionality/double jeopardy/etc. While this is great, it only created an **illusion** of depth. Thinking back, hardly any of the articles really expanded on another. Instead, they repeated gave the same superficial (I thought) view of what Black/Latina women's issues are. This was especially prominent in the first few weeks, where we would read several articles on the same topic. While I could forgive this if each one took a different approach, or revealed something different, but what we got was a lot of the same material repeated over and over. \nThus, I would propose to the professor that she sacrifice some of this artificial depth for actual breadth. Even if it was just one week talking about trans women/non-binary genders, I'd be delighted. Though really it should be more. Don't get me wrong, there were some fabulous readings (the ones about visual culture, and Discipline and Punish were great) and if you've never encountered any of the topics presented, the syllabus will be elucidating. \nNow, about the professors. Professor Ciolkowski is a nice woman. She is very enthusiastic and this is clear in her lectures. However, like they syllabus, she always tries to cover too much, sacrificing deep analysis for superficial summary and a few nuggets here and there. If she slowed down and tried to cover less -- seriously, the class is the exact same amount of time every time! -- then she'd be a fantastic lecturer. She obviously loves lecturing and always has a smile, but her lectures are just too fast and there is no way we could ask her to slow down, unless we want to miss half the lecture she planned!! \nProfessor Nelson on the other hand, is a great lecturer. Her powerpoints are clear and follow her lecture, and give us a way to take in the information visually. She doesn't speak obscenely fast, and she almost always finishes the material planned. Her voice doesn't come across as enthusiastic, and (from what I gathered from her section and lecture) she is often out or not lecturing, but she is a fabulous lecturer when she DOES lecture. I also appreciated that she would often deliver the lectures about Black women's issues. \nMy TA, Mina Khanlazardeh, was so sweet. She is a very easy grader but facilitates discussion very well. She often picks an issue she likes (though I think in the future she'll base her discussion choices off of the response analysis) and usually tries to not dominate the conversation. However, there are the times where she does. I remember she spent half of discussion reading something about Foucault and his discourses. But, aside from a few duds, I often looked forward to her discussion leading. She's obviously a very smart woman and it was pleasure to learn from her. She also has a lot of book recommendations, so try to write them down (if you can!). \nAll in all, this course was pretty good. Would I take it again? Maybe. Depends on the syllabus. However, I would really recommend you re-consider taking this if you want an easy A, or even if you've read a decent amount of academic feminist texts. That being said, if you're interested in reading these feminist texts and interacting with them, the course isn't bad. Just be aware there are a lot of them. \nWorkload:\nA lot of reading (at least 100 pages per week). Often we were assigned multiple chapters from print books, and in one case, an entire book. I usually got to most of it, but since a LOT of the reading repeats, you can usually get away with reading the shorter works. My advice -- if you skip a reading, pay close attention to when it's discussed in lecture. The key ideas will usually come out. \n10% is attendance, class participation and attendance in campus events. You write a 1-page event report. \n15% is 5 response analysis. These are 2-page reports where you critically analyze two texts together. These were really vague, but I think the TA's have a lot of discretion too. Ask your TA what they're looking for, or take a chance if you think your TA is nice enough. \n20% is a midterm. Passage ID/Analysis of 6 of 8 passages. Took place one third in (6th week, I think). \n25% is a 'media file'. Involved collecting three different sources to analyze critically (note, they have to be from different mediums, so you can't analyze three TV shows or whatever). You turn in annotations for two of them (basically notes on what you want to write about) and then a 5 page essay about 10 days later. \n30% is the final exam. Similar to the midterm, it was Passage ID/Analysis of 6 of 8 passages. There was also a short essay where you have to analyze two images from visual media. You got a handwritten cheat sheet. \n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "May 01, 2014",
            "review_content": "\ntake this class, it'll make you a much better critical thinker and make you see the world in a really different way. the readings are all interesting and rewarding, i felt like i was learning things that were important to life in this class. one day a week it's lecture (in which no one really pays attention, to be honest...) and the other day is discussion section, which is really fascinating. we had a lot of really great (sometimes tense) discussions in my section.\nWorkload:\nabout 100 pages of (interesting!) reading a week, 6 2-page papers, one bigger project on the subject of your choice, midterm, final\n"
        },
        {
            "course_name": "Post-Racial America?",
            "review_date": "December 12, 2011",
            "review_content": "\nThis is an overall GREAT class. Professor Nelson is actually brilliant, but also cares a ton about her students, which is a combination you rarely see. She lectures from Powerpoints, but it's not boring like Powerpoints usually are, and she doesn't post them online, so you pretty much have to go to class unless you are in the class with a really nice friend.\nThere is a midterm and a final, both the same format: 8 of 12 term IDs from the keywords she gives you at the beginning of every class and 2 of 3 short essays dealing with over-arching topics. You also have to submit a discussion question via email before each class, and then Professor Nelson pulls 5 or 6 discussion questions for the class to talk about. And there's a short paper on which I, and other people I know in the class, ended up not doing very well... so definitely ask a lot of questions about the paper if you don't understand what you're supposed to do.\nIt's a difficult class, there's no doubt about that. There's a lot of reading, and you basically have to do it all to know what's going on and to be prepared for the exams. It's really not burdensome, though, because Professor Nelson makes it relevant information that it benefits you to know in everyday life, not just in the classroom. Racial sociology is not at all my field of interest and I only took the class because I'm a soc major and it fulfills a major requirement. But I found myself invested in the class anyway, something I wasn't at all expecting. \nI'd highly, highly recommend taking any class with Professor Nelson. She's a great teacher who will make you interested in whatever she talks about.\n\nWorkload:\nDiscussion question for each class, ~100 pages of reading per week, short paper (4 pages), midterm, final\n"
        }
    ]
}