{
    "prof_info": [
        {
            "prof_name": "Dax Proctor",
            "prof_id": 11657,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 05, 2012",
            "review_content": "\nI am glad that I am the first person to review Dax, since this no-culpa-review \"UW\"course turned out to be a pleasurable one. Dax speaks in a very lucid manner. He tends to use a lot of (possibly self-invented) \"key terms\" to help you remember important \"writerly moves\". This method proved to be fairly effective. At the end of the semester, everyone at least remembered \"super-charge your essays\" and \"the unfamiliar reader\". Dax keeps things very organized online and offline, and is the only professor I have encountered so far who is good at using New Courseworks. He is also approachable and accessible after class. If you cannot make it to his office hours, you can schedule individual appointments or \"phone conferences\" with him. Likewise, when you send Dax an email, you know you will get a timely reply. Besides taking his work seriously, Dax is a very relaxed person. Although he is not the joke-teller type who makes you ROFL, he puts a smile at your face at a 6:10-7:25 time slot. He actually doesn't mind if you can't finish the exercises on time, but do not take advantage of this because the assignments are actually helpful. Helpful for class discussion at least, for he will call on you.\nBecause I wasn't a very good writer, I didn't expect myself to like UWriting too much. However, this class really taught me a lot and if there was a second term for it I would take it with Dax again. Dax's grading doesn't fall on the easy-side (or maybe it's only because I stuck), but I think it's relatively fair. To be fair to him, I'm writing this review before I get my final grade just in case things get uncontrollable. \nI highly recommend Dax to whomever wants to improve his/her writing skills.\nWorkload:\nNon-graded writing/reading assignments for every class, which can take from 40 minutes to 3 hours.\n3 Essays with cover letters and 1 Reflection.\n"
        }
    ]
}