{
    "prof_info": [
        {
            "prof_name": "Steven Shaklan",
            "prof_id": 3061,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Russian II",
            "review_date": "April 13, 2007",
            "review_content": "\nSteven is wonderful.  It was inspiring to be around someone so committed to helping other people learn.  It was clear that he spent a lot of time preparing the lessons which he didn't have to do because technically you're supposed to learn all the grammar in grammar lecture.  He takes teaching Russian very seriously, but still manages to have a great sense of humor and create an overall enjoyable class atmosphere.  I learned so much from Steven.  Though all the Russian teachers are wonderful people, Steven is truly special and I feel incredibly lucky to have been in his class.  \nWorkload:\nThis department is not kidding.  There is soooo much homework.  2 hours a night...definitely\n"
        },
        {
            "course_name": "First-Year Russian I",
            "review_date": "January 17, 2007",
            "review_content": "\nI loved taking Russian with Steven. He is a nice guy in general, and understanding when students have trouble understanding. He was strict about students speaking Russian in class and not reverting to English, and this made a huge difference--by the end of the semester, we all realized how much we had learned just through the enforced practice. The only annoying thing was that the class was five days a week and we had tests about every week and a half or so, although this was not his fault as he was not responsible for creating the curriculum or the daily schedules. Overall he was awesome, and obviously cared about students really learning the language, which made a huge difference.  He sparked my own interest in the Russian language, and the great class I had with him is probably the reason I am continuing with it.\nWorkload:\na couple hours of homework per night, frequent tests. not so much difficult as time-consuming.\n"
        },
        {
            "course_name": "Russian II",
            "review_date": "December 13, 2006",
            "review_content": "\nSteven is great. He explained things so clearly that it was almost impossible not to understand them. He was totally approachable and personable and obviously cared about our understanding. Maybe it was just the kids in our class or maybe it  was Steven (or a combination?) but this class was a pleasure to go to, despite the pretty considerable amount of work and the unpleasantness of meeting six times a week. Since someone else coordinates the Russian I curriculum, Steven didn't really control what work was assigned or what was on the tests. I was intimidated at the idea of learning Russian at first, but I'm really glad I took this class and that I took it with Steven. \nWorkload:\nKind of a lot, 1-2 hours of homework a night, recorded assingments, test every two weeks (often on fridays), an oral dialogue at the end of the semester and a final. \n"
        }
    ]
}