{
    "prof_info": [
        {
            "prof_name": "Patricia Romero",
            "prof_id": 842,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Spanish",
            "review_date": "October 18, 2007",
            "review_content": "\nMore fun than you can possibly expect at 8am. You will learn Spanish in her class, whether you like it or not. \nWorkload:\nThorough\n"
        },
        {
            "course_name": "Elementary Spanish",
            "review_date": "October 18, 2007",
            "review_content": "\nMore fun than you can possibly expect at 8am. You will learn Spanish in her class, whether you like it or not. \nWorkload:\nThorough\n"
        },
        {
            "course_name": "Elementary Spanish",
            "review_date": "October 18, 2007",
            "review_content": "\nMore fun than you can possibly expect at 8am. You will learn Spanish in her class, whether you like it or not. \nWorkload:\nThorough\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 11, 2006",
            "review_content": "\nAre there two Patricia Romero's??  I signed up for her based on the glowing reviews she got here and was totally disappointed. This is one moody lady--hard to predict or deal with at 8am. We did little to no actual speaking during class, mostly just listening (& watching!) her strut around class making big soap opera faces and \"talking with her hands\". She doesn't play favorites so much as she plays Least Favorites. There were a few students who clearly had had no prior Spanish. I'm not a fan of babying the stragglers but her method of waiting imperiously for the right answer after manymanymanymany failed attempts was unnecessarily humiliating and a total waste of time for the rest of us.  She's also one of those control freaks who rails about being punctual but is frequently 10-15 minutes late to class herself. Take her if you miss your hot high school Spanish teacher and haven't figured out how to manage your own time and learning. But if you're an upperclassman and just finishing out your requirements, I'd say try somebody who cultivates interaction and conversation more than just having a captive audience. I'll end with something nice & say that she seems to like art & progressive politics....\nWorkload:\nClearly more accustomed to dealing with her Fordham students. The only CU professor I know who walks around doing weekly in-class checks of the daily (!) homework. Lots of busy work but predictable & laid out in the syllabus if you want to work ahead. Be sure to stay alert about her syllabus--there were a few incidents where she forgot to assign the work (including our final oral exam questions) but didn't realize it until the day she thought they were due. We ended up cutting a chapter from the syllabus-not sure if that was her or the department though. Again, she's totally strict about punctuality but doesn't return the favor on the grading end. We never got our final composition back from her at all.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 11, 2006",
            "review_content": "\nAre there two Patricia Romero's??  I signed up for her based on the glowing reviews she got here and was totally disappointed. This is one moody lady--hard to predict or deal with at 8am. We did little to no actual speaking during class, mostly just listening (& watching!) her strut around class making big soap opera faces and \"talking with her hands\". She doesn't play favorites so much as she plays Least Favorites. There were a few students who clearly had had no prior Spanish. I'm not a fan of babying the stragglers but her method of waiting imperiously for the right answer after manymanymanymany failed attempts was unnecessarily humiliating and a total waste of time for the rest of us.  She's also one of those control freaks who rails about being punctual but is frequently 10-15 minutes late to class herself. Take her if you miss your hot high school Spanish teacher and haven't figured out how to manage your own time and learning. But if you're an upperclassman and just finishing out your requirements, I'd say try somebody who cultivates interaction and conversation more than just having a captive audience. I'll end with something nice & say that she seems to like art & progressive politics....\nWorkload:\nClearly more accustomed to dealing with her Fordham students. The only CU professor I know who walks around doing weekly in-class checks of the daily (!) homework. Lots of busy work but predictable & laid out in the syllabus if you want to work ahead. Be sure to stay alert about her syllabus--there were a few incidents where she forgot to assign the work (including our final oral exam questions) but didn't realize it until the day she thought they were due. We ended up cutting a chapter from the syllabus-not sure if that was her or the department though. Again, she's totally strict about punctuality but doesn't return the favor on the grading end. We never got our final composition back from her at all.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 25, 2006",
            "review_content": "\nPatricia is an extremely friendly teacher, who genuinely cares for her students. I found that throughout the semester she became more personable, which is sometimes lacking with teachers at columbia. Although this course covers much of the basics learned in high school, she does a great job of emphasizing them and is more than fair with her grading. By simply attening class and doing the work she assigns, you should be ready come grade time.\nWorkload:\nComparable to other classes, possibly lighter. A few compositions, unit tests, relatively easy  midterm and final.\n"
        },
        {
            "course_name": "Spanish I",
            "review_date": "January 09, 2005",
            "review_content": "\nExcellent professor!  I think the department is losing her to Fordham, which is a tragedy for us !  She really cares about her students and teaches the class in a very orderly manner.  I found this class to be a great introduction to Spanish and provided a greet foundation.  The only thing I would worry about is her mood which is as unpredictable and varying as the new england weather.  Stay on her good side, and you'll be golden.\nWorkload:\nTypical of any spanish class, workbook exercises every night, a test every 1 1/2 - 2 weeks, about 4 compositions, department midterm and final. \n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 03, 2005",
            "review_content": "\nPatricia is a good teacher, and i would say most of the reviews of her are accurate.  You don't ever get bored in her class, and she definately knows when to joke and when to be serious.  Also, this class is a pretty easy one if you simply do the work.  If you do ALL the work, it is not difficult to get an A.  I would definately reccomend her, and I want to take her again.\nWorkload:\nQuiz every 2 weeks, Labs, short papers, homework every night.  Midterm, final.  Most of it is just busy work, but it will take a while.\n"
        },
        {
            "course_name": "Elementary I, Intermediate II",
            "review_date": "June 28, 2004",
            "review_content": "\nPatricia is a great professor. You will learn a lot of spanish that will be useful to you in the future. She likes to joke around but get down to work when it counts. She is great with extra credit and giving the class chances to redeem themselves on poor tests. She is not afraid of admitting if an exam was too hard, but she won't expect nothing than your best!  If you participate in class, do all of your homework, and get decent grades on the quizzes, you are set. She writes recommendations too!!! Overall, she is the best spanish teacher I have ever had at Columbia. Take her from beginning to end and you'll be speaking spanish by the end of your third semester. Absolutely recommended. Estoy segura!\nWorkload:\nQuizzes every other week (announced in plently of time), 3-4 compositions ( a fifth for extra credit sometimes- TAKE ADVANTAGE OF THOSE...IT REALLY HELPS (10 PTS added to your grades), one midterm, and one final. An oral presentation/group depending on the class. \n"
        },
        {
            "course_name": "Spanish",
            "review_date": "February 16, 2004",
            "review_content": "\nAn excellent teacher!  I learned very much from her class and appreciate her teaching.  She truly wants you to make an A and is very lenient and nice.  If you have the chance to take her class, definitely take it -- it is worth it, even if it is at eight in the morning.\nWorkload:\nTest every other week.  Midterm and final.  Three or four compositions.\n"
        },
        {
            "course_name": "elementary spanish I & II",
            "review_date": "August 08, 2003",
            "review_content": "\nshe's one of the best prof's here at columbia. she' engaging and funny and teaches well. she always goes out of her way to make sure everyone understands everything. she offers A LOT of extra credit that helps A LOT. her tests are really fair and could be considered easy if you study well. she never tries to trick you on the exams.she's often got her  mood swings and can go from hot to cold easily. but most of the time she's super sweet. just make sure you always check you tests cause she sometimes adds wrong  and you end up w/ a lower grade than you're supposed to ...(however, fortunately for you... sometimes accidentally in your favor)\nWorkload:\nes I: daily exercises, weekly quizzes, 3-4 compositions, midterm, oral test, and final. \nes II: infrequent daily exercises( more like twice or three times a week), weekly quizzes,  3-4 compositions, midterm, group oral project, and final. \n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "May 07, 2003",
            "review_content": "\nPatricia is great.  She knows how to teach and encourage students who are having trouble without letting her high standards slip.  She has mood swings that can be surprising but is a very nice person.  She loves goofing around with a class if she feels they're working hard and can trust them.  Very open to extra credit.  She comes accross as a nazi on the first day to scare people.  She's really very nice and fair\nWorkload:\ndaily exercises, weekly quizes, four compositions, midterm, group project, and final.  It's alot of work.\n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "November 20, 2002",
            "review_content": "\nPatricia is wonderful, I highly recommend you take her class. She is nice and fun, and very, very fair. She has thrown out tests that we did overly poor on, plus she drops your lowest quiz grade at the end of the semester. Her teaching is clear, and her tests not hard at all. She has on occaision brought in food, and is generally friendly to all. She does have her grumpy days, so just be sure not to be late to class all the time or miss before midterms or exams, and you'll be fine with her. Taking your course with Patricia is a good idea\nWorkload:\nsmall daily or weekly assignments. 5-6 tests, 4-5 one page essays, a department midterm, oral and final exam. Overall not much work at all, not too hard to pull an A, even if you never were an A spanish student\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "March 07, 2002",
            "review_content": "\nPatricia is a wonderful professor. Although I find her class difficult I must say that she is fair. She is always available for office hours, after class, and does respond to emails. I would highly recommend her as an instructor.\nWorkload:\nFair amount of work. Some homework assignments but most of the work that you will do will be done on your own -\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 17, 2001",
            "review_content": "\nYou picked a winner. She won't give you trouble with grades but if you bother putting forth any sort of effort on your own you'll learn plenty of Spanish. She has a good sense of when to lighten up and let the class joke around and when to get down to business. Everyone in class was trying to get into her class for the next semester.\n"
        }
    ]
}