{
    "prof_info": [
        {
            "prof_name": "Mira Dancy",
            "prof_id": 9968,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Painting 2/3",
            "review_date": "August 09, 2013",
            "review_content": "\nFantastic, fantastic, fantastic. I've taken a lot of visual arts classes at Columbia, and I can say hands down that Mira Dancy is the best art teacher that I've had. Mira is incredibly kind, very approachable, honest, constructive, and (what sets her apart from others teachers I've had) really really engaged in her students' work. \nI knew from the outset that her class was going to be great -- rather than spending the first day just taking role and giving us an overview of the class, Mira took us on a surprise field trip to the Met, where we looked at paintings together as a class and talked about what we liked, understood, hated, and struggled with. \nThough her tolerance for bullshit is low, Mira approached even the shittiest paintings with an open mind. She has a particularly keen eye for connecting students' work with the work of successful artists, which helped guide a lot of us when we were struggling. Crits could drag on for as long as four hours for our class of eight (especially towards the end of the semester when we were all engaging with painting for more time outside of the classroom), but in all honesty, I'm glad they did. Our long, open conversations were the result of nothing more than Mira being thorough and making sure each student got the best advice and guidance that she could give. Additionally, Mira was really great with helping all of us to find our own voices as artists. She encouraged experimentation, was really open to discussing new ideas about theory and practice, and never tried to pigeonhole us into one particular brand of painting or thought. \n10/10 wish I could take her class again.\nWorkload:\nWe were expected to spend about 6-8 hours outside of class painting every week. More like 8-12 hours toward the end of the semester. \n"
        }
    ]
}