{
    "prof_info": [
        {
            "prof_name": "Madeline Schwartzman",
            "prof_id": 1536,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Perceptions of Architecture",
            "review_date": "April 09, 2014",
            "review_content": "\nIf you can avoid having her as a teacher I would highly suggest that move!  She is erratic and wacky.  Some days she can be helpful in helping you produce a product or model and other days she changes her directions completely making you start your project all over.  She can be very rude and blunt in ways that are not productive to your learning.  I truly believe she grades based on who she likes and who she doesn't. Her projects do not make you want to pursue architecture any further.  However, if you do things inspired by the human body she will love it.  Everything is architectonic if it doesn't make sense, but if you think something through and explain it she will not like it.  I found this class very hard to enjoy.  I started every day with a headache when I had her.  I look forward to other architecture professors and not having her again.  The class was a waste of time.  She can be nice if she wants to be, but mostly it's her complaining about her multiple sicknesses .\nWorkload:\n2 major projects -collages, study models, drawings etc\nA lot of throw away work because you never know what she wants \n"
        },
        {
            "course_name": "Introduction To Architectural Design and Visual Culture",
            "review_date": "September 08, 2011",
            "review_content": "\nI am not sure why the reviews below are quite so positive. Yes, I agree that Madeline is a nice person, but she is a terrible teacher! She changes her mind constantly, which is very inconvenient when you've spent time (and usually money) changing something to make it the way she wants, only to have her tell you that you shouldn't have changed it the very next class. I spent most of my time in the class being confused on the content and point of the assignments, as she rarely took the time to fully explain these things. The one good thing I have to say is she does reward effort...if you put in way more effort than should be required in an intro level class intended for non-majors. \nWorkload:\nIf you want to do well, a lot!\n"
        },
        {
            "course_name": "Introduction To Architectural Design and Visual Culture",
            "review_date": "May 05, 2011",
            "review_content": "\nMadeleine is a gem at this university. A gift to this world. I have never encountered a creative genius who is so motivating and demanding and inspiring all at the same time. She is overflowing with ideas, and sometimes she spits them out so fast, you can't figure out how she jumped from one to the other. She is kind and encouraging, and demands continuous reevaluation. The course demanded time and thought, but that is exactly what is necessary in the field. I am now pursuing architecture because of this woman, though I don't think I will ever encounter someone like her again.\nWorkload:\nsufficient, but if you love it, you'll love every minute of the work.\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "November 04, 2009",
            "review_content": "\nShe seems uncertain about her comments which leads to a huge communication gap with the students. Sometimes she makes rude comments, whether or not she realises it. Her projects are interesting but she tends to impose her views on students. \nWorkload:\nVery heavy\n"
        },
        {
            "course_name": "Introduction To Architectural Design and Visual Culture",
            "review_date": "September 04, 2009",
            "review_content": "\nMadeline is great! Her class can be frustrating, but it is worth it.  She is a teacher, a friend, and a muse.\nWorkload:\nWorkload is tough, but worth it in the end.\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "August 21, 2009",
            "review_content": "\nMadeline is one of a kind.  She is extremely intimidating at first and you will never really know what she is asking you to do, but at the end you finally realize how much you have grown as a designer in her class.  If you aren't willing for late nights and frustrating classes don't take her, but if you are willing to put in the time, so is she, and you will take a lot away from it!  Plus there is usually snack time, and sometimes she brings in her cute twin girls!\nWorkload:\nLots!  She expects a lot of new material every class period, and sometimes it can be a little overwhelming, but she can also be flexible with due dates.\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "August 21, 2009",
            "review_content": "\nMadeline is one of a kind.  She is extremely intimidating at first and you will never really know what she is asking you to do, but at the end you finally realize how much you have grown as a designer in her class.  If you aren't willing for late nights and frustrating classes don't take her, but if you are willing to put in the time, so is she, and you will take a lot away from it!  Plus there is usually snack time, and sometimes she brings in her cute twin girls!\nWorkload:\nLots!  She expects a lot of new material every class period, and sometimes it can be a little overwhelming, but she can also be flexible with due dates.\n"
        },
        {
            "course_name": "Architectural Representation: Perception",
            "review_date": "December 07, 2004",
            "review_content": "\nMadeline is definitely a character but she does know what she's talking about though sometimes there's a bit of a communication gap between her trying to convey what she wants to see and what we think she wants.  The bottom line...do the work no matter how bad (or how good) you think you are.  If you do the work, you'll do fine in the class.  Don't take Madeline too seriously either.  She's not malicious and though sometimes she may seem abrupt, she really is just trying to get students to get over themselves and what limitations they think they have.  She's supportive and helpful in critiques if you can manage to put forth the effort.  There is an insane amount of work for this class but it's only as crazy as you let it get.  Keep up on the work and complete what you can.  Madeline is very accommodating if you just communicate with her.\nWorkload:\nworkload is very heavy.  MUCH more than you would normally put into a 4 point class.\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "November 16, 2003",
            "review_content": "\nMadeline is awesome. Her critiques are helpful, if a bit difficult to process. You may not do as many projects--she only does 2--as you do in other studios but there's a lot of work for those two projects. Where you might do a single drawing and model in one studio for each project, Madeline will take you through several sets of drawings and one or two models for each project.  She expects a lot of non-final work leading up to each final product.  You will work a lot, but  at the end of the term students in the less demandings studios will be jealous of your work and your experience.\nWorkload:\n2 projects (lots of final drawings, some computer work, and one or two models each).  All final products will require extensive non-final work to be presented during desk crits. You will feel extremely rewarded by your efforts. \n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "March 30, 2003",
            "review_content": "\nMadeline is great.  She pushes students to think differently than they have ever thought.  However, she expects a LOT from you.  She is really nice if everyone has done their work.  If she says to get something done for the next calss, you better have it done or she will not be happy.  (Avoid making her unhappy at all costs.)  If you do your work and put in the effort the calss will be great.  If you want to be challanged, Madeline is the teacher for you.  If you dont want to work, get out of the class.\nWorkload:\nNeverending.  There is always something that HAS to be done.\n"
        }
    ]
}