{
    "prof_info": [
        {
            "prof_name": "Evan Parks",
            "prof_id": 13197,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary German",
            "review_date": "April 20, 2016",
            "review_content": "\nEvan is EXCELLENT. This course was by far my favorite last semester and that was largely because he was my instructor. He encouraged us to speak in every class and was always very forgiving and helpful when mistakes were made. His feedback on written assignments was very thorough, and work was almost always returned the following lecture. He clearly put a great deal of time and effort into correcting our work and made sure we knew WHY we were incorrect when we were. He also made sure to explain topics very thoroughly in his lectures, and gave us plenty of opportunities to ask questions. \nThe class was taught entirely in German, which was very helpful to immersion (albeit a bit intimidating) but also led to some comical moments when he had to explain things without using English. Evan was always friendly and unintimidating,and stayed after class to discuss any additional questions we might have had. He also responded to questions via email very promptly. I have no complaints regarding his teaching--he truly is excellent.\nI still see him around campus sometimes and we chat, he really does care about his students. After the final he took the class to a German museum and treated us to coffee! \nAll said, I feel more confident speaking German after one semester of this course than I did after 3 years of high school Spanish.\nWorkload:\nI spent 7-9 hours a week on this class, including attendance. Homework was given after every lecture that would take about 45 minutes, and about four 150 word “essays” were assigned once we got into the swing of things. There is a chapter test every other week, but you won’t need to study much because of the class immersion. The final was very reasonable and included an oral section.\n\n"
        }
    ]
}