{
    "prof_info": [
        {
            "prof_name": "Vincent Quenneville-Belair",
            "prof_id": 13203,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Partial Differential Equations I",
            "review_date": "April 25, 2016",
            "review_content": "\nProfessor Quenneville-Belair is a nice guy and very intelligent, but be wary, he doesn't pull any punches with this class. The course moves quickly and builds on itself throughout, so you have to stay on top of the material. Everything is taught directly from the textbook though, which certainly helps, and the TAs were great.\nMy biggest reservation with Professor Quenneville-Belair is his unwillingness to release solutions. He explained that at our level of mathematical sophistication we shouldn't need solutions released for the homeworks because we should be able to identify when we've done something wrong and correct it... Like what? How are we supposed to learn if nobody tells us what we're doing wrong? Granted, this was his first semester teaching this course here, so I'm sure he got plenty of feedback on this point and will hopefully take a different approach in future semesters.\nOverall I worked very hard in this course and learned a lot. Not for the faint of heart, but if you're up for it you'll come out the other side knowing a lot about PDEs.\nWorkload:\n10 problem sets (20% of grade), 1 midterm (30%), and a final (50%).\nThe problem sets were all very time consuming (at least for me) and took up to 15 hours to complete. They were a mixture of applying methods to solve PDEs and writing proofs. The problems can get very long and contain a lot of terms, so you need to be careful about keeping track of everything or you'll get to the end with a solution that doesn't make sense and pages to pour over looking for that pesky π you lost along the way.\nThe midterm was challenging, but doable if you go in prepared. A lot of people did poorly on the midterm and the professor recommended they drop the class, because the material only gets more challenging and the final is much more difficult than the midterm. I'd recommend over-preparing for the midterm to score points as a buffer for the final later on. The final was close to impossible to finish if you answered each question fully and simplified the answer completely. However, you could score most of the points on each question by answering the hefty portion and leaving a messy unsimplified answer.\nThe average on both exams was low (62.5 for midterm, 57 for final), but he scaled the average to a B.\n"
        }
    ]
}