{
    "prof_info": [
        {
            "prof_name": "Steven Marcus",
            "prof_id": 910,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Literature and Society",
            "review_date": "March 03, 2003",
            "review_content": "\nThis man will teach you how to write if you are ready.  I wish I had been.  \nWorkload:\nresponse papers\n"
        },
        {
            "course_name": "British Literature of the 1890s",
            "review_date": "January 13, 2003",
            "review_content": "\nDry, overly pedantic, personally insulting.    He should no longer be permitted to teach at our school.  \nThe only interest he shows in his students is in randomly critizing their papers.  Stay away from this man.\nWorkload:\neach week a novel, a paper, disinterested cruelty.\n"
        },
        {
            "course_name": "British Literature of the 1890s",
            "review_date": "December 20, 2002",
            "review_content": "\nThis was a seminar with 12 students enrolled.  Professor Marcus ran it as a lecture course, bringing his dog-eared, type-written (as in, rusty Underwood typewriter) notes to class, giving the same lecture he has probably given for decades.  There is nothing wrong with having the same points to make for a course you've taught for ages.... there IS something wrong, however, with deliberately disallowing student participation and showing an averseness towards student-initiated dialogue.  I always felt like my questions were brushed off so he could return to his carefully-charted course.  More than a few times, students asked quesitions and he would respond with something akin to, \"If you would wait, I am coming to that.\"  HIs lectures were usually interesting, however, and yes, it's true, there is something to be said for taking advantage of Columbia's tip-top.  If only more of them would truly enjoy their students and teaching.\nThe weekly reading responses are another issue entirely.  It is true that Marcus makes you meticulously aware of the three hundred words you write every week, but these assignments became my weekly nightmare instead of being the thoughtful exercise they should have been.  He made me much more attuned to grammatical errors than I normally would have been; and for that I am grateful.  He also taught me to take *time* with my writring, and showed me how much it could improve with thorough revision and a keener eye.  I, for one, do not believe he taught this in the most effective way possible.  His comments on style, word choice, etc., seemed entirely arbitrary.  It only made me question every word I wrote and do a lot of needless deleting and rephrasing.  I never had an idea of what I was working *towards.*  When I would ask him during office hours what it was that I could improve on, he only read through every line-by-line comment he wrote on my last paper.  The end result?  Incredibly stilted and unnatural writing for these assignments only.  I wouldn't say he's impacted my writing in general one jot.  Perhaps he taught me to pause and read through drafts, but this is something I didn't need to take a class to learn.\nThe syllabus is excellent and nearly worth the trauma of the weekly assignments.  Examples: James, Wilde, Wells, Conan Doyle, Stevenson, Wharton, Conrad.  And I will say, Professor Marcus's presentation of main concerns and events of the fin-de-siecle contributed to my understanding of the works.\nWorkload:\nUsually one novel a week.  This can range from a 500 page novel to 200 pages.  It's hard to keep up, and you have to if you want to adequately respond to the writing assignments.  My grade was a surprising shock.  He never gives grades on the assignments, so I was truly up in the air about what my grade was to be.  From his comments I thought I was going to get a C, but let's just say I was pleasantly shocked.\n"
        },
        {
            "course_name": "English Literature 1789-1832",
            "review_date": "January 16, 2002",
            "review_content": "\nMarcus is a Columbia institution. He's been teaching at Columbia since the 50s. He's a noted Freudian and has a background in Marxist theory. He runs excellent discussions, and his total disregard for any theory or criticism after, say, 1960 is somewhat refreshing. Marcus can be awfully intimidating, being old, fierce, and sometimes nearly uninteligible. But you get used to it, and, to be honest, his class remains my favorite in the English department. I learned a great deal about writing clearly and beautifully, and about reading poetry effectively and intelligently. My highest reccomendation.\nWorkload:\nOne essay a week - but don't fear, the essays are to be no longer than a page and a half, and he insists that you spend no longer than a couple hours on each. Also: you are required to keep a journal with comments on all the reading, which he checks at midterms and again at the end of the semester. No tests, no quizzes, no long papers, but you learn a great deal about writing well and concisely. Reading was heavy, though not too. Every week a novel or 50 or so pages of poetry.\n"
        }
    ]
}