{
    "prof_info": [
        {
            "prof_name": "Rachel Adams",
            "prof_id": 904,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Food Writing ",
            "review_date": "December 20, 2014",
            "review_content": "\nIf you're reading this, you're probably already convinced of taking whatever Prof. Adams is offering because she offers really good courses and hey, it's an English class. You're probably just double-checking CULPA to make sure it won't be a total disaster. Read further; it will be. I'm speaking on Food Writing, but I think my warning will be universal. \nDon't let the optimism of the class' fun name tempt you-- this is far from the socioeconomically sensitive, culturally inclusive, tasteful course you might imagine Food Writing to be. The fact that it fulfills the 'American' requirement on the English major list indeed means it shuts out everything about food experience except those of white, rich suburban ladies who like to whisper disdainfully about the Food Network. It's what your cynic friends will think it is when you tell them what you're taking: McDonalds-shaming, fermented food-frotting elitism. The review from 2012 is still completely relevant. She gets her hands on classes that sound and have the potential to be great, and you'll be drawn into taking them. The syllabus and the readings might even sound good. It's friendly for bloggers, only held once a week, and great if you want to do a lot of writing and get a lot of feedback. But get ready for the most toxic seminar environment you can encounter at Columbia. \nLet me start with an example of how she's responded to students:\nStudent during writing workshop on another student's piece: \"You talked a lot about your family connections in the food industry in this piece, and I have to admit I felt a bit alienated by all the brands.\" (not verbatim, basically what was said; I was only half-listening as it was the end of class and I was left exhausted as usual)\nProfessor (verbatim): \"Well, it sounds like you're jealous.\"\nNo moderation whatsoever. No organization, no smiles, no rules. She sets up a Hunger Games competition among the students. You're free to make whatever kinda bullshit comment you want with little intervention; be as offensive as you please, and your fellow classmates will probably not have the chance to call you out. What fun! In the rare cases whereas the professor does interrupt, it's a put-down or quick switch of the subject (extremely unhealthy facilitation skills here). You've got pre-meds, English majors, Sociology majors, GS, BC, CC, your friend across the hall, whatever, a slew of perfectly nice students outside of FW suddenly forced to turn into monsterously bitchy, expert food and art connoisseurs who talk over one another to dominate space, time and available professor feedback. The environment and professor are horrible, so vulnerable attitudes among your classmates will become horrible too. Certainly the students who took Food Writing couldn't have been all bad, but the professor's condescension and bicker-mongering made for mean-spirited competitiveness to come out over every contentious topic. There is especially no use for this jousting when we're all writing a bunch of papers, not competing for preset test grades. How does one seriously argue about Food Writing topics, you ask? Well, this class was basically women in bad moods arguing whose experience was most relevant. Though you knew everyone was good at heart, there were a couple of severe problem people in the class who consistently made uncalled-for, aggressive comments and tangents. Nothing was done except for a few uncomfortable looks exchanged.\nOn top of the many papers and the blog that everyone crap-posts to (maybe a fourth of the class took it seriously and actually involved the readings in their responses) every week, as mentioned, you are required to throw a piece of your writing to the wolves at some point. There is fear like any other class that has workshops, but this time it's different. The activity is generally constructive in nature, but again, no moderation on the discussion. Feels like everyone is on the American Idol chopping block rather than a fun, relaxed celebration of one another's diversities and skills. People are basically encouraged to go Simon Cowell on your shit but will be 200% obvious that they have never read it to begin with. The \"real writers\"/go-getters who actually do read the pieces tend to get even more brutal; it's hard to blame this on the professor but she certainly could have been preventative. \nThen you got the field trips. I really enjoyed these, but they took the life out of me for the first half of the semester--sincerely get a calendar and make sure you can get all the volunteering/trip dates in on the original occasion, otherwise your experience will be hell. Finding make-up opportunities sucked. Also, some of them you will have to pay for (for no good reason, you don't receive anything and still have to pay for your own transportation). \nI'm sure she's a good and fine person, just a bit inaccessible both as a teacher and a supporter. And it makes the class bad, so bad. Adams seems busy or something, always. This is a class that apparently nobody (including her) has enough time for. \nTake this (or any of her courses) if you got thick skin, can ignore 70% of your classmates (or drag a friend with you), can write, can stick up for yourself, and literally have no other options to fill your sched. Worth it for the easy scheduling but the courseload doesn't match.\n\nWorkload:\nBetween 5-6 1,000-word papers, you might get one cut down if you complete an extensive final essay. 10 course blog contributions. One class presentation. Various little show-and-tells. A sizable handful of mandatory field trips. \n"
        },
        {
            "course_name": "Food Writing ",
            "review_date": "May 16, 2012",
            "review_content": "\nUnfortunately, this class was awful and the professor was abysmal. \nShe is the stereotypical \"scumbag teacher\"--she arrives to class late and then launches a public chastising if you need to leave on time to make it to your next class, she had the class critique a piece of student writing when the student was absent without the student's knowledge and without making it anonymous (she said it was anonymous but revealed information about the student to the extent that we all knew who it was, and then criticized both her writing and her personally), and generally seems to expect all of our lives to revolve around her class. \nShe was bad at generating class discussion and bad at lecturing. She tended towards this weird conspiratorial tone that only furthered the atmosphere of elitism, decadence, and snobbery associated with \"foodies.\" She was condescending, treating the students like children (making generalizations and assumptions about our many and varied limitations, not all of which were remotely true or applicable). I believe she was at some level genuinely oblivious as to how repulsive her manner was and how off-putting I and other class members found it. \nI'm sure that her personality jives with some people, but I am not one of them and I know others in the class felt the same way as me. Maybe she isn't a genuinely awful human being, but as a prof. she's kind of the worst. \nShe's a fair grader, erring slightly on the critical side of fair (write well for good grades). \nThe readings were wonderful--I couldn't put any of them down for an instant when I was reading. The readings broadened my understanding of food appreciation, production, preparation, and science immeasurably. The \"field trips\" were illuminating and worthwhile. The writing assignments were inspiring and helped drive me to create thoughtful pieces that were genuinely exciting for me to write. I loved everything about the class--except the time spent in class itself. Download the syllabus and stay away. \nWorkload:\nWeekly readings of a few articles per week, 5 short essays on various topics (3-5 pages each), 3 \"field trips\" (to the food production side of John Jay dining hall, on a \"food adventure\" of the class' choosing, volunteering at the food bank for one shift), participation in the end of class pot luck. No midterm, no final. \n"
        },
        {
            "course_name": "Post-1945 American Literature",
            "review_date": "December 19, 2007",
            "review_content": "\nDo not be fooled by the reading list, this class is unbearable. Yes, the required books, such as On the Road, Human Stain, and Ragtime, are phenomenal. However, Professor Adams has a knack for over-dissecting each passage, concentrating on the historical context of the book more than the content, and talking each book to death. No matter how boring the lectures are, and they are tedious, do not miss classes and take VERY thorough notes.  The midterm and final were take home and focused heavily on the notes. My advice: download the syllabus, read the books, and chose another class to fulfill Lit requirements or electives.\nWorkload:\nHEAVY! About a novel a week, plus related articles and interviews. 2 papers (4-6 pages, 7-10 pages) a midterm and a final, both take home, and a presentation in discussion section\n"
        },
        {
            "course_name": "Colloquium on Theory and Method",
            "review_date": "April 13, 2007",
            "review_content": "\nThis class was a major disappointment. In fact, after 3 semesters at Columbia this fell very far below the baseline of my minimal expectations of a course. On paper it seemed intriguing-a variety of readings and different guest speakers from various departments speaking on the readings (of which they were frequently the authors). This was coupled with trips to the NY Historical Society and Butler to learn how to do research. The problem was Prof. Adams. Her direction was unfocused and muddy and as a result it was very difficult to understand exactly what the assignments were about. She admitted as much, even referring to us (the students) as \"guinea pigs\" since we were the first class taking the course since its inception. Some of the guest speakers were interesting but for the most part I found them unexciting (to be fair, probably because they were out of the context of their usual metier).\nProf. Adams' comments on my papers lacked insight and did little to help me understand what I could have done better. \nAfter a semester of pure drudgery, the final assignment was to turn in all of the work we had done over the course of the semester in a \"final portfolio\" together with a written self-assessment. I was eager to get it back and read Prof. Adams' comments. I was dismayed to find that all she had done was jot some monosyllables in the margins,(\"yes!\", \"great\"). Beyond that she had made absolutely no comments whatsoever. I thought there must have been a mistake and emailed her. She then emailed me a glowing cookie-cutter assessment that while praising me was utterly empty and unhelpful. I was shocked at the lack of effort to give constructive feedback.\nI spoke with a couple of my fellow students and they had both had exactly the same experience and were also very disappointed in both Prof. Adams and the class. To be avoided.\nWorkload:\nA ton of reading, a lot of which is of the dreadfully dense and boring highly academic variety. Be prepared to skim. Every other week you must submit questions via email in response to the readings. There are a couple of short papers including a \"library assignment\" which required that you dig up a large number (30) of works to be cited but that didn't require you to incorporate all of them into the paper (which I found absurd and pointless). There was also a longer paper on a \"text\" which in Am-Stud can be interpreted quite broadly (i.e. an advertisement, a building, a movie). This was really the only enjoyable aspect of the course. At the end of the semester you need to assemble all of your work and write an assessment of your own work. \n\n"
        },
        {
            "course_name": "American Studies: Theories, Methods and Approaches",
            "review_date": "April 09, 2007",
            "review_content": "\nRachel Adams is probably the worst professor I have had at Columbia. She lacks even a shred of imagination, consistently stifles discussion if it veers even remotely from her class plan, and frequently responds to questions and comments with nothing but a short stare and a blink. One gets the distinct impression that Professor Adams knows that her students are smarter than she is, and is afraid of them taking control away from her. Perhaps in a lecture format she would be more affective, but I doubt it. And for the record, I'm not one of those disgruntled students who received a bad grade and is just venting. She grades fairly, even generously. But the assignments are poorly explained and poorly conceived.  \n"
        },
        {
            "course_name": "American Literature 1880-1940: American Modernism",
            "review_date": "March 27, 2007",
            "review_content": "\nThis class had an amazing reading list and I loved almost all the books we read. But other than that, I got almost nothing out of the class. It was taught like an American Studies course, so was full of extra information on the authors and the time period and almost no interesting literary analysis. There were days where she didn't even get around to discussing the actual text itself. Lectures were fairly obvious, especially for a 4000 level lit class.\nWorkload:\nA poem analysis and a final paper, not an easy grader. midterm and final were easy if you went to class. \n"
        },
        {
            "course_name": "North American Border Narratives",
            "review_date": "December 22, 2005",
            "review_content": "\nThis was an American Studies seminar, but as Prof. Adams is in the English Dept. it was more geared towards literature than a historical or political focus. The class was divided into two sections: one on the US/Mexico border and one on the US/Canada border, and I really liked the fact that we got to read books that one wouldn't normally think of, especially with regard to Canada. Prof. Adams has a really good handle on the texts and incorporated issues of race, sexuality, gender, class, and politics into the overall question of \"borders\" and what defines a border. She did an excellent job teaching the material and clearly was invested in what we read and in the class discussions. The class did a great job of responding to the issues in the texts that we read and I feel as though I learned a lot about the issues of borders in contemporary transnational America, in large part due to Prof. Adams' great skill as a teacher.\nWorkload:\nA book every week, which never seemed like a lot. One presentation with a 3 pg paper during the semester, attendance at an American Studies event (plus response paper), and a comparative 12-15 pg term paper. Nothing too challenging, and it never felt overwhelming. Grading was very fair, I thought.\n"
        },
        {
            "course_name": "American Literature 1880-1940: American Modernism",
            "review_date": "December 22, 2003",
            "review_content": "\nI wasn't sure about taking this class, given the mostly negative reviews from 2002, but Prof. Adams seems to have improved since she last taught it. It's worth taking for the reading list alone, given the authors (Stein, Pound, Eliot, Fitzgerald, Hurston, Faulkner, Agee/Evans) that are on the syllabus. Prof. Adams incorporated a lot of art and a few films (including Chaplin's Modern Times) into the course, which helped with the examination of modernism and was especially useful with Stein and Agee/Evans. Prof. Adams had a lot to say, most of which was useful, though she did have some problems teaching the poetry unit, which was one of the least interesting parts of the class. She incorporated some discussion into the lecture to some success, and there was a reading group open to graduates and interested undergrads. The one issue with this class was that you pretty much can't skip lectures - the midterm and final were very difficult to do well on unless you had attended most of the classes or knew someone who took phenomenal notes. Other than that, I found this class to be a good intro to twentieth century American lit and a well-detailed exploration of modernism. English majors who are dreading the American requirement should look into this class.\nWorkload:\n8 novels (one for every two classes), 3 weeks on poetry (six classes devoted to six poets) some related articles with each author.  A Chaplin film was screened on a Monday night early in the semester. Two papers - one close reading (4-5 pp) and a longer comparative paper (2-3 works, 7-10 pp.) Grading on the papers seemed to be fair, though it depends whether a TA or the prof is grading it. Midterm/final - really tough unless you went to most of the classes, but graded pretty fairly if you knew what you were talking about.\n"
        },
        {
            "course_name": "Contemporary American Fiction Seminar",
            "review_date": "November 17, 2003",
            "review_content": "\nRachel Adams means well. While she may be an intelligent and thoughtful intellectual, she is not a brilliant teacher. Her class tends to attract smart and motivated, if a little too vocal, group, but Ms. Adams holds tightly onto the flow of the conversation. Every point in discussions must be made in thesis form (this is after you raise your hand and wait your turn) and directed to her to be accepted into the discussion, and then, 95% of the time you can expect her to blink at you and move on. She is one of the most negative teachers I have had at Columbia (A quote is \"I don't think that is is that uncomplicated.\" How many negatives do you need in a sentence?). I have faith in her intelligence (she wrote a cool book on freaks), but the seminar table does not bring out her strengths. Basically the reading list is what makes the class worthwhile.\nWorkload:\n1 book + article of criticism a week, 1 presentation to the class, 1 short paper/close reading (5 pp) and 1 longer comparative paper (10 pp).\n"
        },
        {
            "course_name": "American Literature 1880-1940: American Modernism",
            "review_date": "May 28, 2002",
            "review_content": "\nIf you enjoy modern lit. or even lit. in general, do not take this course. Prof. Adams managed to suck the life out of virtually every book we read. Her lectures sounded as if she was reading a paper aloud (and a dry, simplistic one at that). She wasted a lot of time repeating herself, making obvious points, beating the gender issue to death, and reading quotes aloud. Basically her lectures had the content of a high-school English paper but were delivered in overly intellectual terms (She is one of those people who makes up complicated words to describe simple things. My favorite of her creations was \"massification.\") I would never have gone to class if not for the quizzes (which were ridiculous). Read the books on your own and don't give Adams the opportunity to ruin them for you. \nWorkload:\nOne 4-5 pg. paper on a poem, one 7-10 pg. paper on 2-3 of the books, and frequent pop quizzes.\n"
        },
        {
            "course_name": "American Literature 1880-1940: American Modernism",
            "review_date": "May 20, 2002",
            "review_content": "\nDespite the other student's comments, American Modernism turned out to be my favorite class all term. Of course, the stellar syllabus aided in this matter (Fitzgerald, Stein, Hemingway, Faulkner, Cather, Hurston, Eliot, Stevens, Williams, Pound etc.), but I really felt that Prof. Adams held her own. Once you get past her incredibly whiny voice (which, I admit, is hard to do at first) her lectures were both insightful and enjoyable. It really is a pity that her voice is such a detriment to the delivery of her content. It makes her sound slow and stupid, and she is none of these. Granted, several of her lectures had the gender/sexuality spin that so many of the female English professors do (I hate it, and I am a girl.) Some of *these* connections may have seemed like a reach. However, her interdisciplinary approach truly broadened my understanding of the time period. Reading contemporary theorists on race, industrialization, immigration, etc. gave me a feel for the theoretical atmosphere from which the authors emerged. Additionally learning (albeit rather superficially) about the art of the era as well as films lended a deeper dimension to my understanding of the texts. I missed only one class the entire term; I found her lectures that interesting and engaging. Again, it truly is a matter of getting over the nature of her voice and beyond that she is an amazing professor. Always eminently well-prepared and eager to help students out. \nWorkload:\nPop quizzes which are only to maintain attendance. One 4-6 page poetry analysis and one 7-10 page paper on a novel read in the class.\n"
        },
        {
            "course_name": "American Literature 1880-1940: American Modernism",
            "review_date": "May 14, 2002",
            "review_content": "\nExcellent syllabus, horrible professor. Prof. Adams' teaching style is extremely plodding and tedious. Most students did not show up regularly for class, although the pop quizzes did increase attendance. The quizzes were generally pretty easy, if you did the reading and listened to the lectures--a task that got harder as the semester wore on. Although she does have some good insight, Prof. Adams' commentary was often rather obvious. Also, trying to cover so many excellent works in a single semester leads to gross glossing over of many of the more interesting points in the books/poems. For example, she often assigned 10 poems for one class period--it is impossible to discuss that many pieces in a single class, and it is impossible (given normal time constraints of college) to digest that many poems with any depth during a single nights homework. There are only two major assignments for this class. This sounds excellent, but of course means that each assignment is worth a large chunk of your grade--a double-edged sword. There is little in-class explanation/direction for the papers (i.e. she tells us to do an in-depth poetry analysis, but expects us to be familiar with scanning and other techniques of analysis, or to read-up on them on our own). Also, it is difficult to get office hours as there are 120 people in the class and only one prof and three TAs. Overall, the course gives you a rewarding reading list, but perhaps one that is better read on your own.\nWorkload:\nPop quizzes, not very difficult. One 5-7 page poetry analysis. One 7-10 page final paper comparing 2 or 3 three works read in class. No midterm or final.\n"
        },
        {
            "course_name": "American Literature 1880-1940: American Modernism",
            "review_date": "May 13, 2002",
            "review_content": "\nNot the greatest of classes, although Prof. Adams always has organized lectures based from her extensive notes. It's a solid class for the material, although many in the class agreed that some of the connections she made between the texts were a bit far fetched. Not the most exciting of teachers as well, in some cases taking a great book and reducing it to boredom. Overall, not a bad course, great syllabus, but I wouldn't take it again if I could go back. Cool mixture of media though.\nWorkload:\n1 poetry analysis, 1 long paper, unannouced quizzes to check attendance\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 14, 2002",
            "review_content": "\nShe has pretty good dicussion lectures: lets the students basically manage them, but still makes sure things hit the main points and that we stayed relatively on topic. Made herself available outside of class, and was always pleased to help and advise. She seemd to feel that an A paper had to be fit to be included in next year's curriculum, so a very good essay was a b+ and a bad one a b-. She rounds up nicely for the final grade though. If you are grade obsesssed take Lit Hum with someone else, but, if you just want an interesting class with a medium workload, she's a good choice.\nWorkload:\nSix essays, two pages each. Midterm. Final.\n"
        }
    ]
}