{
    "prof_info": [
        {
            "prof_name": "Paul Sheehan",
            "prof_id": 2294,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 17, 2005",
            "review_content": "\nPaul is a great music hum teacher. I switched into the class from another section, so I had a basis of comparison and comparatively Paul is GREAT. While in the other section we were discussing Â“what is music?Â” and useless stuff like that Paul was getting right into it. There is a lot of listening in class which is great. Paul has a great passion for the subject and knows his stuff very well. On top of that the man is simply entertaining to listen to, popping jokes every now and then and just being very lighthearted. He seemed like a genuinely nice person who really cared that his students get something out of a class like music hum. I personally had a very surprisingly good time in music hum and am now known to spontaneously listen to some Mozart or Beethoven when I donÂ’t have to!\nWorkload:\nPretty  light: listening excersises which take all of 5 minutes every now and then. 2 listening quizes, a midterm and a final all of which rare quite simple. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 21, 2004",
            "review_content": "\nMr. Sheehan was a good teacher. He was obviously very into the material and the class was fairly interesting. I ended up learning a lot about a subject I was not really interested in. Most people are probably more interested in how the class was seeing as most of us are forced to take it anyway. It was easy. The listening quizes required some preperation, but the rest of the class really didn't. The essay questions on the midterm and final were easy, and the listening assignments were a joke. We only wrote one paper which was nicely graded\nWorkload:\nOne paper, listening exercises every once in whiile, 3 listening quizes, midterm and final. \n"
        }
    ]
}