{
    "prof_info": [
        {
            "prof_name": "Richard Wortman",
            "prof_id": 890,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Personality and Society in 19th Century Russia",
            "review_date": "January 15, 2008",
            "review_content": "\nThis man is fiercely intelligent and very attentive about helping his students understand the material. Yes, he did read his lectures, but they were always insightful and articulate, and he led discussions very well, encouraging participation but also deflecting stupid comments. If he just spoke up a little more, his classes would be a little more gripping, but, as it stands, he did a great job teaching this course. I hope the retirement rumors aren't true. \nWorkload:\nTwo 5-10 min. reports on a pre-assigned topic over the course of the semester, two papers (8-10 pp. and 12-15 pp., respectively), and participation in class. \n"
        },
        {
            "course_name": "Imperial Russia 1682-1918",
            "review_date": "January 14, 2007",
            "review_content": "\nI was surprised at how much I enjoyed this course. Yes, Wortman's lecutures are dry and the facts come fast and furiously. This did not bother me at all because I found the material interesting. Wortman reads his lectures off the page, which is unfortunate, because when he steps away from his notes to answer a question, or to elaborate a point - he suddenly becomes an engaging speaker - the transformation is uncanny. This was my favorite course of the semester. I took it to fulfill a requirement and was surprised at how interesting the material was to me. The readings were interesting, and complemented the lecutures really well. This may not be for everyone - Wortman's old school style may be a bit dry for some. But he is extremely approachable, he does have a sense of humor and a genuine interest in teaching. \nWorkload:\nReading average, mid-term, final, 10 minute presentation of primary document, paper on choice of assigned material (essentially a book report) given on day of first lecture - so loads of time to do it.\n"
        },
        {
            "course_name": "Imperial Russia 1682-1918",
            "review_date": "January 09, 2007",
            "review_content": "\nProf. Wortman was born to be a history professor--I can't imagine him in any other job. He's a pretty good professor; he's been teaching since the 60's, and sometimes it shows in a bad way. Sometimes his lectures seem to be read right out of a book that he's written or writing; that said, his lectures are very well organized and full of interesting notes and ideas. His specialty is institutional reform and the concepts and representations of power, so obviously that makes up most of the course. Even though he makes good notes about these topics, sometimes I felt like we were skipping the really interesting parts of history like foreign policy, wars, etc. The workload isn't bad. I'm a real Russophile, so I enjoyed the course, and I'd recommend it.\nWorkload:\nThere's a midterm and a final (both of which aren't too bad), a 5-10 minute oral presentation on one of the readings, and a 6-8 page paper on a historical memoir.\n"
        },
        {
            "course_name": "Imperial Russia 1682-1918",
            "review_date": "December 26, 2006",
            "review_content": "\nThis course may not be the most exciting in the world, but it is like having a long bedtime story about Tsars and wars read out to you.  I loved his old school formal lecture style and he is just about the fairest professor ever.  He is incredibly approachable and cares about his students.  \nWorkload:\nmidterm, easy 10 minute presentation, final, and one paper\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 05, 2005",
            "review_content": "\nI thought it was going to be impossible for anyone to top the first semester of CC, but Professor Wortman did it with ease.  Finally, in the spring of my sophomore year, I had a \"real\" Core class---a class that actually worked in the way that Columbia tries to convince us that all Core classes should work.  \nProfessor Wortman's knowledge of the great majority of philosophical history is staggering, and you'll frequently get swept away just listening to him tie together books and ideas from first semester CC, LitHum, European History, Biology, popular literature, and cultural trends with what you're reading in class.  The two hour sessions flew by and felt as though they were about ten minutes long.  \nWhile the reading seemed to come in droves at times (sometimes a book accompanied by several articles for one session), it never really bothered me because I knew I would get something out of it.  Wortman makes a good effort to rework the CC curriculum so that it actually makes sense, which is more than what can be said for most teachers.  His cuts and additions were all completely logical (why not read Booker T. Washington before reading WEB DuBois' criticism of him?) and I felt as though the syllabus flowed more smoothly than I've ever experienced.  \nWortman also allows for ample discussion time.  The procedure is basically identical each session: about 15 minutes of background on the author and his/her contributions, guided questions led by Wortman for a few minutes (in order to nail down certain ideas), followed by general discussion moderated by Wortman.  It's a system that makes everyone feel comfortable and leads to a lot of low-stress participation.  Quite honestly, this class was fun.\nMy only complaint about Professor Wortman is the topics he chooses for his papers and his essays.  The paper topics (you get a choice of two for each paper) are often historical in nature (he IS a history professor) and don't leave a lot of room for personal interpretation.  You can work some unique ideas into your analysis, but I feel that Wortman is more concerned about your effort to demonstrate your knowledge of the readings than to go off exploring on your own.  You're going to be in trouble if you write a paper with no text analysis (this was markedly different from my LitHum and CC1 experiences, which focused on open-ended craziness).  The essay topics on the tests are completely overwhelming (though perhaps not particularly DIFFICULT).  The essay on the final called for a discussion of 3 or 4 authors regarding BOTH power relations and human nature, their criticisms of society, and the systems they created to deal with these relationships---and that was just the first of three parts.  \nOverall, however, you should try to get into this class.  Professor Wortman was probably the best teacher I've had at Columbia (and definitely the most approachable).  If it was up to me, I'd have him teach every class I take at this school.\nWorkload:\nLots of reading, most of it is great.  1-2 page email responses (to a specific question) on every author.  2 papers (5-7 pages), midterm and final.  It's a decent amount of work, but more than worth it considering how much you'll get out of this class.  \n"
        },
        {
            "course_name": "Imperial Russia 1682-1918",
            "review_date": "May 19, 2005",
            "review_content": "\nAn academic superstar that loves to teach. He gives special attention for students who want to excel in his class. Although his lecturing class is rather formalistic and frightening, Wortman's \"public seriousness\" is only matched by his \"serious friendliness.\" There's a ton of reading to do, but don't despair, he makes sure to cover all the points needed in his lectures. \nWorkload:\nA couple of short homework assignments, 1 mid term, 1 final, 1 6-8 page paper. A TON of reading.  I worked hard and recieved a good grade, but from what I heard from other classmates, he's pretty strict with grades. The TA, Ryan Jones, is very helpful. \n"
        },
        {
            "course_name": "Imperial Russia 1682-1918",
            "review_date": "April 12, 2005",
            "review_content": "\nOk, this is definitely the most boring AND informative class I've ever taken here. You can either do the reading or take copious notes - he seriously covers about everything in lecture. And he reads right off the paper. there's no doubt he's a genius, but he's also incredibly dull. but i feel bad for him... he's a genuinely sweet old man and an easy grader.\nWorkload:\ndon't worry about doing ALL the reading... but do some of it to really get the facts down. midterm, 5-7 pg paper, final... and some dinky class report thing that's really easy... but he's really really nice.... so don't hate him!\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 24, 2005",
            "review_content": "\nProfessor Wortman was great -- a fair grader, knowledgable far beyond what is necessary for such an expalnsive and varied syallbus, and generally good natured. He kept discussion flowing freely in class, encouraging people to speak, yet making sure that their comments fit in with the important messages we needed to take from the readings. He also was reasonable in the amount of readin he assigned, and was very aware of constraints from scheduling and other classes that his students might have. A gem who will make you enjoy  and appreciate the long class on political philosophy.\nWorkload:\n2 papers, a midterm, and a final. Each worth 25%, with participation and a paragraph response to the texts each class as another 25%. You'll be annyoed with the responses at first, but they are so easy and useful it ends up being worth it.\n"
        },
        {
            "course_name": "Personality and Society in 19th Century Russia",
            "review_date": "January 04, 2005",
            "review_content": "\nGreat class, great instructor.  Professor Wortman is  engaging, insightful, and very knowledgeable.  However, you'll only do well if you put in the effort. \nWorkload:\nAbout one book/week (plus short articles) and 2 papers.  (one 8-10 pages, one 12-15 pages).\n"
        },
        {
            "course_name": "Imperial Russia 1682-1918",
            "review_date": "January 15, 2004",
            "review_content": "\nThis class is bad on all levels.  If you are a novice to Russian history, Professor Wortman's boring style and the characterless textbook will repel you from the subject and make it difficult for you to learn anything.  If you are interested in Russian history, you probably already know everything this class covers.  Professor Wortman is simply the worst lecturer at Columbia.  He reads his lecture notes verbatim, which often causes him enunciate the wrong words in the sentence.  His lectures are the most painful to sit through of any professor at Columbia.  \nWorkload:\nThere is a lot of reading, and you have to do a lot of it to do well on the midterm and final.  This class is very different from other history classes at Columbia in that Wortman expects you to have events, dates, and names memorized, not just broad concepts and themes as in most history classes.  If you're thinking that taking a class that begins in 1682 is an easy way to get past the List A requirement for the history major, think again!\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 08, 2003",
            "review_content": "\nThis was a great CC section. The class discussion--not lecture--was interesting and never boring. Wortman was funny and knowledgeable. The 110 mins went by quickly every class session.\nWorkload:\n2 8-pg papers, with a choice of topic. papers are graded quickly and fairly. a non-graded one-paragraph response to a question once a week, which is actually good because he gives plenty of personalized feedback on each student's response and b/c it forces you to do and understand the reading. 2 exams--midterm and final, each with straightforward IDs and a take-home essay. all graded fairly.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 18, 2002",
            "review_content": "\nI really likes Prof. Wortman's CC class. He only taught 2nd semester. The class went by fast and was mostly discussion, with the Prof. providing some basic background info in a short lecture. I left each class session without having been bored at all and with a complete udnerstanding of the aspects of each reading that we needed to know.\nWorkload:\n2 Exams (with essay portion as take-home), graded very fairly and with fair IDs. 2 8-page papers, on pretty interesting topics (we get a choice). He graded papers fairly and with lots of comments. Also, weekly ungraded responses (about a paragrph long) that are collected and thoroughly commented on. Overall, really pleasant class, great professor.\n"
        },
        {
            "course_name": "Imperial Russia 1682-1918",
            "review_date": "January 10, 2002",
            "review_content": "\nAlthough many students attack this professor for his remarkably formal lecture style, I found Professor Wortman's lectures to be incredibly informative and intriguing. There is no doubt that he is one of the premier scholars on Russian history and his knowledge presents itself throughout the course. While the lectures do not typically involve much discussion, both Professor Wortman and the TA are very welcoming to those students who wish to meet with him during office hours or after class. This class offers a rare combination of stimulating material and insightful teaching.\nWorkload:\nMidterm, Presentation, Term Paper, and Final. Work typically has a focus on Russian intellectual history. You have to work hard for each of these assignments, but you don't need to do much else. The grading is quite lenient.\n"
        }
    ]
}