{
    "prof_info": [
        {
            "prof_name": "Gillian Young",
            "prof_id": 13622,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 16, 2020",
            "review_content": "\nWonderful prof: lectures keep you engaged, low workload homework, relatively easy tests, cares about what you think. Her grading system is fair for essays, and often very generous for tests and exams. Slides often don't include descriptions, so showing up and taking notes is important. She'll mention the test topics in the classes leading up to the exam (both midterm and final). \nShe is very knowledgeable, even if you have a background in art, she shows many different perspectives of the work. Still, she isn't strict, and her teaching method works well. You'll definitely leave the class feeling decent about western art. Don't switch sections!\nWorkload:\nvisual annotation (print out an image and annotate what you see) - one per week; midterm (show up to class and you'll be prepared); final (same format as midterm); one essay on museum object\n\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 17, 2019",
            "review_content": "\nShe's so nice!! Makes it easy for you to talk during class, really helpful during office hours. Also, the midterm is very easy (you discuss the paintings during class before), the final is a comparison essay, the museum visits are decent and you get a free membership to The Frick! Take the class!\nWorkload:\nmidterm, take home final, museum visits, 4 page essay,\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 03, 2018",
            "review_content": "\nNice class! There are some museum visits (one to The Frick Collection-you get 1 year complimentary access!!!), the papers are ok and she gives you an extra credit opportunity if your participation grade can be improved. She seems really nice and ready to help. Plus, you don't have to do the readings. Take this class!\nWorkload:\nmore than fair! weekly annotations, 2 papers, one midterm and a take-home final!!\n"
        }
    ]
}