{
    "prof_info": [
        {
            "prof_name": "Nadia Urbinati",
            "prof_id": 307,
            "total_reviews": 26
        }
    ],
    "reviews": [
        {
            "course_name": "Modern Political Thought",
            "review_date": "April 11, 2014",
            "review_content": "\nI don't understand why Columbia keeps her. She is horrible, she does not teach, does not care about her students, has a freaking attitude when you ask her a question and is awfully rude. NO one cares if she is very smart or not, the problem is that she is in a place where students seek knowledge and she can't give one. Her smartness   does not help if she is not productive and on top of that so obvious in not caring about her students. It feels as being cheated, since you pay for the class and you get nothing, absolutely nothing besides being frustrated and nerve racked about the whole thing. \nOne advise if you get her class make sure at least you have a distant TA, she had Camila Vergales or smth don't remember her last name - she was even worse than Urbinati, Oh my God, every time you would answer her question it felt as if she is competing with you, she was never satisfied, and yea her accent does not make it easy, she speaks a foreign English, you don't get what she says either because of it or because she can't explain. She makes things more complicated than they are. \nIt is a joke this class was 100 level and it taught political theories, how hard can that be but no wait you have \"smart\" Urbinati and her puppet TA Camila making this class a freaking disaster.\nThis class is not worth a penny, don't forget that the money you pay goes into their paycheck, so save your time and money and take the classes where professors' actually do care about you. \nThose people should not be in academia the least in Columbia, it is a shame for an Ivy League school to keep someone as Camila whatever her last name is, and Urbinati.\nWorkload:\nA total joke, not worth a thing. \n"
        },
        {
            "course_name": "General review_content",
            "review_date": "January 07, 2014",
            "review_content": "\nUrbinati embodies the problem with a lot of professors at institutions like Columbia. Yes, she is extremely knowledgeable and well-respected in her field. However, she is a horrible professor and lecturer. Her lectures are disorganized and confusing, she often goes on long, seemingly disassociated tangents and never really does a good job of fully answering student's questions. She has clearly spent a lot of time studying political theory, but she literally can't communicate her ideas clearly. If you have to take one of her classes for a requirement, prepare yourself for a bumpy semester. \nWorkload:\nI had her for Political Theory, a class she taught with Professor Johnston. The workload wasn't too bad - tons of readings, three short papers, one longer final paper and a final (which was super hard). \n"
        },
        {
            "course_name": "Modern Political Thought",
            "review_date": "May 19, 2011",
            "review_content": "\nSTOP reading if you have to fulfill the major requirement.  Take the class because there's no guarantee it will be offered the following semester. \nInitially, you're thrilled to find out that the class only requires three nine hundred word essays.  Piece of cake!  As you sit through the first lecture, you begin to wonder if there's an English proficiency requirement at Columbia and obviously there isn't.  You tell yourself that you can overcome the language barrier, but after each class, you review your notes and they are garbage.  The weeks go by and you pop your head in to simply submit your essay, but you don't want to submit and run so hope that wifi is strong.  Couple of weeks go by and your first \"essay\" is returned.  Pick up your jaw, it's on the floor and your'e making a scene.  You ask around because April Fool's is months away, but you realize it's no joke.  An A- over there, a C- over there, couple of D's over there and throw in a D- for shits and giggles.  Yes, there was a D-, almost two but the minus was erased.  Who gives out a D-?!  I am pretty sure the D's outnumbered the A's for the first paper.  \nDon't go and run to your advisor and Pass/Fail the course because you have two more shots at this debacle of a course.  The essays aren't really essays, you just have to answer the prompts in an effective and concise manner.  There is no thesis, support and conclusion.  Just answer the friggen prompts!!!\nSecond paper rolls around and the D's turn into A's and most are vomiting from the grade rollercoaster.  \nLast paper rolls around and it's the toughest, but again it's only nine hundred words.    \nSummary:  Class is a joke, but you need it to fulfill major requirements.  I attended maybe four or five lectures including the first day.  I think I thoroughly read maybe fifty pages of the Prince and skimmed everything else.  Urbinati's english is terrible, but who cares?!  You can write nine hundred words in a hour.  \n\nWorkload:\nThree nine hundred word essays, typical laundry list of readings from political theorists.\nPerfect class to round out a heavy load because you can write nine hundred words a hour before class starts.  \n"
        },
        {
            "course_name": "Modern Political Thought",
            "review_date": "May 11, 2009",
            "review_content": "\nA lot of what's in the previous reviews jives with my experience.  It was very difficult to understand the accent-let's get that in the open right now.  I was surprised to find that it actually hurt my comprehension because I expended a lot of processing power figuring out what words were coming out of her mouth while trying to simultaneously process their meaning.  The few lectures which were given by the TAs seemed a godsend in this regard-and they're both foreign, too.  \nAnyway, I don't fault her for that.  It was clear that she was teaching the class to the grad students-they had a special discussion session and an entirely different assignment structure.  They sat together and she would frequently look in their direction while lecturing.  I agree that she often gave off-the-mark answers to student questions.  \nHer lecture style is very difficult to follow.  She doesn't put bullet points or anything on the board, doesn't clearly transition from one thought to another in her speech and the material is highly abstract (one of the previous posts complained about her delivery of \"historical background\" in a different class, but in this class it was the only place to find any concrete ideas).  She would start the lecture by saying something like, \"I want to make four points about this author,\" and after the lecture I'd stare at my notes unable to discern what the four points were.  \nShe clearly has a flair for the material, though.  She had a very particular take on most of the theorists and what she said was usually very interesting.  I loved the undergrad assignment structure-three 900 word essays and whatever reading you're responsible enough to do.  \nWorkload:\nUndergrads-three 900 word essays and whatever reading you're responsible enough to do (which, if you're really responsible, is around one book a week!).  Weekly discussion sections which she said she wasn't allowed to mandate but for which she would drop your grade nonetheless if you didn't attend. \nGrads-I believe it was one 9 page paper.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 20, 2009",
            "review_content": "\nThe last review for Urbinati's rendition of CC is pretty much spot on.  First to note, and of extreme importance for such a small class, is that she really shows almost no concern for students.  She loves to take attendance religiously, either passing around a list or glancing around the room, during which she frequently marks a student here who is absent, or vice versa, and when someone points out her mistake, more than once I've heard her mutter some excuse and pretend that she actually knows which face goes with which name.  Under these circumstances one would expect class participation to be meager enough, but there's more: you get about 6 seconds to make your point before she cuts you off, and a huge amount of the time she completely misses the boat and the student is faced with the uncomfortable and absurd choice of either shutting up, or continuing to press her patience.  Even in the latter case, it's usually a lost cause.  One time I remember going to her office hours after she gave them in class.  She seemed shocked to see me, and asked me, incredulously, if I hadn't seen the e-mail she set adjusting her hours.  Two problems with that: first, the e-mail had been sent about twenty minutes before I got there, which is obviously far too little notice.  But secondly, as I later discovered, in the e-mail she had curtailed her hours to end at some time that was still some fifteen minutes after I arrived!  I don't know whether to call that a lie or a mistake, but it's disgraceful behavior from a professor.  She did apologize later, but I'm not sure for which offense.  \nSome reviews here might make you stop and think, OK, so she doesn't care that much for students (or at least for undergrads), but she's still brilliant and just listening to her is a treat.  For one thing, if she's so brilliant, may as well just read something she wrote; we're students and customers here because of the idea that there's something great to be gained from a live student-teacher relationship.  But putting this aside, I also disagree with her approach to the texts in the CC setting.  After seeing someone like Katja Vogt of the philosophy department in action - incredibly thorough, always interested in a student's problems or questions, pointing out when a student gives an accepted interpretation of something in addition to giving her own viewpoint - Urbinati seems to barely touch the texts.  Indeed, many classes we only barely open the cover; the rest of the time, she gives us half an hour of \"historical background\" or goes straight to broad conceptual stuff.  In the end, her view of philosophy and political science is incredibly reductionist, at least the way it comes out in class: everything is cliffnote-quality and a summation.  Perhaps she just doesn't trust us with ambiguity or dealing with the real ideas.\nBut I'll put in an unsarcastic good word: Urbinati does seem to do alright with helping to delineate some of the broad themes and principles, so that ten years from now if I hear Locke mentioned, maybe several key words will pop into my head.  In fact, my favorite class almost was the final review; she can be good at that kind of broad-perspective, just-scratching-the-surface stuff.  But from someone who has a real interest in philosophy and has had some great teachers, whether of pure philosophy background or not, steer clear of Urbinati.  She's not terrible if you just want to cruise through the course, although I don't think many would call her an easy grader... you really, and I mean really, have to give her what she wants to hear.  As she herself said, more or less, \"An A is like the sweetest candy.\"  Yeah, right.  They may be sweet for students, but that's an awfully self-serving statement coming from the one who gets to dole them out.\n\nWorkload:\nSee other recent review.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 04, 2009",
            "review_content": "\nI don't really think she can speak English.  Frequently heard phrase in her class: \"Thank you for cleaning my language.\"  She teaches right from the CC guide that they give to profs who volunteer for CC but who have no idea what they're talking about.  On the midterm, she purposely picks quotes that sound like other things to trick you (and thinks it's funny - she actually admitted that in class).  Her paper grading was less irritating - if you go to her and make a case, she tends to change your grade.  Most of the class did end up with an A, but you have to suffer through her super-boring lectures and put a fair amount of effort into studying and paper-writing.\n"
        },
        {
            "course_name": "Democracy and its Critics",
            "review_date": "December 18, 2008",
            "review_content": "\nWhen she gives you the booklist, you will be shocked.  It lists 20 books but don't despair.  Most of the reading are short essays or sections from those books.  I got by without buying any of the books because most of the assigned reading can be found online or through Columbia's e-books.  The lectures are hard to understand at times because of her accent but if you go to each class, there is really no need to do all the reading because she gives a very comprehensive overview of each texts in class.  She, or her TA, whoever grades, does not grade hard at all.  She likes simple, straight to the point essays for the midterm and final and also for the one paper she assigns.  It is a boring class but if you are really interested in the history of democracy, then this is the class for you.\nWorkload:\nOne paper (1200 words), one midterm, and one final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 17, 2008",
            "review_content": "\nUrbinati doesn't seem to give a shit about the students. She knows upwards of two or three names in the entire seminar. She regularly comes to class late (she even showed up to the final ten minutes late after claiming that she didn't know where it was) and ends class early. There is no break, which creates long, tedious classes. She's also a partial grader who loves to hear the sound of her own voice. After receiving a poor grade on a paper I went to her office hours and she told me that I received my grade not because of a bad thesis, or lack of support, or a poorly written paper, but because she \"didn't agree with me.\" That kind of attitude is exactly why you should not take Urbinati's CC session.\nWorkload:\nReading which no one does. Two papers 900 words max. Midterm (5 easy IDs and a choice of two essays) and final (choice of two essays).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 11, 2007",
            "review_content": "\nUrbanati is brilliant. While her lectures may be delivered in less-than-perfect english, the content is clear and engaging. Our class had a great time with Nadia and left with a great background in these texts. That said, she didn't teach the second semester, so this only evaluates her presentation of the first semester CC curriculum.\nWorkload:\ntwo short papers. tricky midterm. easy non-cumulative final.\n"
        },
        {
            "course_name": "Democracy and its Critics",
            "review_date": "January 18, 2006",
            "review_content": "\nIf you are a hard-working student with an interest in political theory and if you like to be challenged, you will do well in any of Professor Urbinati's classes.  If you are looking for an easy class and expect to do well without any time or effort, she is not the professor for you.  You either like her classes or you don't and I think the difference is between those students who are looking to be challenged by an abstract, theoretical course and those who want more of an intuitive, easier poli-sci course.  She assigns a heavy reading load in her classes, but Professor Urbinati is highly respected amongst grad students and undergrad political theory concentrators.  You will learn a lot - but be prepared to EARN your grade.  She is a political theorist, so an intro course in political theory is best before taking her higher level courses.  (I recommend her courses for General Studies poli-sci majors who really want to be challenged in the classroom.)\nWorkload:\nBoth classes - heavy reading load.  Papers are expected to be short and to the point - make an argument and back it up by showing a strong command of the theory.\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "April 18, 2005",
            "review_content": "\nI can't believe some of the negative reviews for Professor Urbinati.  I just have to say that her lectures are wonderfully clear and precise...but you can also tell that she is exceptionally insightful and knowledgable as well as enthusiastic about the material.  She is truly inspiring.  Even if you have never thought about studying political theory, I would recommend Professor Urbinati.   Her syllabi are well thought-out, and the themes she wants to address throughout the course are clear from the beginning; she is very good at making connections/comparisons (and contrasting) between different texts.  She is always well-prepared for class and enjoys grappling with difficult questions.  What I mean by all this is that Professor Urbinati gives her students all the resources to be able to learn political theory well, to engage with it and to enjoy it thoroughly.  If you want a class that is a challenge but will expand your mind, take any course with Professor Urbinati. \n"
        },
        {
            "course_name": "Democracy and its Critics",
            "review_date": "March 21, 2005",
            "review_content": "\nThis is the kind of class that gives Political Science a bad name. Professor Urbinati is very smart and has contributed a great deal to the field for a young woman, but my god her lectures suck. Long, rambling and pointless, occasionally punctuated by her ever to annoying TA. This is a theory course, but the reading list does not cover the current application of democracy's utility in regime change.  Maybe she will update her reading list in the future, but I was dissapointed. Her english is a little rough at times, but it is the content of her lectures that mafde me want to ask Columbia for a refund. Just read the books and skip the class, or get a library card and take some other class all together. Not worth it. \nWorkload:\nBig, expensive reading list. Paper, midterm, final. \n"
        },
        {
            "course_name": "Democracy and its Critics",
            "review_date": "December 27, 2004",
            "review_content": "\nWhat a great teacher!  This is the first political science class I have taken at Columbia, and I hope they can all be as interesting and engaging, and with such a wonderful professor.  I walked out of every lecture more interested in the topics covered, and more aware of just how much Nadia loves teaching and loves the material.  I really recommend taking this class with this teacher- she is clear, youthful, inspiring...and her little errors with the english language always provide for comic relief!\nWorkload:\n1 paper, fairly graded...rather straightfoward midterm and final exam.  \n"
        },
        {
            "course_name": "Democracy and its Critics",
            "review_date": "November 07, 2004",
            "review_content": "\nProf Urbinati is precious. She truely loves the texts that she selects for the class. Lectures are pretty much an outline of the reading assignment (or part of it), and she often goes of on random tangents. She has a hard time answering questions directly, but she loves students asking questions and tries to create an active discussion, which is commendalbe when there are 50+ people in the class.\nWorkload:\nreasonable reading assingnments (some can be a little long), one 2-3 page paper, midterm & final are both essay tests\n"
        },
        {
            "course_name": "Political Thought - Classical and Medieval",
            "review_date": "November 05, 2003",
            "review_content": "\nThis class is amazing.  Prof. Urbinati is brilliant and an enthusiastic lecturer.  She's very intense in her lectures, but that doesn't mean that she doesn't want any give-and-take in terms of class discussion.  Her lectures, without being exegetical, helped me understand the readings far more than I ever thought I could, and whenever I take on a new reading, it's always easier to understand and FAR more interesting than I ever thought it could be.  I've never found her to be unapproachable, but even if she does come across as such, don't be afraid to go talk to her in office hours.  It's definitely worth it.\nWorkload:\nA lot of interesting \"primary source\" reading and she gives optional supplemental readings, which are also very good.  Three 6-7 page papers, no midterm or final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 06, 2003",
            "review_content": "\nProfessor Urbinati is a GREAT lecturer, but be aware that her CC class is a lecture, not a discussion.  She has a very strong background in just about everything on the syllabus and definitely helps to connect ancient philosophers to modern societal and political norms.  The class is as good as it gets for CC.  HOWEVER, she is a self-proclamed tough grader.  Not only does she demand that students formulate an original and aggressive opinion in all papers, she is not afraid to grade them quite poorly if your opinion does not happen to be hers as well.  As a resutl, the extemely light workload can be a downfall if she happens to disagree with your few graded assignments.\nWorkload:\nNormal to light reading for CC, no responses or any measure of accountability (including participation).  Two essays, a midterm and a final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 04, 2003",
            "review_content": "\nShe allows discussion to be taken over by a few domineering personalities, and her specific views are the ONLY right answers.  She is not pleasant to deal with.  She is, however, hopelessly absent-minded, which allows you to skip classes relatively frequently and permits strategic sleeping\nWorkload:\nNot bad, 2 papers, midterm and final of 2 essays each\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 19, 2003",
            "review_content": "\nI don't know what people are going on about.  Nadia Urbinati is an excellent lecturer and has a fantastic knowledge of the materials for CC.  More than that, she is passionate about the subject, and is keen to impart her knowledge to students.  In spite of this, she is a humble person who does care about students.  She was able to bring life to CC texts that I would have otherwise found dry.  I highly recommend her.\nWorkload:\nAbout normal\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 17, 2002",
            "review_content": "\nThere are far too many negative reviews here. Nadia Urbinati is a magnificent CC teacher with a great Italian accent and a love for both the texts and the discussion that ensues. Class participation can be low but at no fault of hers, and when an argument breaks out she's always there to turn it away from futile entrenchment and into a productive dialectic. Classes are a pleasure, and she's always available to talk to.\nWorkload:\nTwo papers, midterm and final. Tough grader, no bullshit - but she's great.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 16, 2002",
            "review_content": "\nShe's a terrible teacher. She's rude, she refuses to discuss the texts, and she goes on crazy tangents about her own ideas. This isn't what CC should be. Drop this class if assigned.\nWorkload:\nSame as most.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 26, 2002",
            "review_content": "\nI thought that Nadia did a great job teaching CC. She really understands the core of what these writiers were trying to convey to their readers. Granted it is often difficult to deal with her accent at first, but as you get to know her, it becomes easier to pick up on what she means. She is very helpful, and if you don't understand something, she will always be there to help explain it to you. Even if she felt that you did not understand the book and you did not write good paper, she will give you oppoturnites to redeem yourself. I liked the fact that she did not want to inudate us with work. I strongly recommend her to anyone who wants to take her class. She can teach you so well that you can find yourself conversing with your bosses during your interships about plato's republic. Who knew??\nWorkload:\ntwo papers, a midterm and a final\n"
        },
        {
            "course_name": "Democratic Theory",
            "review_date": "January 21, 2002",
            "review_content": "\nIf you are intelligent, serious, and tremendously interested in political theory, then do not listen to the other reviews. They're all right about one thing. Nadia knows her shit. In fact, she is one of the most well-respected teachers by the graduate students. Her passion is political theory, and it shows. She is intense. There is no bullshit with Nadia. She won't baby you. They're right--don't expect her to teach you how to write or read political theory. Don't take the class unless you can do these things already. What you can expect from Nadia are lectures that will keep your attention (yes she talks in an extremely loud voice, as a result of her intensity) and a comprehensive syllabus that introduces you to the vast array of aspects and problems in democratic theory. Yes, she is self-absorbed, and doesn't seem to have a lot of time for her students, but if you do the reading, and make an effort to show your interest, she will make the time for you. In other words, even if it doesn't seem like you're welcome at her office hours, go anyway. Sometimes, it's like pulling teeth with Nadia. But the rewards are worth the effort. She is actually a very sweet woman. Her knowledge, intelligence, and passion for what she does have greatly inspired me; she is in no way the traditional \"good teacher\", but for a student who is serious about political theory, she is about as good as it gets.\nWorkload:\nA considerable amount of reading (you can of course get by without doing most of it, although I wouldn't recommend it), an easy midterm, and two 6-7 page papers (one of which serves as the final). Although I have heard horror stories about her grading, for the most part, most people seemed to do well. Overall, the workload was about average (but if you want to really reap the benefits of having Nadia as a teacher, be prepared to work).\n"
        },
        {
            "course_name": "Democratic Theory",
            "review_date": "January 14, 2002",
            "review_content": "\nAlways listen to your fellow CULPA reviewers! That is the lesson learned in this course. Nadia means bidness-fo real! On a visit to her office for writing advice, she blatantly rolled her eyes and rudely answered the knocks on her door while I sat there... determining how to respond to such an obviously nasty demeanor. Furthermore, I'm still unsure as to what she wants her students to write about. Her paper commentary is completely unreadable and its true, she can be dificult to comprehend at times due to her thick accent. But make no mistake, she knows her shit--the question is--does she have time for everyone else?\nWorkload:\n2 papers and essay midterm--no final--yay! Grading is a bit rough.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 02, 2002",
            "review_content": "\nOkay...so I walk into class to face this really irritated woman with a really thick Italian accent. I thought she would grow on me, or my tolerance for her yelling and her confusing lectures would grow. Neither did. I ended up looking confused and just writing bad essays. I switched sections for next semester. Enough said.\nWorkload:\n2 essays that are graded very harshly, midterm, final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 16, 2001",
            "review_content": "\nIf you walk into CC the first day greeted by an Italian lady with hairy armpits, RUN. Nadia is possibly the worst professor I've ever had. She's barely understandable between her accent and her interpretations of CC books. The word most frequently heard to describe her is \"intimidating.\" Political philosophy keeps her up at night (literally...she's told us) which is perhaps why her nails are chewed to mutilated stubs. Don't expect her to teach you how to read philosophy, or how to write philosophy papers, or even how to take her tests. I got a B+ but I'll be damned if I know why--I absorbed absolutely nothing.\nWorkload:\n2 papers, midterm, final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nWe all sat there in her class each time and spent the entire two hours giving each other glazed, \"Huh??\" looks. She just makes no sense! Her interpretations of the readings seem to be based NOT on the readings, and they also differ from Monarch and Cliff interpretations. Also, she's a hard grader because you need to understand things from her point of view to get good grades. But to be fair, I must say that I hear she is known among graduate students for her apt mind and extensive knowledge. I guess if you are already a semi-expert on CC authors and want a professor to debate intelligently with you, she's the one.\n"
        }
    ]
}