{
    "prof_info": [
        {
            "prof_name": "Julia Salzman",
            "prof_id": 3297,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 18, 2008",
            "review_content": "\nI disagree with all previous reviewers.  I think the problem might be that people come into the class with the expectation that the only thing required of them will be to memorize formulas...but nope!  it's actually hard work (if you want a good grade).  Personally, I think very highly of her, and I think she's by far one of the most intelligent professors that has so far taught me at Columbia (let's say she pairs with Elmes...just brilliant women).  Catch is: you do have to put a lot into it.  and i especially disagree in that she has no teaching skills.  given, she is not an entertainer, but i don't think Columbia pays professors to come make us laugh.  too bad that she won't be teaching at CU anymore, i actually think the school is missing a lot by letting her go.  See...thing is if instead of whining about her teaching skills throughout the semester you would have taken the time to actually study and UNDERSTAND the material you might have been surprised at finding that once you get the logic of the class, you are set (conditioned in that you study).  Anyway, I liked the class overall.  and if prof salzman was to stay i would highly recommend taking her class.  \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 14, 2008",
            "review_content": "\nThis was Prof. Salzman's first semester teaching at Columbia and undergrads. She previously taught grad students at Stanford University so she taught the material very quickly with little time for review. However, she was very open to the suggestions of students on how to improve, slow down and review the material covered. I recommend taking her class if you are on top of your homeworks (weekly) and can learn on your own, from the textbook. Attending lecture is very optional (only some 15 students attending my section regularly). Also the TAs didn't have recitation sections, only office hours. The midterm was straight forward and if you studied and did the homework it was fine. I have no comments to give about the final.\nWorkload:\nweekly problem sets, midterm, final\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 28, 2007",
            "review_content": "\nI thought I had had my worst teacher at Columbia when I took stats 1111 but Ms. Salzman did the impossible and is now my worst teacher at Columbia. A first year teacher here at Columbia, her lectures are incoherent, utterly boring, and filled with cryptic abbreviations for EVERYTHING. I had to make many friends in the class in order to do the homework which was long and hard. The midterm and final were death. She told us to prepare for them by redoing the homework, yet the test was nothing like the hw. She admitted the the mean for the midterm was a 30%. The final was equally impossible but included 2 problems from the midterm. AVOID!!!\nWorkload:\nA lot of reading to figure out what the hell is going on in class, lots of hw, really really hard midterm and final. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 22, 2007",
            "review_content": "\nThis was Prof Salzman's first time teaching at Columbia, and it looked like as if it was her first time teaching in front of a class at all.\nI went to class the first day and all 68 desks were filled. Over the course of the next four lectures, each person I sat next to told me they were going to drop the class. My big lecture class turned into a nice seminar of 24 people. \nShe tried explaining moderately easy statistical concepts in a symbolic math nature, which scared a lot of econ majors out of the course. When asked how to explain this in a different fashion, she was unable to do so. Frequently she would ask a question and no one would respond. However, she would wait until someone did to proceed in explaining material. She also had a syllabus that was the equivalent of 2 semesters of statistics at the university of Michigan that she wanted to get done in one. \nAs the year went on she began to understand more what the class wanted. The syllabus was going to be impossible to stick to. She gave a midterm that had an average of 50% in my section and 33% in the other. As a result she offered an extra credit assignment and tried to explain concepts more slowly. She started giving more economics based examples in explaining concepts of regression to make the majority of the class feel as if the topic was relevant. \nWith a semester of experience under her belt, I think she would be one of the more enjoyable statistics teachers to have. She's young, brilliant, and learning, and will make a solid teacher someday. Moderately easy A if you had AP stat in high school.\nWorkload:\nweekly homeworks, 5 problems or so, with some conceptual problems and some work with a statistical programming software R, which is easy to learn. 15%\n1 midterm, difficult 35%\nextremely easy final 50%\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 20, 2007",
            "review_content": "\nShe doesn't lecture very well.  Hard problem sets (15%).  Midterm (35%) and final (50%) are insanely difficult.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 18, 2007",
            "review_content": "\nCompletely awful. Difficult to approach, no personality. \nTalks in a monotone voice. Doesn't explain things clearly. \nGoes way too fast. Avoid.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "November 15, 2007",
            "review_content": "\nI'm gonna write this early because her review is highly demanded here. Frankly, I don't really find her class to be that good. This was her first time teaching undergrads so that could be the reason. Until now she has only taught PhD students at Stanford. Anyways the lectures are really obvious and even though she said she won't follow the textbook, she follows the textbook all the time. She explains theories and proofs but the problem is that she doesn't usually use examples to teach. We had one midterm and the result was horrendous. The mean was 30 out of a 100 and only 8 kids out of 33 or 35 got over a 40. The midterm was really weird and had almost nothing to do with the homework problems or the problems that she sometimes does in class. Overall, the class sucks, but it's a requirement so you have to take it. I would recommend taking stats with Salzman just because everyone else will do equally bad and your grade won't be good granted you actually do the homeworks and read the textbook.\nWorkload:\np-set every week, one midterm, one final. There's a extra credit assignment because everyone did so badly on their midterms that adds 20 points to the midterm grade.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "November 12, 2007",
            "review_content": "\nIt was obvious on the first day of class that Prof. Salzman had never taught before. Her lectures vaguely followed the book, but were mostly example problems that were of no help for the homework or understanding the material. Half the class stopped coming after the first week. The homeworks were moderately difficult and required lots of supplementary reading of the textbook, which I felt taught the material better than Prof. Salzman. The midterm was completely out of the blue. It covered conceptual materials while the class and homework covered computational materials. The class average for the midterm was around a 30 percent.\nI took AP stats in high school, and concepts that were clear back them are more confusing now after this class. Try to find another statistics teacher. Unfortunately, I've heard the other intro teachers are bad, too. Good luck\nWorkload:\nweekly homework assignments, midterm covering materials complete unrelated to homework, final\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "November 12, 2007",
            "review_content": "\nSeriously, stay away. She knows the material doubtless, but moves really quickly, has a lot of trouble making the class interesting, and is a lot less clear than the book. Midterms are near impossible (though there is a heavy curve). If you take this class you will probably end up teaching yourself nearly all of the material out of the book. I know I did.\nWorkload:\nProblem sets every week, one midterm and a final, extra credit project. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "November 10, 2007",
            "review_content": "\nAn overall fair professor considering that this is her first semester.  Make sure to go to class because sometimes she puts hw questions on the board which aren't posted on the online problem sets.  She liked being vague on what was on the midterm, the means of which in her two classes were in the 30s and the 50s.\nWorkload:\nWeekly problem sets (15%), midterm (35%), final (50%).\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "November 07, 2007",
            "review_content": "\nIf you can take Stat with another professor. DO NOT take this course. Salzman is really sweet, but her hws are extremely hard, takes forever to do. Her midterm is a killer. If you really care about your grades, then don't take this course.  \nWorkload:\nOne problem set every week, usually very hard. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "October 30, 2007",
            "review_content": "\nThe class average on our midterm was a 30 out of 100. That wasn't a typo. 30.\nAnd after learning this, instead of inferring that perhaps something is wrong with her teaching style, or that the test was unfair, Salzman held that students should have gotten all the questions correct except for 1.\nSeriously, if you take this class with her you're just asking for it.\nWorkload:\nIt doesn't matter how much work you put in since her test questions come out of left field.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "October 30, 2007",
            "review_content": "\nOh Julia! Julia Julia Julia. Julia is a new Prof who used to teach graduate students at Stanford. She clearly has yet to grasp the difference between Stanford graduate students of Statistics and undergraduate Econ majors at Columbia. No one understands what she says in class, and this is not because she can't speak English. She just can't explain the concepts very well. You can certainly teach yourself from the book, but going to class is important when it comes to the midterm. The average on her midterm was a 33 in one class and a 53 in the class that took it second (cheat much?). The material is not easy, and this is coming from someone who even did well on her heinous test. That doesn't really change from teacher to teacher. She may be the best of many bad options, which is sad to say.\nWorkload:\nWeekly problem sets. Her first problem sets were very long, but we forced her to shorten them. Her tests are hard! The 33 average speaks for itself. But I don't know if any other teacher is exactly easier and they are curved. A 40 and above is in the A range.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "October 24, 2007",
            "review_content": "\nShe is easily the worst professor I've had at Columbia. I really tried to give her the benefit of the doubt for the first half of the semester. She's new, clearly socially awkward, and clearly hasn't had much experience teaching statistics to people who aren't knowledgeable about it. I thought maybe she'd come out of her shell, become more engaging, or even just act as though she cares about teaching. Well, I was wrong.\nLectures are horrible. I am one of ~8 people (in a class of 35) who attends each class, and I go only for the amusing dialogue between her and the rest of the class. Basically, she'll write something unclear on the board and talk about it briefly. It will go over everyone's heads. Someone will ask a question and she'll answer shortly as though the asker is disabled. Repeat. The most frustrating part is that she hasn't attempted to alter her teaching style despite the fact that she clearly isn't getting the points across to anyone. She just doesn't care.\nGenerally the redeeming quality of a class like this is that all the material is covered in the text book. This is true for the homework - my homework average is something like 99% just because I read the book.\nHOWEVER!!!!\nShe did not post a sample midterm, as she claimed that the midterm would be very easy as long as you understand all the homework questions. Well, this couldn't have been farther from the truth. The homeworks are largely computational, and any theoretical content is easily derived from the formulas. Her midterm, on the other hand, was entirely proof-based and required that you derive all the formulas. There was virtually no computation whatsoever. This would have been fine (maybe), only she gave us no indication that this would be the case.\nAnd then there are the TAs. I attended a TA review session to prep for the midterm. Within minutes of being there, the TA had announced that he may not be much help since he hasn't opened the book all semester. He also stated that he does not know how to integrate a lot of the time. Yeah, not very helpful.\nHonestly, I think that I'm one of the members of the class who likes Salzman the MOST. Most people seem to completely 100% despise her, and rightly so. I'm not usually one to write culpa reviews as I don't really care a whole lot about other people's fates, but in this case I am making an exception. I noticed that she is teaching again next semester.. STAY AWAY!\nWorkload:\nWeekly homework that's basically busywork and doesn't prepare you for exams.\n"
        }
    ]
}