{
    "prof_info": [
        {
            "prof_name": "Margaret Lange",
            "prof_id": 2713,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "American Politics and Social Welfare Policy",
            "review_date": "December 08, 2007",
            "review_content": "\nPainful, painful, painful, painful. Steer clear of her. She has no enthusiasm, puts everyone to sleep, and basically can't stimulate discussion to save her life. Her discussion sections are full of awkward silences. Plus, her spelling on the board is pathetic and laughable. I felt bad for her, and she was added as a TA later on b/c the class got too big, but the poor thing just didn't know what was going on, and seemed to not care or know anything about the subject. My basic advice is if you want to stay awake in discussion and get anything out of your time, stay away from her.\n"
        },
        {
            "course_name": "Introduction to Political Thought",
            "review_date": "September 11, 2006",
            "review_content": "\nNOTE: I ONLY  HAD MAGGIE AS A TA FOR ONE SECTION. However, in that section she seemed extremely indifferent to the class, lethargic, like she wanted to leave as soon as she could, and like she needed some serious caffeine. I had already heard a friend who had previously had her describe her as \"worthless.\" However, she was switched out to another class after the first week or so of section. Be warned though, that, based on first impressions, steer clear of her if you can. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 10, 2006",
            "review_content": "\nWow... don't expect to get much out of discussion. Show up and have something to say and you will do fine. She wont look at your papers ahead of time and isn't too helpful with final preparation. But she is nice and pretty understanding and great responding to e-mails. She does give map quizzes (I think only because the professor made her). \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 15, 2005",
            "review_content": "\nMaggie was afraid that she would get a bad, horrible, scary review on CULPA, but she has no reason to fear.  I enjoyed the section.  Keep up the good work, Maggie!\n"
        }
    ]
}