{
    "prof_info": [
        {
            "prof_name": "David Derosa",
            "prof_id": 5004,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Pricing Models for Financial Engineering",
            "review_date": "December 30, 2014",
            "review_content": "\nIf your undergrad major is not finance or you don't have substantial prior work experience in finance or you have yet taken Intro to FE, I'd say avoid this class. You'll be a lot better off taking some introductory finance classes first and even then I'd choose this class at caution. I agree with the previous reviewer on almost all fronts, it's clear that the professor is not well organized, he tends to teach using his stories than following a rigorous and systematic approach. Don't get me wrong, I like a good story just as much as everyone else does, but for a class on pricing models, stories are not going to help you build a rigorous framework. \nNow the mini projects and exams. I enjoy the mini projects, they are hands-on, practical and requires you to think, which is a fantastic thing. But the professor does NOT give the answers to the projects (and exams) after we get the grades, his argument is that if we get the answers they'd start circulating and he won't be able to use them again later. I mean I see his point, but honestly what's the point of doing those questions and don't know how you get them wrong, isn't knowing what you did wrong a critical part of learning? As for the exams, they are not reflective of the course content and very much out of an engineering setting. In a word, I think the professor brings too much idiosyncrasy to this class.\nWorkload:\nFair. Requires a LOT of reading if you're a finance layman though.\n"
        },
        {
            "course_name": "Pricing Models for Financial Engineering",
            "review_date": "January 28, 2013",
            "review_content": "\nBecause I listened to the previous reviewer of this course and professor, I chose the course last semester and couldn't regret more!!!\nI along with many other course mates (even the TA's) agree that Derosa has no teaching ethics or whatsoever. First of all, all the slides he used are from 2006, which contain bad handwritings, ambiguous graphs and are very unorganized. I highly doubt much update has been put in through these years. If you want to study pricing theories or models that are ancient and listen to his stories 10-20 years ago, this is probably the right course for you. \nThen it comes to his attitude. I never had a professor as arrogant as Derosa in my life!!! Almost no one can ask him a question without being humiliated or looked down upon. He might seem ok/nice at class, but after class you'll see his attitude clearly. Since he is a visiting professor at IEOR, you never get any office hours (only 2hrs before midterm) and he barely replies to any emails.\nNext lets talk about the course contents. If you are new to finance and never used John Hull's book before, you'll have to do a lot of self studying. The teaching materials in class and homework after class almost have no relevance. So be prepared to commit 5 hrs reading the book and doing the homework in each chapter. For those who used to do finance in their undergrad, maybe you can go to this class and listen to his stories, however I would not think it is worthy the tuitions you pay.\nIn general, the 5-6 micro projects are somehow interesting. But little help was given so many people get 50% on average. Since Derosa doesn't give many instructions to the TA's either, there is almost no way you can get help from anywhere. \nFinally, the exams. Instead of asking something from the homework, he gives you short answer questions, true/false/unknown questions, and short essays for both midterm and final. He tried to make the questions as tricky as possible to screw us over... Only 10% was given to a calculation question in the whole exam. So what ,ind of pricing model class is this? \nIf I'm not truly disappointed by this course and the professor, I wouldn't have written such a long review. I urge you to make your choice cautiously. \nWorkload:\n10 homework, 6 micro project, midterm and final exams. \nModerately heavy \n"
        },
        {
            "course_name": "Pricing Models for Financial Engineering",
            "review_date": "December 23, 2010",
            "review_content": "\nSuperb Professor. Excellent Instructor. SEAS is lucky to have such a high quality professor. He taught at Yale previously (I wonder why he left), but now he is here. Take a class with him while you can because he is very knowledgeable in his area of expertise. He has worked in the industry for a long time also so has many stories about his experiences that are relevant to the class. He teaches Black Scholes with a passion that you may sometimes mistake as the carrier of the soul of the now deseased Fisher Black. \nWorkload:\nHard at times but very fair. Grading Fair. \n"
        }
    ]
}