{
    "prof_info": [
        {
            "prof_name": "Shaena Montanari",
            "prof_id": 10622,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "EESC 2300 Earth Systems: Life, and ENV 2200 Environmental Biology II",
            "review_date": "November 03, 2010",
            "review_content": "\nThe second semester of Enviro Bio was so so so different from the first, they should hardly be considered part of the same sequence. I, too, enjoyed this semester more, but mostly because the I preferred the material and the laid-back character of the professors. \nMatt Palmer is awesome (too bad he's married now, though!) and he does a really great job breaking material down so that students can understand both the details and the big picture. He very intelligent, and therefore can move through material very quickly, but slows down for in-class questions.\nPaul Olsen is very old. I found his lectures incredibly random and disorganized. I would often look up from 15 minutes of gchatting to see a massive purple and pink \"dinosaur recreation\" on the screen, listened for a few minutes to see if what he was talking about was at all related to the image, discovered it wasn't and then returned to my online dalliances. This said, I understand that Olsen knows his stuff about dinos and rocks, but the technology (ie PowerPoint and iClickers) really seemed to get the better of him.\nKevin Griffin is also a very smart dude. He tends to do more \"big picture\" stuff and assumes that his students can get the details elsewhere. His research is pretty interesting and his kids are really cute (they make it into about every other lecture). \nShaena is the shit. Again, super smart but also cool and very helpful in lab because most of the assignments appeared to be designed for precocious 6th-graders (read: making phylogenies of LEGOS and counting beans for genetics). She made coming in for 3 hours to do the silly \"labs\" okay, because she tolerated extensive Tim and Eric Awesome Show breaks.\nOverall, this is a good class, and if you have the discipline to stay offline in class, you can learn a lot. Hopefully the organization of the whole thing will get better, and the labs will get more college-level. \nWorkload:\nFairly light. Some textbook and article reading, which is super redundant if you took Enviro Bio I. Just skim the stuff before the midterms.\n3-hour weekly \"labs\" in which you get a head start on the \"Lab reports\" and then forget about them until the night before they are due.\n3 field trips, of questionable educational value.\n3 midterms (one after each section). Fairly easy, but study with others because the answers will come from notes, so try to fill in the gaps with classmates.\n"
        }
    ]
}