{
    "prof_info": [
        {
            "prof_name": "Jane Clayton",
            "prof_id": 2847,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Swahili I",
            "review_date": "December 14, 2010",
            "review_content": "\nBibi Clayton is probably one of the cutest people I've ever met.  She's incredibly sweet, understanding, and has the greatest tinkly laugh I ever did hear.  After a semester of Beginner Swahili I, I can already carry on a decent conversation and write lengthy stories (much more than I could after three years of high school Spanish).  As another review said, there was never a class without laughter, and I know a majority of the class is going to continue taking the language through the Advanced level because it's so fun.  If you have absolutely any desire to study a cool language spoken in awesome countries, TAKE THIS CLASS.  The workload is cake and you'll have a blast.  Plus, her PowerPoint typos are the greatest.\nWorkload:\nLike I said, cake.  Wordchamp online vocab exercises once or twice per week, a short grammar assignment for each lesson, one group project, midterm, final take home test and oral exam.\n"
        },
        {
            "course_name": "Elementary Swahili I",
            "review_date": "February 01, 2006",
            "review_content": "\nFirst off, Swahili is the bomb. Seriously, it is the bomb. If you want to be in the most close-knit class on campus, you have to take Elem Swahili with Bi Njeri. And if you want to meet the most fascinating woman on this planet, take Elem Swahili with Bi Njeri. This woman is a Kenyan enigma; her degree is unknown, her past is a mystery, and her accent is just precious. If you ever wanted to know what your name sounds like butchered by a middle-aged African emigre, well, you'll just have to wait and see. And hands down, best weave on campus. As for the material itself, the learning is painless and the grading is painfully lenient. We have never had a class end without laughter, and we have never pondered over a teacher's personal life as much as Mama Clayton's. If you're looking for that secret gem of a class on Columbia's campus, look no further than the International Affairs building. We all agree that, as first-years, this class MADE our semester, and we will never look back with regrets. For God's sake, TAKE THIS CLASS! \nWorkload:\nIf you so much as bitch about the homework for this class, you need to go home. Daily homework assignments that will somehow make you laugh (20 minutes a piece). Awfully written midterm that's awfully easy. Oral project, free topic, no sweat. Final: long, mild, easily graded.\n"
        }
    ]
}