{
    "prof_info": [
        {
            "prof_name": "Kristina Boerger",
            "prof_id": 671,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "BC1001-BC1002 Introduction to Music",
            "review_date": "January 13, 2009",
            "review_content": "\nThis class with this professor is one of those that people either love or hate. Or both. I was a little of both.\nThe positive (which outweighs the negative):\n- Boerger knows her stuff very, very well, and is incredibly passionate about it. I don't think it's possible not to get excited about Bach during her lectures (even to a classical violinist who has played Bach partitas ad nauseum).\n- There's a textbook, but readings are optional and everything you need to know is covered in lecture (but copying her blackboard notes is essential!), except a few quiz questions, which she gives you beforehand.\n- You get a very thorough overview of Western music and the history that surrounded it.\n- She is a fantastic writing coach--much, much better than the FYS teacher I had at the time--and wants you to become a better writer, too.\nThe negative:\n- Boerger usually came into class sort of angry (usually not about the class) and took it out on us, but she always cheered up after 10 or 15 minutes of teaching, and you could tell she loved the class.\n- My section had 15 very quiet people in it. She became frustrated when nobody answered questions, we got timid whenever she was frustrated, she became more frustrated...\n- I think pre-1600 Western music is sort of boring, especially if you've played classical music before. Some of it is beautiful. Most of it is totally predictable. Never took the second semester for scheduling reasons--that one might be better...\n- If you don't like writing, and working hard at it, the essays are a bitch.\n- Lots of memorization\nBoerger is such a great resource--I just wish the class was conducted a little more effectively. I still learned a lot and found a lot of music I love.\nWorkload:\nThree essays (they need to be well-written!), seven (I think?) listening quizzes, which take intense studying...the night before, and a final, which is not too difficult if you've taken good notes.\n"
        },
        {
            "course_name": "BC1001-BC1002 Introduction to Music",
            "review_date": "January 01, 2009",
            "review_content": "\nI'm nearly tone-deaf and I loved this class.  Hated the final (basically a three-hour vocabulary test), and the three listening quizzes throughout the semester were murder (but that might not be true if you're not, you know, tone deaf), but the lectures are awesome: fascinating and fun, all at once.  Prof. Boerger is willing to explain concepts as simple as a \"note,\" over and over and over again, and she's also willing to go off on tangents about concepts that interest her students; you can tell that she loves talking about music, and will happily do it under pretty much any conditions.  She's tough about deadlines, though -- the papers are totally doable if you put in a reasonable amount of work, but don't even *think* of turning them in late.\n"
        },
        {
            "course_name": "Introduction to Music",
            "review_date": "January 15, 2006",
            "review_content": "\nThis class was ok, but not great.  Boerger is very passionate about music & her goal is for everyone to do well in the class, but that doesn't make it easy.  She gives 3 papers.  The first is based on attending a musical performance.  The second is comparing & contrasting 3 performances of the same composition.  These are torturous if you do not have a good background in classical music terminology.  The last, a comparision based on a boring book, is just tedious.\nAlso the class is imbedded to the Writing Fellows program, which I think would be very beneficial to freshman.  However, as an upperclassman, I found having to meet with a Fellow to be a little bit redundant. \nAlso, I think the exam is much different & harder than how she explained it was going to be.  There are also 3 listening quizzes which are just a pain to prepare for.\nTake this class to fulfill a requirement & to get an A but don't expect it to be easy.  Lots of people pass-fail.\nWorkload:\n3 listening quizzes3 papers1 final\n"
        },
        {
            "course_name": "Intro to Music, I",
            "review_date": "November 17, 2005",
            "review_content": "\nI love, love, LOVE this class. Prof. Boerger is an engaging lecturer and a truly passionate teacher and lover of music. I never thought Gregorian chant could be interesting, but she really made all the old stuff come alive. Easily one of the best classes I have had at Columbia -- I cannot recommend it more highly.\nWorkload:\nNo reading (except for one very short book); 3 essays, which are graded toughly, but she makes her expectations WELL known; 3 listening quizzes (tedious to study for, but very interesting); final exam .... all in all, a perfectly managable workload\n"
        },
        {
            "course_name": "Intro to Music, I",
            "review_date": "November 10, 2005",
            "review_content": "\nDon't take this class if you don't really like classical music or if you're not familiar with music. Or, if you think the class will be easy. It's not. Her essays are ridiculous. \n"
        },
        {
            "course_name": "Intro to Music I, II",
            "review_date": "May 28, 2005",
            "review_content": "\nThis human being could quite possibly change your life. I have never met a professor this fascinated by her own field - it's as if day after day she discovers new thing that can be said with music, and then she is willing to share those things with you, her students.  I came into this calss knowing nothing about theory, nothing about music history, and having blocked out most classical music when my mother made me listen to it in the car on the way to school.  Kristina Boerger not only opened a new door for my intellect, she re-invigorated a Western tradition that I thought was only meant for old men and stuffy living rooms.  She could be seen as a kind of witch-doctor in that way, raising music up from the dead and making it relevant to the way we live now.  This class will help you learn not just facts or how to listen to music, but how to listen to yourself, you soul, your heart.  All of this, of course, depends on you and your interest, but if you really dive in, if you take the time to BE interested - you will change and you will grow in ways you didn't think were possible. Give thanks that there are people in this world as passionate about art and life as Dr. Boerger. \nWorkload:\n3 papers, extensive listening to amazing, fascinating music, one easy final you could pass as long as you attend the review sessions.\n"
        },
        {
            "course_name": "Intro to Music",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Boerger's class was really worthwhile. She made it interesting for everyone- those with no background in music at all to those who have been studying music for years. The most impressive thing for me was her lectures- she was always very organized, and by the end of the semester, I knew what I needed to review, because her lectures were so structured. Best of all, she is passionate about what she does, which makes the class the most worthwhile- if you're lucky, you'll get to hear Vivaldi's guitar concerto and the Sesame Street story! \nWorkload:\nNot bad- the worst was reviewing for the final. Otherwise- 3 listening quizzes, 3 papers\n"
        },
        {
            "course_name": "Introduction to Music",
            "review_date": "November 01, 2004",
            "review_content": "\nProfessor Boerger is worth the tuition of Barnard. Prior to taking her class, I had no experience with music whatsoever. Even though I can't read a single note, Professor Boerger makes incredibly complex concepts easy to understand. Make no mistake; Intro to Music is a very difficult course, but Boerger's energy and enthusiasm is so contagious that you actually enjoy doing all the hard work. The only downside to taking Boerger's Intro to Music, is the disappointment in discovering that she doesn't teach any other course! If Professor Boerger taught trigonometry, I'd take it. Hell, given that she's the teacher I might actually enjoy and understand it!\nIt's such privilege to be a student of hers, and so rewarding to begin to understand and appreciate music as I feel I am having her as a teacher. \nThis Â“reviewÂ” is a bit premature, but I wanted this review to have an impact on the people looking for courses now. Make a note to take this class next year! \nThank GOD that the course is a full year. I still have a semester to go!\nWorkload:\nA lot, but it's \"good\" work. \n"
        },
        {
            "course_name": "Intro to Music, I and II",
            "review_date": "May 07, 2004",
            "review_content": "\nProfessor Boerger is the best thing that has happened to me at Barnard yet! She is the most incredibly professor ever! I came into her class with an appreciation for music and music background, but after one week in her class I looked at music in such a different way. I learned so much just from her lectures and countless stories and interesting facts she had about the composers, styles of music, and pieces we listened to. People with no music background can totally handle this class too, so no fears regarding that.  Professor Boerger obviously loves music (it is literally her life-she has a bunch of other jobs as a professional singer, conductor, etc.) and shares her passion with the students. Textbooks are necessary to buy but are practically never used. All that is needed for this class is the willingness to listen to Professor Boerger and to learn from her...just come to lecture and the review sessions and you are totally set for something in the A/B range! I cannot give Professor Boerger enough praise! She is approachable, funny, intelligent, and a wonderful teacher. Take this class, it is amazing!\nWorkload:\n3 papers (2 drafts-1st draft meeting with Writing Fellow, 2nd hand in for a grade), 3 listening quizzes (easy-start preparing the week before)\n"
        },
        {
            "course_name": "Intro to Music",
            "review_date": "January 04, 2004",
            "review_content": "\nEven as someone with absolutely NO background in music, no specific like for classical music--I recommend this course. \nProfessor Boerger is a great professor. She constantly stops lectures to make sure you understand what she has gone through. She has a great passion for music and it is this passion which makes what to me is a boring subject..actually quite interesting. \nWord of advice. Dont cram for the listening quizzes. Make sure you use good grammar on the papers...and do attend the review section she holds for the final (even if you're lost throughout the entire semester--all you really have to do is go to those 2 sections and memorize). She is not out to trick you, she is very helpful in helping you get a good grade, handing out the listening quiz study sheet well in advance. Moreover, unlike many professors, she is very accessible. She really wants you to learn, take advantage of it. \nWorkload:\n3 easy 5 pg papers, 3 easy listening quizzes, and an easy final. (if you attend the review sections)\n"
        },
        {
            "course_name": "Intro to Music",
            "review_date": "December 16, 2003",
            "review_content": "\nWOW - Boerger is the nicest professor ever. She has FEELINGS! The class is really boring though, and SOOOO easy - anyone who complains is a frigging meathead. If you talk during class she looks totally crushed... so at least pretend you're paying attention! \nWorkload:\n3 5pg. papers (easy topics) 3 listening quizzes (easiest A ever!) and a final. MAKE SURE you have good grammar- she's a stickler for it. \n"
        },
        {
            "course_name": "Intro to Music",
            "review_date": "November 11, 2003",
            "review_content": "\nI completely disagree that you should not take this course if you have no music backgraound.  I am honestly not kidding when i say she takes you step by step through everything, providing guidelines and yes, even a sample essay so you can't screw it up.  everyone complains about the first paper but i have no idea how.  she gives you a sample of what it should be like, a writing fellow who knows what a good paper should look like reviews it, and then you get to rewrite it and only the final draft gets graded.  and this is standard for all three papers.  dont freak out they are only 5 pages long and not too broing to work on.  if you listen to her guidelines, all you will have to do in your rewrite is correct typos and change a few adjectives , maybe go into more detail, but isnt it nice that someone is there to tell you how to get a better grade?  if you were that against it, you could just hand in your original draft, but why....why would you want to.\nthe second paper is a review of a performance and  it forces you to get your butt out into the city and see a concert for $10 at carnegie hall or $20 at the met... the third is a book review, all 3 are not even close to difficult.  the tests are sooooo easy, all you have to do is listen to the exact songs she tells you to listen to, all of which are fabulous works, and then be able to identify them when she plays them for the test.  and she reviews everything that is on the final.  everything. \nPlus, she is terriffic...she doesnt make the class stressfull of full of stupid information, its all about understanding and appreciating the music.\nHowever, of you don't like classical music or dont think you will like it then you probably shouldnt take the class, because thats pretty much all you focus on.  if you are thinking about it, check it out, go to the class a couple of times.  im sure youll love it.\nWorkload:\n3 5-page papers, 3 listening quizzes, and a final that actually convers what you have learned in class.  how often does that happen at Columbia?\n"
        },
        {
            "course_name": "Introduction to Music",
            "review_date": "September 13, 2003",
            "review_content": "\nDo not take this class if you have no background in music.  I wouldn't have survived the first paper (which is an auditory analysis of a recorded piece) if I hadn't had some performance experience.  It's not like you have to be a music major or anything, but if you know basic music terminology you'll be okay.  Her papers are really easy, and you get to do two drafts with a writing fellow, which makes it even easier.  The only things that can be difficult are the listening quizes, but if you beginning studying them the week before the exam, you'll be fine.  You can't cram for them.  Other than that, the course is easy, also, if you have to miss a few classes its no biggie.  \nWorkload:\nThree papers (she's not an easy grader, but not harsh either. If you put time and emotion into your words, you'll do great)  A final which is SO EASY, because she gives you the list of terms needed and has two review sessions to go over them.  \n"
        },
        {
            "course_name": "Intro to Music",
            "review_date": "September 03, 2003",
            "review_content": "\nThis class is soooo not overly demanding...The final is soooo not impossible, and everyone is sooo not an ass kisser.  If you're going to put in 0 effort and get a bad grade, it's still worth it because the material is wonderful, and so is she.\nWorkload:\n3 5 page papers, 3 listening quizzes...as in all you have to do is LISTEN to the music...yes, very demanding, and a final for which she reviews EVERYHITNG.\n"
        },
        {
            "course_name": "Intro to Music",
            "review_date": "May 27, 2003",
            "review_content": "\nI dont understand how all the previous reviews raved about this professor.  She's a nice lady and all, but it's a horrible class.  Don't take her intro class.  It's a lot more demanding that you would think an intro class would be.  And the class is full of overachieving ass kissers. \nWorkload:\nToo much for an intro class. 3 papers (3 rough drafts & 3 final drafts), mandatory writing fellow meetings, 3 listening quizzes, and the most impossible final ever. \n"
        },
        {
            "course_name": "Intro to Music II",
            "review_date": "May 12, 2003",
            "review_content": "\nThis was one of my favorite classes this semester.  Definitely take it with Prof. Boerger.  My friends have taken the other section and this one is definitely more geared towards understanding and appreciating the music than a series of facts you'll probably forget after the final anyway.  I loved going to class every day knowing I'd be listening to beautiful music, you'll find yourself downloading the songs after class.  Pretty low-stress class if you do the work, she definitely helps you out with the work in any way she can.  You know what she expects, she'll give you a million examples to make sure u get it. If you enjoy music in any way shape or form, TAKE THIS CLASS, it even fulfills a requirement.  You  definitely won't regret it.  Prof Boerger definitley makes it an enjoyable few hours a week.  And, after the final she'll thank you for being in her class!!!!! wow!!!  In reality I should be thanking her for this wonderful semester in her class.\nWorkload:\n3 5-page papers, 3 listening quizzez(the songs are so great), final.  Very doable and very enjoyable - not kidding\n"
        },
        {
            "course_name": "Intro to Music Part II",
            "review_date": "April 27, 2003",
            "review_content": "\nShe's great.  I have little background in classical music, but she makes everything interesting and accessible (and come on, you listen to such great works!).  The workload is fine, and during much of the class she plays five to ten minutes of one piece, partly to hammer home the point she wants to make and partly because she knows it's a beautiful piece and wants us to appreciate it for itself.  A wonderful class; don't worry about the grading, because it's not too difficult and also not worth thinking about when you have so much amazing music to discover.\nWorkload:\nThree essays, three quizes, final.\n"
        },
        {
            "course_name": "Intro to Music, I",
            "review_date": "January 27, 2003",
            "review_content": "\ngreat lecturer, but really unfair. Gave a ridiculous final. I got As on everything and came out of teh final thinking i got a B...  So all was sweet.  AND THEN I Got a D on teh final (she was excessively picky when grading) and ended up getting a B. Watch out... there are a bunch of music geeks in teh class who spoil teh bvell curve.  Overall... dont take the class if youre not a music geek.\n\nWorkload:\nnot much at all\n"
        },
        {
            "course_name": "Introduction to Music",
            "review_date": "November 13, 2002",
            "review_content": "\nKRISTINA IS FABULOUS!! she is one of the best professors I've ever had here. I would nominate her for every award. I came into the class having an appreciation for music, but having hardly any background in music history or in music theory. I disagree adamantly with the first review; I think she make the class very accessible to the lay-person. Her experience as a conductor and a singer really bring wonderful dimensions to the class. I highly recommend her. If you didn't like music before, you will now. \nWorkload:\nthree papers, five pages each. (use correct grammar!) they're fun to do! music listening quizzes and a final exam.\n"
        },
        {
            "course_name": "Introduction to Music",
            "review_date": "October 05, 2002",
            "review_content": "\nThis woman is horrible. She is great if you have been taking music for years and want to learn what you already know. For me, someone with no musical background, she is a nightmare. Her class consists of her coming to class, putting some names and dates on the board and then playing you selections from a CD (sometime for a half hour). She is an extremely tough grader, she gives one grade for content and another for grammar on the papers. She is a comma fanatic. She looks for very specific things in her papers not accounting for the fact it is an intro course. Also, she is always unprepared for class because \"she has 5 jobs.\" \nWorkload:\n3 papers, 3 listening quizzes (consists of you memorizing songs) and a final which is easy and has tons of extra credit. \n"
        },
        {
            "course_name": "BC1001-BC1002 Introduction to Music",
            "review_date": "August 06, 2001",
            "review_content": "\nKristina Boerger is really one of the best professors I've had at this university. She's incredibly enthusiastic and friendly, as well as extremely accessible. She's knows a TON about music, and obviously loves what she does and isn't afraid to show it (and she wants everyone else to love music too!). Her lectures are fun, well-organized, and packed with info. I came into this class with a pretty extensive musical backgroud, but I still learned a lot and wasn't bored at all. I also had friends in my class who started out knowing very little about music, but they loved the class too and felt that they got a lot out of it. Gail Archer teaches the other section of this class but she's terrible, so I'd suggest taking Intro. to Music with Boerger instead -- she's amazing! Definitely don't leave this university without taking a class with her.\nWorkload:\nNot too bad: three papers (approx. 5 pages each), three small listening quizzes, occasional reading in the textbook, and a final (no midterm!).\n"
        }
    ]
}