{
    "prof_info": [
        {
            "prof_name": "David Rosand",
            "prof_id": 384,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Italian Renaissance Painting II: 16th Century",
            "review_date": "December 19, 2008",
            "review_content": "\nBy reviewing Culpa, it is clear that anyone who wrote a less than sparkling view for this teacher has no understanding of art history. The complaints against Professor Rosand's style of speaking and analyses do great injustice to the art history curriculum at Barnard and Columbia. If anyone is wondering about his capabilities as a teacher, the existing reviews are extremely misleading. He is a world-renowned scholar of Venetian painting. Those who do not appreciate his scholarship clearly do not appreciate art historical study in general. \n"
        },
        {
            "course_name": "Italian Renaissance Painting II: 16th Century",
            "review_date": "May 18, 2005",
            "review_content": "\nSometimes, his lectures kick ass. and sometimes...they just didnt make sense! the man can ramble like a pro, and he sometimes never makes it back to a point. he talked about somethings WAY too much, and other things, he barely touched on...its a bit hard to handle, but overall, i found myself enjoying the class. that being said, they graded the papers pretty harshly, which is stupid since there was only one writing assignment. and he put images on the final that were DETAILS of paintings rather than the entire painting, which i didnt think was really kosher. \nWorkload:\nmidterm, paper, final\n"
        },
        {
            "course_name": "Italian Renaissance Painting II: 16th Century",
            "review_date": "March 20, 2005",
            "review_content": "\nDavid Rosand speaks slowly, deliberately, and carefully. This is both good and bad. It's convenient because it allows the student to reflect and digest the presented material, which is very rewarding in its own way. But it's also horrible because Professor Rosand hardly defines his terms or takes the time to elaborate; when he says \"coiffure\" he means hair, when he says that \" Euclid in the School of Athens represents the 'harmo-chordic' representations of the universe, despite the fact that he's presented as an ally of Plato instead of Aristotle\", you kind of wonder what the hell he's talking about.  \nYou must heed his advice on the importance of independent learning or you may be in trouble. You'll notice that 80% of the 20 page syllabus lists the \"reccomended/suggested\" reading sections, so understand that he wants us to be independent learners. Just grab onto one of your picked up interests and stick with it. Also, make sure you're very careful with the required readings; Professor Rosand will throw curveballs at you during test time - for midterms, the question was \"Discuss what Vasari means by the 'Modern Style' \", despite never going into depth with Vasari. This class can only be highly beneficial if you have time and passion, two things that  have a hard time to simultaneously coeexist at Columbia! So stick with your practical guns and be good to yourself with Rosand! \nWorkload:\nOne mid-term exam (30%) + one final exam (40%) - lots of memorization and as stated above, you must be very good with your readings because he won't cover them directly. And one final term paper (40%) that tests the critical skills you've supposedly picked up in class. He's a tough grader. \"Excellent essay\" with no criticism means a B+ (boo hoo). \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 21, 2004",
            "review_content": "\nI've been to both ends of it with this guy so I feel capable of giving a good evaluation.  What I mean is that I hated this class for the first 4 or 5 weeks.  There's something about him that drove me crazy.  The other reviewers are right, he won't know you name, and he can go on and on.  He has this particular way of looking at art that drove me crazy.  I wanted passion and meaning and interpretation!  I mean hey, this is art right!  On top of that he uses words like 'coiffure' and 'conflagration' in ordinary conversation.  Like, I know what they mean, but can't you just say 'hair' and 'fire?'\nBUT - he really turned it around for me.  I got over 'my' way of looking at art.  He got me to look at it from a new standpoint, something more basic, that relied on what you could actually see versus what I felt I saw.  It was an enlightening exercise and I feel like my relationship to art deepened several notches by the end of the course. \nI guess what I want to say is, this guy actually taught me something, even though our personalities clashed at first.  That's pretty cool in my book.\nBy the middle of the semester, I looked forward to this class.\nWorkload:\n2 papers plus an ungraded paper (which was strange), he  does read/grade the papers thoroughly, midterm and final - both straightforward.\n"
        },
        {
            "course_name": "Italian Renaissance Painting II: 16th Century",
            "review_date": "January 20, 2003",
            "review_content": "\nIf spending 4 classes on the Sistine Chapel ceiling sounds boring to you, don't take this class--it's for people who enjoy this sort of thing.  In this class, Prof. Rosand used an object-based approach to examine the concept of the High Renaissance, focusing on Leonardo, Michelangelo, Raphael, Titian, and Giorgione.   Although he did spend too much time on the Florentine artists, leaving only a few classes to cover Venetian painting, which is one of his areas of expertise, this fault only points up his absorption in the material.  Rosand's lectures tended to focus on the main points of readings, making it possible for the lazier student to get by.  On the other hand, the midterm and final did require a good command of the images, but that will come to anyone who goes to class and does a moderate amount of reading.\nWorkload:\n7-8 page paper, midterm, final.\n"
        },
        {
            "course_name": "Italian Renaissance Painting II: 16th Century",
            "review_date": "December 25, 2002",
            "review_content": "\nDon't take this class, take Beck's version instead.  This class had a graduate course number, but there were at least 50 undergrads in this class with me.  Rosand started on the first day of class saying \"I've decided that I am goign to take time where I want to, so if i want to focus on something in particular, I am goign to take as much liberty as I would like.\"  Well, he certainly took these liberties, and I should have known better.  We spent 3 individual classes looking at Leonardo's Last Supper and another 4 looking at the Sistine Chapel Ceililng (it gets really boring after a while).  Additionally, Rosand is known for his scholarship on Venetian art; we spent one day on it, just before the final.  The assignments had no concrete dates, and the final and midterm exams had a rediculous number of IDs - 25 plus essays on each.  What made me most angry was that he obviously did not keep a good record of what happened at each class, because many slides on the exams were never shown and were not on the website.  The \"optional\" discussion sections were equally in vain, as he kept the TAs in the dark too.  We would ask them a question, and they woudl have no idea what the answer was.  Though I did like his reading list, there was no point in reading any of the works because a) half of them were his own articles, so we heard his points in class and b) he would assign 500 pages of something like vasari or castiglione, and then tell you waht the most important points were.  On the day of the final, many of the undergrads arrived early, and we just laughed about how much we don't care about this class.  Grading was arbitrarily tough (comments like \"generally good essay - B\" are common).  It's really a pity, too, because he is such a nice man.\nWorkload:\npaper (10 pages) midterm final.  waste of time.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 31, 1999",
            "review_content": "\nHe's a knowledgeable lecturer, a top dog in the department, but i would have prefered an Art Hum teacher who knew our names and led real discussions rather than just ask a few questions each class and call it \"class participation.\" But he was interesing to listen to. Really, is knowing our names too much to ask? So much for the personal environment core classes are supposed to create!\nWorkload:\ntwo papers, midterm final. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 31, 1999",
            "review_content": "\nHe's a knowledgeable lecturer, a top dog in the department, but i would have prefered an Art Hum teacher who knew our names and led real discussions rather than just ask a few questions each class and call it \"class participation.\" But he was interesing to listen to. Really, is knowing our names too much to ask? So much for the personal environment core classes are supposed to create!\nWorkload:\ntwo papers, midterm final. \n"
        }
    ]
}