{
    "prof_info": [
        {
            "prof_name": "Warner Schilling",
            "prof_id": 172,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Weapons, Strategy, and War",
            "review_date": "May 19, 2008",
            "review_content": "\nI decided to take this class despite some of the worse reviews, and initially thought they were way off.  Professor Schilling is amiable enough, and while he doesn't tolerate distractions in his class, he does encourage questions and office hours visits.  The work load includes heavy reading, but so do most pol.sci courses.  And the lectures were interesting.  But that was all until we got past gunpowder - which, in a course that focuses on world wars one and two, is just far in enough that you've passed the initial add/drop period.  At that point, Schilling's lectures meandered incessantly into the trivial, and there was no way of knowing which tiny detail was going to be on the exam.  The exam, by the way, is extremely specific, and there are no hints about which fact you need to know  - he doesn't even talk to the ta about it beforehand.  So the reviewers were right. If you love details about the military and war strategy and are willing to memorize all the readings and lectures, go for it.  Otherwise, stick with other courses. \nWorkload:\nHeavy.  About 200 pgs of reading per week, midterm and final.  And you have to remember everything.\n"
        },
        {
            "course_name": "Weapons, Strategy, and War",
            "review_date": "October 11, 2007",
            "review_content": "\nThis was by far the most difficult class I have ever taken at Columbia.  Unless you are a high on testosterone and are dying to fulfill some 4th-grade-war-hero fantasy vicariously, you should stay far, far away from this class.  It's REALLY hard.  You are expected to have a broad working knowledge of military exploits past and present, massive amounts of specific geography (of the \"what's the name of this river in Holland's tributary\" variety), and a good grasp on technology in weapons.  Don't get me wrong -- the class was jam-packed with interesting tidbits that will make your eyes light up on the next Ken Burns war special -- but it's really, really hard unless you're already a military buff.  Schilling's a kick in the pants (seems intimidating, but is a pretty good and super-smart guy), but the level of detail and minutiae involved in readings and lecture will make you wish you were never born -- or at least wish you were not a political science major.  \nWorkload:\nPretty intense.  About 200 pages of reading per week (with insane levels of detail).  Lecture attendance is a must.  Midterm, final, optional discussion section.\n"
        },
        {
            "course_name": "Weapons, Strategy, and War",
            "review_date": "March 29, 2005",
            "review_content": "\nTo begin with, the review from April 12, 2001, is basically right but incomplete. \nThe one from before January 2001 is complete nonsense, so pay no attention to it.\nOkay, so here's the thingÂ—I love military history. I love it so much that almost every class I would ever take would be about it if I had the choice. Needless to say, I am starved for courses on the topic here at Columbia, although I'm sure it would be no different anywhere else (except West Point or somewhere like that). \nBut this class is a complete godsend, by far the best class I've ever taken here at Columbia. The lectures are break-neck but fascinating and always on-topic; the readings are even better, with almost no exceptions. When the professor spent literally half a class period on the 1944 Russian summer offensive (Operation Bagration), I nearly wept with joy. If this sort of thing doesn't interest you, then clearly you shouldn't take this class. But if you want a blow-by-blow account of why the German armored spearhead knocked the hell out of the French in 1940, then Schilling is your man.\nThe best part is that all of the details about weapons and tacticsÂ—and have no doubt, there will be TONS of them, more than you'd think possible in a single semesterÂ—fit into a sensible and coherent conceptual framework. Here the emphasis is on how four relatively discreet factors (political considerations, technological advances, developments in tactical doctrine, and cultural ethos) have shaped the way in which wars have been fought in modern times. In other words, you will walk out of this course able to give an analytical response to a question such as, why was Napoleon so successful in his military exploits? Clearly, in my view, the weakest aspect of the class was that the professor did not place the evolution of strategy within the same analytical framework as he did with respect to the evolution of weapons and tactics. But if that is my biggest complaint, then hell, I guess I'm doing alright after all.\nBottom line: This is an unbelievable class with provocative ideas as well as tons of fascinating details.\nWorkload:\nAverage amount of reading, midterm, and final. No papers. Grading is quite stiff but fair.\n"
        },
        {
            "course_name": "International Politics Seminar: Causes of  War ",
            "review_date": "September 13, 2003",
            "review_content": "\nThis is not the professor you want if you tend to blow off the readings, go into class unprepared and talk about whatever you feel like.  Prof. Schilling has a zero tolerence for BS and has no qualms about humiliating you if you dare try to BS in his class.  So if you are a career BSer do not take this class!  On the other hand if you want to learn something about war and are an intelligent person who thinks before they speak definitely sign up.  Prof. Schilling is a veteran himself and brings a first hand feel to the material.  He also really knows his stuff and cares about you knowing it.  Go to see him in office hours for questions and he will spend alot of time with you.  Once you get past the admittedly intimidating exterior at first, he's a pretty cool guy.\nWorkload:\nheavy reading\n"
        },
        {
            "course_name": "International Politics Seminar: Causes of  War ",
            "review_date": "April 17, 2003",
            "review_content": "\nProfessor Schilling can be a pretty cool guy, he's approachable and will do his best to answer all the questions you have. The downside is that the data he brings to support his point is super old and outdated. I also suggest you do the readings for this class, as its hard to participate without it. Otherwise you will just find yourself staring at the HUGE combover he's got going\nWorkload:\nthe Seminar paper, max 35 pages, but 25 will do\n"
        },
        {
            "course_name": "Weapons, Strategy, and War",
            "review_date": "April 11, 2001",
            "review_content": "\nThis is a very interesting class if you're a war buff and enjoy watching the history channel @ 3 in the morning, this class is for you. Be warned though: the professor is intimidating. He'll kick out freshmen, Barnard students, auditers, non-degree candidates and graduate students taking the class for \"R\" credit the first day. Avoid asking stupid questions in class, his disdain for you will be more than evident by his tone and facial expressions. However, despite his foreboding exterior, he is approachable during office hours and more than willing to discuss things. The lectures are statistically dense: lots of figures and charts, years, ridiculous amounts of geographical detail that he assumes you know. Going to the optional section REALLY helps. The TA this year, Scott Douglas, is more qualified than some professors I've had; he's got a masters from a SIPA-like program in DC and now's he pursuing a doctorate in poli-sci. This guy KNOW his stuff and is an excellent teacher.\nWorkload:\nAbout 200 pgs./week which is essential for understanding lecture. Midterm/Final, optional research paper, which you might need to do after the midterm!\n"
        },
        {
            "course_name": "Weapons, Strategy, and War",
            "review_date": "December 31, 1999",
            "review_content": "\nHis course titles sound like the fanciful obsessions of a muddled old man who still yearns to be a general. Which makes them pretty much accurate. Latecomers will be energetically harassed, in traditional bootcamp style. Spends four weeks on the crossbow, one week on World War II and the entire semester in the same black turtleneck and tweed jacket. Class is terminally disorganized but there are many fine tidbits of trivia to be collected and stored for awkward elevator moments. Section is optional, reading list is long and grading is tough.\nWorkload:\nMidterm & Final exams.\n"
        }
    ]
}