{
    "prof_info": [
        {
            "prof_name": "Rachel Riederer",
            "prof_id": 9564,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "April 15, 2010",
            "review_content": "\nThe first review makes this one redundant and probably less comprehensive. \nRachel's awesome.\nShe chose great readings that stimulated lively discussion in class. The discussions were especially useful in helping me come up with ideas for my essays. At times, her assignments seemed long, but most, if not all, of them were useful in helping me develop orimprove my essays.\nShe's incredibly helpful and if you need to meet with her, she will always be willing to make the time. Overall she grades very fairly and your grade can be raised (or lowered) for each essay unit by a + (or -) based on assignments and class participation.\nEven though I am skeptical about the usefulness of this course, the essays I wrote in this class were probably some of the best essays I have ever written. Evidently, the environment she created played a major role in helping me write some of my best essays. If you have Rachel for University Writing, you're in good hands.\nFor those concerned about their grades: unlike a lot of UW teachers, you CAN get an A in Rachel's class.\nWorkload:\nTypically a reading or some sort of 1 page written assignment per class. 3 essays + Reflection (as with all UW classes). I think the workload was roughly the same amount as for all other UW classes.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 25, 2010",
            "review_content": "\nEvery single person I know hated University Writing.\nExcept for me; I loved it. The reason? I had Rachel Riederer.\nRachel does an outstanding job of letting the class take its own desired direction; she picked interesting material and then let us talk about whatever we wanted. There's almost no BS in this class; Rachel won't try to push you to sound \"academic\"; she'll push you to be clear and precise. By the end of this class, I can guarantee your writing will be better.\nI can honestly say that I looked forward to coming to class. Every day we had a truly engaging discussion - not just on effective writing techniques - but on real-world interesting topics. Rachel is the only UW teacher I've ever heard of who lets students do this.\nHer grading is also unbelievably fair - she adjusts the grade of every essay up by 1/3 of a letter grade assuming you did the very easy daily work, and then she'll do the same thing with your final grade. You also get numerous drafts per essay, so you have plenty of opportunity to get the essay to be the way both you and she want it to be.\nSafe yourself an unbelievable amount of suffering - take UW with Rachel.\n\nWorkload:\nSome easy work once or twice a week - not only is it easy, it's also usually fun! Three essays + one retrospective essay - these take a LONG time, but obviously that's not Rachel's fault. Also, Rachel assigns MUCH less reading than most UW teachers. Which, frankly, is nice.\n"
        }
    ]
}