{
    "prof_info": [
        {
            "prof_name": "Jeffrey O'Neal",
            "prof_id": 1567,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 01, 2007",
            "review_content": "\nJeff is one of the finest teachers I have ever had. He is genuinely enthusiastic about both the material and his students, whether they be he quiet kid in the back or the ex-debater who sits right in the front and talks too much. He comes to class with every lesson perfectly prepared, but he is not afraid to deviate from his curriculum when students ask specific questions or want to take the discussion somewhere he perhaps did not originally intend. He is patient, insightful, considerate, and knows that, in the end, this class is about literature and the study of great works, and tries not to let bureaucracy get in the way of good books. \nJeff is tough if you don't do the work or participate in class, but forgiving of minor slip-ups and flexible with deadlines as long as he knows you are genuinely committed. \nWorkload:\nThe Lit Hum courseload is miserable as it is, but Jeff tries not to pile on too much extra work.\n3 1000-word essays on any topic of your choice, essentially, as long as it usues textual referencs from Lit Hum books. The midterm was quite straighforward and simple if you did even a minimum of reading. Lots of prep for the final; the quotes he gives are much harder than the ones on the actual exam, so if you can handle most of his exerpts you will be fine.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 15, 2007",
            "review_content": "\nJeff is a graduate student in the English Department, but don't let his lack of a PhD (which, at any rate, should be reversed in a year or two) deter you from taking his section. He's talented, with a keen literary eye, and a refreshing ability to convey what he sees with wit but sans pretentiousness (in part by deftly avoiding words such as \"sans\").\nHe's a fair grader and very helpful during his office hours. For the Spring, I unfortunately had to switch out of his section. I would, however, advise you not to switch out, unless absolutely necessary, if you are lucky enough to find yourself in it.\nWorkload:\nThree essays, with ample time to get them done. Standard reading list, no supplemental readings.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 04, 2007",
            "review_content": "\nJeff is a great Lit Hum instructor. He's an English Lit PhD student and former University Writing instructor, both of which are an asset to his teaching. His style is very laid back and he's always approachable, his office hours are definitely a big help when you have to come up with a paper topic. His paper comments are thorough, his grading is not tough, and he'll read your drafts at your option.\nThe only weak spot in this class was the coverage of Herodotus and Thucydides-- you get a sense that Jeff doesn't really know what to make of them and is phoning it in on those, but it was his first time teaching them and I can't particularly fault him for that.\nWorkload:\nEasy. 3 essays of about 1500 words each. ~4 blog posts per semester + 2 blog comments per week.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 19, 2004",
            "review_content": "\nJeff was a blessing to my University Writing class.  Funny, smart, and very open to comments and conversation, Jeff made an otherwise dreary subject into an enjoyable experience.  He completely understood that most of University Writing was ridiculous, and he accomplished the goals of the course in his own way.  He never once talked about a \"Lens\" essay because he said that the name was stupid, and the \"cooperative\" portion of our CCP consisted of voting on which essay to write about and then writing our own essays about it.  We also skipped the retrospective essay at the end of the year to spend more time on the major essay, the CCP.  \nAll in all, I could not have asked for a better teacher for writing class.  Every lesson was designed to help us make better choices while writing, and I feel that I am a better writer now than I was before the class.  His comments on papers and conversations about essays I was working on were always insightful, and he helped me to form better and more interesting topics.\nWorkload:\n3 essays, no retrospective! several smaller assignments early on, and some pretty bad essays to read.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 12, 2004",
            "review_content": "\nJeff is by far the best University Writing professor out there.  He is a really fun, funny, entertaining guy.  He recognizes that it is an aweful class and that teaching how to write is impossible, and then proceeds in making the course as painless as possible.  He does not follow the trend of grading really hard early on in the semester and then giving inflated grades later so he can pat himself on the back.  Instead, he is a fair grader throughout giving all A's and B's.  He changes the prompts to make them more interesting than any other teacher's, and he limits the amount of busy work.  This resulted in my friends telling me that I was a jerk and that it wasn't fair how much better my UWriting class was than theirs.  The class was in a consensus that Jeff O'Neal was the best.\nWorkload:\n3-4 essays depending on whether you're lucky or not.  Standard lengths, but he understands if they are a little long or short.  Due dates are flexible if you don't take advantage of him.  A cool guy.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "October 23, 2004",
            "review_content": "\nIf you're a first year, and you just got assigned Jeff as your Uni Writing teacher, congratulations - you have just hit the jackpot.  This guy is unbelievable.  He teaches the class to think and analyze, and he is extremely helpful in his assistance on writing essays.  His comments on your writing are always insightful, and he really seems to want people to succeed in his class and at this school.  Everybody on my dorm floor hates University Writing except for me, and Jeff is the reason for that.\nWorkload:\nNot bad - the standard uni writing workload of reading different essays(I hate you, Martha Nussbaum!).  4 papers, several smaller assignments early.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 24, 2004",
            "review_content": "\nGreat writing professor.  If you can get him, you're really really lucky.  He's helpful on papers, and wants his students to do his best.  He can also take a really bad core curriculum syllabus and make it interesting.  Great sense of humor, and not too much pressure.\nWorkload:\nSome short writing assignments in the beginning, readings, and 4 papers.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 17, 2003",
            "review_content": "\nJeff is one of the coolest teachers for Uni Writing. He is awesome.  Class was actually fun and interesting and the reading wasnt the worst. For the research paper the class got to decide the topic rather then the teacher like in most others.  It helped alot because we actually wrote about something we wanted to rather then something that the teacher wants.  Jeff was very helpful in editing papers and he altered office hours so that everyone could meet with him.\nWorkload:\nFew small writings in the beginning then the standard papers for UW.  Only read 6 pieces which werent too bad\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 08, 2003",
            "review_content": "\nToo bad Jeff's amazingness and intelligence had to be wasted on such a stupid class.  Class was always something to look forward to.  Any pain that could come from,say,  the midterm or final was eased with the candy that Jeff brought.  Ladies, watch out!  Jeff, or maybe i should say \"hotty mchothot?\", has stolen the hearts of many.  On a serious note, his comments on papers were always helpful and class, for the most part, was interesting.\nWorkload:\nnot bad.  essay topic not usually bs\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 22, 2003",
            "review_content": "\nI don't know why I am writing this review because traditional L&R; won't exist in approximately two weeks, except I do know why I am writing it: Jeff is perfect and magical. Everyone you talk to tells you L&R; is the worst thing that will happen in your life, and he made it my favorite class. He is smart, funny, genuine, and a Hottie McHot Hot. Seriously, you will want to marry him by the end of the semester. Essay topics were interesting and not impossible, and in class we actually had discussions. And good times. Lots of laughing. Best Moment: Jeff getting sick and loading up on Nyquil and trying to talk to us about analogies but laughing hysterically after every sentence. Worst Moment: Jeff talking about his girlfriend. :( \nWorkload:\nNormal. TOTALLY FAIR GRADING.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 30, 2003",
            "review_content": "\nwow is this guy ever good. essay topics were engaging and interesting, class time was filled with activities, and the marking was generous and fair. get this prof if you can\nWorkload:\nthe usual (for the old l/r which apparently won't exist after 2002-2003)\n"
        }
    ]
}