{
    "prof_info": [
        {
            "prof_name": "Matthew Engelke",
            "prof_id": 13686,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Western Civilizations",
            "review_date": "April 24, 2021",
            "review_content": "\nProfessor Engelke is the best! He is so kind and interesting, and he cares so so much about his students. He is super knowledgable about the material, a good facilitator, and a good grader. He will give you feedback on papers before you turn them in and exams are about remembering the books you've enjoyed the most. If you get him for CC you're lucky :)\nWorkload:\nReading every class (normal)\n2 papers\n1 close reading\noptional discussion posts\nno midterm\nfinal\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 10, 2020",
            "review_content": "\nProfessor Engelke is a super smart guy - he's done research on atheists and Christians all over the world, and he references his research and current events so that CC doesn't feel so distant from the \"real world\". He's ok with the discussion getting a little off-topic which is refreshing - in my experience, CC can really polarize people because it's so involved with religion, philosophy, and morality, but with the right time/space (as in Professor Engelke's class), people feel like they have the freedom to listen to each other.\nAll that being said, Professor Engelke sometimes jumps into big, broad ideas and moves extremely fast during seminars, so if you haven't really done the reading and show up to class, it'll be pretty hard to participate. If you want a professor who can break down the arguments in the text for you, this really isn't the guy for you. He's also an extremely tough graders on papers and would make broad comments about my quotes being inaccurate without really explain why. On the midterm and final though, when I thought I was really BS-ing the quotes, I would do much better, grade-wise.\nThe best part though - he has a dog named Willa who does therapy at hospitals who we got to meet when Professor Engelke invited us over to his house for a CC class complete with bagels and coffee! If you meet her, please tell Willa that I love her and that she is a very good dog. \nWorkload:\nNormal CC Reading\n2 papers (first 6-8 pages; second 10-12 pages)\n1 Midterm w/ short answers + essays \n1 Final w/ short answers + essays \n"
        },
        {
            "course_name": "Magic and Modernity",
            "review_date": "April 30, 2019",
            "review_content": "\nProfessor Engelke is such a nice man, and he's really funny too! His lectures are entertaining and he is very enthusiastic about the topics we cover. He likes to play a song at every class.\nAs for the course itself, I would say it was interesting, but nothing life changing. It even gets a bit repetitive after time and it feel like we only skim certain topics, while others could be approached in a totally different way. \nI would neither recommend, nor advise against taking this class.\nWorkload:\n50 pages of reading a week\n6 reading responses total on the readings you desire (1 page single spaced) \n1 midterm (6-8 pages essay on reading, answering a prompt) \n1 final (8-10 pages essay on the topic you want)\nSuper manageable workload! :) \n"
        }
    ]
}