{
    "prof_info": [
        {
            "prof_name": "John Pagano",
            "prof_id": 906,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "The Enchanted Imagination",
            "review_date": "December 09, 2016",
            "review_content": "\nProfessor Pagano is a sweet man and enthusiastic about the content and his students. It's clear that he loves what he does and he often uses the class to discuss the importance of the texts to students' own lives and college journeys. He's especially great if you're a creative person because he is very supportive of the artistic life and praises it often. The readings are almost always interesting and fun and he does a really good job of having recurrent themes appear through different readings. That being said I always got a weird ~vibe~ from him. He never did anything inappropriate, but just made me uncomfortable with some of his feminist and psychosexual analysis of the works. He's never really said or done anything to really be labelled creepy, but it's also worth noting that I wasn't the only student who felt this way. Ultimately, Professor Pagano is a great teacher and the class is really interesting, he just made me uncomfortable sometimes.    \nWorkload:\nREADINGS AND FREEWRITES: Due every class. The length of readings can vary greatly but the longer selections are usually novels and not too difficult to get through/skim. The freewrites are literally one page responses (I usually hand wrote something that took up most of one side of lined paper)to the reading. You really don't have to worry about structuring you're thoughts, just write whatever's on your mind after doing the reading.\nESSAYS-There are three essays. For each one you get several prompts to choose from and they all ended up being about 5 pages for me. For all of the essays you also get to have a peer editor and him look at it before submitting the final copy. (He says this isn't true with the last essay, but he literally just let me do this).\nHe's pretty understanding about absences and extensions but the class is small and the discussions are really important to attend if you want to do well. \n\n"
        },
        {
            "course_name": "The Enchanted Imagination",
            "review_date": "April 18, 2015",
            "review_content": "\nI took FYS - The Enchanted Imagination the first semester of my freshman year, and it was (hands down) THE best class I've ever taken.  It's not merely the interesting theme and readings; Professor Pagano simply took the entire experience to the next level, and nothing can ever top that.\nProfessor Pagano is more than a professor to all the students in the Seminar: he is an approachable man with a big heart, and only wants to be there to help you make the best of this class.  By the second day, he already has not only our names, but also our hometowns and prospective majors down as if he had known us for weeks.  As a professor, he is one of the most passionate teachers I've ever encountered.  He knows the material virtually by heart (not to mention the fact that he's able to recite the entire poem Rime of the Ancient Mariner), and his love for fantasy and literature has been absolutely contagious.  He is well-prepared for the class, and is able to provide new ideas when the discussion falls short.  He highly encourages self-expression, and is very open minded when students present their own opinions.  Thus, every class is like looking at the world in multiple lenses, which is made possible because Professor Pagano would never impose his opinion on you.  While he does have the tendency to digress, it's never for more than a minute, and we are always back on track after two sentences tops.  His fatherly energy also brings in a homey feeling the second one walks into the classroom, and the chemistry amongst the students was cultivated by the end of the first week.  The bonds between not only the individual student and Professor Pagano, but also said student and her peers have grown to be very strong thanks to Professor Pagano's aura and passion.  Professor Pagano is also one of those professors who loves keeping in touch with former students, and is willing to make time to meet them and catch up.  In other words, he's a wonderful professor, moderator and human being, and he will make you unconsciously want to do well in this class for reasons far beyond merely understanding the literature or having a wonderful GPA.\nPersonally, I've always walked out of Seminar feeling like I had just been through something life-changing, no matter how small - something I rarely feel with my other classes.  His insights on the readings has been very inspirational, and many students leave the class with a more positive attitude towards life.  Basically, he's a great professor teaching a great class, and this will gift you with one of the most memorable classroom experiences in your college career - one that you will look back on and be eternally grateful for the experience.\nWorkload:\nFreewrites:\n-Due before every class\n-Not a formal essay\n-Literally just a reflection of your insights towards your readings for the upcoming class\n-Usually 1-2 pages long\n-Very informal piece of writing that aids your participation in discussions, guaranteed\n3 Essays:\n-Self-explanatory\n-Essay topics always on Courseworks at beginning of semester to help start early\n-Final essay usually has an creative writing option\nReadings:\n-Always set, but very flexible\n-Guidelines on Courseworks to facilitate experience\n"
        },
        {
            "course_name": "The Enchanted Imagination",
            "review_date": "April 18, 2015",
            "review_content": "\nI took FYS - The Enchanted Imagination the first semester of my freshman year, and it was (hands down) THE best class I've ever taken.  It's not merely the interesting theme and readings; Professor Pagano simply took the entire experience to the next level, and nothing can ever top that.\nProfessor Pagano is more than a professor to all the students in the Seminar: he is an approachable man with a big heart, and only wants to be there to help you make the best of this class.  By the second day, he already has not only our names, but also our hometowns and prospective majors down as if he had known us for weeks.  As a professor, he is one of the most passionate teachers I've ever encountered.  He knows the material virtually by heart (not to mention the fact that he's able to recite the entire poem Rime of the Ancient Mariner), and his love for fantasy and literature has been absolutely contagious.  He is well-prepared for the class, and is able to provide new ideas when the discussion falls short.  He highly encourages self-expression, and is very open minded when students present their own opinions.  Thus, every class is like looking at the world in multiple lenses, which is made possible because Professor Pagano would never impose his opinion on you.  While he does have the tendency to digress, it's never for more than a minute, and we are always back on track after two sentences tops.  His fatherly energy also brings in a homey feeling the second one walks into the classroom, and the chemistry amongst the students was cultivated by the end of the first week.  The bonds between not only the individual student and Professor Pagano, but also said student and her peers have grown to be very strong thanks to Professor Pagano's aura and passion.  Professor Pagano is also one of those professors who loves keeping in touch with former students, and is willing to make time to meet them and catch up.  In other words, he's a wonderful professor, moderator and human being, and he will make you unconsciously want to do well in this class for reasons far beyond merely understanding the literature or having a wonderful GPA.\nPersonally, I've always walked out of Seminar feeling like I had just been through something life-changing, no matter how small - something I rarely feel with my other classes.  His insights on the readings has been very inspirational, and many students leave the class with a more positive attitude towards life.  Basically, he's a great professor teaching a great class, and this will gift you with one of the most memorable classroom experiences in your college career - one that you will look back on and be eternally grateful for the experience.\nWorkload:\nFreewrites:\n-Due before every class\n-Not a formal essay\n-Literally just a reflection of your insights towards your readings for the upcoming class\n-Usually 1-2 pages long\n-Very informal piece of writing that aids your participation in discussions, guaranteed\n3 Essays:\n-Self-explanatory\n-Essay topics always on Courseworks at beginning of semester to help start early\n-Final essay usually has an creative writing option\nReadings:\n-Always set, but very flexible\n-Guidelines on Courseworks to facilitate experience\n"
        },
        {
            "course_name": "The Enchanted Imagination",
            "review_date": "April 18, 2015",
            "review_content": "\nI took FYS - The Enchanted Imagination the first semester of my freshman year, and it was (hands down) THE best class I've ever taken.  It's not merely the interesting theme and readings; Professor Pagano simply took the entire experience to the next level, and nothing can ever top that.\nProfessor Pagano is more than a professor to all the students in the Seminar: he is an approachable man with a big heart, and only wants to be there to help you make the best of this class.  By the second day, he already has not only our names, but also our hometowns and prospective majors down as if he had known us for weeks.  As a professor, he is one of the most passionate teachers I've ever encountered.  He knows the material virtually by heart (not to mention the fact that he's able to recite the entire poem Rime of the Ancient Mariner), and his love for fantasy and literature has been absolutely contagious.  He is well-prepared for the class, and is able to provide new ideas when the discussion falls short.  He highly encourages self-expression, and is very open minded when students present their own opinions.  Thus, every class is like looking at the world in multiple lenses, which is made possible because Professor Pagano would never impose his opinion on you.  While he does have the tendency to digress, it's never for more than a minute, and we are always back on track after two sentences tops.  His fatherly energy also brings in a homey feeling the second one walks into the classroom, and the chemistry amongst the students was cultivated by the end of the first week.  The bonds between not only the individual student and Professor Pagano, but also said student and her peers have grown to be very strong thanks to Professor Pagano's aura and passion.  Professor Pagano is also one of those professors who loves keeping in touch with former students, and is willing to make time to meet them and catch up.  In other words, he's a wonderful professor, moderator and human being, and he will make you unconsciously want to do well in this class for reasons far beyond merely understanding the literature or having a wonderful GPA.\nPersonally, I've always walked out of Seminar feeling like I had just been through something life-changing, no matter how small - something I rarely feel with my other classes.  His insights on the readings has been very inspirational, and many students leave the class with a more positive attitude towards life.  Basically, he's a great professor teaching a great class, and this will gift you with one of the most memorable classroom experiences in your college career - one that you will look back on and be eternally grateful for the experience.\nWorkload:\nFreewrites:\n-Due before every class\n-Not a formal essay\n-Literally just a reflection of your insights towards your readings for the upcoming class\n-Usually 1-2 pages long\n-Very informal piece of writing that aids your participation in discussions, guaranteed\n3 Essays:\n-Self-explanatory\n-Essay topics always on Courseworks at beginning of semester to help start early\n-Final essay usually has an creative writing option\nReadings:\n-Always set, but very flexible\n-Guidelines on Courseworks to facilitate experience\n"
        },
        {
            "course_name": "The Enchanted Imagination",
            "review_date": "October 18, 2014",
            "review_content": "\nI highly recommend this First Year Seminar. We read fun and interesting novels/poems/short stories/plays such as \"Into the Woods,\" \"Alice and Wonderland,\" \"Rime of the Ancient Mariner,\" \"Lord of the Rings,\" and assorted fairytales, and have interesting and thought-provoking discussions about the works in class.\n Professor Pagano is best teacher I've had so far. He is brilliant, kind, and understanding; he offers excellent insight during class discussions and makes you think about literature and life in a different way. You will never look at fairytales the same way again. He is also encouraging and never shoots down your ideas during class. As long as you participate and seem to show interest in the readings, you will have no trouble at all. He also lets you revise your essays as many times as you want with constant feedback, so if you work hard, you will definitely receive an \"A\" in this class. \nBasically, this class is fun, awesome, and perfect in every way. I've become a better writer, reader, and person because of FYS Enchanted Imagination. You should definitely take it! \n\nWorkload:\nFree writes due every class (takes 30 min at most to write), and 3 essays (the last one can be a fantasy piece) \n"
        },
        {
            "course_name": "First Year Seminar",
            "review_date": "November 13, 2013",
            "review_content": "\nTake this class if you're into Lord of the Rings, class discussion, and a really nice professor.\nHonestly, Pagano was the best professor I could've taken to start off my english experiance here. He is super friendly and completely understanding, and he really cares about his students. At the end of every class, he asked us (and seemed concerned about ) whether we were enjoying class discussions.\nThe subject matter is interesting, and the reading list (Keats, Allende, Shelley, Tolkein) covers pretty much every point on the fantasy spectrum. The discussions are also in depth and fascinating, and really tie together the genre as a whole. The discussions seem a bit circular at times, but because the subject matter is so specific there is often no other real common threads to point out.\nOverall, he's a great professor teaching interesting things (to a bunch of first-years nonetheless). Don't sign up for this if you're not into fantasy literature- but if you get into this class, be excited! \nWorkload:\nPractically nothing. 3 essays which consitute your grade, and he happily grants extensions. Freewrites in the beginning, but not graded. Reading daily. \n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "May 18, 2013",
            "review_content": "\nI Cannot speak highly enough of Professor Pagano. He is not only brilliant, eloquent and a fabulous instructor, but he is kind and also extremely funny. He cares a lot about his students and makes an effort to get to know all of them intellectually and personally. He is very passionate about literature and it's wonderful to hear him speak about it. He also encourages participation and doesn't shoot down comments that are off. That being said, he is good at mediating discussion so that it stays on track. \n He went to Columbia and was pre-med for a while, so he COMPLETELY understands the grade anxiety thing and does his best to help you do well in his class.He is NOT a hard grader at all. I wrote one of the worst essays I have ever written in my life for him. For any other teacher it would have been a C. He gave it an A-. Also you are allowed to revise each essay for a better grade. if you don't come out of the class with some form of an B or an A, it's your own fault. Most people got As. \nHe is also VERY flexible with deadlines. \nJust an overall great guy. \nWorkload:\nSounds like a lot but once you get used to it isn't bad. \n-Weekly reading is heavy but you REALLY don't need to do it all. During midterms when stuff gets crazy this reading is the reading to blow off. Just have 1 comment to make in class and BS your way though...he doesn't care. \n-1 page freewrite posted to courseworks every week...can be done in 10 minutes. We\n-3 essays 5-7 pages, 1 final long essay. All graded easily and granted revisions. \n\n"
        },
        {
            "course_name": "The Enchanted Imagination",
            "review_date": "January 18, 2012",
            "review_content": "\nExcellent Teacher! Very approachable. Makes the class exciting. Always participate. Hand in you Free writes, they can only help you with your grade. Don't need to do the readings always to contribute to the class convo. I read maybe 4 articles/novels in full out of the 14 required. Got an A- in the class. \nClass Material Content: AMAZING! Imaginary things are the focus of this class. If your into Lord of the Rings TAKE THIS CLASS!\n\nWorkload:\nFree writes due every class. Required readings were a bitch to finish though. I'm talking 15 to 20 pages at the least. This class is an easy B at the VERY LEAST.... if u get anything below that then it's your fault... not Professor Pagano's. \n"
        },
        {
            "course_name": "The Enchanted Imagination",
            "review_date": "December 06, 2011",
            "review_content": "\nProfessor Pagano is a brilliant man.  He has a vast arsenal of quotes memorized that he uses in class frequently and his way of speaking is so interesting.  He really cares about the subject matter and his tattered copies of all the books just show his dedication to what he does.  My only criticism is that he will occasionally dismiss ideas that differ from his own.  No matter how much analysis you show him, he seems to place his specific standards before anything else.  I personally never had a problem with it, but I noticed how it affected other people in the class.  The syllabus he chooses is great - where else can you read Lord of the Rings for a class? - and I thoroughly enjoyed the new in-residence option because all the students in the class were in the same hallway in the dorms. Overall, I love and highly recommend Professor Pagano.\nWorkload:\nThree 3-5 page papers with very flexible prompts (and the option of writing a fantasy short story for the last one) and \"free-writes\" (page long, informal, just a collection of your thoughts/responses to what you're reading).  There are lots of works to get through, but you can get away with not reading some of them as long as you can contribute in discussion.\n"
        },
        {
            "course_name": "The Summons to Adventure",
            "review_date": "December 25, 2010",
            "review_content": "\nProf. Pagano is absolutely phenomenal. I actually took his class as a result of reading the reviews on CULPA, and they are absolutely true. He is passionate about the literature (actually, all literature in general), and has insights that really helped me to understand dense texts. I know I'm essentially re-hasing what others have said, but I believe that anyone can benefit from an experience with Prof Pagano and want to emphasize that. He even knew our names after the first class, and it's clear that he really cares about his students. He has an absurd knowledge of quotations from all sorts of literature and always finds some way to apply them to our discussion. It's very impressive. I absoultely recommend his class, regardless of your level of interest in fantasy/adventure-themed literature. I didn't have a particular interest prior to the class, but am now very glad I took it and had the chance to read the texts we did (Sir Gawain and the Green Knight, To the Lighthouse, Hamlet, The Rime of the Ancient Mariner, Alice in Wonderland, Lord of the Rings, Emily Dickinson poetry and so much more... truly quite the selection!) \nWorkload:\nLots of reading... two texts per week usually. 3 short essays and one long essay. In-class participation was important.\n"
        },
        {
            "course_name": "First-Year Seminar - Summons to Adventure",
            "review_date": "October 31, 2010",
            "review_content": "\nTake this class if you are really into the reading list (a lot of otherworldly-themed stories) because he is really passionate about the topic and you will be bored and have nothing to contribute if you are not as interested. He listens to everyones' opinions and throws in his deep sense of the reading when he thinks that the responses do not speak to the texts. The pace of the class is very fast with a lot of readings, but you can get away with not reading the texts completely. \nWorkload:\nWeekly free writes (nongraded single paged papers on the reading topic). Three 3-5 page papers, each with a rough draft due two weeks before the final to get comments from one peer and from the professor. One final paper 7-10 pages. \n"
        },
        {
            "course_name": "Seminar on Special Themes: The Enchanted Imagination",
            "review_date": "September 10, 2009",
            "review_content": "\nProfessor Pagano is a truly wonderful person and a great teacher. He appreciates every single student and whatever it is they have to say. The course itself is great even for people like me who are not obsessed with fantasy literature. Admittedly, I couldn't get through some of the denser works, but it is not the type of class in which you want to space out. Professor Pagano has some insights that are very inspiring, and there's always a lot of class discussion. I recommend this class for both people who love literature, and for those who are taking the class for general requirements. It is a fairly easy and very enjoyable ride.\nWorkload:\nLots of reading, of course, weekly free-writes (a casually-written page about how you felt about the reading), take-home midterm and final, usually with an alternate creative writing option\n"
        },
        {
            "course_name": "First-Year Seminar - Summons to Adventure",
            "review_date": "December 11, 2008",
            "review_content": "\nThe most influential and BRILLIANT professor I have ever had! He finds the perfect balance between revealing his own insights and leading a group discussion. He makes everyone feel comfortable, so participating is enjoyable, even for the shyest of Barnard students. The reading list is unusual for a first year seminar, but great (Lord of the Rings, Alice in Wonderland, Frankenstein, The Bacchae, etc). By far the best class of my freshman year. \nWorkload:\n3 short papers (3-5 pgs), 1 take home final paper (7-10), weekly readings, freewrites.\n"
        },
        {
            "course_name": "Seminar on Special Themes: The Enchanted Imagination",
            "review_date": "October 28, 2007",
            "review_content": "\nIf you have an opportunity to take a course with Pagano, do it...he's so funny and wonderful, and quite sharp. I wish I could take a lecture course with him rather than a seminar, because frankly, what he has to say is consistently twelve times more interesting than anything the students say. He honestly seemed to love this subject - fantasy, Romantic poetry, etc. - and his enthusiasm was, to be completely cliche, infectious. I laugh at least a few times in every class. He's the least pretentious professor I've met at Columbia or Barnard.\nWorkload:\nNot bad. Lots of reading, but he allowed three options for the midterm and the final: long paper, short paragraphs & short paper, or a piece of original fiction. It doesn't get more flexible than that.\n"
        },
        {
            "course_name": "The Enchanted Imagination",
            "review_date": "January 05, 2006",
            "review_content": "\nThis is a really wonderful class, and Prof. Pagano is just about one of the nicest people I've ever met.  I highly recommend that class, but just realize that it is a ton of reading and the class is almost completely discussion.  It is a seminar, and so that is understandable, but I would have liked to hear more from the professor and not from the other students who think they know everything about everything.  Pagano is a brilliant man, but I didn't hear enough of his insights.  \nWorkload:\nLots of reading; a take home midterm and final; free-writes every class.\n"
        },
        {
            "course_name": "First-Year Seminar - Summons to Adventure",
            "review_date": "June 01, 2005",
            "review_content": "\nAMAZING PROFESSOR! (and well-deserved gold nugget). It is no surprise that half of the freshmen class fights to get into this one seminar class.  Prof. Pagano is everything that one would hope for in an ideal college professor - extremely insightful, nice, and he truly does care about his students.  You will not be another face among hundreds of others....and as the last reviewer said, he will NOT forget you.  On the last day of class, he even gave us this speech about how we should not hesitate to go to him if we ever need anything in the future.  As far as the class is concerned, Prof. Pagano has this ability to just make any work of literature interesting.  Even works that I found dry when initially reading them on my own were suddenly brought to life through his class discussions.  He creates a very comfortable atmosphere where no one is really afraid to talk.  By the way, he has a tendency to call on the quiet ones as well....just to make sure they share their ideas.  As someone whose forte is not English, I have to admit that I really did enjoy this class.  I would recommend it and any other class that is taught by Prof. Pagano!  You will not regret it!\nWorkload:\n3 papers, 1 final paper, regular readings for each class accompanied by \"free responses\" and postings on the discussion board on courseworks\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "April 25, 2005",
            "review_content": "\nWhat a beautiful man. You know how there are professors that drive you crazy and wonder why you work so hard and still don't reap any reward. Well this professor makes you realize that there are indeed GREAT professors out there, and that there is more to college than just grades. To add icing to the cake, if you show him that you know how to write a structured analytical essay, you will get an A. Beware of explicating in essays, he assigns explications already for each class. The class time is when you get to analyze it with your fellow classmates and Prof. Pagano. We went over a lot in this class and Prof. Pagano adds his insight till the very end to tie everything together. Take this class. You will not regret it. If anything, just take a class with him. He truly cares for his students and will not forget you. In fact, I met him the other day and he reminded me to stay strong throughout finals. For those who think that professors don't care about their students and such and such, do yourselves a favor and take a class with him. You will be very glad you did.\nWorkload:\n3 papers, rewrites allowed, weekly explications of readings and participation is a big plus\n"
        },
        {
            "course_name": "The Enchanted Imagination, The Summons to Adventure",
            "review_date": "May 07, 2004",
            "review_content": "\nProfessor Pagano is one of the people that has defined my college experience. He is a gem in the English department (and also the Chair of the English Dept. over at Manhattan School of Music) who goes far beyond the traditional canon to open up the world of fantasy literature for his students. The material in these two courses ranges from writers in the canon like Blake, Keats, Shakespeare, Tennyson, and Coleridge, to Tolkien (one of his greatest passions), Carroll, Rushdie, Hoffmann, Allende, Hong Kingston, and many more.  He also goes beyond the written word to illustrations (Blake, Coleridge), and paintings (Turner, Friedrich). There was not a single piece of literature on his syllabi that I did not enjoy, and for the ones I did not immediately understand, his passion and patience coaxed meaning and (I mean it) wonder out of them.\n     Professor Pagano really cares about his students, and this is as evident as his love for the literature he teaches.  He also encourages creativity; for a few of my freewrites I wrote poems- and was not reproved but commended.  He also makes himself very available outside of class, to talk about issues both related to or not related to the material. I took Professor Pagano's classes both semesters of last year and I still keep in touch with him.  He is not to be missed.\nWorkload:\nnormal: class participation is important, freewrites, 2 medium-length papers or a paper and a takehome final.\n"
        },
        {
            "course_name": "The Summons to Adventure",
            "review_date": "April 05, 2004",
            "review_content": "\nBest professor in the English Dept., hands down. He went to Columbia, and the summer before his senior year he read The Lord of the Rings and decided med school just wasn't happening. He became an English major, and fell in love with fantasy, magical realism, fable, myth, and Romanticism. He quotes passages without opening the book, and feels personally let down and disappointed if you don't love his books as much as he does (but he'll never say so).\nHe's thoughtful, kind, and genuinely interested in what you have to say.  He unfortunately is a little too interested, and puts up with a lot of silly opinions from students in his class. Classes included reading Tolkein aloud on the lawn. His analysis of the literature is precise, fascinating, and inspiring, and he will make you love it, too.\nI'm a Junior English major, and half the reason I am is because of Pagano.\nTake a class with him before you graduate. This is what you wanted when you came to college, right? To be inspired?\nWorkload:\nA midterm and final paper, both 8-10 pgs, but he is a very lenient grader, and really is just looking for you to be creative, with less emphasis on being \"right.\" Weekly responses which you can or can't do, it's up to you, he doesn't grade them, but they are useful for class discussion. If you feel you can't turn something in on time, just tell him about it--he admits he'd much rather wait a week and get a good paper than have you hand in crap.\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "May 21, 2003",
            "review_content": "\nGreat teacher!  Very enthusiastic, understanding, and approachable.  He really enjoys teaching his classes and it shows.  Although sometime his love for literature may be a bit scary for those of us who don't share the same passion, his courses are worth taking.  One of (if not the) best English professors I had at Barnard.\nWorkload:\nUsually take-home midterms and finals, not difficult to complete.  As long as you read the material and can convey what you think about each word in coherent sentences you should be fine.\n"
        },
        {
            "course_name": "First-Year Seminar",
            "review_date": "September 05, 2002",
            "review_content": "\nAWESOME PROFESSOR! Of all of the professors that I interacted with, Prof. Pagano was the first to live up to the ideal of the college professor. He is passionate about his subject (and even a bit eccentric, in a good way), but he is more interested in his students developing their own academic identities than about preaching his own position. He will get to know you on a more personal level, if you are interested, and he will notice if you are missing and express genuine concern. Also, he's flexible and understanding if you are having problems balancing your workloads. He's great! And he uses fantastically interesting material.\nWorkload:\nVery reasonable. But watch out! As he's an English professor, you may find yourself writing a bit more in this seminar than you would in another course.\n"
        },
        {
            "course_name": "First Year Seminar",
            "review_date": "April 04, 2002",
            "review_content": "\nI really liked Prof. Pagano's class. He really cares about what you have to say and is usually great about keeping a conversation going. If you love analyzing literature but hate professors telling you you're worng all the time - this is the class for you. If you are not and English buff and don't like contributing in classroom discussions - beware - Prof. Pagano has a tendency to call on the people who never speak in class. (But that's fine because whatever you say he listens to and respects as your opinion). He will learn you're name and notice when you are abscent. Over all - it was my most enjoyable class this semester!!\nWorkload:\nNot bad - 3 short papers and one \"long\" ten page paper with some research. He is a fair grader and is easy to meet with and sometimes flezxible with due dates.\n"
        },
        {
            "course_name": "The Enchanted Imagination",
            "review_date": "January 17, 2002",
            "review_content": "\nProfessor Pagano is a great professor who really cares about the student and his subject. He tries to keep his class small (so register early) so as to foster in depth discussions of all of the works on the syllabus and he does a great job of eliciting responses from even the most reluctant student. He has an amazing syllabus for his subject, which includes among other works, Frankenstein, The Lord of the Rings trilogy, and numerous classic childhood fairy tales and stories which are dissected in a completely new light. Professor Pagano is dedicated to his subject and to the students understanding of it. He is not interested in hearing his own opinions shot back at him, but rather that the student come up with creative and new responses to the texts. You will do well in this class if you go and participate in class discussions, he will notice if you are missing from class often. But the upside is that his class is a pleasure to attend and I found it even relaxing as well as interesting. \nWorkload:\nHe asks for optional freewrite responses about once every 1-2 weeks, but you can do them less frequently or not at all, as they are not graded. The reading load is not very heavy until you get to the end of the semester with the Lord of the Rings, which can be a struggle. However, his midterm and final both are take home consisting of short answers and a 3 page essay , and he gives you a lot of choices, so you can skip some works and still get an A. He is a very lenient grader especially because all he grades are the midterm and final which are based mainly on ones own interpretation of the material. \n"
        }
    ]
}