{
    "prof_info": [
        {
            "prof_name": "George Deodatis",
            "prof_id": 1555,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Mechanics of Solids",
            "review_date": "January 05, 2011",
            "review_content": "\nDeodatis is the king of clarity. He is the best teacher I've ever had at CU. In lecture, he organizes his blackboards with superb readability and logical layout. He emphasizes important points verbally and with body language. He doesn't skip \"obvious\" steps in examples. The first portion of the class was a statics review, and you're never directly tested on that material. He literally tells you 5/6ths of what is on the final. Late homeworks are not penalized at all. You can use an old edition of the textbook with no problems. You should go to the ends of the earth to take this class from Deodatis. \nWorkload:\nWeekly problem sets. Some quite easy, a bit tougher toward the end. Almost all problems from book.\n1 Midterm. No direct statics questions. Most test problems drawn from the two HW's immediately preceding the test\nFinal: He tells you what's on it. \n"
        },
        {
            "course_name": "The Art of Structural Design",
            "review_date": "May 14, 2009",
            "review_content": "\nDeodatis is very endearing; he is one of the best professors you'll ever have at Columbia. He is very passionate about what he teaches and has a great sense of humor. He really cares about his students and will explain things to you as much as you want if you don't understand something. He is very approachable even outside of office hours. He doesn't really care about late homeworks but he gives your a lot of time to do them.\nHe's a great lecturer and worth coming to all his classes.\nWorkload:\nSix assignments: all given a week+ before they're due, the first assignment was given two weeks before it was do. They're really basic and he usually does extremely similar things in class. Unlike other classes you take as an engineer, there's ONE midterm. The final is very easy if you went to all the lectures.\n"
        },
        {
            "course_name": "Design of Bridges, Buildings, and Spacecraft",
            "review_date": "May 17, 2003",
            "review_content": "\nGeorge Deodatis is the friendliest, most helpful professor ever.  He has absolutely no professorial ego, and will explain things till he's blue in the face.  He is always open for questions in his office, whether it's office hours or not, and if you don't have the homework prepared for class, that's fine with him - hand it in when you have it done.  When I was having trouble with a homework and presumptuously called the guy, he even called me back and left a message.  He gets the \"above and beyond the call of duty\" award in my book.\nDeodatis is a good lecturer, even if the material is a bit dry.  He speaks very precisely and organizes his talks in a way that helps note-taking.  His greek accent is \"cute\", nothing that makes your life difficult.\nWorkload:\n10 hwks throughout the term (fairly easy for those decent at physics), including 2 based off observational labs.  Midterm (easy), Final (medium).  2nd half of semester is dominated by guest lectures whose presentations are not on the final.\n"
        },
        {
            "course_name": "Structural Analysis",
            "review_date": "April 16, 2003",
            "review_content": "\nA great professor in all respects. His notes are very clear, he is very much in charge of every lecture, and makes the material stick in your mind. Very humane: wouldn't give the midterm the Monday after spring break \"because it wouldn't be a real vacation.\" Suggest plenty of good outside reading and relevant museum lectures, if you're into that kind of thing. There really is nothing to critisize! Prof. Deodatis is not merely approacheable, he seems eager to help you any time anything isn't clear. You would have to put effort in being confused about the material after he has explained it to you. \nWorkload:\nStandard. Weekly problem sets from the textbook that can easily be done using class notes and are often given extensions on.\n"
        }
    ]
}