{
    "prof_info": [
        {
            "prof_name": "Anna Ratner",
            "prof_id": 3933,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "September 07, 2011",
            "review_content": "\nAnna was the best combination of sweet and intellectually stimulating. I highly recommend taking her class; all you have to do is show up to class and engage in discussion here and there. She really encourages you to use your own vocabulary while making observations on various pieces. While she has plenty to say about any single piece throughout the course, she moves things along at a good pace. Her personality keeps the course from becoming a monotonous art history slide show.\nWorkload:\n2 papers, take home midterm, final (for our class we all agreed to hold a review outside of class and she bought us all pizza for it)\nYou have to try to get a bad grade\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 25, 2011",
            "review_content": "\nDuring my time at Columbia, I have noticed that there is a large portion of the student body that thinks it is ok to show up to a class 10-15 minutes late. If you are one of these people, DO NOT take a class with Anna. She gets sincerely upset with people who do this.\nOtherwise, I cannot recommend her highly enough. Her classes were some of the most interesting I have had here, and I left it with a real appreciation of art I did not have coming in. \nShe doesn't waste your time with meaningless readings. She only assigns something outside of class if it is actually important. She runs a great class and expects total participation. Moreover, she meets with everyone before handing in papers. Great Class.\nWorkload:\nTwo Papers (Second one also includes an in class presentation)\nTake Home Midterm\nIn Class Final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 16, 2011",
            "review_content": "\nAnna is an AMAZING art hum teacher. For her, the point of the class is to get you to be able to look at art and think intelligently about it.  There is absolutely no memorizing in terms of dates, artists names (and spellings) or titles of works for any of the tests. \nShe calls on people in class to get everyone to participate and always finds a way to make your comment seem relevant.  She's also super responsive to emails and goes out of her way to make time to talk to students about their papers/whatever.\n\nWorkload:\n2 papers (both require museum visits) 5 pages each. Take home final (about 5 days to do it) and in class final.  No required readings.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 02, 2011",
            "review_content": "\nAnna loves (and knows) her stuff. It's really refreshing. Although she calls people out in class, she never makes anyone feel bad if they have nothing much to say.\nShe was extremely open to communication and would basically break her back to meet up with you and make sure everything is taken care of e.g. 1-on-1 essay help, micro-managing everyone to meet at the Museum, holding a review session dinner in EC, etc). She's a sweetheart.\nWorkload:\n2 papers (1 difficult), take-home midterm, in-class final. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "September 16, 2010",
            "review_content": "\nArt hum with Anna was a lot of fun.  This was a summer session course so each class was about two hours and could drag at the end, but she managed to keep it pretty interesting.  \nShe worked hard to engage everyone regularly, which was both good and bad.  Good in that she's probably supposed to try and get everyone to participate, but bad because several people in the class really didn't have anything interesting to say.  Overall she managed to steer things into a lot of interesting conversations, and seemed to genuinely enjoy when we came up with interesting ideas.  Several times we threw out ideas and she said that she hadn't seen things that way before but liked the idea.\nThere were two papers, and she was willing to read drafts and give feedback/edits before they were due.  I sent two drafts of the first paper and she turned them around in 48 hours which got me an A.  She also marked up the draft I sent her of my second paper within 2 days.\nOverall she was enthusiastic, approachable, and genuinely loved to be teaching the material.\nWorkload:\n2 papers (~5pg) -- 2nd paper included in class presentation\n1 take-home midterm\n1 in-class final.\n"
        }
    ]
}