{
    "prof_info": [
        {
            "prof_name": "Wendi Adamek",
            "prof_id": 1104,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Daoism",
            "review_date": "October 18, 2006",
            "review_content": "\nwhile it's true that prof. adamek is not a barn-burner of a lecturer, what the above reviewers are picking up on is that she is simply not a show(wo)man.  she gives the class the information they need, simply and with impressive understanding of a complicated topic.\nthe tenor of this course was consonant with all of my previous experience, that is to say: the engagement of the students with the material and the instructor has everything to do with the quality of the course and instruction.  it may be true that my classmates (and i) tend to go off on slight tangents, and we make many jokes (it's a small class and weird material, so it encourages more informal behavior) prof. adamek should be lauded for joking right along with us and facilitating very interesting class discussion.\ni hate it when a prof. will accept anything a student says for the sake of debate in a class.  prof. adamek pulls off a neat tight rope act when she both encourages class discussion but does not have any compunctions with telling a student if he/she is off base.  i know it happened to me, and i appreciated it.\ntake prof adamek's class.  in the afternoon, it's easier to stay awake i guess.  or if you like learning.\nWorkload:\na lot of reading.  midterm, final, final paper with a draft due early november.\n"
        },
        {
            "course_name": "Self and Society in Asian Religion",
            "review_date": "January 06, 2004",
            "review_content": "\nProfessor Adamek asked for \"no personal attacks\" on our professor evaluations, but unfortunately the bad points of this class have to do with her.  She's actually a really nice person, its not her fault.  As a previous reviewer said, she warns you on the first day of class that she is a boring prof.  I, along with many others, figured she was trying to scare off the wimps.  But no, this really was the most boring class I have taken at Columbia.  Prof. Adamek has this soothing, soft-spoken quality to her voice that honestly puts you to sleep.  REally.  I had never fallen asleep in class, before this one.  Additionally, her lectures lack structure and the handouts don't help.  While studying for the final, I realized how interesting much of the material really is, but throughout the semester I found it hard to motivate myself to do much of the reading because her lectures made me associate \"Asian Religion\" with \"Boredom\".  The primary sources are great.  TA's are a good resource.  Ironically, Columbia has removed this class from the possible courses to fulfill the MC requirement.  Good call.\nWorkload:\nabout 150 pp of reading a week, 2 3-4 page papers with an option to rewrite one, midterm, final.  They have the right (according to the syllabus), to alter the weight of the final (NOT in your favor) if you do worse than the rest of your grades indicate you should have done.  \n"
        },
        {
            "course_name": "Self and Society in Asian Religion",
            "review_date": "September 07, 2003",
            "review_content": "\nAdemek prefaces the first class by asserting that she isn't an especially exciting or captivating lecturer, and she's exactly right.  She goes on to say she's received a lot of criticism from students because she reads directly from her lecture notes, but she explains that this is the only way she can lecture and \"will go down fighting\" for her right to deliver her lectures verbatum from her notes.  Her lectures are terrible.  She goes on in a monotone voice for an hour and 15 minutes.  In addition to her lectures being boring as hell, they're also pretty incoherent.  After the second lecture had concluded, I had no idea what topic it was on, as she had failed to mention what religious traditions the texts we had read pertain to.  She's the worst professor I've had in 4 years at this college, but at least she know's she's bad and warns you in advance.\nWorkload:\nWeekly section meetings, two 3-5 page papers, midterm and final exam.  The sylabus says that she reserves the right to recalculate your entire grade if your grade on the final exam is lower than the rest of your average. \n"
        },
        {
            "course_name": "Introduction to Asian Religions",
            "review_date": "May 12, 2002",
            "review_content": "\nAdamek specializes in the chinese section of this class. While some reviewers say her indian counter-part, Jack Hawley, was hard to understand(I think he was awesome, by the way), at least he was entertaining and easy to listen to. Adamek was neither informative nor easy to listen to. Reads lectures VERY softly off of a typed-up speech with little inflection or change in her voice. The subject matter she chooses to discuss was hard to follow. I ended up with little understanding of what she was trying to get across, other than when the Zhou empire was in relation to some other empire, which while important, didn't directly give me what I wanted from a religion class. The TA's were a life saver - if you have her for the intro class pick a good TA. I wouldn't take a class that was just her lecturing without a co-professor. Despite the fact that I was SURE she was giving me \"the eye\" during her lectures, when I ran into her in the religion office she didn't even give me a once-over. So much for that.\nWorkload:\na few short papers on the texts. The primary source texts (those actually by asians who practice the religion) were fascinating. the secondary texts, by middle aged white guys, were awful, but there's only one or two of them.\n"
        }
    ]
}