{
    "prof_info": [
        {
            "prof_name": "Michael Rebell",
            "prof_id": 1726,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Comprehensive Educational Opportunities",
            "review_date": "January 10, 2014",
            "review_content": "\nThe materials of this class can be read at home and your understanding of the whole course can be done in just a couple of hours. Professor Rebell might be a well-known scholar in his field, but as a professor, he is not that good at all. His class is often boring, and he lectures all the time. He asks a couple of questions to get students involved, but tries to hard. The class is huge, and you think studying education law would be interesting. Actually it's not. It's not in the least intellectually stimulating. You can get it all by reading what's on the website of Harlem Children's Zone, or Say Yes, Syracuse. Don't waste your time taking this class.\nWorkload:\nThe textbook, a poorly photocopied compilation of outdated articles on educational opportunities ( technically it's just wrap-around services), is sold for 116 dollars. The school makes a huge profit on that. Some of the readings are interesting, but there's no exciting class discussion at all. All you have to do for the class is to read and go sit in class and hear what he says, then go. There's one mid-term paper and one final, which basically draws on your knowledge and research on this topic, which is not much to cover. You just have to do enough reading and that's it.\n"
        },
        {
            "course_name": "Judicial review_content and Educational Reform",
            "review_date": "August 31, 2003",
            "review_content": "\nThis class is taught by a man who has worked for many years in the field of special education law.  He is very into Judicial activism, so it is taught from that perspective.  Knowing that, he does attempt to be open to students who disagree and he is not self-righteous.  It was a worthwhile class, but at times he put me to sleep.  I could have read it all on my own and gotten the same thing out of it.\nWorkload:\nReading is doable, but complicated and very technical.  The midterm is take home and the final is open book or you can just right a paper.  He is a moderate grader.  Figure if you put in a decent about of effort a B+ is doable.\n"
        }
    ]
}