{
    "prof_info": [
        {
            "prof_name": "Rosalind Rosenberg",
            "prof_id": 101,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "American Women in the 20th Century",
            "review_date": "March 29, 2010",
            "review_content": "\nProfessor Rosenberg is stylin'.  There is a black skirt of hers that I *covet*.  (And her boots!  She has damn good taste in boots.)\nOh, right, scholarship.  This is very much an intro course -- I would class it as a 1000-level rather than a 3000-level -- and holds exactly zero surprises for anyone with a decent grounding in Second Wave feminism.  But it rocks at intersectionality -- black women!  Latina women!  Asian women! -- which gets it major points.  One thing that I am not sure I like is how front-and-center Prof. Rosenberg's personal obsessions are: her discussion of higher education and women is 90% about the process of founding Barnard College and making Columbia College co-ed, for example, or the entire class session about Pauli Murray, mostly because Rosenberg was writing a biography of her at the time.  On the one hand, it was totally fascinating to find out about the insanity of the Columbia board of trustees and their blatant, blatant misogyny in the C.19.  On the other, I swear to god there were other things going on which might actually be relevant to this history of -- what was that phrase, oh, I know: American women in the twentieth century, rather than a single isolated data point.\nThe TA I had was totally useless, and discussion sections were painful and stupid, but that's the nature of the beast.\nWorkload:\nNo midterm, a 2-page document analysis that gets turned into a five-page and then an eight-page research paper.  Final.The reading is skippable.\n"
        },
        {
            "course_name": "Women & Leadership",
            "review_date": "December 22, 2009",
            "review_content": "\nTake this class. I don't care if you're a Women's Studies major or a Chemistry major, if you're a die-hard feminist or hate the word-- just take this class. It will change the way you look at the world. Professor Rosenberg is a brilliant scholar and one of the most genuine, thoughtful, and caring professors I have ever had. She'll respond to emails at 1 am, meet you at any time of day, help you endlessly on the assignments, basically do anything because she so loves teaching and wants young women to understand how gender influences our society. The work is a pleasure to do, completely reasonable and fascinating stuff. I could have P/D/F-ed this class, but I was fell in love with the material and the research that I just wanted to keep going. Barnard is so lucky to have Prof Rosenberg here-- do not graduate without taking a class with her!\nWorkload:\nmanageable for a seminar-- 1 book plus an article or so a week, courseworks postings that are leniently graded, 1 4-5 pg paper, lead a class discussion with another person once during the semester, final 15 pg research paper with much guidance given by Prof Rosenberg\n"
        },
        {
            "course_name": "Women & Leadership",
            "review_date": "December 15, 2009",
            "review_content": "\nThis is the only class this semester where I was excited to write my paper, do the readings, and come to class.  I spent hours researching my paper because I was so interested in the topic.  I certainly did not need to spend this much time, but I wanted to.  Professor Rosenberg is not the type of professor to whom you can turn in a half-ass essay and feel ok about it.  You want her to like your paper so much that you do your absolute best work.  I must emphasize that unlike other classes, the amount of work I put into this class had nothing to do with the grade I wanted to get.  My work was purely because I was interested in the subject matter and wanted to do a good job because I was so stimulated by the course.  I love that when you're done with a Professor Rosenberg class you really feel like you have grasped the subject in full.  Most classes are broad, but Professor Rosenberg makes you understand the subject matter in a deep way and significantly improves your analytical skills.  \nTake this class or any class with Professor Rosenberg, she is probably the best professor at Barnard. \nWorkload:\nOne book and an article a week (probably up 300-400 pages a week), one critical response paper on one of the readings (3-4 pages) and one 10-15 page final research paper.\n"
        },
        {
            "course_name": "American Women in the 20th Century",
            "review_date": "January 29, 2009",
            "review_content": "\nI realize that Professor Rosenberg is not really in need of another wonderful review, but, honestly, she deserves it. This class was easily one of the best that I have taken in my life. Let's start with the subject matter...\nYou may think that you understand American History and the role that women have played in it, but, if you take this class, you will quickly realize how much there is to learn. The information taught is not only interesting - it is relevant. You will learn things that apply to your every day life, you will be outraged at comments made and laws passed (some of which remain unresolved), you will learn about the history of Barnard and of Columbia, and, perhaps most importantly, you will learn to think (and write) like a true student of history.\nThis is not to say, however, that the class is perfect. There is a lot of reading and, though most of it is interesting, lectures are not based on the reading and it is never discussed. Professor Rosenberg does not forbid discussion, but her lectures are clearly well planned and she does not really welcome it. That is not to say that you can't ask questions, though! And discussions do happen, just perhaps not as often as would be ideal.\nOkay, now on to what makes this class exceptional, rather than just great...Professor Rosenberg is truly an inspiration. She is brimming with knowledge, clear and well spoken, kind, and personable. She is very flexible and will meet you if you can't make her office hours and I never had to wait longer than a few hours for a response to an email. She understands the needs of students and the demands that are placed upon them, often encouraging you to relax if you seem to be too stressed. I know that some did not find her as approachable as others, perhaps because she is not an easy teacher. This class is not about getting an easy A, though an A is certainly an achievable grade, but about learning. She will push you, in your final paper, to form a sophisticated argument. If you are dedicated and interested, you will reap the benefits of a teacher whom I believe to be one of the gems of Barnard.\nWorkload:\nReading varies from week to week, but I would not call this a class with light reading. Not as excessive as some (and most of it is very interesting!), but it's not a breeze, either. There are three graded papers for this class, though each paper also requires a first draft which is not graded but given to the writing fellows. The papers build on each other, and, thus, you really only write on one topic the whole semester. Meeting with a writing fellow about each paper is a required component of the class and, though you may not get much out of these meetings, they are painless. Also, each revision does allow you to build on your argument and meet with Professor Rosenberg if things don't make sense. There is also a final, which is pretty difficult. But, once again, go to class, work hard, do the reading, and you'll be fine.\n"
        },
        {
            "course_name": "American Women in the 20th Century",
            "review_date": "January 02, 2009",
            "review_content": "\nFantastic class! Professor Rosenberg is not only overflowing with knowledge about modern U.S. women's history, but is also adept at presenting the information in an engaging and thoughtful manner. Lectures are packed with information that I think most students in the class would find relevant and interesting, like the evolution of women's education at Barnard. Take anything you can with this professor!\nWorkload:\n3 papers that gradually increase in length, final\n"
        },
        {
            "course_name": "American Civilization Since the Civil War",
            "review_date": "May 18, 2007",
            "review_content": "\nJust to add to the one other review of Rosenberg teaching this course...\nShe's amazing.  The class is a fairly easy survey course, and you could probably skip the whole semester (other than the discussions where they take attendance), but you wouldn't want to.  Rosenberg is thoroughly engaging.  I _loved_ coming to class to hear her lecture.  She tries to make it entertaining, citing examples of famous music and art from the particular era/decade.  Rosenberg gets a gold star for managing to involve the class with her questions during the lectures (no small feat when there are well over 100 people in the room).  Lastly, she puts all of her lecture notes online, so if you do have to miss a class, they're a pretty thorough substitute (between 6 and 30 pages per week).  She happily makes time for every student, even if you don't have her for a discussion.  I would definitely try to take this class!\nWorkload:\n3 short (4-5pg) papers, all of which require rough drafts, and a final exam with about 10 ids, 3 document ids and two essays.\n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "May 13, 2005",
            "review_content": "\nProfessor Rosenberg is one of the nicest professors I've ever had.  She genuinely cares about her students, she's very laid back and understanding about due dates and course requirements, and very flexible in almost every way.  The first few cases we did, I don't think she was really in the swing of things, and I think she wasn't as well versed in them as I would have liked, however once we got past the first few weeks, she was great.  I should also say that she is very willing to accept ideas contrary to her own.  I wrote an essay very critical of a book that was in her field, and she said it was a little harsh, but graded it completely fairly--that's hard to find at Columbia/Barnard.  In short, this is a great history seminar, and the paper is what you make of it.\nWorkload:\nBriefs for every case we read--these take like 5 minutes each once you've read the case, one book a week, one 5 page paper that critiques one of the books, and one 12-15 page seminar paper, for which you have like 5 weeks of nothing else... really not bad at all.\n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "April 26, 2005",
            "review_content": "\nProf. Rosenberg is amazing.  She is genuinely interested in her students well-being and makes sure she gets to know each of them personally.  She also runs a great class.  She knows how to direct discussion and clarify all the important issues.  Furthermore, this class is great because it is divided up between coursework and year end papers.  For the last 3-4 weeks of the semester you dont have to do anything but your term paper-- which relieves a lot of stress.  I strongly recommend this class, its not only enjoyable but very informative as well.\nWorkload:\none 4 pg paper and a 12-15 pg term paper.  Weekly briefs on supreme court case decisions to be handed in, and a book a week to be discussed in class.  Must participate in a few moot courts, but they are very informal.  Typical seminar.  \n"
        },
        {
            "course_name": "American Women in the 20th Century",
            "review_date": "January 15, 2002",
            "review_content": "\n\nWorkload:\nOne 1 pg document analysis, one 3-5 pg. paper expanding on the document, a 5-7 pg. paper. No midterm, one final. Length of readings varies from week to week. After a certain point, you realize which readings are important and which ones you can sort of skim. Grading depends on your TA.\n"
        },
        {
            "course_name": "American Women in the 20th Century",
            "review_date": "December 16, 2001",
            "review_content": "\nProfessor Rosenberg is an extremely intelligent and compassionate person. Her brain is overflowing with knowledge, and some of it starts to spill out in the form of her talking on and on in class. Lectures are interesting, as long as you have had your coffee -- she has a very motherly sounding voice that can lull you into a doze if you aren't careful. The material ranges from fascinating to boring, and Rosenberg is very careful about being objective in this class -- you'll read about all different perspectives of feminism and you're not expected to write \"womyn\" in your papers. In other words, you don't have to be a member of NOW in order to enjoy this class ... although after taking it, you might decide to join.\nWorkload:\nA one-page document analysis and two 4-6 page research papers. Very managable. There is a lot of reading, which is hunky-dory when the material is interesting, but sometimes it's a bit of a drag.\n"
        },
        {
            "course_name": "American Women in the 20th Century",
            "review_date": "December 16, 2001",
            "review_content": "\nProfessor Rosenberg is an extremely intelligent and compassionate person. Her brain is overflowing with knowledge, and some of it starts to spill out in the form of her talking on and on in class. Lectures are interesting, as long as you have had your coffee -- she has a very motherly sounding voice that can lull you into a doze if you aren't careful. The material ranges from fascinating to boring, and Rosenberg is very careful about being objective in this class -- you'll read about all different perspectives of feminism and you're not expected to write \"womyn\" in your papers. In other words, you don't have to be a member of NOW in order to enjoy this class ... although after taking it, you might decide to join.\nWorkload:\nA one-page document analysis and two 4-6 page research papers. Very managable. There is a lot of reading, which is hunky-dory when the material is interesting, but sometimes it's a bit of a drag.\n"
        },
        {
            "course_name": "Survey of American Civilization since the Civil War",
            "review_date": "December 31, 1999",
            "review_content": "\nA good class and very good teacher. This is a wonderful introductory course to United States history and to history as a discipline. Not too difficult either.\nWorkload:\n3 papers, final.\n"
        },
        {
            "course_name": "The United States 1940-1975",
            "review_date": "December 31, 1999",
            "review_content": "\nAn excellent introduction to progressive constitutional law and the role of the 14th Amendment in expanding (and often supressing) civil rights in the US. Rosenberg is a wonderful resource and a caring professor who gets to know her students individually.\n"
        },
        {
            "course_name": "American Women in the 20th Century",
            "review_date": "December 31, 1999",
            "review_content": "\nThis course covered Immigrants, Suffragettes, the Roaring 20's, WWII and the women at home, women's lib, NOW, and the anti-feminist backlash. Rosenberg is kind and intellegent and very approachable. She always incorporated all types of media - the web, videos, photos etc. There were also some trips to museums, for example, the tenement museum on the lower east side. The course is discussion format, and as such it is really hard to get into. You have to apply early. But it is worth it - Rosenberg gives you the other half of history, and you'll come back for more.\nWorkload:\nVery fair, about one book a week, but she was also really nice about extensions and things like that if the class expressed exasperation. Midterm was paper or test. Final paper and Final exam. Papers were about 7-10 pages.\n"
        }
    ]
}