{
    "prof_info": [
        {
            "prof_name": "Eliza Woo",
            "prof_id": 4193,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "October 15, 2009",
            "review_content": "\nEliza is a down-to-Earth person that knows what she's talking about. She's pretty young which is great cause she connects so easily with the students in her class. Frontiers of Science may be boring as a whole, but she really tries to make it refreshing and keep us focused on the topics. She's extremely helpful when you have a question and she makes sure that you understand the concept before moving on.\nWorkload:\nThree question quiz every week (easy), multi-page ditto due at the beginning of each class, and minimal readings\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 27, 2009",
            "review_content": "\nEliza's an awesome professor. She's young and she likes to joke around. Great personality. For FoS discussion, it isn't that hard to sit through. She's really good at explaining and clearing things up.\nCompared to other section leaders, she may be a little \"tougher\". She's a harsher grade on the assignments, but it's relative because it is curved. Plus, she's easily accessible - shoot her an e-mail and she'll get right back to you.\nGrade - Do well on homework assignments, midterm, and final. That's really it.\nEliza's a fun prof and you'll learn some stuff in the process. Groovy\nWorkload:\nStandard one assignment a week takes about 2 hours, plus a couple of readings.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 27, 2008",
            "review_content": "\nShe made the class fun.  If you seek out extra help from her, she'll be happy to give it and will be impressed that you took the time to ask for the help.  \nI like her a lot!  She's young, and I could relate to her... I actually liked her as a person, not just a professor.   \nWorkload:\none assignment a week-- takes about 2 hours.  GO TO THE HELP ROOM!\n"
        }
    ]
}