{
    "prof_info": [
        {
            "prof_name": "Robert Barnett",
            "prof_id": 3361,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Culture & Art in Comtemprary TIbet",
            "review_date": "January 17, 2014",
            "review_content": "\nProf. Barnett is probably one of the best professors I've had at Columbia. His class was tiny, and his soft voice can sometimes be a bit soothing to nod off to, but the stuff he says is so fascinating, his analysis so sharp, and his passion so deep that it's hard to fall asleep in his class at all.\nReadings were average for a grad-level course, as was the workload, but he does expect his students to do very good research. I think he's a bit more lenient on the grading, since I pulled off an A, although I did all the work and went to every class. \nHe also takes advantage of all the cultural opportunities in New York concerning Tibet, which was really cool. He hosts talks with high-level lamas, we went to movie screenings, dance performances, etc. It's amazing to be in such close contact with a scholar of his caliber.\nOh, also, he's THE scholar of Tibet in the US. Started the Tibet program at Columbia, and made the first PhD in Tibetan Studies happen. \nIf you're at all interested in Tibet, you need to take a course with Robbie.\nFinally: he only has a BA, and is a very good stilt walker, clown, circus performer, and puppeteer. Ask him about that, it's fascinating. \nRobbie is also the most caring professor I've had, and goes way out of his way to meet with, discuss things at length with, and just hang out with his students. \nWorkload:\nAverage for a grad seminar, not an easy A, but definitely possible. Many (sometimes very dense) readings, mid term and final papers (heavy on the research), but overall manageable and also very rewarding. \n"
        },
        {
            "course_name": "Culture & Art in Comtemprary TIbet",
            "review_date": "May 12, 2011",
            "review_content": "\nMost dedicated instructor I have had the pleasure of taking a class with. Prof. Barnett is an world-renowned expert in his field and, in my opinion, one of the best kept secrets at Columbia. I am shocked that he manages to have classes that are so small and students aren't flocking to his classes. Seriously, he is not only extremely knowledgeable about what he teaches, but he truly wants his students to grow and if you want more information about certain topics, he will do all he can to help you. Do NOT, however, expect to get an A. He sent us a document that said students would receive an A only if their papers were of a publishable quality. Overall though, totally worth it. Best class and best prof. I have had (and I'm not even an EALAC major!)\nWorkload:\nStandard readings. One reading note per week. One presentation per student (ppt). Midterm paper. Final Paper. Easy to get a B/B+, VERY HARD to get an A-range grade.\n"
        },
        {
            "course_name": "Culture & Art in Comtemprary TIbet",
            "review_date": "May 12, 2011",
            "review_content": "\nMost dedicated instructor I have had the pleasure of taking a class with. Prof. Barnett is an world-renowned expert in his field and, in my opinion, one of the best kept secrets at Columbia. I am shocked that he manages to have classes that are so small and students aren't flocking to his classes. Seriously, he is not only extremely knowledgeable about what he teaches, but he truly wants his students to grow and if you want more information about certain topics, he will do all he can to help you. Do NOT, however, expect to get an A. He sent us a document that said students would receive an A only if their papers were of a publishable quality. Overall though, totally worth it. Best class and best prof. I have had (and I'm not even an EALAC major!)\nWorkload:\nStandard readings. One reading note per week. One presentation per student (ppt). Midterm paper. Final Paper. Easy to get a B/B+, VERY HARD to get an A-range grade.\n"
        }
    ]
}