{
    "prof_info": [
        {
            "prof_name": "Paola Nastri",
            "prof_id": 1286,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Intensive Intermediate Italian (I and II) ",
            "review_date": "May 05, 2009",
            "review_content": "\nI love Paola! She is an incredible teacher. She was able to have us go deep into the study of italian grammar and style without being a bore. This class is two hours long but definitely not painful. She is also a classy dresser and inquires into what we do on the weekends and how we are coping with all our classes. And if she gives too much homework, we can say so, and she will cut down the load! Her tests every other Wednesday can be tricky though, and she anything but a lax grader. You really have to study. Take this class!  \nWorkload:\nUsually a few exercises in grammar, some sort of reading and sort sort of writing. Every once in a while (I think 5 or so total) we had 350 word writing assignment. No biggie. \n"
        },
        {
            "course_name": "Intensive Intermediate Italian (I and II) ",
            "review_date": "September 02, 2008",
            "review_content": "\ntake this class! i love this woman. she is passionate and gets on your case if you slip so you get into it. she is very nice but very serious about hw and being late to class so be careful with that. but you will learn alot in a semester with her\n\nWorkload:\ntypical italian classes- in class participation, papers every now and then i think 5 over all and midterm and final \n"
        },
        {
            "course_name": "Intensive Intermediate Italian (I and II) ",
            "review_date": "December 02, 2007",
            "review_content": "\nPaola's energy and passion for educating made teaching a full year of Italian grammar in one semester fun. She never hesitated to answer a question or try to better understand a question. She clearly put a lot into teaching. Aside from the typically boring grammar exercises and often dry class readings we watched two great movies and discussed them. \nShe always went out of her way to present the material as clearly as possible to each student. Her grading was very fair and the class went along at a steady pace. She also never spoke english. I would highly recommend taking this class.\nWorkload:\n4 not so hard quizes, Midterm, Final, weekly compositions that are kind of annoying, and daily homework - all graded very fairly.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "May 26, 2005",
            "review_content": "\nI still haven't had a bad Italian teacher, Paola kept things interesting, didn't use the TERRIBLE text book except at a bare minimum, took advice/opinion from the students about planning activities, let us watch and analyze a few films and really made it a fun experience, i don't think you can go wrong with the department, but Paola is right up there, I think the native Italians are the best, plus she brought us lots of cookies!\nWorkload:\ndaily homework (which can be completed over lunch), biweekly quizzes (standard It. dept. quizzes), midterm, final, a few compositions, the standard stuff\n"
        },
        {
            "course_name": "Intensive Elementary Italian I",
            "review_date": "September 03, 2003",
            "review_content": "\nPaola might possibly be the best teacher I've ever had in my life.  I didn't understand a word of Italian before this class, so I was a bit nervous on the first day when she started speaking Italian without preamble.  \"I don't speak English very well,\" she announced later on, carefully weighing her words-- the only English we heard that first class.  Don't let that fool you, though.  Paola knows a good deal more English than she lets on.  However, indulging students in their native tongue is not the way to teach a foreign language.    What all the students in my class knew, besides what \"buon giorno\" means (I'm assuming everyone knew what that means; I don't know for sure), is that Paola really did love them.  I can't remember a class that didn't begin with her asking us how we were feeling.  She was the mamma and we were her famiglia, she loved to say (*tear*).  She was constantly trying to organize a party outside of class where we could be at ease while speaking to each other in Italian.  Sadly, due I suppose to lack of interest, the only festa we had was a 15 minute wine-and-cheese-get-together followed by an hour of class.    Did Paola give busy work?  Of course there was homework.  Again, how else are you supposed to learn a foreign language?  She wasn't unbending, though.  We complained that the workbook was too much, so she didn't make us do it anymore.  Nor was she a stickler for grades: people did poorly on tests, so she compensated with a gigantic curve.    Paola, it almost goes without saying, really loves the language and wants people to learn it.  We learned from opera on videotape, poetry, stories, role playing (very funny), oral presentations, written reports,etc., though some things were more helpful than others.  As a student desperately struggled to spit out a phrase in broken Italian, Paola could be seen mouthing along.  She would entertain even the stupidest question (yeah, there is such thing), lest anyone fall behind.  Still, we worked at a fast pace, covering in two semesters what most language classes cover in three or four.  It's unbelievable the amount of Italian that everyone, and I truly believe EVERYONE, learned in the span of a year.\n  If you want to learn Italian and you're not convinced yet, then stop reading.  Paola will do better without you.  If you think she may be the teacher for you, make sure you're willing to do the work and all that.  Class participation is good too.  If you try, she'll love you.  If you don't, she'll probably still love you.  She's a very loving person.\nWorkload:\nSince I don't believe 1301-02 is being offered anymore, whatever I write here will probably be worthless.  I'll do it anyway.  Homework-- pretty constant.  Bet on at least an hour or two worth per class.\nQuizzes-- once a week or so.  You get to drop the lowest one.\nTests-- probably one midterm and a final.  Cumulative (as every language exam must be).\n  Paola wants you to succeed (translation: you'll be satisfied with your grade).\n\n"
        },
        {
            "course_name": "Accelerated Elementary Italian 1",
            "review_date": "January 15, 2003",
            "review_content": "\nI disagree with the previous review.  Paola is an incredible teacher who makes you excited to learn italian.  Her endless energy and positive attitude is infectious- I always look forward to her class.  Although the typical pseudo-\nintellectual Columbia student (as represented by the review above) might find her annoying- I find her enthousiasm and joy for teaching very refreshing.  Don't miss this class- Paolo is great!    \nWorkload:\nNot bad, although she could stand to cut back on the busy work a little.\n"
        },
        {
            "course_name": "Intensive Elementary Italian I",
            "review_date": "November 20, 2002",
            "review_content": "\nI must say that I have learned a significant amount of Italian in this class, but it was more in spite of Paola than because of her. She is overcaffienated, literally bouncing off the walls. Her eurotrashy manner is disarming, and even funny, but once you get over lauging at her expressions, her utter lack of English becomes frustruating. I swear, the woman speaks no English, and when she tries, it makes no sense. She can be nitpicky and painfully vague at the same time when it comes to specific test questions. However, Paola is not all bad. She is basically a good hearted person trying to adapt to her role in the classroom. Oh yes, and if you sign up for this class, be prepared to encounter the most obnoxious brown-nosing students ever. I have been at Columbia for three years and never experienced a phenomenon such as this. Aggressive freshmen laugh at every witty remark she makes, sucking up at each and every opportunity. Be additionally wary of the loser graduate students who have decided to pick up Italian late in their academic careers...they desperately vy for the honored title of \"animale di casa della professoressa\" - teacher's pet. Probably in a few years, Paola Nastri will adapt to teaching here...she just hasn't learned the system\nWorkload:\nnot too hard, just obscene amounts of busywork\n"
        }
    ]
}