{
    "prof_info": [
        {
            "prof_name": "Edward Whalen",
            "prof_id": 6369,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "July 14, 2014",
            "review_content": "\nStatistics is, significantly speaking, an uninteresting subject. However, Edward Whalen makes the course as enjoyable as possible for any student. I took his class last semester and although it was an 8:40 class, it was probably my favorite class.\nIf I had to describe his class in one word, it would be genuine. Like other reviewers have mentioned, he truly wants his students to have the least miserable experience with stat. He pulls lectures directly off the Devore textbook and literally turns the incredibly dense paragraphs into easier to digest bullet points. Don't even bother trying to reread the textbook - it's horribly written and presented, and plus, he'll explain everything in class clearly. There's always a sample problem after each section, to which he'll go through step by step. He goes at a pretty reasonable pace, making sure there are no questions but not flying through the material. If you try a bit, he seems to be good with names - I went up to him after class about two times, and by the third time he knew my name. He clearly knows the material - sometimes he would even write complicated distribution formulas off the top of his head - but wanted to give the class to do the same.\nThe TA office hours suck since they're held in the IAB building, but if you really find yourself struggling, it might be worth to visit them once - plus, I don't think Whalen holds office hours. I went only once the entire semester, but the TAs seemed to know what they were doing. \nBecause he lectures straight from the text and since the class is at 8:40, most people stop showing up after the second week. Homework is also optional, as he puts a list of \"suggested problems.\" However, I went to each class and found it to be really helpful, especially when it came to his tests. Whalen's test policy is extremely straightforward - he pulls his problems straight from his \"suggested problems.\" I had a couple of friends who stayed up before each exam trying to do and then memorizing each problem, but to no avail. If you go to each class and do the corresponding problem each week, it comes out to about 3-4 problems a section, no more than 2 hours each week. If you spend a bit more time reviewing the material the night before the test, you'll be golden for the exams. Though you can easily Google the answers and memorize the answers, his tests are still on paper and you still need a pencil to write down the steps. Make sure to show your work - I knew someone who got every single answer correct but didn't show any work - trust me, it's not worth it. It gets annoying, but what part of stat isn't? \nOverall, Whalen is as easy and manageable as stat classes go. Your grade is all from the exams - 3 total, including 1 non-cumulative \"final\", as each exam weighs the same. He does also mention he tries to give everyone as good of a grade as he can give. In my class, it was divided around 50/50 undergrads and postbacs. After hearing how badly some of my friends got hazed by other stat professors in terms of workload and exam difficult, I'm pretty glad I took Whalen. I still don't care about stat and neither will you, but at least he makes class enjoyable and you might actually learn a thing or two that's interesting.\n\nWorkload:\ntl;dr \n-take Whalen. he cares a lot about his students. no collected hw, but gives \"suggested problems\" from which he pulls exam questions from.\n-lectures straight from book but the book is horribly written and he does a great job of explaining that you don't have to memorize the whole thing the night before, so go to class\n-doesn't make you memorize really complicated formulas, most questions calculation-based\n-3 exams, 33% each, including 1 non-cumulative final\n-tries to give each student as many points as possible, but is picky about showing work\n\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "June 09, 2014",
            "review_content": "\nWhat an awesome professor. His teaching style is very laid back, which is perfect for majors like economics and business that require,  but are not heavy on the stats (you'll have to relearn everything for econometrics anyway). \nIf you just want a B, the workload is as light as you want it to be, so it's up to you to make the most of your education. If you're looking to go above and beyond for the A/A- though,  be prepared to read through 800 powerpoint slides before a midterm, which are lovingly provided.\nHighly recommended for the enterprising and self-sufficient. \nWorkload:\n3 midterms. No problem sets. Enjoy your B.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "June 03, 2013",
            "review_content": "\nNot as easy as previous reviews suggest, but probably the best option for intro to stat if you care a lot about your GPA and it doesn't matter to you if you're a little fucked for econometrics or the next stat sequence.\nwhalen is a nice guy and genuinely cares about trying to help his students. he just doesn't know how.  some people who show up to class are really stupid and cause him to go really slow. he says he takes attendance but stops taking it after the third week and nobody is really sure how that 10% really is calculated.  he's not as stressful because your final isn't cumulative and is worth as much as the 2 other midterms, but you will not be motivated to start studying until the week before (or in my case, the night before) because he doesn't collect homework.  that said, if you do all the hw before the exam you're basically guaranteed a B. if you do half of the hw, you're guaranteed a B-.  going to class is useless and so is reading the book thoroughly.  just do problems and you're all set.  he went super slow with us and didn't end up covering like a good chunk of the stat curriculum, but compared to what i've heard in other stat classes, this class is your best bet grade wise.\nWorkload:\n3 tests (2 midterms and a final that are worth the same) \"10% participation\" or what he calls attendance.  NO HOMEWORK DUE EVER\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 17, 2010",
            "review_content": "\n\"It's all in the book\" as Professor Whalen likes to say, and I feel it's a very accurate description of the course.  \nThere is a lack of structure in the course. Professor Whalen gallops over the material, assigning one problem from each subsection and considers that section covered.  Therefore, a typical homework consists of  at least 5 problems one from let's say 5.1, 5.2, 5.3, 5.4, and 5.5.  No wonder you realize that for a midterm you supposedly covered 10 chapters, when the other sections covered only 5.  Professor Whalen's teaching style consists of either trying to explain the concepts, which often gets him a lot of blank stares, or simply doing the assigned homework on the board.  Neither of those help learn statistics.\nNow, the class is not hard if you at least attempt to self teach statistics and do the homework.  The problem is, you could do well on the midterm because it is literally taken from the homework, and you could do well on the final because it is not only taken from the homework, but also solved in class two days before the final, yet you finish the class knowing little.  It's a stressful class for the wrong reasons.  \nWorkload:\nWeekly homework (5-7 problems scattered all over the chapters)\nMidterm (literally taken from the homework)\nFinal (Offensively easy.  3 problems - fill in the blank, and 2 homework problems which were solved by Professor Whalen in class a couple days prior to the final).\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 12, 2010",
            "review_content": "\nWhere should I begin...\nEd Whalen is a really nice guy. But that said, it doesn't really help that he's nice when he doesn't teach anything in class. He tries, oh he does try, but pretty much nothing he taught us made any sense right until the review classes where he actually tried connecting the random bits and pieces he would choose to teach in class otherwise.\nThat said, honestly, I had friends in other sections who had equally useless teachers and had much harder homeworks and tests. So even if he didn't teach us much, I have to admit, he was aware of that and set the homeworks and tests according to that. So that by the end, I thought I vaguely understood what we'd been trying to do all semester but really wouldn't be able to do it all by myself even then.\nIf you must take this class to fulfill a requirement, I'd say go ahead and take it. Just try learning stuff from the textbook and applying all the gazillion formulas and you'll be more than fine in this class.\n\nWorkload:\nWeekly homeworks (usually short, but annoying especially since most of the questions weren't discussed in class)\nMidterm and a final (pretty straightforward and easy)\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 20, 2009",
            "review_content": "\nAbsolutely terrible teacher. The reviewers below are correct in that he is a nice guy, but that doesn't help. Even if you try to talk to him after class, that won't elucidate any of the concepts he failed to teach during class time. Don't bother going to lecture at all; it's a waste of time. He spends hours showing you how to use Excel when he should be teaching you, I don't know, something about statistics, maybe? My class was at 9 and it was impossible to stay awake. Don't bother with it. Just do the readings and try to learn things on your own as best you can. If you want to take another statistics class after this one, you will be woefully unprepared for it. \nWorkload:\nThe two tests are a joke. The final took less than half an hour to complete and wasn't cumulative. The homework assignments are harder than the tests. Whalen will email you useless hints on how to do them. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 18, 2009",
            "review_content": "\nEd Whalen once came to class in what looked like pajamas, so that was cool. Then he told a bunch of jokes, and told us to look at some blue boxes in the book. Then he gave everyone A's and B's.\nThat's about it...\n*As he's giving out the exam:\n\"I'm switching up the version of the exam by row. It's gonna be harder to cheat off of the person in front, so your neighbor will have the same version as you do.\"\nI thought he was extremely nice, but that his class just wasn't that interesting. \n...My review originally was too short, so...\nI think the issue some people have is that he doesn't \"teach\" you the material. I half agree with this - I don't think we did that many examples in class, and that's usually the best way for people to learn in math/stat classes. On the other hand, he does guide you to the relevant formulas/pages in class or via email and tries to explain those. Where it gets hard is that he doesn't always explain the formulas that well, and when it comes time to apply them, you either don't know how to or don't know exactly which one(s) to use. \nWorkload:\n9 Problem Sets (Took b/w 30 mins - 2hrs. for me to complete), 1 Midterm and Final (Non-Cumulative, and told us the three questions ahead of time).\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "September 20, 2009",
            "review_content": "\nDoesn't teach the material at all. Instead made us do lots of readings on our textbook. taking his class is like self-studying\nWorkload:\nokay\n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "May 21, 2009",
            "review_content": "\nTerrible Professor. Didn't teach the material at all, and instead assumed that the students would learn all of the information through the textbook which was way above our level. Weekly homework's which were tough, but some of the solutions were in the solution manual (Buy this!). Midterm was taken straight from the homework, literally the same problems. No Final exam, instead an easy final project.\n\nWorkload:\nLight. Weekly Homeworks (33%) which were tough, but the TA helped. Midterm (33%) which was straight from the homework, but the average was low. Final Project (33%) which was easy because he tells you what to do on the final project.\n"
        }
    ]
}