{
    "prof_info": [
        {
            "prof_name": "Myron Cohen",
            "prof_id": 999,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Chinese Society",
            "review_date": "January 01, 2012",
            "review_content": "\nProfessor Cohen is a nice guy and, moreover, extremely knowledgeable.  Throughout the semester I'd approach him with questions that ranged into the obscure, and he was able to answer nearly all of them and seemed happy to do so.\nThat said, do not take this class unless you are prepared to sit through long, rambling lectures that predominantly consist of Professor Cohen mumbling while you rush to copy down the bullet points on his slides.  That's what this class is -- a man reading bullet points off a slide while you and your friends take notes.  Cohen's style is not in the least engaging, and he rarely interacts with the class beyond asking if there are any questions.\nThis class might be all right if you're really interested in China, but those who only have a passing interest should pass this one over.\nWorkload:\nA decent amount of readings per week, usually several chapters or half a book (and some of the books are exceptionally dry).  An in-class midterm consisting of two essays (your pick out of five) and a take-home final of two five-page essays (your pick out of five).\n"
        },
        {
            "course_name": "Chinese Society",
            "review_date": "April 19, 2010",
            "review_content": "\nThe class was fascinating up until the midterm. After the midterm, I felt like each class was just a repetition of the last class. I learned a lot more from the assigned books than I did in class (great books, by the way). That being said, attendance in class is very important not because the class size is small (he doesn't take attendance anyway) but because his questions on the midterm draw heavily on lectures. Don't expect to go into the midterms with only the information gleaned from the books (as I did). Unless you are totally into China and it's culture, I'd say skip this class. I loved \"Chen Village\" by Anita Chan and \"Family, Fields, and Ancestors\" by Lloyd Eastman (I recommend just reading these two books rather than taking the class). All in all, a good class but I kind of wish I hadn't taken it.\nWorkload:\nThe assigned readings go from reading a long, detailed field study book to a couple of chapters from the main text. One midterm consisting of two questions with essay-length answers and a 2 final papers, each about 6 pages.\n"
        },
        {
            "course_name": "Chinese Society",
            "review_date": "May 12, 2006",
            "review_content": "\nAll the previous reviews are pretty accurate. Prof. Cohen is extremely knowledgable, but a bit tedious. His class spans a very complex time period and he goes over a lot of material that may not be interesting to all. While it's not a hard class, one really does have to attend the lectures, because most of the midterm questions are easy only if you've taken good lecture notes. Other than that, a great class that you'll definitely learn a lot in. \nWorkload:\n1 in class midterm, a final that consists of two 5-6 page papers\n"
        },
        {
            "course_name": "Religion in Chinese Society",
            "review_date": "August 15, 2002",
            "review_content": "\nhe's a really fast lecturer. and rambles on and on. it gets tedious at times. there's a sufficient amount of readings. but there are perks. his midterm is non-existent because it is a paper. the class is pretty interesting if you're into anthropology. light workload, but he's boring. so good class to take to pull up the gpa, but you'll have to survive through his lectures. exam was pretty easy if you pay attention in class. \nWorkload:\none paper for midterm and one final cumulative exam\n"
        },
        {
            "course_name": "Religion in Chinese Society",
            "review_date": "May 04, 2002",
            "review_content": "\nCohen is one of those professors who is so genuinely interested in the material that he would enjoy talking 2,3,4,5, maybe even 6 hours without tiring. However, don't expect to have his stamina as a student: i was ready to pass out after only a few minutes each class. If you are fascinated by the subject matter, take the course. If you are interested in a course with minimal requirements (there's not much reading either), then you also might want to consider it. But be warned, Myron's \"field work\" stories and obsession with corduroy will only keep you entertained for so long.\nWorkload:\n1 mid-term paper (6-8 pages), 1 in-class final\n"
        },
        {
            "course_name": "East Asian Societies and Cultures",
            "review_date": "March 12, 2002",
            "review_content": "\nProfessor Cohen is one of the foremost scholars on China in the world and his classes are definitely worth taking. He is not only extremely adorable and enthusiastic, but highly knowledgeable and able to teach in a clear and straight-forward manner. While the lectures are usually only exciting if you're into the subject matter, Professor Cohen is extremely repititive on major points [in a helpful way], and is able to bring his ideas together in a cohesive and understandable way if you are not familiar with China or East Asia. His tests are either in-class essays [with choice] or take-home, and they usually focus on those ideas which he repeated in class. Overall, he knows a lot, teaches well, and offers an enjoyable experience in understanding East Asian societies. \nWorkload:\nModerate reading, midterm, and final [one of which is usually take-home]\n"
        }
    ]
}