{
    "prof_info": [
        {
            "prof_name": "Kevin Elliott",
            "prof_id": 10993,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 03, 2016",
            "review_content": "\nYou would be very lucky to have Kevin Elliott as a CC instructor. I've heard about a lot of bad experiences with CC teachers, and I was so thankful to have Professor Elliott. If you're looking for a joke CC class where you don't have to read the books, then this is not it. His class is taught the way CC classes should be taught. You have to read the books and pay attention in class but you will gain a lot from it. He makes the works incredible accessible and explains them in ways that will clarify all the questions you had when you were reading Marx or Hobbes that you thought were blatant contradictions or totally vague.\nHe hands out reading questions for each thinker which are extremely helpful in terms of guiding you through your reading and helping you understand some of the focal points of each writer's thought. His class is mostly lecture, but he lets it evolve into discussion when people have things to say. When people disagree he may also try to encourage the debate or ask people for suggestions. Most people find CC classes with lectures very boring, but you will learn A TON if you pay attention in his class. He knows all the works well, unlike what I've heard about many CC teachers unfortunately. Even though the course is a serious one, he's kind of a funny guy and the feel is very laid back. \nThe grading is fair. If you want to get an A you have to read the books, pay attention in class, and try hard on the essays. Highly highly recommend if you can get in.\nWorkload:\nParticipation 25% (which is basically just posting 3 times on the class discussion board)\nEssays 25% (three essays and a chance to revise one of them)\nMidterm 20% (handful of pretty easy ID's and one essay, you can usually see the topics coming)\nFinal 30% (also only one essay with a very predictable topic)\n"
        }
    ]
}