{
    "prof_info": [
        {
            "prof_name": "Paul Diament",
            "prof_id": 2165,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Wireless Communications",
            "review_date": "May 03, 2010",
            "review_content": "\n   Yeah, he presents the material. Yeah, he's usually not wrong. Yeah, you come out of the course knowing more about the subject than any employer will ever require you to learn. \n    But personally, I'd rather watch tortoises have sex than take this man's course: it's just as laborious and boring, but at least there's some comedy in the concept of turtle sex. \n    I mean, seriously. This guy doesn't even look UP. Once I sat through a lecture - a typical lecture, mind you - and Professor Diament did not even acknowledge that he had students (read: raise his head) for 46 minutes. At that point, he lifted his head and said, \"And that's the module frequency.\" He then lowered his head and continued muttering to himself like a lobotomy patient. \n     Actually, I think that a lobotomy would enhance your enjoyment of this class. I think I'm going to Professor Lazar to get one. \n\nWorkload:\nPretty \"okay\", although there is immense standard deviation on the p. sets and midterm. Be careful you don't fall in the lower bracket. \n"
        },
        {
            "course_name": "Electromagnetics",
            "review_date": "June 02, 2009",
            "review_content": "\nI couldn't agree more with folks above.  I am sure the faculty is not happy with this man's performance and general loathing from the student body as a tenured professor However, what can they do?\nFortunately for the entering student body in a few years, he'll no longer be around.  It is really a shame to the department to have such an individual around.  Oh well.  I feel sorry for the man and really hope him well.\nGood luck to those who must take his class!\nAdvice: Do not plan on him teaching anything.  Expect A LOT of material.  Do not expect an A, and you will work very hard for a B. \n\n"
        },
        {
            "course_name": "Wave Transmission and Fiber Optics",
            "review_date": "May 16, 2009",
            "review_content": "\nThis class was really good. I know a lot of people find Professor Diament boring but its possible they just find the subject boring. Professor Diament knows a lot about electromagnetics and is extremely clear with his explanations and his class is well organized; he is even funny at times. His book on the subject is fantastic and complements the lectures nicely. He is also approachable during office hours and will help with even very basic questions. I learned a huge amount in just one semester.\nNote: His grading rubric is a little less generous than similar-level classes. I hear only two people got an \"A\".\nWorkload:\n1 problem set/week (very small part of the grade). Two tests (both take-home, in Fall 2008)\n"
        },
        {
            "course_name": "Electromagnetics",
            "review_date": "May 05, 2009",
            "review_content": "\nProfessor Diament is your stereotypical nightmare professor as an engineering student, only worse. \n-Extremely B O R I N G  , mainly because he is bored with the material\n-A P A T H E T I C  to students actually learning the material which is evidenced by his running through it and avoiding questions like the plague.  Not to mention if you have a question, his delicate ego is at stake and forces you to feel like you have the intellect of an amoeba.\nHis tests are fair based on the material and homeworks.  \nHis lectures are based out of the textbook that he wrote.\n\nWorkload:\n1-2 assignments / week  1 MdTrm + 1 Final \n"
        },
        {
            "course_name": "Electromagnetics",
            "review_date": "April 22, 2009",
            "review_content": "\nPaul Diament is a lazy and mean professor.  Stay as far away as possible.  Never left the walls of Columbia university since he started as an undergrad, he is also kind of an elitist, ironically also kind of a loser. \nCondescending and a lousy professor.  He is pretty old, and  miserable with his job. I think he gets of on giving awful grades. \nWorkload:\nOverbearing.\n"
        },
        {
            "course_name": "Electromagnetics",
            "review_date": "September 08, 2004",
            "review_content": "\nProfessor Diament is   V E R Y  boring.  He is also  O V E R L Y  strict with the way he gives tests. He watches you like a hawk and makes you even more nervous than you were when you came in. The material in this class is very difficult. He is organized; but that's because it seems like he is just reading pages out of the book he wrote (which you use in class, which you should get from half.com because i got it for 10 bucks). Otherwise, his exams are reasonable. He doesn't ask questions that are too difficult. But, I guess that's because you need to memorize all the formulas. He's a reasonable grader, but it also depends on the curve in your class.\nWorkload:\n1 problem set approx every week; midterm and a final\n"
        }
    ]
}