{
    "prof_info": [
        {
            "prof_name": "Lucy Goodhart",
            "prof_id": 1224,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Europe After Lisbon ",
            "review_date": "June 04, 2013",
            "review_content": "\nBefore giving a review of Lucy, let me give a review of my class performance, so everyone can review any potential biases on my part. \nI got an A- in this class with a majority grad students. The A- would have been an A if I had managed my time better at the end of the semester, as I screwed up on the final. Of the 30 or so class meetings I probably attended 15, and made about 2 of the 10 weekly TA meetings. So overall, I was one of those students that the professor quickly realized knew the material well but was clearly not giving a full effort in the course. I was the guy most profs love to hate. \nDespite my above behavior, Lucy Goodhart treated me like I was just another student, and for Lucy, that means enthusiastic and eager support for any possible question you may ever have. I wrote my term paper on a subject she is quite knowledgeable on, and to which I never attended lecture, and she still took the time to discuss the relevant subject matter with me and was always offering praise for my work. \nIn my columbia experience, most professors essentially ask you to romance them (By this I mean showing up to all the classes, going to office hours, basically pretended like their class is the reason for your existence). Lucy does not care. She treats the class as a learning experience for herself as well, so she is quite forgiving and open with the course.\nIn summation, Take any course with lucy goodhart. She deserves a gold nugget. \nWorkload:\nManageable. A couple of info summaries, a midterm, a paper, and a final. Sounds worse than it is. Tough grading, but not unfairly so \n"
        },
        {
            "course_name": "Size of Government",
            "review_date": "December 13, 2012",
            "review_content": "\nProfessor Goodhart is a remarkable professor who deserves every bit of her silver nugget, if not a gold one. She is energetic, witty, engaging, passionate, and extremely knowledgable about everything she teaches. She also has a British accent which makes everything cooler. This class is all about fiscal policy, which I'll admit is pretty darn boring, but if you put even the smallest ounce of effort forward, she will lure you in and help you actually learn something useful. Her grading is very fair and she really wants to see all of her students succeed. Goodhart is always available to meet with you and really will work with you until you understand whatever it is you need. She is a true gem on the PoliSci staff (which is a solid crew to begin with) and definitely worth a try if you can muster up the courage to deal with the intricacies of welfare and economics (but no significant prior econ knowledge is necessary).\nWorkload:\nOne 5-7 page policy memo, ideas for a question and data set (really short) for your term paper, followed by a paper proposal and then the final 20-30 page seminar term paper. Participation is somewhere in there too. You also will need to lead the discussion one week.\n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "December 10, 2006",
            "review_content": "\nProfessor Goodhart is a very engaging lecturer. She clearly loves the material, and the lectures are organized and very clear. Some of the readings are dry as dust, but she usually goes over the main points in lecture, so you don't necessarily have to read them.\nWorkload:\npolicy memo (6 pages), research paper (10-12 pages), midterm, final, optional discussion section\n"
        },
        {
            "course_name": "Comparative Politics Seminar: Political Parties",
            "review_date": "April 20, 2006",
            "review_content": "\nI enjoyed this class.  Professor Goodhart starts every session with a short introduction about what is significant about the week's readings and what they tell us about political parties.  She asks probing questions about the text but also opens up discussion to much broader topics.  That said, even though this is a comparative politics seminar, there were plenty of kids who ONLY knew about American politics and thus the conversation usually revolved around American political parties, which is something most compartive people don't want to talk about because it's retarded.  Other than that, very interesting.\nWorkload:\nNot-too-much reading, all very interesting, 4 page country report, 3-5 page paper proposal, 25-30 page paper.  \n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "April 13, 2006",
            "review_content": "\nFor material as dry and complicated as the EU, Lucy Goodhart does a good job. Her lectures are clear and organized and she is clearly fascinated by the material although her class might not be. The class gets more interesting after the midterm. Very accessible.\nWorkload:\nstandard: midterm, final, term paper on pretty much anything. the readings are horrible.\n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "January 15, 2006",
            "review_content": "\nProfessor Goodhart is a good lecturer who cares deeply about the subject material.  Overall, I enjoyed the class and found the material interesting and Prof. Goodhart engaging.  The only problem I had with the class was that we repeated the same material several times throughout the semester.\nWorkload: One short policy memo, one long (10-12 page) research paper, midterm, final\n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "January 13, 2006",
            "review_content": "\nOverall a great class.\nYes, the grading is sometimes harsh (but not anymore so than other Poli Sci classes) and yes the theory is limited to about 4 major strands of ideas.\nHowever, for those who don't have a solid understanding of the EU and who are studying international politics this class is an absolute must. \nMoreover, those who said this is a history class neglect the fundamental element of political science (and this class). Goodhart places a strong emphasis on analysis, prediction and causality.\nGoodhart is funny and wonderfuly sarcastic. I read some of the reviews below. And yes, there were a few people who managed to sleep through the lectures. However, I would say these people (who asked horribly asinine questions) were the largest detraction from the class. \nWorkload:\nAverage. Short \"policy memorandum\", One long 10-12 pg paper. Midterm (class) and final (1 1/2 hrs). Readings were short.\n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "December 07, 2005",
            "review_content": "\nThis is a great class.  Discusses the politics of the EU in depth.  Goodhart is just amazing; she brings spunk and motivation to a topic that even european bureaucrats might have a tough time with.\nA+\nWorkload:\nNot much reading; one easy paper, one research paper.  Midterm + Final.\n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "December 27, 2003",
            "review_content": "\nWhat's curious about the reviewers that propose that the class was a \"disappointment\" or a failure to address the theoretical aspects of the EU in the world system is that they fail to understand the class is named EU: \"Politics and Institutions.\" So naturally it would follow that we would study the politics, and (gasp!) institutions. \nNot only is Prof Goodhart truly concerned with her students, as evidenced in her answering questions she couldn't answer in class by email (after researching and providing links), she is knowledgeable in a wholly complex subject. I would recommend taking this class if you want to escape from the Chalmersian drivel of \"theory\" that's nothing more than uninteresting, masturbatory polisci ping-pong conceptualization. She will make you realize that the Polisci department at Columbia actually teaches relevant, interesting material.\nWorkload:\nNot terrible. The reading is interesting, less than 100 pages a week (low for a PoliSci class). Midterm, policy paper and term paper (both where you can choose the angle/topic) and final. Grading is harsh by American standards, but her comments are deliciously sardonic.\n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "December 16, 2003",
            "review_content": "\nGoodhart is a good lecturer and clearly in command of the material, but this course is in entirely the wrong department.  For Poli Sci students, especially comparative poli sci students, looking for some insight into the broad theoretical questions raised by the EU, this is not the class.  The entire course is spent rehearsing the history of the EU and grinding through the minutiae of its procedures - important information, no doubt, but of little interest to political science students.  The course is taught as though it is an orientation session for bureaucrats desiring to learn the nuts and bolts of the system.  At the beginning of the class, Goodhart pointed out that the EU is fascinating as a comparative study to the US and as a challenge to the nation-state.  I couldn't agree more; these questions are exactly why I registered for the class.  I only wish we had addressed them.\n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "November 24, 2003",
            "review_content": "\nI am completely astounded by some of these reviews.  This class was the single worst class I have taken at Columbia and Goodhart the second or third worst professor.  The material itself is painfully boring but it makes up for it by being incredibly convoluted and just plain dumb also.  She makes token and generally symbolic efforts to answer students' questions and address their concerns but they are generally no more than that and she isn't successful at imparting any information in the first place.  In my opinion, she's patronizing and her accent is annoying, her lectures are totally unclear and her grading is extremely difficult.  She's one of those professors that will write \"excellent paper, strong points, good arguement\" and then give you a C.  It doesn't make any sense and neither does taking this class.  Avoid for the sake of your mental health.  \nWorkload:\nMidterm, Final, 2 papers, pretty minimal amount of reading but it's all awful\n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "November 20, 2003",
            "review_content": "\nThis is a wonderful class, the best I've ever taken, with a wonderful, knowledgeable and motivated professor. I can only recommend taking it. \n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "November 14, 2003",
            "review_content": "\nProfessor Goodhart is a great professor and lecturer.  Given the density of the material and the breadth & depth of knowledge that she must impart to us, she does a wonderful job with the lectures.  She covers all of the material in a tight and cohesive manner, though I will warn you, there is a LOT of material to cover.  The readers are fair but there is a lot to pick up from them.  She assigns really interesting reading and points out the interesting parts during the lectures.  You have to be really focused on her class; otherwise, it'll just go over your head.  If you're at all interested in EU politics, take this class!  Also, you will find that Goodhart, more than any other professor on campus, is amazingly friendly, approachable, patient, and generous with her time and energy outside the classroom.\nWorkload:\nTwo papers, midterm, and final.  Pretty standard.  The second paper is a research paper and, depending on you and your research topic, may be either a breeze or a complete disaster...  Choose your topic wisely. \n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "January 17, 2003",
            "review_content": "\nProf. Goodhart is a sweet young lady who truly makes her students a top priority. The lecture material is interesting yet very detailed. She's a pretty tough grader, but she gives lots of comments to justify your grades. She's also willing to answer all questions, even if that requires doing some research on her part. And she's approachable over email in addition to during class. Overall, a good poli sci class to take. The readings are dense but not as boring as they are in some poli sci classes and not unnecessarily excessive, either in number or in length.\nWorkload:\nA 5-pg paper, a big research paper, a midterm (pretty easy), and a final (also pretty easy). No grade inflation here; few As are given.\n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "December 16, 2002",
            "review_content": "\nProfessor Goodhart does a good job of teaching a complicated, messy bunch of institutions and policies and still managed to make it interesting and, at times, funny. The lectures were well organized, carefully structured, and coherent. She provided her own lecture notes to us at the end of the semester to help us prepare for the final, and was always very approachable and friendly outside of class.  \nWorkload:\n4-5 page policy memo, 10 page research paper, midterm and final\n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "November 17, 2002",
            "review_content": "\nGoodheart's lectures may be a bit dense at times, as well as slightly confusing (what with the masses of names and dates scrawled on the board) but that should not discourage one from taking this course. If Europe sounds interesting to you, take this. The readings, although extensive, may be supplemeted by the lectures (get it?). And although she may at times be complicated, outside of the classroom she is very understanding and nice, and goes out of her way to meet with students and listen intently to their questions and/or confusions/comlications.\nWorkload:\nLots of reading (it's a poli sci class), two in class exams, a research paper and a policy memoranda of 4-5 pages. \n"
        },
        {
            "course_name": "European Union: Policies and Institutions",
            "review_date": "November 07, 2002",
            "review_content": "\nThis class is simply boring. The readings are long and tedious, the lectures are no better. Goodheart articulates every sentence in this strange, yet entirely annoying, pompous voice, as if talking to a group of young children. Come midterm time you will have wished you instead opted for something different, while staring at her unorganized scribbles of dates and endless confrences, cursing your cruel fate. She is a tough grader, and has no worries about handing out C's, oblivious to Columbia's grade inflation policies. and will drown your poor mind in mindless detail above the EU. You can take this class, however, if you are ONE OF THOSE TYPES. And we all know WHO they are.\nWorkload:\nLots of tedious readings. A 3-5 page policy memoranda. A long paper. Inclass (read: bluebook) midterm and final.\n"
        },
        {
            "course_name": "The European Union: Politics and Institutions",
            "review_date": "October 16, 2002",
            "review_content": "\nProf Goodman provides a very clear and succinct insight into the European Union. She is a sweet lady with a cute English accent, the only problem is she talks a mile a minute. But the good thing is she tells you a million facts and then tells you that you don't need to know them. It's a good enjoyable class with not too much reading.\nWorkload:\n1 3-5 page paper, midterm and final\n"
        }
    ]
}