{
    "prof_info": [
        {
            "prof_name": "Mark Herman",
            "prof_id": 13081,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Applied Consulting",
            "review_date": "January 21, 2015",
            "review_content": "\nI am going to be very honest. This class is probably the worst one I've had so far at Columbia. He seemed to know a lot about consulting, but terrible at conveying it to us. His lecturing style was unclear. Lectures consist of him talking vaguely about various topics. There were a bunch of required textbooks which most students bought, but ended up not reading at all because class projects did not really require us to know knowledge from them. He seemed to be very nice and gave all of us so many compliments.\nAlso, he is terrible at using courseworks. He uploaded a ppt including every team's grade in the assignment tab of courseworks.\nAfter that, he did not bother to upload anymore. Instead, he sent these grades via e-mail when he was asked to do so.\nWhat I expected when I decided to take this class was learning knowledge specific in the consulting industry as well as skills to find a job in consulting. But, all I got was 4 consulting projects and teams spend all class time working on the projects and he comes to all the teams and listen to our concerns and questions for 5 minutes. The worst part was that even if you get team members who just do not care to show up in meetings, you are still going to get the same grade as that person because this instructor does not use peer evaluation when grading.\n\nI really don't think the class is worth the money and time. But, if you want to take a class where you can easily get a B, go for it.\nWorkload:\nHard workers spend a lot of time on working for case studies. Some lazy chickens do not even show up for classes and meetings. I have had a team member who showed up for one out of 5 meetings. I was really surprised that there were these kind of students even here at Columbia.\n"
        }
    ]
}