{
    "prof_info": [
        {
            "prof_name": "Gregory Winkler",
            "prof_id": 3317,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Technical Theater Production",
            "review_date": "December 05, 2013",
            "review_content": "\nThis professor was hands down amazing. Forget what the old comments say because today --about 5 years later he's not like that at all. Greg, not \"Mr.Greg\" or \"Mr.Winkler\" is a relaxed kind and detailed orientated professor.He likes telling stories and is willing to help anybody with experience ranging from none to having done everything. A Yale graduate and most definitely not snobby at all he is time flexible and makes sure you understand the material he teaches (very little notes!). The class is hands on and you learn to utilize power tools and build things you thought you could never build. It's two days a week for an 1 and 15 min ( reasonable). The class size is small  and you are able to actually talk to classmates and the professor in a comfortable classroom setting. You don't need to buy the textbooks either because he has the readings on courseworks (such a great guy!). Overall take this class it will change your perspective on theatre forever or make you love it even more!\nWorkload:\nYou're setting up for the two theatre productions in the semester and you have have \"lab\" hours ( ranging from 1-3 hours a week). The class grade is composed of one midterm which won't ruin your grade if you do awful, two play analysis ( he gets you the tickets for the shows you helped build sets for) one materials report ( an assigned topic, easy!) and a final project which you can totally do because he prepares you through out the entire semester. \n"
        },
        {
            "course_name": "Technical Theater Production",
            "review_date": "June 19, 2008",
            "review_content": "\nEverything the previous commenter was factually correct.  But I really want to stress how unearthly, mind-numbingly boring this class was.  We even created a Facebook group attesting to how much we hated the class.  We like Greg, you get to call him Greg, but he is not a good/fair professor yet.  Give it a couple years.  That's what his classes will feel like anyway, years upon years and some more years.  I came in as a freshman theatre major and contemplated going premed everytime we were in class.  And you're in class alot.  It's an hour and 50 minutes, twice a week instead of the traditional 1hr15min. But its still only 3 credits.  It was just ridiculously boring and made me question my love of theatre.   Ugh. DO NOT TAKE THIS CLASS. Not yet at least.\n"
        },
        {
            "course_name": "Technical Theater Production",
            "review_date": "November 06, 2007",
            "review_content": "\nThis class was not what i expected at all.  If you want to learn all the tiny details in how to actually run a theater company, then take this class.  For the first two months, every class was a two hour lecture, with Greg writing detailed notes on the board, you copying the notes into your notebook, Greg erasing the board and starting over...We learned about how to construct things, but until last class (with just over one month of class left) we didn't actually build anything.\n  This class is VERY difficult.  There is SO much information, most of which will probably be foreign to you (such as different types of nuts, bolts, screws, nails, different grades of wood...etc.)  However, some of the information really is good for life--knowing about different nails and when they are used will help me if i need to shop at Home Depot.  I complain a lot about this class, but there are benefits in the real (vs scholastic) world to knowing differences in power saws.\n  Greg is very nice, and i think because it is his first time teaching, he wants to do a good job.  We advocated for a five minute break halfway through class, which we got. \n  Recently we have actually been having class in the scene shop, and last class we even built something, so it's possible this class will be getting a lot better and more practical.    It gives you a better understanding of everything that has to go on backstage and behind the scenes for a production to be put on.\nWorkload:\nThree non-cumulative exams rather than a regular final and midterm (although the final was just cancelled, yay!).  Difficult because there is so much information.  I studied for five hours for one exam, partly with a partner, and did great, surprisingly.    Two worksheets on orthographic and sectional drawings, very difficult.  Nothing is curved.   Analysis of a show--two must be Barnard productions, one professional.  Good excuse to go out and see shows.  Comment NOT on the plot, but on things like the type of stage, lighting, scenery, etc.  We are supposed to read big chapters in the textbook that accompany the lectures, but it's pretty unnecessary.  I spent $74 on the book and haven't opened it.  Just take lots of notes on the lecture.\n"
        }
    ]
}