{
    "prof_info": [
        {
            "prof_name": "Sachin Gautam",
            "prof_id": 12336,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "February 08, 2015",
            "review_content": "\nI took Calc I with Sachin three years ago. Since then, I've taken Calc II, Calc III (also with Sachin), and Linear Algebra. Looking back and comparing my experience with Sachin with my experience with other professors, Sachin is absolutely gold. He is incredibly clear, precise, and actually gets to know his students by name towards the end of the semester. I've had at least one other good math professor here at Columbia (shout out to Davesh Maulik!), but Sachin still holds a dear, dear place in my heart. A+\nRight now he seems to be teaching more advanced courses in Math, which I'm excited for him about, but many other people are missing out on taking the initial math classes with this gem of a professor! If you're looking for a Calc I, II, or III professor who will be rigorous but fair, speedy and comprehensive but willing to help students out, and will truly prepare you well for applying math outside of Math courses themselves, Sachin's your man.\nWorkload:\nTypical math: problem sets, two midterms, final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 08, 2015",
            "review_content": "\nI took Calc I with Sachin three years ago. Since then, I've taken Calc II, Calc III (also with Sachin), and Linear Algebra. Looking back and comparing my experience with Sachin with my experience with other professors, Sachin is absolutely gold. He is incredibly clear, precise, and actually gets to know his students by name towards the end of the semester. I've had at least one other good math professor here at Columbia (shout out to Davesh Maulik!), but Sachin still holds a dear, dear place in my heart. A+\nRight now he seems to be teaching more advanced courses in Math, which I'm excited for him about, but many other people are missing out on taking the initial math classes with this gem of a professor! If you're looking for a Calc I, II, or III professor who will be rigorous but fair, speedy and comprehensive but willing to help students out, and will truly prepare you well for applying math outside of Math courses themselves, Sachin's your man.\nWorkload:\nTypical math: problem sets, two midterms, final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 22, 2013",
            "review_content": "\nSachin is a pretty good lecturer, and puts all of his notes on the board in a very logical and concise manner. He provides example problems which are helpful to look at before the exams because they are often similar to the problems on the tests. Although he is not the most engaging lecturer, he has his fair share of funny one-liners when answering questions, and I find that even if you zonk out but copy everything he writes down on the board, you can make sense of it when you look at your notes again later. He has a slight accent, but it is easily understandable. Also he is NICE at drawing 3D shapes... \nMuch of the exams is straightforward, but there are usually one or two \"reach\" problems where you have to tackle something you haven't seen before and have to do some tricky thinking to figure out.\nWorkload:\nWeekly problem sets (these take some time, but are reasonable lengths)\n2 midterms\n1 final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "September 17, 2013",
            "review_content": "\nI had him at 8:40 AM, so he was always a bit slow to start, but by the time he finished his daily espresso he had bursts of enthusiasm towards the material(which was occasionally interesting). His teaching is standard and organized. Talk about a topic, do a couple of examples increasing in difficulty. He had a slight accent that I found easily understandable. I always sat in the front, but his voice seemed quiet enough that it might not reach the back of the room so well. His answers to questions were always clear. No webassign, woohoo! 7/10 Would take again\nWorkload:\n1 problem set/week ~1-2 hrs\n     You could ask questions about the HW in class before it was due and he would pretty much do it for you\n2 midterms and a final: Straightforward and easy if you've gone to lectures and done the homework\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "June 14, 2012",
            "review_content": "\nI'm not sure how to describe Sachin other than saying he was an okay teacher. But, considering almost every other Calc teacher there is, that might not be half that bad. First of all, the first day of class was full with more than 100 students. The last day of class only had 17, of 51 that hadn't dropped out. Throughout most of the semester, only about a third of the class ever bothered to show up. The general consensus was that he was a bit confusing, and I myself often left the class not sure of what was going on. Many thought the lectures weren't even necessary because ***he posts all of his notes online***.\nHowever, I've heard horror stories of other people's Calc teachers, and on second thought, Sachin is actually quite a decent professor. He held office hours constantly, and was quite available outside of class. He could have been better on this front and regarding e-mails, but all-in-all he made the effort to explain further if necessary. He was a really nice guy and, though a bit awkward, approachable and willing to help. He somehow managed to learn the names of most of the students (even those who didn't go to class often), which I think demonstrates his effort and is always a nice touch.\nSachin was encouraging after the first midterm (when more than half the class dropped out) and promised our grades would not be affected as much if we did better in the second midterm. He made sure that we knew the material (though most were too scared to confess we actually didn't), and he ***spoke English relatively well*** (other than a weird way of pronouncing \"h\", he was fairly understandable, though I'd recommend sitting close up front... he tends to speak a bit low).\nMost importantly, he was VERY FLEXIBLE in his grading. He made clear from the start that the median grade would be curved up to a B+ at the end of the class. Moreover, at the end of each test, he'd always add anywhere from 5 to 10 *extra* points, apparently in a merciful act of boosting our grades (I had originally gotten a 60% on the first midterm, but he added about an extra two points to each exercise, so I got a 70%). Indeed, the median and average grades were always in the high 50's to mid-60's, but you could tell he was lenient enough to boost our grades in the end. After the second midterm, he gave an optional, BONUS quiz (that could therefore only *improve* our grade). Not sure how that would work out given the curve (median grade in the class gets a B+), but nevertheless it was nice and proved he cared about our grades. \nHe graded everything *very* quickly (final was corrected in a day, the midterms in about a week each), and was very responsible with our homeworks. The homeworks, though, were REALLY long and annoying and stressful. Many times the homeworks had exercises that were nearly impossible to solve/ not discussed at all; I would be lying if I said I didn't rely HEAVILY on Cramster and Woolfram Alpha to get good grades in them (he grades each, dropping the lowest grade out of 11 homeworks). Most of the times they involved reaching/demonstrating some formula using calculus (eg. proving the formula giving the volume of a cone using integrals and a bunch of variables, etc.).\nIn the end, I'm not sure I can recommend any one way to study for the class. I mostly just dedicated two entire nights to doing the weekly homeworks, and then looking over all my notes, homeworks, the book, the study guide and previous tests to study. In the end, you're mostly just stuck with relying on the curve to get a good grade. A's and B's are definitely possible without the curve, but I wouldn't stress out too much after each test, the median is always in the 50's and 60's. Surprisingly, there weren't any mega-geniuses around to ruin the curve or anything. \nSo, to sum up, Sachin is not a stellar teacher, but he gets the job done and makes Calculus I (which is usually not the most exciting topic, especially for math teachers used to more complicated things) as bearable as possible. He's not the best teacher around, but he's certainly not the worst, and I can say with fair certainty that you don't need to run away from his class at all. Given all the other teachers in the Math Department, I'd say he's a pretty good, safe choice.\nWorkload:\nWeekly homeworks (total of 11; VERY annoying, long, and frustrating) worth 20% of the final grade. Two midterms also worth 20% of the grade each (6 exercises), and a final worth 40% of the grade (10 exercises). All in all, not too bad a workload. Only the homeworks are particularly annoying and time-consuming (usually about two full nights, equaling 12 hours in total, spent working on each one), but everything else is only about a night's worth or two of studying. Tests leave you feeling horrible and depressed and a failure-at-life, but curve is very generous and final grade is satisfactory if you're responsible/ marginally-interested in the material.\n"
        }
    ]
}