{
    "prof_info": [
        {
            "prof_name": "Zoltan Haiman",
            "prof_id": 3976,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Physical Cosmology",
            "review_date": "May 28, 2014",
            "review_content": "\nPhysical Cosmology is one of those classes about which students have mixed feelings. Zoltan is a fairly good professor in terms of organization and is beyond liberal in assigning letter grades, and he's been teaching this course for a while, but I suspect there's plenty of room for improvement in this class.\nThe content of the class is very interesting, and if you read the textbook (Ryden), you'll find it very engaging and at times hilarious. Ryden is comfortable yet rigorous, an absolute joy to read, and the only reason I passed. Note that you're studying the whole universe at once, so be prepared for some distance from reality. But also be prepared for some truly awesome physics.\nMake sure you're prepared for this class -- if you haven't had a calculus course or some introductory physics, a good two thirds of the material, especially formula derivations, will not make any sense to you. It's also probably a good idea to take Intro to Astrophysics (C2001-2) beforehand, even though it's technically not a prerequisite.\nNow onto the negatives. Prof. Haiman is a very smart man, and the structure was all there, but I think sometimes his expectations of us students were confused with those he has of the graduate version of this course -- and his tendency to speak softly, while endearing, can often be a soporific to an overworked college student. \nAt the same time, a lot of the class environment is participation, and in order to really get a lot out of the class, you have to be engaged. Perhaps it comes with the territory in a class with 7 students. But Zoltan asks students to come prepared with questions every class, so it's a good idea to have done the reading beforehand.\nProf. Haiman's problem sets and midterm were often challenging in the extreme, and some problems required a significant level of external knowledge beyond the course. Some problems were also worded confusingly -- it was hard for us to tell what he was asking, or exactly what methods we were to use to solve it. However, Zoltan's willingness to allow students to collaborate, and his permission on two-day extensions on problem sets due on Mondays, proves that he acknowledged the coursework was (probably intentionally) difficult. The final exam was also much easier than either the midterm or the problem sets, so he noted that as well.\nWorkload:\nSix problem sets every two weeks or so (start these *early*, use the textbook, and work with fellow classmates) (40%), an in-class midterm (20%) and a 10-problem final (30%).\n"
        }
    ]
}