{
    "prof_info": [
        {
            "prof_name": "David Adams",
            "prof_id": 429,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Physical Chemistry I",
            "review_date": "January 21, 2004",
            "review_content": "\nI think Adams is an exceedingly nice guy who relates and cares about students.  He has a relaxed, approachable manner that put me at ease.  He's also  really smart, which means he sometimes leaves a class in the dark without realizing it.  At the end of the semester, he insisted that people who had 2 other exams take all 3 one the same day - a mistake in my opinion.  It pissed a lot of people off, so I think there's some bad blood there.  But his exams and grading were extraordinarily fair in my opinion.  He will actually test you to understand the material, not regurgitate it.  If you want to actually put in the time to learn something, I think you'll like Adams, if not, take a pass.  Memorizers beware.\nWorkload:\nproblem sets due each week including exam weeks, 2-3 midterms and a big final. you got to drop a grade.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "April 05, 2003",
            "review_content": "\nAdams is perhaps the worst teacher I have ever had.  While lecturing, he spends several minutes drawing complex molecular diagrams, mistakenly assuming that the majority of the class can follow his bizzare teaching style.  He wrote a devilishly difficult midterm, then sent all of his students a bitter and condescending letter at the end of the year.  Avoid this class if you can--it's likely worth taking honors chemistry to escape Adams.\nWorkload:\nNo homework, but his midterm and his section of the final are ridiculously hard.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 23, 2003",
            "review_content": "\nProfessor Adams is by far the worst chemistry teacher that I have ever had. I took chem in high school and loved it, but his awful teaching has made me hate chemistry as well as terrify me for the full organic chemistry course. Adams teaches the organic chemistry section of the first semester of General Chemistry. \nHis lectures consisted of him drawing litle \"cartoons\" on the board of different organic reactions- the pictures were so small that everything in my notes looked exactly the same, making studying very difficult. His lessons have no structure- he just runs around from board to board drawing pictures  and the entire class has no idea what to do. His review session filled up the entire auditorium- every seat was taken- because nobody understood. This caused the mean grade on his exam to be a 12 out of 25. \nI think that he must have gotten a lot of complaints because he wrote the entire class a really bitter email. However, I think he realizes that he is a bad teacher and that the exam was unfair because his portion of the final gave essentially the same exact questions as were on his exam, allowing those of us who did not do so well to get some more answers right, even though we had no idea why they were correct.\nWorkload:\nOptional problems and a really hard exam. He says that the exam comes straight from class and from problems in the book, but unless you're relaly good at memorizing every mundane detail  of the book and being able to tell the difference between every single stupid drawing, you are going to struggle. Sorry premeds, you can't escape this class unless you take intensive.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 16, 2003",
            "review_content": "\nAdams' lectures on organic chemistry were scattered, confusing, and often seemingly off-topic. He frequently spends five or ten minutes drawing and narrating a huge reaction diagram and then, when it doesn't work out in a predictable way, tells the class that it really didn't matter anyway. As the exam approached he became more honest about what he really wanted the class to know, but many exam questions still seemed to come completely out of left field. He also sent out a rather unpleasant email after the exam scolding students who complained about doing badly for \"immature behaviour\".\nWorkload:\nProblems in the book as well as handouts, none of them checked.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 13, 2002",
            "review_content": "\nThink his mad-scientist haircut makes him more interesting in class? Think again. After finishing up the first 2/3 of the portion of the course not learning a thing with friendly but off-track Dr. Fine and with the boring Dr. Friesner, I expected Dr. Adams to make everything click and make the worth at least somewhat worthwhile. I could not have been more wrong. Dr. Adams is in charge of \"teaching\" the organic chemistry portion of this course. His \"teaching\" consists of writing structures and organic reactions on the board without explaining them, leaving everyone in the lecture hall dazed and confused. He shows absolutely no mercy on his midterm (the third). This was particularly annoying considering I went to his office hours the day before and he said the exam was easy. The questions are impossible. The mean grade was a 12/25 on this multiple choice exam. This exam is COMPLETELY based on luck, not how well you know the concepts or how well you prepared. Some people complained, so he wrote the whole class a defensive e-mail, essentially telling us to grow up. Dr. Adams may seem nice on the surface, but he is evil when it comes to academics. Do yourself a favor and take advanced chemistry, NOT C1403 general chem. Save yourself a semester and actually learn something.\nWorkload:\nOptional problem sets and HOURS and HOURS of self-teaching from the unhelpful textbook. Three multiple-choice, 25-question midterms, one multiple choice 40-question final exam, an annoying chemwrite essay on your choice of chem book from a list.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 19, 2002",
            "review_content": "\nMy first impression of Prof. Adams was that he seemed like a hard and demanding teacher. He speaks a lot of scientific jargon and tends to drone on a subject without explaining clearly. His lectures in organic chemistry are incomprehensible if you have no background in it at all. He draws nice diagrams of organic reactions on the board but granted if you do not understand the mechanisms, how can you predict what happens in a reaction. The notes he writes on the board are from his own lecture notes. He clearly does not care for teaching only his reseach in spectroscopy. But his exams test whether you attend lecture class and copy his notes. He does not adhere to the textbook and often likes to supplement to it. I think Adams is snotty and condescending because when I asked him a question after class, he looked at me as if I asked a stupid question. But if you want to do well on Adams' exam which is like the hardest exam, try to memorize and understand your notes, read the textbook, do his old exams, and do his assigned problems. Surprisingly, I did the best on Adams' exam than the other two exams and it was the hardest. So he isn't that bad after all. Good Luck.\nWorkload:\nHe never checks the assignment so it is what you make of it. So please if you want to do well, do your self a favor and attend lecture and do his assigned problems.\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "January 10, 2002",
            "review_content": "\nProfessor adams is a nice guy, but expects you to really already know a lot of chemistry before he gets to you. He taught the organic chemistry section of the semester and wound up just scribbling complicated equations on the board. But if you go to lecture, and try to generalize the information he provides in class, you'll be ok. If you end up skipping class all the time, you'll get burned because he sometimes talks about stuff not in the book and likes to test you on it. Overall, he's not so bad. but make sure you go to class and do some of the problems he gives.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 03, 2001",
            "review_content": "\nRUN RUN RUN AND DON'T TURN BACK. You might as well not go to lecture since this man (not a professor, he can't teach for his life) just spits out random facts and you won't understand them! I suggest taking F1403! The combo of Fine, Freisner, and Adams = headache, nausea, upset stomach, failure, and there's NO CURE. The rumor is true, G-Chem can be harder than Intensive. At least for Intensive, you have a working Prof.\nWorkload:\n3 exams, 1 final, 1 paper, and recitation. WorkLOAD is manageable, but you won't understand the work.\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "December 31, 1999",
            "review_content": "\nTerrible terrible terrible! It's Prof Adams' first year teaching, to be sure, but that's no excuse. His teaching style includes droning on and on, scribbling arcane things on the board with little explanation, and an utter dearth of in-class demonstrations. Then, it seemed like he was trying to punish people who skipped his lectures when he wrote his test, but can you really blame students for walking out on a lecturer who obviously cares so little about whether they understand?\nWorkload:\nfor G-Chem: seven quizzes in recitation section, three tests and a final per semester. Adams also annoyingly assigns the EVEN problems, whose answers aren't in the back of the book.\n"
        }
    ]
}