{
    "prof_info": [
        {
            "prof_name": "Atle Gjelsvik",
            "prof_id": 628,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Mechanics",
            "review_date": "January 30, 2003",
            "review_content": "\nMost people love Prof. Gjelsvik. He is very knowledgeable about various applications of engineering and will do an excellent job demonstrating the practical aspects of the engineering in everyday life. His will likely be one of the most poorly structured classes in the department, and that may or may not bother you. There is no text to refer to, which I found somewhat annoying, but if you attend lectures (and you must for this course), you will likely be fine.\nWorkload:\nA weekly homework, two midterms, and a final. Some problems are rather challenging and are not necessarily mere applications of things learned in class. Others he works out in lecture, so you can basically copy them over and hand them in.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 03, 2001",
            "review_content": "\nProf. Gjelsvik is a knight of the old school of engineering. He is extremely animated and will try to make even the most attrocious material interesting. He cannot help deviating on amusing tangents that range from cranking up a WWII tank to where a turkey's center of gravity lies. His tests are fair, reflect the Homework and notes, and he grades on a straight 20pt. scale (A=80-100, B=60-80, C=40-60, etc.). There is no book for this class, so prepare to take it up the A__ if you don't go to class.\nWorkload:\nWeekly Graded Problem Sets; Two Midterms; Final.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "September 15, 2001",
            "review_content": "\nAtle is a great teacher - funny, understandable, and clear. He's like the really funny really smart grandfather you've always wanted. I'd take a class with him again. The only thing about this class was that there was basically no text - the texts were useful for formulas, that's it. There are no practice problems or exercises to help you get ready for the final, which is a lot harder than the midterms, which are based on examples given in class.\nWorkload:\nWeekly problem sets, 2 midterms, final.\n"
        },
        {
            "course_name": "Mechanics (Statics & Dynamics)",
            "review_date": "August 24, 2001",
            "review_content": "\nAtle is the shit. He is an old-school professor who has worked in industry and education for a long time and really knows what is going on, and how to teach. I would take the same class over with him anytime. He makes complex concepts easy; he could teach statistics to a third grader. He is also really entertaining to listen to... great stories. Funny accent a bonus.\nWorkload:\nWeekly problem sets, sometimes a bitch. If he thinks they are too hard, he usually would to them in class before they were due. Exams were just like the homework sets. not too hard to get an A.\n"
        },
        {
            "course_name": "Engineering and the Rise of Modern Industry",
            "review_date": "May 06, 2001",
            "review_content": "\nOne of the best profs at Columbia. He makes class fun. The class is very interesting. I highly recommend this class for CC students...if your SEAS and want a guaranteed A, then take this class. You'll learn all kinds of interesting factoids. You'll piss yourself laughing as Atle makes jokes and wisecracks with a heavy Norwegian accent. He is very approachable and will stay late to help you understand topics....\nWorkload:\nWeekly problem sets... some reading.. in class midterm and final for CC... paper for SEAS\n"
        }
    ]
}