{
    "prof_info": [
        {
            "prof_name": "Kartik Chandran",
            "prof_id": 4343,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Microbiology",
            "review_date": "April 05, 2016",
            "review_content": "\nFairly comprehensive Introductory Microbiology course. There is no Biology pre-req, but having taken Environmental Engineering with Chandran last year helped especially with kinetics. Everything pre-midterm was related to the structure, function, and replication of bacterial cells. Afterwards, it gets more relevant to Environmental Engineering, and there were many presentations and examples from Chandran's and Shashwat's (TA) own research with new bacterial genome sequencing techniques and bacterial treatments for wastewater resource recovery.\nShashwat is a better lecturer, explaning topics more clearly, and is very available for help in office hours. Chandran is very busy and can appear distracted, he's also pretty soft-spoken, so it helps to sit in the front.\nWorkload:\nNot bad, maybe 4 total homeworks straight out of the textbook, and similar memorization-only exams. 1 Midterm, 1 final, easy grading by the TA.\n"
        },
        {
            "course_name": "Environmental Engineering",
            "review_date": "January 04, 2014",
            "review_content": "\nThe course on introduction to environmental engineering (ciee e4252) is one of the few I have taken at Columbia in three years that actually focuses on actual environmental engineering.  Chandran actually is able to convey some very complex concepts in a very clear manner I beginners (although I think there were some Grad students in the class).  There are lot of real world examples and the course also stresses the importance solving real problems.  Lectures are very interactive and the professor encourages conversation during class.  Textbook might look scary, but you will only cover the most important material.  As long as you come to lecture and do the assignments you should be fine.  There was a field trip mentioned but in the end we ran out of time.\nWorkload:\nFour assignments, two exams, moderate load\n"
        },
        {
            "course_name": "Environmental Microbiology",
            "review_date": "May 02, 2013",
            "review_content": "\nKartik Chandran himself is a really nice person and a really good lecturer. The most I gained from this class was by attending (which is surprising for an engineering class). He explains the subjects matter well and successfully \"flips\" the classroom by asking a lot of questions and encouraging us to think rather than just sit and be talked at.\nThe material for the class is not too difficult. The central Dogma of Genetics and Biology and a stoichiometric and calculation approach to designing reactors inculding the rates of various types of microbes and such. The class although when you look at the syllabus seems hard it actually isnt because only a simpler, watered-down version of the material is actually presented. It is designed more for beginners who need to know some stuff about microbes to do engineering things with it rather than anything too in-depth so avoid it if that is what you are looking for. But it is interesting for a beginner (i understood the stuff even though i havent done biology in 6 years) and it was good to learn about these things. \nConsidering that most people who take this class take it because it is a eee requirement and have to take it the advice i can give them is that if you want to take that 6th class but are scared you will be swamped with work you can write this class off as something with less work and take it.\nFor grad students (you also have to write a paper for this class and the four things count for 25% each) this class might be a bit too basic for you if you want to study microbiology seriously\n\nWorkload:\nGrading. I havent really made up my mind whether this was a good thing or a bad thing but the class is really easy to get by on. There are four homeworks that count for 33.33% of your grade which are quite easy. There is a take-home midterm and take home final (33.33% each) which are very easy and googleable. This is good because you can get away with doing minimum work. It is not good because you can get away with doing minimum work so you dont necessarily get much out of this class. Classes where I was required to actually learn the material for exams definitely made the stuff stay with me longer. Because you never have to sit down and learn anything for this class you forget what was taught and just remember that molecules do shit inside these things called microbes and you can calculate some things about them. \n"
        },
        {
            "course_name": "Environmental Microbiology",
            "review_date": "July 14, 2011",
            "review_content": "\nProfessor Chandran is a kind, intelligent guy.\nThis class is a bit odd, though.\nNOTE: This is not a review of Chandran in the context of a core EEE class. This is for EEE 3901 Environmental Microbiology, which I took as a technical elective.\nThe class is pretty easy overall. Lectures cover A TON of information, but you should not fret. Honestly, unless you never come to class or read his powerpoints online, you'll be fine.\nAgain, Chandran moves very fast and covers a large chunk of Biology and Environmental Engineering very rapidly. The good thing is that the work load is very small, and therefore it essentially only skims the surface of all the material.\nThe textbook helps for the latter few problem sets, but other than that, his powerpoints (posted online) and general google searches will provide all the other information you need.\nThe lectures toward the end of the course get very complicated, very fast. But again, don't fret. The last problem set or two, and the final exam feature some Bio-sludge reactor design problems, but they're pretty straightforward and follow textbook examples pretty closely.\nNOTE: There is no need to have prior knowledge of Biology, EEE, nor Microbiology.\nOverall an enjoyable and manageable class. I certainly learned a lot. It ended up not being very interesting to me, but I rarely dreaded going to class. Chandran asks the class to check understanding about every 6 minutes, but then just continues on unless there's some grave objection.\nWorkload:\n-5 or 6 problem sets\n-A takehome midterm (honor system; 2 hour time limit)\n-A takehome final (honor system; 2 hour time limit)\n-Each of the above components is 33% of your grade.\n-I got a 57% on the midterm (not cuz it was hard, I just made a really big, stupid mistake) and still got a B+\n"
        }
    ]
}