{
    "prof_info": [
        {
            "prof_name": "Nelson Kim",
            "prof_id": 4741,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "April 11, 2012",
            "review_content": "\nI enjoyed this class immensely but that may be because I'm just really interested in film. Nelson's not the most captivating lecturer but he knows his stuff and dictates short discussions well after the movies. Plus his film picks are always good.\nListen to Nelson's analysis and comments after the movies and take notes and you can just skim the readings to do well on the midterm/final. My TA was AWESOME. All around very chill class.\nWorkload:\ninteresting readings if you're into film\neasy midterm pulled straight from his lecture comments\nscene analysis paper that's time consuming but fun\ntake home final\n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "July 25, 2010",
            "review_content": "\nNelson is an awesome guy and one of the best lecturers I've had here so far. He knows the films and readings extremely well and is always able and willing to answer questions in class. Each session generally begins with some background on the film movement being discussed.  We then watched a film and talked about it. Despite the fact that the class is nearly 4 hours long, I was rarely ever bored and I always looked forward to coming to class. This course is not only an awesome introduction to the film major, it is also a fantastic course for anyway who enjoys watching films.  Professor Kim helps you truly appreciate quality films and enables you to watch movies in a new, more critical, and more fulfilling way. \nWorkload:\nmoderate amounts of reading every week that are necessary if you want to get anything of the discussion sections\n1 5-page shot-by-shot analysis of a scene that is genuinely fun to write\nmidterm with ID's and short essays\nnon-cumulative final with ID's and essays\n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "May 02, 2010",
            "review_content": "\nProfessor Kim was a really great lecturer. Not at all egotistical, just straightforward and informative. Which is not to say he's a dry professor, just that he definitely lets the films do the entertaining. He's also really approachable and friendly. The workload is pretty light. There are weekly readings which are pretty lengthy, but not all are necessary. The ones at the beginning are important to your understanding and some of them are mentioned on the midtem and final, but as the semester goes on they get less and less important. The midterm is fair, and the final isn't cumulative (!) which is awesome. Plus, the movies we watch are excellent. I'm gonna miss this class. \nWorkload:\nOne 5-page shot by shot analysis, one midterm, one final. All of these are graded by your TA. No surprises. \n"
        }
    ]
}