{
    "prof_info": [
        {
            "prof_name": "Eliza Schrader",
            "prof_id": 12703,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "June 08, 2015",
            "review_content": "\nThis semester with Eliza was much greater than expected. I don't quite understand all of the negative Culpa reviews because the class was fun to be in. The people were great and Eliza was great. In class she was both funny and caring. As far as writing goes, she wasn't as tough as I expected her to be from reading these reviews. I went into this class being a pretty bad writer, but I was still able to come out of it with a B+. Eliza puts a lot of effort into helping her students, and I admire hat about her. She really cared that we did well and that we improved our writing. Yes the class is a lot of work, but that goes with any UW class. Overall, I feel as though Eliza was a great instructor, and I'm very happy with my decision to pick her class. \nWorkload:\nPretty heavy, but that goes with any UW class\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 01, 2015",
            "review_content": "\nShe is probably one of the worse University Writing teachers you'll meet. \nWorkload:\n4 papers - rough drafts before final draft. Couple of required meetings with her to discuss writing process. \n"
        },
        {
            "course_name": "university writing",
            "review_date": "November 14, 2013",
            "review_content": "\nENGL F1010 (University Writing for GS)\nWe call her \"Shredder\"\nProfessor Schrader will keep you on your toes and challenge you to back up what you write/say in class. You cannot spout big-worder nonsense and expect her not to call you on it. She wants clear thinking and writing. She is not easy, but it isn't an easy class. \nShe does, however make you a better writer and thinker, which is the point of this class. If you want to be pushed into improving, take a writing class with her. If you're a wallflower and want to be safe in your bubble of superiority, don't.\nI would take another class with her, but then, I'm here to learn and don't care if it's \"hard\".\nWorkload:\nIt's UW, so, the workload is considerable. 4 essays, lots of reading and writing assignments. 2 required conferences with her in the Writing Center. It's tough work, but worth the effort.\n"
        }
    ]
}