{
    "prof_info": [
        {
            "prof_name": "Christopher Peacocke",
            "prof_id": 2395,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Major Seminar in Philosophy: Subjects of Consciousness",
            "review_date": "November 06, 2009",
            "review_content": "\nPeacocke is a very bright professor. The other reviews are not completely accurate in saying that he is not good for undergraduates. The rule of thumb is, don't take his class if you don't already have a large amount of knowledge in the subject. For example, when I was a sophomore, I took subjects of consciousness with him, and I got a lot of the class, but I had taking philosophy of mind, philosophy of psychology, and I am also a psychology major as well as a philosophy major. Some people had never done any philosophy of mind and were lost, so those are the people who might think Peacocke is bad for undergraduates. Also, he is teaching philosophy of psychology in the Spring of 2010, which will probably be a great class if you know anything about psychology or philosophy of mind. If you don't you might want to talk to him first.\nWorkload:\n1 presentation; 1 paper. Moderately hard grader.\n"
        },
        {
            "course_name": "Metaphysics",
            "review_date": "May 22, 2005",
            "review_content": "\nThe review below was completely accurate, except that it didn't really explain how bad a professor Peacocke is for regular undergraduates.\nFirst of all, let's talk about how he conducts his lectures. The first half, or so, of lecture is a student presentation on the assigned reading. The reading is really friggin' difficult and not a single student in the class ever understood what the author was saying (I was, I'm pretty sure, among the very top scorers on both the midterm and final, and I understood pretty much nothing of the readings or the lectures. Over half the class failed the midterm an I got a solid 'A' on it - so if I got an 'A' understanding what little I did, I'm sure almost nobody else understood anything either. ). So a poor student has to get up there in front of the whole class and mumble for twenty minutes about something she doesn't know a thing about (usually she just reads aloud a written summary of the paper - made up of verbatim lines from the text in the order the author wrote them - without even attempting to give a comprehensive analysis of what the author was trying to say), and the poor audience meanwhile just sits there and stares into space hoping the speaker finishes soon. Peacocke is a horrible lecturer, but he's still a hell of a lot better than a nervous undergraduate.\nSo, after the speaker finishes, Peacocke always says the same thing: somthing like  \"that was a very thorough summary\" - and then he starts to mumble about the text, himself. Half the time I couldn't make out what he was saying, since he speaks softly - and when I could figure out the words they still made no sense. Peacocke is super famous as an analytic philosopher, and I'm sure whatever he was saying was really damned good. A bunch of us were cramming for the final in Butler, and some girl said something like \"you know, when you understand what Peacocke is saying it actually makes a lot more sense than the other guys we read.\" I don't doubt it, but the man is famously unclear (unclear as in hard to decipher - not necessarily confused in his thinking). How anyone can figure out what he's saying is beyond me. He has a huge reputation for lack of clarity among other philosophers (he and this guy McDowell from Pittsburgh are supposed to rival each other in lack of clarity. I can't believe anyone is a more unclear writer than Peacocke, though).\nAnyways, so the portion of the lecture when he actually speaks is just as horrible as the portion where the undergrads speak. So at the end of it all, nobody knows a damned thing about metaphysics. And then we're supposed to be tested on this stuff? And he's disappointed when we all fail? \nOh, and he wouln't budge when we asked him not to make the final cumulative. If we're having such a hard time, at least narrow down the number of texts we're responsible for. Nope. \nThe upshot is pretty much the same as the review below: Peacocke is probably really good for a person who wants to pursue analytic philosophy in grad school. He's totally into formal logic and stuff like that, so math people would benefit from him as well. He is absolutely horrible in lecture, so I would recommend only taking seminars with him, if you're going to take him at all. I would warn most students not to take him, though - he's probably brilliant, but you won't learn from him, since he can't teach well.\nWorkload:\nMidterm, Final. Final is cumulative. For our class, the final counted for the entire grade. Because so many people failed the midterm, Peacocke wanted to make it so everyone still had the chance to do well in the course, so the final counted for pretty much everything.\nLittle reading - one or two 10-15 page articles per class - but it's really damned difficult and technical stuff. I would *STRONGLY* recommend taking symbolic logic before taking a course with Peacocke. \n"
        },
        {
            "course_name": "Senior Seminar (Perception)",
            "review_date": "January 03, 2005",
            "review_content": "\nPeacocke has written extensively and successfully on a variety of topics in philosophy, and his expertise is apparent in his teaching.  This is good and bad in that unless you're serious about the topic, you are likely to find his class to be a little too technical.  His teaching seems geared towards those who wish to BE philosophers, or at least pursue some serious graduate study in the field.  If you are one of these students, by all means, take his class because like I said, he's as talented as they come (google him if you don't want to take my word for it).\nWorkload:\nIntense, technical reading; a brief presentation on one of the readings and a 20-25 page final ppr, graded stirctly but probably fairly even though I would have liked a better grade after putting in that much work.  Start early on the paper - it only gets harder to stay technically specific and consistent as you progress.\n"
        }
    ]
}