{
    "prof_info": [
        {
            "prof_name": "Victoria Tzotzkova",
            "prof_id": 789,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "June 22, 2004",
            "review_content": "\nCharmingly, gracefully sweet person.  She is always cheerful, attentive to every student, knowledgeable and a talented pianist (very modest about it).  You'll wish you were born the same year she was-- just so you could have been friends with her in high school.\nWorkload:\nNothing to speak of.  Fun!\n"
        },
        {
            "course_name": "Ear Training IV",
            "review_date": "January 04, 2004",
            "review_content": "\nVictoriaÂ’s teaching style is not rigorous, but it is certainly the most effective method of ear training. Her class is geared to the theory courses, but at the same time, is able to meet the needs of individual students even during the short class time (50 min). She is extremely nice about absences, and very flexible with the few outside assignments of the semester (nothing hard at all). YouÂ’ll definitely want to take Victoria if youÂ’re in any of Prof. CohenÂ’s classes Â– because sheÂ’ll really improve youÂ’re intuition in harmonic function and progression Â– CohenÂ’s pet peve. \nWorkload:\nA few quizzes, and a few out of class transcriptions, no outside prep necessary whatsoever.\n"
        },
        {
            "course_name": "Ear Training II",
            "review_date": "May 14, 2002",
            "review_content": "\nReally great instructor. Gives every student individual help throughout class, and makes herself very available outside class for extra help. Really friendly and nice as well, so class isn't awkward, as some small 50 minute classes can be. And she really kicked some major ass getting the 10 of us to sing at 9:00am - i don't know how she did it, but she did!\nWorkload:\n2 short tests; light, light homework (like 30 minutes a week MAX)\n"
        },
        {
            "course_name": "Ear-Training",
            "review_date": "May 04, 2002",
            "review_content": "\nAll she wants is for you to leave the class having learned something. She is never critical or impatient and will spend as much extra time with you as you'd like if you're not getting the key concepts of the course. Victoria is such a sweetie; I don't think anybody could complain about having her as a TA.\nWorkload:\nVery light. Three short in-class exams. You don't have to do most of the homework. Not a problem. \n"
        },
        {
            "course_name": "V2315 Ear-Training II",
            "review_date": "December 11, 2001",
            "review_content": "\nSo so so so so nice. She teaches very well, and never ever ever gets angry or impatient. She gives every student individual attention (also due to the small class size) so all problems can be corrected. Always speak up and ask if you have questions. Tzotzkova teaches at a nice and easy pace, so you should be fine in this class.\nWorkload:\nSimple homework, a few tests. Not bad at all.\n"
        },
        {
            "course_name": "V2315 Ear-Training II",
            "review_date": "December 03, 2001",
            "review_content": "\nReally nice and dedicated to helping you succeed. This is one of those classes that's sort of hard to screw up, but Victoria is definitely a teacher you should be happy to see on your schedule.\nWorkload:\nVirtually zero. A few easy exams, occasional homework you don't have to do.\n"
        }
    ]
}