{
    "prof_info": [
        {
            "prof_name": "Francois Charest",
            "prof_id": 12488,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "June 21, 2013",
            "review_content": "\nDO NOT TAKE THIS CLASS WITH CHAREST. Yes, as other reviewers stated, Francois seems like he's passionate about math, but perhaps his actual mathematical ability is lost in translation. He made very simple concepts seem extremely confusing, so you can imagine the frustration once the concepts began to increase in difficulty. Yea, he's a nice guy. But that can only go so far. Even in office hours he made concepts seem difficult. The midterm and final were NOTHING like the practice problems we did and when I went to ask questions about the midterm, he flipped through the exam and simply I said I need to review concepts.... gee... thanks. Save yourself the time and effort and FIND A DIFFERENT PROFESSOR. \nWorkload:\nweekly homework that is pretty easy on webassign... but are not very helpful when test time comes around.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "June 15, 2013",
            "review_content": "\nThis professor is nice but his class sucked! The webassign was manageable because of the \"practice another version\" and the \"Watch it\" and \"master it\" videos, but the exams were hard. If you want a good grade, don't take his class. He puts a lot of trigonometric problems in his exams even though the homework only focuses on MOSTLY algebra type problems, therefore no matter how much one studies, one is still unprepared for the exams. I took hours to complete the written homework - it was crazy! To add to the frustration, when the exam comes around the homework does not help!! Take his class with caution!\nWorkload:\nWeekly webassign (10%) - drops the lowest 2 - Weekly homework - (10%), 2 hard midterms (30%) and 1 final (40%). \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "May 09, 2013",
            "review_content": "\nProfessor Charest is clearly passionate about math, but has left our class struggling to figure out the material all semester. While homework problems and weekly WebAssign sets are easy and tangentially related to the material covered in class, the two midterms were on completely different material and felt like a foreign language as a student not already well versed in calculus.\nI felt like I struggled to sneak by in this class, even though I had no problem with the homework problems, because of the unpredictable nature of the material covered on exams. If you're looking for a professor who lays out the basics of calculus in a user-friendly way, look elsewhere.\nWorkload:\nWeekly WebAssign and dropbox problem sets, two midterms (really difficult) and one final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 09, 2013",
            "review_content": "\nHe is such a sweet heart and it seems like he really cares about math. Unfortunately, he teaches you one thing in class and then gives you an exam on completely different material. Calculus 1 was more of an Applied Mathematics course than anything. The weekly WebAssign and Drop Box Homeworks had absolutely nothing to do with the exams. I totally understood the material but ended up always getting half of the problems right on the exams. Professor Charest just hasn't figured out how to teach properly yet. You should only really take this class if you're literate in calculus. If you're a newbie, you definitely need to go somewhere else.\nWorkload:\nWeekly WebAssign homework, and weekly Drop Box homework. 2 excruciatingly difficult midterms. 1 final. Drops lowest WA and DB grade.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 15, 2012",
            "review_content": "\nHe's a new teacher, definitely, so this may be the only review on CULPA. Lucky for you, you'll get a very one-sided review of my dear old professor (he's not actually old - he looks like he's barely hit puberty).\nYes, Professor Charest can be considered attractive with is boyish charm and nervous behaviors. However, that might be his only usefulness to you. His accent is understandable, but he struggles to express basic math terms, which is distracting and often confusing. \nHe teaches directly from the textbook, providing no real \"life\" or insight to the material. If his lack of energy is not discouraging enough, consider this: he is entirely and utterly incapable of responding to a question. Often times when people asked for review on older concepts, like completing the square, he responded with \"Yes, this is tricky. Its magic\". No, I am not kidding, he has referred to concepts as magic. \nLucky enough, his tests are easier than the homework, however, this leaves little room to really know what to study. Out a three chapter unit, he will provide a five question test, meaning that you may study hours to find that none of the concepts are being tested. \nWith this being said, the grading policy is definitely fair. There's two tests and a final, with online and textbook homework. The homework altogether is 20%, two tests are 25%, final is 30%. The lowest homework is dropped.\n\nWorkload:\nAbout 1-2 hours a week of non-optional homework.\n\n"
        }
    ]
}