{
    "prof_info": [
        {
            "prof_name": "Loren  Wolfe",
            "prof_id": 12579,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary French I",
            "review_date": "May 13, 2015",
            "review_content": "\nLoren is THE BEST. She absolutely deserves her gold nugget. She makes the class very manageable and easy to understand, and she never assigns too much work. Her class is also fun and social, with games and French songs. If you like sing-along, then this class is for you. \nLoren is also a fabulous dresser. Some people would say this is an unimportant quality in a professor, but I found it very inspiring seeing her all matching and in heels every day at 9am. It also makes you want to go to Paris, where everyone dresses fabulously - and making you want to go to Paris is really the goal of any intro French class. \nLoren is also so caring, understanding and approachable. If I ever had a problem understanding something or with an administrative thing, she would be so helpful. She is also a very easy grader if she sees that you are putting in effort. I got an A for this class both semesters, even though I got less than an A on several quizzes. \nTake her for Elementary French 1 and 2 if you can, because the continuity is great. But take her for either, because she is fun, interesting, an easy grader and an overall nice person who will teach you French in the best way possible!\nWorkload:\nElementary 1: 4 quizzes, lowest dropped. Midterm, final. You have to hand in workbook chapters with every quiz. This was time consuming but you are only graded on completion and on correcting your work (so not difficult). Supposedly 3 compositions but we only did 2. \nElementary 2: similar format with 4 quizzes, lowest dropped, midterm, final, handing in your workbook before every quiz. Supposedly 3 compositions but we only did 1 (!). We also did group skits. I am not even sure if she graded these but they were what we did for the last week and a half of the semester. Also we read a play (Huis Clos) which we were never tested on at all. Strange, but very chill. And a cool play.  \n"
        },
        {
            "course_name": "Elementary and Intermediate French",
            "review_date": "October 04, 2014",
            "review_content": "\nProfessor Wolfe is simply brilliant. I came to her Elementary French I class having received no prior education in French, and just a year later I'm thinking of it as my second language. I've learned so unbelievably much in this short time, and I attribute that to her fabulous, nurturing personality and phenomenal teaching style. Prof Wolfe consistently creates some of the most comfortable classroom environments I've ever been in -- and that's saying a lot coming from a non-traditional (read: much older than average) student. I love how she encourages not only casual conversation and participation from everyone, but also rigorous engagement with French history and culture. Her efforts alone inspired me to study abroad and take her \"Paris In Context\" class -- in Paris!!! -- over this past summer. Of course, my life has been forever changed. \nI can't imagine how different my summer would have been without \"Paris in Context,\" as the curriculum curated an intimate introduction to the city through engagement with museum exhibitions, historical monuments, restaurants, music, night life, traditional summer events, the list goes on. Each week, Prof Wolfe split the class into small rotating groups assigned to 9 or 10 eclectic city visits. We then presented on different aspects of our collective visits, mainly through subjective responses, current events, and critical French literature. This was my first experience with a French \"elective\" outside of my language requirement, and I was challenged in terribly frustrating and invariably motivational ways. There were many moments when my skills weren't advanced enough to communicate my \"very collegiate level\" ideas on the social world, so the class pushed me to new levels of expression and a general commitment to progress and master more of the nuances that come with French. This is a fun and critical course for a serious student who's willing to put in the time and energy it takes to engage with the material and offer meaningful contributions to discussions (and also visit ALL the amazingly dreamy parts of Paris as a requirement).\nIt could be easy to feel like the underdog in language courses at Columba/Barnard, but Prof Wolfe effectively teaches to every level in the class. Not once have I ever felt that I couldn't figure out a tricky grammar rule or tackle a written response to a lengthy article in French. Everyone should experience a professor like her! She's also one of the sweetest, most understanding people I know, who cares so much about her students' absorption and enjoyment of the language and always takes the extra time to make sure we're really grasping the material. I would go on and on but I think you're getting the point. Regardless of your level of exposure to or proficiency with French, take her class! If you're considering studying abroad in Paris, take her class! Even if you don't go to Barnard and are nervous about learning a new language with traditional-aged students, take her class! You will have no regrets, you will leave with a deeper passion for the language and culture, you will feel more accomplished, inspired, and smarter than before you started, I promise.  \n\nWorkload:\nRigorous but not too strenuous, typical of all languages at Columbia. Being consistent is key -- an hour a day of language practice, a text to work through and discuss every week, vocab and/or grammar quizzes every few weeks, midterm, final. If you do a little bit each day, you will progress with ease and should do quite well. She's also amazing for one-on-one coaching during office hours. Take her class!\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "July 02, 2013",
            "review_content": "\nOkay I think the below reviews pretty much covered it. Loren Wolfe is a gem. She is unbelievably nice, funny, helpful, smart and not to mention extremely fashionable. She helped me through a personal crisis once when she did NOT have to. She is so unbelievably caring I can't even express it. Also the easiest grader ever. I got an A+ first semester and an A the second semester. She made me want to get up every morning after either being in Butler or Mel's till 3 am. She's brilliant and I feel lucky to have had the opportunity to learn from her. TAKE HER CLASS \nWorkload:\nEASY! YOU SHOULDN'T GET LESS THAN AN A! \n3-4 quizzes per semester, workbooks turned in whenever, 3 compositions with revisions, an easy midterm and final. \n\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "June 05, 2013",
            "review_content": "\nI am the laziest person alive BUT for Professor Wolfe I will never be because she is just too fabulous! Honestly, she is AMAZING! I can't imagine a better professor then her. I took her Elementary French I class and was surprised as to how much I learned in one semester in comparison to the French I learned for three years in high school. Not only is she beautiful to look at, but her poise, intelligence, and creativity just brightens everyone's faces up. I was so happy with how first semester turned out so I decided to take her class again for Elementary French II. Both of these classes took place at 9:00am. Yes, I know, its way too early for anyone. But her persona will drag you into her class unconsciously. I TRULY enjoyed taking her classes for two semesters. Besides how great she is as a person, her work ethic is really clear cut and concise. You will earn the grade you deserve. She is very understandable and thus offers extra credit opportunities and just bonus points for showing effort and dedication. As nice as she is, she expects you to be in class to learn French and try. Professor Wolfe is human and understands that we will not speak as eloquently as a native french speaker but she will applaud you for trying. For both semesters I earned an A- and I did it by truly showing her that I am driven to learn and completing all necessary work. All in all, this culpa review is written to express how great she is as a professor and that anyone who has her as a professor won't be disappointed. \nWorkload:\nHer workload is not so heavy. We will have 3-4 quizzes/tests throughout the semester. Before every quiz/test, she expects a few worksheet pages to be completed from a given workbook. Also, we may group projects that are creative and fun here and there. Overall, its definitely manageable and she is completely understanding so don't feel weird to reach out to her because she won't bite!\n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "April 30, 2013",
            "review_content": "\nProfessor Wolfe is possibly the best teacher I have had at Barnard/Columbia thus far.  Not only is she enthusiastic about her subject, she is enthusiastic about her students and genuinely wants them to succeed.  She is also interested in her students on a personal level and every Monday, for the few minutes before class starts, discusses what everyone did with their weekend.  Loren is so accommodating, understanding and is very flexible when it comes to missed classes (illness, religious observance, etc), making up exams/quizzes, and extra credit.  \nHaving had her for both Elementary I and Elementary II not much about her teaching style was different in Elementary II, but the course seemed to move faster through the material than it did first semester.  By Elementary II she expects only French to be spoken in class with classmates, but if you need a concept clarified, you can ask her in English and she will explain it to you in English.  She really explains the material in depth and encourages her students to ask questions.\nLoren is also wonderful when it comes to office hours.  She sits with you and will write you example sentences and reference sheets on the material, while you are sitting in front of her.  She won't let you walk out of your meeting not understanding a concept!\nAll in all - her class(es) were a joy to take and I have loved learning from her.  Definitely worthy of many more positive reviews!\nWorkload:\n2 in-class quizzes,1 midterm, final, and 3 200-word compositions. There are also the accompanying chapter workbooks to be handed in on quiz days, but she is VERY flexible (i.e. as long as they are submitted by the final you won't get penalized).  For extra credit, 1 movie viewing and 400-word essay on the film as well as a 400-word \"book report\" on a French play we read on our own time outside of class.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 31, 2012",
            "review_content": "\nLoren Wolfe is a fabulous addition to the Barnard faculty. She is possibly the nicest woman alive and goes out of her way for her students and truly wants each one to succeed. She is so down to earth and at times I forgot that she was a teacher as well as a friend. \nHer exams are super straight forward and she takes off minimal points for repeated mistakes. I got an A+ in the class and all I really did was review my class notes every day, do the assigned work book and pay attention in class. \nThat said languages come easily to me but if they don't and she sees you are putting in effort she will totally boost your final grade. She honestly made me look forward to her class at 9 am every day, even on Fridays. She loves French and really wants her students to love it to. She succeeded with me. If I hadn't come to it so late I would major in it. \nP.s. Not only is she an amazing teacher but her fashion sense is impeccable! Entertaining just to look at her different outfits every day! \nWorkload:\nWorkbook chapters to be handed in at each quiz. Easy 100s for your grade. Just make sure you do self corrections. \n4 easy quizzes lowest grade is dropped \n1 midterm that is super easy. I got a 99 and studied for maybe an hour \n3 compositions graded slightly harshly but she allows rewrites and averages the two grades \n1 departmental final that is slightly more difficult but she prepared you so well.\nOverall not bad at all!!!! \n"
        }
    ]
}