{
    "prof_info": [
        {
            "prof_name": "Jasia Pietrzak",
            "prof_id": 10576,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Cogntive Psychology",
            "review_date": "September 07, 2010",
            "review_content": "\nI have to agree with the previous reviews. Jasia made me feel stupid. She made me feel terribly about myself. She tainted my experience in Cognitive Psychology altogether, which is a shame because it could have been moderately enjoyable. Instead, it was terrible and I would not wish it on my worst enemy to take a class with Jasia. I can say with confidence that she is the worst professor I've ever had in college. Please do not take this class unless you have masochistic tendencies.   \nWorkload:\nReasonable for a lab, but excruciating and fruitless. \n"
        },
        {
            "course_name": "Social Psychology Lab",
            "review_date": "June 20, 2010",
            "review_content": "\nJasia is one of the worst professors I have ever had at Barnard. Not only is she arrogant and condescending, she does not care about her students and shows no interest in making lab interesting in anyway or even a beneficial learning experience. Basically, she makes powerpoints and reads word-for-word off of them and then occasionally asks broad questions to attempt to engage in the class. However, everyone is already so angry and bored that no one responds, which just results in silence making the class dynamics even more awkward and uncomfortable. Lab with her is a complete waste of three hours every week. You should find another instructor, especially as lab courses generally help to raise your psych grade but if you end up with Jasia, you will have to make up for her harsh grading in the lecture component while also being forced to listen to her patronizing tone every week. Was a really bad experience that you should try to avoid!!\nWorkload:\nPretty standard for a lab, however, the way she grades will add a lot of unnecessary stress.\n"
        },
        {
            "course_name": "Cogntive Psychology",
            "review_date": "May 06, 2010",
            "review_content": "\nThis lab instructor was the most terrible teacher in all of my years at Barnard. She was demeaning towards me and my fellow students and literally called a student stupid once. She treated us like we were all idiots for not knowing perfect APA style. I went to her office hours and did every correction she told me to make and then got the lowest mark out of all my graded assignments. When I approached her to try and understand why she shrugged and said, come to office hours WHICH I DID AND THEY WERE USELESS. She gave people half credit for assignments, and someone told me she had given her a one once! A disgusting person, harsh grader, overall a horrible choice.\nWorkload:\nunpleasant she is super nit picky about every tiny thing that any normal teacher would overlook\n"
        }
    ]
}