{
    "prof_info": [
        {
            "prof_name": "Martha Newland",
            "prof_id": 5674,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 25, 2015",
            "review_content": "\nIf you are lucky enough to end up in one of Prof Newland's sections for Music Hum, you've won the lottery!  A wonderful lecturer and great spirit!  I learned so much and the very manageable workload was a great balance to my other heavy load courses.  She's the best!\nWorkload:\nShort weekly readings (but paying attention in class and taking good notes is the other alternative), one short (750 words) musical analysis essay, one concert report (1500 words), midterm and final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 03, 2011",
            "review_content": "\nLove Marti. She's smart, enthusiastic, effective, all of that. She teaches methodically enough that you can excel without any intellectual curiosity, but she indulges the students who desire to go beyond Music Hum's checklist of proper nouns. Her academic background allows her to explore and explain a lot of ethnic music from modernish American history, while she's sufficiently aware of pop music that you don't get bogged down in theory.\nPlus, it's a fun class. We watched some videos, movies, heard some pieces, had some nice discussions, attended the opera. Boo to those who don't participate!\nWorkload:\nA few papers, midterm, final: none of it hard if you pay attention in class\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 17, 2011",
            "review_content": "\nMarti is full on brilliant and this was recognized by the University in her winning of an award for the best graduate instructor in Music Humanities. In addition to being smart, she is incredibly humble and never talks down to the class (and we asked inane questions all the time).  \nLike every instructor, she is limited by the Eurocentric motifs throughout the course, but she worked to include a few composers when she could, that were not \"dead, white, males\", an effort very much appreciated by the class.  My personal favorite was her inclusion of Clara Schumann's, Piano Scherzo Number 10, arguably the best piece we listened to all semester.\nIn addition, she was very clear about her expectations.  She gave us essay questions for the exams in advance, and was more than willing to provide guidance if we needed it.  I was very grateful, both to know what was expected, and to have her assistance in being sure that I met those expectations on the assignments.  \nI can't say enough nice things about her both as a person (she is very kind, genuine and willing to help you) and an instructor.  I was lucky to be in her section.\n\nWorkload:\nTwo papers, a midterm and a final.  \n"
        }
    ]
}