{
    "prof_info": [
        {
            "prof_name": "Nataliya Galifianakis",
            "prof_id": 10162,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "General Physiology",
            "review_date": "May 02, 2014",
            "review_content": "\nReally a great and sweet woman. Extremely knowleadgable about her material - you'll ask her a question and she will go like, super in depth  to a level you'd be surprised, given the breadth of what she teaches. Exams are super straightforward. THIS CLASS IS A MUCH BETTER PREPARATION FOR THE MCAT THAN MOSHOWITZ. In fact, intro to bio with moshowitz is almost a complete waste of time. Don't be frightened by mosho because of rumors that she 'writes questions for the mcat.' You want to take physio if you're taking the mcat - it covers pulmonary, cardiac, kidneys, digestive etc - all the areas that are heavily tested on the mcats, and in a level of detail commensurate with that exam. \nWorkload:\nQuizzes at the beginning of every class. basically just read last weeks lecture slides right before class and you're guaranteed a 4/5 at least. AND THEN she also lets you get the extra quiz point on the exam if you need them. 3 exams and a final, all pretty straightforward not too hard. Again, just read the lecture notes - she teaches to her test which is great. Her notes were more helpful than the textbook IMO. She's also great to talk to and very sweet. \n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "June 01, 2013",
            "review_content": "\nThis class is informative and extremely relevant for the MCAT.  Dr. G is a decent professor--she tries her hardest and is a very lenient and quick grader. She also works at NYU med, so she knows what she is talking about.  I don't it is hard to understand what she is saying 98% of the time, but sometimes she gets confused or doesn't explain things clearly.  Luckily, 90% of the in class notes come from the textbook, so you can always double check your notes with hers.  At the start of every class there is an inclass quiz--sometimes with ridiculous questions, but overall the quiz grade is 5% total (or 1.66% of the grade per unit) and you can earn up to 80% of the quiz grade for that unit on the exam.  As a result, during the first test, I went to class and paid attention, for the second test I paid half attention, and for the third test I would take the quizzes and leave, teaching myself the material from the textbook.  My exam grades did go down little by little, but I earned an A in the class so it is feasible to teach yourself the material.  Overall, physiology was an interesting, stressfree course that I think has provided me a good basis for medical school physiology next year.\nWorkload:\n3 tests, daily quizzes, a couple straight forward article assignments/ 'research assignments' that I wrote a page and a half for and got full credit each time.\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "April 28, 2012",
            "review_content": "\nNataliya isn't the greatest teacher, and saying that is a huge stretch, but considering how Tong for Biochemistry was unintelligible, she's better than him at least.\nNataliya has a Russian accent and is a Neuroscience researcher at NYU (her office is at NYU) but she got a PhD in Russia for Physiology I think, so that's why they hired her for this job. Personality wise, she's adorable and makes these \"non-funny\" jokes but it's hilarious cause of the way she says it in her accent....that said, she sometimes says stuff that doesn't make sense/her exam questions and quiz questions don't make sense because of the bad english. That said, she could definitely do well in Lit Hum/CC lol, if she were a columbia student, so her english isn't terrible.\nNataliya has powerpoint slides and she lectures basically nonstop and gives you a ton of information - she has a page of notes that she refers to when she herself is confused. I've seen it - it's packed with size 6 hand writing. Sometimes when people ask questions and she doesn't know the answer, she takes like 2-3 minutes reading her notes and then sometimes if she still does'nt know it, she BSes you with a weird ass answer and people accept it so she'll move on lol.\nTHe information she gives is 97% from the book, so really attending lecture is not necessary. On the 3rd to last day of class ,Nataliya didn't give us our daily quiz (i'll talk about that later) and she said at the beginning \"Okay, so no quiz today so you can leave\" and she didn't mean it as a joke. I counted that day, and out of 87 registered students, there was only 47, so only about half of the class shows up for lecture. \nThat said, her lectures HELP. They definitely do. They reinforce the material and what she tests on is completely from her lectures, like 100%, and the book gives you unneessary and too detailed information a lot of the times. However, like like I said, Nataliya speaks super fast and gives you so much info it's impossible to take it all down, so it's inevitable you'll miss information, which is why the book is necessary. I took notes on my laptop, powerpoint, and basically just typed super fast and copied word for word what she said. I think about half of the people who attended class did the same. \nOkay, so Nataliaya gives you daily quizzes (a drag), which is 5 multiple choice questions. You have about 8 quizzes per exam (so 8 lectures every exam) and each quiz is 5 points, so 40 points total. On her exams, there's an optional \"make up quiz\" section, which is 6 multiple choice questoins weighted 4 quiz points each, so you can make up like 80% of the quiz points. Also, the total quiz points per test is 35, so you already have 5 extra points from the 8 quizzes (7 x 5 = 35, 8 x 5 = 40). Her quiz makeup questions, however, are kinda harder than her daily quizzes....i usually got like 3-4/6...so I would advise people to attend class and take the quiz at the beginning for all quizzes, instead of being like \"i'll take 3 quizzes then do the quiz makeup\"....\nQuizzes and her online labs are 10% of your grade, so they do make a slight difference, since majority of people get near 100% in that, whiles some people only get like 95% of that....so that's like a 1% overall grade difference, which helps if you're in B+/A- range. \nHer online labs are PhysioEx 9.0 Lab exercises (you have to buy a manual). You do online \"labs\" which just involves following the lab manual instructions and then recording data and answering questions in your lab sheet...you take the quiz on courseworks which randomly generates 10 questions. The quetsions are exactly the same as on your lab review sheet, so that's why you have to do the lab to fill it in.\nHowever, lots of answers for the physio lab are online, or general answers you can find through wikipedia (ie: what does pepsin do), while others you might actually have to do some sections of the lab cause it's like \"which test tube (1-8) indicated signs of hyperglycemia\" and crap...\nSo Nataliay gives 3 Exams (no final), so the 3rd exam is the last day of class. Her exams usually composed of \"low weight\" MC section, \"high weight\" MC section, and short answers. \nHer low weight and high weight MC are just MC, but the low weight questions are 2 points each and high weight are 5 points each. Her short answers give you half a page of writing, but she stresses each time she only wants 3 sentences MAX and sometimes one sentence is enough. Of course, I've seen those obnoxious people who always ask questions and crap writing in size 10 font, filling up the whole space lol. Her MC usually total 40 points and short answer is 60 points.\nNow the high weight MC is annoying because each question is 5 points and thsoe high weight quetsions are usually harder than the low weight and the short answer. They're not \"hard hard\" but do require some thinking for usually 2 of the questions out of the 5-6 total high weight. THe curve on the tests is usually 2 points, so really if you miss 2 high weight MC (cause you probably didn't get 100% on the rest of the test), you get a B on the test. A super smart friend of mine is probably getting a B+ in physio cause of the high weight MC crap area. He got solid A's in orgo and A-/B+ in Moshowitz, come on! \nNow her tests are pure memorization, like just pure memorization, but there's a lot of stuff. For the first two exams, purely memorization from the book and I got 95 and 93 on them....for the 3rd exam, which we took 2 days ago, it was only 90% from teh book. She actually tested us on stuff not in teh book taht she talked about in class, like lactose operon system/physiological effect, injury response rate with insulin effect, Rhesus blood factors, breakdown of certain sugars (lactose = glucose/fructose),specialized GLUT receptors for skeletal muscles, etc......so the 3rd exam was probably a lot harder than the first two. Also, the third exam had no high weight MC questions which was a good relief!\nOh, also, for each exam unit except for the last one, she also has questions on scientific papers you read in class. The papers are 1 paper per exam for the first two exams (no paper for hte 3rd exam) and they're usually pretty easy to understand, but she goes over the hard stuff in class at teh end of class, so if you have trouble understanding the paper, attend class the days she goes over the paper. Also, the days she goes over hte paper, no daily quiz.\nThe first exam involved 1 MC high weight question on teh paper, while the second exam involved 3 really really short answer questions on the paper, which totaled 15 points, so 5 points each. \nIn all honesty, this class doesn't test intelligence, which is why a \"smart\" person can get a B and a \"dumb\" person can get an A, cause it's about pure memorization and not making stupid mistakes or not just making stupid mistakes, but thinking something wrong a little bit on her high weight MC. \nHer breakdown of grades, which she has written on the board for each test is basically cuved to this:\n38% A\n38% B\n20% C \n04% D\nThere's no end curve at the end of class, cause she curves each exam, which ends up being 2 points like I said, although I assume hte final exam will be curved slightly more. Final exam weighted same sa all the other exams, 30% each, with final 10% due to quizzes/physio labs.\nI'm probably getting a solid A, unless I bomb the final which I doubt. I don't consider myself particularly smart, but I'm not one of those people who need to stress about getting into a decent med/grad school either. \nWhat did I do? I attended all her lectures and took rapid powerpoint notes. I studied those notes exclusively for her daily quizzes and averaged 4-5/5 on each of them. For the exams, I studied 2-3 days in advance, and just read through all the chapters really slowly and took notes on the way. I then reviewd all my powerpoint slide notes, which is a huge amount, devoting 2 hours to it. Remember, I purposefully read slow to absorb the information.Nataliya DOES TEST ON TINY DETAILS, SO MEMORIZE IT ALL. Like what the hell is the importance of knowing lactose breaks down into glucose/galactose vs what sucrose/cellulose/whatever breaks down into? \nI read the paper for 1 hour the day of hte exam (sinec it begins at 5:40 PM) and taht was good enough prep to get 100% on all her scinetific paper related questions.\nIn the end though, some luck comes into play cause you can just get unlucky on her 5 point each high weight MC questions and that will screw you over. I missed 1 high weight MC on each of her exams (95, 93 were my grades), so I do think most people will usually miss at least one...so don't go thinking \"I'll study super hard and not miss a single one\" cause that's what i did, but i still missed 1 each time. \nSo definitely TAKE this class if your GPA needs help cause of Orgo/Bio. It's not a class that requires intelligence (and i don't mean this in a condescending way), so you know you can compete with the smart people, since it's just memorization, which anyone who got into Columbia should be able to do. \n\nWorkload:\n3 exams, no final. each exam is 30% of your overall grade, while daily quizzes and physio lab make up the last 10%\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "April 19, 2012",
            "review_content": "\nGreat class. For all those who hated Mowshowitz, this class will feel wonderful. Excellent text and a super nice prof make the learning experience enjoyable an will add depth to your understanding of the human body. Our TAs were VERY nice, too. The professor is entertaining, funny and accommodating - a nice change of pace for premeds. She doesn't pretend to be teaching you the material in significant detail, which is what I hated about Contemporary Biology (Mowshowitz would teach very little and then ask outlandish questions...as I learn more bio in future courses this will becomes more irritating as I feel I have to \"unlearn\" Mowshowitz misconceptions). But the course actually offers much more detail than cont. bio while reviewing the entire content of that class, minus development. It actually helped me a lot in my research job. It is a great pre-MCAT and pre-med course, that helps to reinforce basic bio with much more depth, and introduce us to the body as a system. You learn to make sense of the various medical tests that a lot of us pre-meds are already working with at our research assistantships - although this part might seem boring if you have no hands-on background, though. The reviews of a couple of research papers in the course add a bit of depth to the content - I would probably recommend adding an additional review of current research in digestion). Unlike the previous reviewer, I found her research background to be very helpful. Sure, she doesn't know every system as well as say the nervous system of the cardiovascular system (i.e. the digestive system module lacks a bit of scientific rigor, and it is a hot research topic right now). This is a basic physiology course, and she is way better than 99 percent of the science profs I have had. Plus she is a researcher at a heavy-hitting med school, so she brings a lot of nuance to her commentary. But there are no real surprises. And the choice of text really makes the course wonderful, since it is extremely well-written. She relies heavily on it so you can actually make use of the exercises in it. Usually profs who try to invent their own way of teaching do not nearly as good a job as one who uses a good text the way it was thoughtfully designed to be used. Do the work and you can succeed, which is how school should be. Her sense of style is awesome, too.  \nMy only problem with this course is that it really should be a full year course, and cover the nervous system and reproduction. It would be great if we could do the research paper review for every unit. And bit more emphasis on anatomy would go a long way to helping us be prepared to breeze through this in med school.\nWorkload:\nModerate\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "April 13, 2011",
            "review_content": "\nOne of the worst lecturers I have ever come across. Why they got a neuroscience researcher to teach physiology, I don't know. Her command of English is not amazing, but it's better than she makes it seem, as if she uses it for misdirection for her poor grasp of the material. But it may explain her test questions, which are often ambiguous. It honestly seemed like her knowledge of the subject was 1 lecture past ours, if that. She curiously often seemed surprised by her own PowerPoint, with the material on each new slide slightly confusing her. Asking questions is fruitless, she doesn't know the answer and will bullshit you. 80% of the class didn't go to lecture. An easy A though, you just need to memorize the text.\nWorkload:\nDaily quizzes that are worth basically nothing, Weekly \"virtual labs\" that you don't actually have to do in order to answer the accompanying questions, somewhat oddly constructed but generally easy exams.\n"
        }
    ]
}