{
    "prof_info": [
        {
            "prof_name": "Emily Ogden",
            "prof_id": 10737,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 17, 2011",
            "review_content": "\nFirstly, Dr. Ogden is brilliant.  The \"lecture\" parts of her classes (which didn't usually run that long) were interesting and well planned out.  She is extremely eloquent and has a tremendous amount of knowledge about the texts.  Secondly, Ogden cares about her students.  She encourages students to email her with questions and attend her office hours to discuss essays.  She even invited us to come talk with her during the spring semester (which she unfortunately didn't teach).    \nDr. Ogden is helpful with the papers, although she doesn't give out topics. She gives a lot of feedback and although they are graded fairly, she expects high quality work from her students.  A's are possible on essays, but are not given away freely.  The midterm and final were relatively straightforward and probably help your overall grade.  The only problem with the class is that class participation is not officially factored into the overall grade, although she may shift grades one way or another in borderline cases.  \nWorkload:\n-Standard CC syllabus (although she indicated passages to focus on)\n-2 essays (7-10 pages)\n-Midterm (passage IDs)\n-Final (passage IDs, 2 essays)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 03, 2011",
            "review_content": "\nDr. Ogden was really a fantastic CC professor. This was her first semester at Columbia, but you would never be able to tell she hasn't taught CC before. \nPerhaps the first, most important thing to mention is that she is incredibly, incredibly intelligent and really knows what she is talking about. While some people may complain when their professor lectures during class, the general consensus in our class seemed to be that it was a pleasure listening to Dr. Ogden's lectures. She always came prepared with many notes on the subject and time period being discussed. She knew the answer to almost every one of our questions, and if she didn't, she came to class the next time with the answer.\nThis does not mean that her classes are all lecture. In fact, most of the time is spent on discussions, which flow well since Dr. Ogden really knows how to foster discussions by asking the right questions. However, Dr. Ogden does not include participation as part of the grade. This is great for those days when you don't read, because sitting in the corner and not saying anything will not affect your grade in the class.\nDr. Ogden is also very helpful with papers (which you get to choose your own topic for), and she is a very fair grader since she gives very specific comments and explanations for why you got a certain grade on your paper. While it is not exactly easy to get an A on the papers, the midterm and final (especially the passage ID sections, not so much the essays) are easy, since she takes passages that were discussed a lot in class.\nWorkload:\nNot bad at all. Dr. Ogden cuts down most of the general CC syllabus reading assignments by telling you what to \"focus on,\" which then becomes the only chapters/sections/pages you are responsible for when it comes to the midterms and finals.\n- two 7 to 10-page papers, on any topic, she recommends you stick to the lower page limit\n- two informal one-paragraph written responses to reading, one at the beginning of the semester, one at the end\n- in-class midterm: only passage IDs\n- final: passage IDs and two essays\n"
        }
    ]
}