{
    "prof_info": [
        {
            "prof_name": "Drew Hopkins",
            "prof_id": 3713,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Changing East Asian Foodways",
            "review_date": "February 06, 2013",
            "review_content": "\nProfessor Hopkins deserves a silver nugget, at least. He really knows his stuff and is very passionate about cultural anthropology. The syllabus for Changing East Asian Foodways is incredibly organized and detailed; if you do anything related to food, Chinese epistemology, East Asian food, fast food, Chinese traditions, kinship in East Asia, rice (even Asian American identity), the reading listed on his syllabus will likely be helpful. The powerpoint slides are also BEAUTIFUL and sum up the readings nicely. Throughout the semester, I was astounded by the wealth of information presented in class. \nThen again, Professor Hopkins reads directly from his powerpoints and is soft-spoken. Sometimes, it easy to doze off in class and not pay attention. But if you do pay attention, you would be amazed at all the things discussed and analyzed in his lectures.\nI disagree with the previous reviewer about a \"guaranteed A\". While this is not a stressful class, you have to write a decent midterm and final analyzing the material to do well.  \nWorkload:\nIt's what you make from it. He has 3-4 \"required\" readings/class and a lot more \"suggested/optional\" readings/class. Do his readings; they're actually decent articles, especially if you have an interest in cultural and food anthropology, but the readings are summarized in classes, so go to class- it makes writing the papers easier. \nOne take home midterm, one take home final, one in-class presentation. \n"
        },
        {
            "course_name": "Changing East Asian Foodways",
            "review_date": "January 03, 2013",
            "review_content": "\nI had incredibly high hopes coming into this class.  As a senior majoring in Biochemistry, I have had relatively few opportunities to take non-science classes.  Between my love for Asian food, specifically Japanese, and the need to fill my Global Core requirement, this seemed like a perfect course after searching through the directory of classes.  On the first day, it seemed like I was not the only one who had this epiphany.  He went through the entire class asking people why they took it, and luckily there was most definitely a minority of people who were truly passionate about anthropology.  \nEverything seemed well and good until the class really started with the first lecture.  Unfortunately, Dr. Hopkins has found that he really enjoys using PowerPoint presentations.  While PowerPoints can be a useful tool, it often seems like he misses the point of them.  While it looked as though he had spent hours, perhaps days, making the slides, it did not lend itself well to improving instruction.  They were beautiful to be sure, with pictures and animations amongst other bells and whistles.  However, it often happened that the text was the wrong colour against the backdrop, making the slides quite hard to read.  This was not a problem, ironically, as Dr. Hopkins tended to simply read off of the slides.  There were a few lectures where either the slides were non-existent or simply didn't work.  These made for much better class sessions.  Our class was in Fayerweather 313.  If you haven't been in that room, either it's too hot, even on cold December mornings, or too loud with the air conditioner going.  For a person with a strong voice, this wouldn't be a problem.  Dr. Hopkins did not have a strong voice, and as such, it was hard to understand him without being in the first couple of rows.  Luckily, this did not matter too much, as I will describe in the workload.  Despite this, given the previous review about his Chinese Strategies class, I wonder if this semester was simply an anomaly.  He seemed distracted at times, but all this was likely due to a family crisis which he had to attend to several times during the semester.  \nThe material itself was incredibly fascinating.  It truly is mind boggling just how much one can learn about a society simply from analyzing the food culture.  Whether it's looking at the impact of rice agriculture, traditional Chinese medicine, the introduction of fast food culture or the rise of Chinese (and other Asian) foods in North America, there is not one class session that you will leave and not think that there was at least one cool tidbit of information that you didn't know before.  However, there was a large amount of anthropology jargon used throughout, which I felt actually took away from the class.  This may have been because he never explained a lot of the terms and just assumed we knew them.  Part of the class grade was an in-class presentation, done as an effort to increase student participation, but there were some days where the majority of class time, if not all of it, was devoted to these.  I did not mind listening to these, as Columbia students are quite bright, but I would rather have spent the time listening to an expert in the field.  Also, these presentations often overlapped with material that we were presented in lecture.  There are a few movie nights later in the semester, which are definitely worth watching - and Prof Hopkins feeds you Asian food.  It's \"required,\" but only in that you have an option to write part of your final about it.\nAll in all, while there may be better courses out there, many variables seemed to be unavoidable.  Between Hurricane Sandy and the family emergency, we lost many class sessions, resulting in rushed lectures and a high concentration of student presentations (mine was delayed almost 3 weeks).  I do think that had neither of these things happened, the course would have been significantly better.  That said, if you do what is asked, an A range grade is almost a guarantee.  I'd give this course a try in the future, as the stars are unlikely to line up as they did this semester.  If nothing else, you'll have a greater appreciation for that General Tsao's Chicken.\nWorkload:\nIt really depends on you.  If you're the type of person who wants to do every page of every reading, you could find yourself with 50-100 pages per class.  This is not necessary.  You only \"need\" to do the readings you will use for your presentation/position paper and exams.  Class notes are extraneous.  The exams can all be written in one night if necessary, and you'll still do well.\nThe grading breakdown was as follows:\nAttendance: 5% - Easy in theory, but it will be tempting to skip.\nPosition Paper (5 pages) or Presentation (15 minutes maximum): 15% - I felt that it was less work to do the presentation; I spent an evening of work actually writing it, and a few hours practicing it.\nTake-home Midterm: 35% - Pick 1-3 essay topics (several provided, each applying to either a class or a week) for a total of 8-10 pages.\nTake-home Final: 45% - Same format as midterm, except we were asked to write \"roughly ten pages.\"\n"
        },
        {
            "course_name": "Chinese Strategies",
            "review_date": "January 19, 2009",
            "review_content": "\nOne the first day of class, Professor Hopkins came across as the type of instructor who is so brilliant and full of knowledge that it's difficult-to-impossible to keep up with him.  Luckily, this turned out not to be the case at all--after a few class sessions, he even began to remember to write pinyin on the board next to the Chinese characters.  \nThat said, there is much to take in during lectures.  By the end of the course, however, it will seem to have magically all come together--Confucian epistemology, socioeconomic aspects of the qipao, Maoism, and the lot of it--imparting you, the student, with a new understanding of and interest in contemporary China.  Meanwhile, you will have found yourself subtly charmed by the old-school style of the multilingual professor with his bow-ties and impeccable grammar (he once apologized for ending a sentence in a preposition).  \nBe prepared to feel the need for a little supplemental reading (Wikipedia or otherwise) if you have little to no background in Chinese history.  (When was the Ming Dynasty again?)  But if you are at all interested in China or a future in anthropology, this course comes highly recommended.  \nOh, and for the budget-minded: there are no textbooks or course packets to be purchased (your print quota, however, will suffer).  \nWorkload:\nThree 3\" binders full of (double-sided) readings are lying next to my desk.  It works out to about 5-7 standard-length journal articles and/or (usually shorter) book excerpts per week.  Did (most) students do all the readings?  I doubt it.  One 8-10 page take-home midterm; one 10-12 page take-home midterm--very straightforward.  Lots of paper topics to choose from.  \n"
        }
    ]
}