{
    "prof_info": [
        {
            "prof_name": "Keiko Okamoto",
            "prof_id": 1736,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Third Year Japanese I",
            "review_date": "February 27, 2011",
            "review_content": "\nI feel like I might be shot for writing this review, but here goes.\nYes, Okamoto-sensei is a wonderful person. And she's certainly not a bad teacher either. She's basically a kindly smiling old lady who still enjoys having fun with the youngins....your typical benevolent grandma, really. While you will certainly enjoy class with her, there are a few drawbacks to her teaching style. (In a nutshell: if you need an instructor that goes through Japanese VERY SLOWLY, and if you're not comfortable with your ability to keep up with a brisker pace in class, Okamoto is for you.)\nFirst: class with her moves slooow. This works for some people, but it did not work for me. This may not be very apparent to you unless you've actually had Japanese with another professor at Columbia - but once you have, class with Okamoto can seem almost excruciatingly slow at times. Her teaching style involves grilling every single person to make sure they grasp some new grammar concept and can reproduce it in a made-up sentence - students making up sentences take time. Okamoto herself trying to come up with new and exciting sentences for them to complete takes time. Be prepared to wait and space out during long periods of awkward silence. Also, sometimes class feels like it's going so slow just because she's such a nice old lady. Sometimes when she spoke to us I felt like I was back in preschool.\nSecond: Okamoto is a harsh grader. I got A+s almost every single day, for almost every single exam with my other Japanese professors....not so with Okamoto. No A+s in her class, and just much harsher grading in general.\nThird: heavier workload despite all classes having the same syllabus? e.g. She requires for you to memorize at least twice the amount of vocab for daily quizzes than other classes do. She makes you learn how to write the kanji for the drama you have to watch every week (other classes just memorize how to read the words). She also makes you do corrections for exams (and annoyingly, doesn't tell you where you went wrong)...my current professor just writes down the correct answers for you and leaves it at that.\nBy no means am I saying Okamoto is a bad teacher...because honestly, she's sweet, and she does a thorough job of making sure you learn your Japanese. But frankly, something about how slow Okamoto's class used to move just failed to motivate me to continue my learning of Japanese in general (which led to me skipping a few classes, which led to me getting an A- despite near perfect scores in every exam and assignment...ugh). I'm also pretty sure my ability to verbally communicate in Japanese went downhill in the two semesters I had with her...maybe it was all the waiting around for everyone else to speak instead of being made to hold active conversations in pairs instead.\nWorkload:\nheavy. (MUCH heavier than second-year Japanese.) but if you're in third-year Japanese, you should know this by now.\n"
        },
        {
            "course_name": "Third Year Japanese I",
            "review_date": "August 25, 2010",
            "review_content": "\nOkamoto-sensei will smile at you mercilessly until your sense of shame dissolves and you spit out the vocabulary you weren't sure you memorised the night before. She is one of the nicest human beings on campus, and also one of the hardest working -- she is always full of energy in her classes, which makes a huge difference in everyone's attitudes by the end of the hour. \nIn terms of teaching style, Okamoto-sensei reviews the grammar and then round-robins questions until everyone has had their turn, which helps shore up oral practice. She has never failed to entertain a question before, during or after class.\nWorkload:\n- Vocabulary quizzes at the beginning of every lesson that occasionally morph into kanji and/or translation quizzes by the end of the semester. \n- Audio recording of certain chapters\n- Usual workload expected of a Japanese class - usually a page of vocabulary a day, grammar assignments, the occasional writing/presentation assignment. \n\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "January 04, 2010",
            "review_content": "\nFunny, nice, and a really great teacher! Work for this class may take up a large portion of your semester but it really doesn't feel like work at all. First Year Japanese will whet your taste for gaining command of the language and also set you quite well on your way. Okamoto is obviously very knowledgeable of foreign language pedagogy, and one gets the feeling that the entire department is extremely cohesive and plans well. The textbook is very well organized. You will learn the two syllabaries (hiragana and katakana) very quickly while learning many of the basis vocabulary words and grammar points, and then you will delve into kanji and some more complex ideas. By the end of the course you will be able to watch a Japanese movie or listen to a conversation and pick out an impressive number of words and phrases, although admittedly it will still mostly sound like gibberish. Ultimately, a very difficult language will begin to be accessible to you, and because of Okamoto's easygoing yet tough teaching style fluency in the future will become conceivable. I recommend taking this course in conjunction with an introduction to japanese or east asian literature or intro to japanese civ, as it will get you excited about learning the language of a culture with an extraordinarily rich linguistic tradition. \nWorkload:\nLots of work but rather thoughtless, in a good sense (as long as memorizing vocab and characters and grasping relatively simple grammatical concepts doesn't take too much thought for you). About two hours a night, sometimes more, sometimes less. Easy to do well in, not to say that you won't learn quite a bit.\n"
        },
        {
            "course_name": "Third Year Japanese I",
            "review_date": "December 18, 2008",
            "review_content": "\nOkamoto-sensei is lovely and amazing! She is so cute and quirky; every day I walked out of class more cheerful than when I'd come in. I learned a lot of Japanese in the class too; Okamoto is really good with her examples and also using English if the class is just giving her blank stares. Take it! You'll love her. <3\nWorkload:\nWorksheet(s) every day, quiz every day over kanji/ vocab, ~5 tests (2 are glorified to become the midterm and final)\n"
        },
        {
            "course_name": "First Year Japanese II",
            "review_date": "April 29, 2007",
            "review_content": "\nOkamoto Sensei is perhaps the greatest Japanese instructor at Columbia. She is kind, patient, and loving to all of her students. Why is it that she is yet to receive a big gold star?\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "January 30, 2007",
            "review_content": "\n     More similar to an anime character than a Columbia Professor, Okamoto sensei is perhaps one of, if not, the best professor I have had thus far. Although she moves at a quick pace according to the department schedule, she always takes time to make sure her students understand the content before moving on. In her first-year class, she is most helpful by incorporating english explanations into her lessons so that no one becomes to bewildered. In tune with pop culture and familiar with high class locations, she transforms every class into a hysterical lesson that many times consists of comparisons between Brad Pitt and Tom Cruise. Nonetheless, she is hardcore about Japanese and wants her students more to understand the language and culture than she does about them making the best grades. Homework can be heavy at times, and quizzes are given everyday, but I don't believe this method is any different from any other first-year Japanese course.\n      For any student thinking of taking first-year Japanese, Okamoto sensei has my highest recommendation for both increasing language proficiency as well as making an hour of classtime very enjoyable. \nWorkload:\nHomework each night. Daily quizzes. Tests every two weeks \n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "January 22, 2007",
            "review_content": "\nOkamoto Sensei is the most amazing professor at Columbia.  She is sweet, funny, and understanding.  I learned so much from her!\nWorkload:\nabout 30 minutes to an hour's worth of homework each night; a short quiz every day(each worth only 0.25% of your grade); a test every other Monday or so; a midterm; a final.\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 26, 2006",
            "review_content": "\nTake Japanese with Okamoto Sensei.  I can't stress that enough.  She's by far the best teacher I've ever had in any subject, balancing a heavy (but necessary) workload with a light-hearted atmosphere in class.  And you learn a TON of Japanese...\nWorkload:\nDaily quizzes, nightly homework assignments, a few longer compositions, exams every two weeks, fair midterm, fair final EXCEPT the listening on that one is a BITCH (same for every class though)\n"
        },
        {
            "course_name": "First Year Japanese II",
            "review_date": "November 14, 2006",
            "review_content": "\nIf anybody ever says anything bad about Okamoto, I will personally find a way to destroy CULPA.\nWorkload:\nIt's Japanese.\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "January 19, 2005",
            "review_content": "\nOkamoto Sensei is very nice and always willing to explain things until people understand.  She is very funny, animated, and always prepared to teach.  Take her class!\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 16, 2004",
            "review_content": "\nIn the beginning I was kind of scared, because I'd heard from a few people that she was as good as it gets.  I could only think that if this is as good as it is, what did that say about the rest of the department?  It turns out I was just being judgmental and dumb.  I was convinced she wouldn't be teaching much because on the very first day she ran around the class mumbling in Japanese to herself.  \nOkamoto-sensei is very nice, adorable, and really a good teacher.  The review given to her from Jap III is right on and also true in level 1.  Sometimes she says words or phrases we just don't know, but she pauses and explains herself when she sees the blank looks around the class.  Her interactive activities are often bizarre and involve us making small talk with partners in the class without much plan, but whether or not it's overly original and fun, I've learned in this class.\nWorkload:\nYou should probably open a book, but few people actually listen to the Audio CD.  That annoys her.  Usually a worksheet or two per night in mandatory homework.  \n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 11, 2004",
            "review_content": "\nOkamoto-sensei is one of the nicest women I've ever met, inside or outside of the classroom. Of course, she does have that certain, Japanese-professional inclination to assume Japanese students are machines of memorization -- but Okamoto-sensei displayed that assumption with humor and understanding, which was a blessing. And besides: you need to be a memorization machine in order to master any language, especially Japanese. Class moved quickly but coherently, with Okamoto-sensei always willing to stop and explain points of particular confusion or misunderstanding. Just do the work and study hard and Okamoto-sensei will always be available outside of class to help you out if you've missed a class or just don't understand a grammar point from a while ago. \nWorkload:\nExams, midterm, final, daily quizzes -- a lot of work, but it grounds you in Japanese like nobody's business. \n"
        },
        {
            "course_name": "Third Year Japanese I",
            "review_date": "October 10, 2003",
            "review_content": "\nOkamoto-sensei is the funniest, nicest, most easy-going Japanese professor I have come across so far. They just get better and better every semester. She is quite thorough in her explanations,  even using English if necessary which is a huge relief for students.  Occasionally her vocab is too advanced for the class, but she always pauses midway through her sentence to make sure everyone understands and lo and behold, you've just learned a new word. You learn just as much this way as you do studying for the quizzes every night. The only thing to remember is you shouldn't be scared when your homework comes back looking like it was attacked by a red pen. Okamoto-sensei likes to provide alternate/better-sounding answers. On tests I find her to be a very fair grader. \nWorkload:\nDaily quizzes, homework. Exams every other week, midterm and final. Standard.\n"
        }
    ]
}