{
    "prof_info": [
        {
            "prof_name": "Anand Taneja",
            "prof_id": 12594,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 08, 2013",
            "review_content": "\nI will preface this review by saying that I do plan on staying in Prof. Taneja's class for this upcoming semester.  Overall he is a decent professor; he is probably not the most exciting lecturer, but it could most definitely be worse in terms of workload.  \nThe workload for the first semester of class wasn't so bad.  Instead of a midterm and a final, we had two papers.  The midterm was 5-8 pages and the final was 8-10 pages.  In addition to this we had two other papers: the first paper of the semester had to be 5-8 pages and the other paper was actually a topic description/outline of the paper we were writing in the place of a final that had to be 1-2 pages.  My only complaint about these papers is that the topics were very broad, and Prof. Taneja's essay prompts weren't always clear to some.  For some people this might be nice because it allows for a little more creativity, which Taneja seems to encourage, but it might be difficult for others who prefer professors to clearly outline the components they would like to see in an essay.  \nIn addition to the essays, each person had to prepare a 20-25 minute presentation before class on the reading for that day.  In the presentation, we had to summarize the reading and provide some commentary/discussion questions to guide the classroom discussion.  After the presentation, Anand would provide some commentary on the discussion as well as some of his points for the lecture that day.  Doing the presentation well was an easy way for everyone to get participation points, and everyone was allowed to select the reading they wanted to prepare a presentation for on a first-come, first-serve basis.  \nI believe that a lot of the criticism of Prof. Taneja comes from the way that he handles discussion. Most people in class felt that he would allow certain people to express their opinions more than others in an attempt to avoid any discussion he might find too \"offensive\" or \"contentious.\"  As a result, the discussion wasn't always interesting, and several students resorted to simply not speaking much at all in the last few classes.  Another complaint is that Taneja might have a tendency to favor those whose personalities he considers to be more pleasant than others.  These complaints come mostly from the way he handled discussion and graded papers/presentations.\nFor example, one day in class he mentioned something about \"comparing papers\" of students who had chosen the same prompt or similar texts. Although he did not clarify his meaning, it seemed as if the grading can be subjective. \nWith that being said, the workload isn't that bad and you can definitely get a decent grade  if your presentation goes well, you participate enough, and you write a good essay using the least popular prompts.\nWorkload:\nProbably subject to change\n1 paper and midterm (both 5-8 pages)\n1 topic description of final (1-2 pages)\n1 final (8-10 pages)\nPresentation (20-25 minutes)\nReading (if you want, I did okay without it)\n"
        }
    ]
}