{
    "prof_info": [
        {
            "prof_name": "Ivan Lupic",
            "prof_id": 9553,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "April 27, 2011",
            "review_content": "\nThis man deserves a Gold Star. I was in his class last year and am only now getting around to writing a review on him, but he remains the best professor I have had at Columbia. \nLupic is exceptionally intelligent, charming, helpful, and intellectually stimulating. As other comments have noted, he is able and willing to talk on a range of different and fascinating topics. His comments on papers are detailed and extremely helpful; just follow them and he will reward you handsomely. \nFinally, if you do the work, you will have no problem getting a very high grade. He is not at all hesitant to give out As. \n\nWorkload:\nThe usual (correctly listed in comments below). \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 21, 2010",
            "review_content": "\nAmazing. End of story. He makes the class. \nOh and P.S., since you're all dying to know, he gives out A's, considering of course you put in the time and effort. He is very generous. Don't worry. You are in good hands. I'd take university writing part deux if he offered it and I don't even like writing. Done. Don't waste your time contemplating further. \nP.P.S. This arranged marriage comment has been quoted way too extensively. It neither illustrates the class nor the professor. \nWorkload:\nThe regular. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 12, 2010",
            "review_content": "\nIvan Lupic is one of the best professors I have had.  Obviously, University Writing can be one of the most tedious and frustrating classes you will have to take at Columbia, but Professor Lupic will make sure that you get the most out of the course.  He's is very organized, but is willing to invest more time in whatever may interest the class (i.e. the topics of the papers/essays rather than the writing process etc.).  He is extremely approachable and will always find time outside of class to meet with you about a paper.  His comments are insightful and he grades very fairly.  \nSome people may have been turned off by his straightforwardness.  He is not afraid to say something negative about some of your writing or comment on his frustrations with someone being late to class, but his criticisms are always constructive.  He genuinely wants everyone in the class to get the most out of it, despite the fact that it's almost everybody's least favorite class.\nAbove all, Professor Lupic is just a brilliant professor.  His range of knowledge is extraordinary.  He speaks confidently and eloquently about anything it seems like.  His knowledge of language, history, intellectualism, and literature is pretty much astounding.  \nI'd highly recommend taking Lupic's class.  I would take any class he taught regardless of the subject.  I can see how people can rub elbows with him a little bit, but if you're willing to put in the effort he is an amazing professor.  \nWorkload:\nStandard UW coursework.  He spaces it out a lot better than most classes so you won't find yourself suddenly at the end of the semester with a ton of work like a lot of other people.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 23, 2010",
            "review_content": "\nThe below review has some good points but overall I disagree with it because it heavily implies that the weaknesses of this course were the fault of its instructor. The the contrary, Ivan Lupic is a fantastic teacher and does his absolute best within the guidelines of the University Writing curriculum. The problem is spelled out exactly in his analogy: \"This course is like an arranged marriage. You are required to take it, and I am required to teach it.\". No one in the class particularly wants to be there, but we're there and we have to make do and Lupic deserves credit for making the class as free from stress and as entertaining as it can be. \nIvan Lupic is indeed an incredibly intelligent man. He produces etymologies on demand (a lover of languages, he speaks several and his academic work is based in Shakespeare and renaissance literature), and he may well have some background in philosophy as he also knows and can explain very complex theories at the drop of a hat. \nEventually he did become somewhat exasperated by the lack of enthusiasm from the class, but he tried his best with a class that was evidently somewhat sub-standard in their writing prowess. His feedback on drafts was detailed and helpful, and he marked final drafts very fairly (I would go so far as to call it easy!). \nThe class was tedious only occasionally, when you are forced to listen to the drivel of your classmate's writing, but that is hardly Lupic's fault. I found Ivan was prepared to go off-topic whenever the class seemed interested in doing so, and we had some great discussions of Freud and of the insanity of European libraries!\nOverall, if you are lucky enough to land in Ivan Lupic's class then listen carefully, stay on schedule (his term plan is great too, you'll finish each essay long before your friends in other classes do)  and know that with a little effort, a good grade is coming your way!\nWorkload:\nThe course standard. 1200 word lens essay (20%), 1500 word conversation essay (30%), 2000 word research essay (40%), 1000 word joke reflection essay (10%). Little writing tasks due each class, but these cease after the conversation essay and are not graded. Each essay is graded out of 100 and its easy if you follow his advice/comments on draft to score 98 or more (94 = A).\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 17, 2010",
            "review_content": "\n\"Did you bring your drafts?\"\nThere is some awkward laughter;\nFive people are late\nOh, University Writing, You are not a tasty class. Partly because I had you at 9:10, but also partly because I had gotten up too late for breakfast because I was up the night before writing drafts for you.\nIvan started the semester with these words: \"This course is like an arranged marriage. You are required to take it, and I am required to teach it.\" And indeed, that's how the next few months played out. Slightly interesting, but mostly unpleasant and mostly unnecessary. I'm not sure whether I should blame Ivan or the UW curriculum for my experience, which fluctuated from sub-par to intriguing. Perhaps a combination of both.\nI liked Ivan's style from the first class. He was direct, slightly aloof, and obviously brimming with knowledge. He gave us an accelerated syllabus that would let us spent a large chunk of time on our research essays (which turned out to be a very wise move). He casually explained etymologies and theories in class and in meetings with him during office hours, which made me feel as though I had a good resource for the rest of the semester. However, I think as time went on, he was exasperated by the lack of enthusiasm from my class, and ended up resigning himself to it as well. \nCertain points of the class seemed like a waste of time, such as the presentations we did for the research essays (we took a \"seed text,\" brainstormed things that it made us think of, and then split up into four groups that presented on one of four chosen topics--essentially, we took one week to do what one person does in a single one hour brain-storming session). Later comments on papers that were meant to be unadorned and helpful were misconstrued as biting or even belligerent, and there was a definite tension in the air during class that Ivan sometimes commented on, which was, predictably, awkward.\nOverall, as a person who is not the best writer, but certainly not the worst writer either, this class was tedious, with a writing exercise or draft due each session, with new drafts due approximately every two and a half weeks. We stuck mainly with assigned readings, and Ivan rarely ventured off-topic, which was disappointing. He did give a comprehensive experience, though, and perhaps a later timed class would treat him better.\nWorkload:\nThe typical UW fare - 4 essays, three of which are 2000-3000 words each, and one about 1000 words. Writing exercises, sometimes in class. Being able to listen and remember what a person states in class is quite crucial in Ivan's class! Pay attention!\n"
        }
    ]
}