{
    "prof_info": [
        {
            "prof_name": "Benjamin Sadock",
            "prof_id": 2534,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Yiddish I",
            "review_date": "August 15, 2005",
            "review_content": "\nGreat teacher! Highly recommend the class with him. Very laid back, barely any work for the class, is very understanding if you're a slow language learner but is just a great teacher. He starts the class by speaking to you in yiddish (which you won't understand the first couple classes) but has you speaking back by the first day! There was hardly any work for the class and while it sometimes got a little boring, you should still go (it's a language class!). Sadock is funny and knows his stuff. I highly recommend taking this class with him.\nWorkload:\nNOT BAD AT ALL!!! A few random quizes (he gives you a week's notice), no midterm and a take home final on which you can work with others. Daily homeworks that take less than 10 minutes and are graded easily. Don't ask- don't tell grading policy plus good grades on the quizes ensure an A!\n"
        },
        {
            "course_name": "Elementary Yiddish I",
            "review_date": "May 15, 2005",
            "review_content": "\nBenyamin is a great teacher! Not only does he have a personality and sense of humor but he really knows how to teach the language. He's a chill guy and has a \"don't ask, don't tell\" grading policy which is awesome! If you do the homework, do well on the 10 question, easy quizes, and do well on the final, you'll definately get an A - I did! I recommend knowing Hebrew or German (or both) before signing up for this class, though.\nWorkload:\nHomework for every class (it takes 10 minutes or less and consists of reading a short story/passage and answering questions or doing some grammar review exercises), about 5 quizes assigned periodically throughout the semester (but he gives you a weeks notice). Great class - I definately recommend Sadock!\n"
        }
    ]
}