{
    "prof_info": [
        {
            "prof_name": "Saidiya Hartman",
            "prof_id": 3614,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium on Feminist Theory",
            "review_date": "January 12, 2011",
            "review_content": "\nI have to agree with the previous response in certain respects (the readings were somewhat difficult and some of us were not quite ready for them), but this was by far one of the best classes that I have taken while at Columbia. It truly has shaped my ways of thinking and seeing, and it truly enhanced my understanding of feminist \"sites of practice\" (as the class was titled). The readings were truly challenging, sometimes too challenging, and she did try to remedy this by assigning a weekly response (I think more to gauge our level of understanding and our concerns with the readings). If anything though, I think this should be demonstrative of her desire to negotiate our ability to understand and the rigors that the subject matter required.\nProfessor Hartman is brilliant -- like brilliant, brilliant. I don't think I've come across a professor who is as eloquent and well-versed in so many areas (I found it amusing when she mentioned that Michel de Certeau's \"The Practice of Everday Life\" reframed the way she thought as a scholar, or something along those lines. I certainly didn't understand much of the book, so she got something out of it that I didn't). She's also funny and chill in her own way. \nIn the end, the challenging aspects of the class were certainly the most rewarding. Many of the readings and the discussions that pursued really framed my thinking as an academic/student/feminist/?. Some people -- certainly myself -- weren't prepared for the rigors of the class, but I walked away with new vantage points and with new arenas in which to carry feminist endeavors. Did I mention Professor Hartman is brilliant? \nWorkload:\nChallenging, but rewarding readings. Weekly responses. One 10 minute presentation (along with a 5-page paper) and one 8-10 page paper. \n"
        },
        {
            "course_name": "Colloquium on Feminist Theory",
            "review_date": "August 25, 2010",
            "review_content": "\nThis was the worst professor I have ever had during my time at Columbia. She made it clear to her students in every way that she  did not give a damn about the class or the students. She handed out a syllabus that was filled with material that was entirely inappropriate for an undergrad class. The readings she chose were so dense that when I showed it to the department head he said most of those readings were things he had read when getting his doctorate. When the class came to her about the readings being too difficult all she did was assign a response paper that would be due every week. It was already halfway through the semester and she changed the syllabus to include this  weekly assignment that would ultimately be 30% of our grade. She only likes to hear herself speak so even though it was a seminar it was generally two hours of listening to her ramble and toss around jargon that no one else understood. She was always late, continually let the class go over the allotted time and canceled class 3 times because of her own personal reasons despite the fact that class only met once a week. She gave absolutely no direction on her written assignments so you never knew what her expectations were, nonetheless, she would hand back the assignment  and say you did it wrong. She had office hours but never actually showed up for them instead she would tell you to make an appointment which she would then cancel. If you had a question or needed help she would tell you to write her an email and then she would never respond. I literally wrote her 5 high priority emails throughout the semester and she never responded to any of them. Also, she was a full month late handing in our final grades and when she finally handed in the grades and I asked my other classmates what they got in the class she gave everyone in the class the exact same grade.\nWorkload:\nIt's a normal amount of reading for a seminar but the readings are so dense that to get through one page and really understand it means you have to reread it five times. There were weekly readings, a response paper due each week, you had to post three questions about the reading,  a 5-7 paper on one of the weekly readings where you would also have to lead the class, and a final paper\n"
        },
        {
            "course_name": "The Gilded Age: Fictions of Property and Personhood",
            "review_date": "April 13, 2010",
            "review_content": "\nDear God...where to begin with this woman? She is truly the worst. Absolutely the worst. I signed up for this class because I absolutely love the writing and I was so excited to learn more. She almost murdered this period for me. Her lectures are a nebulous cloud of nothing. She loves to hear herself talk, tosses out jargon just for the sake of it, and will repeat little \"brilliant\" phrases again and again because they sound nice, like calling Sister Carrie \"a genius of feeling\" at least 12 times in one class, without ever saying anything about why or what that means. In addition to useless lectures, she is a complete space case. Not only is she always late or having to move class, she has one day of office hours a week, for just over an hour. She canceled every appointment I made with her, and not even via email-she would wait until I had already been waiting outside for at least 40 minutes to come out and tell me she had made a mistake. She never answered a single email, and was basically the least helpful professor I have ever had. It was clear that the only students she had time for were her graduates...if you feel that way lady, then why don't you just teach grad school? Also, she constantly referred to slavery as \"a painful part of my past\". Um, no, it wasn't. \nThis is the worst class I have ever taken at Columbia/in my life. Useless lectures, a professor as pretentious as she is unhelpful-truly avoid at all costs, people.\nWorkload:\nIt's a seminar, so I was prepared for a lot of work, but this bordered on the ridiculous. In addition to one long book a week (which was to be expected) there was an ever-expanding list of supplementary stuff-the only emails she ever sent out were to add more readings for the next week. One 1-2 page response to each work on courseworks the night before class, a 5 page paper and presentation (which you have to meet with her before, and she will cancel your meeting), and a ten page final paper.\n"
        },
        {
            "course_name": "Black Autobiography",
            "review_date": "December 17, 2009",
            "review_content": "\nShe's nice. She's enthusiastic. She's gracious about being late, whether it's you or her. But the woman cannot teach a damn class. Her lectures are like misty clouds of ideas that are only tangentially related to each other, with a lot of vague references to some of her favorite concepts that you feel like you should know, because you're always hearing them being referred to, but that you've never studied in-depth. Assignments are given in the same unclear language. And she cancels class basically all the time, which is, you know, half nice and half an enormous waste of tuition money. Don't take her if vagueness makes you antsy, and definitely don't take her class first thing in the morning, because you will not make the effort to synthesize her points in your mind. You just won't.\nWorkload:\nMidterm paper and final paper, both under ten pages, and about a book a week. Unless she cancels class. Then you just bought the book for no reason.\n"
        }
    ]
}