{
    "prof_info": [
        {
            "prof_name": "Julian Franklin",
            "prof_id": 1306,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Animal Rights",
            "review_date": "April 13, 2008",
            "review_content": "\nSo here's the deal with Professor Franklin: Apparently, he's the world's foremost scholar on some guy we don't read in this class. Which is great, because you trust he was quite erudite 20 years ago before he went senile and decided he needed to come back to teaching to ramble about killing animals.\nWhoever said this class wasn't straight-up proselytizing was obviously deluded by their agreement with Franklin's opinions. I told my TA I wanted to write our final paper arguing against the presuppositions of the course, and he suggested to do so would be to unequivocally fail. Franklin is pretty overt about the fact that the reason he came out of retirement to teach this class is to turn everyone in it into a vegan- or a vegetarian, if he's feeling pessimistic. There's no discussion of the flaws in animal rights rhetoric, and thus no interesting theory: only Franklin offering you numerous half-baked theories that don't provide solvency for animal rights while the annoying vegan in the front row agrees with everything he says (also, keep in mind, this is spoken by a former vegetarian). Also, there's a whole lot of focus on Kant, which is strange given that the little that Kant did say explicitly about animals contravenes Franklin's arguments- expect an unusual reinterpretation that I imagine ol' Immanuel would not have taken kindly to.  \nIt is true that there are moments when you get a glimpse that perhaps this man once was a truly remarkable scholar. He is, however, now no more than a pedagogue. Also, his insistence on forcing you to agree with his viewpoints on his exams will hurt when it comes to grading time: remain unconvinced, and you'll get your first B at Columbia in 3 years in this fruitless 9 am class (you'll be better off asleep).\nWorkload:\nmidterm, final, 20 page paper, manageable reading (in length, not in content), sitting through a peta video (if anyone really doesn't realize that animals are slaughtered to produce meat, they deserve it)\n"
        },
        {
            "course_name": "Animal Rights",
            "review_date": "March 14, 2006",
            "review_content": "\nProfessor Franklin is one of the best professors that I have had at Columbia.  He is thoughtful, provocative, and daring enough to teach a class on animal rights that makes you think without being subjected to preaching.  Some of the readings are less effective throughout the course than the video he shows within the first two weeks-a video that had the entire class in tears-no kidding.  He is as kind and sensitive as they come,and truly cares about the students and their opinions (even if he wants his heard first). Also, he brought in a few interesting speakers to class to discuss relavant issues. If you can handle the truth about where your meaty dinner comes from before it makes it to your plate-take the class. \nWorkload:\nmoderate...weekly readings, 1 midterm, 1 final, 15 page final paper\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 14, 2004",
            "review_content": "\nFranklin may have been the worst professor I have ever been cursed to know. In my opinion, he is arrogant, boring and above all -- a really hard grader. He may be a nice man, but he is a horrible, horrible teacher.\nWorkload:\nno difficult : probably lighter than most CC sections\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 30, 2002",
            "review_content": "\nProfessor Franklin taught our CC class. CC, as all Columbians know, hasn't changed since its conception in 1919. Professor Franklin was teaching CC in 1919. Since he's been teaching this class forever, he thinks (or rather, he KNOWS) that he's the expert. Therefore, our classes were 2 hour lectures. At 9 AM Monday morning, there's not much worse. True, it meant we didn't really HAVE to do the reading, but if I'm going to sit through this class, I would like some motivation to learn something! If his lectures were interesting or informative, it might have been worth it, but I got the feeling that he was BSing his way through class as much as we were through our papers. Since he knows everything, anytime one of us got a word in edgewise, we were summarily dismissed. It made writing papers difficult! Overall, Professor Franklin is a nice grandfatherly looking man, but bewareÂ—Â—Â—his teaching style is much more like that of Professor Binn's in Harry Potter. He's a ghost, not a professor!\nWorkload:\nThree papers (3-5 pages), midterm (fairly evil) and final (who knows?)\n"
        }
    ]
}