{
    "prof_info": [
        {
            "prof_name": "Irina Oryshkevich",
            "prof_id": 240,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 15, 2011",
            "review_content": "\nIrina was amazing!  I recall the first day of class she casually mentioned that she's taught Art Hum more than anyone at Columbia, and it truly shows.  She is so knowledgeable, so helpful, and she really makes an effort to get to know you personally.  I was dreading Art Hum because I thought it would suck, but she made it one of my most enjoyable classes at Columbia.  I always wanted to go to class and the periods flew by because they were so good.\nWe went to the Met with her, and she gave us a tour.  She's the best tour guide I've ever had.\nOne time she had to cancel class because a guy committed suicide on the 1 train that day and it was too disturbing.\nWorkload:\nThere is a lot of work that you can do if you are interested, but as far as what is required and necessary, it's a breeze.  The most learning comes from going to class.  The 3/4 paper thing was nice and the topics were easy and fun.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 16, 2011",
            "review_content": "\nFinding out you got Irina as your Art Hum professor is like winning the lottery, so congratulations if this is you!  I am a math major who has little interest in art coming in and this was by far my most enjoyable class this semester.  I've never taken an art history class before so the whole lights-off / lecture-slides-on style was a trip and I loved it.  I thought her lectures were really interesting as were the class discussions.  As some previous reviewer mentioned, she spins every student comment into a useful contribution.  This is great positive reinforcement, and it made everyone unafraid to speak up.  On top of that she's just a really friendly and positive person.  If there were an optional Art Hum II that she taught, I'd take it in a heartbeat.\nI can't compare the workload to other Art Hum profs; it seems most Art Hum classes are pretty light in workload anyway.  But it certainly felt very light in comparison to the average class.  In the first few weeks she assigned readings and would ask about them in class.  But after that she really didn't assign any readings.  Before the exams she emails us a list of the specific readings to know (usually around 7 or so) and what to know from them.  So aside from the first few weeks, you don't have to do any readings until right before the exams, and even those were usually short and straightforward.  \nThere were 4 essays, of which you could choose 3 to do, or you could do all 4 and your lowest grade would be dropped.  Two of the essays were 4-5 pages, one was 2-3, and one had no restriction in length.  I wasn't a huge fan of the essays, they were kind of unusual and to some degree required creativity.  For instance one was to find a piece of art and write a \"catalog entry\" as if you are a gallery owner who is trying to sell it.  So there is a bit of research involved, but also a little bit of role-playing.  Anyway, they weren't hard except for writers block you might have in the creative aspects of them.  \nThe exams were really easy if you don't miss any lectures.  Both midterm and the final have the same format: the first part is identification of 6 works, which you have to give the title, artist, year it was made (within 10 years), and answer a short question about it (which is always something from lecture).  Then there are comparisons (2 in the midterm, 4 in the final).  And finally she gives three essay questions, of which you can choose one to answer.  I can say right now that you DO NOT have to take any notes in lecture in order to prepare for the exams.  She posts all the lecture slides for you to study dates, but the identifications really aren't hard since she doesn't pick anything obscure and the range of 10 years makes it really easy (most of the artists fall within a 20 year band anyway, so you just need to know one or two dates for any given artist).  And everything that you need to know to answer the questions you will remember from lecture or will be from the readings that she specifically tells you to read before the exam and what themes to look out for.  You don't even need to bring a pen or paper to class.  Just bring yourself and your favorite soft drink; get comfy and enjoy the show.\nWorkload:\nPretty light.  Only a few readings are vital.  A trip to the Met.  3 out of 4 essays (or she'll drop the lowest one if you do all 4), around 4 pages each.  A midterm and final which are a breeze if you show up to lecture.  \n"
        },
        {
            "course_name": "Early Christian and Byzantine Art and Architecture",
            "review_date": "August 05, 2009",
            "review_content": "\nIrina is a fantastic and interesting professor.  She truly knows her stuff. The thing that is so amazing is that you can ask her about the art, geography, monarchy, life styles, Christianity, ANYTHING related to that period of time, and she will know the answer.  I loved the class and found it to be the perfect foundation for a medieval art class.  The work is not gruesome, and she will look over your essay before it's due.  I highly recommend her.  Plus, she's a lovely person and doesn't mind spending time with students for extra TLC to review material.    \nWorkload:\nTotally reasonable.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 21, 2005",
            "review_content": "\nIrina is great. She is a fantastic teacher, never dull and always willing to hear comments from the class (even if they were a little dumb.) She is incredibly understanding about almost everything and rarely has a problem with handing in assignments a few days late if you let her know. She is very intelligent and well-spoken. I left every class feeling really good about what I just learned and because of her great teaching style I really remembered everything she said - which means studying for her very fair midterm and final won't be difficult. Overall, Irina will be a great Art Hum teacher and definitely stick with her.\nWorkload:\nThee very manageable papers. (She offers 4 and counts 3). Midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 21, 2005",
            "review_content": "\nIrina is great. She is a fantastic teacher, never dull and always willing to hear comments from the class (even if they were a little dumb.) She is incredibly understanding about almost everything and rarely has a problem with handing in assignments a few days late if you let her know. She is very intelligent and well-spoken. I left every class feeling really good about what I just learned and because of her great teaching style I really remembered everything she said - which means studying for her very fair midterm and final won't be difficult. Overall, Irina will be a great Art Hum teacher and definitely stick with her.\nWorkload:\nThee very manageable papers. (She offers 4 and counts 3). Midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 21, 2005",
            "review_content": "\nIrina is great. She is a fantastic teacher, never dull and always willing to hear comments from the class (even if they were a little dumb.) She is incredibly understanding about almost everything and rarely has a problem with handing in assignments a few days late if you let her know. She is very intelligent and well-spoken. I left every class feeling really good about what I just learned and because of her great teaching style I really remembered everything she said - which means studying for her very fair midterm and final won't be difficult. Overall, Irina will be a great Art Hum teacher and definitely stick with her.\nWorkload:\nThee very manageable papers. (She offers 4 and counts 3). Midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 19, 2004",
            "review_content": "\nProfessor Oryshkevich is truly a gem. Brillant is all I can say. After having spent some time at Columbia, I've learnt the distinction between someone who knows their stuff as opposed to someone who can actually teach. Professor Oryshkevich is both. What I find impressive is that when she asks a question and if the answer isn't what she is looking for, she is able to link the 'wrong' answer to the 'correct' answer. That has a profound impact, since it allows you to remember more vividly on what the material is about. I wouldn't say she is a lenient professor but she gives you chances to make up for your grade should you bomb any of the exams/essays. An A in this class is not easy. Be prepared to work your ass off, especially with the essays. An extremely friendly professor who will make the extra effort to help you outside her office hours. To me at least, your grade accurately reflects how much effort  you put into the course.\nWorkload:\n1 mid-term, 1 final, 3 essays (lowest grade dropped), 1 optional make-up essay to boost your grade\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 13, 2004",
            "review_content": "\nI'm going to have to emphatically disagree with the previous review.  Ms. Oryshkevich is actually a pretty good professor, who teaches an all-around decent class, and she's pretty friendly to boot.  She ensures that class discussion proceeds at a slow but regular pace.  Those who are intelligent but uneducated in art will probably find that she goes a little too slowly or is a little to easy on the student but that the class is nonetheless a solid introduction.  Those who are well versed in the discipline, though, might have reason to complain that it is all just too easy.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 13, 2004",
            "review_content": "\nI'm going to have to emphatically disagree with the previous review.  Ms. Oryshkevich is actually a pretty good professor, who teaches an all-around decent class, and she's pretty friendly to boot.  She ensures that class discussion proceeds at a slow but regular pace.  Those who are intelligent but uneducated in art will probably find that she goes a little too slowly or is a little to easy on the student but that the class is nonetheless a solid introduction.  Those who are well versed in the discipline, though, might have reason to complain that it is all just too easy.\n"
        }
    ]
}