{
    "prof_info": [
        {
            "prof_name": "Joshua Mailman",
            "prof_id": 10947,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 07, 2015",
            "review_content": "\nWorst professor I've ever had at Columbia. Or anywhere. \nAs someone with a very intense musical background and intense musical appreciation, taking Music Hum with Professor Mailman actually made me like music less. This is not to say that Professor Mailman is not a hard-working professor who deeply cares about the material--this is to say that Professor Mailman brought an intensely arrogant attitude to our biweekly classes. He was very weirdly misogynistic which was extremely off-putting not to mention a dick. He came in with an attitude that everyone understood the jargon he was using even though my classmates were for the most part non-musicians. As a musician I felt alienated by Professor Mailman--I cannot imagine what my peers were feeling when he would throw around expert musical jargon and expect everyone to follow what he was saying. That said, classes were thoroughly thoroughly boring. Professor Mailman spoke in a monotonous (but simultaneously cocky) tone for a good hour and a half every class. He assigned a shitload of work that no one actually did and then he looked mad when he realized no one listened to the three hours worth of music he put on Courseworks. No shit. \nProfessor Mailman also focused a great deal (too much) on the theoretical aspect of music. We spent three classes on Sonata Form and we didn't really talk about the ways in which music is a deeply personal, intimate experience. He made learning about music the opposite of enjoyable. \nIf you get him as a music hum professor, SWITCH OUT. I am serious. Do it for you--don't make the mistake I did and stick it out with him for a semester. \nWorkload:\n2 papers, online quizzes that did not make any sense, final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 23, 2014",
            "review_content": "\nVery simply, if you want Music Hum to be an easy class drop/do not register for Mailman. This guy seemed to be on a mission to make this class a huge part of our lives this past semester. For every class, he expected that we would go through his homework assignments (literally 3 hours long) to prepare. He doubled/tripled the amount of music that we were responsible for by adding his own songs to the already challenging amount presented in the textbook. When preparing for exams, I would have 8 hours of music on iTunes that I had to be able to identify. Would study all night to maybe get half of them right. Ultimately, 90% of the class did not do the work. He can also be very annoying. For example, was angry when people showed up late when it was literally blizzarding outside. Decided he would start taking points off for coming in late and then suddenly stopped. Would get mad when people asked him to write larger. One thing that was cool was when he brought in a live jazz demo to perform for us. I really like jazz and was looking forward to this part of the class. We actually did not cover any jazz in class because he messed up and got way behind on the syllabus. This of course did not stop him from putting several questions, including an essay, on jazz in the final. When the jazz group came to perform, another music hum section came in to watch it with us. Their professor seemed to be a really cool PHD student. I asked myself, \"Why couldnt I be in that section?\". Being so behind on the syllabus, we did not cover several of the composers of the 20th century. A reasonable student would assume that he would not test much on what he didnt cover. WRONG. These composers popped up all over the final. The final: 1. He said that the final would cover everything from the classical through the end of the semester. In actuality, it was probably 75% stuff from the final two weeks of the semester that he floored it through and 25% everything else. 2. The final was absurdly long. Listening ID with ~25 questions. Multiple choice and short answer. Multiple choice questions. And 2 full length essays. Everyone took  nearly the full 3 hours to do the exams. I talked to friends in other Music Hum sections, their finals maybe had a listening section and 1 essay that took them an hour and a half usually. All in all, Mailman is a huge ass and you should not take this class unless it is literally second semester senior year and you need it to graduate. If not, wait for an opening in that cool PHD student's section. \nWorkload:\nDaily homework which he doesnt collect but expects you to do (~6 hours per week) , 2 midterm \"quizzes\" , 2 concert reports, 1 ridiculous final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 21, 2014",
            "review_content": "\nThe tone of the 2 reviews reviews is not quite right imo, so some more info could be helpful. \nProfessor Mailman did assign *way* too much work. He added an entire supplementary curriculum to the textbook and seemed to think it was reasonable - doing all of it would have taken a number of hours for each class. Coupled with the oft-held perception that Music Hum is easy, this definitely pissed people off and I was frustrated at times too with an assignment that was just way too long. \nOn the other hand, success did not depend on doing every single bit of work. Also, I found listening to the pieces to be fun, and the times when I was even somewhat conscientious to the textbook and additional stuff, I found myself learning a ton. His curriculum was well-designed, and he took lots of question in class. At times his flexibility made things confusing because he was too nice to shut people down. \nI agree with the below reviewer that he was the hardest working professor I have had at Columbia. I often felt guilty for not putting in even a modicum of the effort that he was, and he is passionate about the music and teaching. He is a bit of an oddball but I found his humor awkwardly hilarious. He is definitely some sort of musical genius. \nLastly (and, to be fair, at least in part because of the copious amounts of assigned work), the Fall 2013 class was a terrible one. 80% of the class did none of the homework and never spoke in class, and he would often get frustrated with complainers about grades. the few people who did participate ranged from honestly curious to insufferably know-it-all. \nall in all, I bet you could do a lot worse than Professor Mailman, but expect to put more time in than you might expect for Music Hum to be successful.  \nWorkload:\n2 concert reports, 2 quizzes, final, and participation. \nTextbook text+listening and supplementary listening+guiding questions. Quizzes and Final had annoying multiple choice section with randomly specific questions cherry-picked from the reading. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 20, 2013",
            "review_content": "\nI disagree with the reviewer below. While he does ask you to listen to many of the pieces in the textbook, if you can figure out a specific characteristic of each piece, then it shouldn't be too hard to identify them even if the most \"famous\" part of the piece isn't played. \nAs for professor Mailman himself, he is by far the hardest working professor I've ever had at Columbia. Not only does he create his own videos to help us understand the materials, but he also creates study questions for the quizzes that show up word for word on the quizzes and final - he even said so himself! The tremendous amount of work he puts into making the class as good as possible is how every professor should do it. I am very glad that I ended up in his class, as he is a very nice professor and you will definitely come out of his class with a very deep understanding of the music.\nP.S. He treated us to pizza and milkshakes after we watched the opera.\nWorkload:\nListening and reading for every class, 2 concert reports (3-4 pages), 2 quizzes (45 mins each), final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 17, 2013",
            "review_content": "\nComing from someone with a musical background, you should drop this class immediately.  Not only does he expect you to be able to identify every single piece in the textbook, but he just about doubles that amount with outside material of his own.  Very disorganized - we were way off the syllabus, lectures were disengaged, and his courseworks is a mess.  He switched how he posted assignments halfway through.  No one knew any of the IDs on the final - he played obscure parts from obscure songs.  Save yourself hours of work and switch sections.  Really disappointing for a class that I was really looking forward to.\nWorkload:\nListen to all of the songs he posts and textbook readings, 2 concert reports, 2 tests, final.\n"
        }
    ]
}