{
    "prof_info": [
        {
            "prof_name": "Harold Evans",
            "prof_id": 715,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Physics for Poets I",
            "review_date": "January 20, 2005",
            "review_content": "\nI LOVED Professor Evans and I LOVED his class.  As other reviews stated, he is extremely well organized, very respectful of any and all questions, and endearingly corny on many occassions.  Lectures are really important but if you go to them regularly, you don't have to do much other work.  You definitely have to study for the midterms and the final, but that's the only time you need to do outside work -- only three times all semester.\nThe best part of this class is you actually walk away smarter.  In some ways, it is more difficult than math-based physics because you have to be able to explain the concept of curved spacetime in words, not in equations (which is the way physicists think about it so they don't go crazy).  But you will be able to do that, and you will feel so good about it.\nWorkload:\nThree tests that require studying before; one optional paper that can be great if you choose a topic that interests you; essential attendences at lectures.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "January 18, 2005",
            "review_content": "\nProfessor Evans' style of teaching allowed me to enjoy learning about physics more than I could have imagined. I really enjoyed his laid-back style and how he realized that the students in the class weren't going to have the mathematic capabilities of physics majors, making the class more about history and less about applications. The midterms and finals were very fair, especially the midterms. There are two optional texts (which are helpful), NO REQUIRED HOMEWORK (problem sets are posted with solutions for work), and all you really need to do is attend class and take notes to get a B or higher.\nWorkload:\ntwo midterms and a final, not too difficult. grading on a curve but it isn't a system where everyone gets A's. the average is a B+/B I'd say.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "January 04, 2005",
            "review_content": "\nOne of the few (two) professors I've had so far at Columbia who seems to genuinely enjoy teaching and the subject matter he presents. Extemely organized, Professor Evans writes all major concepts, lists and examples he touches upon on the board. He never strays from the subject at hand and is open to questions from the class. Although the class involved a bit more math than I had expected, it was nothing earth-shattering and Professor Evans covered and explained it thoroughly.\nHe's really an excellent professor and I'd recommend taking this class with him. This is the only class this past semester I actually did NOT drift off to sleep in.\nWorkload:\nExtremely light. 6 optional (unless you attend Barnard, I believe) problem sets, which he provides detailed answers for after they are due, three exams and an optional essay. \n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "January 02, 2005",
            "review_content": "\nDefinitely one of the best  instructors I had this year. If you've ever wanted to understand (at a very basic level) the thinking behind, say, the special theory of relativity, but thought you lacked the mathematical training to approach it , Evans proves you wrong, by being incredibly patient in his fielding of questions and his knack for finding ways to visually illustrate the answers to those questions. (That patience manifests itself into a modesty that is truly refreshing; for example, when one student asked him how Aristotle responded to a possible flaw in his 'laws' of motion, Evans didn't hesitate to say 'The short answer is, I don't know.' and try to offer possible explanations.  This is a guy who does proton-antiproton collision experiments at Fermilab and CERN admitting that he doesn't know the answer. Awesome.)\nHis lectures take a linear a-b-c approach, not just a tour of \"hey, here's ANOTHER aspect of physics\"; by the end of the first semester, you realize it's all been leading up to helping you understand the theories of relativity, step by step. Lectures really ARE necessary in this course, and you'll have to do a little extra work to get back on the path if you miss a few. Overall, though, if you have an interest in this topic, this approach is excellent. \nIn addition to the almost-novel-like lecture structure, another plus is his accessibility. I've come in outside of posted office hours to just ask a question about something I didn't perfectly understand, and he's completely accomodating, taking time to answer any question. Nice guy, great instructor.\nWorkload:\nJust two midterms and a final, problem sets you don't have to hand in, and optional lab/paper...if you can do all the problem sets you shoud have no problems with the exams.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "December 05, 2004",
            "review_content": "\nOther reviewers have been unjustly harsh on Professor Evans.  He is surely not the most scintillating professor I have ever had, and his lectures include a lot of math for what is billed as a non-math course, but he genuinely tries to teach.  His lectures are well-organized and he gives every question from students a great deal of respect.  If you have taken physics before or know a lot about it, of course you will be bored, but that is the price of being lazy and retaking a subject just to get an A.  I myself was bored when we covered things I already knew, but after a few weeks we moved into more advanced material and I was fascinated.\nWorkload:\nNot bad at all; all problem sets and most readings are optional, although Evans may reccomend that you read towards the end to make up for material he hasn't had time to cover.  Tests definitely require studying, but for the math-challenged, they include few calculations.  For those who do badly on the tests, there is an optional research paper.\nLabs tend to be very basic, uninspiring but not difficult.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "April 18, 2004",
            "review_content": "\n   As mentioned in other reviews, this class is very well-organized: Professor Evans states the goals of the course and sticks to them. He always has a printed lecture outline to guide him, and picks up exactly where he left off last class. \n   The courses themselves are interesting, at least for non-science folks who want a glimpse into the way scientists operate (think an even friendlier version of Hawking's /A Brief History of Time/). It takes a historical approach to physics, which means explaining how specific observations and experiments led to the formulation and reformulation of theories, complete with anecdotes. Evans also focuses on the philsophies and biases of scientists in their day and how that influenced the development of physics. Evans himself is genuinely enthusiastic about the subject, which helps. \n   The workload is amazingly light. If you attend the lectures, you never have to crack open a book. Then study the solutions to problem sets and the midterm study guides two or three hours before the midterm, and you'll get an A! Also, the math is not intimidating--three lines of calculations in the calculation problems, at most.\n   The prof is /always/ present during office hours, and is happy to schedule meetings outside them.\n   Cons: The class might seem too basic and boring for those who have a good grasp on the fundamentals of physics. Some days Evans' voice, along with the warmth and  the humming silence of the lecture room will put you to sleep, so take some coffee with you to class. Beware of (endearingly) corny jokes.\nWorkload:\nExtremely light. Two midterms and a final based on lectures and non-mandatory problem sets (whose solutions are posted on the Web), an optional 10-page optional term paper. No outside reading if you attend the lectures.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "December 16, 2003",
            "review_content": "\nI disagree with the other reviewers who found Prof. Evans boring.  Maybe if you've already had a decent amount of physics or are taking this class just because it fulfills the science requirement this would be the case.  I, having very limited knowledge of physics going in, got exactly what I wanted - a good overview of several major areas of physics w/o too much math involved.  \nWhile he's not the best lecturer I've had, he's certainly good.  The material is interesting and well chosen.  Prof. Evans organizes it well and presents it with enthusiasm.  Sometimes he jumps quickly through equations that seemed complicated to me, but this usually just means they won't be on the exam.\nWhile it's not the easiest science requirement sequence, the work isn't bad and the knowledge gained is well worth taking the class.  You do need to go to lectures though - just doing the readings probably won't get you through the tests.\nWorkload:\n2 midterms, final, optional paper.  Heavy curve, but a wide range of grades. \n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "May 04, 2003",
            "review_content": "\nThis class was very well put-together, clearly set out with organizing principles that stayed true througout the semester. The tests were fair and reasonable, with no surprises, and a very generous curve. It was very easy to learn and understand, if the jokes were a bit lame. Coming to the class tired is a problem, because it makes it drag, and seem boring, but I suggest bringing a snack, professor Evans really has a lot of interesting information to impart. My only complaint is that he takes too many questions and dignifies even the stupid ones with a good answer, which occasionally causes the class to drag.\nWorkload:\nTwo midterms and a final, optional paper and lab (for Columbia students, for Barnard it is necessary for credit). The grading system is weighted based upon what you chose to do.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "April 13, 2003",
            "review_content": "\nThis class seemed to be quite interesting, but like the other reviewers said, the prof was pretty damn boring. Worst of all, the workload was incredibly difficult.  Having said tha, if you dont mind some of the monotony, you'll leave the class knowing some interesting and important basics of physics and the way you see the world really will change. \nWorkload:\nI don't know what the ther reviewers were talking about when they said this class is easy. It's pretty difficult due primarily to the relatively difficult course materal. Also,  the curve isn't nearly as generous as others indicated. \n"
        },
        {
            "course_name": "physics e & m",
            "review_date": "May 22, 2002",
            "review_content": "\nHe is super nice but his test problems were alot harder than in class problems. I think most professors at columbia are nice people. \nWorkload:\ndecent. problem sets - get the contraband answer book. curve is generous. \n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "May 07, 2002",
            "review_content": "\nProf. Evans is nice and very clear. He is open to listening to questions during lecture and he cares a lot about students taking an interest in him as a professor which makes him pretty accessible. His lectures are not that exciting and attendance reflected that. Some lectures are better than others. In the poets class he often tried to have demonstrations in class and would end most lectures with a good story or anticdote.\nWorkload:\n1601-1 problem set every two weeks which were not that bad and 2 midterms and a final which if you can do the problem sets were not that bad 1002-no problem sets or required reading. If you read Evans' study guides and solutions to optional problem sets then an A is pretty easy.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "April 25, 2002",
            "review_content": "\nThis guy tries hard to captivate the class, but the subject is just not that interesting. His exams are usually quite difficult, but the curves are fair. It's a decent class to take if you just want to fulfill your requirements. \nWorkload:\n2 midterms and 1 final Make sure you study\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "April 15, 2002",
            "review_content": "\nHopefully, they'll never let this guy teach this course again. I'm sure Dr. Evans is a fine physicist, but his first foray into teaching a course for non-science majors has been a total failure. Each lecture is a painful mixture of the dry basics of physics and awful jokes - I stopped attending them pretty quickly. The bright side? The class allowed me to finish my science requirement with hardly any work.\nWorkload:\nIncredibly easy. 2-3 tests + Final, all of which can be crammed for in a one night without attending a single class. The curve is extremely generous and the course is loaded with Barnard students taking it Pass/Fail.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "December 06, 2001",
            "review_content": "\nI think the other reviewers were a little harsh in their characterization of Hal as \"the most boring teacher I've ever had.\" His lectures may not be thrilling and can be a little dry, especially when he's going through a long proof that he's just told the class we don't need to know, but I would not say that they are the most boring ever. It's clear from his lectures that he does know exactly what he is talking about and it a really smart guy who just loves physics, but he may be too smart for the Physics for Poets class. He has trouble removing the complicated calc based parts and truly teaching the class for non-science majors. I found his lectures difficult to transfer to my notes because his examples tended to be long and involve what he calls \"worthless algebra.\" He also tended to make some leaps in reasoning that made the concepts difficult to understand. For example, \"Because it is impossible for someone to tell whether he is in free fall or in a zero grav situation without outside information, spacetime is curved.\" This may make perfect sense to a physics major, but to me it was a little hard to grasp. Also, the class content is weighted heavily toward relativity, a difficult concept to understand at first no matter the circumstances. This would have been less of a problem if the textbook had been helpful, which, unfortunately, was not the case. If you take the class do not buy the Ostdiek text (it's used only as a reference, not for problems) and buy a good textbook instead, this will make the class much more understandable and the exams much easier. Overall, I would say that the course is a decent was to get your science requirement taken care of (especially since you can be brain dead and get an A), but it may not be the best way to learn physics.\nWorkload:\n8 difficult but ungraded problem sets; 3 midterms, final, all with enormous curves (a 20/100 was a C in one case)\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "December 01, 2001",
            "review_content": "\nProf. Evans's lectures tend to be very boring and dry, partly due to the monotony of his voice that puts you to sleep. The only highlight of his lectures I remember was when he told us that he tried to generate moving magnetic fields from his cats. But I learned more physics more him than I did from Cole. He is a very patient teacher. He shows you how to apply each formula, and will go over each concept until you understand. Good class for engineers.\nWorkload:\nProblem sets are due every week. Some of the homework problems can be very challenging. Two midterms and a final, which are variations of his practice tests. Grading is very fair.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "November 08, 2001",
            "review_content": "\n\nWorkload:\nproblem set every week. 2 midterms and final. problems sets are time consuming.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "October 17, 2001",
            "review_content": "\nDo you like physics? Well if you do, don't take a class with Harold Evans because he is the most boring teacher I have ever had. I spent more time sleeping than listening through the whole year.\nWorkload:\nMandatory problem sets. The workload is medium.\n"
        }
    ]
}