{
    "prof_info": [
        {
            "prof_name": "Sudhir Venkatesh",
            "prof_id": 3608,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Media, Culture, and Society",
            "review_date": "February 20, 2015",
            "review_content": "\nThis is one of those classes that you didn't realize you loved until you walk out of the final. Professor V's methods are unconventional to say the least, but if you want deep class discussion and a solid explanation of modern media theory, this is the way to go. \nFor a lot of classes, you get out what you put into it, but that is especially true with this one. Do the readings if you want to do well, but--more importantly--if you actually want to take something from this course.\n\nWorkload:\nParticipation 25%, Midterm 25%, Final 50%\nEssay-based exams, but be warned that the TAs call you out your shit if you don't know what you're writing about\nA few opportunities for extra credit\n"
        },
        {
            "course_name": "Media, Culture, and Society",
            "review_date": "July 07, 2013",
            "review_content": "\nThese reviews are unnecessarily harsh. While the professor was strict (ok very strict, he had minimal tolerance of phone/internet use in class) and unconventional, I can honestly say that this was one of the most useful classes I took in my time at Columbia. I work in social media now and have to say there isn't a week that passes that I don't feel compelled to reference Shirky, Lessig, Surowiecki (names you'll come across a lot throughout the course, they are all top scholars of the online/digital world) or topics we discussed in class related to online communities, privacy, and crowdsourcing. \nI got a B on the midterm (uncurved) and ended up with an A in the class... you'll be fine. \nWorkload:\nNot too bad. One midterm, one final, two short 2-3 page assignments\n"
        },
        {
            "course_name": "Media, Culture, and Society",
            "review_date": "May 21, 2013",
            "review_content": "\nThe problem with Venkatesh is that you feel like you are being manipulated for his own gain instead of being in the class to learn.\nWhen you walk into Professor Venkatesh, you will like him. He is charismatic, humorous, and articulate. Everything he says will appeal to you for about five minutes until you realize that he is just talking out of his ass and says absolutely nothing of substance. He almost never moderates discussion, to point that irrelevant tangents consumer a huge portion of class time. In essence, he is the poorest example of the Socratic method that I have ever come across.\nNot only is Venkatesh unprofessional because he often shows up to class late, and tries to lecture via Skype under some pretty flimsy pretenses, it is also clear that he cares very little about the class.\nThat being said, the TA's were exceptional and the readings were interesting for anyone who is not a sociology major. Honestly, if you care about this stuff, just get a copy of the syllabus and use Wikipedia.\nP.S. the TA's said they had never seen a un-curved test graded so harshly.\nWorkload:\nMidterm, final, postings on courseworks\n"
        },
        {
            "course_name": "Media, Culture, and Society",
            "review_date": "May 03, 2013",
            "review_content": "\nI'm pretty sure Prof. Venkatesh was too busy trying to find new ways to steal money from Columbia to actually put effort into teaching this course.\nToo long, don't want to read? In short, for the course evaluation question: What improvements could be made to the course? I responded with don't offer it. \nThis course felt like a drag the whole semester. Most of the readings were dull, and in no way made me want to engage with the material or participate in class.  We spent a long time on some subjects than seemed irrelevant to the course. I felt like some of them readings and assignments had more to do with the instructor's interest and what his friends were working on than with their relevance to the course. \n The instructor often had mistakes on his power points that were distracting, and sometimes made the material incomprehensible even to himself. Sometimes he literally couldn't understand HIS OWN power points. He struggled to start videos on the internet sometimes, and this is a MEDIA class. Come on, he should really know how to work the sites he is teaching about.\nHe gave a multiple Skype lectures that were obnoxious and didn't benefit the course. It was clear he just didn't want to show up for his own class, while still enforcing a strict attendance policy for his students. He once showed up 40 minutes late to class, and had the T.A.s teach until he arrived. I never really got the impression that he cared about this class at all. \nHe only ever succeeded in engaging a handful of students who participated in lecture for the rest of the semester. Lectures were often dull, and just presented the material from the readings without raising interesting questions.  \nThe assignments were graded on a 0-1 scale, so even if you did the assignment you could potentially receive no credit for it. The exams were graded so harshly it felt like he wanted us to do poorly on them. Even the mean T.A. said she had never seen someone grade an exam so harshly. You had to use specific words in your short answers in order to get full credit. He also included quote identification without informing us before hand that it would be included on the exam. \nDo not take this course. \nWorkload:\n2 memos (short papers), 1 midterm, 1 final exam\n"
        },
        {
            "course_name": "Media, Culture, and Society",
            "review_date": "April 03, 2013",
            "review_content": "\nProfessor Venkatesh is not nearly as bad as everyone is making him out to be. His class is captivating and he really grabs the attention of his students for the entire hour and fifteen minutes. Yes he might have a bit of an ego but that just adds to the class. His lectures are full of information and the information is actually meaningful. Another reviewer said he's strict about computers but that is not applicable anymore. He lets students have their computers out for most classes. Sometimes with guest lecturers he feels this is inappropriate. His classes are filled with lots of reading which is pretty essential to do if you want to do well in the course. There are 2 memos (2-3 pages) that have 2 questions. They are not horribly difficult. If you go to class you should be able to answer them no problem. Success on the midterm depends on if you're doing the reading, attending class, and attending weekly discussion sections. Overall I would highly suggest Venkatesh for any student that wants a very engaged professor. He is definitely not the cookie cutter kind of teacher. He can be controversial at times but this makes class even more worth coming to (i.e. brought a prostitute for a guest lecturer).\n\nWorkload:\n1 midterm, 2 memos, 1 final, attendance \n"
        },
        {
            "course_name": "The Social World",
            "review_date": "August 09, 2010",
            "review_content": "\nI took a sociology course at a community college before attending Columbia, and I learned at least ten times more from the community college class.  This class was a huge disappointment to me.  I came into this class expecting to gain a solid foundation of sociological knowledge upon which I could build my planned sociology major, but instead, this class would more appropriately have been titled The Chicago School of American Inner Cities.  It became clear over the course of the semester that Prof. Venkatesh has an extraordinarily narrow breadth of knowledge when it comes to sociology.  My TA even cautioned us that we were missing knowledge of key theories routinely covered in introductory sociology classes, knowledge we will be expected to have in future classes.\nBeyond the narrowly focused nature of the coursework, he himself was almost intolerable to most classmates I talked to.  His inflated ego was manageable to me, but his trick questions on tests and six missed classes (while enforcing a strict attendance policy upon students) were just plain disrespectful.  HE LITERALLY MISSED SIX CLASSES!  I'm still not even sure how this is possible.  And, even worse, on 4 of the days he wasn't present, the TA's took attendance so the class could watch YouTube videos!!  Never in my life did I expect I would be forced to watch YouTube videos during class at an Ivy League institution.  It's an absolute embarrassment. \nWorkload:\n50-100 pages of reading each week, a weekly two-page writing assignment on the readings, and two tests containing trick questions about minute details of the readings. Mandatory attendance for students (not for the professor), even to watch YouTube videos in class. \nI received an A in this class, so it is definitely possible if you're willing to test your patience.  However, for all of the hoops one must jump through to receive a good grade, I don't think this class is worth anyone's time or money.  I sincerely regret that I went further into student debt because of this class.\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "May 17, 2010",
            "review_content": "\nI think some of the reviews of this class and this professor are too harsh, so I'm just going to throw my two cents in.\nIt's true that the class was not terribly well organized. I often left class unsure of what I was supposed to have learned. This was not because I didn't learn anything in the class, but because the things I did learn seemed so random that I knew they must have just been examples for a larger point he was driving at. Unfortunately, Professor Venkatesh rarely articulated his \"larger point\" - in fact, I'm not sure if he ever articulated an opinion even once in the entire course. His class basically consisted of him asking questions, waiting for responses, and then shooting those responses down. He didn't do this in a mean way, more as a \"devil's advocate\" to make us see how sociology might expose preconceptions in our thinking. I found this to be an interesting teaching method, and generally enjoyable. It did not lend itself to organization, but it wasn't without merit. If you need a lot of structure, this may not be the course for you.\n Does Professor Venkatesh have a high opinion of himself? Probably so. Is he as arrogant as everyone says he is? Definitely not. His references to himself were almost always in a self-deprecating way, even if they did tend to highlight the fact that he is living a pretty good life. They were jokes. Yes, he made fun of Columbia students a lot, which I guess is part of why people are so miffed. Those people are missing the reason he did it: not to make fun of us but to get us to think about how our lives affect our ideas about the world. His jokes were designed to make us think about whether or not we agreed with what he was saying, and how other people with different life experiences might see things differently from us. \n Occasionally his lectures were boring, because he was clearly going off of a few notes (at most), and winging the rest of it. So once in a while he would wander into repetitive or seemingly irrelevant territory. In general, though, he covered his chosen topics in a way that, even if it wasn't totally thorough, encouraged us to think about the issues.\n The class was not as incredible as I'd hoped, but I found it to be worthwhile and engaging more often than not. \nA lot of people are crying about the rules regarding lateness and computers. Don't be late. Don't use a computer in class. These rules are well within the rights of any professor to insist on. I don't see how anyone could complain about not being allowed to violate such basic rules.\nWorkload:\nMandatory class attendance, only one absence allowed.\nWeekly discussion section, attendance is mandatory. \nWeekly memos that answer basic questions about the week's assigned reading. You either get a 0 or a 1 on these, and they are extremely easy so if you do the reading, you will get a 1. They're basically reading checks.\nThe midterm and finals are the areas where I have my most substantive criticism of the course. They are much more about \"Who wrote this?\" and \"Who said that?\" and \"Define this term\" than they are about the concepts we've discussed in class or in our discussion sections. The midterms and final, while easy, seemed extremely out of sync with what was emphasized in class.\nOverall I cannot imagine anyone not getting an A in this class as long as they actually do the work.\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "May 10, 2010",
            "review_content": "\nI absolutely agree with the review below. This class was an utter disappointment. Venkatesh is a cool guy who's done a lot of truly ballsy field work, but as a professor he pretty much failed. It's not so much his arrogance that got to me, but the total lack of effort he put into the class. On the very first day, he scared the crap out of everyone by telling us that we could not pass/fail the course and we could not come more than 5 minutes late or he would lock us out. That, in addition to his constant assertions that sociologists are \"all assholes\" and that Columbia students are mostly either \"legacies or athletes\" who don't truly deserve to be here, made me believe that the course would be killer but that at least the professor would be brilliant and make it worth it. Oh, how wrong I was.\nFirst of all, he never enforced the coming late rule because he himself was late the vast majority of the time. Either that, or he didn't show up at all. If we had a movie to watch or a test to take, you can bet that he was not there. He did not even come on the very last day of the course, since we took our final that day. Although this may not sound like a big deal at first, it truly is a reflection on the minimal amount of work he put into the class.\nEnough on the instructor - the class itself was also a complete mess. This class is supposed to be an introductory course into sociology. This sort of class should be very organized and structured and have a clear direction. Well, you can bet that Venkatesh's class was none of these things. If you asked me to sum up what we learned and why we learned it, I honestly could not tell you, or even bullshit an answer. The class revolved around weekly readings which we would discuss in class. The readings, although sometimes pretty engaging (but often not), were not given out in any sort of understandable order. We jumped around from topic to topic, with a LOT of focus on poor black people living in public housing (Venkatesh's speciality).\nI would definitely also like to compliment the TA's though, because they all worked very hard and were present every class (again, unlike the actual instructor). My TA, Rajiv, was extremely knowledgeable and held very engaging recitation sections. \nOverall, I was deeply disappointed by this course and its instructor. I truly expected better.\nWorkload:\nSome looooong readings. Almost weekly writing assignments. \n"
        },
        {
            "course_name": "The Social World",
            "review_date": "May 09, 2010",
            "review_content": "\nIt's so easy to hate on this professor. He was late, he wasn't prepared, or he just didn't show up more times than I can remember. At the end of the day, I still learned much more than I would have in any cookie cutter intro class. Venkatesh asks his students to reconsider preconceived notions, considering how institutionalized we all are. Yeah, he's a douchebag. Yeah, he thinks VERY highly of himself. But he knows his shit. If you want to attend lectures that provide you with a very interesting, though not wholly complete perspective, this is the class for you. I did not miss a single lecture and I found most of what he said to be insightful. He truly is passionate about sociology, and that was clear. He just wasn't very interested in his students. He hates frats/greek life and athletes like no other, but you know it's because he was just an awkward skinny Indian kid at UCSD who got picked on. Now he brags about his house in the Hamptons/spots on CNN to make up for it, but it's not hard to see through that.\nI loved this class. It definitely made me ask myself questions that I had never thought to ask before. Yeah, I could have obtained that from any sociology book, but this was fun ride. I'm not a sociology major, not even close. I took this class for kicks, and it really was not too difficult for the A that I got out of it. \nMy TA, Natacha, was AMAZING. Props to her for being so prepared and encouraging. She was definitely among the best TAs I've had at Columbia. Great researcher, and overall a wonderful human being.\nWorkload:\nWeekly 1-2 page memos; reading (sometimes heavy); 2 midterms. Do the reading, write the memos, go to class, take the midterms (and don't screw them up), get an A. \n"
        },
        {
            "course_name": "The Social World",
            "review_date": "April 14, 2010",
            "review_content": "\nI have thought long and hard about an eloquent, intelligent way to describe Sudhir Venkatesh but there simply is no word in the english language more suitable than this: douchebag. Literally, he is the reason I decided not to be a sociology major. I was very excited to take his class at the beginning of the semester and specifically chose this class before all others because of his reputation, but the letdown was obscene. \nFirst, he begins the first class by telling everybody NOT to be sociology majors, constantly harangues the class about being \"overprivileged\" because we attend columbia, has a strange fetish with athletes and the military, and is the most arrogant SOB I've ever had the displeasure of listening to. Then, he allows ONE absence, excused or unexcused, without exception - and yet, he doesn't show up to class half the time and when he does come, he's late! He comes to class very obviously without a plan and tells us anecdotes as a way to mask the fact that he has absolutely nothing prepared. Yes, some of his anecdotes are interesting - but this is an intro course and I was expecting to walk out of here with an overview of what sociology was. Instead, I know all about Venkatesh's life and all of the newspapers he's been published in. \nI thought everyone in the class could see Venkatesh for the unjustifiably arrogant asshole he is, but when we were asked to review the class in the T.A. recitation, everybody praised him! I was appalled at the mindlessness of my classmates, who all decided they enjoyed the class because Venkatesh 'is clearly an expert in his field and has a lot of personal experiences to offer the class'. Bullshit! A good professor (including experts in particular fields) is able to weave in their personal experiences with a BALANCED overview of theories and other subject matter. Venkatesh was not able to do so. Many fail to realize, he is not the holy grail. His experiences give him the potential to be a great professor but he legitimately does not care about the class, making him a horrible teacher. I wish people would understand that a famous name does not make you a good teacher. I should have taken the usual sociology professor's course - his CULPA reviews are so much better!\nAlthough, I want to give a shoutout to my T.A. Natacha! She rocked!\nWorkload:\n60% are 1-2 page memos written once a week (you either get a '1' for satisfactory or a '0' for unsatisfactory or not turned in), 10% T.A. participation, 2 midterms worth 15% each\nEasy to get an A\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "March 29, 2010",
            "review_content": "\nIt's unfortunate that Professor Venkatesh is such a pompous asshole or this class would be infinitely more enjoyable.  The man thinks that because he's written a book that appeared on the Colbert Report that somehow his time is infinitely more important that anyone else. He mentions his house in the Hamptons often, trying to be ironic or funny about it but he just comes of as pretentious. And prepare yourself for the constant references to johnny Frat-boy, another attempt at humor which just makes him seems like more of an asshole.  \nIn a lecture of more than a hundred people he will throw you out if you show up 5 minutes late, if you bring a computer, or if you're talking. This is presumably because it distracts everyone from listening to his voice and him from saying the most important thing you'll ever hear in your life and why would he want to deny you that? (What sucks the most is you could make an honest effort to get to class and if you're slightly late it's not even worth it b/c you'll just be asked to leave) The TAs are all scared of him and he'll have no sympathy for you because his life is obviously more important than yours.  He was brought here to entice more students to sociology and he has done just the opposite, scare everyone away. It really is too bad because the course work is interesting.  \nWorkload:\nAttendance is taken daily, and Memo's on the readings are required weekly.  The midterm has more to do with remembering names of authors than it does with actual knowledge of the readings. \n"
        }
    ]
}