{
    "prof_info": [
        {
            "prof_name": "Ezra Tessler",
            "prof_id": 11145,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "America Since 1945",
            "review_date": "August 17, 2011",
            "review_content": "\nOverall, an excellent TA. \nNegatives: the discussion sections themselves were a bit disjointed, I think they would have benefited from more structure and focus on clarification of the hot-button terms from that week's readings. \nPositives: He provides detailed, thoughtful feedback on EVERYTHING: courseworks posts, exam responses and papers. My writing benefited more from this TA than it did from my UWriting professor. He clearly cares about what you have to say and is more than willing to meet up to discuss assignments. \n\nWorkload:\nweekly postings, semester paper, midterm, final. \n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "May 11, 2011",
            "review_content": "\nAmazing. There are no words to describe how smart, considerate, devoted, funny--even, gasp, cool--Ezra is. \nHe TA'd two sections in Alan Brinkley's America Since 1945 class, and blew me away with how prepared and knowledgeable he was. But perhaps you expect that from your history TAs. Ezra, though, got people to talk (a lot) in class, made new points about the readings, all of that. \nPlus, he wrote responses to all of our CourseWorks posts (in chickenscratch) and wrote pages upon pages in response to our midterms and papers. He puts as much effort into reading and responding as we do into writing, and this invariably motivates his students to work harder. \nOn top of that, he has some exciting areas of academic interest that aren't the old-guard American history stuff you might be used to. And he's obviously passionate about them, too.\nIf there are TAs better than Ezra (tee hee) here, I certainly haven't found them.\nWorkload:\nStandard, depending on the course.\n"
        }
    ]
}