{
    "prof_info": [
        {
            "prof_name": "Daniel Attinger",
            "prof_id": 2738,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Mechanics of Fluids",
            "review_date": "January 12, 2009",
            "review_content": "\n1. funny. the man can be a stand-up comedian.\n2. could be a douche at times. he likes to pick on people.\n3. great professor in terms of getting the concepts across clearly and concisely\n4. class content is hard, and he curves to a b-/b\n5. the midterms, graded by the TAs, are very harsh. make sure you know your stuff and write all your assumptions. \nWorkload:\n2 midterms (20%/30%), final (45%), weekly hw (5%). do your hw. they're harder than the exam problems, which are very fair and hw based, but it's the best way to prepare. he puts 1 hw problem on every exam, so study all the solutions.\n"
        },
        {
            "course_name": "Thermodynamics",
            "review_date": "January 24, 2006",
            "review_content": "\nLectures are alright, nothing too exciting, nothing that boring. When he gets bored, he likes to randomly call on people, but this only happened in a few classes. He says he wants to help people, but he seems very unapproachable (The TAs on the other hand...)\nHomework is necessary because of the nature of the class. Fall behind one week and you might regret it come midterm time. Thermo is basically the same thing all semester, just adding new concepts so you must be on top of the material. Dropping three homeworks is enticing and not doing a few more doesn't really hurt because HW is only 5%, but you probably will want to resist that temptation. \nGrading is very strict. He hates to change grades. Argue too long and he'll start finding things that he can take more points off than on. For the midterms, you have your TAs, but for the final, you don't really have a chance. He curves to a B-, and all the grades are distributed fairly equally (same number of As, A-s, B+s, Bs, etc.) I think there were about 3 A+s in a class of ~80.\nBasically, this is a performance driven class (midterm/final). Don't think homeworks will help your chances at boosting your grade. I had a 99% HW avg... which did absolutely nothing for me. I could have done 0 homeworks and received the same grade.\nWorkload:\n2 Midterms (20%, 30%), Final (45%), ~10 HWs (5%) drop 3.\n"
        },
        {
            "course_name": "Thermodynamics",
            "review_date": "December 21, 2005",
            "review_content": "\nterrific instructor but not so generous with grades. The class is curved to B-/B, and there is no doubt that he's the pioneer of grade inflation figher.\nWorkload:\nOK. two midterms, one final. \n"
        }
    ]
}