{
    "prof_info": [
        {
            "prof_name": "Aenon Loo",
            "prof_id": 2407,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 24, 2006",
            "review_content": "\nAenon is the most caring teacher I have had so far since I've been to Columbia.  He is completely committed to making sure that all of the students in the class gain a deeper understanding and appreciation of music.  He also turned me on to Kraftwerk, and he was a kind grader.  Although I took his 9AM section, Aenon's music hum class was definitely the highlight of my week this semester.\nWorkload:\ntake home midterm, 1 concert review, take home quiz, final that he scheduled before finals week, and an optional chinese meal where he does the ordering from a special menu!\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 01, 2006",
            "review_content": "\nAenon is an amazing teacher. Makes each class fun and interesting. Take this class, one of the best instructors that I have ever had!\nWorkload:\neasy. take home midterm, listening quizzes, standard final (he gave it to us in class so we wouldnt have to stress during exams)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 01, 2006",
            "review_content": "\nAenon is an amazing teacher. Makes each class fun and interesting. Take this class, one of the best instructors that I have ever had!\nWorkload:\neasy. take home midterm, listening quizzes, standard final (he gave it to us in class so we wouldnt have to stress during exams)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "July 06, 2005",
            "review_content": "\nIf you're lucky enough to register into Aenon's class, by Zeus, stay there.  Even if you have to endure a 9 am class like I did, stay there.  You won't regret it.  Trust me.\nAnd if you're the savvy type, seek out his section after Mr. Bulletin posts the names of all the Music Hum professors.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 13, 2005",
            "review_content": "\nYou'd be striking gold if you are assigned to Aenon's class!  He's a graduate student focused on composing music.  He teaches all the important stuff in the book, but also incorporates many interesting, cool knowledge.  He would often play music that are very intriguing in class.  In the last class he played his own compositions.  He focuses on careful listening and wants us to be able to listen to music carefully and appreciates it accordingly.  He doesn't put great emphasis on historical background and memorization.\nHe's a very caring and understanding instructor.  He would move the dates of the quizzes to accommodate our schedules (he even changed one to a take-home assignment).  The final was during a class period.  An awesome awesome guy to take the class with.  He even took us out for dinner before we went to see \"Carmen.\"\nWorkload:\n3 quizzes (easy), a midterm and a final.  Just one concert report.  It's as easy as you can get.  Getting an A+ is not a stretch at all.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 08, 2005",
            "review_content": "\nI'm pretty much obsessed with Aenon Loo, and not just because his class was legitimately the easiest one I've taken at Columbia.  I started off kind of a cocky bastard because I have a lot of musical background, but I attended his classes probably more than I could have gotten away with and genuinely learned a lot.  Aenon (and he wants you to call him Aenon) is a passionate composer who really likes to teach, and he made it clear to us from the beginning that he cared a whole hell of a lot more about us becoming engaged and informed listeners than he did about our memorizing dates.  He follows the book completely, which helps in studying for the quizzes and final.  Aenon was one of those professors who you really want to take out to dinner--he loves Radiohead, and I really regretted missing the Chinese lunch he treated us to after the final.\nWorkload:\nEasy cheese.  Only one concert report (5-7 pp) and no other papers.  Three quizzes you'd have to be comatose to fail and a completely doable final--which, I should note, he rescheduled for before exam week so we wouldn't be too stressed.\n"
        }
    ]
}