{
    "prof_info": [
        {
            "prof_name": "Elisheva Carlebach",
            "prof_id": 4961,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Medieval Jewish Cultures",
            "review_date": "February 19, 2015",
            "review_content": "\nNot only is professor Carlebach an amazing lecturer, she is also incredibly gracious. This has not been my experience with many of my other Columbia professors.  She also genuinely takes an interest in her students.  Not only did she organize an amazing trip to the Met, she also regave her tour for those students who came late to the 10 am Met visit.  Professor Carlebach is also incredibly open to hearing students thoughts on their own projects and is overall very approachable. Her students clearly find her inspiring and there is a sense of community among the students that I have not experienced in any other Columbia class. She really is a rare treasure and had I not had such a hectic schedule this semester, I would have taken another class with her. And I know I am not the only one! \nMy only complaint was that she did not post her lectures online.  \nWorkload:\n1 midterm\n1 final\n1 research paper\n"
        },
        {
            "course_name": "Medieval Jewish Cultures",
            "review_date": "February 19, 2015",
            "review_content": "\nNot only is professor Carlebach an amazing lecturer, she is also incredibly gracious. This has not been my experience with many of my other Columbia professors.  She also genuinely takes an interest in her students.  Not only did she organize an amazing trip to the Met, she also regave her tour for those students who came late to the 10 am Met visit.  Professor Carlebach is also incredibly open to hearing students thoughts on their own projects and is overall very approachable. Her students clearly find her inspiring and there is a sense of community among the students that I have not experienced in any other Columbia class. She really is a rare treasure and had I not had such a hectic schedule this semester, I would have taken another class with her. And I know I am not the only one! \nMy only complaint was that she did not post her lectures online.  \nWorkload:\n1 midterm\n1 final\n1 research paper\n"
        },
        {
            "course_name": "EARLY MOD EUR: PRINT & SOCIETY",
            "review_date": "September 02, 2014",
            "review_content": "\nIf you have the opportunity to take this class, absolutely do. Professor Carlebach is an absolute rockstar. Her classes are super fun, even at early 9:00 AM, and she is always there to make time for her students for revising papers and just talking. The workload is not bad, and very manageable as she will have sometimes more than one study session for the final exams to make sure everyone does well. She is literally just the bomb.\nWorkload:\nNothing too bad, about 40 pages of fun reading a week.\n"
        },
        {
            "course_name": "EARLY MOD EUR: PRINT & SOCIETY",
            "review_date": "April 14, 2014",
            "review_content": "\nI took Print and Society of the Early Modern Period with Professor Carlebach. In short, she is absolutely wonderful. At most, there will be 60-70 pages of reading a week, and usually there is about 40 pages of very interesting and quick reading.The class itself is really interesting and professor Carlebach has a very engaging teaching style, always armed with fun slides and illustrations. There is a midterm, a 12-15 page paper, and a final, all of which are manageable if you keep up with the reading. If you can, do take this class. It's really a great time.\nWorkload:\n40-70 pages of reading, depending on the week.\n1 midterm\n1 12-15 page paper\n1 Final\n"
        }
    ]
}