{
    "prof_info": [
        {
            "prof_name": "Samuel Sia",
            "prof_id": 4035,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Thermodynamics of Biological Systems",
            "review_date": "May 21, 2015",
            "review_content": "\nI'm kind of surprised there isn't a review for this class. Hasn't this been a BME requirement for a while? Anyway:\nProfessor Sia is all in all a very decent professor. He starts every class with a 15 - 20 minute review of the previous material. While this was useful, it sometimes did get a bit tedious if the previous material wasn't too difficult. But this is a minor complaint. He takes the time to ask if there are any questions, several times during the lecture, and often will take many minutes to answer the question, especially if the question raised some important point about the material that isn't directly covered. In this way, and he emphasized this many times throughout the semester, he made it clear that he isn't teaching us this class so that we can pass his class. His desire is for the class to understand the fundamentals of thermodynamics, so that we would be able to understand the literature about the topic, should we ever encounter it (we're BMEs, so yeah, it's gonna come up again). His examples in class are, for the most part, different from those in the book, so that we get twice the material exposure. \nSpeaking of the book, it's absurdly dense, and we only cover about 25% of it. Thus, MAKE SURE YOU GO TO CLASS, OR AT LEAST GET THE NOTES. The exams ONLY cover material presented in class. If you study the book, you will likely fail, as it presents the material in a more stat mech sense than Professor Sia does. \nThe TA, Henri, was perhaps the best TA I have had or ever will have. He answered all email questions promptly, was exceedingly bright, and conducted recitations with professionalism while making the material fun to think about. I think he's from a math background, as he would often get super excited and derive the mathematical bases behind some of the stuff we were covering, which I enjoyed. \nPSETS: Not easy, but we get an absurd amount of time to do them (like 2.5 weeks for one of them, 2 weeks for most). Half of the PSET grade is accuracy; the other half is a grade for your self-grading of them. So, your actual PSET grade will be much better than what you actually got. \nEXAMS: Very easy, especially with the rule that we can put anything we want on the equation sheet, double sided. Combine that with a knowledge of LaTeX or really small handwriting, and you can shove the whole course material on it. 80% of the exam is straight from a class example, a recitation problem, or a homework problem. There's a 10 pt bonus, which, both times, was a really simple derivation. The other 15% is basically 1 problem that is a bit of a curveball, but will not be difficult if you know the lecture material cold (or your equation sheet does). I don't remember the average for the midterm, but Professor Sia says the class average is a B or B+. \nOh yeah, there's no curve. Zero. None. Everyone fails, everyone gets an A+, doesn't matter. But that shouldn't stop you from taking it. I had no background in thermo and did really well, so go for it. This only encourages collaboration and completely eliminates competition, so it's a really laid back atmosphere. \nAll in all, you should take this class. The professor and TA are great, and the material is exceedingly important, and it's not hard to do well. \n\nWorkload:\n1 midterm and 1 final\n4 PSETS\nRequired weekly recitation (1.25 hr)\nBasically required lecture attendance (or you'll fail)\n"
        }
    ]
}