{
    "prof_info": [
        {
            "prof_name": "Anene Ejikeme",
            "prof_id": 1149,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "History of West Africa",
            "review_date": "May 15, 2004",
            "review_content": "\nProfessor Ejikeme, though a pleasant woman and speaker teaches this class in vain, because speaking for myself, I did not learn much about West Africa except that Islam and slavery play a big role in its history (shocking, yes, I know). She is very disorganized and attempts to divide the history into concepts rather than chronologically, which at first sounds good to the student but in the end leaves you realizing that you don't know when ANYTHING happened with respect to other things in the world. The class focuses greatly on geography so if you can't memorize maps, stay away. The TA was helpful until the strike when things seemed to go farther downhill with confusion on quizes and things of the like. You are better off looking up books on West African history and reading them yourself than take this class.\nWorkload:\n2 papers of moderate length, 3 tests/quizzes, and a final\n"
        },
        {
            "course_name": "BC 3004 Intro to African Civilizations",
            "review_date": "December 15, 2003",
            "review_content": "\nProf. Ejikeme is so adorable and friendly and wants you to learn and cares about your success.  She has amazing enthusiasm and clearly is very knowledgeable and intelligent.  The reading was usually very interesting and pertinent (although the amount of reading was pretty heavy at times).  I definitely learned a lot in this course.  However, the lectures were somewhat disorganized and confusing.  She's a big fan of discussion and student's leading classes, which is great, but sometimes she didn't provide enough background info in order for there to BE a discussion.  She is accesible outside of class and will feed you pistacio nuts during her office hours.  She is open to new and individual interpretation of texts, as well, and loves questions and debate.  \nWorkload:\none take-home midterm, final exam (2 essay questions and map IDs).  a couple of fairly informal papers.  LOTS of reading.\n"
        },
        {
            "course_name": "Slavery in Comparative Perspective",
            "review_date": "May 30, 2002",
            "review_content": "\nThe class is bit ambitious, to say the least. The goal is to cover every form that has ever existed in the world. Ranging from ancient Rome, to women who are forced into prostitution in the Asian Pacific today. Nonetheless, the subject matter was of great interest (to me, anyway). The goal is to change your conception of what it is to be enslaved and what it is to be free. It would be a great course, if it wasn't for the complete and total disorganization. Instead of looking at slavery in a progression of beginning to present, or concentrating extensively on one region and then moving to another, we skip all over the globe and through time without any sort of order. Still, the class is interesting, especially if you keep up with the readings, and the workload is relatively light. The professor's enthusiasm for the subject also helps.\nWorkload:\nExtensive reading. 60 pages a night, and supplementary materials. 4 book/movie reviews, final exam.\n"
        }
    ]
}