{
    "prof_info": [
        {
            "prof_name": "Pierre Chiappori",
            "prof_id": 2562,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Economics of Uncertainty and Information",
            "review_date": "May 16, 2014",
            "review_content": "\nI have no idea how I feel about this class yet. I can't really say whether I'm glad I took it, but what I CAN say is that it was by FAR the hardest class I took this semester and honestly the hardest Econ elective I've ever taken. I've generally done really, really well in all of my Econ classes, including the Math sequences and what-not, but this class was by far the most difficult. I haven't gotten the grade back yet but I wouldn't be surprised if it were the lowest Econ grade I've ever had and maybe lowest grade in general.\nThe class relied WAY too much on Calculus (some of it stuff that Econ majors aren't really required to know, like Taylor expansions which are only taught in Calc II). You NEED to know how to do a Lagrangian and maximize it, and prof. Chiappori even brought in some Linear Algebra issues that are clearly not a requirement for the class or for the Econ major (he started talking about the rank of a matrix of financial assets, and how these assets should be linearly independent, which isn't too advanced linear algebra, but still too much considering that it's not a requirement). \nThe class would have really benefitted from a more guiding force that made things clearer. And this very much felt like a more advanced class, like something grad students would take in their first years of PhD or Master's studies. I don't think I ever knew what was going on 90% of the time.\nAt the end, once I took the final I realized I'd learned a LOT more than I thought I had. But this class requires you to work REALLY, REALLY hard and rely on the TA's a lot. This class would be IMPOSSIBLE without them. The problem sets (only two of them) were long and beyond difficult (we found out after handing the first one in that we were basically replicating this study that an economist had done on CARA utility functions), and so were the midterm and the final. The only redeeming quality (if you like this kind of stuff) is that a bunch of classes were cancelled because we did a simulation game that took like three hours on a Saturday.\nAll in all, I would recommend this class only to people interested in graduate work in Economics, or who don't mind working really, really hard to hopefully try to do well, and who don't mind feeling incredibly inadequate and lost. This is not for the faint of heart.\nWorkload:\nTwo problem sets (don't let this fool you, they each take like three or four weeks to do, and are really difficult and impossible to do without going to multiple TA office hours). The average for both of these were around 60/100 or so.\nOne midterm (difficult, average was 59).\nOne final (no idea how people did, but it was definitely at least as hard as the midterm if not harder).\n\n"
        },
        {
            "course_name": "Economics of Uncertainty and Information",
            "review_date": "April 20, 2014",
            "review_content": "\nThis is a pretty tough class, it mostly incorporates Micro. The material is interesting, it's all insurance. I'm currently taking the class right now so I haven't finished it (just a few more classes left), but you'll probably never use the learned material in your life. The professor is nice as are the TA's, but the lectures seem never ending (even more so than usual). I'm personally not bad at math, A+'s in the Calc sequence and did alright in stats, but this course is the 2nd toughest class I've taken at Columbia after Econometrics.\nI wouldn't suggest this class to anyone because of the stress of the ridiculous (graded) problem sets. There are many \"ungraded problem sets\" that you will certainly want to look at when studying for the exams. Speaking of which, he releases old exams and solutions that all have the same format. So he's consistent, no surprises as to what the test will be like. Even so, its a challenging class (midterm average was a 59, I'm assuming the median was below that).\nWorkload:\n2 problem sets, 10% each\n1 midterm, 30%\n1 final, 50% (80% if you perform better than your midterm)\n"
        },
        {
            "course_name": "Economics of Uncertainty and Information",
            "review_date": "July 11, 2006",
            "review_content": "\nI liked Prof. Chiappori.  His lectures are ver clear, and slightly funny at times, and the french accent is not at all difficult to understand.  There is a book for the class, but he doesn't use it at all, everything comes from his head.  Furthermore, the problem sets do not follow the book, and lagged about a month behind the lectures (more at the end) so we were still doing first semester problem sets towards the end of the year. This makes them very difficult, as they are very challenging to begin with, and then the material isn't fresh.  The exams are quite simple, however, compared to the problem sets, as they are half true or false, with only one numerical problem.\nThe class is pretty calc basd, and there is a lot of lagrange, so it should be avoided unless you are comfortable with calculus.  Finally, don't expect person attention from Chiappori.  He bolts the class at the end faster than any other professor I've seen.  You put your notebook in your bag, look up and he's already long gone.\nWorkload:\n7 or 8 problem sets.  1 midterm (very easy) 1 final (also easy)\n"
        },
        {
            "course_name": "Economics of Uncertainty and Information",
            "review_date": "May 26, 2005",
            "review_content": "\nYeah, so, from day 1 i knew this would be my hardest course. I thought uncertainty and information would have to do with decision making, not risk sharing and a WHOLE LOT of finance. but it did. i think ultimately P-A knows his stuff, but he just came from graduate students at Chicago, and i think he expected WAY too much from us in class/on problem sets, then the exams rolled around and they were like cakewalks. After he used tons of complicated and sophisticated math all through the class, the tests were math free, ultimately, if you like insurance/finance and are looking for a challenge, it'll be ok, but not totally worth some of the worries\nWorkload:\nweekly problem set (HARD), and two extremely easy exams (true false and 1 problem with NO MATH)\n"
        }
    ]
}