{
    "prof_info": [
        {
            "prof_name": "Allison Franzese",
            "prof_id": 12099,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "September 03, 2012",
            "review_content": "\nFrontiers with Dr. Franzese is pretty straightforward and businesslike. She sets out her expectations early and clearly, and from there your grade is pretty much entirely up to you. It's quite easy to pick up points: raise your hand and say something the requisite number of times per class, go to the mandatory museum trip, go to the extra credit lectures/opportunities she tells you about, and take advantage of her feedback on the term paper, which she will read and review for you as many times as you write it before the final deadline. There's a quiz every three weeks which you will do well on if you have done the WIAs, read the slides, and/or gone to section.\nShe's a little awkward with students and runs things quite impersonally. This is not one of those classes where you bond with your instructor and classmates and have cuddly 'Columbia moment' feelings about it evermore. This is all perfectly fine, because it's not as though anyone goes to Frontiers hoping for anything more than watered-down, required drudgery anyway. Dr. Franzese is good at explaining unfamiliar material, is eminently fair about course requirements, and genuinely wants to impart an appreciation of science, and that's all you really need.\n/grumpy humanities student\nWorkload:\nPretty standard for Frontiers: weekly homework assignments, unit quizzes, participation, two exams, and a term paper that is so formulaic and straightforward that you have no excuse not to do well on it. Plenty of extra credit opportunities as well.\nDo not bother going to the lecture. The entire thing gets recorded and is put on CourseWorks along with the slides the same night. It's certainly helpful, so listen to it in your own time if you can, but there is literally no reason that you should get up and go in person on a Monday morning. The readings (for section? for lecture? I don't even know what they were for) are similarly pointless.\n"
        }
    ]
}