{
    "prof_info": [
        {
            "prof_name": "Stacey Brydges",
            "prof_id": 2305,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry I",
            "review_date": "April 15, 2008",
            "review_content": "\nStacy is one of the nicest and easily approachable professor on campus.  The material that is covered first semester begins to get confusing after the first midterm and going to Stacy's lectures doesn't really help much. Stacy is not the best lecturer, but she's great  one-on-one. On the plus side she has really good slides and you can just learn everything from the slides.\nWorkload:\noptional homework, the homework is somewhat related to her exams. the best way to study for her exams is by going over slides and taking the practice exams. \n\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "April 09, 2008",
            "review_content": "\nStacey is very nice and her lectures are great but be prepared to study for about 20-30 hours a week in this class for her exams. Her exams are very time consuming and challenging compared to all the practice problems. Even though 30% of class was in C range and 17% in the D range, she still didn't curve the test grades. Be prepared for lots of work.\nWorkload:\n3 exams, 1 final, 20 hours of studying a week (practice exams, txtbk problems, chapter problems)\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "April 13, 2006",
            "review_content": "\nStacey is a very nice person with her helpful nature and encouraging words. But you will definitely need them for her class. I read a previous review that stated, \"Brydges doesn't assume that you are a chemistry major,\" but from my experience with the course, she does. She told the class that she expects us to do about 10 hours of studying per week; however, I found myself spending over 20 hours a week on her challenging weekly assignments, reading the chapters, and doing the homework questions that she assigned. Moreover, her exams were VERY challenging!! Do yourself a favor, DO NOT think that you skip class and pass her exams because the tests are more challenging than ANY problem and concept in the textbook. So if you do wanna hang out with Brydges be prepared to put in ALOT of time studying and reviewing EVERYTHING that she offers (ie her old exams, chapter exams, her pp class notes, chapters, chapter assignments and her weekly assignments).\nWorkload:\nCRAZY!!! Her weekly assignments took me about a WEEK to do them!! In addition to those, you will have 3 exams and a final that is LONG AS HELL!! (pace yourself for the marathon!!)\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "April 13, 2006",
            "review_content": "\nStacey is a very nice person with her helpful nature and encouraging words. But you will definitely need them for her class. I read a previous review that stated, \"Brydges doesn't assume that you are a chemistry major,\" but from my experience with the course, she does. She told the class that she expects us to do about 10 hours of studying per week; however, I found myself spending over 20 hours a week on her challenging weekly assignments, reading the chapters, and doing the homework questions that she assigned. Moreover, her exams were VERY challenging!! Do yourself a favor, DO NOT think that you skip class and pass her exams because the tests are more challenging than ANY problem and concept in the textbook. So if you do wanna hang out with Brydges be prepared to put in ALOT of time studying and reviewing EVERYTHING that she offers (ie her old exams, chapter exams, her pp class notes, chapters, chapter assignments and her weekly assignments).\nWorkload:\nCRAZY!!! Her weekly assignments took me about a WEEK to do them!! In addition to those, you will have 3 exams and a final that is LONG AS HELL!! (pace yourself for the marathon!!)\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 03, 2006",
            "review_content": "\nEven as I write this, I'm not quite sure how to describe Stacey's class- but I will try.\nAll in all, Stacey Brydges isn't a very good lecturer.  Sometimes I found myself wondering if she even knew what she was talking about.  It was hard to tell because she basically read her lecture slides word for word.  Don't get me wrong, she would pause every so often to provide some nugget of information, but overall the class was being read to.  \nThe ONLY times Stacey would stray from powerpoint were during her review sessions (and there were plenty of them).  During these reviews, Stacey would break out the chalk and teach beautifully.  I wish she would have taught the whole semester with chalk in hand- I learned more from her during her reviews than during actual class time.\nA word about her exams... Extremely Difficult!   No exaggeration.  Be prepared to study for hours and hours and hours.  Take a break and then study some more because her exams (especially the multiple choice) tested every little bit of information about the subjects she taught.  After many an exam I felt as though I had been mentally raped.  Needless to say the mean on the first exam was in the low 40s.. the second in the 50s and the third exam in the low 60s.  \nStacey tried to keep the mood upbeat by asking us to resubmit our exams with corrections for extra credit.. write a \"mock exam question\" for extra credit...with all this extra credit I would have thought the whole class would have gotten an A.  But you know what?  The extra credit really didn't help your grade much, if at all.  I think it was just Dr. Brydges' way of getting us to learn the material.  \nSo, would I take the class again?  As I sit here writing this review I can honestly say that I really don't know if I would.  Part of me says yes and part of me says no way. My advice is to sit in on her lecture the first day or two and see if you like what you see.  Who knows, maybe she'll be teaching with chalk, dazzling her students, instead of reciting lecture notes.\nWorkload:\n5 quizes... 3 assignments... (lowest 3 quizes/assignment grades dropped)... 3 exams and a final... an \"extra credit\" assignment thrown in for good measure... optional homework problems (trust me- do them)...  the lowest 100 out of 600 total points were dropped... oh and 10 possible bonus points...\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "September 01, 2005",
            "review_content": "\nstacey was ok. it was her first semester teaching, and she had some grant business to take care of spring semester, so she often seemed tired, uneven, and unprepared. she would also get all flustered when something went wrong, which was painful to watch. \nshe never posted stuff on time in the spring, although she was a lot better in the fall, so i attribute that to the grant nonsense. but still that's no excuse.\ngenerally, though, i agree more with the 4 positive reviews submitted so far than the negative one. i sat in on a few leonard fine classes, and though he was (expectedly) much more confident, i can't say i would have left that class with a stronger grasp of gen chem... half extremely complex, half totally watered down, it's a hard subject to teach.\nalso stacey really seemed to care how everyone did. to an extent that was kind of weird, actually. all these extra credit opportunities and stuff. \nher tests were very hard. they really forced you to study carefully--they werent about regurgitation. i got the idea that a lot of people came in expecting plug n' chug tests, and werent prepared to have to think under pressure. \nin sum, her lectures definitely needed work: on their own they were nearly useless. but the few times i read ahead, as i guess you are supposed to do, they actually weren't that bad, especially for a \"rookie\" prof. \nWorkload:\npretty light, actually, as long as you are prepared to bust your ass a day or two before exams. about 10 fairly hard problem sets, but a bunch could be dropped. text book chapters must be read a few times, and lecture notes reviewed before exams. be familiar with the end-of chapter problems. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "August 21, 2005",
            "review_content": "\nFor the past 2 semesters plus now I've been completely mystified by what alternate universe these other reviewers are occupying.   Let me just say, I got a really good grade in this class.  It almost worked.  She almost had me.  But you know what, the truth must be known.  This class  sucked.  It sucked BIG TIME.  Prof. Brydges was at best well intentioned, but frankly sometimes it seemed like she was on the verge of some kind of nervous breakdown.  She alternated frantic cutsy-ness with snarling defensiveness which made her, frankly, creepy. \nHere are a few specifics about the class:\n- She could never post any lecture notes, practice exams, sample solutions on time in any kind of timely fashion. \n- Her lectures were horrible.  HORRIBLE.  She insisted on reinventing the wheel by making all of her own slides.  It was like riding a dumptruck cross country.  She scooted through her typo ridden powerpoint presentations and all I really remember is that little red laser pointer dot darting round and round on the screen, afraid to land on any littl bit of content.  \n- Her typical response to a student question:  \"let's throw that back out there...\"  She would never say when something was outside the scope of what we needed to know.  Instead she would get lost on long stammering tangents that ended with something along the lines of 'go home and look it up'.  \nWorkload:\nThat's not even the point.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 18, 2005",
            "review_content": "\nProfessor Brydges is certainly an enthusiastic chemistry professor.  She is very good at breaking hard concepts down into bite-sized, comprehendible pieces.  She promotes working with your fellow classmates on in-class problems and homework assignments, which is very effective.  She also encourages her students to form study groups, which is also helpful, especially if you cannot afford a tutor.  She administers weekly homework assignments in lieu of recitation quizzes.  This is can either help you or harm you.  If you rely on your study group or your tutor to do the homework problems for you, you will be at a serious disadvantage because her exams reflect the difficulty and style of her homework questions.  The up-side is you have a chance to really score great on the homework, which will help your average in the long run.  The down-side is you may not be completely proficient come exam time.  You know your study style.  If you want an easy A, choose someone else.  If you really want to understand the concepts and formulas behind those concepts, take Professor Brydges.\nWorkload:\nWeekly homework assignments, two (or three? cant remember) lowest are dropped, three \"mid-term\" exams the lowest of which is dropped, and one final that counts for two mid-term exams.\n"
        },
        {
            "course_name": "General Chemistry I and II",
            "review_date": "April 17, 2005",
            "review_content": "\nProfessor Brydges is a wonderful professor.  Her heart is definitely in the right place.  She's very enthusiastic about chemistry and passes that enthusiasm onto her students.  Furthermore, she genuinely wants all of her students to do well.  This attitude is reflected by the fact that her door is pretty much open to her students.  She has absolutely no problem answering students' questions.  The downsides to the class is the fact that it's in the evening (that might be good for non-morning people).  Also, Professor Brydges was a bit busy during the second semester with grant writing, and unfortunately she wasn't able to dedicate as much time as she usually does to her class.  It's because of this that most students bombed the second test, the mean was in the 40's, maybe 50's.  The grant writing also prevented her from posting her lecture notes and assignments in a timely fashion.  \nWorkload:\nweekly assignments instead of weekly quizzes in recitation (this allowed for students to put alot of thought into their work and get good grades).  The downside is that the assignments take a good chunk of your time and interfere with reading the textbook and doing the odd problems in the back of the chapter.  The plus side to the assignments is the fact that they point you to the more important concepts of the chapter.  3 midterms, you can drop the lowest grade.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 26, 2004",
            "review_content": "\nStacy is nice. Stacy is from Canada.  Stacy also gives the longest exams in the entire university.  The final took most people the full 3 hours and then some. But Stacy is your friend and she genuinely wants you to do well and for that I truly love her.\nStacy's lectures are a rehashing and elucidation of the textbook and are not the tangential rantings of some professors in this department.  Going to lecture is definitely helpful, though as the prior reviewer said the evening class time makes it a drowsy affair.  Stacy comes off like an elementary school teacher, but for an intro level course that many of us are taking because it's required for our majors, that's not so bad.  She doesn't assume that you want to be a chem major, and she definitely teaches you what you need to know.  Also the TA, Robert, is quite brilliant.\nThe downside of Stacy's class is that you really are better off attending.  She covers stuff in lecture that is not in the book, or that is explained poorly in the book; so if you want a class in which you can do everything on your own and just show up for tests itÂ’s probably best to look elsewhere.\nStacy did opt for weekly problem sets rather than quizzes, which I for one was not happy about.  The quizzes (we had two before she switched) were really easy and the problem sets were pretty hard and took a lot more time.  But they did force you to learn the material, and only the best 5 out of 9 counted toward the grade, so in the end theyÂ’re like medicineÂ—taste bad but good for ya.\nItÂ’s not exactly that intense Ivy League experience, but I really didn't want to take chem to begin with so I've got no complaints.\n\nWorkload:\n3 midterms, cumulative final, weekly quizzes\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 23, 2004",
            "review_content": "\nA pretty straightforward professor. Her lectures were helpful, sometimes even better than the textbook for learning the content. Instead of weekly quizzes, she assigns weekly problem sets, which may or may not be a good thing depending on how you work (I hate memorizing/studying for quizzes, so I prefer the p sets). The exams tested what was in her lectures. Also, she was often available for help and encouraged emails/phone calls. The only downside to her class was the time (610-725), which often put me to sleep. \nWorkload:\nWeekly problem sets (somewhat challenging)3 Exams (easier than the problem sets)Final \n"
        }
    ]
}