{
    "prof_info": [
        {
            "prof_name": "Patricia Lindemann",
            "prof_id": 458,
            "total_reviews": 55
        }
    ],
    "reviews": [
        {
            "course_name": "Science of Psychology",
            "review_date": "January 17, 2017",
            "review_content": "\nTook Science of Psych in  Fall 2016; As a non-science major who has absolutely zero interest in the sciences, this class wasn't that bad. \nProfessor Lindemann is a good professor, is really nice, and knows the material well. If you pay attention, do the extra credit, and actually study, it would be easy to get good grades (I P/D/F'ed the course b/c I didn't do any of the three). Its important to pay attention to the lectures because the open-end questions on the tests are mostly related to the material that she lectures on, while the multiple choice is related to the textbook. \nMy main complaint for this course is the grading of the essays. Most of the TA's are undergraduate students, who are like yourself, mostly either juniors or sophomores. The grading for the essays can be REALLY harsh, but the criteria of grading is very vague. They check off a rubric, so, for example, if they \"think\" you didn't connect the concepts between an article and concept right, they will dock points. And when you go to them asking why they docked off points, they give vague/unclear explanations and they themselves don't know why. You can never know what the hell standards they base it off of. I compared my essay with a friend's who had gotten a much better score, but we both agreed that both papers were similar in quality. One TA told me that they were told that if they \"think the paper generally seemed like a B paper\" to adjust the scores accordingly. Really? Then why the fuck do we have a rubric in the first place? For example, I got points docked off for weird wording, but as a humanities major and having read the essay over 10 times, I'm pretty sure that there was nothing off about the grammar/syntax/wording of the essay. \nAfter meeting with TA's for my first two essays, I immediately P/D/F'ed the course, because the grading is really subjective and I knew my final grade would take a toll. BASICALLY, while the TA's may know concepts and can grade tests objectively, they don't know how the hell to grade papers. That being said, I didn't particularly dislike the TA's (they were really helpful in several aspects), but that I don't trust their expertise or experience in grading papers with an objective eye. \nWorkload:\n3 tests (including final). 3 papers. Iclicker participation. Extra Creds (this can be a major help for grades later on). Experiment Participation. Not that heavy a workload. \nPersonal opinion of this class: study hard for the tests, pay attention during class, do the extra credits, and be wary of essays. Then you'll be fine. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "August 14, 2016",
            "review_content": "\nThis was an awesome class, and I would highly recommend it to anyone. Professor Lindemann is quirky and likable, and the videos and lectures were on point. The lessons are very memorable and enjoyable. Definitely go for it.\nWorkload:\n3 essays plus 2 exams and lots of opportunity for extra credit. The grading on the essays was surprisingly harsh and the exams were more difficult than you might expect. Extra credit works wonders though. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 18, 2015",
            "review_content": "\nThis is a fair class.\nReasonable weekly readings. Helpful lecture notes posted on courseworks. Knowledgeable TAs. Exposure to practical applications of\nCourse material. Fair grading scheme. Extra credit available.\nThe only problem is that lindemann doesn't know how to dress for the weather and also that she only knows things relevant to intro to psych. If its out of the range of the course scope she has no idea how to answer.\nWorkload:\nThree 2 page papers\n2 midterm\n1 final\nIn class clicker q's\nExperiment participation\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 23, 2015",
            "review_content": "\nLindemann was a fantastic, funny teacher and an exceptionally fair grader.  This is definitely a great course to take for credit towards the science requirement if (like me) you're a humanities major.   \nAttend class, because she takes attendance with iClickers, but also because I found that the way she presents the material helped me to recall it for the exams.  The exams themselves are challenging but not impossible.  She tells you exactly how to study for it: read the textbook, know all the vocabulary terms she gives you, but really only focus on the details of what is talked about in class.  Personally, I tried to spend about 2-4 hours reading and taking notes on each chapter, but I also often just took notes on the vocabulary when I was pressed for time, and I didn't get below an A on any exam.  The papers were more harshly graded (by the TAs) but they also count for much, much less than the exams do (I got a 17/20 on two and still ended up with an A in the class).  Lindemann also gives you extra credit opportunities each week.  Not a \"never go to class and still get an A\" course, but totally manageable, and Lindemann is a great professor. \n\nWorkload:\n3 Papers\n3 Tests (none cumulative)\nOn both papers and exams, the best 2 scores count for more than your worst score:\n40% best exam/paper\n40% middle exam/paper\n20% worst exam/paper\n\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 30, 2014",
            "review_content": "\nI enjoyed my time in class this semester.\nProfessor Lindemann is great, and her TA's were at least moderately helpful (although, there is no forced interaction with any of them because there are no required discussion sections).  I found the content of the course itself very interesting, and Professor Lindemann lead very engaging lectures that incorporated videos, poll questions, etc.  I felt like she made what could have been something very boring into something pretty fun.\nAttendance was mandatory, we iClicked into the class. Up to 3 free absences.  Showing up only ended up counting for 4% of the final grade, though.  I thought this was a bit low.\n3 mandatory essays that cannot exceed 2 pages are graded by the TAs.  Grading difficulty DEFINITELY differed TA-to-TA (avoid James).\nParticipation in psychology department experiments was a requirement (6 credits, 3 hours worth).  One of the 3 essays had to be on an experiment in which we participated.\n3 non cumulative exams.  Loved this.  Many test questions (mix of multiple choice and long answer) involved detailed information from the textbook that was not covered in class.  This made reading the textbook carefully absolutely mandatory.\nOverall, my grade did not turn out how I was expecting or hoped (75% of the final grade was the exams, scores weren't high enough).  I felt like that cheapened the rest of the hard work I did in the class.  I would however, definitely recommend the class, and I thought that Prof Lindemann was fantastic.\nWorkload:\nattendance, 3 essays, experiment participation, 3 non-cumulative exams (75%) (lowest score counts least)\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 19, 2013",
            "review_content": "\nDon't believe the haters, Lindemann is an awesome professor. Not only will you learn the science of psychology in this class, you will also learn how to apply it to improve your everyday life. For instance, Lindemann will teach you how to wear red to make yourself more attractive, and to take your girlfriend to a scary movie on date night so that she will confuse her fear arousal reaction with love and like you more. Taking this class has totally given me the confidence to successfully hit on women, so it is obviously the best class I've ever taken. Lindemann also really knows her stuff and incorporates a lot of interesting analogies/examples into her lectures to make the material come to life.\nAll the whining about the difficulty of the exams/papers is completely unwarranted. Only one perfect score every few years? Please, what a load of crap. Out of the three papers I wrote, two got a 10/10. I never got a 100 on an exam, but I did get a 99 (someone in the class did score a 100 though, that douchebag). Not that you need such scores to do well, the final grade is curved so that 35% of the class gets As, so your raw score doesn't even matter.\nThe TAs as a whole were also not a bad bunch. Due to the size of the class, Lindemann has six TAs, and even though you get assigned one, you can drop in to see any of them. No doubt due to Columbia's emphasis on diversity, there was a very diverse mix of smart/nice/hot TAs, so you can definitely find one that matches whatever you're looking for.\nWorkload:\nModerate. Readings + lectures + three 2-page papers + three hours of experiment participation + three exams.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "April 11, 2013",
            "review_content": "\nThis is honestly not a bad class. All the previous reviewers who complain about the workload must be confused about how to skim a textbook. If there were no iClickers, I wouldn't have gone to class, but since you have to...just go and sit there and do other work or sleep twice a week, it's really not that hard. The tests and \"papers\" are ridiculously easy - although graded a bit harshly by the fanatical TAs, they are literally curved so much that a B minus may become an A, so don't worry too much. This class is an easy A, but if you're not taking it for the psych major or to get into higher-level psych classes, you might want a more stimulating way to fulfill the science requirement. However, Professor Lindemann is genuinely one of the most enthusiastic (and possibly crazy) people I have ever met, which keeps the class semi-interesting.\nWorkload:\n3 midterms (final is \"cumulative,\" but not really) and 3 2-page papers that take about 2 hours to write. Also participation and optional extra credit assignments.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 12, 2012",
            "review_content": "\nShould you take this course?\nNo. \nAnd here's why:\nProf. Lindemann is actually a very nice, intelligent women who works very hard to make this somewhat unchallenging course, interesting. I don't understand why people seem to have an issue with her. The course was structured quite well and the lectures were good. Sure she is weird, she's a psych professor, what did you expect? \nThe problems with the course are:\nThe tests will make you want to die. Prof. Lindemann makes it very clear that you will be tested on the lectures AND the textbook. This is all find and dandy but the tests are written poorly, with questions that are ambiguous beyond belief and often refer to things mentioned only briefly lectures that don't appear on the textbook at all.\nThe essays will make you want to shoot the TA first and then turn the gun on yourself. They are graded out of 10 and as she mentioned in class \"a 10 essay is very rare, only once in a few years.\" What this basically means is that your score starts from 9, and a score like 8.5 was the highest in the class (mine btw, how sad).\nWhich leads me to the other problem in the course, the TAs.  Prof. Lindemann makes a good use out of them, they of course grade everything, run the review sessions, and sometimes give lectures on their topic of research. The problem is that some of them ARE THE MOST PRETENTIOUS, ARROGANT, WISE ASS, USELESS, TAs ON A POWER TRIP you have ever met at Columbia. \n(Especially Greg, if you have him as your TA, drop the class, because he really does represents everything that is wrong about the universe today.) \nI was lucky to have Daniel, he is awesome.\nTo sum it up - Intro Psych can be sometimes interesting but at most stupid and obvious (did you know you have to be objective when you perform a study?? I know! It's amazing!!!!).\nIf you take it to fullfil a core, consider taking Taylor or Barnard courses instead cause according to many, they are easier than Lindemann's\nWorkload:\nQuite a lot. \nReading a chapter for every lecture (30+ pages). If you'll only open the book before the tests you won't do well.\n3 papers, only 2 pages but graded harshly \n3 exams, not that much to study actually, but the questions are annoying and tricky.\nExtra credit - optional, like 3 stupid little questions that you can do while you are eating. If you do 6 out of the 9 that are given, you can get bumped from a b+ to a- (do them, they're super easy)\nParticipating in idiotic studies of grad students.\nParticipating in class via the little monsters known as iClickers\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 14, 2012",
            "review_content": "\nProfessor Lindemann is a pretty good teacher. I'm going to be honest -- Science of Psychology is a pretty straightforward, unchallenging class. As long as you do the reading and/or show up to lectures, you will be completely fine. However, I would recommend Lindemann to anyone who's taking the class to fulfill a major requirement or the science requirement. She's funny, nice, and engaging. Lots of interesting psych videos, which is always a plus. Also, she uses iClickers, which I really like because I'm pretty consistent about showing up to lectures and like to be rewarded, but if that's not your game then keep that in mind.\nWorkload:\n3 exams, 3 papers, iClicker (participation), Experiment Participation, and 1 final -- but really, all very easy.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "April 10, 2012",
            "review_content": "\nThe worst class I have taken at Columbia besides the dreaded University Writing section. Attendance is mandatory (and enforced via use of the iClicker), powerpoints presented at break-neck speed (though they are posted on courseworks after each class along with an MP3 of the lecture, for whatever good it will do you) and the usual collection of smug T.A.s on power trips. \nThe good: \n-Grading is curved. 35% of the class will get grades in the A-/A/A+ range. \n-The powerpoints, though generally uninformative, are entertaining. PAY attention, as she has mini-quizzes that you must participate in to get participation/attendance credit.\n-Extra credit is available: you must do 6 out of 9 possible E.C. assignments to get a point boost that MAY--or may not--increase your final overall grade by half a grade point, e.g. your B+ might become an A- if you do the EC. According to Lindemann, this will affect roughly 25% of the class.\n-She and her cadre of T.A.s do hold frequent office hours. \nThe bad:\n-Much of what is covered on the exams will NEVER be covered in class. SHE SIMPLY DOES NOT COVER ALL OF THE MATERIAL. You MUST, therefore, read the textbook and TEACH YOURSELF. The textbook is dense, poorly written, and generally a mess. If you DO NOT crack open this green monster, you will probably NOT do well on the exams. Many of the questions come directly from the study guide. In all of her years of teaching at Columbia, Lindemann claims to have given a perfect grade--a 100%--exactly ONCE. The median grade tends to fall around 80 or so. \n-The mini papers (2 pages) are graded HARSHLY by the Tyrannical Asses. You have to write three of them, each worth 5% of your grade, one of which must be on one of the mandatory experiments.\n-You do have to participate in 6 points worth of experiments. DO THIS EARLY. It's worth 5% of your grade.\n-Three goddamn exams, each worth 25% of your grade.\n-This class ALWAYS fills up. If it's in 501 Scherm, that means you'll be packed in. I think it's capped at around 195 or something insane. \n-Attendance, as I mentioned, is mandatory.\nIf you're a psych major, this could turn you off to the department. I took Karatsoreos' \"Mind, Brain, and Behavior,\" which is a much more technical/scientific class before I took this and I LOVED it. This class makes me never want to take psych again.\nThe majority of people will get As and Bs, but everyone knows a \"B\" at Columbia means \"Bullshit.\" If you're satisfied with mediocrity in grades and instruction, by all means, take this. If not, go elsewhere. \nWorkload:\nThree 2-page papers, worth 15% of total grade. Attendance/participation via iClicker: 5% of grade. Experiments (on your own time): 5% of grade. Three exams: 75% of grade. Manageable, but you MUST do the reading. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 25, 2010",
            "review_content": "\nI have to disagree with many of the reviewers for Lindemann's Sci of Psy class. I really enjoyed this class, and I am now considering a major in Psych or Neuroscience because of it. \nFirst of all, Lindemann herself is rather goofy. She has an extraordinarily odd sense of humor and an overall strange wardrobe and appearance, but this does not detract from her ability as an instructor. I always thought she got the concepts across well, elaborating on the powerpoints with cogent examples instead of just reading them. I never tried to email her or go to office hours so I can't speak to that. \nI thought the material covered was fascinating, and Lindemann would often show us wonderful video clips in class which got the concepts across really effectively. The textbook was also really good in my opinion. It is verbose to be sure, but I never felt lost or unsure about any concepts it covered. Even though the sheer number of pages is a slog, I found myself wanting to do the readings. iClickers are employed. They are sort of a cheap way to take attendance, but I think they add to the class (allow for informal polling, little comprehension questions, etc.)\nYou have to participate in experiments. This is annoying. I didn't do any really cool experiments but your experience might be different.\nDespite the class's large size, it is not difficult to do well. Simply read the chapters and review the powerpoints before exams. If you want to boost your score up a few more points, do the online quizzes that go along with the textbooks and make vocab flashcards on the notes. Using this method, I got A's on all the midterms (and I suspect on the final). Compared to other science classes, it is an absolute joke. I've taken several pre-med type science courses and this one was much, much easier. That being said, there may be easier classes for your science requirement (Beyond the Solar System comes to mind). It just depends on your personal style.\nIf you're good at memorizing, interested in Psych, want to fulfill the science requirement or a combination of the 3, I would highly recommend this class. It's very interesting, and you will start to notice things which pertain to topics covered in class everywhere.\nWorkload:\nNot so bad compared to most other science classes. Tests make up 75% of grade, I believe.\nA lot of textbook reading. DO NOT LEAVE FOR RIGHT BEFORE THE EXAM.\n2 Midterms with ~30 MC questions (some are hard, but most are possible if you study) and a fill in the blank/short answer section (some questions are ambiguous but most are clear and getable) \n1 Final (a midterm with longer fill in blank/short answer. Heavily focused on final portion of class.)\nExperiment Participation (3 hrs of doing dumb stuff for grad students)\n3 Essays (2 on articles, 1 on experiment participation, they are really stupid and add nothing to the class but they are only 2 pages double-spaced so suck it up. Also, not much of your grade.)\nAttendance (You get to miss 3 classes, then it starts to count against you. If you have to miss more, have someone else take your clicker to class. It's not hard folks.)\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 15, 2010",
            "review_content": "\nProf. Lindenmann is goofy to the point that impedes her teaching. She often couldn't get through the slides because of her tangents (which some found entertaining, I found them to be like a comic on stage who isn't quite garnering any laughs - though he thinks he is).\nIt's an intro-psych class. The topics covered in class are intuitive, if you haven't learned them already. Kind of easy - more a fight against the curve. The topics covered in class got better throughout the semester - though as a friend put it - \"You are more advanced then this. And didn't you already take Mind, Brain and Behavior?\"\nWorkload:\n(Readings from text. They take the multiple choice questions for a database from the textbook publisher.) Two midterms (multiple choice and short answer) and a final. Three two page response papers and 6 hours of experiment participation.\nThe three \"papers\" were dumb. Two are reading responses and the third an experiment evaluation. Each is supposed to apply concepts of the course to the topic at hand - in two pages. This means \"depth but not breadth\" - but not quite. I never quite understood how much they wanted in a two page double spaced response. \n In the first paper I got more points off for covering too much information, than the content of my paper. The second I got 1 point out of ten for being a day late and another for some ridiculous reason. The experiment paper was annoying. Not in any way beneficial to the class.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 15, 2010",
            "review_content": "\nSo if you're taking this for a science requirement, and only that, run. You won't care enough to do everything this class requires. Honestly, I just wanted to pass. Literally. If you're busy outside of class beware because the reading take forever-and-a-half, the experiment participation is annoying (you need to have 6 credits which is around 3-5 hours depending on which ones you choose), and a lot of money is spent on this class. A lot of people disagree because they're either infatuated with Lindemann's really cool personality or they \"0mgg l0v3\" psychology. People ask a lot of stupid shit in this class, too. And the TAs are really annoying--they fill up my e-mail inbox with stupid crap that only three people (from what I can tell by the TAs' constant badgering) respond to. In all, it's a great class if you actually like psych, are good at science, or wanted to try something new. But, as a Poly Sci major who doesn't enjoy science, I despised this class. Not the professor, just the class in general.\nWorkload:\n3 Exams--do the reading way beforehand because you will be enjoying a three-day addy trip if you decide to read right before the exam. Some of the multiple choice is just impossible.\n3 papers--stupid. They're like 2 pages long about the reading you once thought was \"optional\"\n6 credits experiment participation\n2-4 chapters of reading a week--beware, the textbook would rather talk about Amy Winehouse in rehab than explain whatever wasn't covered in class because according to Lindemann, \"anything not covered in class is considered fair game\"\nAttendance--yes, this class rolls like 220 deep and roll is still taken by means of the hand dandy iClicker (another waste of money because I'll never use this shit again and I had to wait like three weeks to actually get one)\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 11, 2010",
            "review_content": "\nProfessor Lindemann is certainly very energetic and hilarious. At times her funny anecdotes seem off topic or irrelevant but in general they are related to the course material. Her lectures are pretty good. They often incorporate super interesting video clips. \nUnlike the person below me, I found the book for this class to be poorly written (and the chapters are long + take forever to read). The authors spend too much time trying to relate psychology to the real-world and not enough time actually explaining what the psychological terms are. They also clearly do not understand what a thesaurus is.\nIn general, I think Professor Lindemann is a good teacher. I took AP Psych prior to this class (and received a 5...not to brag but to give you the idea that I knew a lot of psychology before coming into this class) and I found that sometimes she confused me on things I already knew well. So in that regard, she doesn't explain everything super clearly. But, read the book and you should be good to go.\nIclickers are used in class and thus you can't miss more than 2 classes. OR you could just have your friend bring your Iclicker to class for you, and then you don't have to go.\nBut as mentioned below, tests are partly based on lecture discussion so its beneficial to go.\nIf you take this class, try to stay on top of the reading. SERIOUSLY. It is death if you don't. Reading 6 chapters the weekend before the test is nearly impossible.\nWorkload:\nThe workload is certainly manageable. \n3 Tests that are half based on class lectures and half based on the readings\n3 short papers (which are certainly manageable and not at ALL bad)\nExtra Credit - if you complete 6 out of the 8 assignments, your grade is raised from a B+ to an A- or a B to a B+ (etc. etc.). A lot of them are actually just fun! :)\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 10, 2010",
            "review_content": "\nI could not disagree more with the post below, which harshly critiqued the course. I truly enjoyed this course and thought the professor was absolutely fantastic.\nFrom day one, Lindemann was cheerful, energetic, and approachable. She has a very friendly and down-to-earth approach to teaching, which suits an introductory course like this one perfectly. When she teaches, you can tell that she actually enjoys her job and wants to be in the classroom. This sort of attitude is usually pretty infectious! Basically, she is simply an incredibly likable person, not to mention a very knowledgeable professor.\nI'd like to take some time to acknowledge the comment below that said that this course was poorly organized. Again, I could not disagree more. I thought that the class structure worked very well for the sort of class it was - an introductory course with over 100 students. Each class, Lindemann would lecture us based off a powerpoint slide. However, she did not solely read off the slides; she would always elaborate more than the slides or insert a silly joke every now and then. This works really well because if you missed a class, it really wasn't a big deal because you could collect the info from the slides, but going to class was far from a painful experience. In fact, I often found myself very entertained in class, especially since almost every lecture contained one or more rather interesting videos (not to mention, towards the latter part of the semester we watched a lot of videos featuring cute babies and monkeys). To sum up, the class was structured to be very relaxed yet engaging.\nI highly, highly recommend this class! The vast majority of the lectures/subject material is really interesting and easy to understand (intro psych is for the most part very intuitive). Also, for those of you out there who just want to get out of a science requirement, this course is not very science-heavy except for the one neuroscience unit. Plus, the teacher is great!\nWorkload:\nLight compared to other lectures! No weekly homework sets or anything. You just are supposed to read the textbook before class, but if you don't it's not the end of the world. You will have to read it eventually, though. Good news is that the textbook is pretty interesting, although very long. You have to write a total of 3 short reading analyses, and there are 3 exams, including the final which is NOT cumulative. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 19, 2010",
            "review_content": "\nDefinitely my least favorite class ever.  Although Lindemann is a lovely person, she simply recites a power point lecture, which does not engage the class.  However, it is the exams which need to be examined.  Like a previous commentator wrote, they are complex and difficult.  Most of the class did not even complete the first test, and the average grade was a 70.  The text book is very dense, and often confusing, and the supplemental self test book is an absolute waste of time and money.  \nAlthough the material is potentially interesting and of value, the course is put together so poorly, and is so illogical that many students dropped out and failed. If you are taking this class as a core requirement, this is not the class for you unless you have prior experience.\nSpecifically, one needs to know the entire text, but entire chapters were completely omitted from the tests.  Hours upon hours were wasted in memorizing everything from how the ear works, to specific facts about biological reproduction, yet they were nowhere to be found on an exam.  However, Lindemann insisted that a close reading of everything was required, and ALL was fair game.  This was nothing but a lie.\nIn addition, it was likewise promised that if all of the assignments were completed, border line grades would be boosted.  Again, nothing but a lie.  The only redemption were the written assignments graded by the TA's, but they were subjective based on who was doing the grading.\nIn short,  because of the science of psychology and prof. Lindemann, I no longer have any desire to be a psychology major.  It completely ruined my experience here. \nWorkload:\nIncredibly intense, difficult, and only for people with previous science background.  Text book is terrible. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 13, 2010",
            "review_content": "\nProf. Lindemann is a very funny lady! :) She's nice, highly intelligent and very knowledgable in the field. Her lectures were very interesting and she was cracking up jokes all the time! The book was extremely interesting too. However, you have to be a little bit careful with this class, especially if you are not considering to be a psych major. I know some students who changed their minds after taking this class about being psych majors. I even thought about it myself. Even though it is an introductory course, Pr. Lindemann is trying to challenge her students all the time. Just like she says to her students, she makes her exams in such a way that she does not expect everyone to get a 100. Even more than that, she actually never had students who got a 100 on any of her tests for this class untill this semester. Her tests are pretty long, questions sometimes tricky and are based 50% on lectures and 50% on book (make sure you read everything in the book and try to remember it because you can get a question on even the least important point from it!). The good thing is, however, she makes a generous curve at the end. I got an A- for which I am not complaining, but I have to say that I put tons of work into it and I am an A student. So, if you are looking for an easy scienece requirement fullfillment, this class is probably not the best choice (although, it is still better than math or physics, in my opinion), but if you are intersted in the field of psychology and want to be challenged and amazed by the many things it allows you to discover and learn about yourself and other people, than it is a class for you.\nWorkload:\n3 exams, 3 writing assignments, 6 extra credit assignments and 6 credit experiment participation. Will keep you busy throughout the semester.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 18, 2009",
            "review_content": "\nI really enjoyed this class and it was one of the reasons I decided to consider a Psychology major. Prof. Lindemann, while a little quirky, is essentially a really good lecturer and her classes were interesting and insightful. She always had organized powerpoints, and was willing to spend as much time as it took to explain them. She was always open to taking questions from the students, and would try to involve the class as much as she could.\nI loved the number of relevant studies she brought up, and we got to see some really interesting videos from original, classic psych studies. This being a survey course, I think Prof. Lindemann did a great job of covering the entire field of psychology in a way that made it easy to navigate.\nThe exams do indeed test you on memorization (not a lot though!), but there are also questions relating to applications of the materials she discusses and explains in class. If you read the textbook and attend the lectures, you'll be more than fine.\nAll in all, I found this class very interesting and enjoyable and would definitely recommend it!\nWorkload:\nThe textbook is a bit tedious to get through, but is very rewarding if you do.\nThere were three non-cumulative tests and three short response papers.\n\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "September 08, 2009",
            "review_content": "\nI really enjoyed Prof. Lindemann's Science of Psychology class.\nThough I found the first unit to be a tiny bit tedious, I was all ears for the following two units. Because of this class, I switched my major to Psychology.\nHelpful tip--DO NOT WASTE TIME ON THE READING! (unless you want a guaranteed A)\nI did not read the book. I did, however, attend every lecture. Then, to study for the test, I simply studied the lecture slides and my notes took the practice tests (you can buy a supplementary book--do it!) to identify my areas of weakness. The Supplementary book with practice tests provides you with answers and a brief overview of the content of each chapter. My favorite thing was that next to the answers to the practice tests were the page numbers in the text book where I could find explanations of certain theories, facts, ideas, etc. In short, I just used the text book as a reference for writing my papers and to review for the test a bit. I wound up with an A- and barely did any work for this class. But then again, I'd rather have an A- and more free time to sleep or work on assignments for other classes rather than spend an extra 4+ hours every week just to finish the reading and get an A.\n\nWorkload:\nVery light unless you make it otherwise.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "July 05, 2009",
            "review_content": "\nAlthough the material is fascinating, and the instructor is very nice, this class for many students is truly a disaster.  Basically, you have to memorize Peter Gray's book \"Psychology,\" which is dense, and poorly written for non-science people.  The material is presented so fast, that unless you have some sort of background, it is impossible to keep up.  A \"workbook\" is also sold in conjunction with the text, but it is completely useless.  I threw it out after the first test (of which there are three), and did considerably better on the other two.  The three papers that are required are graded subjectively by the TA's, who depending on your grader, can be understanding to those who have never been exposed to NeuroScience to down right hostile.  Of course, Lindemann supports the TA's 100%, and basically tells you that everything will be all right, which is pretty much just to shut you up and pass you along.\nLindemann promised our section that if we completed all of the assignments, and turned them in on time, our grade would be boosted a bit if we were border line.  I did this task, along with several other students, and did not find this to be the case.  I'm not sure why such a claim was made, but it proved to be false.\nThe three tests were for the most part numbing.  The questions were twisted and designed to trick, rather than simply be straight forward.  In short, the tests were not designed to test one's knowledge of the material.  In fact, the first exam was so complicated and poorly designed, that most of the class failed to complete it.\nOf course, no adjustment was made for this error on behalf the instructor and T.A's.. \nWhen paying over $3,000 a course, I expect to be treated fairly and in a straightforward fashion.  Moreover, I expect that an intro course truly is an intro course, of which The Science of Psychology is not.  Accordingly, I would not recommend this class or instructor as a means to fulfill the science requirement, especially when there are far superior intro courses out there.  In short, don't take this class. \nWorkload:\nRidiculously Heavy. You can study all you want, but it really wont help.  NOTE: THIS IS NOT AN INTRO COURSE!!!!!!! \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "March 31, 2009",
            "review_content": "\nThis was one of my favorite classes last semester. Professor Lindemann, although a bit quirky, is essentially a really good lecturer. She is clear, organized most of the time, approachable and encouraging. Her lectures were interesting and she was willing to answer any questions the students had. After taking other courses in the Psych department, I realize how well she taught this broad survey course, bringing up the most pertinent points and introducing students to important research and findings. I felt I had a very sound grounding in Psychology after taking this course. The exams are based heavily on memorization for the multiple-choice part, relying heavily on the textbook reading and on application of various concepts and research findings discussed in depth in class for the short answer part of the exam. She curves pretty generously and according to her estimates around 30% of the class last semester was in the A range.\nWorkload:\nThe textbook, although interesting and thought-provoking, is still quite a bit to get through. The chapters are longggg so keep up with the reading. \nThe two page reading analysis exercises are manageable enough.\nThree tests (non-cumulative) with the last one held during finals week.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 28, 2008",
            "review_content": "\nProfessor Lindemann is really funny, very clear and very passionate about psychology. Her lectures were very straightforward and a blast. If you do the reading, show up and pay attention, you should do more than fine on her generous grading curve! \nWorkload:\n3 equally-weighted tests, 3 reading analyses, subject participation requirement, extra credit\n"
        },
        {
            "course_name": "Experimental Psych: Human Behavior",
            "review_date": "December 18, 2008",
            "review_content": "\nI had her for a thinking and decision making lab.  Thank god the lectures were posted online, her 2-hr a week class was enough to make you wish you want to cry and/or hit things.  I swear I didn't learn anything during lecture that I couldn't have taught myself.  The lab assignments are also totally unrelated to anything that goes on in class, but you're expected to learn things for lab on your own anyway.  The class requires a lot of patience and a really good TA.  Don't study too much for it, you'll just be mad at yourself if you do (and you'll probably do worse).  \nWorkload:\nMedium-load, randomly worded midterms that had really low averages, arbitrarily graded lab reports\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 13, 2008",
            "review_content": "\nProf. Lindemann is a good lecturer. She's very enthusiastic and makes the class interesting. She puts the slides up to help, and provides sufficient review for the tests. The tests are straight from class/slide material, and if you keep up with the reading it should be relatively easy. \nWorkload:\n3 reading analyses, 2 tests, 1 final (not cumulative), optional extra credit, psych experiments\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "August 17, 2008",
            "review_content": "\nAMAZING!!!! Prof. Lindemann was indeed a bit quirky, but besides this, there is a lot to learn in her class.  The lectures are engaging, and detailed but always fun and interesting.  Be warned!! Don't think you can get by without attending lectures or reading the textbook. You have to do BOTH in order to do well in this class, so if you're taking it for a science requirement, I suggest you look elsewhere.  For those of you who are truly interested in Psychology, you won't be disappointed.\nWorkload:\n6 points of experimental credits, 3 exams, and 3 straight forward 2-page papers. Extra credit is also available\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "June 04, 2008",
            "review_content": "\nThis was the most difficult class I've ever encountered, and my GPA took a major hit.  The amount of reading, writing, assignments, and memorization borders on insane for an intro course.  Furthermore, this course should never have been listed as an intro course.  The class is disorganized, difficult to follow, and the text can often be confusing.  Prof. Lindemann, however, is for the most part pleasant, although Lindemann did openly threaten to slap a girl in class if she turned in her paper while speaking.  (The student arrived late, and had no idea that she was not allowed to turn in her paper).  The TA's were mostly good, but sometimes cancelled office hours at the last minute, especially during finals. It is, however, understandable that they have their own work to attend to as well.  The average grade on the three tests were considerably low, and the class is curved which really does not help.  Supposedly, if you complete all the extra credit assignments, six out of nine, your grade will be boosted by a half (B- to B) if you are border line.  This was not the case with me, or several others I spoke with.  Thetests themselves are needlessly difficult.  In short, they are not straight forward, which adds another level of complexity that we could all do without.  The TA's, who grade the papers, do not seem to understand that for most people in this class, this is their first exposure to science.  It's supposed to be an, now read  slowly, INTRO course, but ended up being an intercourse because many of us got screwed. \nLastly, I spent more time on The Science of Psychology than on all my other classes combined, and still did poorly.  Indeed, it effected my grades across the board, making this the worst semester of my Columbia career.  Unless you are farmiliar with the countless amount of experiments, data, theorists, and neuro science, avoid this class at all costs. \n \nWorkload:\nHeavy, Heavy, Heavy  Three impossible exams, 6 extra credit assignments that were not applied as extra credit, three written papers that are subjectively graded, and seven experiment credits which are mandatory, and somewhat interesting.  Very hard!\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 14, 2008",
            "review_content": "\nI'm an English major and I took this class to fulfill the science requirement but I also figured it'd be a pretty easy A. It isn't-- whereas it isn't that difficult to get an A, you really do have to do all of the work. It's also good to know that she curves the class so that 35% get A's. The other reviewers pretty much covered what Lindemann herself is like (goofy, decent lecturer, copies slides right out of the textbook), but she lets her TA's do all of her grading. \nSome of them are extremely harsh with the reading analyses (which are a PAIN!) for no apparent reason (one of her TA's told me she just doesn't like to give grades higher than 8/10). The exams cover a ton of info in the textbook so definitely keep up with the reading because there is a ridiculous amount. Overall, I'd probably say that if you have a heavy courseload this semester, skip this class because you're going to want to dedicate a lot of time to the readings to be able to do well. Although she does give extra credit, which is nice.\nWorkload:\n6 subject participation credits, 3 two-page reading analyses, 3 non-cumulative exams (the final is just another 90 minute exam, which is nice), a ton of reading (the entire Gray's textbook. seriously.)\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "August 06, 2007",
            "review_content": "\nTo everyone who took the AP Psych exam or class but Columbia wouldn't give them credit- this class is your easy A.  As other reviewers stated, she fusses about half of the material coming from her lectures and half coming from the book, but really it's all in the book.  I basically attended less than a quarter of the classes and still got an A.  Just do the written assignments, do them well, and read the book before exams.  Her curves are pretty generous. The book is really well organized for studying and very readable.  The experiment participation credit is a 15% (?) giveaway.  \nAll that aside, she's a sweetheart, a dear motherly lady.  It's hard not to like her- at least for as long as you're awake during her class.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "April 11, 2007",
            "review_content": "\nProfessor Lindemann's class is ultimately the reason I decided to switch into the psychology major.  Her lectures are clear and they follow the book.  The book itself is amazing, understandable and really easy to study from.  Some topics are more interesting than others, but this is because we do an overview a lot of different topics, but still manage to learn a decent amount about all of them.  If you want to see if you're interested in psych start here, though I'll admit some lectures were a little boring.  She is enthusiastic, which is also a plus in a lecture class.  She tends to err on entertaining too many stupid questions, however.\nOne last suggestion - pay attention to everything you learn here!  A third of my higher level courses cover what was covered in  Science of Psych; this class will be beneficial in every psych class you take.   \nWorkload:\n3 non-cumulative, curved midterms.\n-Focus on the text to do well; I went over the study questions in the book and got an A each time.\n3 two page response pages; trickly graded.  Every single word must mean something significant or you'll be marked down.  It's still possible to get an A if you do mediocre on these.\nOptional extra credit - do 6 out or 9.  Do them and bang them out early; they're usually easy or fun.\n3 hours of psych experiment participation.\n50 pages or so a week from the text.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "April 09, 2007",
            "review_content": "\nProf. Lindemann knows her stuff and does as much as one can with a broad survey course like this. She certainly has an quirky sense of humour (don't most psychology professors) - it's indearing to some, not so much for others. Her classes are fairly well laid out although the powerpoint notes can be a little hard to follow at times. I recommend this class to anyone thinking of majoring in Psychology, it will give you a good foundational knowledge of the field. \nWorkload:\nThe course itself requires a lot of reading, mainly from the text book. Pick up a copy of Gray's Psychology and have a look through it if you want to get an idea. You will pretty much have to have read the whole thing by the end of semester. Apart from the reading the course work is not too intense, there are not a lot of tests and assignments.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "March 06, 2007",
            "review_content": "\nLindeman is no great teacher, but she knows who she's teaching: English majors knocking out a science credit.  her powerpoint presentations in class essentially copy the book verbatim, with the pleasant addition of background colors and bullets.  then she basically reads them to the class, allowing occasional interruptions from would-be psych majors with pretentious questions.  she makes this big statement the first day about how only half of the test questions come from the book--the other half, she says, come from her class lectures.  but after a few lectures, you realize that couldn't possibly be true, since she reads the book to you in class.  that approach makes her exams easy, but it also transforms interesting information into just information.\nWorkload:\n3 generously curved non-cumulative midterms; 3 pointless but easy exercises; 3 hours doing studies you should be paid for.  \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 18, 2007",
            "review_content": "\nYes, this is a survey course: do not expect a lot of depth. It is an easy science credit for non-science folks. Regardless, Professor Lindemann seems to put a lot of time and energy into the course. I found her lectures to be very engaging and at times entertaining. Her sense of humor is quirky (okay, dorky), but I found that endearing. I'd rather have a dynamic lecture with dumb jokes thrown in than a static, monotonous lecture that's lame-joke-free. There is a moderate amount of reading required, and you probably won't do well on the exams if you don't do it, but the textbook is well-written although superficial. The three reading analyses were annoying, and her expectations for them were vague. I recommend looking at each of the reading options before writing; some have a lot more scope for analysis than others. If you disagree with the TA's grade on these, Lindemann will look it over herself and possibly adjust your grade; I got an additional two points (out of ten) this way on one analysis. Exams weren't too difficult if you did the reading and went to most of the lectures; there are no trick questions.\nWorkload:\nSix hours total on the reading analyses, five hours with the text before each exam, about three hours of subject participation. Optional extra credits are an hour each.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 23, 2006",
            "review_content": "\nI understand that a lot of students take Science of Psych to take care of their science requirements, and I guess that in that context it might be an okay class. As a neuroscience major, this was a required course for me. I also had the unique experience of taking W1001 along with two other (and more interesting/challenging) psychology courses, and I was really disappointed with both this course and Lindemann's teaching. Of course, intro/survey courses are often limited by the breadth of the topic, but Science of Psych could have been a lot less painful with a teacher who did more than read from Powerpoint slides. Lindemann obviously means well, but she brings little to the table. Most of the material seems skimmed over, with Lindemann's awkward jokes taking the place of interesting presentation of content - the only exception was the section on developmental psychology, which is obviously one of her interests. I felt that the course suffered from a lack of professionalism on her part, or at least it made it hard for me to take it seriously. Humor is fine, but starting the class every session by saying \"hello, boys and girls\" doesn't promote an environment of mutual respect. That sounds like an overreaction on my part, but where provocative and inspiring education was lacking, a mature relationship between professor and students could have made a big difference. I could go on, but instead I'll recommend that you read the other reviews. If you're just looking for a \"science\" class and an easy A, you might like this class. If you actually care about psychology/neuroscience & behavior, you'll probably be disappointed, but unfortunately, it's required. Maybe someone better will be teaching it other semesters... \nWorkload:\nUnchallenging reading (I did it, but you'd probably be just as successful reading the chapter summaries before the test), three 2-page reading analyses of mostly pop-psychology supplementary readings (tedium! pure and simple!), three non-cumulative exams that are curved pretty generously, subject participation (so easy!), plenty of easy extra credit opportunities\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "December 02, 2006",
            "review_content": "\nYou're probably reading this because you need to get that science requirement out of the way--WW1101 is one of the better choices, Lindemann one of the better (read: less bad) teachers.\nThe class itself itself is deceptively easy. There are three non-cumulative (!) exams. Each one is split into two parts worth equal amounts: multiple choice + free response, with MC drawn from the text, free response from lecture. Supposedly. The truth is it's all in the book.\nFor the first test I attended all the lectures and skimmed the book and got a C. For the next I skipped the lectures but knew the book well and got an A+. Causation, no. But an interesting correlation. That's something I learned from the book.\nYou'll notice that I largely ignored Lindemann in this review. That's because, as annoying as she is, she doesn't matter. This class is about you and your book. Know the book and you'll get an A. \n\nWorkload:\nReading a chapter well (~40 pgs.) takes 3 hours a week. Well-written text by a former Columbia undergrad. He took Lit-Hum, and it shows.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 29, 2006",
            "review_content": "\nI agree with other reviewers, in that this is not the first class to choose if you are just trying to fulfill your science requirement.  There is a lot of reading, A LOT OF READING, which you're going to have to do if you want do well on the tests.  There are extra credit opportunites, which is quite stupid, because if you do all of them, and only, and only if you have a C+ or B+, you could possibly get a B-, or an A-.  The midterms are hard, but they are curved.  However, if you don't read the text and study for the tests, you probably aren't going to do well on the tests.  Also, there are 3 reading analyses to complete, relatively easy, but some work into it and you can do well on them.  And lastly, LECTURES are extremly BORING and a WASTE OF TIME.  The first thrid of the class i went every time, and with the curve i got a b-.  Second third, I went to no lectures, and i got a b+.  Basically, READ THE TEXT and you will wing up doing well on the tests.  If you have nothing to do and you want to hear see her odd character lecturing common sense stuff about psychology, then go.\nWorkload:\n2 midterms, 3 reading analyses, final(you also have to participate in some psychology experiments but thats nothing)\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 16, 2006",
            "review_content": "\nI would not recommend this class as an easy way to fulfill your science requirement, but if you are interested in psychology, the course gives a good overview of the many different aspects of psychology and the relavent theories.  Prof. Lindemann is a pretty good lecturer - she works from a Powerpoint which she posts online later, so it's easy to make up notes when you miss class (or just space out), but things make more sense if you actually go to lecture.  The tests are difficult and designed to be so, and they consist of free response questions drawn from the lectures, and multiple choice questions that supposedly come from the reading, but of course a good amount of the reading is ALSO in lectures, there are only a few somewhat-obscure questions that come from only the reading.  The reading response papers were surprisingly hard, and the subject-participation requirement (where you have to participate in psychological experiments) is kind of a bitch.  Keep looking if you want a good non-\nsciency way to fulfill the requirement.\nWorkload:\nLOTS of reading, 3 2-page reading analysis papers which are graded harshly, 3 midterms, research participation.  The entire class is curved, so it's hard to know what grade you will get until the end, but usually an 86 or higher will end up being an A.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 29, 2005",
            "review_content": "\nThis class provided a broad exposure to various topics in psychology.  I found Prof. LindemannÂ’s lectures to be both funny and informative.  The TAÂ’s were FANTASTIC!!  I did have a couple of complaints.  The first was that her powerpoint slides were disorganized and a bit outdated.  I say disorganized because they looked like notes from a textbook.  They were very confusing at times.  Do not make my mistake of skipping class in the morning and hoping to simply copy her posted lecture slides.  You will not understand what the slides mean at all!!!  This brings me to another complaint: the fact that the class was at 9:10 in the morning.  I donÂ’t think I need to explain the complications with thisÂ…\nWorkload:\nThree hard exams, three easy papers, required experiments, and ten extra credit opportunities.  Not too bad..just keep up with the syllabus and you'll be fine. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 29, 2005",
            "review_content": "\nProf. Lindemann is a good choice for those who wish to take science of psych. (from what i've heard, galanter and those profs. who teach second semester should be avoided). in short, she's the best option. the course is definitely not difficult, simply because of the fact that the material is pretty straightforward and logical. the exams reminded me of high school. multiple choice was quite easy, simply requiring that you be able to recognize an answer (i.e. very little comprehension was necessary for this section of the exams). the short answer section which followed the multpile choice on each exam was a bit more challenging because, naturally, it required more recall than simple recognition. the exams are only difficult in that they are long, so don't take your time. as for the lectures, i wouldn't venture to call them enlightening in any way. they are mostly a regurgitation of the info. in peter gray's textbook (which, although pretty boring to read, is very well-written), with a few additional ideas sprinkled in here and there. the video clips that she showed were usually interesting. if you have the kind of mind that can retain a lot information for a short time, i recommend doing most of the reading a few days before the exam (but make sure you get it all done). each exam covers about 200 pp. of material in textbook. in short, a solid and well-designed class, definitely worth taking if you're interested in psych. also, she's a pretty nice lady.\nWorkload:\n3 exams (none of which are cumulative). 3 two-page papers. Experiment participation (about 3-4 experiments needed to complete the requirement...not a big deal, and pretty interesting). extra credit assignments which can be done really quickly--complete 6/9 to have 2 perecentage points added to your final grade. Top 35% of the class gets some form of an A. remember that nothing gets dropped, so don't bomb anything (and you won't as long as you do the reading).\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 24, 2005",
            "review_content": "\nWhile I don't completely disagree with the previous reviewer, I think that there are some good things about Prof. Lindemann and the course that should be mentioned. Firstly, Prof. Lindemann, though at times may seem disorganized, does know her stuff and will answer your questions if you approach her after class about them. The TAs also work really hard and are very approachable and helpful if you take the time to ask them questions about things you don't understand. The course is generally interesting, and grading is fairly easy. To be honest, (and I don't mean any offense to the previous reviewer in this), but I think for a teacher, Prof. Lindemann is pretty good and I'm glad Columbia has given us the opportunity to learn from her and her TAs.\nWorkload:\nFairly Easy. 3 Midterms, 3 short papers (marked easily), experimental subject requirement, 9 extra credit assignments. DO THE EXTRA CREDIT. IT'S THE DIFFERENCE BETWEEN AN A AND AN A+.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 18, 2005",
            "review_content": "\nI think this is a great class. I mean, Patty obviously loves her subject, and definitely does a good job of projecting that love to the students. There is a TON of reading from the textbook as well as outside articles in this course. It is very difficult to keep up sometimes, but it is all very interesting. My main complaint is that although there is an agonizing overlap between lectures and readings as far as material, there is just enough that are specific to each that makes it necessary to do both. Tricia is a very funny professor and I recommend it for anyone interested in psychology. It is a very stimulating and fun course.\nWorkload:\nI definitely spent more time on this class than any other. However, the workload is light. Three two page article responses and three tests. That's it.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 21, 2005",
            "review_content": "\nWell, where do I start..prof Lindemann is not organized, doesnÂ’t do a good enough job explaining, her power point slides are not accurate, this is unacceptable that a prof. at Columbia would present herself and teach a 150 student class in such a way. The lack of seriousness that characterizes this prof. is amazing, this is Columbia University, how, why, donÂ’t we deserve someone who will do the job or at least try to do it in the best way he/she can? DonÂ’t raise your hand for questions, she wont see you anyway, and mostly no direct answers unless one of the TAÂ’s is answering.\nOffice hours are always cancelled for some reason, replying emails is a secondary thing for this prof.  Although I am doing well in this class I find the way this teacher conducts the class inappropriate to the place we are all studying in.\nThere was one good thing in that class- a wonderful TA, Poonam(not the nicest-sorry-at times, but it doesnÂ’t matter, we are here to study!), very knowledgeable and serious, it seems that as a grad student, she would do a far better job teaching the class. I can just regret that all we got from Poonam was one lecture, but it was the best one during this term. Thanks If you are a serious student who wants a serious professor, donÂ’t take this class, but if you just care about the workload it's mild. \nWorkload:\nAs for the workload, not very heavy. Extra credit assignment that can bump up borderline grades, reading responses that are a gift if taken seriously (each is worth 5 points). 3 exams that cover a lot more than what is done in the lectures, so study the book,it is detailed and easy to read.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 21, 2005",
            "review_content": "\nWell, where do I start..prof Lindemann is not organized, doesnÂ’t do a good enough job explaining, her power point slides are not accurate, this is unacceptable that a prof. at Columbia would present herself and teach a 150 student class in such a way. The lack of seriousness that characterizes this prof. is amazing, this is Columbia University, how, why, donÂ’t we deserve someone who will do the job or at least try to do it in the best way he/she can? DonÂ’t raise your hand for questions, she wont see you anyway, and mostly no direct answers unless one of the TAÂ’s is answering.\nOffice hours are always cancelled for some reason, replying emails is a secondary thing for this prof.  Although I am doing well in this class I find the way this teacher conducts the class inappropriate to the place we are all studying in.\nThere was one good thing in that class- a wonderful TA, Poonam(not the nicest-sorry-at times, but it doesnÂ’t matter, we are here to study!), very knowledgeable and serious, it seems that as a grad student, she would do a far better job teaching the class. I can just regret that all we got from Poonam was one lecture, but it was the best one during this term. Thanks If you are a serious student who wants a serious professor, donÂ’t take this class, but if you just care about the workload it's mild. \nWorkload:\nAs for the workload, not very heavy. Extra credit assignment that can bump up borderline grades, reading responses that are a gift if taken seriously (each is worth 5 points). 3 exams that cover a lot more than what is done in the lectures, so study the book,it is detailed and easy to read.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 21, 2005",
            "review_content": "\nLindemann is a kind person, but she was the most immature, unorganized, and unprofessional lecturer that i've had in my two years here.  My main complaint?  She cannot for the life of her present the material clearly.  Laser-pointers endlessly confuse her as do HER OWN powerpoint slides: she wastes way too much time scratching her head trying to figure out \"what [she] meant when [she] wrote that.\"  Also, many of her powerpoint slide had errors -- not just typos but major mistakes and evidence that SHE DOESN'T KNOW THE MATERIAL that she's presenting (a particularly memorable example: she called circadian rhythm the circadium rhythm.)\nLindemann never knows what material is coming up on her powerpoint slides and ends up jumping all over.  Because of her bad vision, she occasionally has trouble reading her slides on the overhead. And don't even bother raising your hand to ask a question--she'll never see you unless you're sitting in the front few rows.\nThe first half of this course is a total repeat of MBB (Mind, Brain, Behavior -- both courses are required for the Neuroscience major).  Jennifer Mangel's fall MBB course was 100x better than this course.  Even the TAs were better.  My main problem with this course was that classtime was a total waste.  Lectures would drag endlessly as Lindemann repeated the same concepts over and over.  In 75 minutes, we never seemed to get through more than 10 slides -- hardly any material at all.  Way too much time was wasted apologizing for errors on her slides and trying to unconfuse the class (and also trying to figure out how to use the laser-pointer--you think she'd learn...)  In 75min, Mangel's MBB class would accomplish sooooo much more (covering about 3x the material in 3x as much depth).  I'm not one to complain about a class being too easy, but covering too little material in Lindemann's class doesn't translate to easier tests -- we're still expected to cover about 200 pages of reading for each exam!  If we covered more material in class, the textbook reading would be less painful and it would be easier to justify going to class.  \nOn the positive side, the textbook (Gray's Psychology) is really great and covers a wide-range of material which will teach you about the real world.  It also does a great job demonstrating how behavior/traits are useful in an evolutionary sense.\nSo to conclude, I really disliked this professor.  Her fumbling mistakes might be acceptable for a first-time professor but Lindemann repeatedly teaches this course.  To put such an unorganized and unprofessional professor in front of 150 students is unacceptable and I can only hope that no visiting students sat in on this class (they'd instantly lose all respect for Columbia).  \nIt's a strange phenomenon (which i've confirmed with other neuro majors): all the science of psych professors suck and all the mind brain behavior professors are great.  The solution?  For people that want a good professor to teach them psychology (and neuro), take a Barnard intro psych course (unfortunately it won't count towards the psych or neuro major)\nWorkload:\nSee the below review. I should also mention that during the course of the semester you will be expected to read the entire textbook.  Is completing all the reading necessary to do well in this course?  I thought so.  \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 16, 2005",
            "review_content": "\nI love Patty Lindemann.  Contrary to what you'd expect from an instructor in a large lecture class, Patty personally relates the material to real life and uses abundant examples of case studies and statistics not even included in the text.  On top of that, she's hillarious without even trying to be.  I definitely suggest taking Psych with her, and if you're just fulfilling the Science Req, take this class.\nWorkload:\n3 moderate exams and 3 Reader-Response Assignments (2 page analyses of a psych article and how it relates to topics discussed in class).  Really try to be creative and relevant on the RRs, because the TAs are hard graders.  Also you must participate 6 psych experiments for maximum credit, and fulfill 6 of 9 EC opportunities to be considered for extra-credit.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 09, 2005",
            "review_content": "\nI REALLY enjoyed this class and it made me consider Psychology as an option for my major.  Lindemann's way of leading a lecture and transforming both interesting and dry material into ideas that are both relevant to our daily lives and in need of discussion amazed me.  I'll admit that I came in thinking that I would fly by after taking AP Psychology in high school; nevertheless, I am pleased that Professor Lindemann put me \"in my place\" so to speak because I gained so much from this course and pushed to receive a good grade.  \nWorkload:\nLots of reading!, 3 exams, 3 short papers (1-2) pages, experimental participation\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 22, 2004",
            "review_content": "\nLindemann isn't bad at all. The lectures can have you looking at the clock every five minutes, but it's in powerpoint and you can access them if you miss a class. She does sometimes show videos that show up as test questions but it's not that serious. She is very nice and presents the material in a comprehensive and understandable manner and will answer and questions students have about any of the material. She can be kind of corny sometimes, it just adds character. This class served as a great introduction to psychology and I would recommend it.\nWorkload:\n3 tests that each cover one-third of the class. Nothing is cumulative3 reading responsesExtra credit.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 16, 2004",
            "review_content": "\nI find hillarious reading other reviews of professor Lindemann, because for most part they are exaggerated. I would tell you: she is not as bad as she appears to be. She is concentrated on making you understand the material that is already easy and straightforward. She is not one of these professors that bullshit alot about nothing. Her lectures are well organized and presented on the powerpoint. If you miss the class, you can still acess them online. There are no midterms or finals in that class. There are 3 tests, each covers the third of the class material. These tests fairly test your understandng of the material:is fair: 50 multiple choice that are based on the book, and 10 common-sence short answer questions based on the class notes. \nWhat I would admit is that she is weird, but it is no harm to you at all. She tries HARD to be funny, but if someone laughs at her jokes, they do so just cuz they are trying to be nice. Once she tripped on the extension cord, but in order to ease the embarasement she started dancing something inbetween the electric slide and polka. By the end of the semester, you would learn the names of her two kids (Rebecca and Jordan), the profession of her housband, and a whole bunch of other \"girl talk\"\nI would strongly advice you to take this class though. Patricia is a very nice lady, who is open to after class discussions. Feel free to email her with whatever you are concerned about. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 12, 2004",
            "review_content": "\nIf you are scared by the ridiculous reviews of Galanter (as I definitely was) you may have opted to take this class at 9 am w/ Patricia.  She is pretty much boring and reads aloud her powerpoint slides without adding any additional information.  She is really nice, but extremely strange (she often does little dances and uses high pitched voices to imitate everything from a neuron to a prisoner), she seems to be interested in the class and our opinions but she pretty much manges to make the (incredibly interesting) text material quite boring.  Its not a hard class by any stretch and I guess she is quite enthusiastic for 9 am- although I can't say I quite understood her humor.  The midterms are basically multiple choice and are highly based on the text (so do your readings as you go!),  the papers are very short and graded somewhat arbitrarily.  Extra credit is available 8 times (must do 6) and she says that it will be used to decide whether students at a borderline grade are curved up or down.  \nWorkload:\n2 Response papers, weekly readings, 2 midterms, and a (noncumulative!) final\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "September 18, 2004",
            "review_content": "\nShe's OK. Although she's boring, vision-impaired, and monotonous, you will succeed through the boring reiterations of text-book material when you keep in mind that this is just an introductory-based class. Thus, for the purposes of objectively introducing psychology as a discipline, the objective (not the intepretive) knowledge shall be respected and given in kind. Many of us forget that \"boring\" material, or material that's presented in a boring manner, does not mean anything about the \"value\". In that sense, this class will prepare you very well for upcoming psychology classes. She's great at getting into heads the fundamental material required for psychology. Just remember that you only develop somewhat of an appreciation... after the fact... and only if you're strong enough to pursue psychology after an entire semester of yawns, rolly-eyes, and the kind of yawns that make you  drool due to an extremely yawnful teacher that makes you yawn for an entire semester.\n\nWorkload:\nJust sludge through it all and you'll do fine. Also, she's surprisingly open after class hours, although this may even bore you even more. \n"
        },
        {
            "course_name": "Experimental Psychology: Thinking and Decision-Making (w/ Lab)",
            "review_date": "April 11, 2004",
            "review_content": "\nContrary to the other reviewers, I think 1490 is alot of fun. The material is really interesting, I think my father will never be convinced that there is no such thing as a hot hand or streak shooting in basketball, depite the psych literature, but Im gonna enjoy trying to convince him. The readings make you think about the world around you, the labs give you a chance to be scientific, play researcher, explore cutting-edge topics pretending you have an endless grant. And Trisha, a sweet woman, who explains complex topics very simply, if you took a previous thinking and decision-making course, or any of the cognition courses the topics shouldnt be completely unfamiliar and she and the TA wre more than willing to stay late, reply to emails, or repeat material the next class if people were confused. Trisha's research in the field is very interesting, i think one of the best classes was when she talked about her theories and let us be her guinea pigs. Also, register with your friends! you are the subjects in alot of the work you do, trust me youll want more data, the more ppl in the class, the more you can do. Whether youre headed to business sch (behavioral economics is discussed) or a psych PhD program, or you just plain want to know how ppl think ( and come up with some theories about how to manipulate them) this is a valuable class, and NOT TOO MUCH WORK for the 4 pnts.\nWorkload:\n3 lab reports, midterm, final, oral presentation. You can bring in prepared notes for the essay portion of the exam ( you get the tpoics in advance) or you can even bring in the essay already written! and just attach it to the short answer portion. Grading is generous. Seems liek most ppl got some sort of A on the labs. If you do the work, which is just readings and the above mentioned you'll do fine.\n"
        },
        {
            "course_name": "Experimental Psychology: Thinking and Decision-Making (w/ Lab)",
            "review_date": "May 23, 2003",
            "review_content": "\nThe class lectures and labs can be hard to sit through, and the exams and labs cover a lot of ground, but Dr. Lindemann is a very nice woman and an easy, easy grader.  Note: you can get by with doing only a fraction of the readings, which is good because few students could manage the assigned load. This isn't a great class, but it isn't terrible either.\nWorkload:\nA lot if you do it all, but you definitely can skimp and still get a good grade.\n"
        },
        {
            "course_name": "Experimental Psychology: Thinking and Decision-Making (w/ Lab)",
            "review_date": "April 22, 2003",
            "review_content": "\ntricia (as she goes by) seems like a very kind woman, but her lectures are incredibly dull and scattered. i feel completely turned off to the field of thinking and decision making. don't take this class. \nWorkload:\na lot of reading and tons of material covered on the test, but the grading is relatively easy. work hard and you'll do fine.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 07, 2002",
            "review_content": "\nProfessor Lindemann is very possibly the most boring lady I have ever encountered. Her lectures are so incredibly dry and every piece of information that could be brought up, is left out. For anyone who is considering majoring in psych, DO NOT take this class with her. She will change your mind, or not give you enough of a background in the subject. She is so unorganized that you think you may go crazy. Unfortunately she has a vision problem that intereferes with her teaching ability and in turn affects each student. The only redeeming factor about this class is that she can sometimes throw in a joke that you would expect your grandfather to make, that you just have to laugh. \nWorkload:\nabout a chapter a week- three papers, in first and second draft form- first draft is peer edited (does not help one bit)\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "April 29, 2002",
            "review_content": "\nIf anyone can suck the life-blood out of what I once found an interesting subject, it is this woman. in fact, it seems like everyone in the class now hates psychology. if anyone took intro to psych because they thought they'd be a psych major, this woman definitely changed their minds. it is one thing for her to bring in her kid for experimental purposes(which will surely screw him up later in life), it is quite another for her to ask a student to take her kid to the bathroom in the middle of one of her oh-so-fabulous lectures. basically, this woman is the most boring person i have ever encountered. go to class, don't go to class. it doesn't matter. she can't see, so she won't know if you're there or not. \nWorkload:\nit doesn't matter how little work there is in this class. going to it will suck.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 31, 1999",
            "review_content": "\nThe course is really easy if you go to class and read the book. not one to stress over. Lindemann is really funny. You can learn everything from the book, so it doens't really matter that she doesn't say it all in the lectures. She brings her kid into class so we can do experiments on him, and she is really fair about grading and stuff, opportunities for extra credit, and eliminating unfair questions.\nWorkload:\nThree multiple choice non-cumulative, easy exams\n"
        }
    ]
}