{
    "prof_info": [
        {
            "prof_name": "Yang Feng",
            "prof_id": 10534,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Linear Regression W4315",
            "review_date": "May 14, 2015",
            "review_content": "\nYang Feng is a pretty good instructor. His classes are standard lectures in which he makes use of PowerPoint slides for each chapter (they are posted on his website) and the chalkboard for extra clarification. Since this class requires R, he demonstrates some code in class as well (the R code is provided on his website too).\nI found the PowerPoint slides to be quite helpful at times. At worst, they just copy the material from the book. However, the slides contain what you need to know in each chapter.\nAll of the problem sets require R, so it's a good idea to download RStudio to play around with R. Fortunately, all the code required for the class is demonstrated in class, so you could reuse the code he provides on the website to complete assignments. \nIt's important to review your linear algebra (matrices, eigenvalues, transpose) for this class. The second half of the class requires linear algebra. It's also not a bad idea to pick up a little R beforehand (just to make your time easier).\nOverall, a decent instructor. Fairly nice guy too.\nWorkload:\nProblem Sets (20% of grade) - given about every week. 10 problem sets in all. They all require R to some extent (for calculations and/or printouts).\nMidterm (30% of grade) - He posts a sample midterm and solutions for practice.\nFinal (50% of grade) - He posts a sample final and solutions for practice.\nOverall grade is curved.\n"
        },
        {
            "course_name": "Linear Regression W4315",
            "review_date": "January 15, 2014",
            "review_content": "\nHis lectures were alright--he spoke pretty good english. The hw was pretty straightforward for the most part since he provided us with example R code in class, which you could often use on the HWs. He posts his powerpoints which is nice. The exams were both pretty straightforward for the most part, though the True/False sections could be pretty tricky sometimes. \nOverall, the class is pretty straightforward, with a moderate workload.\nWorkload:\nweekly hw, midterm, final\n"
        },
        {
            "course_name": "Applied Linear Regression Analysis",
            "review_date": "April 10, 2013",
            "review_content": "\nThe last reviews give each a very different picture of Prof. Feng and his class. I would say that the truth is in the middle. He is a good lecturer but sometimes he is dry, and the slides are taken directly from the book. He is very nice but sometimes a little condescending. The midterm and finals are doable (do the practice exam over and over!) but the homework assignments take a lot of time. The curve is very good. Prof. Feng is very young and I'm sure he will become an awesome professor.\nWorkload:\nHomework 20% (a lot of work). Midterm 30%, Final 50%, and the only way to prepare is to do the practice exam. I would suggest you read the book.\n"
        },
        {
            "course_name": "Applied Linear Regression Analysis",
            "review_date": "December 21, 2012",
            "review_content": "\nProfessor Feng is probably the best stats professor I've ever had mostly because I understood what was going on THE ENTIRE COURSE, yes even that last week of class when you feel like all is lost. and I am a math major but prob/stats has always been a horrific nightmare (read: Olvera-Cravioto).\nHe has really good slides which he posts before class so you can write on them if you choose. Barely used to book towards the end. He explains the 'bigger picture' of why we are doing what we are doing, and what each variable/parameter/criteria actually means which I found refreshing and amazingly helpful. I am not sure about your stats experiences but previously I felt like I was blindfolded throwing a hail mary, hoping for the best- not so with Professor Feng. Also, this class was great because there were actual data, as in working with real numbers, which as many of you know start disappearing and are replaced with letters and symbols (stats inference class did not use any data, it was all theory. and silly me was thinking stats had to do with raw data and numbers. how naive).\nThe homeworks were long I won't lie but the main struggle was using R (or in some cases, realizing R's limitations and having to use MATLAB) and making the computer do what you want than understanding the problem. The midterm/final were basically like his practice exams, which were the 4000 level linear regression exams (i'm guessing the two are about the same course saved for no derivations in the 2000 level). Totally doable, the avg for the midterm was maybe 80%-ish, meaning most people actually knew what the hell was going on. Haven't gotten final grade yet but not expecting it to be bad.\nI think the reason why this class was so good was that he genuinely cared. He wanted to know if we were absorbing anything and encouraged questions. At one point in the middle of the semester he made us write a mini-evaluation of what could be improved in the course and he definitely responded, showing us less-computer-saavy more R code and explaining how to interpret the outputs in class.\nBasically, Professor Feng is awesome and take this class cause it's pretty cool.\n\nWorkload:\npset (about) every week, 20%\nmidterm, 30%\nfinal, 50% (ouch, but he said if you do better on the final than the midterm he will make the final count 80% and eliminate the midterm grade)\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 26, 2011",
            "review_content": "\nProfessor Feng is not a very good professor. Granted, this past semester was his first time teaching STAT W1211, but his approach to the class was kind of ridiculous. Teaching is done mostly from the slides, with Calculus IV principles (namely double integrals) thrown around without explanation. The mathematical rigor of his class was much higher than that of other 1211 sections, with his midterm problems dealing mostly with variable manipulation (unlike most of our homework problems.) Brush up on summations, mathematical notation, and derivatives/integrals.\nMy biggest issue with this class, however, is the way he treats his students. He purports to be open to all feedback and appears to have a laidback attitude in class, but he is mildly condescending and not very helpful during office hours.\nI'm sure Prof. Feng will have the class better under control by next semester, so I wouldn't completely write him off. The class is open note and open book, which you can take advantage of if you're willing to put in the time, and grading is very fair, as he uses at 10*sqr(your score) transformation to reduce variance and bring lower scorers up and then curves your overall grade at the end of the year. 10-15% of the class receives solid As.\nWorkload:\nThe problem sets take a pretty long time; problem sets are 10 multi-part questions, and they take on average about 3-4 hours to finish.  \nMidterms and final are curved reasonably, but the material on them can be tricky. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 24, 2011",
            "review_content": "\nHe was a very dry lecturer.  Relied far too heavily on prepared PowerPoint slides that were mostly taken from the textbook.  The lectures didn't give much value beyond reading the book.  When he was asked questions (wasn't very often) he didn't have a good way of explaining things differently to make ideas clearer.  He was a bit better one-on-one, but if you want to really learn the material expect to go elsewhere.\nTests were open notes, open book, and he applied a generous curve to each midterm, so you had a great chance of doing well.\nHe gave review sheets/practice tests for both midterms, and if you paid attention you had a very good idea of exactly what was going to be on the tests.\nThe final exam had a small true/false section, a multiple-choice section, and five computational problem.  Four of the computational problems were directly from the practice exam (with different values) and the fifth was a worked example from the lecture slides.\n\nWorkload:\nOne problem set per week (1.5-2hrs).  Lowest grade dropped.\nTwo midterms.\nOne final.\n"
        }
    ]
}