{
    "prof_info": [
        {
            "prof_name": "Denny Partridge",
            "prof_id": 1127,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Acting Chekhov",
            "review_date": "May 24, 2005",
            "review_content": "\nDenny is very approachable and understanding. Shes accomodating to your desires in class and has great intentions to help you improve. However, she certainly wont precisly tell you what she wants from you. She tries to \"draw it out\" from you, in an almost socratic method of asking you questions. Sometimes its frustrating because you're not sure what to do. Also, this class takes up a LOT of time. Its a 3 hour class and then you have to meet with scene partners for 4 hours outside of class. Trying to coordinate that was a hassle and stressful and in addition to that you spend soooo much time on the material on your own.  Its a fun class but takes up a ton of time and effort-- shes also a tough grader so dont expect an A even though you worked your butt off--which is really frustrating. \nWorkload:\n4 Chekhov plays with different partners each time. You do one per week almost and revisit soem scenes which you liked at the end in a final presentation to whcih friends are invited. You can also work on a monologue for the final which is nice to have as an actor. \n"
        },
        {
            "course_name": "Theater and Society, theater lab",
            "review_date": "April 24, 2004",
            "review_content": "\nI have to admit, after taking theater and society with Denny, I became very apprehensive about my career as an actor and my success in the Barnard theater department.  She is a bit intimidating, but I soon learned after taking a smaller sized course with her, that her dominating presence is only due to the fact that she knows so much about what she does.  SHE IS AN AMAZING PROFESSOR.  I suggest to anyone who wishes to become a theater major, an actor, or even just wants to learn more about life in general--TAKE A CLASS WITH DENNY PARTRIDGE.  She knows what she's talking about.  She is a very intelligent and experienced woman, and while it is true that she tends to talk a lot about herself, it's ok because she is so interesting.  Even if you're not interested in theater and just need to fulfill a requirement or wish to take a class different from what you're used to, take one with Denny.   But beware: Denny believes everyone has the capability to become an amazing actor.  She pushes everyone really hard because she just assumes that everyone has it in them (which is a great feeling for a shy theater hopeful who doesn't expect to be taken seriously).  But if you're someone who expects to just breeze through her class without working, don't take a class with Denny.  She expects a lot from you and won't take any laziness. And watch out--her enthusiasm is contagious.  She has a passion for theater and life and social awareness that makes anyone who is in contact with her want to run out and do political theater--theater for a social purpose.  She really makes you think.\nTo those students who took theater and society with her as a first-semester freshman and are now turned off (or perhaps just scared???) of theater and acting, especially if that was your passion before college, DON'T AVOID HER!  TAKE MORE CLASSES WITH HER!  You will see that she deals much better with smaller classes and she is by far the best theater professor I have come into contact with so far.  You can learn so much from her.\nShe is easily accessible and ready to listen to concerns you might have.  Just be warned: she can be a tough critic but if you want a career in this field, that's what you have to learn to deal with, so get used to it.  Besides, her criticisms are always valid.\nMy conclusion?  DENNY PARTRIDGE IS ABSOLUTELY A FANTASTIC PROFESSOR!!!!!\nWorkload:\nTheater and Society: mangeable, various assigned readings, but don't NEED to read--although they are interesting if you like theater; a couple of plays, take home final....overall VERY MANAGEABLE\ntheater lab: scene work, research...interesting assignments, so not too hard\n"
        },
        {
            "course_name": "First Year Scene lab",
            "review_date": "January 13, 2004",
            "review_content": "\nI have to say Denny is terrifying at first. However, first impressions aside she is an amazing woman. I think that there is a lot to be learned from Denny and that is what makes her intimidating in part. Denny presides over the class with an iron fist and she will not tolerate any carelessness, keeping you on your toes all the time. I think whats  most important about Denny is that she really is passionate about what she does and she wants you to share in it. She shows compassion to the shyest of actors, as long as they are willing to put in effort.  There is a lot to be learned from this woman, do not be decieved by her coldness. \n\nWorkload:\nThe homework is minimal, 1 paper, but the rehersal schedule is intense for a 1 credit course. Hopefully the schools will remedy that for next year.\n"
        },
        {
            "course_name": "Theater and Society",
            "review_date": "December 09, 2003",
            "review_content": "\nFor all you wannabe Theater Majors, you'll think again after taking Theater and Society.  The class boasts its three teachers and its diverse content, but don't be fooled.  Denny Partridge teaches the first section of the course.  She picks her favorites, calls on them all class and then listens to herself ramble.  And ramble she does.  Somehow she thinks the class is impressed by her pretentious theater vocabularly.  In a typical class she will sit in front of the room and speak about form, action, and other words that sound theatrical, but really have little meaning. \nIf you are up for taking a class with a pretentious lady that teaches you little about theater or society, be my guest. \nWorkload:\nThe work load is not difficult.  2 plays are read during the semester, and every night there is some assigned reading.  A few papers, but don't expect to get any of Denny's back.\n"
        },
        {
            "course_name": "Rehearsal and Performance",
            "review_date": "May 11, 2003",
            "review_content": "\nIf you are looking for a positive acting, or directing experience in the Theatre Dept, look anywhere but to Denny Partridge.  She is an incapable, self-centered, and small minded director *CULPA CENSOR* Denny forces inapropriate and just plain BAD decisions on her students who are forced to comply or fail. Even if her wishes are followed to a 'T' she is just as likely to give a B- as an A. \nDenny will come to rehearsal one night, be disgusted with what she sees (regardless of the quality) mandate that sweeping changes be made and then return a week later to ask why the director has ruined a perfectly good show.  I was involved in one show that she forced the director to reconceive, rework, and reblock 4 times within a month.  While the performance was stronger for it (we all KNEW every aspect of the characters and the play at that point) it was emotionally  devastating and physically  draining for everyone even remotely involved in the production.  She is vindictive and uninspired at best in her own work and she is the only professor at this university that I have ever seen make multiple self-confident students cry.  She likes to play favorites, but be aware that her favorite today might not be her favorite tomorrow.  \nWorkload:\nRegular rehearsals for a theatrical show.   Be forewarned that Denny's regular changes to a show can and often do necessitate significant extra rehearsals. \nGrading is totally arbitrary. Hope that she is having a good day when she fills out the form.\n"
        },
        {
            "course_name": "Rehearsal and Performance, First-Year Scene Lab",
            "review_date": "December 16, 2002",
            "review_content": "\nThe comments of the student whose words precede my own are reflective of nothing but his or her own ineptitude and insecurity as an actor. Anyone who is serious about acting will find have an amazing experience working about Denny. Her comments are insightful, her rehearsal process is incredibly organic and natural, and her perspective on theater as a whole combines some of the best elements of the various acting techniques offered to performers. All she demands from you is commitment. If you're committed to acting, you'll have an amazing experience with Denny; but if you're one of those whiney self-aggrandizing types, stick to academia.\n"
        },
        {
            "course_name": "Rehearsal and Performance",
            "review_date": "May 19, 2002",
            "review_content": "\nSomeone should drop a house on this woman. She is EVIL!! E-VIL! I've never seen a professor work so hard at alienating and devastating students. Not only is she completely unprofessional, but her work is often devoid of any good ideas. If you like cliches and mean-spirited direction, than Professor Partridge is the person for you. Rather than giving direction that helps the actors/designers, she tries to ruin every person's confidence. Here's the philosophy of the Barnard/Columbia undergraduate theatre department: Break the student's spirit and then you can compel them to do the most awful theatre imaginable. I'm not kidding. There's a reason that people come running, kicking, and screaming from this department. Ask around. And I have to say, Denny is the ring leader. Regardless of the class or production you have with the Evil One, you will soon discover that she is much less interested in people's work than she is in playing power games with students. In all of my years in the theatre and all of the productions with which I have been involved, I have never had to deal with more personal attacks and puerile behavior. Please trust the advice of a theatre major; I had to learn this lesson several times over. There are SO MANY problems with this abysmal department, but Denny is at the center of them all. If you are considering a major in theatre or even just a production or a class, just work with King's Crown or BCMT or CMTS or BTE and forget about Denny and the Department from Hell. Go on auditions in the City or at the graduate school. Work with people who are TRULY avant garde and save yourself the stress and heartache.\nWorkload:\nIt's not the workload that'll get you. It's Denny herself. For Rehearsal and Performance, the workload is about what you'd expect in rehearsing and performing any production; however, Denny's attitude and hateful actions are more detrimentalto your well-being than 1,000 pages of reading a night!\n"
        }
    ]
}