{
    "prof_info": [
        {
            "prof_name": "Valeria Tsygankova",
            "prof_id": 13073,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "August 28, 2015",
            "review_content": "\nMs. Tsygankova seems to be a very nice person, and in class, she basically tells everyone that they have a good point when they contribute ideas during discussion. Now this is definitely very encouraging (better than teachers who shut your ideas down), but her persona seems to be totally different when she's writing to you - whether it's through email, feedback, or even in the syllabus. She's a friendly person and easy to talk to, but just a lot harsher in her written comments, so be prepared for that. \nThis isn't to say that she's an unfair grader - I think she's definitely strict with her grading, and she expects you to get through some very dense readings, but I don't think her reasoning for her grades are necessarily unjustified. However, I did find it difficult sometimes to understand what exactly she wanted from me, or what she wanted me to do to fix my writing. She would point out that I was doing something wrong, but I often found myself wishing she could give me more advice on how to fix it.\nSome papers that she made us read had interesting topics, but the papers we had to write for U-Writing were a pain-in-the-butt (not really her fault though). Ms. Tsygankova's not a bad teacher to have - she's not life-changing or anything, but you won't die if you have her. \nWorkload:\nBe prepared for dense readings that you will probably never make sense of, and lots and lots of writing. \n"
        },
        {
            "course_name": "UWriting",
            "review_date": "April 08, 2015",
            "review_content": "\nValeria provides very helpful constructive criticism, but is a harsh grader. Most of the people in our UWriting American Studies class complained that she didn't tend to give out As. Basically everyone I know got some form of a B, which I suppose is fair, but a little annoying when a lot of your fellow freshmen in UWriting talk about how they do no work and get As. This class has a lot of work, and I believe Valeria states in her syllabus that if you get an A in the class it means your work is worthy of being published.\nWorkload:\nDaily HW (ungraded but mandatory), 4 essays. LOTS of reading - more than most of my other friends in UWriting seemed to have\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 08, 2015",
            "review_content": "\nProfessor Tsygankova is an amazing teacher and a fair grader. She will put in a lot of effort into helping you with your writing and is very responsive on email. She will read all of your homeworks, but they are not graded.\nIn terms of grading, she offers an extra credit assignment -- attending and writing a short essay on any presentation given by faculty at Columbia. She also offers a revision of Progression 1 or 2, for a completely new grade. If you struggle at first in her class, don't worry because she will do everything she can to improve your writing and give you a fair grade in the end.\nShe clearly cares a lot about the course and will try and encourage discussion, but at times has difficulty encouraging seminar discussion, but this may also be because I took a section that started at 8:40 in the morning.\nShe also has a great sense of humor and will bring some sweets/pastries after each progression!\nWorkload:\nUngraded HW due each class. 4 essays typical of UWriting.\n"
        }
    ]
}