{
    "prof_info": [
        {
            "prof_name": "Ayten Gundogdu",
            "prof_id": 3595,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Political Theory",
            "review_date": "November 21, 2009",
            "review_content": "\n\nThis is a teacher is one person you will want to avoid... The class is supposed to be awesome but the professor is just horrible at teaching, her lectures are dry and boring. I am a poliSci student who loves Political Theory and political philosophy, and in fact I read philosophy books on my own time because I love it. However, Mrs. Gundogdu has turned this subject into something i want to avoid forever, and quit possibly I may never read the work of my beloved philosophers, just because of the agony I have to endure every minute I am sitting in this class. \nLet me make it clear, I have no problem with hard classes, but this class is not hard, it just does not make sense. The assignments are unclear and she does not take the time to clearly explains what we are suppose to write about.\nTo be honest, I feel bad for saying this but TA's in their 1 hour writing sessions help me understand the material better than she does in class. And since we are talking about the TAs, you must know that they have absolutely no mercy in grading the papers. They expect you to know the material and write good enough papers as if the class lectures actually make sense. Unfortunately the lectures do not make sense. \n\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "November 14, 2009",
            "review_content": "\n\nI feel badly doing this, but I do not know one person who actually likes this class. Everyone complains. Her lectures are unclear, and the TAs are incredibly harsh graders on the in-class writing assignments. (Essentially there are 10 surprise in class assignments). There are only 3 possible grades for these assignments, 5/15, 10/15, 15/15. I don't care if you've done the reading and feel like you understand everything asked of you, it is damn dear impossible to get a 15. Those grades will accumulate faster than you think. She also gives a lot of reading--most days are manageable (30-40 pages of reading)--but she also assigns reading the same day as essays. Her writing prompts make no sense, and she'll make up a lot of words during class. She actually speaks English quite well, it's just that she doesn't acknowledge that she makes mistakes and new words... I've spent a good 15 minutes simply deciphering her essay prompts. She's boring and uninspiring. I took this class hoping to really get some insight, but she manages to turn interesting reading into the worse hour+ in your life. This class ruins my day, everyday. Nice thing is that there is no midterm, nor no final.\n\n\nWorkload:\n10 pop-quiz in-class writing assignments (Total 150 points/15%) (This is your attendance/participation grade)\n2 smaller papers (150 pts/15%; 200 pts/20%)\n2 \"persuasive\" essays (250 pts/ 25% each)\n\n\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "December 23, 2008",
            "review_content": "\n\nThis is a great class to take if you're looking for an introduction to political science. The assignments increase in point value so you can get used to the style of writing and thought process. Professor has trouble getting people to participate in class and the conversations were dominated by a few overly enthusiastic students. She understands that not everyone feels comfortable talking in class therefore the class participation grade is composed of ten in class writing assignments on random days... you just answer a short question about the reading...really not hard at all. The other 50 points come from attending the 5 in class discussions on the days the papers are due. It is possible to get 20 extra bonus points because she gives two extra in class writing assignments. The reading is somewhat fast paced but manageable. The TA's hold writing sessions for each of the papers and grade them. The persuasive essays were somewhat hard but doable because there is not a specific correct answer to the question you are addressing. I definitely recommend this class as an introduction to political science and as a manageable way to get a good grade. \n\n\nWorkload:\n1st microtheme: 100 points (10 %)\n2nd microtheme: 150 points (15 %)\n3rd microtheme: 150 points (15 %)\n1st persuasive essay: 200 points (20 %)\n2nd persuasive essay: 250 points (25 %)\nAttendance and participation: 150 points (15 %)\n -- it is possible to get 20 extra bonus points if you don't miss a notecard. \n\n"
        }
    ]
}