{
    "prof_info": [
        {
            "prof_name": "Audra Simpson",
            "prof_id": 9411,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 19, 2017",
            "review_content": "\nProfessor Simpson is great. Really cares about the class, which, by the way, everyone should take. She's funny and engaging, and really unpacks the texts if you don't understand them. Readings are pretty light - we read a couple books that you can skim, but are interesting! She wants to make the course accessible to anyone, and accomplishes this quite well. Assignments are easy, the midterm and final (both take-home!) take you 3 hours tops if you took notes or did the readings. Really great class. The only thing that was somewhat difficult was the discussion section, which kept you on the ball with reading. Great TAs, though! They all understood that it was an intro class and were very very lenient with grades - I'm pretty sure everyone got good grades.\nSeriously, she should have a gold nugget, because I WANTED to pay attention in class. \nWorkload:\nLight-medium INTERESTING readings, one movie response, one 4 page ethnography (you sit somewhere for an hour and write about it), one kinship diagram (map out your family), and take-home midterm and final.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 05, 2017",
            "review_content": "\nAudra Simpson is clearly a very knowledgeable professor, but unfortunately her class was an absolute bore to take.  For every class, she writes down her lecture word for word and then just reads off of it.  Sitting through the class felt like a waste of my time.  I would suggest taking this class if you are new to anthropology, as I do think it introduces some core concepts in a easy and slow way.  If you do the readings, going to lecture is really not necessary.\nWorkload:\nReadings before every class--pretty long, but very interesting. In addition, a discussion section is required, and you must submit a discussion question before every section.\n"
        },
        {
            "course_name": "Native America",
            "review_date": "January 18, 2017",
            "review_content": "\nProfessor Simpson was one of the best professors I've had at Columbia by far. She really is completed invested in her research on Native Americans around the world (most specifically in the US and Canada though), but that does not mean that she doesn't bring 110% to class every day. You can really tell how important it is to her that we knew this history and its implications in today's world. Though this class is about Native Americans, we talked about indigineity a lot as a concept which I think was her way of preparing us to apply what we learned to other indigenous groups that we did not get the chance to study. If you did all the readings, your workload would be pretty heavy...the class only meets once a week so if you're good at time management you'll be able to complete them, which I'd recommend because the readings are fascinating and so informative. However, it is not completely necessary to do all the readings and she won't quiz you on them.  As the class goes on, however, you'll probably feel inclined to do more of the readings because you'll begin to realize how important it is for you to have this information. Professor Simpson presents her lectures in a way that makes you understand the gravity of what you're learning and its importance for the future of Native Americans.\nBesides all that, Professor Simpson is incredibly hilarious. She was always cracking jokes to lighten the mood (the content can be difficult/heavy), and her humor was the kind that startles you at first, but in a way that's really appreciated. Overall, she's the absolute best, and I'd give her 100 gold nuggets if I could.\nWorkload:\nAn Entrance and Exit Report (each 4-5 pages), 2 Reading Respones from the past week's unit (6-8 pages), and a final paper of the topic of your choice (10-12 pages). Heavy readings every week (100-200 pages)\n"
        },
        {
            "course_name": "Native America",
            "review_date": "January 03, 2015",
            "review_content": "\nAudra is an engaging professor and a very funny individual. This seminar-ish class had about 40 students in it and was a mix of her lectures and informal discussions among students. I was always excited to go to class, and learned a lot about the history of indigenous peoples in the U.S. and settler colonialism. Audra made an effort to learn everyone's name, and isn't afraid to poke fun at students and make jokes about the topics we're covering.\nTopics for specific weeks included \"Land as relative, land as property,\" \"How expectations became Indians,\" \"How civilizations require representations,\" and \"turning the century and \"urbanization\"/relocation.\" The topics and readings progress mostly chronologically. The readings are in general interesting, but there are a few dry historical readings that you might just want to skim. Her lectures are a little disjointed and sometimes a bit repetitive as she is excited about many different things, but they're always very interesting and engaging.\nReadings are not really \"required,\" per se. She will ask the class about the readings and they will be pretty relevant to her lectures, but you won't be personally quizzed on them and there aren't any midterms or finals that test you on them. The two reading responses (each worth 20% of the grade and 6-8 pages, as is the final paper that is 10-12 pages) come from each half of the class, so you should just read all of the readings for at least two weeks of the semester. That said, I'd read the ones you find interesting, because she has some good stuff on the syllabus! Your final paper is on a topic of your choice, and Audra mentions several times per class possible topics for your final paper.\nMy only complaint with this class would be that the TA (Margeaux Kristjansson) seemed to do the bulk of the grading. While she is more than competent, very nice, and very, very willing to meet with students and held lots of office hours, and while it seemed like Audra did look over some of the essays, I think most people would want their professor to actually provide feedback on most assignments.\nOverall, DEFINITELY TAKE THIS CLASS if you are interested at all in Native Americans, indigeneity, the U.S.' Indian policy over time, or fulfilling your global core requirement. On a week-to-week basis there isn't that much work, and the two days we watched movies in class were pretty great, as were the pizza and cupcakes in class.\nWorkload:\nEntrance report due second week (5%); exit report due at the end (5%); two 6-8 page reader responses (20% each); final paper (20%); participation and attendance (30%).\n"
        }
    ]
}