{
    "prof_info": [
        {
            "prof_name": "Nadia Abu-El-Haj",
            "prof_id": 1663,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Race and Sex in Science and Social Practice",
            "review_date": "June 12, 2013",
            "review_content": "\nProfessor Abu-El-Haj is phenomenal. She is incredibly knowledgeable and articulate. She comes to class incredibly prepared to thaw out incredibly complex theory. She is also incredibly encouraging of group discussion and asks for questions on the text more than anything. I'm not sure how grading was on average, but I definitely thought it was fair. I ended up getting an A in the class. I felt pretty passionate about the readings but did not always end up doing them completely because I was taking 20.5 credits. The syllabus is crucial for anyone who is interested in going into medicine or as an anthropology major, Science and Technology Studies. It provides a really strong foundation to genealogies of racial and sexual thought in science. Really loved this class, but mostly I really appreciated Nadia Abu-El-Haj. Considering the scope of the texts, the class could have gone terribly wrong. She is pretty incredible!\nWorkload:\n1 Midterm Take-Home Paper (6-8 pages)\n2 Take-Home Papers for the Final (6-8 pages each)\n1 dense book/week\nCome to class with 3 questions\nShe definitely took her time grading the essays but provided really helpful criticism. The midterms were handed back in April. They were the first grade we got in the semester... Until I got the paper back, I didn't have an idea whether I had a C or an A in the class. That was pretty scary....not gonna lie. \n"
        },
        {
            "course_name": "Anthropology and Science",
            "review_date": "March 31, 2011",
            "review_content": "\nIf you get a chance to take a class with Nadia, I would strongly recommend it. She's pretty damn brilliant, funny, and down to earth. When she lectures, she does a great job breaking down texts and explaining complex arguments. She does a decent job stimulating discussion, tries to get students engaged and asking questions. The syllabus for her anthro and science class is spectacular if you're interested in questions around knowledge production, histories of knowledge and the possibilities of knowing, philosophy and sociology of science. Moreover, she has some background in political theory, so she is able to do a great job linking debates around science and knowledge to questions concerning power and politics. \n\nWorkload:\nFor Anthro and Science, one response paper due every other week, generally a book's worth of reading per week (can be dense at times), one midterm (2 essays, each 5-7 pages) and one final on a topic of your choice (12-15 pages)\nFor anthro theory II, reading is much lighter, similar midterm and final\n"
        },
        {
            "course_name": "Anthropology and Science",
            "review_date": "January 07, 2011",
            "review_content": "\nI found this class boring but tolerable. Class meets once a week generally consists of her giving a short summary of the readings and a discussion. You will do fairly well if you can BS a comment per class and skim the readings. One book a week is expected and some of them are fairly dense--be warned if you're not used to thick anthropology-like books. Definitely don't recommend if you want a good learning experience, but if you just need it to fulfill a GER go for it!\nWorkload:\nOne response paper due every other week, one heavy reading per week, one midterm (2 essays, each 5-7 pages) and one final on a topic of your choice (12-15 pages, and you can pick your own books so very BS-able).\n"
        },
        {
            "course_name": "Anthropological Theory II",
            "review_date": "January 20, 2009",
            "review_content": "\nNadia is by far one of the best teachers I've ever had. Yes, she is frazzled and scatterbrained and never replies to e-mails, but I learned more in this course alone than in an entire two years of Anthro classes. She's the kind of professor who teaches you about much more than just the subject matter of the course- so much of what I learned were general critical thinking/reading skills. Unlike so many professors she won't let you off the hook when you make an easy/lazy point in class- she'll actually push you to think it through and consider its ramifications. Don't be fooled by the whole drama about her research and some people's bigoted comments about her: she is a truly exceptional professor. \nWorkload:\nFour essays scattered throughout the semester (4 pages each) and a final 6-8 page paper. Fairly light, and she's not a harsh grader. \n"
        },
        {
            "course_name": "History and Memory",
            "review_date": "December 18, 2008",
            "review_content": "\nI think Prof. Abu El-Haj is an extremely pretentious and self-entitled person. She cancelled class 3 times in the semster for various reasons and then had a makeup in the finals week and expected all of us to show up! She also has an agenda which she does not do a great job at hiding, and had it not been for the anthropology dept. of columbia (which by the way is a national joke!), she would not have been teaching.\nSince she is the darling of anthropology dept. (given her anti-Zionist scholarship), she has been simultaneously made the chair of barnard and (inexplicably) the DGS of columbia's graduate program. She also plays favorites with her students (mostly students who signed her petition for tenure get a free ride, though she claims she never reads stuff on herself online, she seems to know everything about it!). She will also make sure that you know that her father worked for UN, and that her family owns some hotel in the middle fo nowhere, and that she was at Harvard and Chicago (conveniently missing out on Duke, from where she got her PhD). In my opinion, this woman has no credentials to be in these prestigious positions and also clearly cannot handle the requirements of the jobs (she never responds to emails etc). \nI wonder why Columbia is hell-bent on flusing its anthro. dept. down the toilet?\nI fully expect her crony students to protest here, but as you can see from the other reviews, it is all a biased and one-sided story. I don't know why other students don't complain about her lack of availability. self-entitlement, lack of professionalism, etc etc.\n"
        },
        {
            "course_name": "Race and Sex in Science and Social Practice",
            "review_date": "August 24, 2008",
            "review_content": "\nA completely fascinating and very challenging class.  I would recommend this class to anyone.  Most of it is about race theory, all of it is interesting.  Professor Abu-El-Haj makes even the most tedious theories understandable.  She was fun and nice, though maybe a little busy and overwhelmed.\nWorkload:\nFive 2-pg response papers, 1 5-pg final paper.  This class isn't easy--but it's worthwhile.\n"
        },
        {
            "course_name": "Theories of Culture",
            "review_date": "June 22, 2006",
            "review_content": "\nThis class is required for Barnard anthro majors so there's no use in telling you to avoid it.  But wouldn't that be nice?  The class involved reading excerpts from major anthro theorists, most of which you've probably read before (Boas, Malinowski, Said, Foucault, etc), and then spending class summarizing the readings.  And that's all.  There's no actual discussion or lectures or new info--it's just: \"Did anyone understand anything Geertz said?  Anyone??  Bueller??\"  Prof Abu-el-Haj is very nice, smart, and approachable.  Despite this, the class remained boring, entirely disjointed, full of dumb questions, and basically a mediocre and surface-level survey of contemporary anthro.  Just... dull.\nWorkload:\nRidiculously easy to get an A.  Not much reading, and most of it you can skim if you go to lectures.  \"The Politics of Piety\" was very interesting though -- definitely read that even if you somehow get out of this course...\n"
        },
        {
            "course_name": "Theories of Culture",
            "review_date": "May 22, 2006",
            "review_content": "\nProf. Abu El-Haj is a fun, loving professor. She can be awkward and frazzled at times, but over all, she is quite engaging and really cares about your opinion on the readings. She is also approachable. The class was really interesting - we read Boas, Malinowski, Foucault, Sahlins, Said, Geertz (and more) - all the top names in Anthropological theory. It was a great class, I recommend it.\nWorkload:\nA lot of reading - about 100 pages per week. Unfortunately you don't have a choice if you're an Anthro. major at Barnard. Definately do the readings!! One in class midterm (consisting of 2 essays, you get a choice) and one take home final (2, 3-4 page papers, you get a choice).\n"
        },
        {
            "course_name": "Anthropology and Science",
            "review_date": "August 24, 2004",
            "review_content": "\nProfessor Abu-El-Haj certainly is brilliant.  I found this to be one of the most engaging courses I took during my time at Columbia.  Being the only non anthro major in the class was occasionally challenging but the extra background reading/research was worth it.  She's a tough grader, but class discussions are great.  Readings are by and large wonderful too if quite heavy.\nIf you're looking for an amazing class though, and aren't afriad of a little work, take it!  \nWorkload:\n1 book per week to read, weekly mini papers, midterm paper, final paper (20ish pages)\n"
        },
        {
            "course_name": "History and Memory",
            "review_date": "January 17, 2004",
            "review_content": "\nProf. Abu-El-Haj is intelligent, nice, and really funny; she runs discussions very well, gives good background and explainations on the material, and actually cares about how you do in the class.  She also gives good feedback on writing, which she is fairly picky about: she grades disorganized essays pretty harshly, although she warns you about that.  The course itself was pretty eclectic, and very confusing at times, but a lot of the readings were great (some were WAY to dense and long).\nWorkload:\n2 essays, both ~12 pages.  Occasionally heavy reading, ranging from easy (novels) to incredibly complicated (Andreas Huyssen).  Tough but fair grading of essays, and fair final grading which reflects class participation.\n"
        },
        {
            "course_name": "Race and Sex in Science and Social Practice",
            "review_date": "August 31, 2003",
            "review_content": "\nI'd recommend this course to everyone; it revolutionized my thinking on the subject matter on ways I never could have expected, and the subject matter is a constant part of our everyday lives.  Teaches about the theories and histories of race and sex, how they have been studied and described by scientists and lived by individuals, and how science itself is conceived, performed, and affects social policy, ideology and private lives.  The readings are hit-or-miss; some are fasinating, some will change the way you think forever, and some are so poorly-written and tedious that they truly aren't worth your time (and I usually read everything I'm assigned.)  Prof. El-Haj is enthusiastic and always interesting to listen to.  She assumes a high level of familiarity with both anthropological theory and its jargon, which at times makes it seem (to the uninitiated) like she's speaking a different language.  You pick it up quickly, though.  She leads discussions well, tying together all sorts of facts and ideas in ways that otherwise would never be apparent, and makes it all come clear (as clear as these issues can ever be) in the end.  This is not a discussion class where you can afford to not do the reading--she demands cogent participation and isn't afraid to criticize (though not berate) a student's lack of preparation.  Aside from sometimes assigning too much horrible reading, her other significant failing is a certain amount of narrow-mindedness; she is certain she knows the correct answer to all the complicated questions this course raises, and unlike many of my professors, is not open to a well-argued interpretation if it differs from her own.  Nevertheless, she is neither rude nor punishing to those who disagree; it may be harder, but they can still get whatever grade they want.\nPS, I particularly recommend this course to anyone pursuing studies or careers in the sciences.  It affords a critical perspective on them.\nWorkload:\nHeavy reading, and a lot of it is very dense and slow.  Discussion is an important part of the grade and she expects her students to have thoroughly read and processed the material.  Two 8-10 page papers (no additional research required) that are graded hard.\n"
        },
        {
            "course_name": "Theories of Culture",
            "review_date": "June 01, 2003",
            "review_content": "\nProfessor Abu El-Haj is a great teacher and a brilliant person.  She is down-to-earth, enthusiastic, and funny.  Although she can go a bit fast, the challenge really forces you to think critically and learn a lot.  I really enjoyed this class, and she managed to make even the dullest of readings palatable.\nWorkload:\nMidterm and Final Papers - LONG assignments, fairly difficult.  She's a fair grader though.\n"
        }
    ]
}