{
    "prof_info": [
        {
            "prof_name": "Caleb Scharf",
            "prof_id": 1520,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 21, 2013",
            "review_content": "\nI was lucky enough to have Caleb Scharf for Frontiers of Science this semester.\nCaleb Scharf is a really awesome guy.  He's very understanding, and does not grade harshly.  Homeworks are completion, which was fantastic.  He understands the Frontiers is not always the most fun/interesting class- he does his best to make his discussion section bearable.  \nNo complaints about the class.  I had to miss for a medical reason in the middle of the year, and he was fine with an explanation.  He responds to emails quickly and does his best to answer any questions.\nHe is the Director of Astrobiology at Columbia, which I'm pretty sure means that he studies aliens.\nWorkload:\nLecture, homeworks, midterm, final\n"
        },
        {
            "course_name": "Extrasolar Planets & Astrobiology",
            "review_date": "May 16, 2010",
            "review_content": "\nCaleb is fantastic.  Honestly, he is one of the best instructors that I have had. He really cares about the class and the material and incorporates recent developments in the field into his lectures.  I definitely recommend this class.  I definitely have a very different perspective about astrobiology and exoplanets than I had going into the course, and the science behind detecting these planets is really quite cool.  You don't really need an astronomy background to take the class--everything is built from first principles.  You pretty much just need calculus and freshman physics. \nWorkload:\nLight.  Take home midterm and final, and a handful of straightforward problem sets.  Leniently graded.\n"
        },
        {
            "course_name": "Extrasolar Planets & Astrobiology",
            "review_date": "April 27, 2006",
            "review_content": "\nBest. Class. Ever.  \nThis is one of the best classes I have ever taken.  Not only is the subject material absolutely engaging, but Professor Scharf is a brilliant and inspired astronomer, whom other instructors should look to as an example to be followed. \nThe course material, which is basically astrophysics applied to the rising field of astrobiology and both new and ancient questions of Life in the Universe, is incredibly unique.  Only a handful of universities in the nation have classes that teach the new subject, and as far as I know, none of them teach the material with as quantitative and scientific a viewpoint as Professor Scharf.  \nEvery class usually begins with some announcements about discoveries or events from the past few days or week that dramatically shape the course material, which is changing nearly every day.  It was really quite amazing to study and to examine the material that appears in the news every day.  Go to CNN.com and check their \"Science and Space\" news - much of that relates to the current quest to find ExtraSolar Planets, and that's what you'll be studying in class! \nI would absolutely recommend this class to anyone even remotely interested in astronomy, biology, or modern science in general.  The pre-requisite of calculus-based physics is definitely very helpful, but not essential, as Scharf tends to explain everything very extensively along the way.  \nHe is always availiable to help out, he responds to every e-mail with great efficiency, and his lectures are truly fascinating.  No one falls asleep, and I for one, was riveted by the second part of the class, where you begin to discuss the heart of astrobiology. \nThe beginning of the class can maybe be a bit dull if you're not into astrophysics, as you do some quantitative mathematics on gas cloud collapse, and some orbital dynamics, but once you learn the qualitative aspects of them, it becomes much, much clearer to you, and you walk away feeling like you could teach the material to someone else, which is perhaps the epitome of good teaching... as the proverb goes... \nProfessor Scharf is a very good lecturer, sometimes prone to some sporadic humor, which is always entertaining, he does, as the previous reviewer said, have a very intense pace, and doesn't stop the lecture usually at all during the 75 minute period.  But honestly, I never noticed - the material is really that interesting if you get into it, and you will.  \nThere is no textbook, and the readings come from Scientific American, some astrophysics texts, and some journal articles.  The lack of a textbook on the subject should give you an idea of how modern the subject material really is, and how subject to change it is. \nIf you have to take a class, you're not afraid of a little physics, and you really would like to know about the issues presented to us by the discoveries of other worlds, and the possibility of life beyond the earth, I absolutely recommend this class to everyone.  I'm sure you won't regret it.  \nWorkload:\nRoughly bi-weekly problem sets.  They can be a bit tricky, usually requiring some numerical manipulation, but not particularly difficult mathematics.  The MidTerm was a supremely interesting and (yes) fun activity which allowed you to use a piece of astrophysics software to look for extrasolar planets.  It was not very difficult, but did take a long time to understand thoroughly.  In fact, Professor Scharf believed the class might have discovered an anomaly in the data, suggesting the class found a planet that had not been discovered before!  That's the nature of the subject material, and I'm still not sure what happened with that data, which I believe was sent to the discoverers of the planets for checking.  I have yet to take the final, but it's open notes, and will certainly be, if not entertaining, then painless at least.  \n"
        },
        {
            "course_name": "Extrasolar Planets & Astrobiology",
            "review_date": "May 16, 2004",
            "review_content": "\nCaleb Scharf is an excellent teacher. The class is cutting edge, so there is no well-developed syllabus for him to follow. He made up his own syllabus and lectures essentially from current research papers. Caleb is a great lecturer and is extremely funny. He tries to distill only the most relevant math and physics from the material so that it is actually providing insight into the material and not complicating it. If you're a math or physics major this kind of lecture style, only putting up relevant physics without derivation, might put you off at first, but once you accept it you realize it really makes your life easier. \nMy favorite aspect of the class was the scientific process. Because a lot of the material is new, there is not necessarily an accepted scientific doctrine, so the evidence supporting and rejecting different theories is weighed before your eyes. Compare this to your physics class where there has been a \"correct\" interpretation for at least 80 years. I think the process of scientific discovery is exciting and usually undergrads don't get the chance to see it unfold.\nWorkload:\n5 problem sets, a take-home midterm, and an in class final. The problem sets ranged from trivial to a modest amount of work, but over all not too much. The midterm was sort of an expanded problem set. The final gave the choice of 4 of 8 questions, some of which were very similar to the homeworks, but it took the full 3 hour final period. The questions throughout the semester usually asked you to expand on a point that was made in lecture.\n"
        },
        {
            "course_name": "Stellar Structure and Evolution",
            "review_date": "March 04, 2003",
            "review_content": "\nProf. Scharf is a very nice and understanding young Brit who didn't bore us to tears.  He knew his stuff and kept lecture moving along.  He paces non-stop but as long as you can tolerate that, the class is no problem.  We did talk about some interesting problems and theories in astrophysics and he did his best to make sure that everyone in the class understood.\nWorkload:\nBi-weekly homeworks, midterm, final.  None were too difficult and the tests were generously curved.\n"
        }
    ]
}