{
    "prof_info": [
        {
            "prof_name": "Simona Vaidean",
            "prof_id": 3415,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced German II",
            "review_date": "April 20, 2016",
            "review_content": "\nSimona is an extremely nice, laid back and personable professor.  As far as I know, my Advanced German II class was the first Advanced German II class that she taught at Columbia (I think she usually teaches elementary and intermediate students).  My experience in her class has been excellent.  In a class that's centered mostly around discussion and readings, Simona comes up with thought-provoking questions and interesting ways to explore materials.  You can't go wrong by taking a class with Simona.\nWorkload:\nThe workload in this class was relatively light, weekly reading assignments that aren't too long, 1 individual presentation, 1 group project at the end of the semester, and 2-3 350-word essays throughout the semester.  Most of class time is spent in discussion about materials that you read for homework.\n"
        },
        {
            "course_name": "Accelerated Elementary German GERM 1125",
            "review_date": "April 27, 2015",
            "review_content": "\nI cannot say enough good things about Simona Vaidean, I've never had such an amazing professor. She came in every day with a smile on her face, even if she had a hectic morning with her two kids. The students in our class contributed to this as well, but she created a friendly and fun environment in which to learn, something invaluable when the class meets for 2 hours, 4 days a week.\nShe is very kind, understanding, and genuinely cares about her students. She knows that we are trying to learn a ton in a very short time, so she makes it easier on us whenever possible. I was deliberating between taking accelerated versus elementary I, but when I saw the previous post about how great Simona was, I chose to take her class. I am so happy that I did. It was a pleasure to have her as a professor, and I strongly recommend you take a class with her if you have the chance.\nWorkload:\nYou're learning two semesters of German in one, so it's a decent amount. Weekly tests that are not at all hard if you pay attention in class. Homework every night that's collected the next day. They're mostly just a few exercises that teach you new grammar concepts, which you'll learn in more detail in class.\n"
        },
        {
            "course_name": "Elementary German I",
            "review_date": "May 05, 2011",
            "review_content": "\nTHE BEST GERMAN PROFESSOR! She is so understanding and realizes that everyone in the class is tied up in so many other things. She is very clear and distinct with what you have to study for the exams and for the writing exercises. I feel like she has prepped the class well for the exam i.e. she gave us the oral presentations well in advance so that we could have plenty of time to write them and memorize them. The tests are fairly easy and as long as you pay attention in class and are engaged it is easy to get an A. Take Simona if you have a strong desire to learn German. If you don't then she can easily recognize this and she therefore calls on you more so that you are embarrassed. If you love the language and at least give it a shot even though you may fail good things will be reflected back to you from her.\nWorkload:\nTests every other week along with papers due every other week. No midterm. Final\n"
        },
        {
            "course_name": "Intermediate German I",
            "review_date": "December 16, 2008",
            "review_content": "\nSimona is an excellent professor. She's Romanian, but her German accent is perfect. The class focuses largely on reading comprehension and writing, but grammar and speaking also play an important role. The class is conducted entirely in German, which was helpful in improving listening comprehension. Simona is very knowledgeable and always eager to help her students learn important concepts; it was commonplace for one of us to ask her to go over a grammatical concept (which she would do) and then the next class she would have a concise review sheet of the concept that she would hand out to everyone. She is a very generous grader and she assigns very little work in comparison to the other sections. Overall, I would highly recommend her and would definitely take another course with her.\nWorkload:\nNightly homework assignments (~20min), one vocabulary list at the end of each chapter, two essays (there were supposed to be three but she cancelled one), one presentation, end-of-semester portfolio.\n"
        },
        {
            "course_name": "German V1101",
            "review_date": "March 26, 2008",
            "review_content": "\nSimona is the best. She's fun and cute and she makes the whole process of learning German really easy. She is also perhaps the most generous grader of all time. She's just an all around great lady. If you see that she is teaching 1101 or 1102 TAKE THAT CLASS!!!\nWorkload:\nStandard.\n"
        }
    ]
}