{
    "prof_info": [
        {
            "prof_name": "Andrew Smyth",
            "prof_id": 1531,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Dynamics and Vibrations",
            "review_date": "July 07, 2011",
            "review_content": "\nI had Professor Smyth Fall 2010 for D & V.  This was one of the hardest classes SEAS has put me through.  I'm sure Smyth is a great person, but when it comes to teaching, there is a bit of a disconnect.  He has numerous degrees and is obviously really smart. Really really really smart, I would even say.  Hence, when you ask a question, he either doesn't know what your asking or completely misunderstands your confusion for a far more complex question.  Be prepared to learn from your notes.  Smyth's notes are clear and concise.  I would actively ask questions in class, but a momentary enlightenment would be completely diminished by the helplessness associated for studying for the exams.  I was so grateful for partial credit!\nHomeworks are usually comprised of 3 questions... doable, impossible, followed by smack me in the face. \nOh, and the last part of class doesn't have a text book associated with it. I got through vibrations from applied math knowledge of waves and crossed my fingers in applying them. \nI learned a lot in Smyth's class.  But, it was painful.\nMy advice is to hit the ground not running, but sprinting like there is a polar bear after you.\nThe recommended text books proved to be pivotal. Get them.\nGood luck. \nWorkload:\n3 midterms\n1 final (majority of grade)\nhomeworks weekly or every week-and-a-half \n"
        },
        {
            "course_name": "Structural Design",
            "review_date": "April 16, 2003",
            "review_content": "\n\"Knows his stuff\" is almost an irrelevant comment to make about a professor in this department, as all of them do. What many of them lack is adequate delivery of the material, material that generally isn't particularly dense, but can be made so by certain professors.\nAndrew Smyth knows his stuff. And he gives you the theory, all the derivations, everything. But he doesn't like to give examples in class, which makes homework a bit shocking at times, as you have to really adjust yourself to translating the question into his terms. That said, the material is not that difficult, and many people are fond of the professor.\nWorkload:\nWeekly homework, that is sometimes dense and sometimes really isn't.\n"
        },
        {
            "course_name": "Dynamics and Vibrations",
            "review_date": "March 28, 2003",
            "review_content": "\nProfessor Smyth might not be one to evoke undying interest in his subject towards students, but his notes are concise and clear. This is a man who will not believe that the world is round until he has proven it in closed form, so don't expect any fluffy explanations and numerical examples; rather, expect strictly mathematical derivations for every and any concept presented in class. His own words pretty much wrap it up, \"Numbers just get in the way of a good lecture.\" Smyth does have a bad habit of giving attrocious homework problems that in his mind just \"expand\" on the material taught in class, but you'll get used to it. His exams expect your mastery of all material presented in written responses, numerical problems, and proofs; the exams are challenging but graded fairly. One suggestion: do not leave your studying to the last minute, because there isn't much room for pity in this class' grading system: the average is a B-. Professor Smyth is the type that is somewhat miffed if you just barge into his office looking for help, so be sure to make an appointment well in advance.\nWorkload:\nRelatively High with weekly problem sets of 2-5 in-depth problems. One midterm, and one final, both graded strictly but fairly.\n"
        }
    ]
}