{
    "prof_info": [
        {
            "prof_name": "Joaquin Barriendos",
            "prof_id": 12187,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 08, 2015",
            "review_content": "\nThis class was pretty good. You barely have to read the books - get the main points, have some questions, and come to class - his presentations do the rest. Sometimes I wish the class was more discussion-based, but then I remembered that would require maximal effort on my part, rather than just reading a little and studying my notes from class. Sometimes we have good discussions in class, but not that much. He assigns small papers as reading checks - they're basically participation points, but they require you to write like two pages. There are two larger papers that you have to write (around 6 pages) that take up more time than normal, but he grades these pretty nicely.\nThe midterm and the final for this course is a lot harder than the essays or in class discussions, but that is mitigated by the fact that he gives you way, way, way more time than you need to finish everything, and he doesn't believe in passage IDs. He grades you solely on the basis of how you write, think, and come up with ideas about the text (and he generally likes most ideas that can be backed up). Additionally, there's a question on every exam that deals with art history (he discusses a lot of paintings along with the works that we discuss in class, which is really cool because he really knows his stuff when it comes to art), which is different than most CC classes, but in my opinion, a lot more fun.\nAll in all, having Professor Barriendos made this course a lot more bearable, grading-wise, work-wise, whatever - it was just a lot better with him. If you get him as a professor, rejoice.\nWorkload:\n4 small 1-2 page essays, basically participation grades, you'll get full credit. 2 larger 5-6 page essays, far more time-consuming but graded very nicely. In-class midterm and final, both a little more difficult than what you're used to, but also graded quite nicely. As for reading, it's a pretty normal CC reading load, but you can get away with reading less than you would in other classes.\n"
        }
    ]
}