{
    "prof_info": [
        {
            "prof_name": "Thomas Beller",
            "prof_id": 1144,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Fiction Workshop",
            "review_date": "June 14, 2006",
            "review_content": "\nYou're probably reading the previous reviews of Beller and thinking \"he can't be that bad, I'm sure it'll be fine.\" That's what I did. Word to the wise: it is that bad. I took the \"Fiction Workshop\" which is supposed to be the most advanced level of class and it was a joke. First of all we didn't turn in revisions of our stories, nor did we hand in a portfolio at the end of class. I mean WTF? If you're like me, a big part of the learning experience in a writing class is writing something, having it critiqued, and then re-\nworking it and getting new comments on it. Well, in that ain't gonna happen in Beller's class. Also, his written comments were pretty short and not particularly incisive. \nIn class he tends to ask the class leading questions, very obviously fishing for somebody to vocalize his opinion, instead of just coming out and saying it himself. \nCompared to other teachers in the writing department Beller is decidedly sub-par and not nearly as engaged in the teaching process as he should be. Such an anticlimactic way to end an otherwise great writing program. A previous reviewer said it best: an expensive disappointment.\nWorkload:\nvery light, if that floats your boat. two stories. critique other people's stories. that's it.\n"
        },
        {
            "course_name": "Narrative Forms",
            "review_date": "April 04, 2006",
            "review_content": "\nI agree with the negatives - the break, the late starts, the cancelled (and not made up) class - I was in the same class that went on the wild goose chase for the irrelvant novel.\nHowever, one positive:  excellent in office hours. Clear, concise, and helpful critiques.\nWorkload:\nrelatively light\n"
        },
        {
            "course_name": "Narrative Forms",
            "review_date": "May 02, 2005",
            "review_content": "\nI second the will-work-for-money opinion.  This is the first writing class we've ever had a break in (a less-than-two-hour class).  The first class met for a few minutes and we were told to get a book that turned out to be near impossible to find.  Sometimes class let out early.  We didn't begin bringing in our own work until the third week.  He never gave back our last papers.  Etc.  An expensive disappointment.\nWorkload:\nTeading a novel and a few short stories - with response papers - in addition to our own writing.    Too much unrelated reading.  How much better if we'd have read each others' work and that's it.\n"
        },
        {
            "course_name": "Narrative Forms",
            "review_date": "May 27, 2002",
            "review_content": "\nGod damn, this guy is bad. But he certainly is tall. No one can take that away from him. This class was at its worst when Beller missed one week and then dragged us all downtown to attend one of his reading the next week. It was in an overheated office/art-gallery, but that's beside the point. Teaching Narrative Forms is clearly a means to a paycheck rather than an expression of any desire to teach. The point is that Beller is enamoured of David Foster Wallace and all the stylistic cocksuckery that made him famous. Look out. \nWorkload:\nTwo stories, participation in the discussions.\n"
        }
    ]
}