{
    "prof_info": [
        {
            "prof_name": "Jessica Manser",
            "prof_id": 12902,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Human Adaptation",
            "review_date": "May 09, 2016",
            "review_content": "\nProfessor Manser was a great professor! She was great at explaining the material in depth and making sure that everyone understood the subject. While the classes were a little monotonous with having powerpoints most of the time, it was never boring at all--the class always went by really quickly despite that. Professor Manser also did a good job of getting everyone engaged with group presentations, class discussions, and personal presentations. She was always open to what students had to say, either in class or in office hours and was genuinely interested. The material is really interesting to anyone who is curious about why humans are the way they are. This class was the first one I took in EEEB/EBHS and now I am going to concentrate in it!\nThis class is not particularly difficult. It is a little harder if you don't have any background biology knowledge or took the intro EEEB course. With effort, an A is very attainable. \nWorkload:\nmidterm, final, 10-12 page research paper, 5 2-page response papers sprinkled throughout the semester, \"required\" daily reading. Really not bad at all. The research paper was the most work, but if you choose an easier topic it won't be as much work. \n"
        },
        {
            "course_name": "Biological Basis of Human Variation",
            "review_date": "May 17, 2014",
            "review_content": "\nProfessor Manser was great for this seminar. It was a pretty small group of kids, and most of us knew each other from other classes (I took it in the fall of 2012). The first week we were able to choose a topic we wanted to present on (from a list of topics). The first hour of the seminar would be the student's presentation, and the last half would be a discussion. The topics were always interesting and very informative (topics ranged from human migration patterns to genetics of taste). Professor Manser would usually leave the discussion for the students to participate, but would always comment if there was a lull in the conversations. \nOverall, great course to take, not sure if it's the same with Prof. Holloway, but I can't imagine it's too different. \nWorkload:\nWeekly paragraph on the upcoming presentation's readings. Participation is a huge component of this class, and as mentioned you have to present at least one topic. Because there were so few kids in our class, students had the option of either taking on a second topic, or to write a 20 page final paper on their own topic. \n"
        },
        {
            "course_name": "Human Adaptation",
            "review_date": "May 09, 2014",
            "review_content": "\nWhat a fun and interesting class! We discussed so many adaptations and adaptive scenarios, from pain in childbirth, to skin color, to adaptations to cold stress and high altitude, to cooking and the Paleo diet, and the potential adaptive benefits of chronic and infectious diseases.\nJessica Manser is lovely -- she's softspoken, funny, and understanding. Though the readings could be a tad dense, I soon figured out that it's not necessary to read them closely (she goes over them in lecture), and besides, they're really interesting. You could absolutely get by reading just the abstract and conclusion of a lot of them, but I'd say even this isn't crucial... I didn't do my readings for the whole second half of the class\nThe class was small (only about 12 people big) and intimate, and every lecture (even though they could sometimes be a little dry) was engaging because of the discussion she encouraged and the fascinating case studies she presented. Though the class isn't extremely broad-reaching in scope (instead, she chose 8 themes and we did each one in great detail), I feel like I learned a lot. And the subject matter is so interesting, even to a non-EEEB major like myself -- it's basically like a deeper look into pop science questions about why humans are the way we are today.\nThe most interesting part of the class for me was the 10-page research paper we had to do, with the only prompt being \"write about an adaptation.\" This was a chance for people to learn more about the adaptations they were really interested in, and the topics were fascinating (we all gave very brief presentations of our topics to the class). Some interesting paper topics were \"is religion an adaptation?\", \"is depression an adaptation?\", \"how can/will we adapt to outer space?\", \"is a love of spicy food adaptive?\", \"was schizophrenia once adaptive?\", and many more. We had deadlines for the paper staggered throughout the semester (\"paper topic\", then \"10 best references\", then \"abstract\", etc.) which meant that I was forced to work on bit by bit throughout the semester, which I found really useful because by the time the paper was actually due I found I had written most of it and just needed to draw up a conclusion.\nI would recommend having taken Biodiversity or Human Species (or an equivalent -- maybe even good high school bio) beforehand, because to really get a grip on how adaptations work and function it is necessary to have a solid understanding of (very very basic) genetics and the four parts of evolution -- natural selection, genetic drift, mutation, migration. That said, if you're willing to do the readings slightly more carefully, you could probably get by with no prior knowledge, or even by just googling \"evolution\" before the class starts.\nTLDR: take this class for your science credit; take this class for your cocktail-party conversational skills; take this class for fun and pop science; take this class for an easy A\nWorkload:\nDaily readings (dense but interesting and totally not mandatory), a 10-page final research paper on an adaptation, 6 \"focus questions\" or reading responses (easy and interesting -- check plus, check, check minus grading), and a midterm and final where we were given four potential essay topics beforehand and then had to choose one from the two on the exam to write about.\nGrading breakdown:\n25% midterm\n25% final\n25% 10-page research paper\n25% participation (and focus questions) -- really easy as it's such a small class\n\n"
        }
    ]
}