{
    "prof_info": [
        {
            "prof_name": "Marc Van de Mieroop",
            "prof_id": 4962,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "Ancient History of Egypt",
            "review_date": "September 29, 2020",
            "review_content": "\nI feel bad cause I didn't go to any of his lectures but i'm sure Prof. Van de Mieroop is a great professor. We had mandatory weekly discussion sections and my TA was pretty good. Assignments were not difficult at all. Textbook is dense, but actually really good for learning the material and written by the professor himself\nWorkload:\n1 paper, 1 discussion section presentation, midterm i think, easy final\n"
        },
        {
            "course_name": "Ancient History of Egypt",
            "review_date": "May 28, 2019",
            "review_content": "\n\nThis class is a waste of your tuition dollars. \n I took this class to be an easy global core. I started out going to every class - doing all the readings before class and taking thorough notes in class and discussion section. Then I realized class is completely pointless.... Reading the book and going to discussion section gets you an A. Discussion section was annoying. My TA was not familiar w the subject and basically prepared by reading the book. From the vibe I got, a lot of TA's were also TAing the class w/o any background in Egyptian history so everyone was kind of in the same boat and they couldn't answer questions. Also, the textbook (written by Professor Mieroop_ is all over the place (just like lecture) and its impossible to know what to focus on from the readings...the TA is incapable of prioritizing info... class is basically Professor Mieroop's random tangents. \nBust I will say its fairly easy to do well in the class. tests are random terms (there is choice) and a large essay question thats usually vague and you can kind of BS your way through.  To reiterate, this class was super disappointing for me - I went most of the semester doing all readings and participating to fullest extent just to realize it was a complete waste of time. Discussion sections are also super annoying bc there are pop quizzes made up of random terms that he never mentions in class and are mentioned literally once in an entire chapter of his book so you have no way of knowing what to focus on..I got an A in the class. \nWorkload:\n\nFinal examination (30% of total grade), Midterm + 2 research papers (45%), Participation in TA sections (3 pop quizzes, dropped lowest quiz) (25%)\n"
        },
        {
            "course_name": "Ancient History of Egypt",
            "review_date": "April 16, 2019",
            "review_content": "\nAfter this I will definitely avoid his classes. He is an extremely boring lecturer by going on about the most boring parts of the history. The lectures are almost pointless with the mandatory discussion sections. In 50 minutes the TA will go over everything important about the lectures for the next week. The lecture is just a longer, drawn out version. They are absolutely pointless. A new addition to the discussion sections are the spot checks (pop quizzes on readings). There is not set limit but there will be less if people do better. Also while this may not bother everyone he is late for every single lecture but he usually still ends on time. \nWorkload:\nFinal examination, Midterm, 2 papers, and readings for every lecture   \n\n"
        },
        {
            "course_name": "Ancient History of Egypt",
            "review_date": "June 03, 2015",
            "review_content": "\nThe class for me was pretty split. Professor Van de Mieroop was actually wonderful. He's incredibly knowledgeable about the material, his lectures are clear, straightforward, and focused, and he's also very enthusiastic about the material. If going to lecture every day isn't your thing, you also luck out because Van de Mieroop wrote the textbook for the class. So he doesn't cover anything in class that's not already in the textbook. It's a great Global Core class to fulfill requirements and you can avoid going to class and just reading the textbook if that's more your style. \nThe kicker comes with the discussion sections, which was a new addition to the class. Discussion sections basically go over various primary sources that were either briefly mentioned during lecture or have to do with the time period discussed in lecture. Part of your grade in the class depends on your participation in the discussion section, and that really depends on the TA you get. Personally, by TA was wonderful, a fairly easy grader, and was really enthusiastic about encouraging people to speak. But I also heard close friends with TA's who weren't helpful, were tough graders, and didn't help them in the class. Unfortunately, that's a toss up and you're just going to have to hope for the best with that. \nOverall, a really simple class, not much you have to worry about. My suggestion would be to talk to your TA and really get a sense of their teaching and grading style so you can ensure that A. \nWorkload:\n2 papers worth 15%, each around 5 pages\n15% midterm (ID's and an essay)\n25% discussion section participation (what this entails depends on your TA; for me, this included weekly discussion board posts and verbal participation during section)\n30% final (ID's, primary sources, and an essay)\nAgain, really easy to do well. You can get away with just reading the textbook\n"
        },
        {
            "course_name": "Ancient History of Egypt",
            "review_date": "May 22, 2015",
            "review_content": "\nI, presumably along with the 350 other students, took this class since it was a 1000-level history Global Core that I needed out of the way. Most people never showed up to lecture since Van de Mieroop is really boring and drones on about inconsequential details of the lives of Egyptians. It was far from riveting.\nThough this was a 1000-level 3 credit class, it had a fair amount of work. It was perhaps Van de Mieroop's way of making the class harder to hurt everyone who took this thinking it was an easy A global core. We had to attend mandatory recitations with 3 pop quizzes, were actually forced to do the readings every week and submit a short write up about them online and lead the discussion for one recitation. It was an awful waste of time since the TA didn't really know much about Egypt nor did anyone really care.\nWe cover the whole shabang from origins of Egypt to the Greco-Roman period in excruciatingly boring detail. Everything he says in lecture is word-for-word in the textbook so a lot of people skipped it though you learn the things he focuses on in tests if you attend class. About 50-70 pages of light reading per week that you can skim through since it's just a rehash of class.\nYour grade entirely depends on your TA who manages everything for you. I took this thinking it was an easy A but somehow only got an A- even though it was total BS. Grading was harsh for a class that even the teaching team knew nobody cared about. If you need to take a Global core, there are probably better options with less work.\nWorkload:\n2 x 5-page papers - graded harshly for me\n1 midterm - it was ok (5 definitions and 1 essay)\n1 final - harder (5 definitions, 2 short essays on direct quotes from the text, 1 long essay)\n\n"
        },
        {
            "course_name": "Ancient History of Egypt",
            "review_date": "April 23, 2015",
            "review_content": "\nI have mixed emotions about this class.  First off, the class itself is really great and straightforward.  Professor Van de Mieroop does a really good job explaining the different periods of Egypt.  This is definitely a class to take to fulfill a Global Core.  The assignments and midterm were not that difficult, it's the TA's that were awful.  Your grade entirely rests on your TA and depending on which one you are assigned, you can either have a really chill one or a up tight one.  My TA is down right awful and has really ruined my experience with this class.  I would take this class again but make sure you get a good TA. Overall, pretty simple class but does not mean you will get an A easily depending on your TA.   \nWorkload:\nReally light, if you don't go to class you can just read his textbook which is directly linked to his lectures. \n25% participation in recitation (entirely subjective to the TA)\n2- 15% 5 page papers\n15% Midterm- Pretty straightforward but I swear TA's were looking to take points off\n30% Final- haven't taken it yet but similar to Midterm\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 06, 2013",
            "review_content": "\nHe really does not care about the class. He is pretty passionate about his own interpretations of the readings and is able to back them  up, however. He will call you out if it is obvious that your comment is unfounded, but other than that it is a chill class. He is very knowledgeable, but class will be boring. He looks at the clock every five minutes towards the end of class, demonstrating his disinterest in the subject matter. I did not enjoy going to class, but I learned a moderate amount. Plus, he spends a class period reviewing for the final.\nWorkload:\n2 essays, graded fairly\nParticipation\nMidterm, Final all graded pretty fairly\n\n"
        },
        {
            "course_name": "Ancient History of Egypt",
            "review_date": "May 17, 2012",
            "review_content": "\nMieroop is a wonderful lecturer. He is incredibly well versed in the history of ancient Egypt as he literally wrote the text book. The course is very well organized and the lectures are deliberately given. The external sources are carefully chosen and enrich the course. The course expectations are extremely straight forward: midterm, paper, final, which go 25/25/50. The midterm is surprisingly easy. Do not let this lull you into complacency between the midterm and the final! Be sure to spread the readings out throughout the semester as it is impossible to learn the detailed information that you will be tested on if you cram it into the reading period. Fortunately, Mieroop never assigns more than 20-30 minutes of reading per class so it is easy enough to keep up with the homework.\nThere is also a class field trip to the Met. Go! It is awesome. Mieroop points out relevant artwork (Amarna art etc) but more interestingly he points out his favorite pieces in the exhibit. This was definitely my favorite part of the whole course.\nAdditionally, towards the end of the course/in studying for the final do not worry so much about the Late Period or the Greco-Roman Period. Mieroop is more interested in the New Kingdom and will test you on that more than anything else in the final exam.\nI thought that this class could have used a discussion section due to its large size and sparse assignments, but I guess as the information is considered relatively straightforward there is not one.\nWorkload:\nMidterm - 25%\nPaper - 25%\nFinal - 50%\n"
        },
        {
            "course_name": "Ancient History: Mesopotamia and Anatolia",
            "review_date": "May 22, 2010",
            "review_content": "\nI took Professor Van de Mieroop's Ancient Near East class in Spring 2010. He and his TA, Nathaneal Shelley were both excellent. Prof VdM's lectures were definitely interesting if you read the chapter in advance. The TA could not have been more helpful. He stayed after class to answer questions, answered questions via email in a relatively prompt fashion and held TWO review sessions before the final exam. Grading was more than fair in my opinion. \nIf you are in it for the grade: You must read the chapters and the text analysis (1-3 page primary sources translated into english) before class. This amounts to ~50 pages of reading per week. If you read these and attend class, you'd be hard pressed not to get an A. If you are in it for the grades and do not care about expanding your knowledge base or are crushed for time, you do not need to read the secondary readings to do well in the class. There's a short (ours was 7 pages) paper as well. Given the subject matter assigned for the paper, I found 7 pages to be a breeze. \nIf you are in it for the joy of scholarly pursuit: Besides doing all the stuff in the \"for the grade\" section, key in on Prof. VdM's focus on sources and how they are used to interpret the history. His big kick is looking at sources with a critical eye and being careful to differentiate facts from theories about what actually occurred in the Ancient Near East. As the class progressed, you get more attuned to looking at what items were found, when they were found, who created them and what can be certified as fact, what can be speculated on and what can't be known about these distant time periods. I found this level of critical thinking pretty cool once you got the hang of it. \nOverall, I recommend this class and this professor. The workload is manageable, the professor is competent and effective in lecture and the grading is fair to slightly lenient. \nWorkload:\nThe work load was average. Weekly: (2) ~20 page chapters, (2) 1-3 page 'text analyses' plus (2) ~20 page secondary readings. This amounts to ~50 pages of reading per week. Other than some choice readings that are stressed heavily in class, you don't have to read all of the secondary readings to score well on the exams. \n"
        },
        {
            "course_name": "Ancient History: Mesopotamia and Anatolia",
            "review_date": "May 15, 2010",
            "review_content": "\nThe review below mine is completely inaccurate and was most likely written by a student who never attended class.  If said student did attend class, he/she would have seen that Professor Van de Mieroop remained after his lectures ended to answer the lingering questions that students had.  The TA was also extremely helpful--he held two (optional) review sessions before the final exam, and would listen to and critique paper ideas.  In terms of not finding adequate English language source material for the paper, I did not seem to have that problem, and neither did any of the other people in the class who I spoke to.  In fact, on the paper assignment page, the professor provided a list of sources (all in the english language) that we could use.  Grading was also really, really fair, and probably more lenient than it should have been.  As long as you went to class, you didn't even have to study to get in the 90s on the midterm or final exam (I literally read through my class notes an hour before the final).  As far as not learning about how the wars were fought, if the student who wrote the post below me had gone to class, he/she would have learned 1) there is often not enough textual or archaeological evidence to provide details of every particular battle, and 2) when studying this period, it is more important to understand the overarching themes and causes and effects of events rather than get bogged down in detail.  In sum, the poster below me gave the totally wrong impression of the class.  \nWorkload:\nAssigned Readings (going to lecture and taking good notes is a complete substitute for this)\nMidterm (map, source analysis, essay)\n7 Page paper on figure from Ancient Near Eastern history\nFinal (source analysis, two essays)\n"
        },
        {
            "course_name": "Ancient History: Mesopotamia and Anatolia",
            "review_date": "May 12, 2010",
            "review_content": "\nVery boring class covering far too much time for anyone to really be tested adequately.  The professor also skips over important pieces of information because the time-span is so long.  For instance talking about wars, but never taking time to discuss how those wars were fought.  The lecture offers nothing new that is not in the book, which is probably interesting to a fellow scholar, but not to a casual history student.  The grading is very unfair.  The paper, a biography on an ancient person, is very troubling, because unless you speak Sumerian and Akkadian, you will not be able to search for information on your topic.  The TA was also useless and the professor was usually the first one out the door after class.\nWorkload:\nreading or lecture, midterm & final, 8 pg research paper\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 22, 2004",
            "review_content": "\nI must agree with the previous reviewer. How can you manage to make a class on ancient Egyptian history so uninteresting? With so much fascinating stuff out there written and filmed about Egypt we were assigned to read the most boring text book of all timesby Nicholas Grimal. On top of that we spent hours on reading aloud ancient sources in class :-( That was the worst part. \nTruly speaking everything I know about Egypt now was gained from Columbia's collection of books in the library and in the process of writing a paper - not from the professor. \nIt was really funny when he briefly mentioned  Buhen fortress in class and specifically said that we did not have to remember that name and later included it into the map asssignment ont the midterm  that had to be done with the closest precision or points were taken away.\nBoring, boring, boring....\n+ on top of all the bad things the TAs were not particularly interested in the class as they had nothing to do with Egypt.\nNo discussion section, which might have been very helpful in this particular class to make sense of what Mieroop was saying in class. \nWorkload:\nMidterm consisted of  a map, IDs and an essay, 10 page paper on the topic assigned to the whole class and a final with IDs, essay and yaak - ancient text analysis.\nGrading done by TAs.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "December 05, 2004",
            "review_content": "\nVan de Mierrop, as said before, is a very nice guy.  Howeve, I have to agree w. most of the reviews.  He managed to turn an extremely interesting subject into a snooze fest!  I was very disappointed w/ what I actually got out of this lecture.  The readings were of little help & the lecturers were, at times, very confusing.  What one of the reviewers said about the exams are true.  He says that he doesn't have an interest in dates, but that was not reflected on my grade.  Also, pay very close attention to all the towns, places, etc.. he vaguely mentions because they will show up on the map.\nWorkload:\nmidterm, 10 pg paper (same topi for everyone), final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 07, 2004",
            "review_content": "\nAt first, I liked Prof. Van De Mieroop. He is obviously an intelligent man (a top dog in MEALAC, or so I hear) with an interesting background and interesting ideas about the things he studies. He is also not afraid to tell a student when they are wrong, which is always a plus. On top of that, he conducts Lit Hum very informally. You can say what you want and when, and he often dismissed us after only an hour or so. Despite all this, the class was a complete drag. I dreaded it every Tues/Thur, and found myself watching the clock throughout. It wasn't until I switched classes second semester that I figured out why. Like other reviewers have mentioned, Prof. Van De Mieroop doesn't want to be in class any more than his students do. This makes the class easy to coast through, but it also makes for lackluster discussion and general ill-will amongst students. TAKE IT FROM ME: A Lit Hum professor who is excited about the material and teaching it makes that class worth it (not to mention bearable), even if he/she expects a little more of you than the Van De Mieroops out there.\nWorkload:\ntwo six-eight pagers, midterm (one passage analysis that you must also ID and an essay), final\n"
        },
        {
            "course_name": "Ancient History: Mesopotamia and Anatolia",
            "review_date": "May 11, 2004",
            "review_content": "\nOK some of what has been said here has merit - but the man is brilliant, and his dry sense of humor is a great asest. \nSo well you might just hate the class - doesn't mean much about his ability to teach that class. He is an excllent, articulate lecturer and I was interested in every moment. Yes, it is a BIG field spanning many, many eons of time, but this is a BIG university in a BIG city, and we're all BIG kids now. \nI cannot comment on his grading as I haven't taken the final yet, but the issues are his depth of knowledge - Deep, and his ability to convey that knowledge - that depends on You.\nGreat Class\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 01, 2004",
            "review_content": "\nGoing to MieroopÂ’s class was somewhat like eating at John Jay. You donÂ’t really want to do it and can generally only feed on what youÂ’re given, but in the end you presumably get your basic vitamins and nutrition (even if it wasnÂ’t the most enjoyable experience). \nIt was obvious that Mieroop wished he were fishing (or, more appropriately, digging up artifacts in Mesopotamia) instead of teaching the class. This made the class worthwhile because it was more laid back, you could afford to come a bit late, and class would often get out early. But life wasnÂ’t peachy: every class he would find some particularly unlucky soul in the class and call on someone to regurgitate some chapter or part of a plot, presumably what he viewed as Â‘engaging the classÂ’. A few times he would spice it up by calling on a few other random kids for more insightful comments. Otherwise the class was usually dictated by the direction he wanted to follow and what he wanted to talk about in the reading. At times, he would try to Â“involveÂ” students by asking them what they notice in a certain passage or excerpt (at which point the entire class falls into silence for half a minute and appears to read that passage). Then at the end of the class he often asks for questions, when some students might raise some issues. Whether it was the quality of the class or MieroopÂ’s flat and uninvolved responses to student inquiries, student discussion usually did not go greatly in depth. But it was not a torturous experience: Mieroop would talk about the general thematic elements or particular messages or facts he wanted to get across. In fact, if you value learning about the books in Lit Hum, then the class is perfectly enjoyable. But more troubling than his laid-back attitude (since it reaps as much good as bad) is his arbitrary grading. Sometimes it will make sense and seem fair, other times the format in which he grades is incomprehensible. His grading seems to involve a quick skimming of your work, and maybe a few interspersed (skin-deep) comments while leaving entire pages blank. Unless you get lucky with MieroopÂ’s grading, then it might very well leave you feeling upset if you put any thoughtful work into a paper / exam and wanted intelligent feedback. If you are desperate for a vivacious, constantly thoughtful, and engaging Lit Hum class, then skip MieroopÂ’s class. If youÂ’re satisfied with a laid-back, often mundane, though somewhat thoughtful class, then stay with it.\n\nWorkload:\nWhen he has the chance to assign other reading, he usually will. He assigns two papers during the semester (6-8 pages). One midterm (written by him) and one final (standard Core). \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 01, 2002",
            "review_content": "\nHe made class fun and interesting, had clever, snide comments about random aspects of the readings, and his clothing on any given day was easily forecasted. I think most of us had a blast, either due to his identifiable lack of zeal for the class or possibly his more than amicable grading style. If he teaches it again, I suggest taking it. Now to find his other classes....\nWorkload:\ntwo papers, midterm, final\n"
        },
        {
            "course_name": "Ancient History: Mesopotamia and Anatolia",
            "review_date": "July 07, 2002",
            "review_content": "\nVan de Mieroop seemed to be actually quite a nice guy. While he didn't know our names he did recognize me outside the classroom and bother to speak to me. That, however, does not make up for him being one of the most boring lecturers on the face of the earth. This is only made worse by two facts: 1. Very little is known about a good chunk of the time period he covers in class, leading to rambling lectures with no real content. 2. The course covers so long a time span that, once things do get interesting, it is impossible to study them in any depth. Whoever made the comment about only needing a 10-page notebook was right; he doesn't say enough concrete things for the first 10 weeks to even fill a single page a session. But this lack of content does not translate to easy exams. He said at the begninning of the semester that he didn't care about dates and thus rarely provided them in lectures. But this was a lie. Major sections of both the midterm and final were dependent on knowing the dates of certain dynasties, etc. In preparing for the final (having been screwed on the midterm), I found the textbook (though badly in need of some editing and written by Van de Mieroop) essential to figuring out when various things happened. The best part of the class, in terms of grading at least, was the paper. It involved the regurgitation of 10 pages of history on a particular city or civilization from the Oxford Ancient History and other books. It took some time, but involved basically zero thought. There are worse classes out there, but definitely better ones too. An A is certainly possible, but be prepared to go to class just so you know what sections of th\nWorkload:\nmidterm, final, paper\n"
        },
        {
            "course_name": "Eastern Mediterranean in the Late Bronze Age",
            "review_date": "April 28, 2002",
            "review_content": "\nExcellent seminar, very well organized - interesting topic. The readings were well chosen and not too burdensome and they lent themselves well to discussion. The second half of the semester consists of students presenting their research work on a topic of their choice. Professor van de Mieroop was very accessible outside of class. Excellent seminar for those interested in ancient history\nWorkload:\nReadings every week for the first half of the semester, 25 page research paper due by the end of the semester, one 1-hour presentation in class during the last few weeks of the semester.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 13, 2001",
            "review_content": "\nThough this is not exactly his department, Mieroop did a brilliant job with his assignment. It was obvious that he wanted to be there just slightly less than the rest of us, but he attempted to make class fun and interesting, and always had something intelligent to bring to class. I'd pick him again.\nWorkload:\nA couple of papers, a Midterm and a Final.\n"
        },
        {
            "course_name": "Ancient History: Mesopotamia and Anatolia",
            "review_date": "August 13, 2001",
            "review_content": "\nProfessor Van de Mieroop is blond. He is blond and tall. This observation, gleaned from my first class, may be the only interesting thing I learned all semester from Van de Mieroop. He rambles, he borders on incoherence, he routinely shows up ten minutes late. However, the class occurred in the early evening, and the gentle bobbing of his bushy blond eyebrows lulled me into a restful slumber. I was one of those people who sat in the back row and brought a crossword puzzle, described so aptly by a prior reviewer. However, it made no difference. I took no notes after the first half of the semester, did no reading, and still got an A. Others who worked hard did much worse. This is not because I am spectacularly intelligent. The grading in this class was beyond arbitrary. Highly recommended to anyone who feels lucky. If you want your grade to be based on any logical measure, or if you enjoy classes that actually teach, look elsewhere.\nWorkload:\nOne page paper on object at the Metropolitan Museum of art (grades ranged from 50% to 100% based on shoe size, I think), midterm, and final.\n"
        },
        {
            "course_name": "Ancient History: Mesopotamia and Anatolia",
            "review_date": "April 19, 2001",
            "review_content": "\nThe other person who reviewed Prof. Van de Mieroop was clearly one of the people who came into class and sat at the back of the room and talked during the lecture. Van de Mieroop is not only an extremely knowledgeable and famous scholar, but he has also acquired quite a following of students here at Columbia who will rearrange their schedules to be able to take a class with him... and rightfully so. Van de Mieroop's lecture style is very organized and he packs a lot of information into an hour and fifteen minutes. It is ALWAYS clear where he is going with what he is saying and it is always very interesting. The key to doing well is going to class; he does not test on the texts although reading the texts is always nice.\nWorkload:\nMidterm and final -- straightforward if you've attended every lecture. One 10-page research paper.\n"
        },
        {
            "course_name": "Ancient History: Mesopotamia and Anatolia",
            "review_date": "December 31, 1999",
            "review_content": "\nVan De Mieroop's lectures were inane and disorganized. His slow monotone either lulled you to sleep or to cut. If you do attend class, a crossword puzzle is a necessity and a ten page notebook will suffice. The course sapped me of my interest in ancient Egyptian history, leaving me with little more than a list of Pharaohs and the dates of their reigns. An easy class but not worth the frustration of such boredom.\nWorkload:\nA very short paper on an object in the Met, a midterm, and a final. Memorization a must, insight is useless.\n"
        }
    ]
}