{
    "prof_info": [
        {
            "prof_name": "Samuel Kim",
            "prof_id": 1887,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Korean Foreign Relations",
            "review_date": "December 21, 2004",
            "review_content": "\nProf. Kim is an old school teacher. He lectures at great length and tells first hand stories about the history of Korea. It's quite remarkable what he knows and what he has seen firsthand. There are few people in the world more expert on the topic than he is. He's fluent in Chinese, Korean, Japanese and English, and has read sources in all of those languages.\nSome people may find his style of lecturing at great length boring or tedious, but I found it very interesting. You hear the same things a few times, but they're important things to hear. \nWorkload:\nIt's basically reading, a paper, and an exam (or two if you take the midterm). It's a little nerve racking not having any idea what your grade will be, but until the last few weeks all of the work is reading. The reading is substantial, but hardly overwhelrming.\n"
        },
        {
            "course_name": "Korean Foreign Relations",
            "review_date": "December 28, 2003",
            "review_content": "\nProfessor Kim is not primarily a teacher, he is mostly a writer( indicated by the fact that almost every book or article you read in the class is written by him). His lectures can go a bit of course but when he is on target he is incredibly interesting and knowledgeable. The class is half graduate students who hang on Kim's every word and  CC students who don't care as much. He takes attendance but it doesn't seem to affect your grade. The midterm and final are not difficult, just do the articles and remember as many acronyms as you can. Unless you are interested in taking a class on North and South Korea's foreign relations don't take this class. \nWorkload:\nYou can choose your grade break down, but the most you will have to do is a Midterm, Final( longer midterm) and a final research paper( minimum 15 pages).A lot of reading  but not really necessary and mostly repetative\n"
        },
        {
            "course_name": "Korean Foreign Relations",
            "review_date": "December 23, 2003",
            "review_content": "\n\"The two Koreas are important players, maybe I should take a course about Korean Foreign Relations.\" Well, my friend, this is not that course. You will learn little to nill and feel more confused by this prof's teaching than when you begin the semester. He will speak of many things unrelated to the books--which he has the freedom to do since he wrote them (oh yes and read them you will for being a sinner)--and he will repeat basic concepts over and over and then test you on concepts he never talks about.. \nWorkload:\nWorkload is okay, three or four books,  a paper, mt & f, but its not weight of the load thats awful its the quality--it will make it seem much much more than it is. \n"
        }
    ]
}