{
    "prof_info": [
        {
            "prof_name": "Alan Brinkley",
            "prof_id": 90,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "American Conservatism since 1945",
            "review_date": "January 07, 2014",
            "review_content": "\nI'm glad I took this class, because it exposed me to a field of conservative authors and ideas that I was comfortably unaware of in my liberal cave. Nonetheless, I feel as if I didn't come out of the class with a whole lot -- it really just opened the door for me to now go out and do the digging on my own. I mostly attribute this to my own lack of background knowledge in political philosophy, but I do believe that Lilla and Brinkley could have done a better job of crafting a narrative for the class. Be aware that a good deal of background will be essential for your participation in discussions. This was not necessarily enforced by Lilla or Brinkley, but by other students who sometimes brought the discussion to areas that were uncharted territory for some of us.\nI also learned once and for all that I prefer the Foner-style course approach of historical monographs supplemented with primary documents, rather than primary documents supplemented with some light monograph reading. Obviously, this is an intellectual history course, but if you prefer to learn about the intellectual developments through the lens of historian authors, you're not really going to get it from a syllabus by Lilla (who is an ideas man through and through) or Brinkley (who does seem to like monographs more than Lilla, but is still more document-driven than Foner). I found the Phillips-Fein and McGirr readings (monographs) to be among the best of the semester.\nWorkload:\nMedium to heavy; start your readings early in the week so you can do an early post before others dominate the discussion boards, leaving little room to intervene; there was only one larger paper, though, and we were given plenty of time to complete it\n"
        },
        {
            "course_name": "American Conservatism since 1945",
            "review_date": "January 02, 2014",
            "review_content": "\nOverall, this class was rewarding. You will leave it with a more thorough understanding of the various breeds of conservatism, their constantly mutating relationship with one another and the transformations the different ideologies underwent over time. More significantly, the course compels you to consider the nature of American democracy in ways other \"straight\" (e.g. non-intellectual) history courses might not  -- its fundamental precariousness, the inherent religious devotion of Americans, etc. \nThat being said, there was a bit of a learning curve (it may have just been me) at the beginning of the class; I came in with very little background in American politics or current events and felt like I lacked a basic framework many of my classmates already had. This is not to discourage people who are interested in the class more for its philosophical content; I would, however, suggest coming into the class with a specific question in mind (pertaining to the broader themes of the course) as a way of anchoring yourself for the first few seminars. \nBoth Brinkley and Lilla were great; each was very generous with his time and resources, willing to meet with everyone and soothe our final-paper neuroses (often multiple times, although at one point Lilla will want to \"return the baby monitor\"). By and large, Lilla ran the class discussions; he asked \"big picture\" questions that were thought provoking and, ultimately, made the class for me. He also did a good job of moving the discussion along when it got bogged down. Brinkley would supply historical context when necessary, which I found immensely helpful. They are very different thinkers; being able to learn from both in one class, while ultimately enlightening, was not without its chaotic moments. \nAll in all, a worthwhile experience that is not to be missed.\n\nWorkload:\nMedium to heavy, depending on the week. Weekly postings of about ~500 words (or more) that require effort and real engagement with the text. A final paper of about 12 - 15 pages on a topic of your choosing due about halfway through winter break.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "May 11, 2011",
            "review_content": "\nPeople here swear by Brinkley, and you might see why: he runs a class with incredibly detailed, well thought-out lectures that always leave you buzzing for a bit after leaving IAB 417. They're like NYROB essays, down to his obsession with quoting Archibald MacLeish. A worthwhile class, without a doubt. Big lectures, consistently attended.\nBut you'll soon find yourself, if you study American history at Columbia, in one of two camps: the love-Brinkley camp or the love-Foner camp. And after a bit of time with both, I'd go with Foner.\nBrinkley's lectures are a bit more detached from the students--he reads off something like a script, and has PowerPoint. He also allows laptops. The multimedia will keep you awake, but it also distracts you (and sometimes him!). He's dry by big-shot lecturer standards: he doesn't crack jokes and he has a gentle timbre. (Of note: Foner needs no microphone to lecture, Brinkley uses one.) But this might be your thing.\nWhere Foner's readings are primarily conventional, academic histories, Brinkley's are a mixed bag: you get speeches, you get essays, you get Tom Wolfe, alongside the academic histories. You'll like this, probably, if you're not a history major, but you might groan if you're used to picking apart theses and topic sentences. Then again, Foner makes you focus on historiography. We didn't do much of that in Brinkley. Perhaps that's a relief.\nBrinkley also draws a lot more from pop culture--again, great if you're from outside the major, maybe tough if you like soberer stuff. (And a minor quibble: his lectures about the Reagan era and onward aren't quite up to his standards. Yes, the quality of historical analysis might increase with the passage of time, but part of it is that he just hasn't updated his lectures and slides.)\nThen again, both profs have sharp TAs who will kick your ass and force you to write thoughtful, specific papers and in-class essays. You can't go wrong with either Brinkley or Foner--but, if I may, a rule of thumb: Foner's better for majors, Brinkley for non-majors. A lot of English-y/American Studies-y stuff in this class.\nWorkload:\nLight reading (~80-100 pp./week, with a few tougher weeks), with courseworks postings. Midterm and final (only one of which counts), and a 2,000-word close reading paper which was kind of fun. Grading depends entirely on your TA. \n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "April 13, 2011",
            "review_content": "\nBrinkley is a good professor. But it is a big lecture class so if you don't like lectures, this is probably not for you. The reading is pretty heavy for this class, but my main issue is that there was no textbook reading and I found the reading while they helped to flesh out the lecture, unless you attended every lecture and took AMAZING notes, you would struggle. The tests were also a little broad and too open to interpretation to my taste. However, I am glad that I took the class overall. I mean...he is Brinkley. \nWorkload:\nmedium - at least 150 words a week, a discussion response (weekly) /presentation for TA (once), a midterm with two short answers and an essay, and a final with two essays \n"
        },
        {
            "course_name": "United States 1918-1945",
            "review_date": "January 10, 2009",
            "review_content": "\nTAKE THIS CLASS!!!!!!!\nDoesn't matter what year you are, what your major is. What an amazing experience. The class is humongous, but don't let that deter you. Each class is like watching a segment of an incredibly interesting documentary. Brinkley is a fabulous orator, and his powerpoint photos and video clips are the perfect addition. You quickly see why, even though no one ever takes attendance or would notice if you were gone, almost the entire class shows up every time for the whole semester. You really don't want to miss class, because Brinkley lays it all out there for you. He gives you the barebones outline of the lecture online, but each time i went to class I ended up having probably 5 pages of notes. When it came to the midterm and final it was a breeze to study because Brinkley's notes cover absolutely everything that would be needed to answer the essay questions, aside from what the readings covered. There was a fair amount of reading, but they were always super interesting, and the small, mandatory weekly discussion section you attend helps you digest any difficult parts of the books and link it to Brinkley's lectures.\nI'll miss going to that class.\nWorkload:\nMidterm - 1 essay question\nFinal - 1 large essay question, 2 smaller essay questions\n2 papers (5-6 pages each)  on a topic of your choice basically using primary sources\nWeekly readings somewhat heavy but so interesting it was never a problem. DO THE READINGS.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "April 17, 2006",
            "review_content": "\nAlan Brinkley has such a reputation here at Columbia that a review seems almost superfluous.  I lucked into having him as a professor for the first semester of my freshman year, and this is only unfortunate in that every professor I've had after him has failed in comparison.  His lectures are fascinating and always interwoven with intersting quotes, pictures, stories, and occasional video footage, all of which enhance the lecture immensely.  When I had to miss a lecture I found myself genuinely disappointed.  You'll probably want to take a laptop because he often gives so much information that I found it hard to keep up with pencil and paper.  Yet, it never seems like \"information overload,\" and I've yet to hear a student say that they didn't enjoy the class.\nWorkload:\nModerate--There were discussion questions every week, moderated by the TA and one paper due at the end of the semester.  There was a significant amount of reading, but it was never too burdensome.  \n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "February 02, 2006",
            "review_content": "\nAmazing. Never missed class, nor did I want to. His lectures are engaging, informative, and easy to understand. They're usually laced with pictures and video clips (when he gets the media working, anyway). The reading was a little excessive and you have to do it, but most of it was interesting. Section, for me, at least, was useful in synthesizing the readings. The midterm and final were fine as long as you studied and don't mind writing about six novels worth of essays, but you do get a choice on your questions. The paper topic, like mentioned before, is vague, but it's not hard to get a good grade (it is graded by the TAs, though). Just one word of warning: after the Vietnam War, it gets really boring, probably because the Brinkeister doesn't have much to work with. But I found the overall grading system to be fair. Plus ladies: he's easy on the eyes.\nWorkload:\nNormal for an upper-level history class. Weekly, fairly substantial readings, weekly mandatory discussion sections, an in-class midterm, 10 pg paper, and an all-essay final.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 18, 2005",
            "review_content": "\nSo no two ways about it, I took this class to take a class with the man who wrote my AP textbook.  There were a few minor disappointments, but was it worth it?  Absolutely.  His lectures, while sometimes irritatingly verbatim from his texts/essays, are always enjoyable, often amusing, and certainly engaging.  Brinkley's inability to operate technology was a constant source of comedy and simply being in his presence reminded me of one of the reasons I am at Columbia (he's Alan Brinkley- he got applause on the day of the exam..I mean really).  \nWorkload:\nAs a first semester freshman, it took getting used to- just a lot of reading (10 books, some weeks 200 pages, some 40).  Mid-term was very fair- IDs and essay, final was two smaller and one larger essay (definitely more challenging than the midterm but do-able I think).  Honestly, depends only on your TA.  Section is a big part of the grade.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 17, 2005",
            "review_content": "\nOne of the best classes I've taken at Columbia. This class changed the way I think about social, economic, and political issues by giving me a deeper understanding of various themems of American life have evolved.  The lectures are very well organized and discussion sections help you analyze general themes and connect the cause-and-effect of various events.  I wholeheartedly recommend this class to everyone, especially those of us who attended mediocre high schools with lousy general-ed history classes.\nWorkload:\nMidterm, Final, 10-page paper about the relevance of primary source to its time\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 12, 2005",
            "review_content": "\nCharming, brilliant, sensitive, and real. Although the first half of the semester seemed to much like a review of AP US history, Professor managed to make even the familiar 1950s fascinating and complex. His interpretations of history are both intellectually deep and balanced, as he strives to cover quite a large and complicated period of history. His liberal bias comes through quite strongly in some areas, but Professor does a wonderful job of presenting a moderate and balanced portrait, especially in his treatment of Nixon. He takes great care not to offend during the class, and manages to see through some students' attempts to provoke him into making personal/governmental/societal criticisms. One of the best classes I have taken at Columbia. Oh, and my TA was absolutely wonderful...very good experience in discussion sections, with intense discussions brought up by Brinkley's wonderful reading list. \nWorkload:\nEasy midterm focusing on trends; a 10-12 page paper placing an influential document, book or film from the period into its historical context; final; participating in weekly disuccion sections. Reading load varies, but every book is absolutely wonderful and challenging.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 06, 2005",
            "review_content": "\nGoing to Brinkley's lecture was like going to story-time twice a week - engaging, interesting insights about all those events we've heard of but don't really know a whole lot about (if you're a non-history major, that is).  His presentation is organized and clear to follow.  His TAs pale in comparison, so beware of that.\nWorkload:\nQuite a bit of reading, but a majority is colloquial and leisurely reading.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 03, 2005",
            "review_content": "\nBrinkley's class was rather like reading a good history book twice a week for an hour and 15 minutes. Nothing he teaches is profound, and it's all inflected with a liberal bias he does absolutely nothing to hide, but the points are important to contextualizing the social movements and events and he definitely tries to illustrate his concepts in a clear and interesting fashion. Overall, not usually a bore though some of the lectures do get a bit redundant, and if nothing else you really should know this stuff.\nWorkload:\nFairly light reading most weeks for a history. class. One third participation, one third tests (midterm and final, midterm weighted less heavily, one third 10-12 pg. paper. Although a third of the grade is participation in section, be aware that the number of As given out is regulated.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "November 14, 2005",
            "review_content": "\nWhat an immense amount of hype for a major let down.  I find class to be like his reading a bad text book on US History.  I would never have taken this class if I had shopped for it.  I took it only because I ASSUMED he would be amazing.  Wrong.\nWorkload:\nNormal.  Reasonable midterm, insanely vague paper.  Final.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "October 24, 2005",
            "review_content": "\nBrilliant. That's all there is to it. His lectures and written works are wonderfully intellectual and well-structured, and he leads his class and relates to his students with great focus and charm.  Take the class.\n"
        },
        {
            "course_name": "United States 1918-1945",
            "review_date": "August 04, 2003",
            "review_content": "\nGreat lecturer. VERY organized. Decent human skills. His books on Liberalism in the 1930s-40s are excellent methodologically. Classes reflect his research. TAs are ten leagues below him, though, which makes their mandatory sections a chore.\nWorkload:\nAbove average. Grading is tough.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 25, 2002",
            "review_content": "\nawesome class. super-organized and interesting. brinkley is a great lecturer, lets on his liberal bias, but is generally factual and makes history into a story that he strings together with his own analysis. in-depth analysis but also gives you the basic facts about the time period.\nWorkload:\nlot of reading, some more interesting than others, you should do most, but don't need to do all. midterm, term paper, final.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 03, 2002",
            "review_content": "\nThis course may be life-changing if you've never studied (in class or on your own) post-war America before, but if you have don't expect to be wowed. Brinkely is a good lecturer, but he has little chance to show his brilliance when he has to cover 50 years of American history in one semester; he ends up spending most of his time going over basic facts and trends, almost all of which you learned in high school (quite possibly from Brinkley's own textbook). The reading is much more in-depth and interesting, and saves the course from being a pure retread of high school American history.\nWorkload:\n2 papers, midterm, and final. Grading varies widely depending on your TA.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "May 08, 2002",
            "review_content": "\nJust a fantastic course. Brinkley lectures with an incredible amount of depth and insight, and he's so engaging that he could read the phone book and make it interesting. Despite the drawback of having 200-plus people in the class, he makes a point of being very accessible. His plethora of media presentations are simply gravy. This class is definitely worth your time.\nWorkload:\nSomewhat long readings that are very enjoyable. Your grade is entirely based on your TA's assesment of your work. Also, Brinkley is apparently trying to crack down on grade inflation, so be prepared to do your best on assignments.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "May 07, 2002",
            "review_content": "\nThe course is a good way to get a good grip on the US in the past 50 years but the lectures can get boring. Brinkley is a clear lecturer but is not very animated and he reads from his notes instead of being extemporanious. He brought in great video clips for some lectures but in the 2nd half of the semester his class got pretty boring. \nWorkload:\nMidterm and Final are pretty easy if you are good at writing essays on the tests and if you have a nice TA. The paper is the best of the class because you get to research cool primary sources like old newspaper articles etc. \n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "May 01, 2002",
            "review_content": "\nProfessor Brinkley is an engaging lecturer, who uses a great deal of multimedia to add background and context to his lectures (though he could do with some more practice using the equipment). He is well-organized (most of the time), and his reading selections are both informative and (mostly) interesting. He not only makes lectures fun, but he also makes sure not to let his opinions come across as ones we must agree with. He tries to leave time at the end of lecture for questions and comments. Topics are well chosen to give us as full an understanding of the period as possible within the limited time of a term. Grades are entirely based on your TA's grading.\nWorkload:\nWeekly reading (200 pages or so), one short essay (1000-1200 word) early in term, one longer (1500-2000) essay at the end of the term, midterm and final, beyond that workload depends entirely on the TA you get.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "April 15, 2002",
            "review_content": "\nThe is the best course I've ever taken. Brinkley is without peer. Take this course and you'll remember why you came to Columbia in the first place.\nWorkload:\nMidterm, final, 2 papers - all graded fairly. Not especially easy but not at all overwhelming either.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "April 15, 2002",
            "review_content": "\nThe is the best course I've ever taken. Brinkley is without peer. Take this course and you'll remember why you came to Columbia in the first place.\nWorkload:\nMidterm, final, 2 papers - all graded fairly. Not especially easy but not at all overwhelming either.\n"
        },
        {
            "course_name": "America Between the Wars, 1918-45",
            "review_date": "December 31, 1999",
            "review_content": "\nHis lectures use up every possible minute and are packed with facts. You will learn a ton of history from him, and you'll even get excited about it from time to time, since he lectures so well. (Warning: political analysis ahead) It is interesting to learn from a historian as brilliant and piercing as he is, whose political views differ from my own... you will never find a more pragmatic and honest adversary in a debate. He is also very helpful, and he makes a great mentor when he has free time. Chat him up during office hours.\nWorkload:\nLarge research paper, Midterm and Final exams.\n"
        },
        {
            "course_name": "America Between the Wars, 1918-45",
            "review_date": "December 31, 1999",
            "review_content": "\nThis man is brilliant, and it's such a shame his lectures are so boring. Depending on your TA, it's not necessarily worth your time reading all the material; save your caffienated beverages for before and during class, where Brinkley will spew fact after fact in lectures that seem endless. He spends a lot of time on some RANDOM stuff, and goes into quite a bit of detail about everything. And watch out--his tests cover all of it\nWorkload:\nMake sure you get a good TA; Brinkley himself will never see anything you do. Workload is fairly standard, about 150 pages a week, mandatory sections, 15-page paper, midterm and final\n"
        }
    ]
}