{
    "prof_info": [
        {
            "prof_name": "Frederick Bengtsson",
            "prof_id": 3232,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "May 20, 2013",
            "review_content": "\nFrederick was a very approachable professor, as is evidenced by the fact that he let students call him by his first name. I really liked his class because he didn't baby us or try to lure us into guessing the motifs or symbols in a text that he wanted to talk about. Instead, he would present us with his ideas (which were always interesting) and encourage us to engage in literary discourse about these ideas with both him and our fellow students. Many people did the bare minimum (if anything) for reading, yet complained about how there wasn't enough student discussion in the class. I think that Frederick could sense that our class was bound to be somewhat ill-prepared on any given day and took the reins in order to save us from shallow, plot-based discussions fueled by what people could remember from spark notes. He was super helpful with papers when we met with him and always hung around after class to answer questions. Overall, he was a great professor and I would definitely take another class with him. \nWorkload:\nMostly reading, completely manageable\n2 papers with revisions and a final research paper (includes annotated bib and prospectus)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 08, 2012",
            "review_content": "\nI enjoyed Frederick's class very much, although I knew others who definitely did not. He is incredibly smart and you can tell he is knowledgeable and passionate about all of the works on the syllabus, which was why I liked his class, but sometimes this means that he talks more at us than with us; the discussion was very one sided a lot of the time. This could also have been because probably three people in the class ever did the reading though. I felt like he had better things to say than people most of the time so I actually liked him lecturing on the reading. \nHe is really fair with the papers. He requires you to meet with him before you turn them in to discuss your topic, and he basically tells you what you should say in them (so take good notes if you go!).\nWorkload:\nStandard lithum reading (although he doesn't really care if you don't do any of it), two papers, a midterm and a final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 25, 2011",
            "review_content": "\nIf you got Freddy for Lit Hum - do not fear!  I was pretty scared after reading the reviews for his section of University Writing, but there is really nothing to be afraid of.  He does tend to talk A LOT, which definitely meant class discussion was shortened and somewhat superficial.  However, I don't know how much of this was because he dominated class discussion and how much was because the students (besides the one or two who dominated every discussion) were reluctant to talk.  Contrary to the reviews for University Writing, I never found him condescending (even when kids said dumb things - which was often).  His paper critiques were thorough and thoughtful, though he did take a long time to return papers.  Before and after every paper we were required to meet with him to discuss what we wanted to write about or go over his paper comments.  I don't know if this is standard for other sections of Lit Hum, but I thought this was the most helpful aspect of the course.  Grading-wise I thought he was pretty generous, but he does say a paper needs to be particularly good for it to get above a 90.  This is probably not the easiest section of Lit Hum (I think for fall semester about 25% of the class got an A), but as long as you do enough of the reading to make a few substantive comments and can write with some degree of competence you should be fine.  Overall, I would recommend his section if you're interested in getting a good overview of the readings with a fairly light workload.  \nWorkload:\nStandard Lit Hum reading load, though he will sometimes shorten it (ex. he cut the Don Quixote assignment in half so we didn't have to read 500 pages in a week).  No weekly discussion posts/responses to the reading.  In my year, he required 3 papers first semester (the last one was a re-write of the second paper submitted) and 2 papers (one 1500 words and one 2000 words) second semester.  Midterms are fairly standard, though he does include a character ID section in addition to the usual quote ID and short answer section.  Make sure you review characters and places from the reading for the character IDs!  They're an easy way to lose/rack up points.  All you have to do for the character IDs is write a one sentence description of the person or place and state what reading it comes from.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 22, 2009",
            "review_content": "\nI wanted to write this review because I actually enjoyed taking University Writing with Fred. Admittedly, I was a bit worried going into this course (previous reviews weren't exactly appealing). However, I hope I can disclose the brighter side of Fred's teaching.\nFirst of all, I think many students are probably intimidated by Fred. He likes to challenge students, which unfortunately may come across as offensive or demeaning by some. However, after engaging on several one-on-one conversations with Fred throughout the semester, I realized that his criticism actually pushed me to work harder and more constructively. \nAlthough his lectures seemed a bit repetitive, I believe they hammered the fundamentals (this is key). What I realized after completing this course was that writing an essay is very simple and complex at the same time (odd, I guess). See, if at first you examine the fundamentals of a well-written essay (thesis, transitions, sources, etc), your writing will become steadily clearer as you add more details. I think these were the points he tried to convey, and many people simply took them for granted without truly spending some time to mull them over. And quite honestly, this probably made many students' papers less powerful.\nTo put my thoughts into perspective, I should say that I didn't do very well in the class at first, but ended up with a solid grade at the end. I definitely struggled through the class, and writing the essays was by no means easy for me. I just think a lot of students could have struggled a bit more.\nFred is tough, without a doubt. But that doesn't mean you can't do well. I highly recommend talking to him about your essay several times and fixing your drafts along the way. It's amazing how much you can actually learn from Fred if you approach his methods with an open mind.\nWorkload:\n3 essays and a reflection. The goal is to improve with easy writing assignment.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 14, 2008",
            "review_content": "\nI think the other people are being a little to harsh here. Frederick does not hold back on his criticism but as long as you can take it you'll do fine with him.  I thought my writing improved tremendously over the course of the semester, and although it was a decent amount of work because he does expect basically a complete rewrite of your first draft, there was still plenty of time to do that. He made sure to make regular appointments with everyone and kept up on where everyone was at with their papers.  When I had a problem I emailed him and the next day I had an hour long meeting with him on one of his off days and the majority of my problems had been worked out.  He takes some adjusting to and he is not going to give out a lot of A's but I think the class definately can improve your writing. I think the people who are complaining here were just the people who were so worried about getting an A that they forgot to learn anything in the class.\nWorkload:\nSame as the others posted. You have plenty of time as long as you stay somewhat on top of what you are doing.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 24, 2008",
            "review_content": "\nHe may be the worst teacher at Columbia.  Not only does he not help anyone become a better writer, but he actually made become less confident and maybe even a worse writer.  He often finds nothing good in people's essays and his criticism often feels like a personal attack.  He picks a couple of favorites from the very beginning and will like anything they write even if it's not even that good.  For the rest of the class expect Bs or Cs.  Also, he is terrible at talking in front of the class as he is very fidgety and is always looking down in front of him.  I thought this class was supposed to help students become better writers?  I absolutely hate this man...\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 02, 2007",
            "review_content": "\nFrederick is definitely extremely bright and well-read (having gone to Harvard and Cambridge), but his ability to be a stimulating teacher was not definitely there yet.  His grading was quite harsh and his expectations high. While we sometimes had interesting discussions, I often found myself looking at the clock during much of the class.  Freddy can be funny sometimes, but often drones on.\nWhile the course may have some small effect on my future writing, at this point it seems like I mostly learned how to write for university writing, not for university.\nAs well, expect to be under pressure with the essays, since you will often have a week or less to rewrite from the draft to the final essay.  The oral presentation was also assigned over fall break!\nWorkload:\n3 major essays (Lens, Conversation, and Research)- The first 2 are 1500-2500 words, the research is 2500-3500.  However, it will feel like 6 essays since Frederick expects a complete rewrite after the first draft.  There are approximately 3 readings for each progression (you should probably do them, but you don't have to do any work assigned with them). As well, there is a group oral presentation at the beginning of the 3rd progression, and at the end of the course there is a rewrite of one of the first 2 essays, as well as a short retrospective piece.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 09, 2007",
            "review_content": "\nDO NOT TAKE UW WITH BENGTSSON. He's likely to shoot down any attempts you may take to oppose his ideas. He contradicts himself, and in my opinion he's elitist, and if he doesn't like you, you won't get a good grade. If you sit still and absorb his thoughts without raising your hand or offering an opinion, you'll be okay. He's very intelligent but unwilling to make any effort to help you learn and seems to be doing this just to get his PHD and ruin people's lives for a living. I am an english major and this is the only class I've ever gotten anything but an A in. STAY AWAY\nWorkload:\nNormal UW but he expects masterpieces that you will never be able to live up to. Don't try to prove yourself if you want a good grade.\n"
        }
    ]
}