{
    "prof_info": [
        {
            "prof_name": "Jonathan Rieder",
            "prof_id": 1904,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Shapes and Shadows of Identity",
            "review_date": "April 14, 2016",
            "review_content": "\nI cannot sing Rieder's praises enough! He seriously cares about his students and makes time to meet with each student in his seminars personally to revise/brainstorm their essays. He is passionate about his areas of research, and is genuinely interested in people (refreshing and unfortunately too rare for sociologists). I will emphasize that he is much better in seminar format than lecture; it's a more manageable format for the types of discussions he tries to have. He is not super-organized, which can be frustrating, but I still think his classes are very worth it, for his expertise and the questions he makes you consider. If you care about identity politics, pop culture, music, and the human side of sociology, TAKE A RIEDER SEMINAR. \nWorkload:\nPretty sizable readings, but you never have to do all of them; he'll usually just focus on one or two specific parts and get caught up in those. Usually a midterm paper and a final paper (possibly more, depending on the class, such as First Year Seminar). For Culture in America, there were two tests, but they were all essays he told us about ahead of time. He's a fair grader, if you put in the effort.\n"
        },
        {
            "course_name": "Culture in America",
            "review_date": "June 12, 2015",
            "review_content": "\nOh God. As a recent Barnard alumna and sociology major, I feel like the best thing I can do to give back to my alma mater is write this review and hopefully prevent another student from ever taking this class. This review only applies to Professor Rieder--other professors have taught this course, and from what I've heard, they have been good lecturers. However, if you are considering taking Professor Rieder's course, STOP now. I took Culture in America during the  fall semester of my senior year. As a sociology major, I needed to take just one more sociology course to complete the major requirements . Because I hadn't taken a 2000 level class yet (yes, this devil class is 2000 level, I don't know why), I chose Culture in America. I thought \"I'm a sociology major, I've taken like 8 seminars, written 25 page papers,--this whatever lecture will be a breeze!\" I was wrong and naive! This class is not sociology- it is a cluster f-ck. I can't give you a lot of detailed info about how difficult the midterm and final were--I don't know because I withdrew (the smartest thing I have ever done, probably). As another reviewer said, I was dazzled by the positive culpa reviews--during his first lecture, he was so eloquent, so smart, etc. Listening to his class is like listening to a lecture in a foreign language you have a vague familiarity with, like you've heard it in a foreign film with sub-titles before or something. It sounds really pretty and you wish you understood what was going on, but you have no idea what is going on. He often threw out crazy terms on the board and never unpacked what they meant. Before taking this class, I didn't even realize you could throw the prefix \"neo\" onto so many words. He assigned basically a whole book a week, and sometimes wouldn't even discuss the material in class. Also, I can't afford to buy this many books. I can speak confidently that his tests were monsters and made about as much sense as his lectures did. Do with this information what you will. Don't even bother PDF-ing it, because you will have to put more effort into that \"C\" then you can even understand right now. \nTLDR; DON'T Take this class. Withdraw if you already have. Pray if it's too late. \nWorkload:\nA lot of reading (a couple hundred pages a week), midterm, final, paper. \n"
        },
        {
            "course_name": "Culture in America",
            "review_date": "March 24, 2015",
            "review_content": "\nDo not take Culture in America. I was accidentally placed in this class as a first year and the first two lectures he was amazing. Then, slowly over the semester, he deteriorates into random anecdotes, weird stories, discussing readings we never did and more. He will write random words on the board, and just completely confuse us. His tests were IMPOSSIBLE. I did all the readings (mind you, which are A LOT) and got a C on both the midterm and the final. He's a nice guy- I met with him during office hours and he tried to give me advice about the tests but it did not help a bit. He'll pick random stories from the readings for the tests, and it's impossible to 1. remember that much 2. answer them the way he wants. Unless, of course, you meet with the TAs constantly. Do not take this class. \nWorkload:\nLarge amounts of weekly readings\nOne midterm, one finals, one paper\n"
        },
        {
            "course_name": "Culture in America",
            "review_date": "March 24, 2015",
            "review_content": "\nDo not take Culture in America. I was accidentally placed in this class as a first year and the first two lectures he was amazing. Then, slowly over the semester, he deteriorates into random anecdotes, weird stories, discussing readings we never did and more. He will write random words on the board, and just completely confuse us. His tests were IMPOSSIBLE. I did all the readings (mind you, which are A LOT) and got a C on both the midterm and the final. He's a nice guy- I met with him during office hours and he tried to give me advice about the tests but it did not help a bit. He'll pick random stories from the readings for the tests, and it's impossible to 1. remember that much 2. answer them the way he wants. Unless, of course, you meet with the TAs constantly. Do not take this class. \nWorkload:\nLarge amounts of weekly readings\nOne midterm, one finals, one paper\n"
        },
        {
            "course_name": "The 2012 Election and Beyond",
            "review_date": "January 05, 2014",
            "review_content": "\nProfessor Rieder is a sweet, funny, laid-back dude who knows more about sociology and politics than just about anyone. The structure of each class goes something like this:\n1. He gives a mini-lecture (about 10 min), which is, unfortunately, VERY confusing. He sometimes writes on the board, but that doesn't help much... and often makes things even hazier. Rieder knows a TON about the subject matter and is clearly very passionate about it, but he does not do a very good job of breaking down concepts or explaining things in general.\n2. Class discussion building off of his mini-lecture, centered on the readings for that day\nRieder constructed the course so that we'd do all of the readings in the first ~2/3 of the semester, so the last ~1/3 of the semester would be dedicated to paper-writing and discussing the papers.\nAdvice:\n--If you know a good amount about politics, you'll succeed in this class. If you don't, you will struggle. The seminar students have differing amounts of background knowledge, and Rieder knows this, but it's still rough if you don't have a strong grasp of current political events and political party movements/shifts.\n--It feels much more like a PoliSci class than Sociology.\n--Go to him for advice on your paper if you have questions about the readings/class discussions/whatever. He's very accommodating and likes talking outside of class. The frustrating part is that he won't really end up being much clearer outside of class than he is during his mini-lectures, but it's always worth a shot. Plus, he's a really nice guy and wants to hel you out.\nWorkload:\n-heavy readings each week (pretty normal for a seminar), though he tries to cut them down occasionally. the articles are pretty straightforward, the books are not.\n-pretty intense midterm (ID's that come from readings and class discussion - you're expected to write a few paragraphs on each. it sounds easy but he grades them harshly)\n-final paper (20-25 pages)\n-expectation of participation (it's a seminar...duh)\n"
        },
        {
            "course_name": "Shapes and Shadows of Identity",
            "review_date": "December 26, 2013",
            "review_content": "\nShapes and Shadows of Identity with Professor Rieder is an amazing first year seminar!!! The course material is interesting, there was a relatively light amount of reading, and Professor Rieder truly tailors the class to first year students. Many of my friends in other seminars received typed or written feedback on drafts from their professors, but, in addition to written feedback, Professor Rieder met with every student between the first draft and final draft of each essay. During the meeting, he always gave substantial feedback and read through the whole paper, line-by-line, with me. He corrected sentence structure and style, revised the structure of the essay, and helped talk through my ideas and ways to develop more nuanced arguments.\nAt the beginning of the semester, Professor Rieder told us that participating in seminar-style class discussions is a college skill that we need to learn, like writing a paper or taking an exam. We did not necessarily arrive at college with the ability to effectively contribute to discussions. Throughout the semester, he provided tips on how to properly participate - for example: be concise, focus comments on specific textual evidence, and try to respond to arguments that have already been made. Because participation is 25% of the FYS grade, it makes sense that he TEACHES students how to improve in that area! When students made unsupported comments, Professor Rieder would gently ask them to provide support from the reading, and even give them a minute or two to find it. He encouraged students to speak during class even if they weren't sure whether their answers were 100% correct, and was never harsh or shot down students ideas.\nWorkload:\nOne 4 page compare-contrast essay\nOne 4 page essay on a thematic topic of our choice\nOne 4 page personal essay\n"
        },
        {
            "course_name": "Culture in America",
            "review_date": "November 08, 2012",
            "review_content": "\nI am a full-on Rieder groupie.\nI took a seminar with him freshman year and Culture in America sophmore year. I recruited about 5 of my friends who fell for Rieder the same way I did.\nHe's the kind of Professor that makes you want to work hard for him. And you will do really good work.\nI could go on for hours about Rieder... just do yourself a favor and take this class, if you can get in.\nI pulled from the course's books and topics in many, many classes throughout college. They really stuck with me.\n\nWorkload:\nMidterm and Final, Research paper of your choice. The exams are ID's and essays, very straight-forward and fairly graded. The research paper was about 10 pages but the topic was entirely your choice. I wrote about hamburgers and got an A.\n(And also had some memorable long talks about food culture with Rieder.. he's so rad)\n"
        },
        {
            "course_name": "Shapes and Shadows of Identity",
            "review_date": "February 01, 2010",
            "review_content": "\nI loved this class--for any Barnard first-year who is looking for a great seminar, I recommend him. Rieder is really nice but is also really focused on helping you improve your writing and your analysis in general. He is truly a great scholar in his field--often, as we were discussing racial leaders, he would refer to something one of them had said when he met them. I think my writing really improved through him--there are three papers, and you meet with him for all 3 after a rough draft. He also truly cares about his students and really got to know us. The readings were carefully chosen and rich, and although I had already read some of them prior to the class, I learned new things about them through Rieder. Really recommend him, and I hope to take another class with him in the future.\nWorkload:\nNot bad at all -- manageable amount of reading each night, 3 short papers, draft submitted for each and then a meeting with him before you submit final draft. No exam or midterm.\n"
        },
        {
            "course_name": "Unity and Division",
            "review_date": "August 22, 2008",
            "review_content": "\nProfessor Reider is a great professor. He definately has his pros and cons, but overall you will do well by paying attention to key points in class and focusing on those concepts for readings and exams. Some of the readings seem lengthy, but think basic concepts and terms. Don't get caught up in meticulous details. As far as cons, some students are frustrated by his waivering syllabus changes, but he updates the class daily at the lectures or via e-mail and the changes are necessary in most cases to keep up with the flow of the class. The advantage, is that the test are not really intended to trick you. Know the main concepts and be able to write about their significance in the readings. If you are confused, ask for help. For the papers, he is VERY open to letting you chose a topic and simply support your opinion. The class is not a breeze, but it is definately fair. Also, don't let his terminology overwhelm you. Sometimes he uses complex terms to explain ideas that seem simple, but this will only help you dissect over simplified information better and guide you on what terms you should know for exam purposes. I highly recommend going to class or getting notes if you miss because he covers a lot in one class. Challenging, but I truly loved the class and his teaching style. You will do well if you try. Bottom line. \nWorkload:\nSome heavy readings, but mostly medium to light. Midterm and final are in-class exams for which you write short essays for terms discussed in class and use the readings for support. One 10-12 page paper. \n"
        },
        {
            "course_name": "Unity and Division",
            "review_date": "January 16, 2006",
            "review_content": "\nI very strongly disagree with the previous review.  This class was a huge disappointment and I do not felt like I learned anything new.  Rieder's lecture style is dry and he over complicates pretty straightforward concepts.  Rieder would challenge students' views by twisting what they said and posing questions in order to complicate ideas on race and identity.  Although he is undoubtedly a pro in the world of sociology, I would highly recommend NOT taking this course.  The syllabus was disorganized and lacked unity surprisingly enough.  I still am left confused as to what he actually wanted on the exams.\nWorkload:\nClass participation (although only the same ppl talked throughout the semester); one midterm, one paper, one final.  Disorganized sets of readings.\n"
        },
        {
            "course_name": "Unity & Division in American Culture",
            "review_date": "December 19, 2005",
            "review_content": "\nThis class is absolutely phenomenal. Rieder is extremely knowledgeable and enthusiastic, and very engaging in lectures. The discussions and lectures in class usually made me wish they would go on all day rather than be confined to an hour and fifteen minutes. The class deals with issues of unity and division in contemporary America in the areas of politics, race, immigration and cultural identities, all of which are topics that are extremely current and useful to understand and think about for everyday life. Rieder typically explains difficult readings, and asks questions to stimulate input, making doing the readings (which are by and large very interesting) useful and productive. He is very encouraging of ideas and provokes discussion in class whenever time allows. Definitely take this class.\nWorkload:\nMidterm, final and term paper on any aspect of the course. Somewhat heavy reading, but mostly enjoyable, and he tells you which readings are important for each class (while some can be skimmed before exams).\n"
        },
        {
            "course_name": "Sociology of Culture",
            "review_date": "December 29, 2003",
            "review_content": "\nThis class should be renamed \"The Art of Stating the Obvious\". Apparently, things you do in everyday life that you don't even think about warrant 100 pages of reading and a 3 hour discussion. Despite, Rider is a good professor--very intelligent, nice (brings cookies) and allows for class arguments. He also thinks that everything you say is brilliant, even if it ain't, so it's good for self esteem. Recommended professor.\nWorkload:\nReadings from light to very heavy, 3 papers, midterm, final. Heavy, but not overwhelming.\n"
        }
    ]
}