{
    "prof_info": [
        {
            "prof_name": "Ha Nguyen",
            "prof_id": 12567,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 20, 2013",
            "review_content": "\nThoroughly OK class. You know, the kind where the whole population shows up the first day to get the syllabus, then the population turns into an ever-dwindling sample as people start skipping. Come midterm time, it's like \"Whoa, where did all these people come from?\" But if you'd rather catch up on your Z's than brush up on your Z-Scores, that's fine. \nSeriously. I am 95% confident that Prof. Nguyen let us out 10 to 15 minutes early every class. And everything he covered in class is also clearly explained in the textbook. Hence, no need to attend class except to turn in homework and take tests. \nIf you choose to attend this class faithfully (which I did), here's what to expect:\n - Prof. Nguyen speaks with an accent, but it's not too hard to understand.\n - His lectures consist of him reading powerpoints and scribbling notes/diagrams using\n   messy handwriting. Not too hard to decipher, though.\n - He will answer questions in class. Sometimes, it's helpful.\n - He will ask questions in class. Usually, no one responds.\n - You will get out early.\nHaving had almost no background in statistics, I learned a good deal in this class. Once we got past the median, mean, mode stuff, we covered normal distributions and probability before taking the midterm. It got significantly harder after the midterm due to more advanced topics such as hypothesis testing and comparing means. Prof. Nguyen does a pretty decent job explaining things, and he's a nice guy. But the book is decent and nice too.\nLike I said. Thoroughly OK class. No harm in taking it. If you have a background in stats, I would recommend a higher level course unless you take pleasure in skipping class all the time and getting an easy A. \nWorkload:\n- Homework problem sets straight from the book, 6 to 15 questions each; assigned at seemingly random times, maybe once every 2 weeks, I don't remember (25%)\n- Midterm; fairly easy, average score was like 88 (35%)\n- Final exam only covering the material after the midterm; harder than the midterm due to more challenging topics (40%)\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 25, 2012",
            "review_content": "\nProfessor Nguyen is a horrible teacher. This class was uninteresting, poorly taught, and an altogether disappointing introduction to the field of statistics. His English is understandable, but only if you really focus (which will get more and more difficult as the class/semester goes on). Professor Nguyen went extremely slow in the beginning of the semester, ran out of time at the end, and then rushed 5-6 chapters in in two weeks. Take this class with him only if you are already familiar with all of the concepts (AP Stats) but don't plan on being taught any of them. I was unfortunate enough to be unfamiliar with the concepts so I spent most of my time for this class teaching myself the chapters. The class isn't hard, the professor was just bad. \nWorkload:\n~6 homeworks (usually 15-25 questions from the back of multiple chapters), graded very easily. \n2 midterms, 5-6 questions each, graded very fairly with high means on both (80-90)\nfinal, 5-6 questions, non-cumulative (essentially a third midterm)\n"
        }
    ]
}