{
    "prof_info": [
        {
            "prof_name": "Abigail Rabinowitz",
            "prof_id": 4571,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "June 14, 2016",
            "review_content": "\nAbby teaches UW in Sustainable Development. If you are so fortunate to have her as your teacher, stay in the class. You WILL work a lot but cannot describe how much your mind will have grown after the most intellectually provoking class for freshmen at Columbia.\nUW was a class in which I became more aware of myself and the world around me. This conclusion is a result of having an instructor like Abby.\nI have never had a more inspiring professor than Abby - one of the very few people whom I consider purely brilliant. Abby is one of the most intelligent people I have ever met and one of the most inspiring critical thinkers. I usually do not even go to office hours in my other classes, yet I went to 80% of Abby's, just because, on the one hand, her very optimist demeanor made me trust myself and inspired me to immediately go to explore the ideas we were generating together, and on the other hand, her very fast and research-oriented thinking allowed me to have the most intellectually stimulating conversations in my life. In a world abundant in hackneyed ideas, where sometimes you feel that everything has been explored and there have been so many ongoing discussions on almost any topic you might think of, Abby showed me how to bring my own contribution in an innovative way. \nBefore University Writing, I thought that having a decisive conclusion/opinion on a topic was impossible given the myriad of argument and counterarguments one can find. Yet, through P2 and P3, I realized that researching, exploring a conceptual problem from many and contrasting angles, allows you to hold an opinion on a topic and gives you trust to sustain it. Abby taught me for the first time in my life to start an essay with a question I wanted to answer -- not a claim disguised in a dishonest question. Thanks to her constant support (challenging me with further and even more intellectually stimulating questions on my topic, teaching me how to not distort the data and quotes that I find in order to fit my \"evidence\" and instead see them as an opportunity to explore even more my question, summarizing my sometimes disordered ideas), I had some of the most rewarding moments in my life: the satisfaction of coming up with my own claims after a most intellectually engaging research. \nFurthermore, I cannot thank Abby enough for how supportive she was of everyone's ideas. This attitude can only show how -- not even open-minded, because it would be too modest a description -- intelligent she is, for an intelligent person is, above all, curious. An intelligent person sees ideas everywhere and is interested in how everyone came to think an idea, which is what Abby did every single time we met with her. \nAll in all, even if I had just taken Abby's class, I am confident I could have called my Columbia experience truly transformative. \nFinally, I want to add a last note. I went to the writing center a couple of times and was never satisfied, I always felt I was losing and wasting my time trying to explain to the instructors my ideas and they were understanding them very slowly, having me to repeat them etc. etc., yet with Abby, who even anticipated what I wanted to say, everything was so much different. Also, when Abby had to be replaced once, another UW instructor came in and it was then that I was completely certain that it was nothing about the course that made our classes extraordinary -- it was just Abby's way of teaching it. With Abby, time flew and did not know how to take more advantage of every single minute spend in a class coordinated by such a gifted person, whereas with the other instructor I was constantly looking at the wall clock. I am not saying that the other instructor was not an expert in writing; what I want to express is that Abby is a genuine professor. \nAbby is a genuine expert in writing, but so are many writers - what makes her the best professor I have ever had is that Abby has genuine pedagogical and  communication skills and, above all, a superior ability to think critically. \nIn terms of feedback, never have I seen such a dedicated professor. She volunteered to even record herself giving feedback, on top of writing very insightful comments! Never has she refused to meet up with me during office hours and she has always responded to my emails as well. \nI appreciate my instructor immensely and I thank Columbia for hiring such uniquely gifted people like Abby, who have offered me the possibility to develop as a critical thinker in one year, especially the last semester with UW, more than I had in all the previous years of my education.\nWorkload:\nTypical UW workload - 4 papers (no rewrites) and some exercises from class to class (not always though) which are ungraded\n"
        }
    ]
}