{
    "prof_info": [
        {
            "prof_name": "Sidney Hemming",
            "prof_id": 696,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "V2200 Solid Earth System",
            "review_date": "May 16, 2013",
            "review_content": "\nMy take:\nThis class was totally worth taking. I can honestly say that it enriched my academic experience and taught me fascinating and relevant facts about the earth's geological history - something I feel that everybody should know if they graduated from a liberal arts college. The TAs were all extremely helpful and willing to answer all questions related to labs. The professors, I will admit, read directly off the lectures but they're so awesome that I didn't care anyway. Plus, the lectures were straightforward and easy to understand so them reading it off wasn't a waste of time. This is one of those classes where you get to know your classmates because of labs, TA office hours, fieldtrips, faculty student dinners, etc. I also got to know my professors: both Steve and Sidney are sweethearts and passionate about their field, as are all the TAs. \n\nWorkload:\nWork:\n13 labs\n1 midterm\n1 final\nlabs will take you a good while, a solid half a day maybe if you focus, depending on the lab. However TA office hour was deadly useful and I will admit I was one of the students who were scrambling to finish lab on time. However I always did because the TA as well as all the other students who came, were all useful. Theyre not graded too harshly, as long as you explain your logic. \nMidterm was a bit of a fucker for me because of the short answer. You could study enough but if you didn't hit all the points they wanted you to then you lose A LOT of points. key was to just write everything you possibly knew down.\nJust took the final and it was pretty easy. Steve's final was way more straightforward since there were no essays. \nYou could keep up with the reading or you could cram, and still do decently well.\n\n"
        },
        {
            "course_name": "V2200 Solid Earth System",
            "review_date": "April 08, 2013",
            "review_content": "\nDo not take this class and if you have to, lecture is a waste of time. Just print the slides and read them on your own. That is all that is done in class. Professor Hemming and Professor Goldstein just read their slides word for word in each lecture and there are roughly 60 or more slides per class. Lectures are dry and long. \nFor at least six classes, Professor Goldstein just talked about his many research trips and anecdotes. He would then tell a joke and wait for someone to laugh or say \"Has anyone ever been to...?\" or \"Is Anyone from...?\" with no response and would wait until he could find a place that someone had been to. About halfway through the semester most of the class stopped showing up. \nThere are field trips every two weeks some of which take place during the winter outside in the cold (it was 20 degrees when we went) for three hours and some of which take an entire weekend day.\nWorkload:\nAbout 10 labs which are tedious and often not very helpful. Professor Hemming is a fan of  GeoMapApp so expect to use that a lot. Homework assignments were often due the same week as lab so plan ahead. A fairly easy midterm (practice give) and a final. Easy enough to do well\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 17, 2009",
            "review_content": "\nYour lucky if you Sid as your frontiers section leader. Some professor just stand there and don't go over anything; they really don't help the students learn or understand anything that happened in lecture. Sid is really good at explaining what is flying in this class. If you go to her before class she helps you with the homeworks. Also, you hand your homeworks in after she goes over them, so you are basically guaranteed a 100 on the homeworks. Without Sid I would not have gotten an A in this ridiculous class.\nWorkload:\nweekly homeworks (40%), midterm (25%), final (35%).\n"
        },
        {
            "course_name": "V2200 Solid Earth System",
            "review_date": "May 17, 2009",
            "review_content": "\nO boy, where do I begin. She is the nicest woman on earth, but the worst lecturer in the department. She knows so much, and yet does not know how to enunciate that to the class. Individually though, she is great, she'll explain things in great depth and know your name after the second class. She welcomes all questions, emails, 'pings.' Great to talk to, not awkward like Steven Goldstein and she does want you to learn, they both do. However, unless you do talk to her individually and email her, etc, you will probably not learn anything from her lectures and will cram for the midterm reading/catching up on the 500 pages of reading from the textbook. \nWorkload:\nWeekly textbook readings (which you can probably do during the last minute before the midterm), Weekly labs (The ones Sidney wrote were straight forward and easy), and a midterm (she'll give out practice tests, questions, sample essay questions)\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 25, 2007",
            "review_content": "\nSid was my discussion leader and I was underwhelmed. She will know your name after one class and she really wants everyone to do well, but she is pretty boring and explains things about a hundred times, which can be perfect or agony, depending on your science background. \nOn the bright side, she goes over the WIAs in class BEFORE you hand them in, giving you a chance to correct them in marker before you hand them in, basically guaranteeing all perfect WIA scores. \nShe is not good at explaining topics outside of her field (geology). \nWorkload:\nsame as everyone except she goes over it in class before grading\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 08, 2007",
            "review_content": "\nIf you have Sid for Fro. Sci, count your lucky stars.  She is a kind professor who genuinely cares about her students.  While her lecturing style can be hard to follow, she's good in a small class/ one-one environment. Go to her office hours - she will review the homework with you if you have questions, which not only improves your homework grade, but you'll find yourself far better prepared for the midterm and final.  Additionally, she is great with review sessions before the major exams.  Frontiers of Science is what it is (I still have yet to meet anyone who actually enjoyed it) but we all have to take it, so consider yourself very fortunate if you wind up in Sid's class.\nWorkload:\nStandard for Fro. Sci - Weekly Assignments, weekly questions, midterm, final, extra credit option\n"
        },
        {
            "course_name": "Intro to earth science",
            "review_date": "May 12, 2006",
            "review_content": "\nSid is by far the best thing to happen to the science requirement at Columbia. She's full of life, incredibly knowledgable and adorable! Not only is she genuinely interested in helping you understand the material but she's very flexible and extremely understanding. Take Earth Science with Sid and you'll be thrilled that you did. \n\nWorkload:\n2 midterms, a few quizzes (which don't count - more like exercises), and a final; if you're lucky there will be a field trip! none of the tests are difficult if you study a little\n"
        },
        {
            "course_name": "Intro to Earth Science Part 2",
            "review_date": "May 26, 2004",
            "review_content": "\nShe is the nicest teacher I have had yet at Columbia.  She has the best lecturing format I have seen yet at Columbia if you dont like going to class.  She posts all lecture slides online and then she outlines all the chapters for you and post them as well.  She leaves no hidden information for studying.  Unfortunately all the tests are fill-in so its all recall so you need to know the info cold because there is basically no help if you forget something.  \nWorkload:\n3 exams all equal weight all in class, (ie no exam during finals week and they arent cumulative)  thats 90%, quizzes are 5% and theyre a joke and the other 5% is a mandatory field trip during the weekend which isnt bad because its nice to get out of the city and go to the beach for a day.\n"
        },
        {
            "course_name": "Climate System",
            "review_date": "December 18, 2003",
            "review_content": "\nSidney Hemming is an exceptiona professor and an incredible individual. She goes above and beyond to explain her material, contextualize it, explain its relevance to current research, etc. She also does not loose sight of the larger science issues that complicate climate. Highly recommend\nWorkload:\nmoderate. Lab write-ups are frequent in the Earth System courses\n"
        },
        {
            "course_name": "Intro to Earth Science II",
            "review_date": "May 01, 2002",
            "review_content": "\nI have to disagree with the last review. Sydney is slightly overenthusiastic and disorganized, but this really isn't a bad thing. She's really nice, the class is small for an intro class, her quizzes and tests are EXTREMELY easy, and she took us on a field trip to Fire Island which basically consisted of wandering around a beautiful beach on a sunny day. If you make an effort to actually read the book once in a while and get up for the 10 am Friday classes, you'll have no problem. Awesome way to fulfill the science requirement.\nWorkload:\nweekly quizzes just to make sure you're not slacking TOO much, 2 midterms (one was fill-in-the-blank with a wordbank!), final. field trip is extra credit.\n"
        },
        {
            "course_name": "Introduction to Earth Sciences, II",
            "review_date": "April 23, 2002",
            "review_content": "\nAvoid this class and this professor. She's enthusiastic and wants to teach but I don't think anyone in my class learned much. Rapid-fire powerpoint lectures full of jargon left unexplained left us dizzy and unprepared for the quizzes and exams. The only saving grace was the lectures and the powerpoint files were placed online so we could try to figure it out later.\nWorkload:\nAnnoying quizzes weekly, sometimes more often; two midterms, a final exam\n"
        },
        {
            "course_name": "V1012 Introduction to Earth Sciences II",
            "review_date": "September 09, 2001",
            "review_content": "\nOne of the better teachers I have had at Columbia. I would suggest earth science to anyone who is looking for a a way to fulfill the science sequence requirement. She was very enthusiastic and made it a point to tell the class that she doesn't care about your attendence record, as long as you learn the material.\nWorkload:\nShort (1-3 question) weekly quizzes, 2 or 3 midterms, and a final. One field trip and a report as well.\n"
        }
    ]
}