{
    "prof_info": [
        {
            "prof_name": "Roger Mesznik",
            "prof_id": 390,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Corporate Finance",
            "review_date": "May 15, 2013",
            "review_content": "\nRoger Mesznik is definitely a brilliant man. He fills the class with random tidbits of information and sometimes goes on tangents telling stories from his experience. Because of this, class is always very interesting. That being said, what is taught in class rarely relates to the homework. The textbook and the internet is a huge help on homework. Also, a warning: Roger can be fairly intimidating in class. He calls on people at random, will yell at you if you are on your phone. He is genuinely a nice guy though and as long as you pay attention, you'll be fine. Attendance is taken every class, not sure how it affects your grade though.\nHomework consists of two parts: assignments and cases, all of which require the use of Excel. He does go over a lot of the Excel in class. You are allowed to form homework groups and only have to turn in one copy. For each homework, a group is assigned to present to the entire class. The assignments are fairly straight forward, just a couple of problems. The cases are all taken from the Harvard Business School. He requires that you all buy the case pack at the beginning. Do not have everyone buy it. It's like $90 just for access to a PDF. It would be better to just split the cost of one account. There is no point in having everyone buy it. For the cases, Roger gives you almost zero guidance. it is hard to figure out exactly what he is looking for. Expect to spend a LOT of time on each case. Word of advice: google the case to look for guidance. These are pretty famous cases so there is a lot of help on google. The homeworks are all seemingly graded randomly, seemed to have little affect on the final grade (all around the avg).\nFor the midterm and final, it is open book and you have to bring your laptop as the use of Excel is required. The format is around 6 questions, each with multiple parts. Roger gave us a list of review problems before each exam. If you are comfortable doing these problems, you will be fine on the exams.\nOverall, I would recommend this class. Roger makes the class interesting and I felt like I actually learned a lot from doing the cases. Just be prepared to spend a long time each week on the homework. I disagree with the previous review about the average being a C. He specifically stated in our class that if you do better on the final than the midterm, he won't count the midterm. If you pay attention and know your stuff, this isn't a hard class to do well in.\n\nWorkload:\nHomework: assignments plus cases worked on in groups. For the cases, he will assign two of them in a row and you only have to turn in one. There were like 9 cases assigned altogether, turn in 4-5. It averages out to around a homework (either assignment or case) every week. Done in a group but can take a long time. Each group must also present once.\nMidterm and final: open books, open notes, laptop required. If you do the review questions, you'll be fine\n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "May 14, 2013",
            "review_content": "\nMesznik by all accounts and appearances is a smart fellow. But he is lazy and doesn't give a concerted effort to teach the class. He's interesting, tells a good joke, and certainly knows a lot. But I can count on one hand how many lectures he spent teaching. The majority of the classes you can expect to be presenting your assigned cases to the class, and whether or not you are correct he doesn't care. He'll just tell you that it's ok to make mistakes. If you're like me, you'll be dreadfully bored to death.\nIf you have no background in accounting, I'd advise you to take that before signing up for his class or take another section. He assumes everyone is born with understanding of accounting concepts.\nThe cases are a drag. You and every other group will be aimlessly wading through the desert with no clue which direction is correct. In the end, you'll just pick a direction and hope you'll find water. The TA was similarly clueless, and will give you 12-14 out of 15 as long as you made it seem like you knew what you were talking about. Expect long nights and much frustration in the cases. On the bright side, literally nothing in the cases will show up on the exams.\nExams are open book open notes. You can use your laptop. It won't help. Standard problem is something of the sort: find the NPV given the following information. You'll do out all your work on excel, but he wants the answer in the blue book and he only grades the blue book. Cross your fingers you don't make a mistake. That said, the exams aren't difficult. But they rely heavily on accounting nuances (e.g. book value vs. market value, COGS, etc.)\nJust for reference, I walked out of the class with an A. I did well on the midterm and final, and that's not a testament to his teaching or my learning abilities (as far as Ivy League students go, I'm pretty stupid). It is however a testament to just how useless this class is. If you have a solid groundwork in other financial classes (e.g. you understood Financial Economics and Accounting pretty well), then you can not show up for a single class and walk away with an A like me. But of course...attendance is mandatory for Mesznik.\nAlso, Mesznik does NOT curve well. Mean/median on the midterm was a ~68 and he said add 7 for the curve.\nWorkload:\n4 group cases (easily over 20+ man hours for each one), 3 HW assignments, 1 midterm, 1 final. \n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "January 31, 2010",
            "review_content": "\nRefer to the 2007 reviews because he hasn't changed.   He could be the worst professor ever lived on this planet.   Why?   He practically doesn't teach us anything!  He rambles about useless things that can be found in the textbook but the cases require more advanced, in-depth knowledge which he just expects us to know.  On top of that his assignment instructions are SO ambiguous and poorly organized.  What's the point of him being a professor if all he talks about can be found in the textbook?  He's just there to call on students, not to teach.   No wonder why he wants us to work in a group.  This is not a difficult course if professor is decent, but the fact that he doesn't teach us anything makes it particularly difficult and impossible to do ill-organized cases.  The majority of students received Cs for this course.      \n\nWorkload:\nweekly cases\n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "December 10, 2007",
            "review_content": "\nI just finished a term with Mesznik.  He would make a great tour guide - full of knowledgable tid-bits and artifacts. But, as an instructor he is weak.  Specifically, he is terribly unorganized.  Both the classes and the exam felt like a roller coaster where you aren't sure what is coming up but you know it can't be good.  \nOverall - thumbs down. \n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "November 13, 2007",
            "review_content": "\nThe worst professor I have had. Ever. He has no structure at all in his teaching, he does not use any slides, he does not teach any method at all, he has no prepared solutions for the cases, and he rambles about things that are totally unrelated to the topic. I have not learnt a single thing during his lectures, everything I learned is from the book and fellow class mates.\nWorkload:\nHigh, several extensive cases to be handed in and an extensive test at the end of the class.\n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "January 04, 2005",
            "review_content": "\nTAKE THIS CLASS.  If there is one Finance-related class you take at Columbia, it should be this one and it should be with Mesznik.  You cover only case studies in the class and Mesznik presents all of the material in a very coherent, cohesive, everything-is-totally-logical manner - and... he's SUPER FUNNY too!  It was great to take this class with him; he made Finance not only interesting and easy to understand, he also made it relevant to our lives by bringing in only real-world examples!\nWorkload:\nTotally easy.  1 midterm + 1 case study that you write a report on and present in class + 1 case study that you write only a report on.  Final is optional.  Getting an A is a cinch.\n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "December 21, 2003",
            "review_content": "\nMesznik- great teacher & a guy that has a personality...He makes the material easy to learn, but make sure to pay attention in class because he likes to pick on those who look lost.  If you're at all interested in finance after graduation, you should take this class with Mesznik, he will explain the ins and outs of basic corporate finance for you.  He is good with grading, if you do well enough on the midterm you dont have to take the final.  Everyone gets similar grades on the case study, so basically the midterm/optional final are where your grade comes from.  Really good prof.\nWorkload:\n1 group case study to be presented in class, 1 written case study to hand in.  1 midterm and optional final.  Come to class and you'll do fine.\n"
        },
        {
            "course_name": "Managerial Accounting",
            "review_date": "November 29, 2003",
            "review_content": "\nProferssor Mesznik was one of the best Professors I have had yet in the managerial accounting.\nHe rocks !!!  - and this is a real threshold in this science\n"
        },
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "May 07, 2003",
            "review_content": "\nMesznik rocks!  This guy is totally awesome.  His lectures were fun, informative, and never boring.  He calls on people to keep things interesting and is always nice and encouraging to them.  He wants you to be able to understand and apply this material and uses his lectures/questions to help you make the connections.  His jokes are hilarious.  If the class does well he'll give you the choice to accept your grade without taking the final!  One of the best professors I've had.\n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "December 23, 2002",
            "review_content": "\nProferssor Mesznik was one of the best Professors I have had yet in the finance department. His lectures were uplifting and energetic. He has a great sense of humour and goes out of his way to make sure you truly grasp the material. He is entirely FAIR on all of your grades. I truly felt like I walked away learning a great deal from this class.\nWorkload:\nThere is a oral and written case study. My reccommendation is to do the best you can, but dont spend too much time on them, rather invest your time on studying for the midterm. No matter if you are right or wrong on the cases, he gives everyone A's.\n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "December 21, 2001",
            "review_content": "\nGreat class! He's a good professor. Definitely has a sense of humor, which can sometimes be a bit offensive, but he does it to keep you energized and alert through the 2 1/2 hour class. The presentations are a bit difficult, but he is very resourceful and willing to help you. Final was optional this year if you were satisfied with you midterm and case study grades. Highly recommended for those who want to do something withing financial services and investment banking.\nWorkload:\nMidterm, 2 case studies (1 presentation, 1 written), and optional final.\n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "December 31, 1999",
            "review_content": "\nTerrific class: Mesznik is probably the most interesting and clear professor I've had. The material is very interesting, and 70% of the class got A- or above. Plus, he missed 3 out of 12 lectures, and since he felt bad about that he made the final optional. Nothing wrong with that.\nWorkload:\n2 projects (which take a really long time even though together they count for 25% of the grade), midterm, final.\n"
        }
    ]
}