{
    "prof_info": [
        {
            "prof_name": "Karen  Benezra",
            "prof_id": 12893,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 24, 2015",
            "review_content": "\nAgreeing with the two reviews below mine for sure. All in all I had a pleasant experience with Karen, enough so to stay in her section for two semesters. She has the following way of dissecting texts: she offers up an idea which initially sounds extremely confusing, yet intriguing enough to keep you listening, then builds on the idea throughout class, molding it in different ways according to other thoughts the class pitches in, until finally it starts to emerge with clarity and you find yourself with a solid grasp on the text. You aren't quite sure how you got there, but you're there. There are definitely times when the class never quite reaches this moment of clarity. but luckily there was almost always some brave soul who would flat out ask \"what exactly does this mean?\" in which case Karen would eagerly try again and take another approach to explaining. That being said. there was never any question left unfulfilled. If you are into getting your facts hard and fast, this isn't the section to take. Personally, I found myself getting a lot out of the process approach we took-- tossing ideas around and around until we finally come to something gold. It encourages deeper thinking, which yes, is draining and annoying at times, but worth it in the long run, in my opinion. \nSomething to note about Karen is that she feeds off the vibe of the class. I feel like our first semester class was a lot more enthusiastic and conversational, and as a result Karen was always very chipper and into her lectures. In the second semester, there were times when she made it clear that she was let down by our frequent silences and tendencies to leave the talking to individual people, rather than responding to one another. Because of this, I think the experience you get with Karen can really depend on your classmates. This is generally true with newer teachers. \nAs stated below, Karen is very fair with grading in terms of essays and tests. She never makes the workload overwhelming, and you won't find yourself scrambling to get stuff done for CC with her. However, she's pretty strict about participation. You won't make an A if you only participate one and a while. She will notice if you're absent, and she even got mad once because people kept leaving for the bathroom. It's definitely rooted in good intentions, though, because she just wants her students to be as enthusiastic about the material as she is.  \nAlso if you frequent the gym you can probably bond with her over that. I lost track of how many times she related our texts to working out at the gym, or like restraining oneself from eating a brownie. \nWorkload:\nRefer to reviews below\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 08, 2015",
            "review_content": "\nLike the review below, I had a good time in Karen’s CC section, so I will refrain from repeating it. I agree with most everything they said: she had a sort of humor that some people did not appreciate, or were less obvious in their appreciation of it. That being said, she was very careful to illuminate all the points of the reading that she thought were important, or that others thought were important. \nShe did, however, seem to be a little too eager to solicit class participation. She would often stop what she was saying as someone raised their hand, and I would rather she finish what she had to say, then call on the person, so that they could form a discussion. That’s not to say we didn’t have discussions, but I felt that most of the comments from the students were often very, very discursive (one brought up his aunt’s experience in Macedonia under Tito, and another brought up a comment Karen made **literally** a month earlier), yet she often entertained these sorts of comments by replying to them. \nBut, all in all, she is a good CC professor who will only improve as she teaches the course. She is more than fair when it comes to grading, and often praised the class for our successes on the exams and essays. She isn’t some amazing professor, definitely not gold-nugget material, though she is a solid professor and if you have her, I would not change. \nOne thing to note is that Karen makes some very liberal changes to the syllabus. I felt that some were very welcome, while others would have been better left off. That being said, she is careful to introduce ideas that are important in academia, especially from a leftist slant, which she will come at you with **very explicitly**. Seriously, she is incredibly well-read in all sorts Marxist theory, and will often take the time to explain it. She once spent quite a bit of time explaining the theory of nations. But she is very open to understanding all other ideas and, as long as you can support them, will be more than happy to entertain them and take you seriously. \nFor second semester, if you are **really, really** looking forward to reading Wollstonecraft, Woolf, Du Bois, Fanon, etc., then you should switch out. She removed all of those authors and replaced them with “Dead White Men.” She did add, however, Toussaint Louverture and other documents from the Haitan Revolution. The additions were welcome, though I would have appreciated reading Woolf, Du Bois, Woolstonecraft, etc., even if just for their historical importance. \nTo give you an example of the changes she made, just looking at the CC website, I can tell you we did not read (or read different selections than my other friends): American Revolution texts, Burke, Wollstonecraft, Du Bois, Woolf, The New Testament,  or Scientific Revolution texts. If having these texts is important to you, then I suggest you change. However, you may appreciate the different slant she takes, so if you think you would enjoy it, I would definitely stay. \nIn all, Karen is a very solid choice. She will entertain you with stories of mango peelers in Washington Heights, her Marxist take on almost every aspect of life, and *incredibly* obscure references. I found her hilarious and am very glad to have been able to take her section. \n\nWorkload:\nVery manageable. \nReading is often < 50 pages per class, very rarely does it exceed that amount. \nFirst semester had two 5-6 page essays (40%) and 2 page response papers (20%). Prompts are given. Final and midterm were 10% each. Participation was 20%. \nSecond semester had one 2 page response (15%), a 4 page critical summary (15%) and a 6 page essay (30%). Prompts are given. Final and midterm were 10% each. Participation was 20%. \nFor essays, she values style, clarity and organization. If they are well-planned and well-written, you will likely do well. \nMidterm and essay consisted of five IDs, and two very short essays (200 words each). She is somewhat strict about word count and length, so be concise. Each was only 10% of the grade and noncumulative, so no need to worry. She gave the prompts for the essays in advance, and would select among those prompts for the exam. \nLike the review below, I recommend her section. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 05, 2014",
            "review_content": "\nOverall, I had a decent experience in Professor Benezra's CC section. Karen Benezra is a very sharp, kind woman who is receptive to our ideas regarding the texts, even to the tangential ideas we sometimes asked about in class. She does tend to speak very quickly, but has improved on this a bit (I know because I was also in her section first semester). I acknowledge that the vast majority of the class moved out of her section after first semester, but this was due to a combination of her being a new professor, her exposition of the texts was very scholarly (sometimes not the best approach for an undergraduate, intro class), and the kind of students who simply wanted an easy ride through CC.\nThe class typically opens with a question about how we found the reading, a short presentation from one of the students, and then a lecture style introduction of the text, with a few stopping points for discussion here and there. I think this is one of the few qualms I had with the class - sometimes the lecture style makes it difficult to interject with a comment, if you're one of the more quiet types, such as myself - but I realize that it's her first time teaching an undergraduate, seminar style class, so I expect that she will become one of the better CC profs in the future. She's very practical, so we usually get out of class 15-20 minutes early if she feels we've covered the material that she planned to go over. \nShe has a self-deprecating sense of humour, which I found slightly endearing, especially since it provided some sort of comic relief when we were analyzing heavy political philosophy texts. On top of that, she's extremely respectful of us as students, sometimes openly calling us smart and hard-working, to the point where it once made me feel slightly uncomfortable. I guess it's rare to have a professor who is not only not condescending, but understanding of her students. One of the only other qualms I had was that she changed most of the second semester CC readings to political philosophy and theory, so I feel like I missed out on a bit of the experience I was \"supposed\" to get out of CC, even though I'm aware that the relationship between the texts on the original syllabus is slightly superficial. I wish we could've read Woolf, Gandhi, and du Bois, but I still did get a lot out of the last few readings.\nThis being said, if you're simply looking for an easy CC experience, I wouldn't recommend this class. Prof. Benezra grades very fairly, so if you work really hard and really know how to write, you'll scrape by in the A-range. She gives number grades, BTW. If you're a decent student, you'll probably end up with a B+. I seriously think this is the most anybody could ask for in a fairly rigorous CC class, though. It may not be a life-changing or mind-blowing experience that some students purport to have in the best CC sections, but I feel those kind of experiences are rare, even at Columbia.\nOh yeah, and try office hours if you can. I never had time to go to her office hours, except for one time the first semester, but it was really helpful to talk to her and know how to write for the essays. She also checks up on how you're doing at school, so I would've gone again if I had the time.\nWorkload:\nComparatively light.\n2 reading responses.\n2 essays, 5-6 pages each.\n1 midterm, 1 final. She gives you questions ahead of time so you can prepare, and picks two of the questions for the exams.\nI would recommend her section. \n"
        }
    ]
}