{
    "prof_info": [
        {
            "prof_name": "Zoe Crossland",
            "prof_id": 3206,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to 21st Century Archaeology",
            "review_date": "May 13, 2015",
            "review_content": "\nDon't do it.\nShe doesnt do Archaeology justice. It is obvious that this class is at the bottom of her list. I really regret taking this course... uninteresting and the Ta was useless. Even though it was a very small class she wont even know her face.\nYou dont even have to show up to follow along, most of the class didnt. The TA grades everything by herself.. dont cout on her to help you out or read your work.\nWorkload:\nWeekly (ungraded) discussions on courseworks\nLots of reading\n1 Midterm paper\nFinal exam\n"
        },
        {
            "course_name": "Archaeology and Africa",
            "review_date": "December 20, 2013",
            "review_content": "\n\"Now on to the real issue: I have never heard any prejudiced language from the TAs in this course, from either Natasha or Mark. Throwing out incendiary remarks is more than childish. It's hard to imagine that the person who penned the review is indeed, as they claim, a junior. They sound more like a scorned middle schooler who is out for revenge.\"\n...I'm not sure where this reviewer was the whole semester. This class was a total nightmare and the attitudes of the TAs absolutely appalling. I agree with all reviews posted thus far except the one mentioned above. As for calling the comments of one reviewer \"incendiary\", I would note that the comments made by the TAs were far more incendiary than anything else I've heard at Columbia so far.\nI only disagree with the other reviews in that I do believe I actually learned one or two things this class. Yes, it made complicated issues far too simplistic and yes, some totally ridiculous comments were made, but the map of Africa quiz and the midterm paper really broadened my knowledge of the continent. That said, I probably could have learned the same amount (if not more) after an hour on sporcle or a single trip to the Museum for African Art.\nZoe was wonderful but I don't think she shines in such an intro-level class. It seemed like she didn't know how to deal with some of the ludicrously uninformed (and often downright racist) comments made in class -- not that that's entirely her fault; I'm not sure I'd know what to say to a Columbia student who still thought all African religion was \"voodoo\" either.\nWorkload:\nThe readings were useless and far too long, but as I said above, I did enjoy the midterm paper and quizzes.\n"
        },
        {
            "course_name": "Archaeology and Africa",
            "review_date": "December 15, 2013",
            "review_content": "\nThis course was one of the worst classes I have ever taken - if not the very worst class . I don't know why everyone before me is being so positive on Zoe. She's very sweet and loves the subject, but her lectures are incredibly disorganized. I have no idea what I was supposed to get out of the class about African archaeology, other than the general theme of white people sucking, which the TAs shoved down our throats repeatedly. \nBecause of this emphasis, it felt like we never actually talked about African archaeology - just the Western gaze. One student late in the semester asked that we move on, take the western framing as a known fact and actually talk about Africa. Nope. TA Natasha shot her down, implying that our class was too dumb to get that point so we'd be addressing it as we had for the rest of the semester, i.e. talking about this and only this. Someone raised a point about this perpetuating stereotypes, and Natasha then said it wasn't archaeology's job to do anything, but rather to critique, since it's academic. \nWell, I won't go into this here, but archaeology has a huge political and cultural impact. Ignoring that is 1) ignorant and 2) extremely harmful when racially-charged comments are tolerated (i.e. treated as acceptable in class). TA Mark wasn't much better, also on more than one occasion pointing out the inferior minds of the students in our class. How is that helpful in any way? And if we're so  dumb, please teach us! Neither TA provided comments or criticisms on anything turned in.\nAssignments were vague. Readings were dense and had nothing to do with lecture. The TAs were condescending and sometimes flat out offensive. Zoe didn't do much to address racially-charged comments made in class, which I think creates a very bad environment and promotes closed-mindedness by not calling it out.\nTLDR: Do not take this class. It's a waste of your time. \nWorkload:\n2 short papers (responses to readings, attend 2 sections discussions along these lines)\n1 midterm - 10 page paper on an object\n2 map quizzes (TA Natasha managed to be condescending about this, too, regarding us not being able to handle the second one)\n1 final - no idea what to expect since I feel like a lot of random info was thrown out at us, but the exam is supposed to be thematic\n"
        },
        {
            "course_name": "Archaeology and Africa",
            "review_date": "December 12, 2013",
            "review_content": "\nI both agree with and disagree with the previous post about this class. It could have used more structure, certainly. Many of the comments in class were a bit rudimentary, but this is a core, low-level class, and as such, the students in the class were not, by and large, Archaeology majors; they were taking thsi course to fulfill a requirement.\nNow on to the real issue: I have never heard any prejudiced language from the TAs in this course, from either Natasha or Mark. \nThrowing out incendiary remarks is more than childish. It's hard to imagine that the person who penned the review is indeed, as they claim, a junior. They sound more like a scorned middle schooler who is out for revenge.\n\nWorkload:\nLots of reading. Minimal other work. Midterm paper. Final. \n"
        },
        {
            "course_name": "Archaeology and Africa",
            "review_date": "December 09, 2013",
            "review_content": "\nThe previous review was unfortunately made prior to today's class in which my personal favorite comment was made. \n*Discussing a wooden object that was found on an American plantation in which nails are driven into as a spiritual practice\nZoe: \"Who would be constructing this object? Think of gender practices and how it correlates to the previous ritual experiences exemplified in Africa.\"\nFemale student: \"Well it takes a certain amount of physical strength to drive a nail into wood; therefore, it was most likely made by a man because they have that physical strength.\"\nUmm, WHAT??? As a self-identifying male student, didn't you just try to make an argument revolving around an idea that females are physically weak and incapable of doing \"mens' work\". Well, god bless your soul on this final exam...and to think that it was safe to assume that we're in a post-feminism era. \nThe hypocritical nature of this course is truly baffling. Unfortunately there was simply too much to cover, and every lecture became more and more vague. This class is NOT about human origins - take Jill Shapiro's class if that's what you're looking for. We only talked about Homo erectus and Homo habilis for 20 minutes! The presentation of each lecture became more and more sporadic. We would be talking about beads found at a random site in Southern Africa in the 8th century, then literally would jump to another object in Northern Africa that was constructed in the 17th century without any connection. Zoe continually addressed the importance of \"making connections between the lectures\" for the final exam. I attempted to do this last night and failed. The hard facts about the sites didn't seem to always be taught. I found myself continually looking these sites up on Wikipedia, and then having an \"ooooohhhhhh, so that's what this is\" moment. \nThis class reminded me of AP European History in 10th grade where all I had to do was explicate on ephemeral, nebulous and amorphous subject matters of \"identity\", \"culture\" and \"ritual practices\" to receive a high score. If listening about the domestication of cows for an hour and fifteen minutes floats your boat then take this course. If you want to be belittled in front of the class during \"discussion\" by the TA's physically prodding your back telling you to \"rebuttal that comment, now!\" when the comment was a valid statement concerning the importance of placing an object in its original context then take this course. If you want to receive unhelpful comments on a paper from a TA who's handwriting suggests that he/she either has carpal tunnel or was drunk when grading the paper then take this course. If you want the notion that \"you can't impose Western views when constructing narratives of the African past\" shoved down your throat until you feel like you can't breathe anymore then take this course. \nOh, and don't buy the recommended course texts [Early Art and Architecture in Africa and Forgotten Africa]. I just checked and they have accumulated a significant amount of dust over this semester. \nBest aspects about the class: Zoe [she's cute, spunky and fun], the midterm paper/project, Natasha's dog. \n \nWorkload:\nTwo to three esoteric and (sometimes) rather difficult archaeological readings per week. \n     -one article was 30 pages of Ibn Battuta's travel account in Africa where half of the words were in arabic...not so helpful, Zoe. \nAttending two discussion sections with a two page written response to the articles.\n10 page midterm research paper\nAfrican political quiz (all countries and capitals)\nAfrican landscape/geography quiz\nFinal - answer three questions, must talk about the readings and say the authors name.\n          [this is where my ability to generalize, which I learned in AP Euro, will come in handy] \n\n"
        },
        {
            "course_name": "Archaeology and Africa",
            "review_date": "December 02, 2013",
            "review_content": "\nThis is, without a doubt, the worst class I have ever taken at Columbia.\nFirst of all: the class tries to cover too much. No one-semester, undergraduate course can begin to cover even one segment of the African continent, never mind the entire history of the entire continent as a whole. Also, expect to be disappointed by your fellow Columbians: until I took this course (I am a junior), I was under the general impression that all Columbians are at least educated enough to understand that Africa is not a country. How wrong I was. Given that this is a core class that anyone can take, I do understand that many of the students don't have a working knowledge of either archaeology or the African continent. That said, this class really doesn't teach them a different way to think about material, but rather to parrot very simplistic cliches while fully maintaining their ignorance about non-American, non-European cultures. Some of the comments made in this class were just beyond belief.\nHere are some of my personal favorites:\n\"But, like, black people can be racist too.\"\n\"I think Africa needs more cities and, like, buildings. What do you guys think Africa needs?\"\n\"This Spanish king spoke with a lisp and then, like, all the other people started talking with a lisp too. Because they, like, wanted to copy him. Africans do that too.\"\n\"Identity is based on DNA, not history.\"\n\"This African society was clearly capitalist because they have wealth\"\n\"Maybe one reason Westerners misrepresent Africa is because they don't know how to deal with all the primitive societies.\"\nTo a South African girl: \"I don't know anything about you or your personal history or whatever. But clearly African Americans are more African than you... I mean, you don't even have like African DNA in you. Also your ancestors CHOSE to move to Africa, and, like, African Americans were slaves. So how can you say you're African? I mean, like, no offense, but you're white.\"\nfrom [TA] Mark: \"I mean, how many African Americans are even IN this class?! Let them take it up.\" (and later, turning to two students of color:) \"what do you guys, as the most African-American out of all of us, think? ...haha, I mean, if I can call you that.\" (followed by uncomfortable silence and shocked expressions)\nfrom [TA] Natasha: \"99.9% of you guys are wrong\" (in reference to an assignment we had been expected to complete with few to no guidelines whatsoever)...\"you're all useless academics who never get anything done.\"\n...and many, many more that I neglected to write down.\nDon't get me wrong -- Professor Crossland is great. She's funny and intelligent and it was genuinely a privilege to be taught by her. That said, the structure of the class is ALL wrong. She jumped from topic to topic willy-nilly and each class was slightly less coherent than the last. No, Zoe is not the real problem with this class. The real problem is the TAs.\nMark is a terrible TA. Not only is he rude and unresponsive to students, he is unclear and unfocused and belittles the opinions of students (and the students themselves) which do not entirely conform to his very particular (but somehow also very vague) views about Africa. In fact, he goes so far as to demonstrate the exact opposite attitude towards Africans (and humans in general) that is repeatedly emphasized by Zoe in this class. He embarrasses those who try to express a different viewpoint to a self-righteous, patronizing attitude of \"We Westerners need to help these poor Africans.\" (sidenote: your average human being understands that Africans are people. This class does not seem to understand that. Instead, it looks on them as pawns in the power of the West; as excuses to discuss changing western -- whatever THAT means -- viewpoints on vague topics like \"identity\".) He humiliated a girl in my discussion section by grilling her about every aspect of her past to try and racially categorize her, and then proceeded to make the comments mentioned above to the \"most African-American\" girls.\nWhile still slightly more effective than Mark, Natasha is by no means a good TA. She is extremely biased and yet routinely criticizes students for their perceived biases; she can be catty and downright rude in class (often picking on individuals and calling them out for their \"wrong\" opinions); and she does not respond well to well-meaning criticism of the class and its structure (like \"maybe we can accept by this point in the semester that we're all looking at things with our 'western bias'\"). She plays favorites.\nIn short, the only saving grace in this class is Zoe. My only criticism of her is that she is too forgiving of some of the ludicrously closed-minded comments made by students in the class... in other words, she's just too nice. The assignments were lots of fun and really contributed to my knowledge of the topic.\nAs for the workload: there are 3+ dense readings per week, none of which are really related to the lectures. I would say don't read them, but you kind of have to as the final is based on them. There's a 10 page midterm research paper which was actually great fun (you have to research an African object at the Met and rewrite the Met's outdated label for that object), plus two map-of-Africa quizzes which were genuinely useful in my understanding of the continent. To be frank, I only learnt anything in this class because of the quizzes and the paper.\nTLDR version: we <3 Zoe but this class, mostly thanks to the TAs, engenders racist, closed-minded, self-righteous viewpoints and celebrates the one-sided, the black-and-white, and the binary.\nWorkload:\n(Not even the point.)\n3+ dense anthropology texts a week, which are discussed in lecture\n10 page midterm research paper (that was fun)\n1 topographical quiz on Africa (major features)\n1 political quiz on Africa (countries and capitals)\nfinal based on classes and facts from readings; \"answer 3 out of the following 9 questions\"\n"
        },
        {
            "course_name": "Death and the Body",
            "review_date": "July 12, 2007",
            "review_content": "\nZoe Crossland is a quirky, knowledgeable professor who is genuinely interested in both passing on her experience and learning from her students. When I took this class it was a 4000 level (i hear she's bumped it down to a 3000). The weekly reading was easy, but rarely linked up to lecture material very closely. I found the weekly student presentations spotty... a few were good but as always dependant on the group. This was the first time she taught the class so I expect it to get better with time. Covers interesting topics that are both ancient and modern. Over all Zoe is very enthusiastic and that makes up for most holes in the class.\nWorkload:\nMinimal weekly reading that you can skip. \nTwo page response papers every other week or so. Easy if you've at least gone to one lecture.\nFinal Paper is HUGE. 20 page original research 50% of your grade. Scary but she'll help you out a lot if you ask. \n"
        },
        {
            "course_name": "Death and the Body",
            "review_date": "May 27, 2007",
            "review_content": "\nthe title of the course already gets you pretty excited, huh? the course is fun (in a morbid sense) and definately unlike anything i've heard of before. you complete readings (they're necessary up until after the midterm, which then you should worry about the essay that is 50% of your grade and do some readings if a particular subject interests you (i.e. cannibalism)). you show up to class and listen to very engaging lectures that explain and supplement the readings (she uses powerpoint in every lecture, full of pictures and random relations to every day life). i loved the course--but i hated the presentations, but that's just me. the professor is very approachable, not at all intimidating, professional but very down to earth (extended our paper deadline a week after some students asked for one). this class will work you though, the first half of the semester when you are reading for the midterm and the second when you are working on your 5500-7500 word essay. it's worth it if you are willing to work very hard.\nWorkload:\nthere is a take home midterm (25%), and the final paper (50%), and a few smaller papers (pass/fail) (15%) and every week a group does a presentation on a reading (10%) and you sign up for two presentations in the beginning of the course, and no final.\n"
        },
        {
            "course_name": "Death and the Body",
            "review_date": "April 17, 2007",
            "review_content": "\nZoe is a visiting professor from Great Britain and I am writing this review because I know that she will be teaching another class next Fall. She is the nicest person you will ever meet and she always looks out for her students. The class itself was concentrated on death as a sociological phenomenon, not on decay and archeology of the dead body. The lectures were interesting, but I always left with a feeling that we could have gotten much deeper into the issue. Every lecture touches a new topic and that is probably why we were unable to study the material in depth. \nEvery student had to participate in 2 presentations on a particular reading during the semester - pretty easy if you get good people in your group, which is tricky because students just sign up randomly in the beginning of the semester. \nThe short take-home midterm was great and so were the 4 \"response papers\", which happened to be rather straightforward questions on the readings. \nOverall really nice & breezy class. Take it for an overview in social archaeology of death, but beware CSI addicts - do not get disappointed when there are no gruesome pictures of decaying flesh (ever!):-)\nWorkload:\n2 presentations on readings; 4 response papers; short take-home midterm; final research paper (15-20 pages) on the topic of your choice\n"
        }
    ]
}