{
    "prof_info": [
        {
            "prof_name": "Birol Emir",
            "prof_id": 6370,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Applied Data Mining",
            "review_date": "May 05, 2016",
            "review_content": "\nBirol Emir absolutely should not be a professor. After four years of undergraduate classes and one year of graduate school, I can say with confidence that he is the most incompetent professor I have ever had. This is not hyperbole. He fails to be an effective instructor in every way imaginable:\n- Lecturing: Birol Emir does not know how to teach the material. His Powerpoint slide decks were literally just images of blocks of text copied and pasted from our textbook. Or sometimes, the slides would be taken directly from a company presentation with no alteration whatsoever. (He works at Pfizer. Slides would have the Pfizer logo in the bottom corner.) It was obvious that he did not prepare for the lecture in advance; he would go to a next slide, take a second to read the block of text, then summarize it ineffectively, or just read part of it out loud. Sometimes he would walk through an R program; but instead of doing a full demo, which would have been very helpful, he would just point to different R functions in the program and say completely unhelpful statements like, \"this function does this, and that's good because we want it to do this... check out the manual on this library for more information.\" He would not go into any depth on any particular item or topic. Instead he would just mention something, and then move onto the next topic. I would leave every class feeling like I didn't actually learn anything. Instead, I would write down a list of the topics that he mentioned, and then attempt to learn the material on my own via the textbook or some other online resource. For example: He rushed through hierarchical clustering in about 10 minutes, literally skipping multiple slides at a time without mentioning any of the material that was on them. When he did stop occasionally on a slide, he didn't actually explain anything; he just read the slide. I'm honestly not sure he fully understood the material. After class, I went on Youtube and watched a series of lectures about hierarchical clustering, which was 100% more helpful than what Birol had prepared.\n- Class management: I have never seen a class that was as disengaged as this class. The 20%ish of enrolled students who did not drop the class after the first two sessions would sit in class on their laptops, not paying any attention. He would occasionally ask a question to the class, and the same two students throughout the whole semester would attempt to answer the question. (If they were not in the class, I'm not sure what would have happened.) The only times where I felt like I learned anything was when a student would push him on a topic and ask a great question, and he would be forced to try and answer the question. However, he didn't even do this effectively all the time, and sometimes the questions appeared to annoy him and he would cut off the person asking the question and give a very terse response. \n- Assigning work: He assigned homework very irregularly. There were no assignments in the entire second half of the class. The time it would take to do each one was completely variable. This was only the case because he didn't plan them out with any thought, instead just selecting a couple of problems from a textbook chapter. On one occasion, one of the problems required a third party data set that we did not have access to. When students brought this to his attention, he was surprised. The midterm was a disaster. He did not have a set date for when he wanted to hold the midterm exam; students would ask him almost every single class when he would hold the midterm, and he didn't set a date until a week before the designated university midterm week. Instead, he scheduled a take home midterm for two weeks after spring break. And the final exam... the instructions were just incomprehensible gibberish. I literally had no idea what he was asking us to do. He clearly spent about 5 minutes putting it together and failed to proofread anything, because it is fraught with incomplete sentences, duplicated text, etc. (For example, one of the Questions was not actually a question. It was just a bunch of half-baked statements in some bullet points. Unreal.)  \n- Class scheduling: He ended every single other class 5 to 30 minutes early. (30 minutes early!!! Holy crap!) He wastes time in each class stumbling through his laptop trying to find files. He attempts to do class demonstrations in R but then fails to do them because he can't find the right file. Over the course of the semester, he didn't come in to four classes - one absence was due to a sudden family emergency, which is a totally legitimate reason to miss one session. But he missed the next session as well for the same reason, when he had ample time to form a contingency plan (e.g., have the TA teach the class). Another time, he couldn't get into NYC from his home in Connecticut because of the weather. He attempted to hold a video conference class lecture, but it was totally ruined by technical issues, so it was essentially useless. Inexcusable.\nThe material itself is interesting and potentially such an important topic to understand (big data, analytics, etc etc), and I am genuinely upset that I wasted credits, tuition dollars, and time on this course.\n\nWorkload:\nI mean, I guess kind of light. But I spent more time trying to decode his gibberish instructions on the assignments/exams than actually learning/doing the work, so don't view \"light\" as a positive aspect of the class. God this class was absolutely miserable.\n"
        },
        {
            "course_name": "Applied Linear Regression Analysis",
            "review_date": "May 16, 2015",
            "review_content": "\nProfessor Emir is awful. I am writing this having (unfortunately, because of requirements) taken two classes with him in the last two semesters. I attended every class both semesters and did well both times (at least from the grades I have so far of Applied Data Mining), so while many people are critical of their professors when they do badly and/or never show up to class - I was there the whole time and really know how bad he is. The only way I was able to do well in these classes was by spending excessive time reading and re-reading the textbook and other materials I found online and going to office hours as often as I possibly could. I learned absolutely nothing from Professor Emir.\nHe comes unprepared to class. Yes, there are lecture slides that he has to pull up on the screen, but he does not prepare any of these himself. The slides consist of either screenshots of the textbook pdf and entire lectures using slides he found online (I've found them online too). When he goes through the lecture slides during class, it is often clear that going through them during class time is the first time he has ever looked at them (because whatever he has on the slides doesn't even make sense to him).\nFor Applied Data Mining, he never graded the midterm. It was a 5-hour take-home on the Thursday after Spring Break (March 26). I am writing this on May 16, after all our final exams are over, about 7.5 weeks after we took the midterms - we still haven't gotten our midterms graded (and, he did originally say that he would email us individually with comments on the midterms. So that is clearly not happening). Also, 3 or 4 weeks after we took the midterm, a number of students asked him when we'd be getting feedback on the exams. He did not give us a clear answer, and he said he \"did not have time\" to even begin grading them yet. The TA also said during her office hours that he had not asked her or the grader for any assistance grading the midterms.\nHe simply does not respond to emails. Actually, he apparently responds selectively to some students and not to others. This has been especially problematic since his instructions for the homeworks and the take-home final have consistently been unclear.\nOn at least one occasion, during his office hours (8-8:40am before class and he is often not there or makes personal phone calls) he realized a mistake he made in the assignment he had written. He told just the students who were present during office hours that we could skip the part of the assignment that he had written by mistake, and neglected to tell the rest of the class until the morning it was due, when in fact he had realized this mistake 3 days before. By then, most of the class (except for the 3 or 4 of us who were there during office hours) had spent hours trying to figure out the part of the homework that made no sense to begin with. \nThe day he assigned the take-home final exam/project (Applied Data Mining), he showed up to class unprepared (no lecture slides), so he opened up a blank word document, and wrote out what our final would consist of. Before then, he had clearly put no thought into it at all. If I'm not mistaken, writing out assignments is something professors should do before they show up to class - not during class, without any previous thought put into it. Because of the lack of thought that he put into writing this assignment, the instructions were unclear, required that we do an excessive amount of work that we had never even seen before -- and again, because he doesn't respond to emails, an assignment that shouldn't have been so bad at all took an insane amount of time.\nIn Applied Linear Regression Analysis, we had a group project that was assigned at the beginning of the semester - and it was supposed to be a semester-long project. However, Professor Emir continued to change the instructions until just a few days before it was due.\nIf for whatever reason Professor Emir is asked to teach another class at Columbia and you have to take it, just be prepared to learn everything on your own. He is not there to teach you or support you learn.\nWorkload:\nFor Applied Data Mining:\n4 homework assignments\n5-hour take-home midterm (which he never graded)\nA take-home final project; instructions were incredibly unclear so it took me about 4-5 full days (and I've confirmed this with others as well) \nFor Applied Linear Regression Analysis:\nI think 6 or 7 homeworks (lowest grade was dropped), 1 midterm, 1 final, and a group project. \n"
        },
        {
            "course_name": "Applied Data Mining",
            "review_date": "May 10, 2015",
            "review_content": "\nThe worst, most disorganized class experience I have ever had.\nHe never gave us a syllabus at the beginning of the semester. A syllabus should include: office hours; grade breakdown (how much of your grade will be based on tests and assignments); when the midterm is; when all assignments are due; etc. His syllabus merely had a list of chapters from the textbook that we would be studying and none of the essential items mentioned above. As a result, I have no idea what my grade will be, since I don't know how much of it will be based on assignments and how much of it will be based on exams.\nThe assignments were vague and expectations were never clear. When we would have assignments was also very unpredictable, there was no regular due date and he would often spring them on us a week before they were due, so it was very difficult to budget my time while taking this class. Most professors usually have a regular due date every week for problem sets (psets are due on every Thursday at 5pm, for example) or else the syllabus would include when they were due, but Birol did not do this.\nThe midterm was a complete disaster. He did not tell us when the midterm would be at the beginning of the semester; we found out that the midterm would be on the day of the withdrawal deadline about three weeks before the midterm, so there was no way to withdraw from the class if you did poorly on the midterm. He also gave us very little information about the format of the midterm, so it was impossible to study for it. The midterm was also a take home midterm, the type where you open it in CourseWorks and you have a certain amount of time to do it before submissions close. He gave us five hours to complete the midterm, from the time you open it on CourseWorks, and he also only gave us one day during which we could complete it. The day he gave us to complete it happened to be a Thursday, which was a day this semester when I did not have a five hour chunk of time to complete a midterm and he would not let me (or anyone else) take the midterm on another day, so I had to skip other classes in order to take the midterm.\nThe final project also did not have clear enough instructions. Vague, vague, vague, no one knew what they were doing and (as mentioned below) he doesn't return emails, so there was no way to clarify the instructions.\nHe also is terrible with correspondence. He rarely responds to emails--I have heard of exactly one instance from everyone I knew in the class where he actually responded to an email; other than that, sending him an email was essentially sending an email to a black hole. He also still hasn't returned the midterm, even though we've already taken the final.\nBirol submitted grades two weeks late. He did not grade the final or the midterm, or if he did, it was never entered into courseworks. I have no idea how I made the passing grade that I did, as I only turned in one homework out of four and received no grade or feedback on either exam.\nWorkload:\nFour problem sets throughout the semester, one take home midterm, one pretty big final project.\n"
        },
        {
            "course_name": "Applied Linear Regression Analysis",
            "review_date": "January 05, 2015",
            "review_content": "\nThis was the worst experience I've had with a professor. I tried to ignore the previous reviews and go into this class without a bias, but they're basically all accurate. Professor Emir is a nice person, but he seems to put the absolute minimum amount of effort possible into this course. We never received a syllabus. We never received a rubric or concrete description of our final project, which we spent the entire semester preparing for -- the project requirements, inasmuch as there were any, were changed the up until day before the projects were due. The fact that he is also teaching the applied data mining course next semester is unnerving. \n It was impossible to get excited about the way Birol taught the material (as evidenced by the fact that by the middle of the semester, 15-20 people would attend regularly) -- and I started the semester eager to learn the material. I attended class basically every session, but I didn't get anything from lectures that I couldn't have gotten from the summary slides he posted -- which themselves were screenshots from other statistics departments or photographs of our textbook. He was also never available to meet outside class besides at 8 am before classes (but was usually late or not there anyways).\nIt was good to get more familiarity with R, although it wasn't formally taught except for a crash course in the first week on (no joke) how to install it. The problem sets and project, however, demanded it. The lab sessions in the course description definitely do not exist. \nWorkload:\nA problem set every two weeks -- they can range from okay to very bad. None are truly difficult, just very involved.\nA midterm, which was a bit easier than the class expected but didn't cover a lot of the material we had learned. \nA final project, which was loosely defined and done in randomized groups of about 6 people. We chose a dataset of any kind and did some analyses and model-fitting (again, super loosely defined) and then presented our results in class for 10 minutes on the last day.\nA final exam, which seemed to be fair and was shorter than most.\n"
        },
        {
            "course_name": "Applied Linear Regression Analysis",
            "review_date": "December 16, 2014",
            "review_content": "\nWORST CLASS EVER\nHighly unorganized\nI still do not know what he has been trying to teach.\nHomeworks and project were quite irrlevant to the midterm.\nAnd HW were pretty tough. Project? no idea what it was for.\nAlthough he states that we do not need to know prior knowledge on R,\nYou need to know how to deal with R.\nAnd he posted some of the questions for the final JUST two days before the final,\nand answers do not explain what it is about.\nI never ever wrote the review on CULPA.\nPeople on Culpa do not recommed taking Prof. Caridi for STAT1211; yes, i do not recommend him too, but compared to prof Emir, prof Caridi is clear, and has specific goal what he wants to teach every lecture.\nHowever, prof Emir is nice person and easy grader. I think he just do not really care or does not know how to teach. I have learned nothing from the class. If you want to learn something, I recommend you to study by yourself or take other class. \nWorkload:\n5 HW(mostly R), 1 Midterm, 1 Final, 1 project\n"
        },
        {
            "course_name": "Applied Linear Regression Analysis",
            "review_date": "December 16, 2014",
            "review_content": "\nWORST CLASS EVER\nHighly unorganized\nI still do not know what he has been trying to teach.\nHomeworks and project were quite irrlevant to the midterm.\nAnd HW were pretty tough. Project? no idea what it was for.\nAlthough he states that we do not need to know prior knowledge on R,\nYou need to know how to deal with R.\nAnd he posted some of the questions for the final JUST two days before the final,\nand answers do not explain what it is about.\nI never ever wrote the review on CULPA.\nPeople on Culpa do not recommed taking Prof. Caridi for STAT1211; yes, i do not recommend him too, but compared to prof Emir, prof Caridi is clear, and has specific goal what he wants to teach every lecture.\nHowever, prof Emir is nice person and easy grader. I think he just do not really care or does not know how to teach. I have learned nothing from the class. If you want to learn something, I recommend you to study by yourself or take other class. \nWorkload:\n5 HW(mostly R), 1 Midterm, 1 Final, 1 project\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "May 16, 2013",
            "review_content": "\nProfessor Emir is actually one of the nicest professors here and is highly unappreciated. The problem sets and project are not bizarre, they just challenge you to think a little. His slides are easily understood and if you do the reading and participate (and actually show up) you'll get allot of out them. He is an expert in using statistics in the real world and focuses on statistics methods that you will actually use. The biggest problem with the class is the students. It was mostly seniors and post-baccs who looked him up on Culpa and picked him because it says the class was easy and it's W1111, which is one step above the lowest intro stats course here. They were all looking for an easy A and only 10% of showed up to lectures. I learned allot from him and did poorly in the class. I found the exams to be challenging (not ones you can cram for) and because he didn't baby sit you and give you home works you had to keep up with the reading (which I didn't do and suffered for).  Most of these students had experience using much more advanced statistics in the lab and were whining because they wanted easy 100s on the quizzes. Allot of cheating went on with the homework and some serious ass kissing was going on in the lectures.  Most of the people complaining about him here are arrogant seniors and perfectionist post-baccs who never showed up to class except to complain. Im not sure if I even passed but I have to say something because this professor does not deserve what these students are writing about him here.\nWorkload:\nHeavy, but you'll get allot out of it if you do the reading BEFORE class and actually show up. \n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "April 30, 2013",
            "review_content": "\nTerrible, terrible experience. Emir is incompetent. His lecture slides are right out of the book, the examples he gives are right out of the book, his explanations are right out of the book. A waste of a teacher. The examples he gives that aren't from the book are generally useless. His problem sets range from five-question packets that take half an hour to forty-problem p-sets that take days. He gets half of his tests and problem sets from outside sources and does not write his own p-sets or tests. He is inconsistent in his expectations. \nThe second midterm was a graduate-level project on statistical analysis and modeling that was actually a lab: totally inappropriate for an intro-level stats class. He handed us the packet and left us to our own devices for one weekend with no guidance whatsoever. The project was nearly impossible and the whole class had to talk with him for an entire class period to clarify his expectations for the project (even then, he did not provide a grading rubric). We had to approach the department head, who agreed that the project was ridiculous (he made us do it anyway). He occasionally takes attendance, which is the only reason anyone really attends class.\nI haven't finished with the class. It wasn't difficult; mostly inconsistent, confusing, frustrating, and extremely boring. Avoid if at all possible. \nWorkload:\n5 HW assignments, 2 midterms (one is a project), final exam\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "October 07, 2012",
            "review_content": "\nAn utter embarrassment to Columbia University, the Department of Statistics, and to the profession of teaching. He was absolutely terrible at teaching and extremely organized. \nHe will assign extremely bizarre exams and confusing assignments that will stress you out for weeks on end. Because he teaches you absolutely nothing and wastes class time, you will have to dedicate a great amount of time to statistics outside of class.  He is totally unprepared for class and treats it like a joke. He will teach you nothing but will grade harshly and give unreasonable assignments. \nDon't be fooled by his grading system and the other reviews. He does not abide by the grading system and gives out grades arbitrarily. Very random, tough grading (which the whole class was not expecting once they received their grades).\nWorkload:\nBizarre, confusing, and difficult projects that are grade harshly.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "April 29, 2012",
            "review_content": "\nBelow is my course evaluation for Professor Emir. I have not yet taken the final or gotten a grade, so I cannot speak to that.\nProfessor Emir is the worst professor I have ever encountered. He did not communicate the subject matter coherently. He did not prepare adequately for class. His assignments were unclear both in the content (poorly worded questions) and the process (changing the requirements and the due date multiple times). As far as I can tell (everything in this class is really unclear), Prof Emir grades everything out of 110 possible points so that everyone will get good grades, regardless of his poor teaching.\nAll of the material we covered up to the midterm was covered in my 4th grade arithmetic class (with the exception of how to take a standard deviation, which I both already knew and could have googled and learned in 5 minutes). He assumed that since the course was statistics without calculus, we had no prior math exprience at all and actually asked us if we knew what even and odd numbers were. \nIn addition, he repeatedly made inappropriately classist comments (comments which assumed that and made fun of us for all coming from extremely privileged backgrounds).\nI have honestly never written a course evaluation like this, and I hope I never will again. I imagine that Professor Emir is a brilliant statistician at Pfizer, but I should not have wasted my time in his class and I hope nobody else ever has to.\nWorkload:\nToo easy. Also, poorly explained and poorly executed (see above).\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "June 19, 2010",
            "review_content": "\n[This was my submitted course evaluation]\nProfessor Emir is an affable man, and he does care what his students seem to think of him. What he brings to Columbia, though, ends there. Class after class, he showed a remarkable lack of attention to and involvement in the course. He seemed minimally if at all prepared, and was generally disorganized. He clearly is a good statistician, but he was unable to bring much of his knowledge to the classroom.\nSome examples:\n1) He read verbatim from the stock overheads prepared by the textbook publisher, which just quoted verbatim from the book, thus rendering going to class, or doing the reading, redundant.\n2) When asked to introduce an example that wasn't straight from the book or slides, Prof Emir would show how unprepared he was; he once went completely silent for six minutes as he brainstormed an example, finally asking a student for a copy of her book and using something from it.\n3) When he did use the board to jot down an example or elucidate a point made in the slides (which happened maybe once per class on average) his writing was small and hard to read, and he was VERY reluctant to actually go through the steps of a problem, or treat multiple parts of a problem. (And don't let me forget the extra credit points he awarded to people who would do problems on the board for him!)\n4) Prof Emir several times changed the grading scheme for the course, but only after the relevant quizzes or homeworks were taken or dropped, as the case were. For example, the two quizzes went from counting 5% total (per the syllabus), to counting 10% each (per a February announcement), and then to 5% each (per a March announcement),\nand as of yesterday, back to 10% each.\n5) He also changed test formats more than once. The first quiz was multiple choice, but because a few students asked for a change, for the midterm he changed the format to open question. Then, when that format proved too time-consuming to grade, he went back to multiple choice for the next quiz.\n6) Prof Emir was occasionally late for class, and occasionally would leave early, citing specific family/work obligations. This would be understandable if his only available times to meet with students weren't right before and after class.\n7) Prof Emir blatantly just did not respond to emails. TAs weren't much better. \nDo not be misled by the unremarkable evaluations--many students are just happy to have found a professor who grades so leniently (I got an A with minimal work) and they don't want to rock the boat, or look a gift horse in the...you get it. But being ostensibly friendly and laid back does not make up for the lack of care Prof Emir showed. And as such I think it would be a shame if he were invited back next year without his promising to make some real changes, and put in a sufficient amount of work himself. Tuition is too darn highto be spending it on this mediocrity.\nWorkload:\nToo easy (both ours and the professor's)\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "May 18, 2010",
            "review_content": "\nBecause the previous reviewer did not attend class frequently, I feel that he has a different point-of-view compared to someone who did. I attended every single lecture and let me tell you, this class is HARD if you do not have any background in Calculus or Stats (which I didn't). If you don't read over the chapters before class, you will be very lost and that was my problem most of the time. My saving grace was going to the TAs office hours. They were the only ones who could really help in terms of availability and teaching the material. (Prof. Emir is an adjunct; he works at Pfizer full-time and does not have the time to meet with students even though he claims he will be available before and after class).\nHe reads from his slides and you do have to get used to his accent because most of the time, he is hard to understand. He tries to make jokes which are funny sometimes but all in all, he isn't a great professor because of the way he teaches and his unavailability. He is notorious for not replying emails so don't even bother sending him one. The lectures (chapter slides) are posted online. They are not very helpful if you don't read the material and attend class. Sometimes, he covers 2 chapters in one class!\nI am just glad I am done with this requirement. The subject was awful and the professor much worse. \n\nWorkload:\n6 Homework assignments that cover a few chapters (don't underestimate it, it is a lot of work!)\nMidterm, Final, 2 Quizzes (Multiple choice, short essay)\n"
        },
        {
            "course_name": "Intro to Statistics",
            "review_date": "January 22, 2009",
            "review_content": "\nTook it, got an A, learned nothing.  This is ideal for people who need to get a requirement out of the way (though this is true for many other profs who teach the same class from what I've heard).\nOn the other hand, I didn't go to class much and didn't put in any effort.  He's a very nice and approachable guy.  I'm sure that if you're actually interested, he would be a lot of help and possibly a very interesting professor.  There is potential to learn a lot...motivation is what's lacking.\nWorkload:\nEasy.  My final was embarrassingly awful and half blank.  Still managed an A for the course.  I'm not bragging or anything, because the man promised us all A's (A- = worst case scenario).\n"
        }
    ]
}