{
    "prof_info": [
        {
            "prof_name": "Itshack Pe'er",
            "prof_id": 4057,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Computational Genomics",
            "review_date": "May 23, 2016",
            "review_content": "\nThis review ended up rather long, so TL;DR: this class is hard and confusing- do not take it!\nUnfortunately, I strongly do not recommend taking this class. It was probably my least favorite class I ever had to take at Columbia (disclaimer: I just took it as a second semester senior so I may be biased, but I still think this is a very honest assessment). I wanted to avoid taking Machine Learning because I was trying to have a chill semester, but I wish I had instead.\nProfessor Pe’er is an extremely nice guy, which makes me hesitant to write a poor review, but I had a very bad experience with this class. The material is hard, but what truly made this class truly difficult is the lack of resources to learn from. Usually, I can rely on the lectures, class notes, or the textbook to learn the material for a class. However, I could not understand the lectures due to Professor Pe’er’s delivery and stuttering, the class notes were confusing and extremely difficult to study from, and there was no textbook.\nProfessor Pe’er has an accent, but it is the stammering and stuttering that made it almost impossible for me to understand what was going on in class. He also spoke through a microphone which further distorted his sentences. I’m not trying to exaggerate, but it took intense concentration and patience during lecture to make sense of each sentence for me (moreso than any lecture I’ve ever had). Eventually, as a second semester senior, it was just too much effort for me and I was mostly zoned out during class.\nThere was no textbook to learn the material from. Thus, I was left with learning from the class powerpoints. The slides did not contain full explanations of concepts and diagrams, so they were very hard to decipher. I mostly ended up googling topics and watching Youtube videos to try and learn the material. This class is a mix of computer science, biology, and statistics and the material is unsurprisingly very hard to understand.\nThe problems sets were long and extremely difficult (8 in total). Most of the questions were worded poorly and required extensive clarification on Piazza before you could understand them. Given that the material itself was difficult and confusing, they took me hours and hours to complete. After a couple problem sets, I just stopped caring and scribbled down whatever work that looked okay because it wasn’t worth the time stressing over it.\nFor the midterm, you had to answer 3/8 questions. Not surprisingly, it was hard as well- the average was a 64. It was open book/note, but I didn’t even use anything I brought in. Afterwards, he gave us an extra credit assignment where we had to solve 3 more of the midterm problems (full credit received half the points between your grade and the highest class grade). If you do take this class, I would just focus on learning on 2-3 of the main topics that will appear on the exam (BWT, HMMs, etc.).\nThe project was okay. I was worried our project was too simple because everyone else’s sounded complicated, but most groups didn’t come close to getting good results so don’t overexert yourself.\nIn conclusion, this was one of the most frustrating and challenging classes I took as an undergrad, and unfortunately it was during my last semester here. Avoid taking it, unless you are truly interested in the subject- just take ML!!!! Sorry Professor!\nWorkload:\n8 problem sets (30%)- need to get 80% for full credit over the semester. They are long, confusing, and difficult!\n1 midterm (30%)- open note, answer 3/8 questions. Difficult, but he may offer an extra credit assignment.\n1 project (30%)- done with a partner. Don't need to make it too hard, but probably should be somewhat substantial.\nClass partication (10%)- barely anyone participated, there were a lot of awkward silences.\n"
        },
        {
            "course_name": "Computational Genomics",
            "review_date": "June 05, 2015",
            "review_content": "\nEveryone kind of sits on the continuum between weeding out people, and helping them learn. Professor Pe'er is definitely on the latter. Here's why:\n1) Only 80% completion of your homework is required, i.e. an 80% translates to 100%. Now, I'll caveat this by saying these assignments are done weekly for the first half, and some of them are pretty tough if you weren't paying careful attention in class.\n2) Feedback, feedback, and feedback. Every homework assignment you turn in gets notes meant solely for you. Your final project will have presentations, and you will get feedback from both classmates AND the professor and/or TA, each time.\n3) A steady/reliable pace with a very welcoming attitudes towards questions. He leaves his cell phone, personal email, and allows skype sessions over the weekend - just to help you learn or get help with your project.\n4) Cameron (the TA) is super nice and adopts the same attitude as Professor Pe'er - he only wants you to learn.\nIn addition to that, this course is heavily front-loaded - it's going to be a sprint the first half. I can't speak for everyone else, but I really appreciated this - it gave me more time to work on my project (the last half of the semester), and deal with the impending deadlines for all my other classes.\nNow, some caveats:\n1) His lecture style is pseudo-interactive, or at least tries to be. He asks a lot of questions to check comprehension, and there were plenty of awkward moments where nobody answered a very obvious question (albeit, I'm not sure if it's because we were all scared because it wasn't obvious at the time or because nobody cared. Likely the former).\n2) I see other people complain about his voice, his stuttering, blah blah, but if you're interested in the material, then you'll likely pay attention naturally (and you should; it's interesting stuff).\n3) The material -can- be hard to follow. It's -a lot- in roughly 2/3rds of the semester. Some of it is almost hand-wavey. This is especially true if you've never had exposure to genomics, or even biology. That being said, I came in here with 0 biology background, and was okay.\nWorkload:\nBrutal once we got into the thick of things for about 3-4 weeks, then tapered off significantly so we could work on our projects. Lots of material to study, especially if you pore through CVN videos like I do.\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "June 21, 2014",
            "review_content": "\nPros: I thought the assignments were good, but super time consuming and there was one every week, that will squeeze all the time out of you, but in a way you learn.\nMidterm fair and final was ok. Grading was reasonable.\nCons:\nThe worst classroom delivery I have ever seen in my entire life including school anywhere. Machine learning is no doubt fascinating but does require some foundation, but his classroom delivery is some of the worst I have ever seen, stammering, stuttering, is ok for CS 101, in a community college but totally unacceptable for a graduate level course in such a esteemed institution where the pay for professors is high and the fees are exorbitant.\nOn top of his inaudible and cringe inducing voice the material is complex but no doubt interesting. Professor needs to desperately address this and take a look at videos of himself on how to improve for future classes or otherwise just stay a researcher and not lecture.\nJust look at the how well Andrew Ng did his course in Coursera on Machine Learning.\nBecause of the above it felt a waste of the money we spend on course here. I think Jebara would be much better, understandable and you would feel your moneys worth.\nBut if you can bear and listen to him maybe the course is made for you.\n\nWorkload:\nPretty tough but fair I thought for the scope of this course.\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "June 03, 2014",
            "review_content": "\nMachine Learning is a fascinating subject and is clearly a very valuable subject to know about. However, our class was very unfortunate to have been taught by Professor Pe'er. He is by far the worst professor I've ever had in my academic experience. To add insult to injury, he is very unapologetic about the way he manages things and treats his students unfairly. \nAssignments:\nEvery assignment included grammatical errors and unintelligible sentences in addition to mistakes in the problem descriptions. As a result, 1-2 day assignment would turn into a week-long affair. Future assignments are also based on answers to previous ones even though the class was not given the solution to the previous assignment. As a result, students who might have had incorrect answers in the previous assignment would unknowingly have errors in the next assignment.\nMisinformation:\nProfessor Pe'er likes to portray himself as a fair individual but time and time again did he prove us wrong. Our first quiz was multiple choice test where correct answers were given 3 points and incorrect negative 2. However, the class was not told that leaving answers blank would result in negative marks too. Another example of this kind of behavior was demonstrated when he ran a poll to decide whether assignments should be due on a Friday or Wednesday. >80% of students who voted, voted for Friday yet the Professor appeared to have conveniently forgotten to tell the class that over 60% of the entire class needed to participate in the poll for it to be deemed valid. Something he decided to tell us after the fact. \nSadly there are many more examples of this kind of behavior which is simply unprofessional. \nI can't speak to how Prof Jebara might teach this class and whether it's any better. But my main advice would be to stay away from Prof Pe'er, simply because you'll waste more time clearing up any confusions than being able to dedicate time to the actual subject.\n \nWorkload:\nWeekly assignments - mostly time-consuming due to the fact that they had mistakes in them\n2 Quizzes\nTake home mid-term\nIn-class final \n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "May 27, 2014",
            "review_content": "\nMachine Learning by Prof. Pe'er was an excellent class. The course was well structured, however the course load was pretty heavy. Nonetheless, the assignments and mid-term made you learn a lot. \ncons :-\n1. The problem explanation in the assignments were vague at times. The TA's were irresponsive most of the times, thus most of the times went struggling with the problem statements.\n2. It was difficult to follow prof in class, but hey, the lectures were recorded on CVN!\npros :-\n1. The prof was very approachable and cared for his class.\n2. He atleast tried to make sure that everyone gets the concepts right.\nIn a gist, i'd recommend this class to anyone who wants to learn machine learning in a way such that the intuition and math behind the concepts is both clear.\n\nWorkload:\n~12 assignments(weekly) + 2 quizzes + midterm(take home, was sheer fun) + final(impossible)\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "May 21, 2014",
            "review_content": "\nProf. Pe'er is really well-intentioned, and it's clear that he cares a lot about his students. I took a lot away from this class, even though it was a struggle. That said, DO NOT take this class if you're not remotely interested in machine learning - it's _not_ worth it. There are several other breadth/AI track courses that are (possibly) more interesting. If you _are_ interested in the subject, however, I'd definitely recommend taking this class with him instead of with Prof. Jebara. \n1) Teaching: If you have trouble staying awake in classes where professors speak really slowly/if you've ever been in one of the Mudd classrooms and know how boring they are, BRING COFFEE/TEA/anything that keeps you awake. Prof. Pe'er speaks really slowly, so much so that when you play his lectures at 1.5x speeds (they're all on CVN, which is great), it sounds like most people speaking at a normal pace. \n2) The material: While the class is very math-heavy (as are most courses on machine learning), Prof. Pe'er is very generous with his use of examples to provide better intuitions for the concepts/algorithms covered, and even tries to do live demonstrations to help make the math clearer. Some lectures and topics have a very steep learning curve even if you have the prerequisites covered, but I learned a tremendous amount from this class and I don't think I would have gotten that much from Prof. Jebara's far more theoretical approach. \n3) Homework: The homework is time consuming, not because each individual assignment is long, but because there are assignments EVERY WEEK. The assignments are hard, so starting in advance is essential (which means you're usually working on ML assignments 4 days a week at least), and responses on Piazza from the TAs are erratic and come in waves, so they're not reliable. Prof. Pe'er does allow group work with some constraints, so that usually makes working on assignments easier. But START EARLY. The assignments are also usually vaguely worded, which was a pain to deal with.\n4) The tests: This was the most confusing part of the class. I think Prof. Pe'er experimented with a lot of testing styles because it was his first time teaching this class. (Either that, or he always throws 4 different testing styles at his students in all his other classes too because he thinks it builds character.) \n- Quizzes: multiple choice, where any number of choices could be true or false, and you lost points for either answering wrong or not answering at all. (So really, you had a 50% chance of getting it right anyway..) The questions on the quiz were theoretical and just requierd you to know the concepts, and some involved doing some basic calculations/inferences.\n- Midterm: Easily the best test in this class. It was take-home and entirely programming, with 50% of the grade going towards an explanation of your approach. I think the grading was pretty fair - you got graded on the performance of your approach for the programming part, and the quality of your approach for the explanation. Very straightforward and doable in the 4 day timeframe given.\n- Final: This came out of nowhere - the questions on the final ranged from proofs to algorithm creation to calculations - basically a very, very difficult exam. He gave us a practice final that, as it turned out, exactly resembled the actual final, but it still gave us no way to prepare, given that all the testing methods we'd had before were so different. It was almost impossibly long (though challenging and very interesting, required you to actually apply knowledge to real-world problems).\n5) The curve: VERY generous curve. Another reason to definitely take this class with him and not Prof. Jebara. I think he really recognizes how hard he makes the class (in terms of workload, learning curve, difficulty of final) and curves to a high-ish B+. A large percentage of the class got A-range grades. \nAgain, this is a professor who really cares about his students and the effort they put in, and isn't just looking to make this class frustrating and impossible. In general, he's very very responsive to feedback, even takes reasonable requests for class-wide extensions, and always tries really hard to make sure ever single student understands. I haven't had many 4000-level classes where that's the case, so this was refreshing. The class is still extremely frustrating, but ultimately rewarding if you like the material and put a lot of effort into the work.\nWorkload:\nHomework: 10 assignments (1 really simple setup assignment which includes a small Matlab script), 1 per week, all in Matlab  (25%)\nMidterm: Programming with an explanation of approach (25%)\nQuizzes: Two (a few weeks before and after the midterm) - multiple choice with any number of true/false options, theoretical (20% total)\nFinal: Impossibly long and very challenging final with lots of application- and theory- based questions. (30%)\n"
        },
        {
            "course_name": "Machine Learning",
            "review_date": "May 11, 2014",
            "review_content": "\nIf you find Itshack Pe'er teaching Machine Learning, avoid it, unless you know most concepts of ML in advance. \nWeekly assignments wasted most students hours and hours without any progress. The wording of assignment was very vague. To make situation worse the TAs were constantly unresponsive so you can't get clarification in time (and after the midterm they closed Piazza). \nThe two quizzes, contained T/F questions, suffered same vagueness. \nThe midterm question is interesting and good. although the grading of midterm is not very fair. it was OK. \nI have not taken the final exam yet, but the mock final seemed completely different to assignments and quizzes, to the extend that you might think it was for another course. \nWorkload:\nweekly assignment (not easy!) + 2 quizzes (with 1 page cheat sheet) + 1 final + 1 mid\n"
        },
        {
            "course_name": "Intro to Computer Science- Programming in MATLAB",
            "review_date": "January 26, 2011",
            "review_content": "\nHORRIBLE lecturer (cannot complete a sentence without stuttering and \"ehhhh\" every other word). Also, he put his one office hour on Tuesday mornings at 8:30-9:30 am. First of all who is gonna wake up that early... not to mention the comp sci building doesn't even open til 9am. So good luck getting help from him in person, and his responses to email were often curt and unhelpful as well. The TAs were alright... nothing amazing and when they made a program to check our programs A LOT of people had to go for regrades that weren't very liberal at all. Most of the grading was done without taking into account how horribly written and ambiguous the problem sets were. \nCovers recursion and GUIs... which are definitely NOT supposed to be a part of the intro class curriculum. I didn't bother buying the book for the class and ended up with an A-...\nBut that A- was the result of literally 20+ hours each week on the problem sets. And I guess I got REALLY lucky on the midterms and final... Be happy if you can stay average in the class. The class started out with over a hundred students and ended with only 60ish students.\nIn short... try your best to avoid this class at any cost. And if you must take this teacher, don't be afraid to harass the TAs with questions and give yourself PLENTY of time to finish the problem sets!\n\nWorkload:\nWeekly problems sets (about 20 hours per week to complete); midterm and final (class averages were usually in the 40s)... and he forces ppl at lectures to participate so don't get caught sleeping.\n"
        },
        {
            "course_name": "Intro to Computer Science- Programming in MATLAB",
            "review_date": "January 06, 2011",
            "review_content": "\nThis guy may be a genius in programming, but has no concept of how to teach properly. He can't finish one sentence without stuttering, loves to pick on students during lecture to make them feel embarrassed, and gives poor/dismissive responses to students' questions and concerns. Good luck surviving his useless, boring lectures - you'll be staring at the room's clock almost every second, dreadfully hoping and praying that the class gets dismissed early or ends soon enough (which takes like a millennium). Time dilation effect, anybody?\nYou will definitely come out of lectures more confused about the concepts than before - attending them was almost a complete waste of time and do nothing to help with his crazy problem sets, in which you're not even allowed to discuss/brainstorm any ideas with classmates before submission. This would make sense if the homeworks were doable alone, and didn't incorporate higher level comp sci topics like recursion and GUI that no other computer science teacher covers in an intro course (for non-cs majors!!!).\nUltimately, this may possibly be the most horrible experience ever at Columbia with a professor (not friendly and gives terse replies to emails). Avoid him at all costs or prepare to suffer like never before. Very mentally draining and the only salvation is when the course finally ends (but not everybody can make it to the finish line unscathed). Don't do this to yourself, unless you're a genius at MATLAB of course; even then, I would still think thrice about choosing Pe'er, for he turns a potentially fun class into a complete torture and disaster due to the lack of organization. It's not healthy!!!\n\nWorkload:\nWeekly psets 40% -> hours and hours of pain, without much progress in the end, so make sure to start really early (i.e. almost as soon as the assignment is posted) and attend the office hours of TAs, who were nice and generally helpful, particularly in debugging written code.\nMidterm and Final (25%, 35% respectively) - multiple choice and code modification questions (on paper) that were full of tricks. Partial credit was given, but doing well is determined by chance and the arbitrary grading. Heavily curved though.\n"
        },
        {
            "course_name": "Intro to Computer Science- Programming in MATLAB",
            "review_date": "December 25, 2010",
            "review_content": "\nAll you really need to know about this class is that it's awful. The class started off like this: too many (easily over 100) students crammed into a room struggling to stay awake as Pe'er tries to explain simple programming concepts (like binary and the way computers represent integers) in convoluted terms. The homework started out so easy that nobody really seemed to mind. \nAfter a few weeks, though, he transitioned to horrendous weekly homework using MATLAB in ways that no one ever intended. Going to class won't help, and asking the TAs won't help. All you can really do is beat your head against your keyboard for hours on end until a mostly-functioning program comes out. Don't even think about asking your classmates for help; late in the course several people were picked out to complete a special assignment as punishment for cheating.\nHow are the exams? For the midterm he gives you 12 trick multiple choice questions about the fine details of MATLAB syntax followed by 3 pieces of code to correct. The code correction is generally straightforward, but good luck knowing how well you did on the rest!\nThe real tragedy here is that Paul Blaer is the other instructor for this course. Avoid any non-Blaer instructors at all costs, at least for this class. You'll save yourself many a headache.\nWorkload:\nCruelly long problem sets assigned weekly with arbitrary and harsh grading. Taking the exam is like playing at a casino: you might get lucky, but in the end the house always wins.\n"
        },
        {
            "course_name": "Intro to Computer Science- Programming in MATLAB",
            "review_date": "October 21, 2010",
            "review_content": "\nThis class is terrible. If you're in it, you should probably just curl up in the fetal position while listening to Justin Timberlake's \"Cry Me a River\"--you'll get the same grade that you would have gotten if you had gone to every lecture and slaved your ass off. Unfortunately, while Itshack appears to be a computer science genius, his command of the English language appears to be worse than my command of the Matlab programming language (which thanks to his terrible lecture skills and general lack of teaching abilities, is only slightly better than William Hung's English). He mutters under his breath and seems to be unable to articulate his words beyond mumbles and sighs. \nOnce upon a time, there was a class called Matlab, which was supposed to be for non-computer science majors. However, the material in this rendition of W1005 is comparable to what Stephen Hawkings does for challenge problems.\nWorkload:\nCRAZY. IMPOSSIBLE problem sets every week (even the TAs can't complete them). \n"
        }
    ]
}