{
    "prof_info": [
        {
            "prof_name": "Jennifer Emerson",
            "prof_id": 2029,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Modern Dance II",
            "review_date": "January 20, 2009",
            "review_content": "\nProf. Emerson is a great teacher. Her Modern II class is fantastic! Be ready to take a very upbeat, intense, Graham-based technique class, full of inspiration, images, funny anecdotes, and a lot of dancing!!! Yes, this is a class where you will spend a lot of time dancing the steps studied during the course. How refreshing. There are two composition classes where you will have to came up with your own choreography and dance it with 2-4 other students... These two classes are without any doubt challenging, rewarding, and fun. Even if you are beyond Level II, you may still find this class incredibly satisfying.\nWorkload:\nA paper after a video showing. \n"
        },
        {
            "course_name": "Modern I",
            "review_date": "May 10, 2006",
            "review_content": "\ni agree entirely with the other reviews.  jenny is fun and exuberant and really passionate about dance, but not in a stuck-up way - she actually wants to help you find freedom and joy in your daily life.  my way of moving throughout the day changed significantly, and for the better, after this class.  and gilles, the musician, is indeed fabulous.  i'm definitely continuing with dance after this, even though it's so freakin early.\nWorkload:\nif you can manage to pull yourself out of bed for the 9:10 class.. just 1 ungraded reaction paper to a video.  but if you can't, then you have to go to a performance and write a review.  \n"
        },
        {
            "course_name": "Modern Dance I",
            "review_date": "May 07, 2006",
            "review_content": "\nA \"sensual oracle,\" Jenny Emerson is an amazing dancer and teacher. She articulates with images the precise movement she desires and demonstrates these movements with amazing clarity. She is enthusiastic beyond belief and a joy simply to have as a teacher. Be prepared to learn much of Graham technique and to enjoy your Tuesday and Thursday mornings. \nAlso amazing live music from Gilles Obermayer!!!\nWorkload:\nDon't miss more than 5 classes. first two excused. next three require make-ups, which can be going to a dance performance, another class, or writing a fun review!!! 1 reaction to a martha graham tape.\n"
        },
        {
            "course_name": "Modern I",
            "review_date": "April 04, 2006",
            "review_content": "\nReally amazing class. Yes it's at 9:10AM but you will still wake up for it. Instruction is good, easy to follow even for the most uncoordinated. The Intructor is good at being able to help you see how to move and be more flexible than you thought possible. She's a little too happy for so early in the morning but her insane metaphors for happiness and growth just make you feel a bit upset you aren't so awake and happy all the time. There is live music that is amazing and it forces you to wake up. Definitely recommend the class and Emerson!\nWorkload:\nattendence (can miss up to 2 classes, after that you'll have to do \"make-up\") 1 film review that we watch in class (she just wants a reaction to it)\n"
        },
        {
            "course_name": "Modern I",
            "review_date": "April 14, 2004",
            "review_content": "\nJenny is a wonderful instructor to teach intro to Modern dance.  This is a 9:10 class and I still missed only one session, regardless of the hour I stayed up until the night before or the amount of work I had for the next day (unprecedented for me).  Jenny teaches the Graham technique and will use a lot of silly metaphors to get you to understand what she wants from you, but in the end you will walk away from the class much more aware of what your body can do, where the movement can be initiated.  Do yourself and others a favor if you happen to think that over-enthusiasm is corny and don't sign up for this class.\nWorkload:\nThere's technically a \"paper\" to write after we watch some Martha Graham videos during one class, but it's really nothing, ungraded, just to write something about either the Graham technique or about the class.  Also, if you miss more than two classes, you can make them up by attending a dance performance on campus or elsewhere and bringing in your ticket stub.\n"
        }
    ]
}