{
    "prof_info": [
        {
            "prof_name": "Dean Mobbs",
            "prof_id": 12494,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "January 13, 2015",
            "review_content": "\nMobbs is the man! Lecture is very engaging, light-hearted and exciting. Being from the psychology field, Mobbs knows different tactics to use to keep you interested in the already interesting subject matter. He uses videos, pop culture references, gags in his powerpoints, etc. He's really laid back and nice. Barely any workload, no homework. \nWorkload:\n3 multiple choice exams (2 are noncumulative, 1 kinda sorta is but barely), up to extra 3 percentage points for experiment study, no homework whatsoever, just listen in class and memorize slides. No serious need to take thorough notes at all, but feel free to. \n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 20, 2014",
            "review_content": "\nThis was a good class to take for my science requirement. Having already taken Science of Psych, I felt prepared enough to understand the general premise of most of what Dean was talking about. He tended to go really fast through material, but he was generally clear in his presentation of it. Some of the lectures were a little dry, but Dean always made an effort to include humorous slides and jokes in his presentations to make it a little more fun for us. His English accent also made everything infinitely better.\nI didn’t do any of the readings from the textbook and didn’t find them necessary to do well in the class. Everyone was always surprised by how well they did on the midterms—on one of them, the average was 93%. So on the whole, not that much work at all in this class; just keeping up with the lectures and memorizing the material before the exams sufficed to get you a good grade.\nWorkload:\n2 midterms (25% each)\nFinal (50%)\nOptional psychology experiment participation (got you up to 3 extra-credit percentage points for your final grade)\n\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "February 10, 2014",
            "review_content": "\nExcellent course. Professor Mobbs strives to make every lecture as enjoyable and interesting as possible. He is sincerely committed to passing on his passion for his work to his students, but also understands that most of the students in MBB aren't highly knowledgeable, and adjusts the difficulty of the material accordingly. He's a naturally engaging lecturer and is great to talk to after class.\nThe only potential sticking point is that at times, it seemed like a lot of the review for MT's and Finals constituted of memorizing the functions of particular brain areas or the findings of particular experiments.\nBut if you're good at making flash cards, it should be no problem.\nEnjoy.\nWorkload:\n2 MT's and a Final. All the same difficulty. Potential 3% EC for study participation.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "April 02, 2013",
            "review_content": "\nThis is such a great class!! I HIGHLY recommend it. Professor Mobbs posts up all his slides and makes learning the material fun. He is engaging, funny, and super organized. You don't need to read the textbook even though it is good background, but definitely remember the info on the slides. Exams are cumulative, but if you study in time and divide the work appropriately you will be fine. He and the TA's are really accessible. Like I said before the info was very interesting so I enjoyed studying for his exams. They are not harsh and completely fair. \nWorkload:\n3 cumulative exams and he accepts participating in psych studies as extra credit assignments. \n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "November 16, 2012",
            "review_content": "\nMind, Brain, and Behavior was a great class. Professor Mobbs made the class enjoyable. He definitely has a great sense of humor and he tries to incorporate it into the lectures. He is super organized. He post up his slides on coursework's AFTER class, I'm guessing he does this because he wants students to actually attend lecture. Attendance is important because he might throw in a question about something said in his lectures in the exams. \nThere were a lot of articles, but most were very interesting and skimming was plausible. Neuroscience and Psych majors would love this class! The exams were not hard. The info on them were mostly from his slides, which was nice because his slides are really straight forward. I would pay more attention on reading the articles than the chapters in the book, but still read at everything! He has done a lot of experiments in the UK and California, make sure you actually know what they are, the procedures, and outcomes because these are some questions that show up on exams. \nHe has lots of TA's and they are all helpful and smart so definitely meet with them.\nGreat class, you'll learn a lot of cool shit!\nWorkload:\n2 midterms (20%; 30%) and one Final (50%). It is possible to earn 6 extra credit points by participating in psych experiments. Exams are really easy if you look over the slides, read the book chapters, and articles. GEAR YOUR STUDY/FOCUS ON LECTURE SLIDES because that's probably 75% of what will be not he test. 15% about the articles and 5% on the book\n"
        }
    ]
}