{
    "prof_info": [
        {
            "prof_name": "Marisa Buzzeo",
            "prof_id": 9483,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Thermodynamics and Kinetics",
            "review_date": "June 18, 2011",
            "review_content": "\nProfessor Buzzeo is one of my favorite teachers of all time. Not only is she extraordinarily dedicated, if you can't make it to office hours she'll always make time to meet with you, she is also a talented teacher who has a gift for explaining difficult concepts. She's also just a great person, and always someone good to talk to about grad school, managing your workload, etc. Since she went to Barnard herself, she knows what it's like to be a student here and always has great advice. Although the material isn't easy, it's definitely manageable and you're definitely given the tools to succeed. The problemsets are time consuming, but if you utilize office hours or meet with Buzzeo separately you'll be fine. The tests are extraordinarily fair. There are no surprises, and even if they are hard it's definitely clear how you should prepare for them. Take any class offered with Buzzeo, she truly cares about her students and is a great teacher.\nWorkload:\nWeekly problemsets, two midterms and a final.\n"
        },
        {
            "course_name": "Thermodynamics and Kinetics",
            "review_date": "May 11, 2011",
            "review_content": "\nProfessor Buzzeo has been a wonderful addition to the Barnard chemistry department. She is very intelligent, and can explain anything. Her office hours are arranged so that most of the class can make them, but if you can't make her scheduled office hours, she will arrange another time to meet with you. \nThe lectures are clear, and she writes everything important down, either on the board or on the slide. That being said, it is very important to go to the lectures, so you can get the notes in sequential order.\nThe problem sets take time and energy - I think I spent about 6-8 hours on them each week. If there is something that you don't understand from the problem sets, she will explain it during office hours. It is best to find someone in the class that you can go over your problem sets with, though.\nThe midterms were fair (although a bit long). They are based on the problem sets, so re-doing those problems will be a good way to study for the tests. Professor Buzzeo is also a very fair grader. If you get an answer wrong, but you set the problem up correctly, you will get partial credit.\nThe final was fair in the sense that you don't become overwhelmed, but you also don't think that it's too easy. Her final focused on the last third of the course, but certainly addressed the main ideas of the first two thirds of the course. Which is really what a final should be.\nAll in all, a spectacular course. Definitely take it.\nWorkload:\nOne problem set each week (6-8 hours), 2 midterms, 1 final. Class participation (go to class) was 5% of the grade.\n"
        }
    ]
}