{
    "prof_info": [
        {
            "prof_name": "Lalith Munasinghe",
            "prof_id": 68,
            "total_reviews": 29
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 17, 2016",
            "review_content": "\nGetting along Lalith requires more efforts than with other Econ professors. His exams are fairly written and his homework is nothing crazy, but the lectures are sometimes rather insulting in the sense that he expected certain answers from his students and if you recalled something quite different from his expectations, he would interrupt you instantly and directed the question to another student and so forth. The course content is straightforward and if you do well in the final, your grades may get bumped up (I did a little above average during the midterm, and got a few checks instead of check-pluses for problem sets, but my final grade is satisfactory). The latter half of the course has more topics with applications, such as job market signaling, time preference theory, and some preliminary game theory model, which are more interesting than the first half with consumer and demand theory. Having said though, understanding the first half is indeed, as the Professor claimed, crucial for understanding further topics. The course in overall is well designed and my TA Effie is extremely helpful. She compensated for the fact that Lalith is not very interested in things like office hours per se. Yeah -- he's intelligent, but pretentious in some ways. Be prepared for that and you will be fine. \nWorkload:\nWeekly/biweekly p-sets (11 in total)\n1 midterm, 1 final, mandatory recitation that goes over the solutions to p-sets \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 05, 2016",
            "review_content": "\nI understand why some people have complaints Lalith's teaching style because sure, he can be condescending, but if you learn to laugh it off you'll recognize how much he's actually taught you. \nThe only real frustrating thing was the lack of communication between professor, TA, and grader. At times they would contradict each other, or simply seem to not know what was going on in the lecture/recitation & problem sets. Also, and much more subjectively, his manner of flippantly writing people off when they don't get his definitions correct to the letter seemed to disincentive many students from participating; this was especially ironic when he himself would give different definitions from the ones I carefully memorized in order to avoid public humiliation (I say this lightly, at least he's funny...). Obviously, this still made the point of how essential the definitions were; perhaps it could just be done in a less dramatic manner. \nHe knows the material inside and out, and he explains everything with a clarity that I haven't found elsewhere in Columbia or Barnard Economics courses. He makes his courses challenging, and because he does not curve the class (he uses a weighting system), you know that your input into the course directly impacts the grade you receive. He makes sure to go over anything that people don't understand, and his (often biting) wit kept us engaged even when the topics were dreadful. The PSets were annoying at first but the grader was chill and the TA goes over every problem the next week in recitation. I was completely surprised to have enjoyed Microeconomics; his real-world examples and tangents about his research made it clear why this stuff is actually worth studying.\nWorkload:\nWeekly Psets, later in semester they become very straightforward\nRough-ish midterm (he's bad at gauging time necessity) \nIn-Class Final (should be interesting...haven't taken it yet)\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "April 11, 2016",
            "review_content": "\nhe majored in philosophy as an undergrad, so his lecture is 100% theory, 0% what is on the problem sets.  he also refused to coordinate with the recitation TA on problem sets, so they virtually never matched up with lecture, to the point where we had a problem set due the week after the midterm that covered material he taught the day before the midterm.. material that was on the midterm.  if you look up how to do the problem sets on chegg or whatever you can do the homework pretty easily, otherwise prepare to spend the first half of the semester staring at questions you have no idea how to solve (second half is easier, bc its straightforward stuff like market demand/supply, monopolies, etc).  munasinghe is super condescending during lecture and picks apart any answer he is given in class.  grading on the homework is incredibly harsh given that we never learn how to solve them in class, and homework were return LITERALLY MONTHS after they were due.  This may be due to the fact that the grader (who was different from the TA and the lecturer) was a new parent, but cmon, I need problem sets back that cover the midterm material BEFORE the midterm, not over a month after.  Its a doable class, but i dreaded going to every single lecture. His midterms are also annoying AF, where he asks for definitions and math problems, so don't take if you're looking for a more math focused course.  \nWorkload:\ntons of problem sets, 1 almost every single week\nmidterm\nfinal\nweights are assigned based on how well you did in each category\n"
        },
        {
            "course_name": "Labor Economics",
            "review_date": "May 20, 2013",
            "review_content": "\nLalith is definitely a fan of his own research, and prone to telling us about each of his studies and particular areas of interest several times without remembering entire half-lectures on it before.\nBut still. He makes himself very available, encourages discussion in class (although it is true that he isn't too kind to people who get it wrong, so just learn to shake it off). He genuinely loves the topic, and it's obvious. His lectures are clear, he treats students with respect, and there was a definite camaraderie - this is what I came to Barnard for. I think he's pretty funny, too.\nWorkload:\nNine sporadic ungraded problemsets (not bad at all), straightforward midterm and final. We also had a mini 2 page half-paper during reading week that some people complained about, but was really more interesting and philosophical than difficult although it could have been better timed.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 15, 2013",
            "review_content": "\nI took Micro with Professor Munasinghe. For those of you who've read the previous negative reviews and are concerned, they're UNTRUE. Munasinghe is a good professor, and Micro is a class you'll enjoy and learn. \nThis is a good class because:\n1. Organization: the course is structured around his topic-based lecture notes, which contain everything you need to know for homework and exams. Personally, I don't like classes where readings are irrelevant. Those courses usually have synthesized lecture notes but still require you to read to capture meaningless details that might trap you in the exams. Hate that. In Munasinghe's micro, if he tells you to read something, you definitely want to read it.  Everything you work on and read is core to the class and exams. The class has a minimalist style by design. \n2. Materials: Recently when I told a Barnard alum that I was taking Munasinghe's micro, she said a lot of the staffs she learned in it come back to her in the job (she's a consultant). I feel the same way about this class's usefulness. Micro is about the tangible economics: consumer choice, producer's choice, pricing, job market etc. I personally find that more interesting than Macro. Munasinghe teaches you a solid foundation of all theoretical topics and applications. And because they're so relevant to your life, you might be thinking in micro language next time when you face a \"price bundling\" or decreasing marginals (that's why I always get grande in starbucks).\nMunasinghe is a good teacher because:\n1. His philosophy of teaching economics:. Economics is all about models and assumptions. Most of the time, your econ professors give you some definitions and quickly jump to maths on the next lecture slide, and then you go home happy about knowing one more equation you can plug in. Munasinghe makes sure you know what you're talking about when you use a concept (and it makes a considerable part in your exam). He goes over the math part, but he attaches economic interpretation to the derivatives and results. I like that he is teaching us the economic way of thinking. \n2. He is incredibly good at lecturing: he does not use slides. Everything he says is in his lecture notes (by that I mean everything). You won't be missing any materials if you don't come to the lecture, but so far this class has the highest attendance of all classes I\"ve  had. Why? First, he comes up with many ways to interpret what he says on the lecture notes. By the time you leave you will definitely be able to define the materials in your words. Second, he is so funny. He gives you the feeling of \"yeah I hate this staff too but here we go.\" He often digresses into real world applications for half an hour and the class just doesn't want him to stop (One time he talks about the best ice cream in this area)ï¼ŽYes he points to students for questions and quickly wave you aside when you're wrong, but it's not personal. He wants everyone to know the concepts. In addition it's your fault that you're wrong. It's not a creative writing class guys. \n3. He's an intelligent scholar: The first day of class he will tell you his interesting educational path, which includes philosophy and politics. Indeed he's concerned about how human's drive for profits have changed or shaped our behaviors. This is very different from macro economists who take joy in analyzing aggregate curves moving around by a magical tap from the Fed. You'll think about what he said, and you'll realize how smart this guy is. \nThis is a Barnard class and Columbia does not allow their econ majors to take this version of Micro, but for those of you who are interested in Munasinghe, he also teaches Labor and his seminar, which I plan on taking. \n\nWorkload:\nLight-medium. bi-weekly (later weekly) problem sets that are not difficult.  Midterm and final are well written and fair. Contains term definitions and problems that are similar to homework.  No readings required. Textbook chapters are not necessary either. The time you spend on this class will lead to the highest efficiency and no complaints. \n"
        },
        {
            "course_name": "Senior Seminar: Human Capital Human Freedom",
            "review_date": "December 27, 2012",
            "review_content": "\nLalith Munasinghe has got to be the most obviously self-centered professor I know. The only reason he gets away with it is because he is smart. I read reviews about him before I decided to take this class, and thought that he would be manageable to deal with because he just got back from his tenure, but I was wrong. He still sucks. All of these reviews are true. \nHe interrupts you whenever you are trying to make a point. He tells you to \"just stop\" and says \"nope, next\" on to the next student who is trying to answer his incredibly vague questions. He asks the class to do small group presentations on a philosophical reading, and then when you don't present the material the exact way he wants it, he interrupts your presentation and basically makes you feel bad for even talking in the first place. On top of that, he is incredibly inaccessible and makes sure that you know he is a busy person and that his life is busier and more important than yours.\nAt first, he will seem extremely cool and offer to give the class free wine tastings and etc, but he will not follow through. He is incredibly self-centered, doesn't think you're important, and is only teaching this class to make himself feel like he is benefitting humans in the long run; that his class is a gift to us. He sucks.\nWorkload:\nReadings every week. 1-2 group presentations & a write up of each presentation. 1 final paper 10-15 pgs. Class participation.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "April 08, 2010",
            "review_content": "\nI took Professor Munasinghe's class for Intermediate Micro and I loved it, as did several people I know. Yes, perhaps Micro isn't the world's most exciting subject, but Munasinghe makes it very, very doable and sometimes interesting.\nHe doesn't expect his students to have a great knowledge of mathematics and he works from the ground up. He gradually builds concept on concept and when he does the other side of Micro in the 2nd half of the class, it feels like repetition. I took this class last year (spring) and I feel it has served me well.\nMunasinghe never lies to your that he's in love with the basic-basic aspects of Micro, but you can really see his passion when he discusses job signaling models and uncertainty problems. He makes everything very easy, very manageable, and I ended up learning everything I need for UL courses. \nThe best part is his lecture notes. They're much better than any textbook (don't buy a book) and if you read them, memorize definitions, and re-do the problem sets, then you're absolutely ready for the exams. He gives you pretty much the same questions as problem sets on the exams.\n\nSide note: the second problem set was the hardest one for the whole course and scared people away. Don't worry, it gets much easier from that point, and if you do your work... you'll find it 'easy' by the time you get through with his course.  \nSide note 2: Yes, he calls on people and asks for definitions. He asks because they're INCREDIBLY important for the concepts. When you know an exact definition, you can solve special cases. When you don't, you can't. It's that simple. \nWorkload:\nLight-medium. Yes, there were problem sets but they really weren't too bad. Some were lengthy, some weren't. The TA was awesome in recitation. Midterm and Final. He basically put your grades together and chose the best combination to give a grade.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "February 16, 2010",
            "review_content": "\nI would say that he is the probably the best teacher I have ever had in Economics. He is very clear and breaks things down so that you get them. I learned a lot and it didn't feel like work. I know there are some earlier reviews about how he likes to randomly call on people, which is true, but he doesn't make fun of you or anything for not knowing the answer. If you like interactive classes his is one to take. Also, very engaging, I never fell asleep in his class. \nA pretty easy grader, he takes your best scores and puts them together. I would say that from what I hear, he's pretty unavailable, but I never went to office hours so I can't really be sure. You should definitely take his course! \nWorkload:\nProblem sets were pretty  long, and he doesn't really go over the stuff in class, so they took a long time to do because it is the first time you are seeing the material. That being said, they prepare you very well for exams. \nMidterm and final, weighted dependent on how you do on them. If you freeze up on your midterm, it won't count for as much. You don't have to do the homework, but you should do it cause it helps a lot. \n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "December 27, 2009",
            "review_content": "\n Lalith is possibly the worst professor on campus, and certainly the least helpful.   As others have stated, he is disgustingly arrogant and pretentious-- His head is so far up his bum, I don't know how he can breathe. Spending a couple of hours a week at a round table with him was torture. He was unapproachable and condescending and didn't even seem to enjoy teaching.  Most classes consisted of discussions on the readings and related theories. The books were very interesting and the course should have been an amazing experience but Lalith managed to ruin it. If you can avoid it, do NOT take a class with this excuse of a professor.\nWorkload:\nReading required a couple of hours a week. \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 27, 2009",
            "review_content": "\nLalith is not helpful at all. His lectures in class tend to be pretty clear, but if you ever have a problem, don't expect him to help you out. he is arrogant and makes you feel dumb if you don't understand. make sure to read his lecture notes before class, because he might call on you about something straight out of his notes, but if you don't know it, he makes you feel silly about it. He constantly would tell us that we were moving too slowly and that everything we were doing was \"kindergarten stuff.\" He made intermediate micro much harder than it might be with a different professor. Also, grading seemed to be pretty random. I got an A on the midterm, bombed the final (probably) and got a B in the class. Others received Cs on the midterm, bombed the final and got A's. So it's pretty random, it seems. Also, the TA is completely useless. \nWorkload:\nproblem sets that take hours to complete and don't really count for much but are REALLY important for practice, a midterm and an unnecessarily difficult final that most people bomb, which he then curves immensely. \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 26, 2009",
            "review_content": "\nLalith's ego is suffocating.  That being said, his teaching style is fast but clear.  Microeconomics is tedious, and not remotely fun, but I must say that there were times when I appreciated Lalith for saying something absurd to make a concept interesting.  The midterm and final were difficult, so study early and often. \nWorkload:\nweekly problem sets (not graded), midterm, final\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "September 05, 2008",
            "review_content": "\nLalith is a weird guy. Goes off on a ton of tangents and you really have to read the book because he is useless in class. \nOne on one he is a good guy. Hard final, I got a B in his class but felt the grading was fair. \nWorkload:\nToo much.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "March 04, 2008",
            "review_content": "\nIntermediate Micro is HARD. this  class will be difficult no matter where you take it, and taking it with Lalith certainly doesn't help. His problem sets are hard, but most answers can be found in the intermediate micro supplemental text (which i definately reccommend puchasing).  his grading system is somewhat unclear, and there are huge curves on the midterm and final. also, last semester he changed the midterm to the day after halloween from the day before. he did this a week before the midterm. hes quite disorganized, and the answer keys to the homeworks never really tell you anything. but find a few good study partners and you'll be fine. \nWorkload:\nweekly difficult problem sets, a hard midterm and a hard final. \n"
        },
        {
            "course_name": "Labor Economics",
            "review_date": "January 02, 2006",
            "review_content": "\nLalith is an engaging teacher, probably the most engaging econ teacher I have had yet. His lectures do not cover too much material, but they are still interesting -- people don't fall asleep in this class.\nHe's also very good at explaining concepts clearly. When students are wrong, Lalith is unafraid to let them know, and he uses his response as an opportunity to further clarify the subject to the student and the rest of the class.\nUnfortunately, he often takes an antagonistic attitude with the class. He got upset if we interrupted his train of thought, told students they were wrong when they were right, and made sure that everyone knew when a student was entering the classroom late. That's his teaching style.\nWorkload:\nWeekly problem sets which are supposedly optional (but everyone did them), not graded (but our TA graded them anyway), and are only looked at if you are on the margin between final grades. A midterm, a short (500 word) essay, and a final. Grading is more difficult than you might expect.\n"
        },
        {
            "course_name": "Labor Economics",
            "review_date": "December 23, 2005",
            "review_content": "\nPersonality-wise, lalith doesn't fit the bill for an econ. professor. He's too cool. When he's not engaging the class in lively discussion about the subject he's going off on wonderful tangents about the economics of wine and wine-tasting (Q: Why is it that the billionaires who go to lalith's parties (where everyone brings a bottle of wine by definition)have the worst taste in wine? He'll teach you!). All econ majors interested in HR stuff should definitely take this class, and\nI'd say even my comp-lit friends should take this class, even if it'll only just refine their disdain for economists.  \nWorkload:\naverage. you don't have to do the problem sets, but they help. a midterm and a final for which you have to just read your notes. \n"
        },
        {
            "course_name": "Labor Economics",
            "review_date": "December 22, 2005",
            "review_content": "\nI enjoyed this class.  Lalith definitely knows his stuff about labor econ and applies the lecture material to real-life situations that make it that much easier to understand.  The class got a little disorganized at times, probably because Lalith was a little overwhelmed by the class' size (my section was about 50 students--he said most previous sections had a little over 20).  But in spite of that, I still think he did a good job.\nWorkload:\n9 problem sets (ungraded, but necessary to understand the material), midterm, short 500-word essay and final.  His grading is picky on the exams but his curve is quite generous.\n"
        },
        {
            "course_name": "Senior Seminar: Human Capital Human Freedom",
            "review_date": "May 02, 2005",
            "review_content": "\nEven though the class met on Thursdays from 6:10-8pm, I looked forward to it every week. Every class was informative, fun, and entertaining.  The readings are great and the discussions are even better.  You leave every class with a better understanding of the world...I know it sounds weird,  but it's true. Trully an enlightening experience. Take this class.\nWorkload:\nWeekly, interesting readings. A final paper on whatever you want to write about. \n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "February 22, 2005",
            "review_content": "\nHe was excellent. Every lecture was informative, energetic, entertaining, and really genuinely funny.  I adored Lalith.  He really cares about relaying the material effectively and will get you excited about econ, even tho he facetiously calls it a boring subject.  He likes to integrate psychology into discussions about economics and will go on really fun tangents.  The problem sets are doable but not easy, and they don't really effect your grade too much.  Midterm and Final are very straightforward because Lalith runs thorough review sessions and is very clear about what he wants to cover on tests.  However, you will need to study because he is very thorough with material he covers, and the class will seem like it's moving quickly at times.  This class was generally a great experience and I would take any other class that Lalith teaches.        \nWorkload:\np-set every week, midterm, final\n"
        },
        {
            "course_name": "Labor Economics",
            "review_date": "January 17, 2005",
            "review_content": "\nI (and everyone else in it) really enjoyed this class.  Lalith is awesome.  It def helped that it was a smallish class and everybody contributed a lot.  The material is really interesting stuff that you can apply to all sorts of real world situations.  Also, if you ask him to, he will post lecture notes on courseworks, which is really helpful when you're studying for the exam.  I would def recommend this class.\nWorkload:\nNot hard.  Problem sets everyweek in the beginning of the semester and then only once in a while the second half of the semester.  The problem sets can only help you.  They're not mandatory; he only looks at them if you bomb the midterm and the final.  And if you do the problem sets, the midterm and the final will be totally reasonable.  Final is non-cumulative.\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "January 09, 2005",
            "review_content": "\nThis is a class for people who are genuinely interested in economics, and that is how Lalith presents it from day one.  He is a very intelligent prof with a sarcastic sense of humor that certain people can find to be annoying, but I loved the guy.  \nHe can take such a dry, boring subject filled with graphs, charts and stats and make it apply in the real world - and i found his (phd dissertation?) paper on \"Why Dancers Smoke?\" to be extremely interesting.  He is interested in going beyond the material and making it actually mean something to us beyond the numbers and facts.\nBeing a first-year, I was worried what \"lecture\" classes really meant.  But Lalith (and he insists that you call him by his first name) is a professor that blames himself and his own teaching style if a student doesn't understand the material - as opposed to other profs who blame the students.  And so he really tries his best to present the material in a simplistic manner. \nI personally will take any other class Lalith offers.\nWorkload:\nGO TO LECTURES, Do the problems sets, go to the review sessions, REVIEW the lecture notes! I didn't even buy the book that was suggested for the class because Lalith makes it a point to take only information from his own lectures and notes.  \nThe midterm and the problems sets don't really matter towards your grade, the determining factor is basically your final exam. \nFair grading, he is willing to give out 50 A's if each student deserves that. -- On the flipside, he's will to give out 50 D's if they deserve that.  So don't expect curves/scales on the final.\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "August 08, 2004",
            "review_content": "\nThe instructor although extremely bright and experienced suceeds only at in my opinion  promoting his own ego at the expense of the economics newbies who are largely put off.\nThis experience was so harrowing that I dropped the class and moved on.\n\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "December 15, 2003",
            "review_content": "\nDon't be fooled by the title; this is no intro class.  Lalith announces on the first day of class that he will be teaching to an intermediate micro level, but what he really means is he is teaching only to those who want to pursue a major.  If you do not plan to be an econ major, do not take this class!  He is obviously and consistently bored during class; he constantly remarks  how trivial the material is and gets frustrated when we do not immediately know an answer to one of his questions.  While Lalith is a nice person, he has no patience for teaching an intro level course.  I have had four semesters of calculus and still managed to get lost in the math he was teaching.  Only take this course if you are definitely going to be a major, he will make you hate econ otherwise.\nWorkload:\n9 problem sets that you got a check-plus on if you handed in.  2 midterms and one final.  The tests get progressively harder, and be prepared, you are not allowed to use a calculator on any of them, and he'll still give you numbers that don't divide evenly.\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "September 10, 2003",
            "review_content": "\nProf. Munasinghe is a pretty funny guy if you ask me. However, his lactures tend to be tough if you don't read any of the class notes he posts on courseworks (or read thetextbook). Don't take this class if you have never had any econ at all becuase it's not exactly easy. Prof. Munasinghe can explain all of the concepts, but you really have to do the math and know detailes from the notes.\nWorkload:\nproblem sets which take a while to do, midterm, final...the usually painful exams..\n"
        },
        {
            "course_name": "First yr Seminar- Human Freedoms",
            "review_date": "May 05, 2003",
            "review_content": "\nBy far the best class I have taken all year.  This guy is amazing!  He is witty, a genius, and is passionate about food.  He definetly taught our class how to break down difficult reading.  The readings were equally fascinating.  I would love to take another class with him.  He's so cool that I just wanna hang out with him and talk about life and how depressing it is.\nWorkload:\n3 papers, drafts for all but final paper graded...oral presentation that only helps, doesnt hurt...2 class leading discussions...not as hard as long as you speak to him about your paper...he's always willing to help despite his busy schedule\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "March 28, 2003",
            "review_content": "\nthis was a pretty good class. i feel like i learned a lot. the professor was nice, although he was easily distracted by ringing cell phones. you didn't have to buy a textbook and he posted really great notes on courseworks. the course work was very manageable.  i would recommend this class.\nWorkload:\nabout 6 problem sets. 2 midterms. 1 final. the tests seemed to get harder each time.  professor munasinghe was pretty vague about how he came up w/ our final grades, but said he weighted each person's scores 3 different ways and gave us whatever final grade was the highest\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "March 24, 2003",
            "review_content": "\npeople seemed to have mixed opinions about this class - personally i found that all i needed to do was go to class and i did pretty well. reading the book is basically optional because he posts lecture notes online. the final was definitely more difficult than either midterm,  but still doable. also he's a considerate grader, and had several different weightings for the test to give each person their best possible average.  i thought he made the material really easy to understand, but some people didn't get it at all.  he's a pretty amusing guy who will stop and tell the class about the marvels of his new palm pilot. review session before every test, either by him or TA.\nWorkload:\na problem set almost every week (took some people hours to do, took me about 30 min), 2 midterms and a kind of difficult final\n"
        },
        {
            "course_name": "First-Year Seminar",
            "review_date": "December 31, 2002",
            "review_content": "\nI took a first-year seminar with Lalith (who prefers to be called by his first name), and despite my initial doubts, I got a whole lot out of the class. True, he is a stickler for preparation and doesn't mask his opinions about comments made, but he presents the material from Marx to Nietzsche to Freud to Orwell in an interesting and refreshing way. Lalith is a tough grader, so expect to work very hard. I know some people have reservations about Lalith, but if you're willing to do the reading on time and carefully, contribute to class discussions and take his constructive criticisms seriously, you will learn a lot about the subject and about yourself as a student. \nWorkload:\nThree or four concise three-page papers and an oral presentation. Lead class discussion at least twice.\n"
        },
        {
            "course_name": "Labor Economics",
            "review_date": "August 26, 2002",
            "review_content": "\nI guess I can see how the previous reviewer could get the impression of Prof. Munasinghe, because he's idiosyncratic and opinionated. But, in my opinion, he's also really cool. I think his attitude makes lectures interesting and fun. He's excellent at conveying subject matter, and I thought the course material was interesting. Yeah, he won't hide his antipathy towards whiners and grade grubbers... but s**t, those people piss me off too. If you get a kick out of seeing smart-asses being taken down a notch, then you'll like Munasinghe. In addition to having had him for this course, Munasinghe is also my major adviser, and I think he's f**king awesome: down-to-earth, accessible, will help you out in a jam, etc. He's kind of a smart-ass himself, but in a funny way; I don't know about this \"indifferent and rude\" stuff that the other person is talking about.... that hasn't been my experience at all. \nWorkload:\nnot too bad: one midterm, a final, and problem sets about once every two weeks that aren't graded. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 31, 1999",
            "review_content": "\nIndifferent and rude to students. Clear antipathy to his undergrads, the education process, and the world in general. It's certainly possible to get an A, and he is qualified as an instructor, but even his TAs have complained about him.\n"
        }
    ]
}