{
    "prof_info": [
        {
            "prof_name": "Serban Iorga",
            "prof_id": 1625,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Methods for Social Research",
            "review_date": "April 23, 2012",
            "review_content": "\nThere's nothing worse than a professor that's just as bored of a terrible course as his students are. Methods is already a dreary class that requires memorization of survey types, variable classifications, standard deviation calculation, etc., and Professor Iorga doesn't make it more stimulating at all. Possibly the most annoying part of the course is constantly being asked questions with obvious answers, or when he states something and basically just asks that the class re-state it out loud. This definitely shouldn't be a 4-point course.\nA good-intentioned guy, Iorga simply shouldn't be a professor in this area. \nGo to class, take notes and you'll get an A.\nWorkload:\nEasy grading. Bi-weekly homework assignments consisting of 15-25 multiple choice questions each given a week ahead of time. One 50-question multiple choice midterm to which he basically gives out the answers that takes about 25 minutes to complete in class. Readings that you never have to do. Final.\n"
        },
        {
            "course_name": "Statistics/Methods",
            "review_date": "August 24, 2004",
            "review_content": "\nI agree with the previous reviews: Serban is nice, boring and an easy grader. If, however, you actually want to learn some statistics stay far away from this class. I learned more in my highschool AP class. Seriously, we covered maybe three chapters of the text book and none of it except finding the mean and mode is relevant to real-world stat use for sociology. Don't take this class if you plan on doing a thesis or any type of sociology where you would want to apply statistics. I was really disappointed. \nWorkload:\nEasy - Very simply homework assignments, in class midterm and final.\n"
        },
        {
            "course_name": "Statistics/Methods",
            "review_date": "February 09, 2004",
            "review_content": "\nAlthough Iorga may be dull in class and the material he is covering is boring, he is truly a great professor one on one.  He is willing to grant extensions, and explain things one on one to students.  Let's face it, statistics aren't meant to be fun.  Bearing that in mind, Iorga does the best he can.  Specifically for this course, it is a MUST to attend lectures (those who didn't come to lecture and read the book instead often did poorly on exams).  Bottom line:  if you go to lecture and study for at most an hour before the exams, it is an easy A.\nWorkload:\nlight: 6 homework assignments (5-6 problems each) and 3 exams (2 or all of which are multiple choice)\n"
        },
        {
            "course_name": "Statistics/Methods",
            "review_date": "January 12, 2004",
            "review_content": "\nThis class was not horrible, though it was painfully boring at times.  For a few sessions at the beginning of the course, we reviewed mean, median and mode.  Basically a return to third grade math.  The class gets a bit, but not much, more complicated than this.\nThe key to doing well in this class is attending.  Prof. Iorga gets upset that people don't come and it really is difficult to learn the material from the book.  Also, he will be more willing to help you out and grade a bit easier if he knows who you are.\nIf you are not a sociology major, this is a great class to take for a science requirement.\nWorkload:\nNot bad at all -- no need to do the reading he assigns.  A few problem sets, a pre midterm, midterm and a final -- all exams are multiple choice, and for the final you are allowed a cheat sheet.  But beware -- no partial credit is given on tests!\n"
        },
        {
            "course_name": "Statistics/Methods",
            "review_date": "December 27, 2003",
            "review_content": "\nAs a requirement for Sociology majors, this class is pretty painless because Serban is a nice guy who wants everyone to do well. His approach reflects the idea that everyone in the class is math-challenged, which results in a course with really clear objectives. He explains everything at length and with utmost clarity and maintains patience with students who are trying to make the material more difficult than it really is. He seemed frustrated at times only because attendance waned; you should go as often as you can because there are some things he teaches that are not adequately addressed in the book. I couldn't really say what Soc majors are supposed to take away from this class in terms of later application to Sociology but it's a very good way to acquaint oneself with simple statistical concepts. Serban makes the best of one of the more boring requirements for the major. \nWorkload:\nProblem sets given around every two weeks; you're given 6 and 4 are graded. If you don't go to class, then the problem sets can seem impossible so make sure to go as often as you can. There's a pre-midterm, midterm and a final that are really not bad at all; he even allows a cheat sheet for the final. He pays attention to notation so make sure you do too. Other than that, there are no surprises in this course.\n"
        },
        {
            "course_name": "Statistics/Methods",
            "review_date": "May 14, 2003",
            "review_content": "\nAll statistics and no methods, this class was the reason I dropped my sociology concentration--it cemented my distaste for the discipline's often reductionist oversimplification. But if you're dead set on soc, then you're stuck taking this silly little class, and Serban's a good guy to take it with. He explains concepts VERY clearly, and since the course covers relatively little material, you're sure to know your stuff well by semester's end. Great for math-phobes. He's also a nice guy with a good sense of humor. I think it's impossible to like this class--the material is as dull as it gets--but if you have to take it, take it with Serban.\nWorkload:\nShort problem sets due every 2 weeks or so, 2 midterms and a final. The midterms were a bit over the top--the problems themselves were easy, but he put these weird conceptual questions on there and took off full credit if you didn't word them correctly. My guess is that people complained about it, because for the final the conceptual questions were gone, and the test was open book to boot. You won't need to put in a great deal of time to do well in this class.\n"
        }
    ]
}