{
    "prof_info": [
        {
            "prof_name": "Isser Woloch",
            "prof_id": 31,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Europe in the Age of Revolutions",
            "review_date": "January 03, 2005",
            "review_content": "\nI was mostly apathetic about this course, which became my requisite neglected class of the semester. Professor Wolloch examined the entire period through a political lens, with occasional forays into social and economic history, but, sadly, he basically omitted discussion of intellectual and cultural developments. He failed to cover the period in a new or comprehensive manner. This class was simply a glorified (and lengthy) timeline of the French Revolution, Industrial Revolution and Revolutions of 1848, tied together awkwardly with extensive references to liberalism and nationalism. Ultimately all important topics for the history major and citizen in general, but not presented in a very interesting way.\nWorkload:\nTwo papers each with patronizingly obvious prompts and a final exam. I routinely zoned out during lectures, read only when it came time to write my two essays, spent approximately one day cramming for the final (the list of potential IDs and essay questions was long, but their themes overlapped extensively) and came out with an A. Really easy.\n"
        },
        {
            "course_name": "Europe in the Age of Revolutions",
            "review_date": "December 25, 2004",
            "review_content": "\nthis is a hard one to review. i had really high hopes for this class, since i was really exited about the subject. and you _will_ learn things that are useful to know if you're a history major and studying anything post 1798, be it american history, modern middle eastern history, or whatever because obviously this course deals with the birth of ideas (liberalism, nationalism, socialism etc.) that were to become very influential. \nso to all you history majors out there, i would recommend taking this class early on (like maybe sophmore year).\nHowever:\nThere are many things about this class that made it a less than pleasant experience. \nFirst of all, a disproportionate amount of time is spent on studying the French Revolution (we weren't done with it until halfway through the semester). I suspect the reason for this bias is that Woloch is one of the heavy weights in that field, but still, it becomes somewhat tedious when you're into your fifth week of jacobins and sans culottes.\nI would also have preferred the class to deal more with themes and less with giving a blow-by-blow chronological account of events. While the class does provide a good solid base in 19th century European history it's not exactly eye-opening. Unlike some of the better classes I've taken at Columbia it doesn't provide any new perspectives on anything, or make you think in new ways. Rather it provides you with the standard master-narrative that more interesting professors will later dismantle. The same thing goes for the books, functional but not particularly interesting.\nFinally, I found Woloch thoroughly unpleasant on a personal level. In lecture he's fine, albeit a bit dry. However if you have a question after class whatever it may be, he is just plain rude and offensive. He cuts you off mid-sentence with some dismissive remark that lets you know that he didn't listen to your question, doesn't care anyway, and isn't interested in taking any of his precious time to interact lowly undergrads. \nThis was my personal experience ( i soon learned to take any questions to the TAs who where far more helpful) and many other people in class had similar bad interactions with Woloch.\nTo summarize: It was worth while taking this class because it taught me things I wanted to know, yet I wish it had been taught by someone else and in a different manner.\nWorkload:\nfairly light, not much reading for a history class. and the reading pretty much covers the same ground as the lectures. there are four whole books, a couple of chapters out of various others. the essay assignments are average, but terribly unevenly distrubted. first nothing, then two eight-page essays within a month of each other. \nthe final exam isn't too bad, but the scope of the preparations for it are. he'll give you a study sheet with about 60 possible id's (7 will appear on the final) and 10 possible essay topics (there will be a choice of four on the final, you only have to two) geez, thanks for narrowing it down for me...\n"
        },
        {
            "course_name": "Europe in the Age of Revolutions",
            "review_date": "March 31, 2003",
            "review_content": "\nProf. Woloch is one of the best lecturers I have encountered at Columbia.  His lectures are fast-paced and jammed with information but they are well organized.  If you take good notes, they will be as useful in writing papers or studying for the final as any of the texts he assigns.  I know a lot of students have been turned off by his demeanor, but this was not my experience.  He was always willing to stop for questions (in a class of about 50) and was more than happy to explain or discuss concepts after class or in office hours.  I don't disagree that Prof. Woloch is an intimidating man but his passion for the French Revolution makes his class fascinating and he certainly shows respect for any student who shares his passion.\nWorkload:\ntwo 5-7 page papers and a final, assigned readings are not essential to getting a good grade but well worth the effort if you are actually interested in history\n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "December 27, 2001",
            "review_content": "\nI don't think any of his students would call Prof. Woloch a *sweet* or especially *warm* man as I hear his wife (also a Columbia professor) is. He has a sharp edge, and he seems very intimidating at first. But he is an incredible teacher. He jampacks a lot of interesting information into every lecture, and I walked away from the semester feeling as if I had a really good base in European History. Clearly he cannot explore every aspect of this time period in one semester, but I think he did a great job of choosing important topics and examining them pretty thoroughly. This is a survey class-- and survey he did. Though sometimes long, I genuinely enjoyed the lectures-- Prof. Woloch is a great speaker and knows his stuff. His passion for history makes his lectures really engaging. I highly recommend going to his office hours. He's extremely receptive to you if you show that you are interested in the topics at hand and would like to explore the topics further. He always makes himself available to meet one on one with you. I was blown away by the fact that a man who is so prominent in his field and has so many students makes himself so accessible to students. If you want to get a solid foundation in European history and don't mind working hard, you will love this class. If you want an easy intro class without a lot of work, this is not the class for you.\nWorkload:\nA lot of reading (around 100 pages weekly) , but not too many graded assignments. One 7-9 page paper, one midterm, one final. Essay questions and IDs for the midterm and final are handed out in advance. Take good notes-- they are really important for the final. By the way, he most likely will not be grading you. His TA will do that. If you have Kate Pickering, count yourself lucky. She is a wonderful teacher and a very nice person (and not that bad a g\n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "December 09, 2001",
            "review_content": "\nThis was a decent course, ideal for first-years getting their feet wet in history; if you have any history under your belt already, however, you might end up feeling somewhat unsatisfied, as I did. This is a vast span of time, so you won't really have time to go into any depth on any of it; we spent one day on the Russian Revolution, for example -- something that you could definitely study for your entire life. Maybe my dissatisfaction was more a matter of taste than of anything else. Woloch's lectures were good but dry. He's apparently a big name in French Revolution scholarship, which you can tell from his astute analysis of French history, but unfortunately it's hard to appreciate how subtle his analysis might be without having a really solid background in the subject, and (as I learned in this class) you just can't get that in a survey course.\nWorkload:\nReading averages to about 100 pages a week, but it tends to clump together, with a few weeks of 30 pages each and then a 200-page book for one week. 7-9 pg. paper on any subject in European history since 1789. Tough but manageable midterm and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 14, 2001",
            "review_content": "\nAlthough very knowledgeable (he knew his CC material VERY well) and organized, he is extremely opinionated. And if you don't agree with his interpretations, you will be penalized. In all his grading is strict, but not overly harsh unless you write something he doesn't agree with.\nWorkload:\n3 papers, and a final (he gives a study guide, but it's still a challenging exam\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 06, 2001",
            "review_content": "\nOther reviews of Woloch have been unkind to the point of inaccuracy. Woloch's CC class was the best class of the past semester for me... while he wan't exactly sensitive to ideas contrary to his own, he was only occasionally mean about dismissing them. To his credit, Woloch makes CC what it was intended to be. His style deals well with the major problem of CC, namely that there is too much information and too little time. His classes are extremely well organized and he does an EXCELLENT job hitting the major points. Because he is committed to helping people understand the major concepts in each text, anyone who bothers paying attention in his class will walk out with a wonderfully strong sense of what the books on the syllabus were about. And isn't that why you're taking CC? This is certainly more than I can say for most CC professors. In sum, Woloch may not be your best friend but he will definitely teach you what you need to know about CC.\nWorkload:\nThree papers and a final (all questions are supplied beforehand).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 10, 2001",
            "review_content": "\nThe above reviews are 100% accurate. Isser is one of the biggest [CULPA edit:enter one of your favorite nouns here] I've experienced in my two years of Columbia. The goal of his lectures is to prove that he has superior knowledge to his students. His lectures are only interesting to himself as the students spend half the class listening to him babble. He is without a doubt the worst professor I have ever had. If you are in his class, get out!!!!\nWorkload:\nThree papers, one final. Grading is extremely harsh. He is unaproachale for office hours because he is too \"busy\" running the history department.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nHe stomps on conflicting opinions to his own, known to have shouting matches with students who challenge his method of not considering students' opinions. A TERRIBLE grader. Gives few comments if any. Bland lectures.\nWorkload:\n3 papers and a final exam make it appear better than the rest, but don't be fooled. All difficult. None graded kindly. The quintessential example of why certain professors shouldn't be tenured.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nWoloch is a one-man academic plague. He stomps on conflicting opinions to his own, known to have shouting matches with students who challenge his method of not considering students' opinions. A terrible grader, who gives few comments - if any. Bland lectures.\nWorkload:\n3 papers and a final exam make it appear better than the rest, but don't be fooled. All difficult. None graded kindly. Perhaps, just perhaps, certain professors shouldn't be tenured.\n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "December 31, 1999",
            "review_content": "\nThe other review was too harsh. Granted, Isser is not the friendliest guy in the universe (my friends and I in his CC class called him \"Pisser\"). Nonetheless, chat him up during his office hours and if you somehow manage to do well in his class, ask him to write you a recommendation. He'll be tremendously receptive to you. Along with his lectures, you'll receive a free lesson in professorial calisthenics. You'll marvel at the way Woloch contorts his body during class. The lectures are jam-packed with all sorts of facts. Just don't mind the look of pain on his face as he realizes that attempting to teach two-plus centuries of European history in a semester is just not feasible. He manages to stay pretty darn organized, but it's not too hard to figure out that his specialty is the French Revolution. He gives guides to studying for his midterms and finals. Be forewarned: the guides don't mean that the exams are any easier.\nWorkload:\nmidterm, short paper (5-7 pages, I think) and final. Discussion sections. Choose your TA's wisely.\n"
        }
    ]
}