{
    "prof_info": [
        {
            "prof_name": "Elliot Paul",
            "prof_id": 11734,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "May 21, 2014",
            "review_content": "\nFor the field he is in, Prof. Paul deserves a gold nugget. Let me put this in perspective, he is an active contributor to philosophy (just published his I believe second book) yet makes relatively old issues comparable with modern analogies. I'll even go you an example.\n\"John Locke has a weird way of saying things. He'll be like Freedom, comma, what? It reminds me of Lil Jon.\"\nHe's not only a great lecturer but an amazing listener. He gives students numerous opportunities to ask questions and will be able to thoroughly answer any of them. \nIt is also obvious he is quite brilliant, which I found intimidating at first. However, after going to office hours I discovered him to be genuinely caring and interested in his students' progress in his course. One time, I had signed up for 20 minute slot to meet with him about an essay. It really needed help and so he had discussed it with me for about an hour. I also got an A on the essay so it wasn't like a waste of office hours.\nHe knows names in his huge lecture classes which is impressive. He's the type of professor you will want to say hi and talk  to you when you see him on campus.\nFor the grading, I would say it is extremely fair. He gives you a study guide that covers about 90% of potential material that is on his tests. If you answer the study guide, you will be able to do well on his tests. The papers were graded by the TAs thoroughly fair as well and they tremendously appreciate thoughtful effort.\nAll in all, if you want to delve into the realms of philosophy, I would take Intro with Paul. I am pretty sure I'm going to major/minor in this field because of this course.\nWorkload:\nMidterm (20%)\nFirst Paper (20%)\nFinal (30%)\nSecond Paper (30%)\n"
        },
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "May 04, 2014",
            "review_content": "\nElliot Paul rocks!! He is such a sweet professor and a really interesting lecturer- especially when he makes his unexpected but hilarious modern music references (ex. you know JayZ says the same thing in his song No Church in the Wild). For this class, all you got to do is go to lecture and take notes and study and make sure you know the material! The readings are helpful as well but going to lecture is kinda crucial because some readings are too complicated to understand all by your lonesome. All in all he's awesome and the TA's are always there for you. I really loved this class and recommend that you take it with Paul - he's the best!\nWorkload:\n2 essays. 1 midterm. 1 final.\n"
        },
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "May 18, 2013",
            "review_content": "\nDefinitely take Intro to Philosophy with Dr. Elliot Paul. He is extremely fair, and extremely understanding. He's not like most professors who think that their class is the ONLY class. Try emailing him your comments or questions about a reading, and I promise you he will reply with clarifications and make sure you understand the content and the debate at hand (ie. Skepticism, Free Will, etc.) Always willing to help and if you ask him a question after class, you will see how kind he is. \nIt's a lecture but like the reviewer below said, he knows EVERYONE's name. Very impressive. Dr. Paul is very knowledgeable in the subject and makes the philosophy topics interesting. Try one class, and you'll see what I mean. \n\nWorkload:\nThe workload is DEFINITELY manageable. If you want to take this class for an easy A, I discourage it, only because that means that you might not give as much effort to the course as a Bio course and you are at a disadvantage. \nSeriously do the readings (they are pretty short and very, VERY, interesting) and the exams and papers will be a breeze. He even uploads review sheets of the topic, so there really is no excuse to not do well in this course. Do the readings and definitely go to class (pay attention), because what he covers in class WILL be in the exam (it's a good thing because you know what to expect.)\n"
        },
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "April 08, 2013",
            "review_content": "\nDr. Paul is such an awesome guy and a really good teacher.  he is well organized and does not go too fast.  he really tries to make sure that the class understands before moving on.  he provides funny examples and just has a really pleasant personality.  he truly cares about his students.  he is a fair grader.  i think that he wants all of his students to do well and understand the concepts that he presents.  this class is a decent size, perhaps 50, and he knows everyone's name.  that is awfully impressive.  \nTAKE HIS CLASSS!!\nWorkload:\nreading for each class, not that much and they are interesting\n2 response papers\nmidterm\nfinal\n"
        },
        {
            "course_name": "Early Modern Philosophy",
            "review_date": "December 10, 2012",
            "review_content": "\n   Professor Paul is a fantastic professor to learn from if you want to really understand Descartes's philosophy. That we spent the greater part of a semester on only the Meditations on First Philosophy seems flabbergasting in retrospect, but by the end of the class you will understand exactly what drove Descartes to pursue his hyperbolic doubt, how modern interpreters have attempted to save him from his Cartesian Circle, and the philosophical tradition that he emerged out of and responded to. \n   If you do not like Descartes, or find the pursuit of metaphysical certainty pointless, then you will probably want to skip this one. For someone that came to this class without a particular interest in Descartes or Epistemology, I still found that learning about him was valuable because of the enormous role he played in the history of philosophy as he ended the era of Scholasticism and ushered in the early modern philosophical debate between empiricism and rationalism.\nWorkload:\nOne 6 page paper, one 10 page paper, 5 pass/fail Blog Posts and Class Participation\n"
        },
        {
            "course_name": "Early Modern Philosophy",
            "review_date": "November 15, 2012",
            "review_content": "\nElliot Paul is a god.  Ask him what Descartes would say about anything, and he knows the answer. This class is called \"Late Medieval and Early Modern Philosophy\" but he chose to do the class on Descartes.  His knowledge on the subject is extremely impressive.  He's clearly read the stuff at least 200 times.  Aside from this, he is quite charming, soft-spoken but enthusiastic. \nOverall, knows his shit, is very articulate, and is a very nice person.  Fair grader.  Take a class with him!!!\nWorkload:\nTwo papers, five pass/fail blogposts, class participation\n"
        }
    ]
}