{
    "prof_info": [
        {
            "prof_name": "Joshua Green",
            "prof_id": 1609,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "September 21, 2016",
            "review_content": "\nWow.  Totally assume.  He can draw a figure 8 knot with one hand and trefoil with the other in real time.\n\nWorkload:\nTotal gut.  Baldwin is better\n"
        },
        {
            "course_name": "Structure and Style",
            "review_date": "March 24, 2007",
            "review_content": "\nIf you want a professor who is in love with his own whimsical thought (saying words he finds entertaining that come up in conversation over and over to himself), thinking he is on the brink of an important lyrical break through- take class with Josh. \nHe's not a bad teacher.  He makes a weak attempt at not coming off as a smarmy wordsmith, but fails.  He obviously favors poetry and really doesn't appreciate those who don't follow his vague road.  He gave no help in the short story section and that was what the majority of the class was interested in. \nIf I could go back in time I would select someone else; I would recommend others to do the same.\n\nWorkload:\nReasonable: a piece per class, revisions expected.\n"
        },
        {
            "course_name": "Poetic Forms",
            "review_date": "January 16, 2006",
            "review_content": "\nI really liked Josh Green's class. Though initially I was annoyed at being asked to write poetry in forms I didn't usually use, many of these exercises turned out to be helpful and stretched my poetic range by getting me to try new things. Josh is a really cool guy, and has a laid back yet subtly humorous way about him. Also, he looks like a poet. The only thing I didn't like about the class was how much work there was...there are a lot more things to do each week than in a normal poetry class, and it's easy to fall behind when postings are due sunday night.\nWorkload:\nA few readings and a courseworks posting each week (due SUNDAY NIGHT), a poem a week, a letter to one of your classmates each week.\n"
        },
        {
            "course_name": "Free Verse and Poetic Forms",
            "review_date": "May 08, 2004",
            "review_content": "\nProfessor Green (or Josh, as he prefers you call him) changed the way I write. He focuses not on the product but the writing process, and encourages you to go beyond the style you are set in- to test the limits of syntax, grammar, and usage and really play with the language. He is extremely well-versed (pun fully intended) in poetry and brings a lot of scholarship to his consideration of student work. \n     I went into Josh's class having written poetry since age 10 and with a portfolio pretty similar all the way through, being prone to excessive modifiers and cliched arrangements of language. I left it with a portfolio stocked with many different types of poetry, and with a much more provocative and personal style. Don't miss out on the chance to study with Professor Green- he is a true lover of reading and writing poetry, and has a Shakespearean goatee to match.\nWorkload:\nheavy for a writing class: turn in a poem each week, lots of packets to read each week, weekly courseworks posting in response to the reading, weekly letters between you and another student reacting to each other's work, comment on all other students' work orally and on copies of poems they pass out in class, final portolio with at least 75% of poems revised.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "November 17, 2003",
            "review_content": "\nI've taken Josh Green twice.  That in itself should say a lot.  The man knows how to work with student writers.  He definitely takes all styles of writing seriously; we had a range of voices in our class and I feel like he respected everyone's style and tried to help students acheive the effect that THEY were striving for, not the effect that he personally would prefer (which is something I think a lot of writing teachers end up doing).  What I respect most about Josh is that he does not feed anyone fluff about their writing.  He is critical yet fair and gives so many helpful comments written on the work itself, during the workshop, and especially during office hours.  Bad writing workshops can go one of two ways:  the teacher can be offensive by being too critical and disrespecting the students' voice and aims, or the teacher can be offensive by being so condescending (or even just too kind) and praising any kind of work that's turned in, giving no contructive criticism whatsoever.  Josh takes the middle path.  On top of that, he's a funny guy (weird in a cool way), and he's BRILLIANT (when did he get a chance to read all those poems, books, critical essays--and retain everything?).\nThere are some drawbacks, of course.  Occasionally workshops meandered a bit...tangents were really interesting but once in a while a bit much.  And he gives a lot of reading (like most writing profs, i believe) and requires occasional courseworks postings (unlike most writing profs, i believe), and though the work all seems worth it (it VERY MUCH IS), it's a bit overwhelming on at some moments throughout the semester.\nWorkload:\nsame as most structure and style classes (poetry--including narrative poem, prose poem, stuff like that--manifesto, scene for a play--a whole play for SS2 i believe--short story, microfiction/flash fiction).  something's due just about every week, except for the end of the semester when the assignments are longer (like the short story and play).  lots of critical essays and examples of contemporary writers to read, courseworks reflections on the readings sometime each week....sounds hardcore, and feels like it on occasion, but he's laidback and it's manageable in the end.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "November 14, 2003",
            "review_content": "\nJosh is a rarity in college level writing classes in that he really puts effort into trying to understand a student's own goals.  So, his comments on anything you write have you in mind, not what he thinks that you should be writing.  I agree that Josh is demanding and critical, but not in a bad way.  He makes even his criticisms sound as if they were poetic. At the same time, he is tactful in his suggestions.  And he'll never, never, impose anything on you.  If I had my way, I'd take more writing classes with him.  \nWorkload:\nweekly postings on readings, final portfolio of work.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 11, 2003",
            "review_content": "\nI liked Josh. His comments were on point and helpful, and he was more critical than any of the other professors I've had. There's something about him that's vaguely sketchy, but not in a threatening sort of way.  He was available to his students etc. \nHe's teaching a poetry section that's probably pretty good.  He was most helpful the few weeks we did poetry. He studied with Simic, and I think poetry is his primary area of interest.\nWorkload:\nthe same as the other classes. Turn something in every week.\n"
        }
    ]
}