{
    "prof_info": [
        {
            "prof_name": "Haim Waisman",
            "prof_id": 3499,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "E3161 Fluid Mechanics",
            "review_date": "January 15, 2012",
            "review_content": "\nIn this course professor Waisman focuses mainly on practical applications. His lectures follow the book almost exactly, derivations and all, but the homework problems he assigns are mainly practical. His tests are easy if you understand the homeworks, and he never has any surprises. Most of the time going to class won't help your grade, as long as you can do the homework he assigns, you're good. Many times he even says that we won't have to know the derivations he is doing on the board. He is very nice and approachable and does a pretty good job of communicating. This class could have been way more painful than it was. \nWorkload:\nHomework assignment due every 2 weeks or so. Midterm worth 15%, final worth 45%\n"
        },
        {
            "course_name": "Finite Element Analysis I",
            "review_date": "December 28, 2011",
            "review_content": "\nAs an undergraduate, you will likely feel unprepared for the material throughout the semester and may never really get the concepts the class teaches. Professor Waisman is very nice and caring, though he specifically teaches in a way so you have to figure out some of the gaps on your own. He does not seem to realize that many undergraduates lack the knowledge to be able to conceptualize the material presented in class because they are not able to connect it to other methods of thinking about a problem that they already know. The material presented is challenging, but not impossible to understand, but also not taught in a very engaging manner.\nWorkload:\nSubstantial. Homeworks given 5 times/semester, each time 2 weeks to complete. Some take one night, some MANY. 2 projects, one due right after Thanksgiving, the other during final exams. Make sure you know how to approach programming/modifying code in MATLAB.\n"
        },
        {
            "course_name": "Finite Element Analysis I",
            "review_date": "December 09, 2008",
            "review_content": "\nIf you're in this class, it's probably required for the major, but that doesn't mean its going to be terrible.  Finite is a hard subject with a bit of a learning curve, however Prof. Waisman does an excellent job of helping you learn it.  His lectures can be a bit over your head at first, but with the homeworks you really learn the material.  The homeworks and projects can take a bit of time, but they do reinforce the material and the tests are similar to the homeworks.\nIn addition, Waisman's office is always open.  The first time I went to him he took over an hour of his time to explain the material to me.  He clearly wants you to learn the material and tries his best to get around the fact the department hasn't adequately given you the pre-reqs for it.  By the end, you'll have picked up something about Finite elements.\nThe bottom line: can be rough going at first, but if you do the work you'll get it and make use of the professor's open door policy.  Given the material and our background he does a great job.\n\nWorkload:\n6 Hw's due 2 weeks after assigned (although two can be assigned a week apart) (20%)\n2 computer projects to drive in the material (10% and 30%)\nstraight forward midterm (10%)\nFinal (30%)\n\n"
        }
    ]
}