{
    "prof_info": [
        {
            "prof_name": "Tessa Chandler",
            "prof_id": 1614,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Ballet III",
            "review_date": "November 25, 2009",
            "review_content": "\nTessa is WONDERFUL. She is extremely helpful, attentive, kind, and perceptive, and she has helped me improve my technique a great deal. She is the anti-Sabrina, but she's improved my technique more than Sabrina's class ever did. Tessa is also great at tailoring her corrections to any dancer's level of experience-- she's just as good at teaching very advanced dancers as she is at teaching people who haven't been dancing very long. She has a fantastic amount of anatomy/pilates/Feldenkrais knowledge and really knows how to deploy this knowledge to help individual dancers with individual technique problems. She's great. Take her class; you'll be so glad you did. \nWorkload:\nLike any other ballet class. \n"
        },
        {
            "course_name": "Ballet II",
            "review_date": "January 08, 2009",
            "review_content": "\nTessa is a queen.  She has fabulous technique and is (more importantly) very good at communicating that technique to her students.  Excellent corrections - even when they're just directed at one student, they're almost always applicable to everyone.  Challenging combinations - you definitely have to think - but you learn a TON and grow a lot as a dancer.  I'm planning on taking her Ballet II again next semester - it's not a waste/a cop-out in any way.  Love her personality - very sunny, encouraging, always has good, helpful suggestions.  She's everything you want in a dance teacher.\nWorkload:\nPretty much what you'd expect.  Heavily attendance-based - you get two \"free\" absences; you can miss three after that if you chose, but you then have to make them up (attend another class or observe/write about a more advanced class).  One open-book (well, open-handout) quiz on vocabulary.  You're also required to observe and write about an upper-level class (just once).  No final/midterm.  Very low stress, all in all.\n"
        },
        {
            "course_name": "Ballet I",
            "review_date": "January 08, 2008",
            "review_content": "\nI had 0 dance experience coming into the class, but Tessa did an AMAZING job of introducing dance.  She is a really good teacher and she never singles out people to humiliate them.  When she does single out dancers, her comments are very constructive and very positive, and is for the entire class.  Take her if you can.\n"
        },
        {
            "course_name": "Ballet I",
            "review_date": "May 04, 2007",
            "review_content": "\nThis class was great.  Tessa is very friendly and helpful.  The course was very basic and we went at a fairly steady pace.  Definitely a good intro into ballet.  \nWorkload:\nNone\n"
        },
        {
            "course_name": "Ballet II",
            "review_date": "May 17, 2006",
            "review_content": "\nTessa is amazing. She is extremely technically skiller herself, and a beautiful dancer. She is very good at giving very accurate comments to help everyone in the class improve technique and precision based on one person's action. Comments are never about one dancert specifically, but used for the entire class. Be warned - the class is not ballet 1.5, it's more like 2.5. I am going into my third semester in the class, and I still find her adagio and across the floor challenging. But no matter what level you are at, you will benefit from this class. \nWorkload:\nAttendance (two misses allowed, make-ups with other ballet II classes), one 2-3 page dance review demonstrating a grasp of vocabulary and technique in viewing performance.\n"
        },
        {
            "course_name": "Ballet II",
            "review_date": "October 15, 2003",
            "review_content": "\nTessa is a great teacher and a very warm, friendly person.  She creates a comfortable, totally non-stressful learning environment.  Besides a basic emphasis on technique, Tessa really stresses movement and dancing in her class.  \nWorkload:\nAn hour and a half, twice a week for class.\n"
        },
        {
            "course_name": "Ballet II",
            "review_date": "June 17, 2003",
            "review_content": "\nTessa is awesome!!!! She's inspirational. Unlike other ballet teachers I have had who focus solely on the technique, Tessa reminds her students to enjoy the movement. She also helps develop each student's technique and help them achieve their personal best.\nWorkload:\nnone. \n"
        },
        {
            "course_name": "Ballet II",
            "review_date": "May 12, 2003",
            "review_content": "\nTessa is amazing!  She is very enthusiastic and it's obvious how much she enjoys what she's doing.  Just be prepared for a LOT of center work and turns.  Definitely worth it if you want to improve your technique and your turnout.\nWorkload:\nIt's ballet.  Show up and dance.\n"
        }
    ]
}