{
    "prof_info": [
        {
            "prof_name": "Dominique Toran-Allerand",
            "prof_id": 9384,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Independent research",
            "review_date": "May 28, 2009",
            "review_content": "\nMentor for W3500 @ Columbia:\nI was introduced to Dr. Toran-Allerand's lab via internet and the W3500 site, but surely that was the first of my mistakes. Dr. Dominique Toran-Allerand is by far the worst professor I have ever been in contact with at Columbia University and it is a disgrace that she is allowed to continue let alone be publicized to helpless, unassuming students. I truly wanted to have a research experience but instead I learned a lot about life and a lot about reality in the research field- sometimes its not about the research. its about the PI. I have never met a woman so insensitive and blatantly rude to her students. Her favorite work is \"categorically wrong\" which she will throw at you while you try and reason with her. We worked on a project with mice and she basically blamed the students for incorrect results thought it was largely the post-doc's fault for choosing the wrong type of mice. It should be mentioned that she is hopelessly rude and inept and grades based on results, not performance. Trust me, it should tell you something that 1) she has no kids 2) she swears and shouts when she is speaking to people 3) she once screamed at her lab for throwing her a birthday party and 4) she only has one person who works for her- a harrowed post-doc who can't leave because he needs to pay for his kids and his wife. Do not chose her as a mentor and stay far far away from her. She will try and reel you in with promises of being devoted to students and having experience with teaching but this is a farce- she basically has no money from non-existent grants and she needs students to do all her \"dirty work\" i.e. behavioral tests on mice. Did I mention she is a hypocrite if I ever saw one?\nBudding Ph.D's be warned. You will learn nothing but misery from her. \nWorkload:\nRidiculous. I was there all the time and she didn't even notice or care. Truly, why would you work for someone like this? \n"
        }
    ]
}