{
    "prof_info": [
        {
            "prof_name": "Richard Bulliet",
            "prof_id": 348,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "June 16, 2009",
            "review_content": "\nProceed, but with some caution.\nAs a freshman and found it possible to get a good grade without suffering, but not without three important things: 1) go to class, I can't repeat it enough, or at LEAST borrow notes, because you're more likely to know the info that will show up on a test; 2) DO attend the discussion sections, because those boost your grade 10% even if your TA sucks, 3) worker smarter rather than harder when it comes to readings--Bulliet subtracted most of the books on the syllabus (except his own and Khalidi's, big surprise*.*) and added books right before the midterm as well as the final. Therefore, don't waste your time buying books early, count on him to switch, make changes, and if you can, buy books from Barnes and Noble's general section (not the textbook section) so that you can read up and return it, having not wasted money you don't have. Although reading is heavy, pay attention to what he talks about in class and the terms that TAs give you before the exams, and the material is there.\nNo homework of course except for readings as well as discussion readings and discussion attendance. You only have a midterm and a final, but both--especially the latter--are very rigorous, involving several essays (some of which may be based on the reading) and IDs (identifying a group of terms, like \"intifada\" and \"PLO\", and explaining how it relates to other terms). Those of you who have taken AP US or English, but especially AP World, will be grateful they have taken these classes, because you will have been used to the demands of writing an essay on the spot. However, if you aren't a good writer it doesn't matter--it's logic that counts.\nThe class is large (150 people I think), and you will find that the first 10-15 minutes and especially the last 20 minutes are, what Bulliet himself called, \"bullsh-t,\" but make sure you get what's between. Professor always went on sudden loooong tangeants (once about comic books, and another on camels...expect this one). It is better to type than write, unless you prefer otherwise. Bulliet has a really good humor, although I found some of his jokes stupid, but he knows what he's talking about (he's on wikipedia), he's well traveled and you can approach him with questions after class if something catchs your interest. Overall, not a bad professor.\n There are different TAs, so I don't know them all, but it's just important to show him/her that you're coming to discussion sections and participating. Don't read everything they assign in duscissions. BS, say anything.\nA good class for MELAC majors who know this info or those interested in MELAC.\nWorkload:\nWork smarter, not harder.\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 17, 2009",
            "review_content": "\nprobably the best professor at columbia. he admitted, more than once, that he taught us how to bullshit. His lectures are really interesting, although some had a hard time appreciating them. This is a great global core class to take.\nWorkload:\nmidterm (25%), final (40%), 2500 word paper (25%), 10% participation in discussion section.\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 14, 2009",
            "review_content": "\nBulliet is a bullshitter. He admits that right off. And when you're trying to take notes in his class, you'll struggle to find what is actually important versus the stuff that really does not matter at all. If you're like me, you'll come in ready to write down everything that he says; after you try that for a few classes, you'll get progressively more frustrated when he says after a particularly long-winded digression, \"Not that any of that matters. Or is even true.\" Slowly, you'll fade off into a world of your own.\nAs for the material, it's pretty dry for the first half of the semester (when you're working through the history of the Ottoman Empire from the 1600s until the First World War. The second half, when it starts to get interesting, almost everyone was so discouraged by his lack of direction / organization that they had tuned out or stopped coming to class. But if you do take the class, know that the second half is worth it. \nThe misleading thing about this course, for me at least, was that I was under the impression that it would be a \"History of the Modern Middle East.\" What it actually turns out to be is Bulliet poking holes in the very conception that such a course could exist. I would say that if you've already got a pretty good idea of the history of the region and of its people, then take this class to have it all disassembled Bulliet-style. If you're looking for a straightforward history class, this isn't it. I don't know where it is. \nWorkload:\nA lot of reading (including 5-7 books that were not initially on the syllabus that we were supposed to go and buy or print off of courseworks) that isn't totally necessary (some is, though); required section that was soooo useless; midterm, final, final paper.\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 04, 2009",
            "review_content": "\nOh, Richard Bulliet...he's quite the character to say the least. Some people seem to passionately despise him as a teacher, but I fear they are rushing to conclusions and not giving him the chance he deserves. I found myself drifting off to sleep if I wasn't in the right mood for his lectures, since they are delivered with a droning voice peppered with dry sarcasm. However, if you actually listen to what he's saying word for word and take meticulous notes, you will be amazed. The first two months of the course, I blindly took notes, barely registering what he said and basically writing everything, and it seemed like a random string of random insights. But, typing up the notes to study for the midterm, somehow everything came together and just made sense. I saw the brilliance in his ways and was amazed at how much I actually knew. He doesn't teach history as you would expect, chronologically, with an annoying importance given to dates and places and people and details. Instead, he focuses on one theme every class and just talks about it, by heart. It's amazing that he can do that. He knows a lot, clearly, and I think it's an honor to be in his presence. He will go off on tangents, about two-humped versus one-humped camels, about two-wheeled versus four-wheeled vehicles, etc., but it's all part of the experience (plus, he has some strange expertise). Go in with an open mind, and enjoy it! Plus, if you just want to listen to the lectures and take notes later...or not go to class at all, the lectures are all available online.\nWorkload:\nlots and lots of reading, but, depending on who your TA is, you may not have to do most or any of it (as long as you take meticulous notes), midterm, discussion section postings, final, research paper due on day of final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 22, 2008",
            "review_content": "\nAt first I was considering switching to another lit hum professor, because he would spend most of the time talking about the history of the cultures we read about than the actual content of the book. But I stayed because I was actaully learning. Bulliet was my favorite professor this semester and I will try to squeeze in a Middle EaStern class to have him again. He is funny, engaging, and understands that not everyone has the time to read all of the books on time. He really does not try to embarrass anyone. This class was a gpa booster!\nWorkload:\nFairly light. 2 papers, and easy mid-term, and a final. \n"
        },
        {
            "course_name": "Islamo-Christian Civilization",
            "review_date": "May 19, 2007",
            "review_content": "\nThis is a class with such great potential. The explanation in the course bulletin sounds incredibly interesting for anybody interested in the relationship between--primarily--the West and the Islamic world. While Professor Bulliet is extremely knowledgeable about the subject at hand, the course is difficult to digest because it is based on his personal theory--an element of the course which creates some difficulty.\nBecause there is no \"source\" text for the class material, it is sometimes quite difficult to piece together all of the information given in lectures into some coherent statement. While primary texts were given in required discussion sections (surprise! it's required!), sometimes the TA seemed as clueless as we were about how all of it fits into Bulliet's unexplained grand scheme. This is a class where only the last lecture sums every thing up, and in the meantime you have to conduct personal thought exercises to somehow condense and reconstruct all of the snippits from class. In a way, the class reminded me of writing one of those cracked-out essays for University Writing: you know that you have to come up with some clear product, but nobody can really give you any guidance of how to do so. \nLooking back on the class, I feel that I learned a lot--but only through doing extensive background research on my own to try and place what the heck we were \"learning.\" This is NOT your typical history class at all, so be aware if you're used to reading the textbook and regurgitating answers. Be prepared to be frustrated, confused, and downright helpless at times. You must go to every class, or at least know the value of Wikipedia.\nWorkload:\nMidterm (apparently everybody did horrible on it), paper (cool topics, but difficult to get started on), final (much easier--must have caught the drift that nobody knew what the heck was going on.)\n"
        },
        {
            "course_name": "Islamo-Christian Civilization",
            "review_date": "April 26, 2007",
            "review_content": "\nProfessor Bulliet is the most enlightening instructor a student can have at Columbia. The man has a genuine passion in his subject matter, and though his lectures are not organized in advance, he is knowledgeable in every aspect of the course. The man's humor is of such great wit and hilarity that most students have gaps in their notes due to the laughter. Nonetheless, Bulliet accomplishes his man goal: the students learn. No one can deny this fact. After the end of the semester, you realize that all the lectures tie in and that spending an hr and fifteen every other day was worth it.\nWorkload:\nMidterm consisting of 3 essays. One paper, and another essay final. Reading-wise, two readings for discussion section, and four general books to read and glance over. \n"
        },
        {
            "course_name": "Late Ottoman State and Society",
            "review_date": "June 11, 2005",
            "review_content": "\nBulliet is a passable lecturer , more inspiring in his depth and range of knowledge than his ability to convey to students the excitement of the subject matter. Very untheoretical as a historian, which can be refreshing i suppose, but inadequate in the end. He has a phenomenal memory and remembered an essay i wrote for a question on the final when i went to meet him at the end of the term, despite the fact that i never went to office hours. cool and unpretentious\nWorkload:\nvery light reading, two exams, one 10 page paper. \n"
        },
        {
            "course_name": "America and the Muslim World",
            "review_date": "December 28, 2004",
            "review_content": "\nBulliet is undeniably the greatest history professor I've had at Columbia. More importantly, he's the most creative historian I've come across. If, like me, you've ever felt that historians suffer from a sort of intellectual myopia, Bulliet will singlehandedly restore your faith in the discipline. The man is brilliant.\nAs a bonus, he's also hilarious and genuinely friendly. \n"
        },
        {
            "course_name": "History of Islamic Societies",
            "review_date": "December 27, 2004",
            "review_content": "\nIt took me a few weeks to get used to Prof. Bulliet's teaching style (he tends not to approach history from a chronological standpoint and sometimes it was hard to fit everything he taught us together into a coherent narrative), but once I did I found class really interesting. He is VERY knowledgable and I learned  a lot. \nPlus, he's funny. \nWorkload:\nNot bad. Out of the 5 or 6 books assigned for this class, I read 1 and got along fine. The important thing is just to go to the lectures and take good notes, because the tests were entirely based on what was covered by Bulliet. The midterm and final were challenging but fairly graded and the final paper (10 pages)  was straighforward. \n"
        },
        {
            "course_name": "History of Islamic Societies",
            "review_date": "December 23, 2004",
            "review_content": "\nBulliet is no doubt an intelligent man, and also funny (though his jokes are often dry and spread out).  Over time you definitely warm up to the man, however, and come the end of the semester I began to realize I will miss him next semester.  The workload is very manageable, as I didn't even fully read a book for the class an managed to sqeak by with a B+.  Depending on the day, Bulliet will present either a very captivating lesson or a very dry one.  Make sure you take notes, as all you have to do for the exam is spit the notes back verbatim to do well (and it doesn't hurt to quote Bulliet from his books, or any books for that matter).  All in all, I learned a lot and was satisfied with the course and the grade.\nWorkload:\nOne Paper (based on two books), One Midterm, One Final.\nWeekly discussion section readings (make sure you talk in discussions).\n"
        },
        {
            "course_name": "Technology and History Seminar",
            "review_date": "November 21, 2004",
            "review_content": "\nProfessor Bulliet is humorous, entertaining, and full of historical and facts that probably make him one of the foremost scholars of \"just about everything\" at Columbia.  People showed up regularly because he has got a great personality and repotoire of personal stories that liven up class. However, that being said, this seminar felt like it was all over the place.   I learned a lot about things that I never honestly thought I would ever learn about in a historical context (like the Oxford English Dictionary, Cars in the United States, and Salt), which was cool--but I think that the class would have been better had students been given more focused tasks to do, had discussion remained on topic, and had we had a better idea of what he was looking for on the final paper  (i.e. actual expectations).  That being said, grading seemed to be very generous, so overall, the class was worth taking--it also satisfies all 4 group area requirements for history majors since you study the entire world.\nWorkload:\nOne book report (2-3 pages) on a particular field of historical technology (food, warfare, etc.), a bunch of books which you really don't need to read to be part of the discussion (although they are certainly helpful and interesting), and a 20 page paper on one particular invention and how it shaped the course of history.\n"
        },
        {
            "course_name": "History of Islamic Societies",
            "review_date": "November 16, 2004",
            "review_content": "\nProfessor Bulliet knows his stuff - he makes you read 3 or 4 of his books. Reading is a must, as the lectures make no sense without it. Knowledge of Arabic is helpful, as some classes there will be dozens of Arabic names and terms - terms that will be on the test. He goes off on a lot of tangents, but he likes it if you pretned you are interested in the tangent of use it in a midterm of final. There is a mandatory TA session offered with a very limited schedule. Also, there are often a lot og grad students in the class.\nWorkload:\nMidterm, Paper, Weekly Posting, Final\n"
        },
        {
            "course_name": "Domestic Animals and Human History",
            "review_date": "June 21, 2004",
            "review_content": "\nThis is a good class to flush out your schedule - its humourous, has virually no reading, the professor has some neat ideas, and the point of the assignments is to bullshit them.  Bulliet himself says on the first day the class is pretty much just BS - and he sure comes through on that promise.  The entire course has NO organization, and oftentimes Bulliet's rambings seem to be completely fabricated.  He has a lot of beef with Jared Diamond (Guns Germs and Steel) which I believe stems from the fact that when Diamond discusses the history of the wheel he doesn't cite old Dick despite the fact that he wrote the book on the wheel (and the camel, for that matter).  Though you might feel like the class is a crock due to its wandering, inventive nature, Bulliet's style of looking at history is truly inspiring.  He draws on a multitude of sources you won't find in more standard history courses - archeological theory, animal porn websites, classic literature, and modern day pop culture.  He is a living testamony to past history culture.\nWorkload:\nPiece of pie.  A five page paper and a twelve page paper that are both encouraged to be inventive, and a midterm and a final that seem rather fair.  Grading too, seems lenient if you're willing to serious consider and discuss these issues.\n"
        },
        {
            "course_name": "Domestic Animals and Human History",
            "review_date": "May 08, 2004",
            "review_content": "\nI've taken Bulliet for America and the Muslim World, History of Iran to the Safavid Period, and now Domestic Animals, and I like him more each time around.  Sure, his lectures are disorganized, he goes off on tangents, and who knows when any assignments are due, but you have to ask yourself why you're taking his class.  The material for Domestic Animals is incredibly enlightening - there's no other course out there like this one, trust me - and interesting, and he has an interesting rubric for pulling it all together.  He is an incredibly dynamic, captivating lecturer, and I've never been more pumped to go to any class than I have to this one.  Overall, take this class (if he offers it again), so long as you don't freak out when you find out how disorganized it is.\nWorkload:\nAverage reading load, Midterm, Final, 4-page book/movie review, 10-12 page paper\n"
        },
        {
            "course_name": "America and the Muslim World",
            "review_date": "March 13, 2004",
            "review_content": "\nProfessor Bulliet taught in a 400-person lecture room, and his ego was still too big for the room. He did not prepare a general plan for the semester, let alone a syllabus, and would often come to class not having even thought about what he was going to lecture on that day. While these lectures sometimes contained semi-relevant anecdotes, they often were as obscure as tales of his great aunt Magda from the midwest, or the use of his writings in the animal porn industry (no joke). To me, his lack of preparedness showed a great lack of respect for the students and made my academic life in the class rather frustrating. Since CU has no graduate students in Middle Eastern history, the TAs often know just a tad more than the students, which is rather frustrating during pre-exam review sessions. Despite the class title, most of the class covered basic early Islamic history, and he tried to cram all of Americas relation to the Muslim world into the last few weeks of class. The only thing I can say to his credit is that he did not hit you over the head repeatedly with his own political views about the Middle East, which is a pitfall many lecturers in this topic tend to fall into. Overall, its just not worth your time: there are better classes on the modern Middle East from far better professors in this University. \nWorkload:\na time pressured midterm and final, and one 10-pg paper. occasional postings on courseworks\n"
        },
        {
            "course_name": "America and the Muslim World",
            "review_date": "March 13, 2004",
            "review_content": "\nProfessor Bulliet taught in a 400-person lecture room, and his ego was still too big for the room. He did not prepare a general plan for the semester, let alone a syllabus, and would often come to class not having even thought about what he was going to lecture on that day. While these lectures sometimes contained semi-relevant anecdotes, they often were as obscure as tales of his great aunt Magda from the midwest, or the use of his writings in the animal porn industry (no joke). To me, his lack of preparedness showed a great lack of respect for the students and made my academic life in the class rather frustrating. Since CU has no graduate students in Middle Eastern history, the TAs often know just a tad more than the students, which is rather frustrating during pre-exam review sessions. Despite the class title, most of the class covered basic early Islamic history, and he tried to cram all of Americas relation to the Muslim world into the last few weeks of class. The only thing I can say to his credit is that he did not hit you over the head repeatedly with his own political views about the Middle East, which is a pitfall many lecturers in this topic tend to fall into. Overall, its just not worth your time: there are better classes on the modern Middle East from far better professors in this University. \nWorkload:\na time pressured midterm and final, and one 10-pg paper. occasional postings on courseworks\n"
        },
        {
            "course_name": "America and the Muslim World",
            "review_date": "December 07, 2003",
            "review_content": "\nWhat an awful class. Bulliet is a  Medeival Islam specialist who has capitalized on September 11th by drawing people like me who don;t know better into his class. We didnt actually cover the 1700's, let alone America until after the midterm. Even after then, he pretty much rambled off the top of his head, taking every chance he could to list the events he was envited to. Yeah, Bulliet has a decent sense of humor, but a cheap Bush joke every three classes isn't going to cut it.\nWorkload:\nReading that he doesn't post until 3 weeks after he covers the material, a midterm, a final, and an 8 page paper. Bulliet thinks it's cute that he doesn't know what's going on in the class., but believe me, it's not.\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "November 17, 2003",
            "review_content": "\nPass on Bulliet unless you want a class solely to be entertained.  He doesn't strike me as a serious teacher.  About half of his comments were relevant, and only a half of those seemed insightful.  Tended to give longwinded answers to simple questions.  Got the impression he didn't pay too much attention to the papers people handed in.\nSmart guy, not a great teacher if you want to actually want to intensively learn something, but pretty fun (and fairly easy) to take.\n"
        },
        {
            "course_name": "America and the Muslim World",
            "review_date": "April 26, 2003",
            "review_content": "\nIf you're interested in the subject matter, but are willing to put up with a little disorganization, then this is a great class to take. maybe becuase it was the first time the class was offered, Bulliet wasn't really able to keep to the syllabus..but his lectures were AMAZING, incredibly interesting/insightful, and always seemed to end on a fascinating point.\nWorkload:\na lot of reading but you definitely dont' have to do it all, especially since the e-seminars of his are basically a review of what is said in class. They are useful for studying tho. Midterm, paper, final. Mid-term/Final graded very easily, TAs hand out a list of terms/possible essay topics before hand, making it even easier. Dont' stress over not knowing everything on the sheet too, you can usually bs a lot on the exams. Grading of the papers, at least by my TA, was harsh..but didnt' effect the final grade too much (i think it only counted about 10%)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 17, 2003",
            "review_content": "\nProbably the best professor I could have had for this class.  I have no interest in music, have never studied music, do not play a musical instrument, and could die fairly satisfied if none of those things changed.  Prof. Bulliet definitely peaked my interest in music, and because of his non-threatening method of teaching, made the class quite enjoyable.  I actually listen to classical music now in my spare time, though I still have no idea what I'm listening to...\nHe's very honest with how little he knows about forms, themes, and the specifics of how music is constructed, and made no attempt to force that knowledge on us...\nI think he's probably a great professor in his own field, but was wasted on this class.  It's obviously not his passion.  Despite that, he was able to fill up a 2 hour class quite easily with stories and random information that was never tested.  One can only imagine what he would be like if he was teaching a class in his field...\nI would recommend him as a professor in other fields (i don't think he's teaching music again) because he's obviously incredibly intelligent, and if you take the time, very interesting.\nWorkload:\nWeekly reading, some very short assignments (the first only had to be three sentences long), two papers and a mid-term and final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 07, 2003",
            "review_content": "\nRichard Bulliet does you a huge favor by claiming not to know anymore about the subject than you do. This makes the annoying Music Humanities requirement a complete cakewalk. Class consists of listening to pieces that you really dont ever have to know, and discussion meanders with no particular aim. He's really lax about deadlines, which won't really matter since you don't really have to do any work outside of class, save the few papers. Read the stupid textbook to get all the info you might ever need for tests, especially since attendance is seemingly optional.\nWorkload:\nTwo simple papers (5-8pp), a midterm, and a final.\n"
        },
        {
            "course_name": "America and the Muslim World",
            "review_date": "December 03, 2002",
            "review_content": "\nCome for the suddenly relevant subject matter, stay for the stories about playing basketball with the peace corps in Iran. Bulliet's class is very interesting if taken on its own terms. Bulliet is an engaging lecturer, with tons of funny stories, few of which relate to the course material. Despite the title, the entire first half of the course is on Europe and the Muslim world, which makes sense since Bulliet is a medievalist. Generally, if you don't mind lack of focus, this is an interesting course, and the grading is easy. But if you want to understand America's complex relations with the Muslim world, look elsewhere. \nWorkload:\n2 midterms and a final. Easy grading. Lots of reading, but no need to do most of it.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 15, 2001",
            "review_content": "\nGranted, he knew far less than I did about the books (and I didn't read a single one), but he's nice enough, and tells entertaining stories about donkey penises and camel domestication. Rediculously easy grader too- he gave me an A, in all likelihood because I consistently showed up in his class (which most people didn't do).\nWorkload:\n3 Easy papers, midterm and final.\n"
        },
        {
            "course_name": "Main Currents of Middle Eastern History",
            "review_date": "August 14, 2001",
            "review_content": "\nBulliet is a really cool guy. His lectures were always composed of - and often entirely of - anecdotes of his years in Iran. The first day of class he lectured on ancient irrigation systems, which doesn't sound so exciting but turned out ot be really interesting. A couple weeks later we had an actual geography quiz. Admittedly, it was basically just memorizing an atlas but it's about time someone paid attention to geography.\nWorkload:\nPretty light- expect to read his books, such as one on the domistication of the camel. Midterm, paper, final. Generous grading.\n"
        },
        {
            "course_name": "Main Currents of Middle Eastern History",
            "review_date": "August 14, 2001",
            "review_content": "\nBulliet is a really cool guy. His lectures were always composed of - and often entirely of - anecdotes of his years in Iran. The first day of class he lectured on ancient irrigation systems, which doesn't sound so exciting but turned out ot be really interesting. A couple weeks later we had an actual geography quiz. Admittedly, it was basically just memorizing an atlas but it's about time someone paid attention to geography.\nWorkload:\nPretty light- expect to read his books, such as one on the domistication of the camel. Midterm, paper, final. Generous grading.\n"
        },
        {
            "course_name": "History of Iran To the Safavid Period",
            "review_date": "December 31, 1999",
            "review_content": "\nBulliet is many things, and one of them is a fantastic lecturer. After stumbling onto this class and planning during registration to drop it, I sat mesmerized the first day as Bulliet described the tricks and hacks of casual archaeology. After that, I found myself fascinated by some insight or story each class -- it was the only class I always went to. That (and a short but fairly sweet reading list) is the good news. The bad news is that while I got depth and, at times, breadth from Bulliet's dense and excellent lectures, I felt I wasn't getting a good overall grasp of the material. Normally, that's fine (Eric Foner's Radical Tradition class is like that; his Civil War and Reconstruction class is not). But a midterm, a paper and a final later, I'm not so sure if it's fair to apply such an average (read: heavy) load of synthesis work to what is basically an introductory class. Still, if Bulliet is teaching on a topic that interests you, by all means take him.\nWorkload:\nWeekly discussion questions, 6 books to read, 10-page term paper, Midterm, Final.\n"
        }
    ]
}