{
    "prof_info": [
        {
            "prof_name": "Charles Freilich",
            "prof_id": 5874,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Nat Security Strat of Mid East",
            "review_date": "May 16, 2015",
            "review_content": "\nI'm writing a review on this course as of 2015 in order to counter-balance the overwhelmingly negative comment found below.\n(1) The syllabus has been updated. I found most of the readings interesting and informative. The required weekly reading is no heavier than Betts' WPS (in fact, it's probably considerably lighter).\n(2) Be prepared for the fact that some lectures will be better than others. The Egypt and Turkey discussions did feel \"pundit-y\" and repetitive as the previous review said. In these weeks, you will learn a lot more from the readings than you do in class. On the other hand, the lectures on Israel, Palestine, and the peace process were awesome. \n(3) Freilich isn't condescending or harsh. And I actually found him to be very willing to engage with the class. But he will call you out if you say something that is irrelevant or factually wrong (ie Yemen has a relatively high GDP). If you can't deal with a class where you will sometimes be wrong, then don't take this course.\n(4) The exams are really not that hard. Although I do say this as someone who did nearly all of the reading. But again, is that really that unreasonable of a requirement for a graduate level politics course? I think not.\nBottom line: This isn't the best course that I've taken at Columbia. But it is also far from the worst.\nWorkload:\nReadings, policy paper, midterm, final.\n"
        },
        {
            "course_name": "Nat Security Strat of Mid East",
            "review_date": "May 08, 2012",
            "review_content": "\nThis class was an incredible waste of time, and the professor was the worst I've ever had at Columbia.\nFirst of all, he started the course by admitting that the syllabus was SEVERAL YEARS out of date. That's probably when I should've taken a hint and left. He always reminds the class that the emphasis of the course is on current events and the near future, it is NOT about the past. Despite this, at least 75% of the readings are about the DISTANT past. It simply amazes me that as a class which supposedly deals with current events, we barely even mentioned the Arab Spring in class and it wasn't in any of the readings. For a lot of the countries, we didn't even talk about how they changed post 9/11.\nThe class is broken down into studies of individual countries in the region and their past allies and rivals, resources, geographical features, domestic political system, etc. However, it is almost entirely historical. We did an entire unit on Egypt without mentioning the revolution. Half of the reading we did on Egypt was written before 9/11!!!\nInstead of an take-home essay or paper like you would expect for this course level, there is an in-class exam which includes obscure multiple-choice questions from random readings that are designed to trip you up. You really have to read EVERYTHING if you want an A on the exams. And there is a lot of reading.\nDespite all the reading, lectures are incredibly boring. Professor Freilich almost never engaged with students, except to shoot them down when anyone's hand popped up. His condescension was overwhelming.\nProf. Freilich seemed to be familiar with the subject, but the way he talked in class was just rambling and pontificating. He was making the kind of assertions that you can get from 24-hours news pundits for free. I could have learned about as much from watching non-stop Fareed Zakaria for a week as I did in this class, maybe more.\nThe Prof. had literally no idea what was going on in the class concerning tests, papers, deadlines, etc. The TAs made all of the tests. The problem was, the TAs didn't pay attention in class. They were in the back on Facebook so come exam time they just pulled obscure things from the readings, leading to a huge disconnect between what we were \"taught\" and what we were expected to now.\nWhen asked for tips on the paper, one of the TAs said \"Well this is a current events-oriented class, so make it more about current events. It's not a history class, so don't be too historical. Make it more focused towards now.\"\nThis was probably the most useless, frustrating class I have ever taken in 3 years at Columbia.\nWorkload:\nVery Detailed Policy Paper (8 pages), Lot of Reading (ranged from 200-300 some weeks), In-Class Midterm and Final.\n"
        }
    ]
}