{
    "prof_info": [
        {
            "prof_name": "Maria Camila Segura",
            "prof_id": 1782,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Spanish 1201",
            "review_date": "April 10, 2005",
            "review_content": "\nCamila, I feel, is smart, and one of the better spanish teachers I've had at Columbia. She can be a little spacey at times, but she makes excellent use of the class time and frequently brings in outside sources of exercises to do, as the book is horrible. She is willing to discuss problems and does a good job \n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "January 02, 2005",
            "review_content": "\nIf you have a strong background in Spanish or are good at independent studying (you can't rely on her to make concepts clear), then this class will be very easy.  If not, then Camila's class could be hard.  \nOne time in class, people said that they didn't understand a confusing concept,  and they asked if she could clarify it.  She just said, \"yes, it is very confusing\" and moved on.  Her class could be confusing; she frequently contradicted herself and the book.  Sometimes, she took off points on tests for things we weren't being tested on and hadn't learned yet.  \nDespite all this, I found the class easy with barely any effort necessary to pass.  If you do need help, I think she has office hours available to talk and review concepts.  \nOverall: going to class is pointless but mandatory to pass.  and expect lots of independent studying if you want to understand anything.  tests are relatively easy and mostly grammar driven.\nWorkload:\nabout 30 minutes of workbook work each nighta few 1-2 page essays throughout the semestereasy, grammar driven tests for each chapterand an easy midterm and final\n"
        },
        {
            "course_name": "Spanish 2",
            "review_date": "May 12, 2004",
            "review_content": "\nEh.  Camila is a really nice person.  But as a teacher...she's just ok.  It'd be fine if she even simply regurgitated the book, but most of her information contradicts what is in the textbook.  And the second part of Conexiones is HORRIFIC.  Never has their been such an unclear textbook that fails to answer even the most obvious of questions.  So a bad book with a teacher who doesn't go by the book equals low grades.  Going to class was tedious because I knew that I wasn't going to be learning anything that I wouldn't learn if I sat down and did a few exercises at home.  She could be a lot worse, but you could do a lot better in choosing a Spanish teacher.\nWorkload:\nVery unbalanced.  Sometimes, lots of homework.  Sometimes, none.  Quizzes either bizarrely easy or frustratingly difficult.  Midterm and final are departmental.\n"
        },
        {
            "course_name": "Spanish 2",
            "review_date": "January 20, 2004",
            "review_content": "\nDecent teacher and a really nice person. Camila is energetic and friendly and makes getting through the language requirement a little easier.  If you're looking for a professor that isn't very demanding and is a lot nicer than most go with Camila. \nWorkload:\nStandard: Quizzes, Compositions, Midterm, Final, and Oral\n"
        },
        {
            "course_name": "intermediate spanish",
            "review_date": "November 16, 2003",
            "review_content": "\nYou won't learn anything from this professor that you can't learn simply from reading the book. She's nice, a decent person, easy to talk to but doesn't really know how to teach. She basically just lets you read the descriptions in the book and then you just do the exercises. \nWorkload:\nhomework every day, a few papers midterm, final\n"
        }
    ]
}