{
    "prof_info": [
        {
            "prof_name": "Stephanie Zhang",
            "prof_id": 12197,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 23, 2012",
            "review_content": "\nStephanie is a somewhat typical Columbia lower division math/statistics instructor. Think messy handwriting, soft-spoken, helpful-ish but not passionate about teaching. Competent enough, but not a model teacher by any means. She's good about posting homework solutions, midterm and final practice tests, and generally keeping the class updated on important news via email. She teaches using a combination of powerpoints and the chalkboard, on which she works out example problems. Stephanie's an ok communicator, and the fact that she's a native English speaker is a plus. Still, Stephanie's not great enough of a teacher to really make it worth going to class. The textbook + Khan Academy tended to be more useful than her lectures. Reflecting this, class attendance was really low, probably around a quarter or a fifth of the class on an average day. The 10:10 AM class time definitely didn't help at all.  \nThere were two major problems I had with the course.\nFirst, Stephanie has a penchant for giving out a few abstract, or at least strangely-applied questions. This isn't a big problem for the homework, since most of the homework is usually out of the book, which is pretty straightforward. It does, however, become a problem on the exams. Some of these strange questions appeared on the midterm, and they probably comprised a majority of the final. I don't understand why she bothers assigning these questions in the quantities that she does. Hardly anyone receives full credit. Considering that the total grade ends up getting curved anyway, it'd make more sense for the class to use more appropriate questions and end up with a higher average than to use inappropriate questions and end up with a really low average. My theory is that Stephanie gets bored assigning and grading problems that, for her, are so elementary that she could do solve them asleep and writing with her toes holding a pencil. She consequently makes the class harder in an effort to make things more interesting. Too bad not all of us are as smart as her.\nSecond, the course suffered from a misallocation of time. I don't think anyone really bothered to tell Stephanie why a lot of people take 1211. Almost everyone I met in the class was an econ major taking it to fulfill the econ core requirement. In particular, 1211 is supposed to prepare us for econometrics. With that in mind, I think it's a bit ridiculous that we didn't even learn regressions, which are a major part of econometrics. We instead spent way too much time on chapters 1-4, which are comparatively easy, and went through the more difficult chapters 5-8 too quickly. These issues were compounded by Hurricane Sandy, so maybe I'm being too harsh on Stephanie. But still.\n\nWorkload:\nProblem sets (30%): Long and very time-consuming. This sort of makes sense, considering they're worth 30%.  \nMidterm (20%): Moderate difficulty. You get one cheat sheet double-sided. Average and median both mid-70% range.  \nFinal: (40%): Hard as balls. You get two cheat sheets double-sided, but there's nothing that could've put on it that would've saved you from examinatorial damnation. A ton of people leaving the room at the end agreed it was the hardest test they'd ever taken. To give you an idea, Stephanie made the final out of 120 points. At the beginning of the test, she announced that 20 of those points were extra credit. At the end of the test, she said she'd remove a 20-point question that was particularly confusing. That means the test was so hard that a raw score of 80/120 would give you 100% (uncurved). Ridiculous. \nQuizzes: (5% each): Both pretty simple and straightforward. Average on quiz 1 was in the low 20s/30. Average on quiz 2 was around 16/20. \n"
        }
    ]
}