{
    "prof_info": [
        {
            "prof_name": "Sailaja Sastry",
            "prof_id": 553,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English",
            "review_date": "December 31, 2014",
            "review_content": "\nNot a big fan. I was a relatively good student in the class and tried to speak and voice my opinion as much as possible (she clearly stated the more we speak in class the better our grade will be the). The class is in fact in a harkens discussion group atmosphere. However when we do speak she cuts us off or belittles what we have to say...it's actually quite upsetting . On another note i actively participated and consistently got A's on all papers..yet my grade was not a reflection of the grades i had received back... Don't take this class..it's upsetting how she doesn't fairly grades and she definitely picks favorites \nWorkload:\n20-40 pages of pretty light reading, discussed in class the next day. Essays are pretty basic first draft not grades, second one is. no exams!\n"
        },
        {
            "course_name": "First-Year Seminar: Legacy of the Mediterranean II",
            "review_date": "November 17, 2013",
            "review_content": "\nI also disagree with the negative reviews. I really enjoyed Professor Sastry's class. She achieves a good balance of facilitating class discussion and making sure the class has the required background information. Unlike First Year English, this class is NOT writing intensive. There is a lot of emphasis on leading class discussion and developing ideas verbally. We talk a lot about the canon. The final paper was to rewrite the syllabus, which I found kind of fun. Definitely a low key seminar and good for students who want more literature. I liked the readings. \nWorkload:\n4 response papers (1-2 pages), prepare questions (5 minutes) once, teach class once in a group \n"
        },
        {
            "course_name": "First-Year Seminar: Legacy of the Mediterranean II",
            "review_date": "June 08, 2013",
            "review_content": "\nI disagree with a lot of what has been said about Sastry. I really enjoyed her class and her as a professor. She had a good balance of facilitating and letting the class go where we wanted the discussion to go. She gave clear instructions for writing assignments and was approachable out of class. Her class has made me want to major in English! \nThe class was a relaxed atmosphere and a pretty quintessential first year college discussion class. \nWorkload:\nextremely easy. reading is manageable. 3-4 response papers, leading class discussion once and one large class presentation. The last paper is larger but pretty easy. \n"
        },
        {
            "course_name": "First-year English: Legacy of Mediterranean I",
            "review_date": "January 05, 2013",
            "review_content": "\nProfessor Sastry made me more interested in classical literature. I took this class to fulfill the First-Year English Requirement. Sometimes the class discussions were not very interesting (she has a habit of clarifying what others have said), but when the class really enjoyed one of the novels the discussions became much more lively. She provides a lot of suggestions on the first draft of papers, which is very helpful as she sincerely wants to improve your writing skills. Going to office hours was extremely helpful in understanding exactly what she wants altered and she rewards trying to revise your paper. She made me incredibly interested in my research paper topic and I am not a person who gets excited over English. Overall, the class seemed a bit boring at the beginning, but one I got use to her discussion style I enjoyed it much more. \nWorkload:\nRead excerpts from one text a week (usually around 60-80 pages). Two 3-4 page papers - only final draft graded (20% each), one research paper for the final of 6-10 pages - both first draft and final draft graded (40%), and class participation - includes class attendance (2 missed classes is ok) and 2 mandatory scheduled office hour meetings (20%)\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 23, 2007",
            "review_content": "\nThough Professor Sastry is not the best conversation facilitator, I ended up really enjoying her class.  The workload is not bad at all and I found her comments on papers to be extremely helpful.  Professor Sastry appreciates when students participate in class discussion so this will definately help to boost your grade.  \nWorkload:\nMinimal reading, two 3-4 page analytical papers, one 7-8 page research paper on a topic of your choice\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 23, 2007",
            "review_content": "\nThough Professor Sastry is not the best conversation facilitator, I ended up really enjoying her class.  The workload is not bad at all and I found her comments on papers to be extremely helpful.  Professor Sastry appreciates when students participate in class discussion so this will definately help to boost your grade.  \nWorkload:\nMinimal reading, two 3-4 page analytical papers, one 7-8 page research paper on a topic of your choice\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 23, 2007",
            "review_content": "\nThough Professor Sastry is not the best conversation facilitator, I ended up really enjoying her class.  The workload is not bad at all and I found her comments on papers to be extremely helpful.  Professor Sastry appreciates when students participate in class discussion so this will definately help to boost your grade.  \nWorkload:\nMinimal reading, two 3-4 page analytical papers, one 7-8 page research paper on a topic of your choice\n"
        },
        {
            "course_name": "College Composition",
            "review_date": "July 31, 2005",
            "review_content": "\nI took Sailaja's class a couple years ago, and after reading the negative reviews, I feel the need to add a good one.  No, College Composition isn't the greatest subject, but it isn't with any teacher.  Sailaja really wants her students to learn the subject and encourages anyone who needs any sort of help to talk to her.  I wouldn't say that I loved the class, but out of all the teachers I've had at Columbia, she has definitely been the one most concerned about what happened to me.  When I asked her to write me some recommendations, she not only said yes, but met with me to discuss my future and even went through my old essays so she could be specific in my recommendation.  I know that doesn't say much about the class, but I just think teachers who care that much are few and far between.  I'm a senior now and don't even know if she still teaches, but I wanted to put in a good word.\nWorkload:\nI think we read articles, wrote an essay one week, and then revised it the next.  At the end of the semester we did a large research paper.  Grading wasn't that bad.  I got an A, and I know of others who did too.  I think the main thing she seemed to look for was that people showed up and made an effort. \n"
        },
        {
            "course_name": "College Composition II",
            "review_date": "April 29, 2002",
            "review_content": "\nI am SO sorry if you get stuck with her- Watch out! Not only is she disorganized, but our whole class \"misinterpreted\" what she wanted us to do consistently- from the weekly essay assignment to other 'things'. You would hope that she would figure out that she was the problem, not a whole class. But NO, instead she would punish us by adding things on as assignments for the rest of the semester.\nWorkload:\nThe usual papers, plus whatever the hell else she off-handedly mentions.\n"
        },
        {
            "course_name": "College Composition",
            "review_date": "November 25, 2001",
            "review_content": "\nWhen I saw the first review of her here, I wanted to transfer classes. I tried. But then classes started. While discussions in class can get dry/boring, that will happen with any composition class. But the papers, compared to other options from other instructors, were great. She can be a tough grader, but not unfair. She's always willing to talk to you when you need it. You can feel just as comfortable talking to her/writing to her about movies as you can about literature. Overall, she's just very cool and wants to help you learn. Just don't show up late to class.\nWorkload:\nStandard Comp papers--doesn't want to make you work too hard--just enough to learn what you can and fill the department's requirements. Expect B/B- range for decent papers, but B+/A- isn't unattainable for really good ones. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 31, 1999",
            "review_content": "\nIf you landed Sailaja, I'm sorry. Class is pointless and utterly boring, but don't even think about skipping or coming late more than twice. Don't expect to get good grades either. She has extreme trouble to get the class to participate in any of the exercises she has prepared, for they go nowhere and have no relevance.\nWorkload:\nSame L&R; stuff that everybody else has.\n"
        }
    ]
}