{
    "prof_info": [
        {
            "prof_name": "Scott Failla",
            "prof_id": 385,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Italian I",
            "review_date": "December 05, 2007",
            "review_content": "\nHands down, Failla is the best.  He is a very laid back guy who really cares about his students.  He has an infinite patience with students who have limited language skills and keeps a good sense of humor.  Sometimes class can be tedious since most of it in spent going over assignments.  He also insists on going over basic things like the alphabet and numbers at the beginning of each class - which gets old after the first two weeks.  However, he does spice things  up by incorporating youtube in most classes.  Take any class you can with Failla.  You will find yourself looking forward to these refreshing and relaxing two hours during the school week.  \nWorkload:\nlight.  bookwork for each class, several quizzes (where Failla helps you out), a few compositions (1-2pages), midterm, final\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "April 12, 2007",
            "review_content": "\nI love Failla! He is my favorite professor at Columbia! I am even taking his Elementary 2 conversation (it's below my level) because he is just that great of a professor. He is always in a good mood and knows everything about Italian language and culture. Class is always fun, but you learn a lot. Take any class you can with him, he's great! \nWorkload:\nstandard departmental stuff, Failla is not strict about assignment deadlines though. \n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 15, 2007",
            "review_content": "\nI loved this class! As a first year, first semester student, this class was a wonderful transition from high school to college.  I came in planning on majoring in Italian, and the class just reinforced my love for the language even more. Failla is a great professor, always energetic, funny and engaging. \nAlthough the timeslot was awful, Failla's class was definately worth the sacrifice and I am taking his Intermediate 2 class this semester. This class was a relaxed, easy and fun way to improve upon my Italian skils and to learn a lot about Italian culture.\nWorkload:\nLight. Textbook assignments are due for every class, and are provided via email by Failla. The workbook is not used at all, and we had very few compositions.  Departmental quizzes (although not always weekly), short midterm and a final. \n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "November 07, 2006",
            "review_content": "\nFailla is a great professor. He really focuses on your ability to speak the language above and beyond the exercises in the books, teaching us colloquial sayings (and even a few useful swears). Above all this he really is a fun guy who made our gruesome time slot much more palatable. His energy keeps you engaged for the brutally long class.\nWorkload:\nFailla basically dismisses the workbook,he assigns things from the books, gives a few departmental quizzes, some short writings, a midterm and a final. Not a bad workload at all.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "July 15, 2006",
            "review_content": "\nOverall a really well informed great guy.  He doesn't treat the class like a bunch of babies and expects you to do your work. He also has an adorable personality.  A snazzy dresser too.\nWorkload:\nStandard\n"
        },
        {
            "course_name": "Rapid Reading & Translation",
            "review_date": "May 31, 2005",
            "review_content": "\nScott brought passion and dedication to teaching this class. He focused on the basics, including numbers, dates, etc. as well as the conjugations for different verb tenses. He spoke Italian through much of the class, and while this may have struck absolute beginners as an unanticipated challenge, the extra attention and consideration he paid to the least confident students insured that no one was consigned to confusion. Meanwhile, students who knew a little bit of Italian got a chance to brush up on listening and pronunciation skills. Scott was extremely approachable and willing to stop the class for \"una domanda.\" Students were invited to bring in texts for the class to translate, providing a little latitude to steer the course toward individual interests. In these ways he made the class truly useful and enjoyable, not just an exercise.\nWorkload:\nOne text to translate each week. \n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "November 15, 2004",
            "review_content": "\nScott Failla is a great teacher. He's always in a good mood. He makes sure that everyone participates. He has lots of interesting ways to teach us what we need to know and also all about Italy and its culture. He's really a great guy and always understand, and all of us in his class love him\nWorkload:\nNightly homework, normal for all sections, but he doesn't use the lab manual. Biweekly quizzes, not too bad, and midterm and final (all departmental).  \n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "August 27, 2003",
            "review_content": "\nFailla is funny and energetic, and very nice and understanding, but his class is a waste of time.  I didn't learn much and he wasn't open to suggestions or change.  I also found him to be an unfair grader.  I don't think he likes guys, so if you're a guy and you want a good grade, take Italian with someone else.  If you're a girl who's just looking for an easy A, I guess you could take his class.\nWorkload:\nNormal - easy homework, easy quizzes and tests - probably 6 per semester plus final.\n"
        },
        {
            "course_name": "Intensive Intermediate Italian (I and II) ",
            "review_date": "July 16, 2003",
            "review_content": "\nFailla was an amazing Professor! One of the few I've met who is really primarily interested in his students and cares that they understand the language. Intensive Italian was four hours long  and in the summer Monday-Friday and it had the potential to be increadibly bad, but with Failla he made those four hours interesting and exciting and got everyone of his students wanting to speak as best he/she could. One of the best things about his teaching style was that he encouraged conversation in Italian and also taught colooquial phrases and things necessary about everyday interactions. When it comes to work,  he was tough to be sure, demanding even - there was no question you had to work hard. His quizzes were increadibly difficult, but the man has no desire to see you do poorly! He encourages his students to correct themselves, and is very fair when all is said and done. He knows his students and if he knows you are trying (which he inspires you to do), then all will be well. Take a course with him by all means!\nWorkload:\nIntense. Nightly homework (grammer exercises in the book), readings. Tough quizzes once or twice a week (no midterm). Final Exam - tough but fair.\n"
        },
        {
            "course_name": "From the Page to the Stage",
            "review_date": "November 18, 2002",
            "review_content": "\nScott is fun and exciting. He knows a lot about ballet, and a lot about the ballet world. He used to dance professionally, and he has lots of friends that still do. Our class had two regular guests who would sit in and join in on discussions, both of them professionals or past professionals. We also had visits from Allegra Kent, a Taylor dancer, and some cool lady who taught us ballet gestures. Scott is almost always late. One day he was sick, but it didn't occur to the class to check with the department until 30 minutes after class was supposed to start, because that didn't seem all that unusual. Scott is also very interested in student and their interests. If students want to bring William Forsythe and Pina Bausch into discussions of Balanchine, it's encouraged. While the syllabus is mostly ballet, or classical modern like Graham and Taylor, Scott certainly encourages thought on other forms.\nWorkload:\nThe workload was almost ridiculously light. We had two papers, both of them short reviews of dance performances we'd seen (ie. the papers had nothing to do with the class). Most of the grade depended on participation, which wasn't hard to do well in.\n"
        },
        {
            "course_name": "Accelerated Elementary Italian 1",
            "review_date": "December 31, 1999",
            "review_content": "\nThis man is animated, engaging and a sharp dresser. However, he makes close to no effort to find creative ways to teach language. Class is spent going over rote book excercises and conjugations. An interesting plus is the common digressions, where the class debates the merits of various Italian cuisine and restaurants, or compares the language to other romance languages. Failla is a spunky man who sticks to traditional (and somewhat boring) methods of teaching.\nWorkload:\nvery easy but sometimes time-consuming; so many rote excercises!\n"
        }
    ]
}