{
    "prof_info": [
        {
            "prof_name": "Luis Goncalves",
            "prof_id": 2272,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Elementary Portuguese I",
            "review_date": "November 14, 2006",
            "review_content": "\nAt the beginning of the semester, Professor Goncalves jokes were funny, light-hearted, and made the class enjoyable. But by the middle of the semester I had had enough of the constant teasing, snide comments and slightly cocky attitude. Though he did seem to have a habit of singling people out for their obviously \"dumb\" questions, everyone had their days where they were the butt of every joke. Lets just say that though I thought the class was gonna be great at the beginning, it was a constant downhill slope until it got to the point where I literally had to talk myself into going to class.\nOne other issue I had with Professor Goncalves was his lack of communicating outside of class. Often times, he would say he would send everyone an email with the homework and it never would show up. Or, he'd send it at 8 am the morning its due.  Other times, he would send blank emails with attachments, but no directions or due dates along with them.  He canceled class often, which was sort of nice by the end.\nWorkload:\nNot too much. Some brief compositions, a couple of tests, and some pretty easy daily homework.\n"
        },
        {
            "course_name": "Intermediate Portuguese II",
            "review_date": "January 30, 2006",
            "review_content": "\nLuis is a great guy! Our class was really small, and it was a awesome atmosphere just to talk and practice our Portuguese. His style is super laid back, and I liked it a lot because it takes the pressure off and lets you soak in a lot more of the language. He's absolutely hilarious and one of the nicest people in the department. The only problem I had was that he didn't give much homework. (Doesn't sound bad, does it?) But if you are trying to improve your grammar and get all those tricky rules clear to yourself, homework would be helpful. We didn't have any quizzes or tests. Lots of writing assignments, but they weren't bad. The final oral examination was at a Brasilian restaurant in Midtown...we all just talked over our dinner. Bottom line: Good teacher! Nice guy! Definitely take him over any other professor. Although, if you want to really know your grammar, you'll need to do more than he asks of you.\nWorkload:\nMinimal. Reading and questions from flimsy textbook. He won't check it for weeks and then arbitrarily collect everyone's books to peruse them over the weekend for completeness. Do your homework, and you're fine. Writing assigments. No midterm. Take-home final.\n"
        },
        {
            "course_name": "Elementary Portuguese I",
            "review_date": "January 20, 2006",
            "review_content": "\nEver have  a professor in High School who is convinced he/she is the king/\nqueen and you can't talk to him/her because they are so stubborn and full of themselves?  Well this guy is the perfect example.  If he doesn't like you there is nothing you can do, no matter how much work you put in, no matter how many times you talk to him, you are going to have one aweful time.  He is not afraid to give D's if you have 90 percent of your test answered correctly.  He is not afraid to give you a D if you mispelled the same noun throughout the test.  Think this rigid style will make you work harder? Yes! Think your work will pay off? Not in terms of grading. He will have no problem giving out the lowest grade you've ever seen.\nDon't get me wrong.  If he likes you, you'll have a great time. \n"
        },
        {
            "course_name": "Elementary Portuguese I",
            "review_date": "January 20, 2006",
            "review_content": "\nEver have  a professor in High School who is convinced he/she is the king/\nqueen and you can't talk to him/her because they are so stubborn and full of themselves?  Well this guy is the perfect example.  If he doesn't like you there is nothing you can do, no matter how much work you put in, no matter how many times you talk to him, you are going to have one aweful time.  He is not afraid to give D's if you have 90 percent of your test answered correctly.  He is not afraid to give you a D if you mispelled the same noun throughout the test.  Think this rigid style will make you work harder? Yes! Think your work will pay off? Not in terms of grading. He will have no problem giving out the lowest grade you've ever seen.\nDon't get me wrong.  If he likes you, you'll have a great time. \n"
        },
        {
            "course_name": "Elementary Portuguese for Spanish Speakers",
            "review_date": "December 18, 2004",
            "review_content": "\nA wonderfully engaging teacher who truly cares about his students. Mr. \nGoncalves teaches through conversation and makes the class very interesting and fun. He doesn't speak Brazilian Protuguese, though, so his accent is a bit different.\nWorkload:\nIf a workload can be too light, this is it. No homework excercises, no reading. \nOne self-recording of a passage, two midterms, two quizzes, one final, two essays. All very easy.\n"
        }
    ]
}