{
    "prof_info": [
        {
            "prof_name": "James Adams",
            "prof_id": 9599,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Jane Austen Seminar",
            "review_date": "May 15, 2016",
            "review_content": "\nI took this class reading generally positive reviews on a subject matter that I deeply enjoyed.  I expected the class to be a great seminar and unfortunately I had a terrible experience with this professor.  There are other people that seem to have no issues with Professor Adams but I found him to be one of my least favorite English professors at Columbia.  I would strongly recommend against taking his class.  I interacted with the literature and loved the books that we read however Professor Adams seemed to take a particular disliking to my writing style and even though I met with him multiple times to discuss the final paper I received a low grade.  In my opinion Professor Adams can be a reasonable grader if you spew back what he says in class and if you say it in the style that he likes however if your writing style is slightly different from his preference he lowers your grade.  Worse than the grade Professor Adams has made me never want to pick up another Austen book.  I have never encountered an English professor that was so unfair in his grading style and stuck in his own opinions that he could never open up to new ideas.  Take another professor.  \nWorkload:\nA lot of reading but doable.  \n"
        },
        {
            "course_name": "Jane Austen Seminar",
            "review_date": "May 15, 2016",
            "review_content": "\nI took this class reading generally positive reviews on a subject matter that I deeply enjoyed.  I expected the class to be a great seminar and unfortunately I had a terrible experience with this professor.  There are other people that seem to have no issues with Professor Adams but I found him to be one of my least favorite English professors at Columbia.  I would strongly recommend against taking his class.  I interacted with the literature and loved the books that we read however Professor Adams seemed to take a particular disliking to my writing style and even though I met with him multiple times to discuss the final paper I received a low grade.  In my opinion Professor Adams can be a reasonable grader if you spew back what he says in class and if you say it in the style that he likes however if your writing style is slightly different from his preference he lowers your grade.  Worse than the grade Professor Adams has made me never want to pick up another Austen book.  I have never encountered an English professor that was so unfair in his grading style and stuck in his own opinions that he could never open up to new ideas.  Take another professor.  \nWorkload:\nA lot of reading but doable.  \n"
        },
        {
            "course_name": "Victorian Literature",
            "review_date": "September 29, 2013",
            "review_content": "\nIf you're thinking of taking a class with Prof. Adams, DO IT. You will not regret it. If he is not as well known among students as are the other Victorianists in the department it is because he's new to Columbia. (he's married to Prof. Moody-Adams, and came with her from Cornell a few years ago) Give him a few years and people will be fighting for room in his classes. It's shocking to me that they aren't doing so right now! He's AMAZING. (His \"Victorian Literature\" survey inspired me to be an English major!) He always has time for his students, making more office hours close to paper deadlines, giving extensive comments on said papers, and even accepting a first paragraph for comments before the final submission. His lectures are engaging, and his seminars are even more so (not to mention that his syllabi are always interesting) He's also approachable. There's no ego in sight (though it would be justified if he had one - the man's brilliant). \nDon't expect there to be a ta for the lectures. He does all the grading himself (he even has a little story he tells at the beginning of each of his lectures about how his time at MIT (Yep, that's right, he was a math major at MIT before being a Rhodes Scholar and doing English) influenced his decision to go it alone. You'll get full-on Adams awesomeness for the whole semester - no middle (wo)man! :) \nI'd recommend pretty much anything he teaches (his George Eliot seminar is especially fascinating). You really can't go wrong. If you are looking for a fun and awesome class, are thinking of the English major, or already a seasoned veteran, TAKE A CLASS WITH THIS MAN! Seriously, do it. You're doing yourself (and your writing) a favor.   \nWorkload:\nYes, there's a lot of reading. But it's all worthwhile. He grades fairly (he'll make you work for that A, but it's entirely possible to get one if you put the time and effort in) \n"
        },
        {
            "course_name": "Victorian Literature",
            "review_date": "July 31, 2012",
            "review_content": "\nWhere is this man's nugget? Favorite professor yet at Columbia by far! If you're interested in the material, his lectures are interesting and informative. He's generally understanding about pushing back deadlines and doesn't grade very harshly at all. This was the first English class I took at Columbia, and he was always willing to talk over paper ideas with me during office hours. If you're interested in Victorian literature, he's definitely your man! Highly recommended.\nWorkload:\nFairly heavy reading, but it's to be expected, and he doesn't tend to check to see if you've done it. A few short response papers, maybe one every two or three weeks. Two long but relatively easy papers, an ID midterm that was easy enough if you'd done the reading, and a sit-down final consisting of a couple essays.\n"
        },
        {
            "course_name": "Victorian Literature",
            "review_date": "December 21, 2011",
            "review_content": "\nA fun class for those who love Victorian literature and are willing to delve in 19th century nonfiction too. Prof. Adams gives amusing lectures with great historical context. Some common themes were \"fallen women,\" (and women in other contexts, such as the unfaithful wife or lover), emerging scientific discoveries, advancement in technology, and creativity (both visual and poetic.) \nI'm not sure what grades other people received on the papers and exams, but I felt that the grading was fair. I definitely, definitely would suggest seeing him with a basic outline of your paper before writing it, and following it up by asking him to critique your first paragraph through email. Prof. Adams is super nice and helpful, and doing so will help you with your grade.\nThe IDs can be challenging at times, but read the work and really note down what passages the Prof. speaks about in class. His lectures give a good idea of what IDs will be on the exam.\nI enjoyed this class, but I am also especially fond of Victorian literature, so I even found the nonfiction somewhat interesting (I still can't stand Carlyle, but the second half of the semester had more interesting nonfiction, with easier-to-read writers like Morris and Ruskin.)\nIf you're only lukewarm about Victorian lit, this might not be the best class for you, but if you are a fan of the 19th century, Adams is engaging and interested in your opinion. Really great professor.\nWorkload:\nTwo essays, one-page responses (that get a check or check-plus, and I'm not sure what grade these translate to,) and two exams (the midterm is all IDs, the final is IDs and essays - he gave us a sheet of possible questions before the exam and narrowed that down to three on the actual final, with works we need to analyze included.) \n"
        },
        {
            "course_name": "Victorian Literature",
            "review_date": "September 12, 2011",
            "review_content": "\nThis review refers to Professor Adams' graduate seminar in Decadent Literature taught Spring '11.  \nI want to also express my disappointment with this unfocused and disorganized seminar.  Rather than zoom in on specific passages in the text, Professor Adams encouraged students to sound-off about anything that caught their attention.  In practice this became terribly unproductive; hardly anyone attempted to build off the previous thread, but instead simply threw out their own particular viewpoints one after another.  The seminar quickly became an exercise in grandstanding, completely useless and uninteresting.  Each week felt like a waste of 2 hours, it was depressing.\nI also want to comment on the disorganization of the course.  Many of the weekly readings were circulated by Professor Adams electronically and these would always inexplicably arrive late, sometimes the very evening before the seminar met, which made it difficult for more than a few students to cover the readings and for anyone to read them thoroughly.\nIt really was a pity, Professor Adams is an incredible scholar.  I wish he would direct a greater proportion of his thought to his teaching.  \nWorkload:\nFairly heavy reading.  1 presentation.  20pp seminar paper.\n"
        },
        {
            "course_name": "Victorian Literature",
            "review_date": "December 23, 2010",
            "review_content": "\nI took this class figuring I'd never read any of the books on the syllabus otherwise. Even though Adams was new to Columbia, his reviews from the Cornell equivalent of CULPA were good. He's an insightful thinker and obviously an expert on the material, but not a very engaging lecturer, which can be deadly in a class with material that's pretty thick to begin with. He occasionally asks questions of the class, but he gets too wrapped up in his own notes to really keep the class interested. He's purely interested in seeing his own ideas reiterated in the papers to the point where it's hard to stretch those two or three points into an entire paper. Don't bother writing your own ideas. The worst part by far were the quote IDs on the exams. He picks parts of quotes that aren't obviously from any one reading and doesn't give enough material to determine rhyme schemes. Having said that, he was helpful in office hours and willing to discuss paper ideas and exams. Take his class if you're really interested in the material. Otherwise I'd say the painful exams make it not worth the time.\nWorkload:\n2 5-6 pg papers, a couple responses, a midterm (entirely quote IDs) and a final (quote IDs and essays)\nThe syllabus said there would be in classes quizzes, but we never had any.\n\n"
        },
        {
            "course_name": "Victorian Literature",
            "review_date": "December 21, 2010",
            "review_content": "\nThis is a great class taught by a great professor. The eloquence of the first lecture will convince you that Professor Adams is seriously interested in making the time you spend in his class worthwhile. As the author of a well-regarded survey, The History of Victorian Literature, his main strength in lectures is the ability to bring so many different contemporary perspectives to each text. The reading list of the course is extremely well-balanced, diverse, and not stingy on masterpieces. One other gauge of Prof. Adam's merit as a teacher is his openness for advice and help. Before papers are due, he takes questions each lecture and posts extended office hours. His paper topics are flexible and encourage students to be creative without being overly broad and non-directed. This is the kind of class which makes the case for humanities in undergraduate education, and I hope every student will consider it. \nWorkload:\n2 5-7 page papers. 2 1 page writing exercises. Midterm (ID's only, no commentary). Final (ID's only + 3 essays for which he distributes topics in advance). Reading load varies by the week, sometimes heavy, sometimes light. \n"
        }
    ]
}