{
    "prof_info": [
        {
            "prof_name": "Eileen Gillooly",
            "prof_id": 1809,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 11, 2004",
            "review_content": "\nWATCH OUT. Yeah, she knows her stuff but she is not easy and is not entirely open to views other than hers on the texts. Yeah, you'll sit down in class as a freshman and be blown away by her breadth of knowledge, but then youll be blown away by her ridiculous midterm. I did well in the class - im not bitter - I just think there are better profs to seek out for this class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 18, 2004",
            "review_content": "\nNot only is she unbelievably nice and seems to truly care about both the material and her students, she is an insightful and inspiring teacher. \nThe grading is a little tough but her comments on papers are actually very useful. I learned more from her than in University Writing about how to write a paper.\nWorkload:\n2 response questinos due everyday, four papers, the midterm and the final. same amount of reading as for any lit hum class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 20, 2003",
            "review_content": "\nGillooly is extremely knowledgeable about all the texts and can discuss basically anything at length with you.  She's the director of the Core and she knows this course inside out.  The only drawback to this is that she has a formula and doesn't want to deviate much from it.  The class is sort of a scripted discussion.  She also has a bad habit of favoring certain students and calling on them all the time.  Her expectations are very high.  Nevertheless, she is extremely nice and she has lots of office hours (6 a week--definitely go to them) so it's worth taking Lit Hum from her if you're lucky enough to get her.\nWorkload:\nFour 3-page papers, midterm, final.  Daily discussion questions due which have to be really well thought out here, they're harder than you might think.  Aside from the questions, not too bad.\n"
        }
    ]
}