{
    "prof_info": [
        {
            "prof_name": "Ryan Dohoney",
            "prof_id": 2801,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 24, 2008",
            "review_content": "\nI have to agree with other reviewers: Ryan is a great way to wake up at 9 a.m. He plays great music at the start of class, knows how to maintain class-wide conversation throughout the 1:15 minute period, and gives really interesting readings that a non-Music major can easily relate to. Because he is so non-Music-major-oriented, I can't say that I learned a whole lot about the technical side of music during the semester, but the history was interesting nevertheless. \nWorkload:\neasy Midterm and Final, short weekly responses, two concert reports, and daily readings\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 22, 2007",
            "review_content": "\nRyan is absolutely PRECIOUS! Let me give you an example... before Thanksgiving break Ryan checked to see if we all had someplace to to go, offering us dinner with him and his friends if we didn't have anywhere or anyone. Adorable! And he felt SO BAD about the racism and tragic lives that Billie Holiday and Charlie Parker suffered, he got choked up just talking about them. I wanted to hug him! And he didn't make us buy the big music book. Instead, he assigned some fairly interesting articles from: Barthes (a sexy reading), Adorno (a thought-provoking reading) and even Jacques Attali (a crazy but interesting reading). \nOn the downside, the second half of the semester was, pretty much, atonal modern composers that you've never heard of -- and, if you're like me, you will purge those screeching sounds of metal against glass from your iTunes one millisecond after the final exam is over. We covered some good stuff from Debussy, Stravinsky and Bebop during this half of the semester. But the rest of the time we were listening to Ruth Crawford Seeger (who?), Morton Feldman (huh?), Virgil Thomson (ugh)... you get the picture. \nOn the upside, Ryan gave us a lot of freedom. He did not take points off assignments just because I didn't say some specific thing about a piece of music. As long as it was clear that I'd listened to the piece and spent some time thinking about it, Ryan gave me full credit on the assignments. I really appreciated that because it's hard to talk about music. \nWorkload:\nYou have to write something every week. Sometimes 250-300 words. Sometimes 450-500 words. Sometimes 800-900 words. These papers are responses to your assigned listening. And there are no wrong answers, Ryan will give you full credit for them. But they take time and if you don't do them, it will affect your grade. You also have to do two ~2,000-word Concert Reports. Like the other assignments, Ryan will grade them generously. But they're 9 pages, rather than the 4-5 pages that my friends had to write for Music Hum. There is a mid-term and, of course, a final exam. Best of luck identifying the random instrumental snippets you will hear! \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 17, 2006",
            "review_content": "\nRyan is amazing! He is really intellegent, dedicated to his students, accessible, and generally just a really cool person. He's a historical musicologist so dont expect to do a lot of theory. Instead he focuses on historical background and the social conditions influencing and surrounding music. He also chooses to go really in depth with a few pieces rather than listen to a million pieces and make his students memorize all of them. The tests are REALLY easy and he is quite fair grading the papers. The only reason i would suggest looking into another class is if you absolutely hate 20th century music, which he does quite a bit of. But i went into the class thinking i did, and he really gave me a newfound appreciation for it. He also does a lot of vocal pieces and if youre lucky will sing (really well) and dance for the class.\nIf you dont leave this class with a love for western music you should at least try to get him to be your friend...becuase hes really cool.\nWorkload:\n2 concert reports( one 5-7 and one 7-10 page) which are just personal responses rather than analyses, easy midter, easy slightly longer final. weekly readings are basically always discussed in class but should be done before hand (especially the if its the libretto). youre expected to write essays based on the readings for the exams but e emphasizes which are important. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 14, 2006",
            "review_content": "\nPut simply, Ryan is so nice that I didn't have the heart to switch from his 9 am section into another that began at a more humane hour.  He's incredibly friendly and approachable, and really cool too.  This was his first class, and he was excellent.  He made Music Hum's somewhat stodgey curriculum fun, adding interesting, innovative interpretations that range of his personal, indie-rocker taste.  And he makes the class very easy.  Fun, interesting, incredibly nice, and easy - for once a no-brainer at Columbia - take Ryan's class!\nWorkload:\nEasy midterm and final, 2 concert reports, weekly readings, and about halfway through the semester he started assigning weekly response papers (2-3 pages).\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 09, 2006",
            "review_content": "\nRyan is awesome. He is so nice and energetic and knows a ridiculous amount. Though this class was at 9 AM, I went to every one because he was so cool and the class wasn't boring. Even if you don't know anything about music, you can understand what's going on in this class.  Even if you think you know everything about music, you can learn something in the class. As long as you do the listenings and the readings, you should be fine.\nWorkload:\n2 concert reports1 midterm and a finalResponses to musical works\n"
        }
    ]
}