{
    "prof_info": [
        {
            "prof_name": "Davesh Maulik",
            "prof_id": 11935,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Analysis and Optimization",
            "review_date": "September 06, 2015",
            "review_content": "\nI took this class as an econ major with an OK but not great background in math. I'd recommend it if you have to take it (especially since all my friends died in \"real\" analysis) but be aware:\nPROS:\n(1) Professor Maulik is decent. I was afraid we were going to get an Indian dude with a heavy accent but he grew up here and speaks American English. He's helpful and responds quickly to emails and is often willing to give extensions on the homework\n(2) The curve is pretty generous; something in the 80s range will get you an A\n(3) Zhenrui was an awesome TA! He held review sessions before every midterm and final which were super helpful as far as getting a feel for the material goes. Sometimes it looks like he's sleeping in the back and then he'll raise his hand and point out an error on the board or ask exactly the right question to clarify a point when a lot of people look confused. I didn't really interact with the other TAs that much but my friends that did said they were pretty OK too.\nCONS:\n(1) There is a steep learning curve if you've never done proofs before (I hadn't). A large part of lectures as well as the homeworks and the exams will require you to do proofs and not baby \"derivation\" proofs where you just work backwards and manipulate down some equations until they look like what you want like in Calc III. Points are taken off for unjustified steps or logical errors. Memorizing definitions is a MUST\n(2) The class is pretty dull; even though it's pitched as a math class for econ/econometrics/finance it's pretty obvious that Prof Maulik is a pure mathematician and doesn't really do applications. He tries to bring them in sometimes but it's usually not the same as when you actually have to use them in an econ setting\n(3) Half the time everyone was asleep since we were just going over stuff from Calc III or linal and the other half of the time everyone was totally lost (which might have been why the curve was so generous)\n(4) Class interaction probably *negatively* impacts this class. I have no illusions about my mathematical abilities but it seemed like only really dumb questions got asked in class, and then Prof M would waste time rehashing very basic concepts like the dot product because he thinks we don't understand it. Fortunately in a lecture of ~100 it's not very interactive.\nWorkload:\n1 PSET per week, usually 5 problems, 2 computational and 3 hard/proof-based\n2 midterms, 1 final with emphasis on proofs\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 26, 2014",
            "review_content": "\nI had professor Maulik my entire freshman year, Calc III first semester, and Linear Algebra second semester.  He was the definition of a good math professor.  He is a decent lecturer (American accent and loud speaker for whom it concerns), peppering his lessons with semi-easy access proofs, motivations for learning certain concepts, and a few sparse funny comments.  It's not necessarily a class which you will love attending, but after having gone to most classes first semester and not nearly as many second semester, I would definitely say it's worth going.  He assigned challenging but helpful written Psets every week, which sometimes took as little time as 2 hours, but a few as many as 9 (but that's probably just me).  He didn't really have great review sessions or anything like that, but he leaves that up to the TAs (we had an amazing TA in Calc III).  He's pretty fair when it comes to regrades, doesn't make you use anything as annoying as WebAssign, and is altogether a decent teacher who does not fall into the category of researcher who couldn't care less about his students.  I also highly recommend going to office hours.  Whenever you feel that he may be going too fast in class, or if you get behind and you feel the material is going over your head, if you go to him during office hours, he will really sit down with you and explain the concept as many ways as you need until you get it, and I think he appreciates the interest.  All in all, with respect to everyone complaining about the calc teachers (and Bayer), I really feel like I have learned a lot of math this year, and I have Davesh to thank, so I highly recommend choosing him if he's available.\nP.S. For reference, if people wanna check my bias, I got an A first semester, and an A- the next, and I did essentially all of the reading.\nWorkload:\nWeekly Psets that took a bit of time, but were rewarding in that you really got to learn the material this way.  Two midterms, medium difficulty.  And a comprehensive final of the same difficulty as the midterms.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 24, 2014",
            "review_content": "\nI have had many professors over the years in both undergrad and business school, and Davesh is the best professor I have had.    \nWhen I think about the overall quality of a professor, I think in terms of a few categories: horsepower (i.e. pure math ability), teaching ability, and helpfulness.   \nHorsepower\nDavesh is an incredibly talented mathematician.  He got tenure at a relatively young age, and for those of you who like math competitions, Davesh was a Putnam winner while in college.  That's the math equivalent of winning a Heisman Trophy, so for those of you who like math, that's pretty cool.  While having a professor with more horsepower does not always make for a better teacher, Davesh's horsepower directly benefited the class.  He never got lost in proofs; he didn't waste time; and he was able to show how all the material linked up in a very logical, thorough way.  One of the prior reviewers mentioned a criticism along the lines that Davesh uses handheld notes at times - this makes the class more efficient and also he likes to use numerical examples to make things clear.  Without notes, one would have to make up numerical examples on the fly which could be very messy computationally.  I found the numerical examples incredibly helpful.  He covers a lot of material in a lecture and the notes make things much more efficient.  I don't like it when professors try to wing lectures and go off-topic. \nTeaching Ability\nWhile one can do fine in the course without fully understanding all the proofs, I like that Davesh took the time to take us through most proofs.  He essentially proved everything we use, and an understanding of the proofs contributes to a deeper understanding of the material.  Davesh was very concise and articulate in building up the motivations, the proofs, and then the numerical examples to bring it all home.  Also, I liked that he spent the first 5-10 minutes of class consolidating the material from the prior class. \nOne thing which helped me tremendously was skimming the relevant section prior to class (takes 10-15 mins), and then reviewing it in detail after the lecture.  There were a few points which I felt needed clarification in the text, and often I saw them addressed in my lecture notes which was nice.      \nHelpfulness\nDavesh was very good about being accessible after class, during the 3 minute break in the middle of class, and during office hours.  Whenever he had a conflict, he would schedule another time for office hours instead of canceling them.  He provides practice problems prior to exams, and he definitely wants the class to do well.  He also has a good sense of humor and is in tune with the ability of the class.     \nOther comments\nSome people have said they don't like the text.  I actually think the text is quite good as it goes through proofs while also providing lots of numerical examples.  It strikes the right balance between theory and applications.  Linear Algebra is a very interesting subject and I was able to appreciate it given my prior experiences.  \nFor example, the Linear Algebra approach to least squares is much more powerful and elegant than what is generally taught in a econometrics/statistics class.  Instead of just thinking about plugging in numbers, one can now step back and think of projecting a vector onto a subspace.  The undergrad stat classes focus primarily on linear least squares - linear algebra gives us a generalized tool (linear, polynomial, exponential, trig, etc).  Also, the discrete dynamical systems was interesting for me in the context of valuing certain stocks where the businesses have the characteristics of those models.   \nWorkload:\nGiven that linear algebra is a subject very worth of study, it requires a fair amount of work.  Basically 11 homeworks, 2 midterms, and a final.  The problem sets are very representative of what you need to learn, but they do take several hours to complete.    They are definitely quite doable, but I would not wait until the night before they are due.  The course was more work than Calculus 3, but less work than any programming course.           \nI found the TAs Mike Wong and Changjian Su to be very insightful and accessible, even via email when needed.    \n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 23, 2014",
            "review_content": "\nMaulik is not a good lecturer; he goes through topics really fast and it's very hard to focus on his lectures. He tries hard to address the students' questions, and clarifies some of them, but his speed is the main problem. The best you can do in a lecture is to take notes throughout without having understood much because you haven't had enough time to digest the information. Without looking at the textbook (which isn't a very useful one), it's impossible to understand what the theories he does in class imply practically. The lectures are very theoretical, but the assignments, midterms and finals are the contrary.\nHis curve isn't very good either; you have to perform more than a few points above average to get a B+.\nMy ultimate advice would be to take this class with Bayer instead.\nWorkload:\nProblem Sets each week - some questions can be annoying\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 16, 2014",
            "review_content": "\nI echo the previous review. Prof. Maulik was efficient and taught the class quite well. Like most other math professors, he definitely could have been clearer at times, and often went a bit too quickly through proofs and material. But all in all he got the job done well and had a dry sense of humor that was refreshing. \nThe one stumbling block that I would warn people about is more generally about Linear Algebra itself. This class is one of those math classes that a bunch of people do REALLY well in, so that test averages are usually in the mid 70's or high 80's, so if you're not one of those people who easily gets 100% (there were many in this class) in tests, this might be a struggle. All in all the material isn't impossible and usually just involves arithmetic and *surprise!* algebra. The only hard part is that sometimes it gets really abstract when talking about linear spaces and applying the rules of linear algebra to spaces that aren't matrices. But all in all Linear Algebra felt like a VERY useful class that, in itself might not be all that interesting, but provided us with tools that apply to a lot of different fields: economics, statistics, data analysis, etc. \nAll in all, very good class and teaches you a lot of useful stuff, particularly when it comes to data and dynamical systems.\nWorkload:\nTypical math course at Columbia: weekly homework, somewhat hard but easier than the Calc homeworks. Two midterms (people generally did well, though they got harder with time), and one long final worth 45% of the grade. Not too stressful.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 03, 2014",
            "review_content": "\nI would like to respectfully disagree with the April 1, 2014 review of Davesh Maulik. I had Maulik for Calculus III in the previous semester, and his teaching style has remained consistent.\nHis voice is not terribly monotonous, and he does not check his lecture notes so frequently that it disrupts the lecture. The main concern is that he goes through examples and proofs very quickly. However, those examples are still relevant to what he teaches. As for the proofs, you don't really have to know the specific details since he doesn't test proofs on exams. If you don't really understand something, he responds to emails fairly quickly. \nThe textbook is...okay (even though it has terrible reviews on Amazon). The author is really heavy on applications, which might be tiresome for students (some problems are quite lengthy). I think the lectures and the book supplement each other well. \nThe rest of that review with regards to the assignments and midterm is fairly accurate, although I personally think that Maulik is a good professor. For more information on his teaching style, see the December 5, 2013 review - it's the same in the Linear Algebra class.\n\nWorkload:\nAssignments nearly every week. Two midterms and one final. \n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "April 01, 2014",
            "review_content": "\nTerrible, just terrible. He is basically a robot, speaking with the same monotonous voice for 75 minutes. He holds a cheat sheet he made for every class while giving the lecture, and he has to check it every 2 minutes. \nHe might be a better Calc teacher, but he is unable to give proper examples for Linear Algebra. He is making simple topics look hard by overloading the class with lengthy descriptions and minimal examples; sometimes I feel like I'm taking a humanities class (AND I'M AN ENGINEER).\nThe textbook we're using is not the best one either, considering that Maulik fails at teaching, it is somewhat hard to actually learn the material.\nThe assignments are not that hard, the midterms are easier than the homework, and the curve is somewhat general, but if you're taking this class to actually learn the material or you simply don't like not being able to be follow a lecture, pick another professor!\nWorkload:\nProblem Set every week, 2 midterms and a final. All not so difficult.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 23, 2014",
            "review_content": "\nMaulik is the best professor I've had so far!  Great sense of humor, kinda dorky and cute.  More importantly, he's super approachable and doesn't make you feel judged if you ask a silly question, which definitely encouraged me to speak up a lot more.  He teaches at a moderately fast pace, but, like someone else said, is always willing to slow down and explain more clearly if asked to.  I definitely recommend him to anyone, whether you like math or not.\nWorkload:\nHomework sometimes takes longer than you expect, generally not too bad.\nTests are not too bad as long as you study and do the review problems he picks.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 05, 2013",
            "review_content": "\nMaulik is a decent math professor. At the beginning of each class, he likes to give a quick review of the concepts he went over in the last class. On the day that homework is due, he reminds students that homework is due.\nHis teaching style is a standard lecture. Sometimes he'll offer a motivation as to why the concepts presented are important, and he'll offer proofs before going into specific examples. Usually there is a 3-minute break in each lecture (unless there is a lot of material to be covered).\nI thought that he teaches at a brisk pace, so it might be difficult to catch up with the proofs. However, his explanations of the concepts and examples are clear.\nAlthough I've never been to this office hours, he is good at responding to questions over email and seems willing to slow down and take questions during the lecture. Overall, he is a fair and helpful professor.   \nWorkload:\nNot too bad - I would say that there are about 20 problems (maybe slightly less) for each problem set (all from the Stewart book). You have a week to finish a set. Make sure your work is clear (effort points) and your answers are right (the rest of the points)\nThere are two midterms and a final. If you can do the homework and the review problems, you will be fine.\nThe curve is applied to the overall grade, not to individual tests.\n"
        }
    ]
}