{
    "prof_info": [
        {
            "prof_name": "Mary Hue",
            "prof_id": 325,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Japanese II",
            "review_date": "September 19, 2004",
            "review_content": "\n\nContrary to the rest of Hue-sensei's abominable reviews, I had her for my entire first year of Japanese, and absolutely loved it. She IS tough and she IS thorough, but what Japanese class isn't? She really cares about you learning the language, and dammit if thats what you want to do, you'd be in the right place for it in her class! If you want to study ANY Japanese at all while attending Columbia, you have to be ready for insane amounts of work, and doing the audio drills. It took a while, but she finally warmed up to us, and throughout the rest of the year and second semester, we had a blast in our Japanese section. Currently this year (2004-05) she is away on leave studying in France, but hopefully she'll be back again soon teaching Japanese again.\n\n\nWorkload:\nInsane like any other Japanese class - 2hrs per night drill tapes, grammar notes, homework, Kanji sheets (2nd semester), it goes on and on, but hey, its 5 credits.\n\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "January 18, 2004",
            "review_content": "\n\nhue sensei has an incredible knack for destroying all human dignigty any one of her students may have. a slave driver who demands that you study japanese until you drop, i would not recommend her as a teacher unless you really are looking to major or totally devote yourself to one class the entire semester. she overlooks the fact that one may have several other difficult courses to tend to and refuses to understand that japanese is not the most important thing to every student. avoid her if you can.\n\n\nWorkload:\ndaily quiz. two hour homeworks.daily two hour tape drills. tests almost every two weeks. incredibly long and difficult midterm and final. be prepared to study. alot.\n\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "March 27, 2002",
            "review_content": "\n\nIf you are a good student with a disciplined approach to studying, you will do fine in Hue-sensei's class. If you are like me, however, you should steer clear of it, because it will not be fun. She's something of a drill instructor when it comes to class time, and she's not above calling you at home to make sure you are doing your homework (not kidding). Of course, to be fair, she makes all of this perfectly crystal clear from the first day of the class, so if you don't think you can hack it, you can drop. Her methodology is quite understandable since if you want to learn Japanese well, you should eat, sleep, and drink Japanese, which means \"doing the tapework 2 hrs. every night.\" And since she's been in the US for years, Hue-sensei has lots of former students and contacts at other schools, so a good letter of rec might reward all your labors.\n\n\nWorkload:\nwriting practice, 1 hour weekly lab, 2 hours of homework daily, daily quizzes. 5 credits of fun.\n\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 31, 1999",
            "review_content": "\n\nPerhaps the biggest plague to hit Columbia in its 250 year history, Hue is perennially disliked by almost all students she enounters. Class feels like what a concentration camp must have felt like, with Hue attempting to dehumanize the students at all turns. The Queen of negative reinforcement, Hue's \"I don't give a crap about you\" attitude will make you lose any hope you once held that human nature is inherently good. Hue assigns far more work than any other teacher in the department and missing homework or flubbing a quiz will cost you your dignity. Some students claim to appreciate her \"style\", but soon abandon this belief when they take a course with any of the other Japanese teachers, all of whom make taking the language a pleasant experience. I could go on forever, but suffice it to say, Hue is like a bitter old woman, who takes her only joy in life by feeding off the misery of others. If you want to take Japanese and hers is the only section to fit in your schedule, find another language.\n\n\nWorkload:\nClass meets M-F at 9 a.m. Two hours of homework/night. Daily quizzes. about 6 tests, midterm, final.\n\n"
        }
    ]
}