{
    "prof_info": [
        {
            "prof_name": "Anna Nicolaou",
            "prof_id": 12589,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "March 11, 2013",
            "review_content": "\nShe is often very nervous, like she thinks we're constantly judging her. She also apologizes profusely when her phone goes off, despite it not being a massive deal.\nThose things aside, she is the sort of professor you feel like you could go to in a bad spot. She's warm, friendly and fun. \nOverall, a good instructor. For the basic level of stats she teaches, perhaps a bit too much review, but nothing to complain about.\nWorkload:\n10-20min a week. It's glorious. \n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "January 05, 2013",
            "review_content": "\nI took this course for a pre-med requirement and had no previous experience in Statistics. Professor Nicolaou taught very much so from a powerpoint presentation that she would upload the night before on courseworks. I found her lectures helpful as they clarified the harder parts of each chapter and gave specific examples that were similar to both homework and test problems. She sometimes used the lectures as review sessions to go over the more difficult chapters a second time. To do well in the class it is necessary to show up for all the lectures and read the chapters as well. Overall, it was a time-consuming class, but possible to get a good grade. \nWorkload:\nUsually 3-4 chapters completed a week. Time to read each all the chapters and do the problem set was probably about 12 hours. A problem set due once a week or every other week, where the answers can be checked in the back of the book (20%), one midterm that was very similar to the homework problems and examples given in class with one proof that she went over previously (30%), and the final which was similar to the midterm but longer (50%). Both the midterm and final had a few multiple choice, but were mainly short answer questions and we were allowed to make a formula sheet for both.\n"
        }
    ]
}