{
    "prof_info": [
        {
            "prof_name": "Peter Susser",
            "prof_id": 828,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Ear Training",
            "review_date": "December 09, 2010",
            "review_content": "\nSusser is the best teacher I've had in college. That's primarily because he actually TEACHES! He cares so much about his students succeeding and it shows. He explains everything beautifully and actually tells us WHY it's important to learn these things. He's so knowledgeable but, more importantly, uses his talent to create a classroom environment that is amazingly fun and worth going to every single time. Even if you aren't so musically experienced, TAKE THIS CLASS. He is truly phenomenal in every way. \nWorkload:\n3 non-cumulative tests (including final). Occasional small homework assignments. Relatively small commitment. \n"
        },
        {
            "course_name": "Ear Training I",
            "review_date": "August 02, 2010",
            "review_content": "\nDr. Susser, as you will read in other parts of this site, is a fantastic pedagogue.  His love of teaching and learning styles is unfortunately unmatched at this university.  Ear training is a tricky thing to teach but Dr. Susser gives somewhat helpful strategies and is open to hearing your ways of doing things.  Most of the students in this class had taken Fundamentals with him so there was a good rapport, but I got the feeling that it wouldn't be hard to build a good relationship with him from the outset.  The grading is overly tough for a 1-credit course, however, and if you don't know it, he'll know it.  Very valuable skill to have for the musically-inclined!\nWorkload:\n2 \"tests\" and 1 final.  The tests are based on the drills that you will be doing in class so there won't be any surprises, however, the skill level being tested is more advanced to prove that you have practiced out of class.\n"
        },
        {
            "course_name": "Fund. of Western Music",
            "review_date": "April 13, 2010",
            "review_content": "\nFirst of all: TERRIFIC! Definitely worth taking classes.\nI've had Peter Susser for two semesters and he is absolutely wonderful! Aside from the fact that his is both hilarious and brilliant, he cares about his students and his subject. One is never bored in his class, that would be impossible-- it's fun and always full of laughter. It is possible to feel overwhelmed in his class as the individual levels of people in music classes vary greatly, however he is always willing to answer questions as long as one speaks up. Don't be fooled by the lightheartedness of the class, he can be a harsh grader so it is necessary to study and pay attention.\n\nWorkload:\nFor Fundamentals: Moderate; weekly assigned exercises that he goes over in class. He calls on everyone so be sure to complete them. The tests come straight from the material in the homework. Three tests and a final all weighted equally.\nFor Ear Training: Light; as expected for a one credit course. \n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "May 10, 2006",
            "review_content": "\nI highly recommend Peter Susser as a teacher. He plainly loves both music and teaching and brings that joy to his classroom. He has a fantastic dry wit which made the class even more enjoyable for me. He would, for example, refer to the most famous composers (Bach, Beethoven, et al) as \"the dead Germans\". He is demanding but this is, after all, the Ivy League. If you hide in the back and don't raise your hand, expect him to call on you. If you attend each class and do the work diligently, an 'A' shouldn't be a problem for you, whether or not you have any prior background in music. He was available for office hours and was solicitous and helpful.\n \nWorkload:\nRelatively light but important to stay on top of it. Written exercises of various types plus theory homework. There were a couple of exams plus a mid-term and a final. Be careful as a couple of wrong sharps or flats on your test can add up and quickly cost you points. Great attention to detail is important. \n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "January 22, 2006",
            "review_content": "\nProfessor Susser does, indeed, have a great sense of humor and is truly interested in his students. However, the material introduced CAN BE deceptively difficult, and I think part of that can be blamed on the way it was taught ... though, in retrospect, I might have done better if I had completed ALL of the given assigments and gone to his office hours ... MAYBE ... but I'm still not convinced. I studied VERY hard and still wound up with a grade that I was not satisfied with.\nHis grading is absolute lunacy and is NOT made clear at the beginning of the semester (be forewarned, the final counts for 50% of your grade), which I think puts students at a huge disadvantage.\nWorkload:\n3 exams, all weighted evenly, and the final (worth 50%)\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "December 27, 2004",
            "review_content": "\nThe person who wrote the 9 December 2004 review took the words out of my mouth.  My sentiments about Susser EXACTLY--to the t.  After 8 years of being scared of music, thanks to Susser, I no longer find it intimidating at all.  And that's a liberating feeling.  I always knew that, no matter what the next new step was in the course, Susser would teach it in a manner that would be unbelievably easy to understand (and I was probably about the only one in class that had no music background whatsoever).  Do yourself a favor and take a class with him.  I don't think you'll ever find a music teacher that will come even close in comparison.  He's one of those rare professors that you'll change your major for just to learn from him.        \nWorkload:\nDaily assignments which you don't have to turn in but if you don't know much about music, do them.  That's the only way you'll keep up with the class.  2 midterms.  1 final.  All easy if you've done the homework and understand it.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "December 08, 2004",
            "review_content": "\nSusser was an absolute joy.  In a great mood every day, enthusiastic about the matierial, hilarious... I don't know what else to say.  His passion for music shines through and is infectious.  The story of how I came to take his class is slightly interesting.  I was in a physics class that I hated, but I couldn't drop it without picking up another class.  It wasn't past the drop deadline, but it was past the add deadline, so I had to get a form and all of that.  I was so nervous when I went to ask Professor Susser if I could join his class because I knew I would be stuck in physics for a year if he refused.  I went up to him to ask if I could join, and I said \"Are you Professor Susser?\"  He must've seen my \"Drop/Add form\" and before I could get out another word, he said \"Be a dear and hold my coffee for me, and just so you know, the answer is 'yes.'\"  I couldn't stop laughing as he joked while we filled out the form, and I'm sure my overwhelming joy at being added to the class was obvious.  This class along with lit hum has been my favorite of the semester, and I plan to take more classes in music because I had so much fun in this class.  I always left Professor Susser's class in a great mood, and I would recommend his class to anyone if you want to learn a lot about music theory (some describe the class as intense, I thought it was fine) and have a great time.\nThe best Susser quotes:\n\"I'm sorry, I just didn't hear you - no I think you said the right answer, I just couldn't hear you\"\nSusser: \"Someone give me a key, anybody\" voice from the class: \"F#\" Susser: Evil look\n\"While you take the exam, I'm going to take a nap here at my desk.  Turn your papers in when you're done.\"\nVarious hilarious side-stories about his favorite composers and whatnot.\nWorkload:\n He assigns a lot of homework but never collects it, the exams are very fair and sometimes take-home.  He does call on people a lot during class, without warning, but don't let that dissuade you from taking the class.  He is never mean about it.\n"
        },
        {
            "course_name": "Fundamentals of Music",
            "review_date": "November 28, 2004",
            "review_content": "\nHes a good teacher - goes very slowly for those who have never touched music before. His teaching style consists of blackboard demonstration and a lot of calling on people - if you take him be prepared to answer questions often.\nWorkload:\nPractically none - some is assigned but unless you know little or no music theory theres no need to do it\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "July 01, 2003",
            "review_content": "\nPeter Susser is a fantastic teacher. Though it is a little awkward at first, his dry wit and sarcasm will eventually endear you to him like no other professor. His love of music really shows through, and while he does take a drill sergeant approach, he is willing at any moment to stop and be exceedingly patient and take as much time as need be to explain/demonstrate. He cares a LOT; he will not let you go on without understanding what he's teaching. It's hard to find a professor both so entertaining and engaging--just wait for the minuet, where he makes you dance!\nWorkload:\nThree tests, a final. Homework is not collected, though it very much helps.\n"
        },
        {
            "course_name": "V1002 Fundamentals of Western Music",
            "review_date": "April 03, 2003",
            "review_content": "\nProf. Susser can be a little  intimidating and a bit scary to those who know little to nothing about music theory.  Fundamentally, the course is not a fundamentals course, but rather an intense examination of music theory.  Prof. Susser presents this dry material often in a witty way, but be prepared.  If  he calls on you, and you don't know the answer, you will be scorned with  three words.  \nWorkload:\nMid Term, Quizes, Final\n"
        },
        {
            "course_name": "Diatonic Harmony & Counterpoint",
            "review_date": "November 25, 2002",
            "review_content": "\nIt's a shame that Columbia doesn't appreciate Susser, because he's fantastic!! I've heard mixed things about how he teaches chromatic, but he's the best for diatonic. Right now, he's only teaching Fundamentals, which is a shame, because he's the only reason I don't hate theory and everyone should get to benefit from him. He sometimes makes the work really easy and sometimes he unnecessarily complicates it, but in the end, you find yourself amply prepared to do advanced theory and compose on your own. We need to send around a petition to get him more classes. He's always ready to meet with people outside of class and he'll check over the drafts of your compositions if you ask him. I give him an A. \nWorkload:\nNot hard, but you have to stay on the ball. Falling behind in music theory's like falling behind in math- it will screw you for the rest of the semester. But if you show up and hand in assignments on time, you're guaranteed no lower than a B+.\n"
        },
        {
            "course_name": "Harmony and Counterpoint (Diatonic/Chromatic)",
            "review_date": "May 05, 2002",
            "review_content": "\nBasically, when taking the music theory sequence, there will always be two choices of professors. If you aren't just taking the course to get it out of the way, take Susser's course! I know a few that quit his class because of his antics, but anybody who has any interest in music theory and analysis (and doesn't mind participating occasionally in class) should love this guy. The course material is pretty standard, but he is an excellent instructor. It's like having a private lesson in theory twice a week. He has his own approach to music, but he doesn't force it down your throats. And he's not a sticklor for policy. For a class of twenty-five, I have never gotten so much personal attention from an instructor. And of course, he knows his stuff!\nWorkload:\nVery minimal. Midterms and finals are almost always take home. Two or three written harmonization assignments (only takes an hour or two). If you don't sleep in class, you'll do fine.\n"
        },
        {
            "course_name": "Fund. of Western Music",
            "review_date": "May 03, 2002",
            "review_content": "\nProfessor Susser is honestly passionate about music, and his knowledge of complex music theory and meaning in music is obvious in his classes. He has a dry sense of humor; though quite enjoyable, and he is overall a very positive and caring teacher. I went into Fundamentals having studied 6 years of violin when I was younger, and having studied voice for about a year. The pace of the material was insane, and despite the title of the course (which made it seem like it would be just basics), it went very in-depth into music theory. Very little actual music was played (he'd sometimes illustrate theoretical concepts on the piano), and music dabblers might find this approach to be a little out of reach. Overall, the course taught me a lot, and though many who'd consider taking it because of a basic interest in music would struggle, I think the payoff would make taking this course worthwhile. \nWorkload:\nA lot of homework never checked. 3 or so quizzes and a take-home final. Very in-depth material that if not studied, classes will be impossible to follow!\n"
        },
        {
            "course_name": "Fundamentals of Western Music V1002",
            "review_date": "April 09, 2002",
            "review_content": "\nPeter Susser is the best teacher at Columbia, no question. I entered the class as a junior interested in pursuing a music concentration, but without any background in music (save piano lessons at an early age). On the first day of class, after asking questions about students' experience with theory and instruments, Peter realized that I was the only student without any previous theory training and did not play an instrument. He dedicated the course to me. I flourished. His eccentric humor and witticisms never cease to bring laughter to the classroom and his unconventional techniques of teaching theory are helpful for students of all backgrounds. Out of class, Peter is just as down to earth and kind. What a mensch! I love Peter Susser. I'm sorry, I couldn't hear you... could you repeat that please? I love Peter Susser.\nWorkload:\nMidterm and Final (easy if you study) and a few homeworks.\n"
        },
        {
            "course_name": "Fundamentals",
            "review_date": "March 26, 2002",
            "review_content": "\nPeter is an extremely witty and engaging teacher. He comes up with amusing anecdotes and has interesting views towards music and theory. I felt incredibly enlightened by his class, but I think only becuase my theory background isn't very strong. I agree with one of the other posters though. If you don't have some sort of background, it may be difficult to follow in this class because so many other students in the class are either very serious about music and/or have a relatively decent background in it. He does have a tendency to call on people so its pretty important to keep up with the material.\nWorkload:\nHomework and creative excercises that are never checked or collected but are important to be done in order to keep up and avoid the embarassment of getting called on and not knowing the answer! One (?) midterm and a final exam are given.\n"
        },
        {
            "course_name": "V2318-V2319 Diatonic Harmony and Counterpoint",
            "review_date": "December 31, 2001",
            "review_content": "\nSusser is an OK guy to take Diatonic with. The course began with a few weeks of strict 15th century counterpoint. You learned a lot of rules that you basically won't be expected to follow anywhere else, luckily the second half of the first semester was spent on something a bit more interesting, mostly writing and analyzing four-voice compositions. Not the most interesting class, but if you're going to be a music major or minor, you'll have to bear with it.\nWorkload:\nFairly light. Only a few graded assignments (compositions), and a take home final. No midterm.\n"
        },
        {
            "course_name": "V1002 Fundamentals of Western Music",
            "review_date": "December 15, 2001",
            "review_content": "\nAiiiieeee! A lot of the kids in my class had already had tons of experience with music theory, so they, of course, found it easy. I'm a singer, so I didn't [and still don't to some degree] know what the hell I was doing. A lot of times, the professor would go around the class giving verbal pop quizzes: \"Bobby, we're in Eb major. Can you give me a dominant seventh chord in second inversion?\" When he got to me I would always want to crawl under my desk, because I didn't know the answers off the top of my head. Let's just say that if you are not a music theory buff before you take this class, it is going to be slightly intimidating. I seem to be doing okay in Diatonic, though, so I guess it was worth it.\nWorkload:\nHomework that he NEVER collects. He gives a couple of quizzes/tests during the semester that you CANNOT screw up because they make up your grade. Oh yeah, and the final. I think I chewed off all my nails and some of my hair during those three hours, but that's just me.\n"
        }
    ]
}