{
    "prof_info": [
        {
            "prof_name": "Lucy Creagh",
            "prof_id": 1943,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 06, 2004",
            "review_content": "\nThe class went by mostly painlessly, and I aborbed the relevant details about what images are on the upper walls of the parthenon, the structural lines that Raphael was thinking about when he painted, and some biographical information about Goya, and in the end, I did pretty well in the course.  But, I left with a pretty bad taste in mouth.\n  What it may come down to is a mere clash of personalities, but nonetheless, I thought I'd voice my opinion.  I found Creagh to be an unfriendly, arrogant, and overall, quite unpersonable as an instructor.  In a different setting, where the material itself is emphasized (ie, if we were meant to be learning ABOUT art, as opposed to learning about HOW to look at art) such arrogance and coldness would have gone by, for me, unnoticed, or at least would not have really changed my view on the course overall.\nBut, in a class like ARt Hum, where the level is neccesarily basic and introductory, where the 'correct' and sublimely interesting answers to questions posed in class are things like; \"because the columns go up and down,\" or, \"she's pointing up, to god,\" or \"his arm is longer than it should be\", in a class like this, personality, a sense of humor, and friendliness on the whole, seem like crucial elements. \n  Maybe it isn't fair to blame Creagh for her rudeness, and her generally frigid demeanor.  She may very well have no interest at all in being an educator.  She may hate teaching.  She may hate dealing with undergraduates who don't know art history, and who don't know why it's important to know.  Fair enough.\nBut, this is a culpa review.  So, I'm telling you;\nIt's not about unfair grading, or boring lectures, or unfamilarity with the material...\nit's about charisma, and for me, this lady had very little.\nWorkload:\nmidterm, final.  both were a little tricky...don't underestimate the value of studying and especially, of doing the readings before exams.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 16, 2004",
            "review_content": "\nLucy made Art Hum an enjoyable experience.  In fact I had such a good time taking this course that I can easily say it's the best core class I've taken, and one of the best I've had overall at Columbia.  She really knows her stuff about the the artists and architects (her background is in architecture).  Her lectures were packed with interesting slides of the artists' works and the best part is that she actually let the students make most of the comments about the art.  She constantly asks the class for their thoughts or ideas, and seems to genuinely appreciate different student perspectives.  Like other good Art Hum teachers, Lucy also made the class take advantage of NYC's resources.  At the beginning of the semester she took us on a class field trip to the Cloisters, and then 2 out of our 4 individual papers also required going out to art museums (Met, Frick, MoMA).  Her grading on papers is not terribly difficult, at least not after you learn to do formal analysis - which she will teach you.  The midterm and final were also straightforward if you payed any attention at all during class, but be sure to spend some time memorizing key dates before you take the exams.\nWorkload:\nmidterm, final, sketchbook that is collected but does not seem to affect your grade, and 4 papers: a 2 pager on Columbia's architecture, 4 pgs. on your individual field trip, 3 pgs. on a personal field trip to a common work of art for the whole class to analyze, and 4pgs. on Le Corbusier's architecture\n"
        }
    ]
}