{
    "prof_info": [
        {
            "prof_name": "Paula Harper",
            "prof_id": 13032,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 04, 2015",
            "review_content": "\nPaula is a wonderful Music Hum teacher! If you're lucky enough to get into her section, don't switch out because Paula makes Music Hum fun, engaging, and clear. The highlights of the semester include in-class guest performers (her graduate student friends), baked goods, fun YouTube videos, and a unique off-campus music experience/obligation. Paula knows her stuff about music and will definitely show you a good time throughout the semester. \nWorkload:\n8 in-class quizzes (10 minutes to answer 4-5 short questions), 4 short papers (2 two page papers, 1 one page paper, 1 five page paper), 1 final that is basically 10 in-class quizzes stapled together. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 12, 2014",
            "review_content": "\nPaula taught music humanities for the first time this fall and was absolutely incredible. She understands that the core forces us to do things with breadth over depth but to make everything more interesting she only goes through one or two pieces of music each class to allow for enough depth to have fun with each topic. Her enthusiasm was what made the class the easiest to deal with, and when she wasn't particularly enthusiastic about a specific topic she made sure to bring in one of her musically inclined friends that was (she couldn't play the piano for our Romatic Piano class, so she brought in a friend who was obsessed with and could play Debussy beautifully, for example). It was also great that she was able to combine her enthusiasm for the music with some critical discussion about why we study the Western Canon and old white men in general, which I don't think can be ignored when you're teaching a class like this. \nWorkload:\nFour papers, two fun ones that were \"name a piece of music you like/name a piece of music you don't like and use musical terminology to describe why,\" one based on a concert and one short reflection. Weekly listening quizzes that were easy but helped us study/learn the pieces we were doing. Pretty lenient grader. Minimal reading. No midterm!!!\n"
        }
    ]
}