{
    "prof_info": [
        {
            "prof_name": "Walter Johnston",
            "prof_id": 11363,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English (Workshop): Legacy of the Mediterranean I",
            "review_date": "January 11, 2012",
            "review_content": "\nProfessor Johnston was a great although inexperienced professor. His goal was to teach us to write at a college level, and I think he succeeded in his goal. I came away from this class with a much better understanding of how to do a close reading of text and utilize it in a paper. I also really enjoyed the texts we read, although I was frustrated that in some cases we only read selections from the books, not the entire things. Professor Johnston was very good at moderating our discussions and keeping them on track, and seemed well-versed and knowledgeable about the information. In particular his knowledge of philosophy and art helped to make our discussions of the text even richer. One of my favorite instances in class was when he invited a friend of his from Princeton to come and give us a guest lecture about architecture in The Aeneid.\nHowever, Professor Johnston was not perfect. Towards the second half of the semester he was continually late to class, a couple times by more than 15 minutes. Also, his feedback on papers was often very difficult to read and attempting to meet with him in office hours was a little hectic since he has to hold them in Liz's Place because his adjunct's office is very small. Some girls in the class felt like he was unclear in explaining how to do close reading and felt frustrated by how he graded their papers but I didn't really have the same experience. Also, he took four weeks to turn in our grades for the class (he turned them in yesterday), which seems a little excessive to me given that we handed in our final papers on the 19th of December and we didn't have any final exams.\nI think as Professor Johnston gains more teaching experience these flaws will iron themselves out and those who take his class in the future will find if they work hard and pay attention they will have a rewarding experience.\n\nWorkload:\n1-2 books per week with c. 100 pages assigned per class. At the beginning of the semester each student picked two class days and had to prepare an in-class presentation of the assigned material for that day. (If something came up Professor Johnston was very reasonable about allowing students to switch days) Two 5-page papers and one 10-page paper with rough drafts due a week before the final draft and an opportunity for in-class workshopping.\n"
        }
    ]
}