{
    "prof_info": [
        {
            "prof_name": "Virginia Oliveros",
            "prof_id": 3253,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 22, 2008",
            "review_content": "\nHonestly, I didn't think she was that great. She is a nice woman, and she obviously knows Latin American politics. Unfortunately, she didn't really know all of the subjects we'd discuss which led to slow and mostly uninteresting \"discussions.\" She's be late a lot, and much of the class was spent just listening to her accent which was really cool. I really liked Virginia and she was a fair grader; she's just not spectacular. \nWorkload:\nManageable set of readings, somewhat odd midterm and final and horrible final \"research proposal\" paper which was graded by a different TA.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "June 17, 2008",
            "review_content": "\nVirginia was very helpful and entertaining.  She was able to get across the important concepts and answer difficult questions.  She is very knowledgeable of Political Science, especially Latin American politics.  I liked that she would give her honest opinion about the readings, especially when they were poorly structured or overly simplistic.  I felt that we achieved a lot in most of the 50 minute, weekly discussion sessions (except for the one after we got back midterm grades, which was PAINFUL, due to several irate students).  \n"
        },
        {
            "course_name": "Latin American Politics",
            "review_date": "May 14, 2007",
            "review_content": "\nOne of the most engaging TAs at Columbia.  She is very passionate and knowledgeable about Political Science, and this passes on to the students (even to the most disaffected ones).  If you happen to have her as your TA, do the readings and she'll go out of her way to help you understand the material.  Then she always offered her own insights on class topics, which were always very interesting.   \nWorkload:\nThis class: two 6-page paper and a final.  \n"
        }
    ]
}