{
    "prof_info": [
        {
            "prof_name": "Eleni Nikitopoulos",
            "prof_id": 2809,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 13, 2011",
            "review_content": "\nFrontiers of Science isn't exactly the best class out there in the core, but Eleni made it bearable. She's very thorough in reviewing the lecture material and she tries her best (within her knowledge) to answer our questions.  The activities during discussion section are pretty useless in my opinion, but she made it as interesting as she possibly could have. She also puts in a lot of effort to really engage the students during discussion. I remember on the first day of class, she somehow had all of our names down... Overall, I think I got away with a generally positive experience of Frontiers of Science because of the fact that I was fortunate enough to have Eleni as a discussion leader. \nWorkload:\nThe same as any other section: 1 WIA a week (they're pretty much busy work, although if it's confusing to you, I've heard that the help rooms basically guide you through everything) and the dreaded term paper (2200 words)\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 04, 2010",
            "review_content": "\na charming woman\nfrustrated with apathy\nclass can be boring\nAs someone who didn't like the Frontiers of Science of curriculum very much, I think Eleni did a good job in at least attempting to elicit some excitement in my section. She did get a bit unhappy with us when she noticed how many of us were not going to lecture and showed that frustration in a very lecture-specific quiz once, but otherwise she is mostly nice and will laugh along with the humor directed towards Frontiers. She was understanding when it came to assignments, letting us turn in WIAs on Fridays instead of at seminars on Wednesday. She does have a passion for science which shows when she mentions her research. It was only that the structure of Frontiers sections was dry, and we rarely went beyond the lectures or the readings in the topics. I wouldn't be too concerned of doing badly even if you aren't a science person. Eleni is competent and is quite willing to be helpful outside of the classroom, and she sincerely wants each student to do well. \nWorkload:\none WIA/week (take about thirty minutes at most), in-section activities\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "September 25, 2007",
            "review_content": "\nThis is a little late because I had Eleni a while back. If you hate Frontiers of Science or if you have trouble understanding the material, being in Eleni's class will surely make it worse. Although she is a very nice person, she (like most of the Frontiers section leaders) knows nothing about the material being taught in lectures. She mostly cannot answer anyone's questions and always promises to look them up for next week, which she never does. I think she realizes that Frontiers is on the most hated list, so she does attempt to liven up class sessions with little activities (some in groups) that keep people from falling asleep. If you don't participate, she will harass you with her niceness in an attempt to salvage your grade (I realize this doesn't sad like a bad thing,  but believe me, it gets old fast). If you're lucky, you'll get a class in which a third of the people are snitty little compulsive talkers who dominate the class and distract her for an hour. Or maybe you are that person; in which case, the rest of us dearly thank you.\nWorkload:\nweekly problem sets, weekly questions and postings, lots of articles to read, small in-class and out-of-class group projects, and class participation (or she will try to force it our of you)\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 15, 2006",
            "review_content": "\nEleni is a very smart woman and the course is interesting with her.  However, she is a terrible grader who takes frontiers way too seriously. She gave out very few A-'s, especially to those students who aren't interested in the sciences. I received mostly A's and A-'s on all my discussion questions and WIAs and somehow i still managed to get a B+ in the class. Altogether, she takes the course way too seriously and gives out incredibly low grades considering this is a required course that few people want to be taking. \nWorkload:\nher WIA's and DQ's tend to require more work than other frontiers professors...and she grades very strictly on them, so you have to put in alot of time \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 12, 2006",
            "review_content": "\nEleni is awesome. She is very helpful and understanding. Definitely go to office hours if youre stuck on something. She is a very fair grader and you get what you put in. Just make a little effort and she will recognize it. Skim most of the readings, she likes to call on random students and ask them to comment. If youre lucky enough to get her, FOS will be as bearable as it can get.\nWorkload:\nweekly problem sets, weekly reading assignments, and the final which she thouroughly prepares you for.\n"
        }
    ]
}