{
    "prof_info": [
        {
            "prof_name": "Harald Sundt",
            "prof_id": 12751,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 18, 2014",
            "review_content": "\nI'd heard a lot of negative opinions about University Writing, but since everyone must take it, whattayagonnado?\nThis class will improve your writing exponentially. The syllabus is straightforward - read some literary articles, write some journals about them, come up with your own idea to enter the conversation, and write, write, write. That's going to be everyone's experience, regardless of the instructor. \nOn to Harald Sundt: Wonderful human being. Hal showed a genuine interest in each class discussion. He was very gracious working with the \"class mind,\" and had a keen ability to ensure clarity on participative input before moving on. Having spoken with many students in other UniW classes, I can say that Hal is a gem. Understandably, the UniW instructors are grad students, each working on their respective studies, so they have to balance their instructor time with their own study, and I could see if you ended up with a selfish instructor, you'd be screwed. This is not Hal Sundt. \nOf course, the instructor should have frequent office hours, but Hal went above and beyond to ensure that each student was offered a personal coaching/editing session in addition to regular office hours, that coincided with each draft stage. By the time final drafts were due, each student should have been extraordinarily confident they had received enough guidance from the instructor to land a decent grade. \nLast thing: I had a fairly extensive background in writing prior to this course, but not this \"literary\" kind of writing. More so, I believe the course taught me more about reading, and how to disseminate and digest complex pieces, then develop my own opinion. \nWorkload:\nFour writing progressions, each varying in length from 750-3,000 words. Lots of drafting. Homework for each class. Lots of reading. Huge effort is required to get an A, but it is possible. \n"
        }
    ]
}