{
    "prof_info": [
        {
            "prof_name": "Catherine Roach",
            "prof_id": 3106,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 06, 2007",
            "review_content": "\nThe previous review, by way of fulmination, makes a few factual observations:\n1) She did put up images and ask us what we thought about them with the intent that we say what we thought about them.\n2) She did lock the door once class started. On one occasion a student on crutches arrived late, for whom she realized she needed to make an exception.\n3) She mostly avoided sharing her own opinions and positions, especially before we'd vocalized ours.\nI agree with these factual observations. I disagree with the conclusions drawn.\nShe explained her rationale for (2) at the beginning of the semester -- that class time is valuable, particularly so for this type of class, and it's not fair to waste others' time -- and I appreciated being treated like a grown-up. I was late once. Felt like an idiot. Didn't make that mistake again.\nCome to think of it, I also appreciated (1) and (3) for the same reason. Sometimes it annoyed me that she wouldn't tell us what she thought; more often it annoyed me that she wouldn't dangle the conversational carrot a little lower; always I wound up being glad, in the end, that we'd been forced to find our own way out of the wilderness. The primary goal of Art Hum is to teach us to speak intelligently about art whenever we come across it. We practiced this every class session. That's good teaching.\nI found Catherine highly conscientious in her approach. She quietly succeeded in raising my level of discourse about (and interest in) art.\nWorkload:\ntwo 2-pagers, two 4-5 pagers\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 26, 2006",
            "review_content": "\nWhat an idiot. Her idea of fostering class discussion throughout the semester was throwing up an image and saying: \"what do you guys think about that?\" Our motley crew somehow managed to overcome this abortive approach to teaching and strike up our own conversations, no thanks to \"roach.\"\nWhat else can I say about her non-teaching style? Oh yes, remember not to show up more than two minutes late otherwise she locks the door and doesn't let you in. \"The ship has sailed,\" she once remarked when a student on crutches was banging and yelling for her to open up.\nWhat a hateful woman. Ask her to explicate her own position on anything and she stares blankly before telling the class that there's \"no time\" for her opinions. Don't allow \"roach\" to crawl into your life.\nWorkload:\ntwo papers; midterm; final. she's a moron the whole way.\n"
        }
    ]
}