{
    "prof_info": [
        {
            "prof_name": "Jenna Lawrence",
            "prof_id": 4424,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Behavioral Biology of the Living Primates",
            "review_date": "December 25, 2016",
            "review_content": "\nI took Professor Lawrence's primates class last summer and absolutely loved it. I am not a science person at all, so I took this class purely for a science requirement. Let me say that this was my favorite class that I've taken at Columbia, and Professor Lawrence is one of my favorite professors. She is an incredible lecturer, and the 2-3 hour classes were easy to sit through because of it. (Note 2-3 hours - many of the classes did not go the entire 3 hours, and the lecture portion did not usually exceed 1-1.5 hours if I remember correctly.) She delivers the information very clearly, and as long as you write down what she says and pay attention in class you should have no problem getting an A. I, like most others, did not do well on the taxonomy quiz. However, it's not worth a whole lot, so don't worry if you don't do well - you can still get an A. Oh, and before I forget, YOU DO NOT NEED TO READ THE TEXTBOOK. Just go to class and take notes (on the movies too since she always includes a question on exams about the movies) and you'll be fine. I wish every class was like this class, and every professor like Professor Lawrence. She is so much fun and extremely approachable, and a great lecturer to boot. Bottom line is you should take this class regardless of whether or not you like science or primates.\nWorkload:\nPretty light for a 5-week intensive. Go to class and take notes, and study, study, study those notes for the 2 exams. 1 taxonomy quiz as well that's not worth much. A final presentation on a primate of your choice (make it fun and choose something you're interested in - research might take a while, but if you're interested in it it's not that bad). She said she preferred if we presented \"well\", so just do your best, but if you're not a good presenter and have to read off your cards don't worry, she won't penalize you for that.\n"
        },
        {
            "course_name": "SEE-U",
            "review_date": "June 30, 2013",
            "review_content": "\nI love you Jenna! I love you Jenna! I love you Jenna!\nSEE-U Jordan is the best experience in my life! Yes, I am not reserving these big words to describe how much I learned and how much fun I had. \nI am not even providing any evidence to convince you. I am just here to say she is THE BEST. Not to spoil it. you should experience it yourself. This is the first review I wrote and I am just here to say \"I love you Jenna!\"\n\nWorkload:\n6-7 quiz\n1 research proposal\n1 final presentation\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "August 13, 2011",
            "review_content": "\nJenna is the most amazing teacher.  Everyone in my class absolutely LOVED her.\nI just finished the CERC Punta Cana summer session with her and had a fabulous time.  She is so passionate about the material she is teaching that she makes science engaging for all students- even kids who were not even remotely interested in science at all.  Not only do you learn A TON in her classes but she makes everything so enjoyable!  \nI have never written a review before but I loved her so much that I want everyone to recognize how great she is.  I literally cannot say enough good things about her.  \n-organized classes\n-cute sense of humor\n-great for extra help\n-AMAZING person with the coolest life experiences/great attitude towards life in general\nTAKE HER CLASS IF YOU CAN!!! <3 \n\nWorkload:\n-daily quizzes on class lectures\n-final research project on topic of choice including a submitted proposal, draft, and presentation \n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "January 03, 2011",
            "review_content": "\nJenna is by far one of the most adorable and enthusiastic professors whose passion for biodiversity you will feel during the entire semester. As a CC student who has some high school background but no love for science, biodiversity was the perfect class to fulfill my science requirement. \nLectures are really entertaining as Jenna shows us lots of interesting/cute/weird pictures and videos to illustrate the concepts she's covering. Definitions and explanations are not fully written on the slides and most of the examples that she mentions during lectures - and which you need to know for the exams - are not mentioned in the books. But she often spends a lot of time repeating and re-explaining some concepts that you might have learned in AP bio to make sure that everyone understands everything. \nThe first half of the semester covers the description of all species and life on Earth and there's little to no reading to do. The latter half of the course, however, focuses on genetics, genetic diversity and species diversity, and there is some reading to do but it really isn't necessary to understand what's covered during lecture. Thank god the final was not cumulative because I really didn't feel like memorizing all types of species that existed on Earth again. But overall, this was an enjoyable class and as long as you provide the effort to go to class and memorize the definitions/species, you'll be fine. \nWorkload:\n1 midterm (multiple choice, short/medium answers), 1 non-cumulative final (short, medium, long answers) \n"
        },
        {
            "course_name": "SEE-U",
            "review_date": "November 17, 2010",
            "review_content": "\nThe Summer 2010 Dominican Republic SEE-U program differed drastically from previous years as it was truly an amazing experience.  Although I heard several horror stories about past iterations, a new instructor, Jenna Lawrence, took over the reigns.  She truly made the program special. \nJenna was very well-prepared and came into the program with an interesting -- yet fun -- lesson plan.  Monday through Friday, we had lectures from 10-1, and then participated in field work from 2-4/5 (ex. snorkeling to retrieve algae samples, observing wildlife, analyzing data, etc.).  I find Columbia's professors to be brilliant, wonderful researchers... but too often I find them to be horrible lectures.  Jenna breaks this mold: not only is she clearly brilliant, but she is vivacious and manages to introduce a great deal of information in a very approachable manner (I left each class with 8+ pages of typed notes).  Do realize that this information is not simply throw-away knowledge as we were quizzed almost daily.  These quizzes were short as they were only 5 questions, give or take; however, anything covered the previous day was fair game, so I easily spent 2 hours a night reviewing.  We also were required to complete an individual project which consisted of writing a research proposal, conduct field work, and then present our findings to the class (PowerPoint presentation).  \nDon't get me wrong -- this program was not all-work-and-no-play.  The ecological foundation is on the grounds of the Punta Cana Resort and Club, and we were able to enjoy the offerings of the resort such as hanging at the pool, sea kayaking, wind surfing, snorkeling/diving, nearby horseback riding, tennis, golf, etc.  \nThere are, however, a couple non-academic downsides to this program.  You spend 5 weeks living on top of each other, so it's absolutely a test of one's patience (try being with ANYONE 24/7 for 5 weeks and see if you don't get ornery).  The food is incredibly repetitive and you WILL develop cravings.  And, remember, Dominican summers are hot and humid.  Prepare to sweat.  A lot.\nIn summation, this is NOT your typical science course.  If you are an upperclass science major, this may not be your cup of tea.  If you are looking to fulfill your Core science requirements, I cannot think of a better way of doing it... at least as long as Jenna Lawrence is involved.\nYou will have fun.  You will learn a lot.  And you'll probably come back with quite the tan.\n\nWorkload:\nDaily quizzes; 8-10pp project proposal; 20min final presentation.  Be prepared to spend quite a bit of time on your individual projects.  Work hard and you will do well.\n"
        }
    ]
}