{
    "prof_info": [
        {
            "prof_name": "Samantha Chanse",
            "prof_id": 10798,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 25, 2011",
            "review_content": "\nUniversity Writing is one of those dreaded courses required of all Columbia students. Escaping it is unfortunately impossible. At first, I really enjoyed Samantha's class. The writing workshop style class is a nice change of pace from Lit Hum and the class goes by really quickly; however, as the class progresses, it slowly becomes really, really annoying.\nSamantha tends to be very vague about what exactly is expected for the essays, so the first essay for most students is a massive letdown. She is available for conference; however, she is extremely limited in how much time students can meet with her. She might be better now since she works in the writing center. Her feedback is good; however, her grading is not consistent with her comments. She tends to grade lower than what her comments project.\nUnlike many teachers of UW, she is a stickler for following the rules of the \"lens essay.\" To be honest, I have yet to ever use it, and I believe it is a stupid method of writing.\nWorkload:\n- good amount of work\n- four essays\n- writing assignments due during each class\n- no final!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 15, 2011",
            "review_content": "\nSam is a really great, inspired, and inspiring teacher. She is very intent on having us get something out of the class. She is tough with her workload but you certainly come away with a lot from the class. She is very personable, young, and funny. I rate her a 4/5. She also is an editor at the Writing Center so you can get your work checked by her before you turn in your papers, and she is happy to do so.\nWorkload:\nHigh workload, many written assignments handed in and many steps to a final paper are required to hand in\n"
        }
    ]
}