{
    "prof_info": [
        {
            "prof_name": "Joanna Smith",
            "prof_id": 486,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 12, 2007",
            "review_content": "\nI took Art Hum with her last spring (2007).  Let me say, she was amazing.  I am not the art-type, I had absolutely NO desire to take the class and go on the museum visits, etc. and managed to get an A- doing little work\nHowever, as the semester went on I actually managed to enjoy the class (except for drawing Low Library in the freezing cold).\nGoing to class is a must - you *need* her comments on the paintings to make studying for the exams easier - also - make yourself flashcards for the exams - know the names, dates, etc. for all paintings.\nWorkload:\nNO daily homework assignments/readings; 5 short (2-3 pg) papers on museum visits - literally took me a couple hours for the visit and the paper)\nExams: 1 midterm/1 final - not cummulative - she gives you the exact format/scoring ahead of time - I found the final much more difficult because there were many more dates to remember - If I had the class to do again I would have studied them as we went along (you can't learn that many dates in a night or two without getting confused)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 12, 2007",
            "review_content": "\nI took Art Hum with her last spring (2007).  Let me say, she was amazing.  I am not the art-type, I had absolutely NO desire to take the class and go on the museum visits, etc. and managed to get an A- doing little work\nHowever, as the semester went on I actually managed to enjoy the class (except for drawing Low Library in the freezing cold).\nGoing to class is a must - you *need* her comments on the paintings to make studying for the exams easier - also - make yourself flashcards for the exams - know the names, dates, etc. for all paintings.\nWorkload:\nNO daily homework assignments/readings; 5 short (2-3 pg) papers on museum visits - literally took me a couple hours for the visit and the paper)\nExams: 1 midterm/1 final - not cummulative - she gives you the exact format/scoring ahead of time - I found the final much more difficult because there were many more dates to remember - If I had the class to do again I would have studied them as we went along (you can't learn that many dates in a night or two without getting confused)\n"
        },
        {
            "course_name": "Introduction to Archaeology",
            "review_date": "December 19, 2004",
            "review_content": "\nIf you're coming into this class with an interest in archaeology already, you'll appreciate Prof. Smith's in-depth studies of ancient sites around the world.  If you've never thought about or had any interest in the subject, you may actually find some interesting tidbits in the course to spark your curiosity.  The typical class each day consisted of a lecture with slides (which may or may not work) and note-taking.  \nProf. Smith can sometimes rush when spelling hard or drawn-out names--try Yak' K'uk'Mo' and Shihuangdi on for size--so you may need to ask her to repeat herself, but she tries to make the subject fun for everyone in the class, not just future archaeology majors.  On many days she brought in artifacts from the arch lab that we could touch and pass around, which helped a great deal in connecting what we were learning about to reality.\nShe's quick to answer questions, and clearly understands her field well.  She tries actively engaging everyone in the class, so it doesn't seem like \"just a lecture course\".  Her grading is fair, almost generous, so long as you show you put effort into your work.  I would definitely recommend taking this class with her.  A quick warning: if you're tired before the class starts, bring coffee--it's just too tempting to close your eyes even for a second in the dimly lit room, and not even an interesting lecture can fight that!\nWorkload:\nFairly standard: one midterm, one final, one paper with a five minute poster presentation, and a mandatory class field trip to a museum.\n"
        },
        {
            "course_name": "Introduction to Archaeology",
            "review_date": "November 16, 2003",
            "review_content": "\nThis class I think was brand-new in 2002, and was completely the creation of Prof. Smith, so it was really not like the other archaeology lectures at Columbia like Rise of Civ.  The pace and material were confusing at times, but I think that it was mostly because we were the guinea-pigs in a new course experiment.  There was a lot of information to process, and wierd names and theories, but the lectures laid those out pretty well.  The big problem was the main textbook, by Ranfrew and Bahn, which was huge, dense, and incomprehensable.  That book was the bane of my existance!  The exams were long but pretty straight-forward, only the keywords were a little vague but there was plenty of choice of which ones to do.  One cool thing was that we got taught how to read and decipher ancient writings like the cuneaform and maya and egyptian signs.  Also instead of recitations we had some field trips with the TA, to places around the city that we wanted to see.  Prof. Smith let us go into her lab next too the classroom and showed us how to work as an archaeologist, and she also brought us cool things to class.  Her lecture style is pretty flat but you can usually follow along unless you are already tired, in which case you're asleep pretty quick.  The TA was nice in helping to catch up, though.  For the end of the class we were all supposed to do posters like we were at a real Archaeological conference thing, but some people did these third-grade loser posters which gave some of us a good laugh, even if we still had to listen to their bad presentations.  Overall a good class, I would probably take it again.\nWorkload:\nLots of dense readings, no section, few optional fieldtrips, a long midterm and final, a paper that we then turned into posters\n"
        },
        {
            "course_name": "Introduction to Archaeology",
            "review_date": "November 16, 2003",
            "review_content": "\nThis class I think was brand-new in 2002, and was completely the creation of Prof. Smith, so it was really not like the other archaeology lectures at Columbia like Rise of Civ.  The pace and material were confusing at times, but I think that it was mostly because we were the guinea-pigs in a new course experiment.  There was a lot of information to process, and wierd names and theories, but the lectures laid those out pretty well.  The big problem was the main textbook, by Ranfrew and Bahn, which was huge, dense, and incomprehensable.  That book was the bane of my existance!  The exams were long but pretty straight-forward, only the keywords were a little vague but there was plenty of choice of which ones to do.  One cool thing was that we got taught how to read and decipher ancient writings like the cuneaform and maya and egyptian signs.  Also instead of recitations we had some field trips with the TA, to places around the city that we wanted to see.  Prof. Smith let us go into her lab next too the classroom and showed us how to work as an archaeologist, and she also brought us cool things to class.  Her lecture style is pretty flat but you can usually follow along unless you are already tired, in which case you're asleep pretty quick.  The TA was nice in helping to catch up, though.  For the end of the class we were all supposed to do posters like we were at a real Archaeological conference thing, but some people did these third-grade loser posters which gave some of us a good laugh, even if we still had to listen to their bad presentations.  Overall a good class, I would probably take it again.\nWorkload:\nLots of dense readings, no section, few optional fieldtrips, a long midterm and final, a paper that we then turned into posters\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 10, 2003",
            "review_content": "\nProfessor Smith may not be the most dynamic prof in the world, but she is knowledgable and very fair.  She understands that this is a required course, and enrolling in it doesn't mean you are \"into\" art.  She respects everyones' comments in class, even if what they say is not at all what she is looking for.  She makes herself available outside of class and answers email quickly.  Note\nto varsity athletes in this class: if you are in season, and your \"off\" day is monday, you will have problems finding time to get to the Met (which is closed only on Mondays), which you have to do 4-5 times for this class.\nWorkload:\nMidterm, final, 5 short (2 page) papers, the last four of which are graded.  She says she prefers you to look at online images or visit museums over reading about art, which makes for limited regular homework.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 10, 2003",
            "review_content": "\nProfessor Smith may not be the most dynamic prof in the world, but she is knowledgable and very fair.  She understands that this is a required course, and enrolling in it doesn't mean you are \"into\" art.  She respects everyones' comments in class, even if what they say is not at all what she is looking for.  She makes herself available outside of class and answers email quickly.  Note\nto varsity athletes in this class: if you are in season, and your \"off\" day is monday, you will have problems finding time to get to the Met (which is closed only on Mondays), which you have to do 4-5 times for this class.\nWorkload:\nMidterm, final, 5 short (2 page) papers, the last four of which are graded.  She says she prefers you to look at online images or visit museums over reading about art, which makes for limited regular homework.\n"
        },
        {
            "course_name": "Archaeological Theory and Practice",
            "review_date": "January 21, 2003",
            "review_content": "\nI really cant understand all her negative reviews.  While she was not the most exciting and exceptional prof I have ever had, she was very good, although I did not always think this way.  One of her earlier assignments involved doing a long survey outside during the coldest week of february.  She also took us outside for another survey on a very cold day.  I wanted to die.  But there is a method to her madness.  This class is for people who are serious about being archaeologists.  Excavation often takes place in insanely hot or cold weather, and she was giving us a taste of what it is like.  We got a lot of hands on experience with artifacts, which was really cool.  How often do you get to examine human remains in class?  There were complaints that she didnt thoroughly go over certain areas, like recording and the process of excavation.  But honestly, that can only be obtained by actual experience.  My only gripe is the final.  It was long and hard.  Really long and really hard.  I have taken about 35 finals at columbia, and this is the only one that took the ENTIRE 3 hours, the first of which was devoted to readings.  There was a lot of work, but her grading is fairly easy.  But let this be a warning: this is not a class to take because you think archaeology is cool or liked the Indiana Jones movies.  It is very technical and goes into \"unglamorous\" areas such as pottery chronologies and trace-element analysis, and the paper is actually a grant proposal that should be good enough to actually be used.    \nWorkload:\nReadings that are interesting but often EXTREMELY heavy, short monument report, short book review, survey project the difficulty of which is based largely on the weather, insanely long and involved stratigraphy report, grant proposal, final.  A lot, but well worth it if this is your field.  \n"
        },
        {
            "course_name": "Introduction to Archaeology",
            "review_date": "January 09, 2003",
            "review_content": "\nProfessor Smith was helpful and nice, but her lectures and class were boring and largely lacking in content. She had clearly intended the course to be a combination of history and theory with a little bit of technique thrown in. Unfortunately her lectures were mainly composed of handwaving and descriptions of specific artifacts. She didn't give the class enough credit. The important theories she laboriously described are incredibly obvious (for example, she thought it would be a revelation for us when she explained that no site is the same at it was originally when we dig it up in the present. Wow!) but she beat them into us anyway. The few times she did hint at anything more technical she seemed simply incapable of explaining them well. \nHer idea of using specific sites to explain the development of archaeology could have been a good one, except that she spent far too much time describing each site instead of outlining its importance. \nThis made for difficult studying at exam time and mindnumbing lectures. Making this problem of lack of content even worse was that she cancelled 3 or 4 classes and threw away another 2 on student presentations, which were a total waste of time. We made posters. It was just like middle school. It was relatively easy to do well in the class, though it did require some studying. Beware her \"term list\" for the id section, however. She described the one for the final as a \"stream of consciousness\" list of everything we covered. Terms included Mexico, Bible, pottery, and other unhelpful words along with virtually every name she mentioned. Buy the main textbook (and only the main textbook) for this reason alone. All the books are just terribly written and painful to read, but you need at least the one to look up names and sites for the tests. Other than that, don't bother to read.\nWorkload:\nmidterm, final, paper, 3 min presentation and poster on the paper\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 19, 2002",
            "review_content": "\nFrankly, the writing load for this course was insane. We had to churn out a short 1.5 page paper almost every week (to be precise, 11 papers in 14 weeks of class), and each paper required a museum visit (although towards the end, I started using a single museum visit to work on 2-3 assignments simultaneously). The frequent assignments made me feel as if I was taking L&R; again (which, needless to say, was not a particularly pleasant feeling). The upside, though, is that she's a relatively easy grader. It's easy to get 'A's for the papers once you figure out what she wants from you, and the midterm and final are ludicrously easy (memorize name, artist, date, etc. and you'll get your 'A'). Looking back, I suppose it was easier to write many short papers for the class instead of a couple of long ones (which seems to be the standard practice), but it really felt like a ridiculous amount of work. It's not a bad course, nor a hard course, but the amount of writing made it tiring.\nWorkload:\n11 short (1.5 page) papers, Midterm, Final. (Readings are neither compulsory nor in the exams. They're useful as background information, but you can just skip them.)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 19, 2002",
            "review_content": "\nFrankly, the writing load for this course was insane. We had to churn out a short 1.5 page paper almost every week (to be precise, 11 papers in 14 weeks of class), and each paper required a museum visit (although towards the end, I started using a single museum visit to work on 2-3 assignments simultaneously). The frequent assignments made me feel as if I was taking L&R; again (which, needless to say, was not a particularly pleasant feeling). The upside, though, is that she's a relatively easy grader. It's easy to get 'A's for the papers once you figure out what she wants from you, and the midterm and final are ludicrously easy (memorize name, artist, date, etc. and you'll get your 'A'). Looking back, I suppose it was easier to write many short papers for the class instead of a couple of long ones (which seems to be the standard practice), but it really felt like a ridiculous amount of work. It's not a bad course, nor a hard course, but the amount of writing made it tiring.\nWorkload:\n11 short (1.5 page) papers, Midterm, Final. (Readings are neither compulsory nor in the exams. They're useful as background information, but you can just skip them.)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 19, 2002",
            "review_content": "\nFrankly, the writing load for this course was insane. We had to churn out a short 1.5 page paper almost every week (to be precise, 11 papers in 14 weeks of class), and each paper required a museum visit (although towards the end, I started using a single museum visit to work on 2-3 assignments simultaneously). The frequent assignments made me feel as if I was taking L&R; again (which, needless to say, was not a particularly pleasant feeling). The upside, though, is that she's a relatively easy grader. It's easy to get 'A's for the papers once you figure out what she wants from you, and the midterm and final are ludicrously easy (memorize name, artist, date, etc. and you'll get your 'A'). Looking back, I suppose it was easier to write many short papers for the class instead of a couple of long ones (which seems to be the standard practice), but it really felt like a ridiculous amount of work. It's not a bad course, nor a hard course, but the amount of writing made it tiring.\nWorkload:\n11 short (1.5 page) papers, Midterm, Final. (Readings are neither compulsory nor in the exams. They're useful as background information, but you can just skip them.)\n"
        }
    ]
}