{
    "prof_info": [
        {
            "prof_name": "Jenna Alden",
            "prof_id": 2752,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "The American Presidency",
            "review_date": "January 05, 2009",
            "review_content": "\nI might be bias, but Jenna was also one of the smartest TA's in the history department. She was a stickler for Courseowrks posts, paper proposals, and not inflating grades, but she also led a good discussion. She was actually passionate about being a TA, and extremely open to any sort of notes. For the midterm, my draft of the research paper, and the final draft, Jenna returns a page long, single spaced letter in which she discusses all of my strengths and weaknesses. That alone should put Ms. Alden as the most committed TA in Columbia history. \n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "August 30, 2008",
            "review_content": "\nGreatest TA I ever had. Encouraging, Available, Sweet, Fair, Knowledgeable. I recommend. \n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "February 26, 2006",
            "review_content": "\nAn all around incredible TA. Jenna cared about all of her students and encouraged all of her students to work hard and achieve at a high level. Like the other reviews said, she is a tough grader but if you can get into her sections, you should. It's nice to have a really smart TA who also genuinely cares for her students.\nWorkload:\nDiscussion posting on Courseworks each week (a few paragraphs on the reading), rough draft for major essay, and Final Paper. midterm and final.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "January 24, 2006",
            "review_content": "\nJenna was hands-down my favorite TA that I've ever had at Columbia. She's extremely intelligent, encourages discussion with her open-minded style, and really cares about her students. While she is a difficult grader, she does reward hardwork and is very willing to help along the way with papers or any questions. Jenna definitely inspired me to do my best in the class and I looked forward to her section every week. If you can possibly get into her section for whichever history class she is teaching, DO IT! You will love her.\nWorkload:\nCourseworks weekly short responses, reading assigned by professor. She required us to meet with her at least once about our papers and encouraged us to submit a rough draft or outline.\n"
        },
        {
            "course_name": "America Since 1945",
            "review_date": "December 23, 2005",
            "review_content": "\nJenna is an amazing TA and section leader.  She is personable, sweet, and truly intelligent and versed in the course.  She is never condescending and doesn't share any of the negative attributes that Grad students are often though of as possessing.\nThat being said, she IS a really tough grader.  This is done constructively though, not for the sake of giving low grades (although she IS an obvious member of the crusade against grade-inflation).  She is really open to students who call on her outside of section, and is great to work with.  I suggest choosing her section if possible in America Since 1945 or in any other course in which she may be TAing.\nWorkload:\nWeekly responses to reading-related questions.  Each week a different student in the section is assigned the task of providing the questions.\n"
        }
    ]
}