{
    "prof_info": [
        {
            "prof_name": "Zander Brietzke",
            "prof_id": 3124,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Modern Drama II",
            "review_date": "October 18, 2010",
            "review_content": "\nI ended up getting bored with O'Neill, Williams and Miller because of this class. Probably the slowest, most unrewarding class I have taken during my four years at Columbia. The jokes were often painful and there was no college-level analysis of the plays, which is a pity because most of the plays were great--it was just difficult to appreciate them in this classroom. Perhaps Professor Brietzke is more knowledgeable of the performances and staging (rather than, say, analysis of texts, which one might expect to learn in an English class) but he did not offer any memorable insights on this either. On the bright side, the grading is very generous, so it's not difficult to get an A in this class. I'd say the plays are good, but you're not going to learn much about them in this class. So why not just read them in your own time (preferably on a beach)?\nWorkload:\nTwo essays and a final. \n"
        },
        {
            "course_name": "Modern Drama II",
            "review_date": "July 21, 2010",
            "review_content": "\nI agree with the post below.  The class really is a waste of time.\nWHO gave this man a silver nugget?!!\nThe work is fairly light but an hour and fifteen minutes never went by so slowly...\nThe readings weren't bad at all, they were actually pretty interesting! But listening to elementary comments from the class for the entire class time with absolutely no guidance whatsoever made me wonder why i even bothered to read.\nThere is no doubt that the man likes to hear himself speak.  He merely asks for feedback about the play for that class, and then talks about that one comment for 30 minutes until he realizes that no one is listening and then says \"any other comments?\"\nI am sorry to say that I didn't get much out of this class.  Although the reading list is pretty fabulous, there is no direction and even less structure to this class filled with grad students looking to skate by the semester.\nWorkload:\nA play per class.  5 question sets. 2 play reports (you have to go see to dramas). Final exam\n"
        },
        {
            "course_name": "Modern Drama II",
            "review_date": "March 05, 2010",
            "review_content": "\nThe last review is spot on. Brietzke must have a knack for coming up with really interesting class titles and descriptions, because this class sounded great, and had a really fun syllabus. \nUnfortunately, I stopped going to class about a month into the semester because it added NOTHING to my own readings of the play. In fact, reading them on my own was more insightful than discussing them in class. \nOn top of that, this class was entitled, \"Modern Drama II: Theatricality on the Godforsaken Stage'. I have never once heard a reference to the theological revolution that was going on while these plays were being written. \nZander is a funny professor and seems like a nice guy, but for English or Theatre majors, this class is a SERIOUS waste of time. Don't do it. \nWorkload:\nAverage. Light readings for every class, 5 question sets made up of the most boring questions you will ever come across, 2 papers 5-7pgs each, (again, come up with your own topic because his have so obviously been thought up during a 5-minute coffee break) and 1 final. \n"
        },
        {
            "course_name": "Ibsen, Chekhov, Strindberg",
            "review_date": "November 18, 2009",
            "review_content": "\nFor English majors, this class is a waste of time. No doubt, there's a great syllabus, and Professor Brietzke is indeed a really nice guy, but he provides a painfully-- and I mean really, truly, completely, excruciatingly--superficial examination of the texts (Sparknotes will give you far far more). He leads the class as if it were a book club. It will frustrate you because the plays are really quite amazing--but he gives you NOTHING in the way of insight. You might as well just read the books over the summer on the beach.\nUnfortunately, to top it off, he makes you do long, and unsubstantiated weekly question sets, which are never touched on in class, or referred to. \nWorkload:\nweekly question sets, midterm paper, final, final paper\n"
        },
        {
            "course_name": "Contemporary American Literature",
            "review_date": "May 23, 2008",
            "review_content": "\nGreat class. Not only is Prof Brietzke one of the most laid back, enthusiastic, and nicest professors you will ever have, but he also really knows his stuff. Class consisted mostly of discussion, and depending on who is in your class this could be a good or bad thing. In any case, he usually steered conversation in a generally illuminating and challenging direction, while still allowing us to vent about bad writing or weird plots. Best part of class: the syllabus. You get to read really hilarious, fascinating, and sometimes depressing plays. Some you've heard of, and some not, but everything is worth reading and discussing. Definitely take this class if you have any interest in contemporary drama or if you are just looking for great reading and interesting conversations. \nWorkload:\nA play a class (about 25 over the course of the semester), which sounds worse than it is. Questions sets posted on courseworks per class (which were really helpful and generally insightful), one 7 page paper and a totally do-able final (5 essay questions, but no surprises). \n"
        },
        {
            "course_name": "American Drama",
            "review_date": "January 16, 2008",
            "review_content": "\nZander is such a nice guy. He is a fair grader, he is funny, and he is very interested in his material, his class, and his students. His background is in performing and staging drama though, so my only complaint would be that this class did not have the intensity of literature and analyzation that I had hoped for. However, the class was always interesting, informative, and fun. His syllabus is great and covers the best of 20th Century American Drama (Tennessee Williams, Eugene O'Neill, Tony Kushner, Arthur Miller). I would recommend this class to non-English majors looking for a fun, intro class on drama or for English majors interested in plays/ looking to fulfill the drama portion of the major's requirement.\nWorkload:\nA 5 question weekly quiz on Courseworks the morning before class, a paper proposal, a 7-10 page paper, and a final. You read a play per week, so as far as English classes a lenient workload.\n"
        },
        {
            "course_name": "American Drama",
            "review_date": "January 08, 2007",
            "review_content": "\nI really enjoyed Zander's class. With his charismatic voice and obvious theater background, lectures never droned. In fact, he ran a class of seventy or so like a discussion section, which I suppose people will either like or dislike. Surprisingly, participation was broad; people seemed to actually care about saying something. The course is pretty much a survey of 20th c. American drama, and has a great syllabus with all the big names you'd expect. \nUnlike many professors at Columbia, it seemed as though Zander really wanted to be teaching our class, and frequently made self-deprecating jokes about how it was the best thing in his life. He said that he would learn everyone's name and he did - when he walked up to me and handed me my graded paper before class I was pretty surprised; I had never spoken during lecture. \nAll in all, I really liked this professor. To me the class, with its relatively light workload and enjoyable atmosphere, was a nice break.\nWorkload:\nLight for an English course. One play per week, plus occasional supplemental readings, which were interesting but not crucial. One 10 page paper. Final. Ohh, and small courseworks multiple choice reading quizzes over each play.\n"
        }
    ]
}