{
    "prof_info": [
        {
            "prof_name": "Zainab Bahrani",
            "prof_id": 1319,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Art and Architecture of Ancient Mesopotamia",
            "review_date": "May 17, 2012",
            "review_content": "\nThis class is awesome. The material is awesome. Bahrani is awesome. It's all awesome.\nIt's a ton of work, though. Bahrani gave us over 200 slides for the final. She also tests on stuff that isn't in those slides (everyone literally burst out laughing, including the TA, when some really obscure thing she didn't include in the slides popped up). She also doesn't give you all the info she wants for the exams (i.e. you need to know conventional name, material, provenance, period, and date for each piece, and she'll usually give you 3 of the 5, and you need to dig up the other 2). Yes, this is frustrating. Is it worth not taking this class? Absolutely not. The Mesopotamians did everything, and as far as we know they did it first. This class, and Bahrani, will shake up everything you think you know about humanity. \nWorkload:\nMore than most art history courses (I've heard from grad and u-grad students; this was my first). Midterm, 7-10 page paper, final.\n"
        },
        {
            "course_name": "Major's Colloquium: Introduction to the Literature and Methods of Art History",
            "review_date": "October 05, 2007",
            "review_content": "\nSincere apologies in advance, but this is going to be prefaced with one of those really annoying but unfortunately useful instant-text-messaging-era acronyms: LMAO at previous review !!\nIt is, bar a few opinions, spot-on. The workload for this class was, frankly, horrendous both in terms of volume and difficulty. Some of the readings were great, but others, like Kant and Hegel, were about as delightful and productive as swimming the English Channel with all 4 limbs amputated. \"This is Columbia,\" you'd think, \"par for the course.\" \nYou would be wrong. \nI would, in all honesty, rather read the Phenomenology of Spirit again, in its entirety, IN GERMAN, than have to interact with this individual under any circumstances except one involving physical separation by a barbed wire fence, she was that awful. The class itself may not have been easy, but she hardly made it any better by 1. blatantly and unashamedly playing favourites (good for you if you fall into that category, god help you if you don't), 2. encouraging class participation and then cutting people off mid-sentence if she didn't like what they saying, 3. intimidating everyone by constantly name-dropping and showing off what a genius she was (yeah, a tenured prof with years of teaching experience getting kicks from pitting herself against a bunch of undergrads, now THERE's a level playing field) and basically just pointing out not-so-subtly that if you didn't agree with her or know what she was talking about you were either lazy or dumb, and unreedemably pathetic on both scores.\nAnd just when you're thoroughly demoralized, wiped out, and mentally and spiritually fatigued from trying to keep up with the material and up to her expectations, you get your grade. Which is the arsenic-laced icing on the sh*t cake. \nAs the reader may have figured out by now, this review does not pretend to disinterest, thoughtfulness, or objectivity on any level. It is, however, a fairly accurate record of a single experience, the moral and lesson of which is that EVERYTHING is personal with Bahrani - you approach the witch's cave at your own risk. Wear a cross and remember to say your prayers. \nPS. One major point of disagreement with the last reviewer though: the hair is definitely not \"pretty\". Or any possible variations on the adjective thereof. She has too much of it - you'd think someone who tries that hard with her appearance would have figured out by now that people with thin faces should not sport big hair, which that permanently permed bouffant definitely is. \nWorkload:\nNot even the point. \n"
        },
        {
            "course_name": "Major's Colloquium: Introduction to the Literature and Methods of Art History",
            "review_date": "May 30, 2007",
            "review_content": "\nHere's the thing about Professor Bahrani. She is really f***king smart. She's at pretty much the top of the art history food chain, so she eats bitch ass professors like medium rare steak. She knows this too. She's also very exotic looking and very pretty. Her hair is really fantastic. But she knows all these things about herself. So as you may have guessed, her ego is through the motherfu***ing roof. Not that there's anything wrong with this. But don't even try to act like you're worth two cents of monkey sh*t because she'll tear your cotton candy ass apart. You're stupid compared to her. You're a Rhodes scholar? Who gives a f*ck. Go read 500 pages by Kant about the difference between sight and the gaze in two nights and then try to make some comment that isn't fu*king quasimodo retarded. Maybe if you manage three of these in a row you'll become her favorite. She loves her favorites. Especially if you're not some petty close-minded American with hair that's not as fabulous. \nWorkload:\nTry reading for this class. Try reading ALL of the stuff for this class and tell me that you did that sh*t. Then you'll be lying through your weasel ass. Because the reading is impossible unless you're a freshman who has to do five minutes of frontiers homework and then two hours of furious masturbation for the rest of the night. A midterm. Relatively easy if you do the reading. But what did I just say about the reading? therefore the test is relatively fuc*ing difficult. A final essay on a work of art from the met. This was actually fun to do. \n"
        },
        {
            "course_name": "Art and Architecture of Ancient Mesopotamia",
            "review_date": "November 13, 2005",
            "review_content": "\nBahrani is the best teacher I ever had.  The course was an obscure topic (though I love it), but the way she analyzed objects could be applied to anything you study.  She said interesting things about the objects, besides plain description.  Also, the reading was interesting, but she didn't expect people to do it.  The tests were just lecture.  All in all, a fantastic class.\nWorkload:\nMidterm, final, and paper.  There is reading, which I recommend for interests sake, but not necessary.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 25, 2005",
            "review_content": "\nProfessor Bahrani initially comes off as really strict and a tough grader. Don't let that fool you. She's great. I really learned so much about art and how to look at art (although there was a lot of BS to deal with from kiss-up students). Overall, Professor Bahrani is an excellent teacher. And if its ever a nice day outside, she usually let us out early--an added bonus. If you get into this class, don't even think of dropping it!\nWorkload:\nAbsolutely nothing, a few in class essays that require no studying, midterm and final\n"
        },
        {
            "course_name": "Majors' Colloquium: Art and Architecture of Ancient Mesopotamia",
            "review_date": "March 22, 2005",
            "review_content": "\nZainab has to be the single greatest professor I have ever had at Columbia in any subject, period.  She comes off at first as a bit stiff, but she is actually just extremely professional, and upon getting to know her better (through colloquium classes) I found her to be kind and engaging. She is a fair grader and assigns reasonable workloads, but don't try to bullshit because she can see right through it.  To give an idea of just how intelligent this woman is, she can fully explicate Lacan in 5 minutes and is who the UN calls to identify stolen Iraqi artifacts.  Her lectures are the most clear, organized and entertaining I've had - one of the few art history classes where lights off and a warm room do not equal a fight with sleep.  Do not leave columbia without taking a class with this woman, she will rock your world .  If at all possible take her for Colloquium, as she runs the greatest class and is crazy nice to undergrads (she cut down our final paper from 10 pages to 5).\nWorkload:\nColloquium -  5pg midterm and final papers, 1 class presentation on assigned readings\nMesopotiamia - straight midterm, final and 10 page paper assigned a month before it is due\n"
        },
        {
            "course_name": "Public Monument Art in the Ancient Near East",
            "review_date": "November 11, 2003",
            "review_content": "\nafter hearing her engaging guest lectures in my intro to art history class at barnard, i sought her out and took this seminar last year. her calm, organised demeanor coupled with her expertise in and enthusiasm for her field make her a joy to learn from or just talk to or be around. she kept getting flown around the world to speak to the UN or save archeological sites in iraq from bombing or whatever, and still managed to have a minute to talk to me about my work when i needed it. this woman is sharp, interesting and knows her stuff, and i admire her quite a bit.\nWorkload:\nfair amnt of dense reading. managable. in class presentation of research and a final paper, something like 10-15 pages. my only gripe about the seminar: for god sake, if there's going to be so much reading, just pay a grad student to make course packets. i think i spent a hundred bucks on photocopies.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 30, 2003",
            "review_content": "\nProfessors don't usually teach art hum, so I was really lucky to land in Professor Bahrani's class.  She's a great lecturer; this was the first core class where I didn't find myslef hopelessly bored.  The best classes were the ones in which we dscussed cultural theory and post-colonial thought, so I would guess that the regular classes she teaches are even better. \nWorkload:\nMidterm, final, two papers and short responses to the readings.  It sounds like more than it is and she's a very lenient grader if you prove that you know what you're talking about.\n"
        },
        {
            "course_name": "Art and Architecture of Ancient Mesopotamia",
            "review_date": "January 15, 2003",
            "review_content": "\nAs for the previous reviewer - sometimes it's difficult for a professor to disguise their hatred of stupidity.\nBahrani never showed such coal-heartedness in her lecture class. Instead we got in-depth lectures on a choice cross-section of ancient near eastern art - there was actual analysis of individual works instead of a parade of names and dates. She did harp on the early history of Mesopotamian scholarship a bit, but considering that she's the most interesting and vital scholar in the field, she might be justified. Her lectures on model beds complete with copulating couples rocked, and did so far beyond the 'see, there were women then, too' I expected from the syllabus. \nWorkload:\nStandard art history midterm and final, and a 10 page final paper. The tests are easy as pie, since you're only responsible for knowing about 15 works, total. Two to three articles a week are assigned, but she goes over the important arguments in class, so read the assignments only if you seek not-on the final enlightenment.\n"
        },
        {
            "course_name": "Art and Architecture of Ancient Mesopotamia",
            "review_date": "January 15, 2003",
            "review_content": "\nAs for the previous reviewer - sometimes it's difficult for a professor to disguise their hatred of stupidity.\nBahrani never showed such coal-heartedness in her lecture class. Instead we got in-depth lectures on a choice cross-section of ancient near eastern art - there was actual analysis of individual works instead of a parade of names and dates. She did harp on the early history of Mesopotamian scholarship a bit, but considering that she's the most interesting and vital scholar in the field, she might be justified. Her lectures on model beds complete with copulating couples rocked, and did so far beyond the 'see, there were women then, too' I expected from the syllabus. \nWorkload:\nStandard art history midterm and final, and a 10 page final paper. The tests are easy as pie, since you're only responsible for knowing about 15 works, total. Two to three articles a week are assigned, but she goes over the important arguments in class, so read the assignments only if you seek not-on the final enlightenment.\n"
        }
    ]
}