{
    "prof_info": [
        {
            "prof_name": "Fabien Levy",
            "prof_id": 3202,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Orchestration",
            "review_date": "April 27, 2012",
            "review_content": "\nI was really excited for this class and it was a huge disappointment. After the first two days of class when he introduced some key terms (although really directional/undirectional instruments were the only ones that stuck) we literally did nothing. Every day we would bring in some score and Fabien would go through, practically measure by measure and just describe what was happening (\"Here the flute and first violins are playing the melody, the lower strings are accompanying and the french horns are playing a dominant pedal\"). He tried to describe to us a method using \"tree logic\" but this was never really fully explained despite him mentioning it on almost every piece. I still don't really know what combinations of winds make for a mixture or a space doubling. Rather than going through each score, we should have spent more time on what different combinations of instruments sounded like and how to put them together. Aside from doing the assignments, I really feel like I got nothing out of this class.\nWorkload:\nThree assignments which aren't too hard and help to get you doing some orchestration on your own. He grades in a sort of arbitrary way but uses the standard grading scale (90-100 = A, 80-90 = B): despite getting a 100 on the first assignment, I got a 30/40 (a C!) on the second assignment for two minor, subjective issues.\nIt is pretty cool to be able to hear your orchestration played by the orchestra at the end though.\n"
        },
        {
            "course_name": "Techniques of 20th Century Music",
            "review_date": "December 17, 2009",
            "review_content": "\nFabien is a great teacher and very engaging. As others have said, his English isn't great and his accent is very strong, but you'll get used to it quickly (it's easy to cut him some slack when you learn that he speaks four languages). Taking a class with him is a great privilege, as he is truly a brilliant and accomplished guy whose knowledge of all things musical is pretty ridiculous. Despite his already impressive career (he's pretty young), Fabien is humble, kind, pretty laid back, and always cheerful. \nAssignments are quick and easy and he grades easy on them as well. Even if he doesn't, you can always redo it to improve your grade. Exams are also pretty straightforward, just go over ALL your notes. \nWorkload:\nWeekly assignment, midterm, term paper and optional presentation.\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint I ",
            "review_date": "December 19, 2007",
            "review_content": "\nFabien is simply wonderful - while this class requires a rather broad approach to the material, due to a wide range of ability within the students, he manages to walk a very fine line between making the class overly technical and complex and dumbing it down, missing the point altogether. His assignments are extremely useful for understanding the material but he is a generally easy grader and will work with you until you are at a good level. Although he has a strong accent and lacks a great command of English, he is still quite clear and communicates very well with his students. Unlike most theory classes, Fabien grades a lot of the assignments himself so you are getting feedback straight from the professor.\nAs an aside, since most people don't realize, Fabien is one of the leading composers out of Europe and is pretty darn accomplished himself...aside from his composition, he has an Economics degree and plays jazz (although his piano skills, like it seems with every theory teacher, are wanting)\nWorkload:\nLight. 1 assignment per week, midterm, and final. \nParticipation and attendance are also factored in and could hurt your grade if you don't go to class. Generally, Fabien accepts late homeworks, no problem.\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint I ",
            "review_date": "April 14, 2007",
            "review_content": "\nTerrific, terrific teacher. Fabien is one of the most knowledgeable teachers I've had at Columbia. He knows all of the material inside out, seemingly without limitation. Take a class with him, and you'll quickly realize that the man could probably teach music history, theory, composition, analysis, electroacoustics or any other music course offered by the music department. Sometimes it seems like he could handle philosophy, economics, French, German, or Russian as well. \nIf you're taking a class with him, you are probably a music major or very strongly interested in music, so classes will generally be engaging, and he highly encourages participation. It's particularly interesting taking music courses with an active composer. He has strong opinions about all the music we study, but is always interested in hearing yours.\nHe has a good sense of humor about himself and the course and always understands if you need an extra couple of days to do a homework assignment. (They are not particularly hard, but sometimes are substantially long.) \nHis style of analysis might take a little getting used to, and he will insist that you use his methods of analysis, but he means well and genuinely likes teaching. \nWorkload:\nManageable weekly assignments. Straightforward midterm and final, final presentation/paper on a piece of your own choosing relevant to the course content.\n"
        }
    ]
}