{
    "prof_info": [
        {
            "prof_name": "David Kastan",
            "prof_id": 112,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Milton",
            "review_date": "January 02, 2006",
            "review_content": "\nProfessor Kastan is an engaging speaker and can take any subject and make it interesting.  As an English major dreading the poetry requirement, I took Milton having had professor Kastan before.  As usual he was great at making the sometimes dry material interesting, and he has a great ability to include the entire (large) class in the discussion.  The biggest downfall of this class was the discussion sections.  There seemed to be no guidelines for the TA's and since the discussion sections were required we often ended up talking about the same topics over and over.  So Kastan was great, but the discussion sections weren't so hot.\nWorkload:\nTwo papers (both pretty difficult, but if you have a nice TA you can rewrite or get help), and take home final- 50 questions, all difficult research type questions\n"
        },
        {
            "course_name": "Milton",
            "review_date": "December 23, 2005",
            "review_content": "\nKastan is an amusing, personable, intelligent fellow.  A friendly and brilliant Renaissance Lit scholar who is in no way intimidating.  You will know so much of Milton's theological, pedagogical, and political world at the end of this.  His lecture jokes range from dud to chuckle to class hysteria.  The lectures are most informative when Kastan narrows upon a textual segment and elaborates on the diction and versification.  Though his knowledge of the theological and historical background (doctrinal disputes, the orders of angels) is impressive and sometimes necessary when providing possible material for your assignments.  If you want more specificity than the lectures or the TAs can give, Kastan is usually available right after class and you can follow him back to his office to get his input on your digression or possible paper topic.  And there are his office hours.  Though since he is the Department Chair, he probably cannot devote so much office time to every one student.\nWorkload:\nConsidering that most of it is verse and not prose, the reading load is not bad.  Usually two books of each poem per class.  Three written assignments.  The first one is 3-4 pages, the second 5-6.  Kastan insists on brevity.  The final is a collection of short answer questions, so you will not be able to work on some lengthy, master essay in this class.  \n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "April 29, 2004",
            "review_content": "\nok yes, the man is funny.  if i wanted stand-up comedy, however, i'd go to a club, at night, that offered stand-up comedy, buy a nice drink, and have a pleasant hour or two.  as it is, i got up at 9 am to go to an ENGLISH class about SHAKESPEARE.  it would be good if someone could remind professor kastan about that.  he spends the first 45 minutes of class doing straight stand-up.  the stories have no relationship to the subject.  then he talks about the material - but only sort of.  kastan freely admits on the first day that he doesn't really prepare for lectures - he just talks about interesting things about the text as they occur to him.  what that means is that he makes a number of random comments.  some of them are interesting.  some of them are even insightful.  none of them gives one any kind of insight into the work as a whole, provides a new reading of a text, or offers any serious analysis.  this class was one of the single biggest disappointments of my time at columbia, i didn't learn a damn thing.\nWorkload:\na pain-in-the-ass midterm assignment of looking up random facts about shakespearean england, paper, and an inclass final.  you can get an A- with a modicum of effort if you're a good writer.\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "December 25, 2002",
            "review_content": "\nreally interesting lecturer. He focuses more on the historical context of Shakespeare than the text itself, sometimes you don't even have to open the text in class. But he's funny, and knows his stuff. The list of plays you read are great!\nWorkload:\nread 1 play a week, paper, take-home midterm that is pure trivia and takes hours and hours to look up, and open-book final witht the questions given in advance.\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "February 13, 2002",
            "review_content": "\nProfessor Kastan is one of the best teachers I have ever had. First of all, he is funny as hell- he told some really great stories over the course of the semester. (One about an English canary, or \"budgy,\" is a classic.) His lectures are absolutely fascinating. He has extremely interesting things to say about each play. The intellectual stimulation was worth getting up at 9. He's also open to office hours conversation about stuff. If you don't love Shakespeare, Kastan will inspire you to.\nWorkload:\n10-page paper, final, and 50 short-answer question take-home midterm. The midterm was REALLY tedious- it involved a ton of research for Elizabethan historical minutiae. I did really well, but it took me at least 20 hours.\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "February 10, 2002",
            "review_content": "\nI really do not understand the hype about David Kastan. I found his lectures tangential, inconclusive and often dull. He offers little if any insight as to the themes of each play and seems uninterested in any sort of character intricacies. Kastan's lecture methodology seems to be to adopt one particular reading of a play, and then explain why it is the end-all interpretation. To his benefit, excepting the ridiculous midterm which he should be ashamed of assigning, the class is a joke work wise and a very easy A/A-.\nWorkload:\nTake home midterm that involves about 25 hours of library research. 10 page paper, final. All work graded by invisible TAs.\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "January 28, 2002",
            "review_content": "\nProfessor Kastan at first drives you nuts by dropping names worse than an nouve-riche social climber at a political fundraiser. I don't think we made two classes without mentioning someone famous he was in contact with in some capacity. On the otherhand, the stories make entertaining fodder at 9am, and keep you awake. He's enjoyable if you can handle light sarcasm and heavy wit early. Someone should really haul in the Englsih department for making good classes so inaccessable. Anyway, it's a fairly straightforward English lecture course, with a take home midterm, a comparative paper, and a final that's open book. He states in the first class that the TA's do all the grading, but the lectures are really enjoyable, because even the most experienced Shakespearean will learn something new and fun. Avoid walking in late, and NEVER leave in the middle of class, or he will single you out. Bring him coffee, he likes that, if you want to kiss up. I recommend it, especially for English majors.\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "January 24, 2002",
            "review_content": "\nSimply fabulous. To be honest, he was my \"second choice Shakespeare professor\", behind the famed James Shapiro. But when I learned that Shapiro would be on leave for 2001-2002, I took Kastan's class instead and was immediately ashamed of myself for slighting him initially. He is absolutely wonderful -- funny, irreverent (his endless jokes about Shapiro are hilarious), and brilliant. Yes, his assignments are a little off-kilter, but to be honest, I think they're fun. There is a certain kind of satisfaction that can be had from finding out exactly how wide the stage at the Globe Theatre is or how much it cost to go to a play in the 1600s. Definitely sign up for any Shakespeare class that Kastan teaches. You won't be disappointed.\nWorkload:\nNot much. Approximately one play per week, two assignments, and a final. Grading isn't hard either.\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "January 19, 2002",
            "review_content": "\nKastan is everything one imagines a university English professor to be like. He's witty, funny, charming, brilliant, wears tweed, has a beard. He's also suprisingly accessible for a big wig. His lectures are both interesting, full of jokes and anecdotes, and informative. He puts particular emphasis on the historical context of Shakespeare's plays. Even if you're not an English major take this class! You won't regret it.\nWorkload:\nA pain-in-the-ass of a midterm. The paper and final aren't too bad, although Kastan has a predilection for obscure, complex essay questions. Don't expect any \"Compare and contrast...\"\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "November 07, 2001",
            "review_content": "\nNot a hard class if you can wake up for it at 9 am. The classes are relatively unimportant if you can follow with the reading. Kastan at times seems full of himself, yet knows a lot on the subject. If you fall behind on a reading, you can always look on sparknotes.\nWorkload:\ntake home midterm of 50 short questions, one 7-10 page paper, and a final\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "May 10, 2001",
            "review_content": "\nThis is the one English class to take while you are at Columbia. All kidding aside, I have been moved to tears by his lectures before. Kastan makes everybody else look like a bunch of jerks and nobodies.\nWorkload:\nweird and tough assignments involving research, then a final\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "May 10, 2001",
            "review_content": "\nThis is the one English class to take while you are at Columbia. All kidding aside, I have been moved to tears by his lectures before. Kastan makes everybody else look like a bunch of jerks and nobodies.\nWorkload:\nweird and tough assignments involving research, then a final\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "May 10, 2001",
            "review_content": "\nThis is the one English class to take while you are at Columbia. All kidding aside, I have been moved to tears by his lectures before. Kastan makes everybody else look like a bunch of jerks and nobodies.\nWorkload:\nweird and tough assignments involving research, then a final\n"
        }
    ]
}