{
    "prof_info": [
        {
            "prof_name": "Dwijen Bhattacharjya",
            "prof_id": 507,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Bengali",
            "review_date": "January 17, 2006",
            "review_content": "\nDwijen is probably the nicest professor I've encountered at Columbia. Class goes fast and will probably be a problem for non-native speakers. For native speakers though, class is a trip. Dwijen consistently provides offbeat, hilarious (sometimes offensive) commentary. By the end of the semester, however, you'll be surprised at just how much you learned. I recommend this class and professor very highly.\nWorkload:\nmaybe one or two homework assignments throughout the semester, but you don't really have to turn them in anyway. a later midterm and a final that looks just like his practice one\n"
        },
        {
            "course_name": "Elementary Bengali I",
            "review_date": "August 24, 2005",
            "review_content": "\nBhattacharjya is a great person. The pace of the class varies tremendously depending on the skill level of the students in it, and as another reviewer said--without background in Bengali, it will be really hard to follow even at Intro I. While his grading system is sometimes confusing, he is such a nice person that he never wants his students to ultimately do badly. He is willing to help you find a tutor, provide you additional extra credit work. He is also a great source for information on South Asian politics and culture. The class is always fun, and you never doubt that Bhattacharjya really cares about his students and wants themto do well. \nWorkload:\nalmost non-existent\n"
        },
        {
            "course_name": "Elementary Bengali",
            "review_date": "October 26, 2003",
            "review_content": "\nHe is very nice, and if you are a native speaker its a hilarious class because of all his comments. However if you are not, find someone who is and sit next to that person because this professor doesnt always answer questions or explain what is on the board. Getting a tutor is also a good idea if for some reason you are getting bad grades (which is highly unlikely because this guy is a very generous grader). Also he buys dinner for the entire class at some point in the semester from local Indian restaurants. \nWorkload:\nhomework is rare, midterm is given after all other midterms are over with, fair quizzes\n"
        },
        {
            "course_name": "W1101-W1102 Elementary Bengali",
            "review_date": "December 31, 1999",
            "review_content": "\nThis is one of the lightest workloads you will ever encounter. Dr. Bhattacharjya is extremely nice and will rarely assign homework. However his grading system is more confusing than the tax code. He rarely answers questions in class and only gives A's to certain people. If you want to take learn the language and get an A, this is not the class for you.\nWorkload:\nmidterm, final, grades somewhat harsly. very light workload.\n"
        }
    ]
}