{
    "prof_info": [
        {
            "prof_name": "Carlos Vargas-Ramos",
            "prof_id": 2200,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "American Urban Politics",
            "review_date": "May 02, 2015",
            "review_content": "\nBad: Lectures too fast and reads from his textbook/readings word for word in class. Sometimes, he reads verbatim to the point where it's so difficult to follow what he is trying to convey because everything he says runs together. At that point, it becomes had to contextualize what he is saying and how it relates and my mind shuts off. I don't feel like I get as much as I could from the lectures; he should try to read less verbatim/from slides and make it more conversational. There were a lot of times in class where I've thought \"what is the main point?\" \"what am I susposta be learning?\" \nGood: The manner in which he facilitates class discussion allows for an interesting exchange of opinions(usually related to the reading). Trying to participate in class discussion usually involves some level of trying to form an intelligent and coherent thought, so for me personally I really felt the intellectual challenge from it. The readings are usually beneficial(except from that urban politics reader(sp?) book---which is terribly cumbersome in rhetoric). He also is a really nice person overall, and seems to go out of his way to converse with some of the students before class starts. It makes it seem like he actually cares about the students. \nWorkload:\nReadings and papers. Manageable. \n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "April 15, 2015",
            "review_content": "\nI'm so damn bored in this class that I feel compelled to write my first CULPA review. I really cannot state enough that this one of the worst classes I have taken at Columbia. Sure, I'll totally concede that the subject matter is intriguing and that I enjoy reading the textbook, but the rest of the class is an absolute farce. Class participation seems to be entirely based on mandatory attendance and the occasional poorly supported claims people make in class. Furthermore, Vargas-Ramos is awful. Not only is he an incredibly boring professor, pretty much just reading eyes-to-notes in complete monotone and racing through powerpoint slides (which no one takes notes on because let's be real, what's the point), but I also find him quite annoying and oftentimes patronizing. Typical class-participation dialogue:\nProfessor: What is the reason [insert dumbly obvious question stated word-for-word in reading]?\nStudent: Bla bla bla... The American Dream—\nProfessor: And what is the American Dream?\nStudent: Bla bla bla...\nProfessor: And what does that mean to you?\nStudent: [Insert completely subjective comment that has no relevance to the course]\nStupid stuff like this happens all the time. Vargas-Ramos has no distinction between the necessary and the stupid. All is fair game.\nPretty much the remainder of the class involves writing: choice between paper and five written responses. The written responses are more a waste of time than FroSci in its entirety. These involve literal regurgitation of the readings. No analysis necessary, that's too difficult!\nTL;DR: This class feels more dumbed down than any of my high school courses. Vargas-Ramos has no concept for what affects interest and true learning.\nWorkload:\nMandatory attendance (bring your laptop and catch up on life), paper or five written responses (written responses two to three pages each), take-home midterm, final (undetermined as of now whether take-home or written)\n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "February 25, 2015",
            "review_content": "\nProfessor Vargas-Ramos was a fantastic professor. Our lecture was about 50 people but he managed to create an engaging atmosphere and many people participated. The topics were interesting and I genuinely enjoyed doing most of the readings. He was a very fair grader (if you put in the time, you did well) and actually got to know each student.\nWorkload:\nNot bad, average amount of reading per night. Take-home midterm and final and either 5 response papers (2-3 pages) or an essay (10-15 pages). Do the essay!\n"
        }
    ]
}