{
    "prof_info": [
        {
            "prof_name": "Begoña Alberdi",
            "prof_id": 13596,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Hispanic Cultures II: Enlightenment to the Present",
            "review_date": "April 17, 2020",
            "review_content": "\nBegoña is incredible! She knows a lot about all of these time periods, and the readings she assigns are all very engaging. She is extremely patient and lovely. I'm a native spanish speaker, so I understood her very well, but she did speak a little fast sometimes, however she is very receptive to feedback and if she's going too fast you can just say so. When some professors say \"oh this is a safe space, you can express your opinions freely here,\" her class is what they mean. It is a very comfortable and productive environment, and I really learned a lot! \nDO TAKE HER! she's amazing\nWorkload:\n1 midterm\n1 take-home exam (essay)\n6-8 short responses on the unit, depends on the number of units\n50 ish pages of reading a week, varies, sometimes it's less, sometimes it's more\n"
        },
        {
            "course_name": "Strange Voices in Latin America // Los Raros",
            "review_date": "October 16, 2018",
            "review_content": "\nBegoña is incredible. She is engaged, funny, patient, understanding, and most importantly very passionate about the material. This course basically uses visual and literary art to explore \"la rareza\" in Latin American societies of the 20th century– with a special emphasis on social hierarchies around gender and sexuality. It is very interesting, and if you are looking to improve your academic Spanish I highly recommend it.\n\nWorkload:\n1 hour a week outside of class of reading (I am lucky and speak Spanish fluently, I know that for some students the reading takes much more time), 4 hours for the papers (only 3 per term) and 4 hours to prepare a presentation (1 per term).\n"
        }
    ]
}