{
    "prof_info": [
        {
            "prof_name": "Louis Bickford",
            "prof_id": 11792,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Transitional Justice",
            "review_date": "July 29, 2012",
            "review_content": "\nBickford is amazing. Even if you aren't particularly interested in transitional justice, any interest in human rights, conflict, or law will guarantee you love trans just. Every lecture incorporates a short film or out-of-the-box exercise, and Bickford's style is engaging and challenging. He will take a personal interest in you and seem genuinely committed to your individual learning experience. He also fosters a strong student-community bond in the class: when the semester ended, it was sad like the end of summer camp. \nAs a graduate student, it's useful to have a prof who is willing to meet with you outside of class, give advice on other projects you are pursuing, and offer professional contacts and advice up without even being asked. The course content is an excellent overview of the field, with various areas of debate and contention highlighted throughout to keep the material from being overly general. Added perk: Bickford tells really funny stories about his hijinks around the world canoodling with the human rights elite. He also offers some really sensitive, touching, and interesting stories from personal experience. If you want to hear about what louis moreno ocampo is like as a regular dude from a guy that runs the most important transitional justice center in the world, this is the place to do it.\nBe advised, though, that if you aren't down to do the backbreaking amount of reading and contribute to class discussion, you might get seriously frozen out by bickford and, most likely, the rest of the class. He expects students to be as crazy excited about their work as he is about his own.\nWorkload:\nvery heavy reading load, with primarily full books assigned as \"entire\" and a smattering of journal articles. one single-page proposal for your final paper topic due halfway through the semester. the final (policy proposal memo) is about 20 pages but bickford will happily accept less if you are confident you addressed the assignment fully in fewer pages.\n"
        }
    ]
}