{
    "prof_info": [
        {
            "prof_name": "Alfredo Spagna",
            "prof_id": 13659,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Fundamentals of Human Neuropsychology",
            "review_date": "January 08, 2021",
            "review_content": "\nI loved Professor Spagna's class. He really emphasizes neuropsychology's difference from neuroscience, which I didn't really understand why until about halfway through the course. I must say I really liked the way he viewed science, and he made all the classes so engaging. A lot of my classmates did NOT like neuroanatomy, but I didn't think it was bad at all; just the basics of neuroscience before learning how to apply that to real-world scenarios. That being said, the course is very well structured. I was actually debating between a major requirement and this class for this semester, and everyone I asked, including my advisor, told me to choose the major requirement. I was even told I would be \"wasting\" my credits. Well, I'm so glad I didn't listen to them. In the beginning, I actually chose this class solely based on the structure. Everything was so detailed, and I knew exactly what I was signing up for. I don't think I need to tell anybody that this is a rare find at Columbia, or maybe at university in general. I really appreciated the transparency of this class from the very beginning, and I still appreciate it. \nThe course was divided in half: the first half focused on neuroscience knowledge, while the second half focused on applying that knowledge. For example, in Week 1 and 2 we learned neuroanatomy or information about the senses. In Week 10 we learned about language disorders, but we did a lot of case study work and scenario-based assignments, rather than just route memorization. In this way, I felt it was a lot different than the Psych/Neuro classes I had taken already, and really appreciated the change. In Professor Spagna's exams, he would ask \"what would you do in this situation, as a clinical neuropsychologist?\" not \"what deficit is this patient suffering from?\"\nAfter taking this class, I've decided to change my major. Prior to this class, I had focused on my other major and was considering taking a few Psych/Neuro classes for fun and maybe have it turn into a concentration (I'm in the college). Now, I want to major in Psych and have the other major be a concentration. Life is weird, guys. \nAlso, I just have to say, this guy is so so nice. Love him. His accent makes the videos a little hard to understand sometimes, but you can generally work it out. Take a class with Spagna. It will make your 4 years worth it. And then some.\nWorkload:\nSimilar to most STEM classes at Columbia (I think, I'm basing that comparison off of FroSci, gen Chem, and two other psych classes, but make your own judgement) :)\nBefore every class you should be ready to read a scientific article. Each week a set of video transcripts are posted online to watch and read (and take notes, if you're like me). THen you complete a knowledge quiz. In class, there are PollEverywhere questions and time to complete groupwork. Sometimes there are guest speakers. Everything is laid out for you in the syllabus. Again, love the transparency. \n"
        },
        {
            "course_name": "W2450 Behavioral Neuroscience",
            "review_date": "January 07, 2020",
            "review_content": "\nSpagna is a funny and engaging lecturer, but unfortunately he doesn't really know what he was doing with this class. The material was pretty dry, as it was mostly neuroanatomy and cellular neurobiology, and had nothing to do behavioral neuroscience except for maybe the last week of material that was crammed into the schedule. He would explain the lectures slowly, then hit us with a whole video a few days before the exam that we needed to know. Then the bulk of the exam was on that last second material. The grading was super harsh, as it was mostly raw score or maybe curved just a few points. It's a shame because he's a very nice person, but his class ended up being kind of a landmine in the major. I would look into seeing if you could finesse another professor to fill out your cognitive or behavioral requirement. \nWorkload:\n3 exams, 1 paper\n"
        },
        {
            "course_name": "Cognitive Neuroscience",
            "review_date": "January 25, 2019",
            "review_content": "\nSpagna is an engaging lecturer. He is good at explaining concepts and anticipating difficulties. He's also sort of funny/knows how to use memes in his presentations, and he encourages participation without getting off-track. He is very open and responsive to feedback from students about how he teaches the class/designs the tests. Overall a super smooth class with lots of things to memorize, but quite doable if you attend lecture, read the book, and study for the tests. I highly recommend this class; I'm a humanities major and took this as the second part of my science requirement, and I do not regret it. \nWorkload:\n2 midterms (each 20%), a paper (20%), and a cumulative final (40%). Honestly not too bad if you set aside a lot of time to get prepared for each test.\n"
        }
    ]
}