{
    "prof_info": [
        {
            "prof_name": "Samuel Oak",
            "prof_id": 10105,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Pokenomics",
            "review_date": "November 01, 2013",
            "review_content": "\nDon't take this class, it's a scam!\nProfessor Oak is using his students only to complete his precious Pokedex, the work of his whole life. Moreover, he will tell you that you have to find 151 pokemon, even if apparently some of them cannot be found, but every fucking time you go back to him, he will tell you that there are hundred more things to catch...\nHe keeps pushing the students to find more and more pokemons, even if I was perfectly fine with my Ratata... I had to put him in a shelter in order to make room for stronger pokemons... \nThe man have a really unhealthy addiction to pokemon  \nAnd if the pokedex it's the work of his life, why the fuck is it empty???\nWorkload:\nTons of work, lots of walking and you really really have to enjoy beating up weird animals\n"
        },
        {
            "course_name": "Pokenomics",
            "review_date": "February 12, 2013",
            "review_content": "\nProfessor Oak is a great professor and taught me a lot. \nI was a little nervous about Pokemon and all, but Professor Oak just gave me a Pokemon and threw me into the wilderness. I was able to learn everything fairly quickly and managed to only get electrocuted about 12 times.\nOne experimental method Prof Oak (as he likes us to call him) does is setting you up with a rival. Mine just happened to be his grandson. It was weird.\nSpeaking of weird, though you'll learn a lot from Prof. Oak, he will almost never remember your name. He asked me my name like ten times, and he even asked me what his grandson's name was. At first I just told him it was Gary, but then I just started making up some random names, like Monkey Head, Clark Kent, and even Blue. I mean who would believe their grandson was named after a color?\nOne last thing I'd like to say is perhaps the best thing about Professor Oak. He cares. Honestly, when I was struggling he offered to come to my house to help me out. He even had weekly and sometimes daily meetings with my mom. He even joined us on our vacation, and when my mom told me she was sick, Professor Oak took care of her while I had fun. The only downside is that he kept locking the door, and it would take him like 5 minutes to finally open it. Other than that, Professor Oak was awesome. \nI definetely suggest taking this class.\nWorkload:\nThis is a year long course. You are sent off into the wilderness , and asked to come back with as many badges as possible. You then have to battle the elite four for your final.\n(Note: You can redo any gym battle or elite four battle, so you basically automatically win if you keep trying).\nAlso, Professor Oak gives you extra credit for catching all the Pokemon. However, this class was created over two decades ago, so the amount of Pokemon has raised from a possible 151 to over 600, so don't expect to be able to do this with out cheating.\n"
        },
        {
            "course_name": "Pokenomics",
            "review_date": "April 01, 2010",
            "review_content": "\nProfessor Oak is an excellent professor. His class may not be as popular as Professor Alden, but it was a fun class and I learned a lot. He is great at explaining things and also very funny. Oak's lectures always begin with interesting, challenging questions that will be answered within the lecture. He is very math-oriented and likes to use equations rather than graphs, so be sure to try and make sure you understand what he is doing either in class (which may be hard since he does things so quickly) or after class.\nThe weekly problem sets (20% of your grade) are usually pretty challenging, and the grading is a bit harsh on them (they are graded out of 4, and if you make one mistake, you're going to get a 3.5). However, the recitation section is usually a good resource to use if you're confused on the homework.\nI would definitely recommend Professor Oak's class to anybody interested in becoming a pokemon master. \n\nWorkload:\neasy midterm hard final\n"
        }
    ]
}