{
    "prof_info": [
        {
            "prof_name": "Nathan Pilkington",
            "prof_id": 10362,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 05, 2012",
            "review_content": "\nBy far the best professor that I've had or heard of in all of my schooling. Bold, potty-mouthed, outgoing and brilliant, Nathan taught Lit Hum his own way--criticizing inconsistencies and revering great passages with equal amounts of enthusiasm. He ensured that class was nothing less than a seminar, forcing each student to speak not by calling on them, but by making each conversation irresistible. Paper topics were never easy, but were far from impossible as Nathan makes himself highly available in and after class, answers emails usually within a few hours, and is extremely flexible when it comes to meeting after class. Athletes and working students also need have no fear--Nathan is one of the most understanding and accommodating teachers that you'll ever have. Whether you need to have a deadline extended, want to talk about how much you love or hate the Symposium, or just don't understand how this whole college thing works, this professor is the man to see.\nA true southern boy, complete with accent and salmon-colored pants, Nathan made it a point to get down to the true, real-life, how-this-relates-to-you point of each work, and I couldn't have asked for anyone better.\nWorkload:\nRequired reading, three papers, midterm, final, two-three quizzes at the end of the semester.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 19, 2011",
            "review_content": "\nI honestly couldn't have asked for a better Lit Hum professor. Nathan is a loud, foulmouthed, and astoundingly intelligent classicist from North Carolina who will take you through the syllabus as only someone who has read every (yes, EVERY) work in its original language can. He has high standards for in-class discussion and papers, yet didn't seem to be a particularly harsh grader--which, in my book, is exactly what you want in a professor. I found myself looking forward to class and even to writing my papers. Take this class, you'll learn a lot and enjoy doing it.\nWorkload:\nThree papers (10% each), midterm (20%), final (30%), participation (10%), 2 or 3 quizzes (10%). Nice and spread out, so one bad grade won't kill you.\n"
        }
    ]
}