{
    "prof_info": [
        {
            "prof_name": "Ross Posnock",
            "prof_id": 2650,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Realism & Naturalism",
            "review_date": "August 04, 2016",
            "review_content": "\nPosnock might be one of the most polarizing professors in the department. People love him or hate him—and most people hate him. On the first day of Realism & Naturalism, there were about 30 students, many of whom literally pulled out their computers and dropped the course part way through the lecture. I think in total about 5 of us stuck it out for the semester, and I'm glad I did. He might be brusque and eccentric, but he's absurdly smart and quite funny. He's also very willing to meet with you outside of class to help you develop paper ideas or to answer any questions. He does have a very clear political point of view, so if you skew conservative be warned. The theme of the class also wasn't very clear, and I think on every handout he gave us he renamed the class. I think the most appropriate name for the class would be \"Novels Ross Posnock Likes.\" In the end, his teaching style really grew on me and he presented interesting readings of a lot of classic novels. If you're on the fence, I highly recommend you give him a chance.\nWorkload:\nTwo shorter papers from very specific prompts and then a longer paper of your choosing. Very easy passage ID final that took about 30 minutes. \n"
        },
        {
            "course_name": "Post-1945 American Literature",
            "review_date": "December 28, 2011",
            "review_content": "\nProfessor Posnock is a brilliant man. He is a terrible lecturer, though. His lectures were completely disjointed and it seemed as if he would rather be doing anything else besides teaching this course. We didn't even get a complete syllabus until the third week of classes. He also assigned papers seemingly out of the blue and allowed 5-7 days to complete them, always over holidays, (Fall Break and Thanksgiving). He is the kind of professor that has spent so much time with the works assigned that his knowledge actually gets in the way of teaching. If you pay close attention to everything he says you can glean some themes, but, honestly, my education was not enriched by this course. I just wanted to get through this class and took very little away about the subject. Also, I am an English Major, so I think this is the worst possible literature class for anyone looking to fulfill core requirements. Like many have said, I am sure his seminars are very rewarding, but this lecture course was virtually useless. \nWorkload:\n3 papers, 1 final, no guidance.\n"
        },
        {
            "course_name": "Post-1945 American Literature",
            "review_date": "December 11, 2011",
            "review_content": "\nProfessor Posnock was way too hands off, and frankly, seemed like he didn't want to be teaching the class. Most people had no idea what was going on in the class or even what book we were reading because we were going off a vague, undated syllabus that wasn't in any sort of recognizable order. He was completely unapproachable, condescending and seemed to have no regard for his students as people with lives and would refuse to answer emails and assigned us long essays with only 3 days to do them, often over a holiday (Thanksgiving). \nHis distance was very discouraging of enthusiasm for the course. The TAs seemed nearly as intimidated and clueless as to what was going on in the class as the students were, and yet graded the papers harshly with no explanation of what they were looking for in the first place.\n That said, Professor Posnock is unbelievably eloquent and his lectures were very interesting, in spite of the fact that it was often obvious he didn't prepare for them. Also, the readings assigned were admittedly all masterpieces, but the study we did of the books was almost entirely about content and the biography of the author and had almost nothing to do with style or literary analysis. Often it seemed like he hadn't even attempted a lecture plan and was filling up space with reading pages and pages of the text aloud and reciting interesting but relatively useless facts about what the author liked to do for fun in college. \nProfessor Posnock seems like he could be a great professor in a seminar setting of his own choice and creation, but he did not want to be teaching this class and took it out on the students.\nWorkload:\n3 essays, not too long but each longer than the last, and a very out of place and random final. \nwe read about 7 books as well as a few short stories and poems, but it almost seemed like he didn't expect us to do the reading.\n"
        },
        {
            "course_name": "Post-1945 American Literature",
            "review_date": "December 09, 2011",
            "review_content": "\nIt's not surprising that Posnock has pretty good reviews. It's a bit annoying that we're not more cynical of his agenda though. \nFor each lesson, he will give us the popular public opinion and interpretations of the book, which he is in complete agreement with. Most of these interpretations follow the neo-liberal scheme, and one with a different, refreshing take does not even have a chance (seriously, there is no time in the class) to present their views. I hear you all yelling at me already: \"this is a lecture class!\" and I hear you, but if we can't bring in alternate interpretations, he should take the responsibility to do it himself. \nAlso, once he said something , I can't remember what now, but something about how the muslim faith is all off, and there was a silence in the class after he said it and we just kept moving on. We sat there like a sedated bunch of wussies, the same bunch of wussies writing these 'posnock's great' reviews. \nHe does get interesting when talking about philosophy, I'll give him that. He starts making fluid sense. Also, his arrogance can be entertaining; he often scoffs at remarks made by other critics or writers. \nBut his lectures just ramble on for the most part. In one class I wrote down nearly everything he said, and looking at it I could identify no coherent thought or link between the ideas. I didn't know what to \"walk away\" with, so to speak, after the lecture. \n\nWorkload:\n2 short papers\n1 long paper *8pg\n1 final\n"
        },
        {
            "course_name": "American Literature 1880-1940: American Modernism",
            "review_date": "January 13, 2010",
            "review_content": "\nloved posnock. a total no bullshit professor - he comes into class on time, starts talking whether or not people are quiet, spits knowledge for 85 minutes, stops and walks out. he is encouraging; he never shot down people's comments (some of them were worthy of shoot downs, i might add), but rather compliments them if they are insightful and engages with them if he disagrees. his lectures are consistently interesting and i would often find myself surprised when i looked up at the clock at the end of the class and it was almost over. strongly suggested class and prof.\nWorkload:\nrelatively light reading for english class. great novels. 3 papers, all relatively short. easy peasy final. \n"
        },
        {
            "course_name": "Post-1945 American Literature",
            "review_date": "December 21, 2009",
            "review_content": "\nI've taken two courses now with Posnock and am still not entirely sure how I feel about him. I can definitely see how he might be dry to people not interested in the subject matter, but I find that he picks great books and brings them together brilliantly to make a substantive course. He also has some really interesting, kind of great quirks that are unreconciled in my mind, like his refusal to assume any baseline of knowledge in his students (he'll ask if you've heard of Henry James or Jim Crow laws) and his insistence on correcting people he's asked to read out loud. Posnock has very interesting things to say but he won't spoon feed them to you. Probably only take his classes if you're interested in the topic, or stop by during the add-drop period and see how he strikes your fancy.\nWorkload:\nAbout a novel a week; a few short papers and a final, longer one; final consisting of identifications\n"
        },
        {
            "course_name": "Post-1945 American Literature",
            "review_date": "December 21, 2009",
            "review_content": "\nI've taken two courses now with Posnock and am still not entirely sure how I feel about him. I can definitely see how he might be dry to people not interested in the subject matter, but I find that he picks great books and brings them together brilliantly to make a substantive course. He also has some really interesting, kind of great quirks that are unreconciled in my mind, like his refusal to assume any baseline of knowledge in his students (he'll ask if you've heard of Henry James or Jim Crow laws) and his insistence on correcting people he's asked to read out loud. Posnock has very interesting things to say but he won't spoon feed them to you. Probably only take his classes if you're interested in the topic, or stop by during the add-drop period and see how he strikes your fancy.\nWorkload:\nAbout a novel a week; a few short papers and a final, longer one; final consisting of identifications\n"
        },
        {
            "course_name": "Post-1945 American Literature",
            "review_date": "December 21, 2009",
            "review_content": "\nI've taken two courses now with Posnock and am still not entirely sure how I feel about him. I can definitely see how he might be dry to people not interested in the subject matter, but I find that he picks great books and brings them together brilliantly to make a substantive course. He also has some really interesting, kind of great quirks that are unreconciled in my mind, like his refusal to assume any baseline of knowledge in his students (he'll ask if you've heard of Henry James or Jim Crow laws) and his insistence on correcting people he's asked to read out loud. Posnock has very interesting things to say but he won't spoon feed them to you. Probably only take his classes if you're interested in the topic, or stop by during the add-drop period and see how he strikes your fancy.\nWorkload:\nAbout a novel a week; a few short papers and a final, longer one; final consisting of identifications\n"
        },
        {
            "course_name": "Post-1945 American Literature",
            "review_date": "June 15, 2006",
            "review_content": "\nPosnock is an experienced lecturer and his knowledge of the material is unquestionable. We learned quite a bit about not only the authors and their works but how each played into the overall scheme of literary movements not only during the period officially included in the class (1945-) but the periods preceding the so-called rise of modernism and post-modernism. I can truthfully say that I learned a lot in this class and am glad I took it.\nMy only criticism of Dr. Posnock is his frequent need to speak of whites and, specifically, white males negatively. It's certainly a valid perspective with some of the material covered in class but I felt that he seemed to go out of his way to make race and/or \"whiteness\" an issue worth mentioning in just about every class. I wasn't offended by this but began to feel like the unwilling subject of some kind of pathological obsession of his.\nWorkload:\nMedium-Heavy. 2 short papers, 1 long paper and a final that revolves around identifying passages from the novels that were discussed in class and writing about their significance. While I felt that some of the passages were a little obscure, it certainly was a solid test of the material covered. You really need to attend the lectures, take notes AND read the material if you want an A in this course.\n"
        },
        {
            "course_name": "Post-1945 American Literature",
            "review_date": "May 31, 2006",
            "review_content": "\nThis was my first class in the department, and I really enjoyed it. The class and the professor throw around phrases like \"existential moment\" and \"Post-modernism.\" I really got a good idea of American literature in its transition from Modernism to Post-modernism, his choice of works was really good (far-ranging but all tied together), and Prof. Posnock is a good lecturer too. Although it only satisfies two distribution requirements for the major (and the two easiest to satisfy, in my opinion), it's a good class that I would recommend.\nWorkload:\nIt was 8 short novels and a handful of short stories and essays. The only work was two short, 4-5 page papers (20% each), one longer paper of 8 pages (40%), and a 20% final that was really easy.\n"
        },
        {
            "course_name": "American Realism",
            "review_date": "December 23, 2005",
            "review_content": "\nEven in the first class, there were too many large pauses and stretches of silence.  Posnock does not give an extended, protracted lecture, but usually gives short statements about one issue, pauses, contemplates, and then gives the next.  Lectures would probably have been more engaging with more student input and participation, but since most students probably did not do much of the reading, most did not have much to say, and the class then quietly went on.  In private exchange and office hours, Posnock is brilliant and informative and can point you to a wealth of resources, but in class, he is slower and sometimes tendentious.  He made it clear from the first class that the impact of capitalism and lack of individuality would be salient themes.  So that led to him asking in each lecture, \"Is there really such a thing as a free individual?\"  The theme is relevant, but sometimes it rose to the point of being hyperbolical.  Close readings do not just ratify only one interpretation, but the economic/capitalist one had unquestioned dominance in the class.\nWorkload:\nHalf or one-third of a novel per class session.  Two smaller papers (4-5 pages each) and one longer concluding assignment (8-10) pages on topics that Posnock specifies.  The specified topics will heavily relate to the theme of capitalism and the uncertainty/lack of individuality.  If you want your own independent subject for the last paper, you need his approval.\n"
        },
        {
            "course_name": "American Realism",
            "review_date": "November 13, 2005",
            "review_content": "\ni couldnt find a review on this guy before registering and i wish i had. i am not a literature major, nor do i care about ficticious books, but posnock does nothing to peak interest. first class he didnt say hello or introduce himself, he just started talking in the middle of a sentence and then i guess stopped at 4 o'clock. the lectures are extremely slow-paced, boring, monotonous, and not very relevant to anything else. posnock is an intelligent and nice guy, i guess, but i prefer teachers who teach the reason that theyre here and why we're reading this. the books were all about white/black woman/man relationships in the 19th century, and i hated the way all of them ended. in lecture he never talked about psychological factors, or interesting cultural things, and i found it very hard to know what he was talking about most of the time. i took as many notes as possible but theyre useless. he doesnt like to call on people when the idea is still in your head and i can tell people are sleeping in class. \nnice guy, boring subject, s-l-o-w lectures but luckily not toooooo much work.\nif you like literature youll probably like this course, but if you dont, STAY AWAY.\nWorkload:\ncompleting 1/3 of a book every class (approx) and two 5 page papers, one 10 page. im not a great writer and i got a B.\n"
        }
    ]
}