{
    "prof_info": [
        {
            "prof_name": "David Kornhaber",
            "prof_id": 2254,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 27, 2009",
            "review_content": "\nCouldn't agree more with the Nov.14 reviewer.\nI was doomed to take UW, but he made it bearable or indeed I enjoyed his class immensely, partly because the interactions between him and class often caused laughter.\nHis full-page+ comments/feedback on each essay were incredibly helpful and insightful.  Genuinely cool, funny, laid-back guy who will be created 1st Baron of ... Czech or whatever country and become Baron Kornhaber in the near future lol\nBtw, he's a CU grad, but did you know he is a Harvard College grad? I noticed that when I first saw him wearing a crimson scarf. Google his name, and you will find out more about him. \nBad news is he won't be teaching at CU anymore. \n \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 13, 2007",
            "review_content": "\nDavid is great!  He explained to us what we needed to know--nothing more, nothing less.  Grading was very fair, and his comments are very helpful.  Plus, he makes a normally mundane class actually bearable.  If you have him for UW, stay with him by all means.\nWorkload:\nThe 3 papers for UW that everyone has to write.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 08, 2007",
            "review_content": "\nHe is the best teacher I have ever had in my life! If you get him, you completely lucked out. He's hilarious and he takes a generally boring and burdensome required class and turns it into something actually worth waking up in the morning to go to. The class is an hour and 15 minutes....the first 15 minutes is spent talking about everyone's weekend or w/e, then for the next 30-45 minutes he'll teach...then we leave early. And the best thing is that, even though he was a laid back teacher, I learned a lot from him. He is absolutely the best teacher I think I will ever have!\nWorkload:\nThe four papers (each one with a draft) mandatory for all UW classes. Always giving extensions. Other than that, basically nothing. He's generous with grading. Just follow his corrections from the drafts.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 29, 2006",
            "review_content": "\nThis guy mad a particularly useless class a lot of fun, and if you have a chance to have him you should probably stick with him.  On the first day it seems as though the course is going to be packed with work, but once things start rolling you find that time just flied by.  Four papers are required for the course, all relatively simple, but the CCP research paper is a pain.  The fourth one is easy, just reflecting on one of our previous essays.  He gives us ample time to complete the essays, and he leaves individual comments that are useful and beneficial to creating a better essay.  He's a relatively fair grader, as long as you correct the mistakes that he points on your drafts.  All in all, a great guy, if you get the essays in on time and correct mistakes from the drafts, you should be in for an A/A-.\nWorkload:\n4 Essays, CCP research is a pain but doable\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 16, 2006",
            "review_content": "\nDavid made what could have been a very tedious class interesting.  Drafts were required for all papers - just be sure to make all corrections as requested for the final draft.  Fair grader, genuinely wants students to progress and succeed.  \nWorkload:\nNo busywork in this class, there were 5 papers to write, drafts first and a few simple excersizes.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 22, 2004",
            "review_content": "\nExcellent professor for UW, probably one of the best you can get. Easy to work with, great sense of humor,  really down to earth. Very fair grader as long as you imrpove on your first draft by following his suggestions on the final draft..\nWorkload:\nMinimal work: 4 essays, some writing exercises and readings\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 05, 2004",
            "review_content": "\nThis was one of my favorite classes. David is funny and entergetic. He has a good sense of humor and is flexible for his students. On drafts he gives his students very helpful feed back.\nWorkload:\nlots of papers...no midterm....no final...some writing exercises for homework. very time consuming.\n"
        }
    ]
}