{
    "prof_info": [
        {
            "prof_name": "Peter Platt",
            "prof_id": 81,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "Shakespeare I",
            "review_date": "December 23, 2016",
            "review_content": "\nUnenthusiastic lecturer. Cynical, jaded, touchy, passive aggressive. Plays favorites and anti-favorites. Indulges people who ramble on and on unproductively in class.\nSeemed like he was really not invested in teaching. Would roll his eyes in boredom after he finished reading off his script. \nGrades papers in weird way. His grading scheme is streamlined for minimal effort on his part/his TA's part. Doesn't give a damn about quality of ideas--if your paper fits his required, formulaic structure, you'll get an A. And if it doesn't fit THAT STRUCTURE to a tee, you'll get a B. Even if everything else is there. In other words, the papers are not graded based on content. They're graded based on how well they fit his mold. \nNot usually what happens in lit classes, right? Ideally no.\nOverall: Avoid. \nWorkload:\nVery easy to fall behind--don't. There's just not enough to catch you if you do. \n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "December 21, 2016",
            "review_content": "\nThis is a great class, and Professor Platt is absolutely wonderful. Definitely recommended for anyone who wants Shakespeare to feel accessible and not too strenuous. Platt is the nicest guy, and his enthusiasm for the material is contagious, so you're motivated to do well and get deeper into the texts (though you can skate by with the minimum if you want, since participation isn't mandatory). But he really encourages class discussion and gets to know everyone's names and creates a great rapport within the class and makes people feel comfortable contributing without letting the discussion spiral in random directions. He's very good at guiding peoples' comments towards relevant points, and he's not afraid to steer the conversation when it's off track, but he genuinely gets excited when someone shares a new idea. He just knows a lot about Shakespeare and really wants to make everyone care as much as he does, and it's a lot of fun to be in a class like that. He also brings out the confusing or funny aspects of the text that might be harder to understand. Overall, highly, highly recommended -- Platt is just a really nice person (he brought us cookies to the final) and genuinely wants everyone to do well and will try to accommodate you as much as possible (extra credit options for people who did poorly on the midterm) and generally make your experience in his class as positive as it can be. \nWorkload:\nLight, a play a week\nMidterm and final with passage IDs that are easy because they're only passages he reviewed in class\n2 papers, one 4-5 pgs, one 6-8, with a HUGE variety of prompts to choose from, so actually quite liberating and fun\n"
        },
        {
            "course_name": "Shakespeare",
            "review_date": "May 09, 2010",
            "review_content": "\nProfessor Platt's the best English prof I've had here.  He's caring, hilarious, and knows a terrifying amount about Shakespeare. He works hard to get everyone involved in and enthusiastic about the class, and seems crushed when anyone isn't.  One of those professors who, bright and accomplished in Shakespeare criticism as he is, really seems here to teach.  If anything, he takes the class a bit too seriously -- but it's impossible to criticize him for that.  He cares about your education!\nIf you love Shakespeare, take a class with him.  If you don't love Shakespeare, take a class with him.  I did not expect to study Shakespeare this intensely, but it became impossible to resist.\nI've taken both a seminar and lecture with him, and he's great with both.  He's an entertaining lecturer, even at 9am, and even with a 70-odd person class, he manages to learn names and draw out discussion.  With the seminar, he does a fantastic job of integrating plays, criticism, his take, and ours.  He gives you a lot of freedom to pursue your own ideas and interests, but plenty of foundation to start you off.\nWorkload:\nSeminar was a lot of work, the lecture wasn't.  It's embarrassing not to talk or otherwise be unprepared for the seminar (as I said, he'll seem crushed).  For the lecture, you want to go to each class and read the plays, but on top of that it's just two short/mid-length papers and two exams.\n"
        },
        {
            "course_name": "Shakespeare",
            "review_date": "December 19, 2008",
            "review_content": "\nPlatt is one of the best professors I have had (I am nearly at the end of my time here). A knowledgeable professor, good lecturer (though he really gets going when the students start chiming in with their ideas), and completely unpretentious. At times he seems like an excitable child (not immature, just able to exclaim \"Yes!\"). He loves discussion, i.e. \"I can't wait to see what you guys think of ___\", ideas he hasn't thought of before, i.e. \"Ohhh. That's good.\". Honestly, I see why he is so highly praised. He deserves it. Yes, it is a morning class, but it is the most packed morning class I have taken (I've taken four others.) I don't know why he doesn't yet have a gold nugget. \nWorkload:\n1 play a week, 2 papers (one graded by him, the other by the TA, so they each do half the class's papers each time), midterm and final.\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "December 09, 2008",
            "review_content": "\nPeter is AMAZING. he was one of my favorite english professors that ive ever had at columbia or barnard. He is so willing to talk to you oustide of class and discuss grades, or just life in general. He is very flexible and kind and truly is passionate about the subject. He makes Shakesperian literature fascinating... I loved getting up every Monday morning for a 9am class just because he is so riveting and funny. He takes drafts for all papers and makes extensive comments and when people did poorly on the midterm he offered a makeup assignment for extra credit. Even if you never thought Shakespeare was your thing-- take this class, because then it will be. \nWorkload:\nOne play a week, 2 papers (one 4 pages, one 6 pages), midterm, final\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "December 09, 2008",
            "review_content": "\nPeter is AMAZING. he was one of my favorite english professors that ive ever had at columbia or barnard. He is so willing to talk to you oustide of class and discuss grades, or just life in general. He is very flexible and kind and truly is passionate about the subject. He makes Shakesperian literature fascinating... I loved getting up every Monday morning for a 9am class just because he is so riveting and funny. He takes drafts for all papers and makes extensive comments and when people did poorly on the midterm he offered a makeup assignment for extra credit. Even if you never thought Shakespeare was your thing-- take this class, because then it will be. \nWorkload:\nOne play a week, 2 papers (one 4 pages, one 6 pages), midterm, final\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "January 01, 2007",
            "review_content": "\nMuch of this class was just review for me, since I've read and loved all of Shakespeare's plays for many years. However, taking Platt's course exposed me to new ideas and things that I had not thought about before. This is exactly what university SHOULD (but too often does not) do. The professor himself is very charismatic and has obvious passion for what he teaches. The lectures are never boring (at least they were not to me) but he is too nice to really rein in some of the idiots who want to spend half of class talking about their nonsensical interpretations of the plays. This was the only bad thing. Platt is readily accessable - his office hours are right after class - and if you cannot go (as I could not) he is available by email, which is very useful. I would heartily recommend this class to anyone who is willing to do all the reading.\nWorkload:\nAbout 12 plays, 1 per week. Two papers (relatively easy, and he will comment on your first draft if you turn it in) a midterm, and a final. The final consisted of 6 play quotation identifications (all gone over in class) and 3 essays.\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "December 26, 2006",
            "review_content": "\nProfessor Platt is fantastic. He is witty, brilliant, and so enthusiastic about Shakespeare that you can't help but be sucked in. He also happens to be adorable, telling doting stories about his son and bringing in Oreos during the final. He is open to everyone's opinion and encourages alternative interpretations, but he's not wishy-washy about his own--he'll acknowledge and appreciate something he doesn't agree with but provide his own thoughts on it as well (not like some professors who will accept even the most outlandish of comments without question). I would recommend this class to anyone with an interest in Shakespeare, theater, the 17th century, language... The only problem is that a lot of people don't read the plays for every class period, so it's the same 6 people talking (\"doing the heavy lifting,\" as Platt says). But ultimately it's a great course, and Platt is a great professor.\nWorkload:\nA play a week, although many people don't read them. \nOne short (5-6 pages) close reading paper, one longer (7\n-8 pages) comparison paper. Midterm (play IDs, short close-reading essay) and final (play IDs, short close-\nreading essay, longer \"synthesizing\" essay)\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "May 17, 2006",
            "review_content": "\nI'm not a Shakespeare know it all or anything; I just took the class because of all the rave reviews on the professor. I don't regret it. He is what everyone says he is-funny, approachable, passionate. He made Shakespeare interesting and worth it to wake up at 9am. It's a 60+ class but about 50 on average will show. He grades based on participation, midterm, final, short paper (5 pages), long paper (6-8 pages). Midterm and final same format-IDs, Close-reading essay, synthesis essay (only in final). The quotes may seem daunting, but if u go to class, he only uses quotes that have been mentioned in class so if you go, not read the play, but follow in class-quotes won't be so hard. \nI agree he is a tough grader, but very fair. He's still worth it though! \nWorkload:\nparticipation, midterm, final, short paper (5 pages), long paper (6-8 pages). Midterm and final same format-IDs, Close-reading essay, synthesis essay (only in final). \n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "May 17, 2006",
            "review_content": "\nI'm not a Shakespeare know it all or anything; I just took the class because of all the rave reviews on the professor. I don't regret it. He is what everyone says he is-funny, approachable, passionate. He made Shakespeare interesting and worth it to wake up at 9am. It's a 60+ class but about 50 on average will show. He grades based on participation, midterm, final, short paper (5 pages), long paper (6-8 pages). Midterm and final same format-IDs, Close-reading essay, synthesis essay (only in final). The quotes may seem daunting, but if u go to class, he only uses quotes that have been mentioned in class so if you go, not read the play, but follow in class-quotes won't be so hard. \nI agree he is a tough grader, but very fair. He's still worth it though! \nWorkload:\nparticipation, midterm, final, short paper (5 pages), long paper (6-8 pages). Midterm and final same format-IDs, Close-reading essay, synthesis essay (only in final). \n"
        },
        {
            "course_name": "Shakespeare I & Critical Writing",
            "review_date": "October 31, 2005",
            "review_content": "\nProfessor Platt is a tad bit overrated. Don't get me wrong, he's such a friendly and upbeat guy. He makes any discussion interesting and he is great at facilitating discussion. But he definitely picks / has favorites and is a tough grader. You don't necessarily have to attend Shakespeare in order to do well (at least that is my belief thus far), but all Critical Writing courses are mandatory. I would recommend him to anyone and everyone, but just don't expect a god or anything. He's a cool, laidback, family man that has an enormous amount of information on Shakespeare; he's so intelligent in that area! Still, he picks favorites, the same people tend to talk in class (and they just ramble sometimes and seem a bit pretentious) and he's a tough grader. \nWorkload:\nShakespeare: Two papers, midterm (memorize / be able to recognize Shakespeare quotes), final.\nCritical Writing: 3-4 papers (don't recall) and weekly response papers of one page in length.\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "July 14, 2005",
            "review_content": "\nHow to Win Shakespeare II:\nProf. Platt...hmmm... this was a case of too much hype, none of it his fault. Yes, Platt knows his stuff. Yes, Platt is nice, open, interested, quitely passionate. He's genuinely likeable as was the class. Just don't kill yourself trying to get in (ie sacrificing other classes). I did learn a lot about Shakespeare, but found myself trying to love the class more than it deserved. Since all of the other reviews are so scintillating, maybe it's just me-- but I have a feeling that a lot of people felt the same way. Here are a few things to maximum Platt's class. \n1) 9am: I'm an early riser; no problem; but format is Monday he lectures 1 hour and starts discussion for 15 mins; Wednesday was mostly discussion. The problem was Monday morning mixed with Platt's lecture; while his lectures I (later) discovered were finely tuned, they are uninteresting simply because of his monotonous tone. You'll get over the drone eventually, but you have to dig for the meaning there. Also, nothing from the lectures was ever necessary on an exam or paper. It was basically a do it yourself course. Hint: Come 2 minutes early since he starts right on time. He's not anal about it, but irritated certainly. Don't worry if you completely miss the lecture (though you'll certainly learn more if you pay attention); just build off of others in discussion, or, better come with your own questions (he loves this, especially since Monday's are dead).\n2) Discussion Style: It's easy enough to jump in or at least get your feet wet with Platt, since he's eager for new voices and opinions. At least in my section, however, there seemed to be the same group of \"Shakespeare\" freaks (they were well-meaning, but c'mon!) who would cite random information to prove how smart they were, I suspect, rather than to help the discussion along. They tend to dominate the class. If you're thinking I'm an angry, self-effacer, I also jumped in quite a bit and made a lot of great comments; but I know that the rigid topics he outlines combined with the shotgun-handraisers limited discussion somewhat. You won't get to know everything about the plays, but you'll get a good idea of Platt's version. Tip: offer newer insights that are somewhat on topic if you find yourself wanting to diverge; and don't worry about the \"freaks;\" a lot of the time their wrong anyway, and just enjoy hearing their own voices; do yourself and the rest of the class a favor and look up some obscure notes on the plays (ie. \"Much Ado About Nothing\" would have been pronounced \"Much Ado About Noting\") and then launch into an erudite tangent (to carry the example: The play deals with plenty of situation of eavesdropping or \"noting\".) Also, connect to other plays (from the class, of course) however strange the connection may seem, as long as you can back it up.\n3) Don't stress about having to know quotes for the exams; it's not always stuff he's announced in class, and if it is, it's a random part of it that's less recognizable. It's daunting, but there are a couple of really good websites that offer Shakespeare quotes (one in particular that offers everything that ever showed up on his exams, including scene and speaker). Google it, and read through all the quotes on the site for each play, reference it back to what you read in class, and you'll get everything . \n4) The plays--become an expert on one of the plays, preferably one you like, but if you don't genuinely like any of them, pick a short one. Get to know all the quotes in it, and read all the FOOTNOTES (The Arden Shakespeare is the most useful text, and made every play more interesting; 14 bucks a pop.) Platt will be excited that you're the \"Macbeth\" girl or the \"Midsummer\" guy, will like you more, and will call on you when your play relates to discussion, at which point you will be thoroughly prepared to wow. You should read all the plays, and reread the parts he hammers in class for the exams.\n5) The midterm v. final:\nThe second half of the course runs much more smoothly and enjoyably than the first half (if you've done well on the first paper, which you will as long as your a good analytical reader); plus, the big essay question requires only one play, which can be from first semester, so you really don't need to worry about all the second semester plays. You can easily miss two of them (as long as you study the quotes). Also, the final was just generally easier (quotes were more identifiable; and he handed out cookies).\nFinal thoughts:\n-Do most of the work; come to know a few plays really well; don't worry about films or performances, though they can help; be eager, and he'll love you; he's a fair grader. \n-Platt is overated by many, but this is of no fault of his own. Don't come in expecting the best teacher in the world, but you can expect a very pleasant if sometimes slow class, and a nice guy who's trying toget everyone to love Shakespeare. And find that website with the quotes! It'll bump you from a B+ to an A- or A easily. If you're one of the freaks, tone it down, please; you're annoying as hell!\n\nWorkload:\nVery Manageable\n1 play per week, two papers (4-6, 6-8) fair grader participate somewhat, not because of the grade, but he'll like you more and be more lenient. I got an A and the class never stressed me. \n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "April 25, 2005",
            "review_content": "\nIt's a 9AM class but I promise you, you will still want to go. Professor Platt is amazing - he knows what he's doing and this class is a great follow-up for any critical writing class. His analysis of each individual play will get your brain churning - about energies of comedy, tradgedy, romance, tragicomedy and so forth and how this world is not in black and white but in shades of gray - ingenius stuff...you will really be missing out on something special if you have never taken a class with this gem of a professor. If you're in the English Dep. you may see him around and he's a very sweet guy - will remember your first AND your last name even if there are five other people with the same name and there are 60+ people in the class. Granted, it is a plus if you participate! Also a hint if you want to understand the text without trying too hard working through the meanings of Shakespeare's language - go and watch the films. the BBC/time-life videos. it will save you a lot of time and energy for your other classes... then for the midterm and final, and the papers, you can read through the play and understand what's going on and who's saying what because you've seen it. This is a class where it pays to watch the movie and then read the book. \nWorkload:\ntwo analysis papers, midterm, and final\nnot very hard if you follow my hint\n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "March 23, 2005",
            "review_content": "\nWhen I read all those other reviews, I can see where they're coming from. Platt is so excited about the material and he's really knowledgable. My complaint is not about his lectures; they were great. But the man does not know how to lead a discussion. Some teachers know how to let go a little, let the students talk about what interest them (as long as it's not bullshit). He has a very strict agenda for his classes and knows exactly what he wants to talk about. That being said, if you're an English major, he's one of your better bets for the colloquium. \nWorkload:\nLots of reading but interesting stuff. Nothing unreasonable\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "December 29, 2004",
            "review_content": "\nI LOVE PROFESSOR PLATT! He is absolutely brilliant, intelligent, witty, and engaging. If you get a chance to take his class, do it; because you will learn to appreciate Shakespeare's works in a completely new way. While Professor Platt's lectures can sometimes get dry, the moment he gets to analyzing the text of the plays, his passion shines through. Furthermore, he involves the entire class in readings of the plays, and as another reviewer wrote, he NEVER puts anyone down for his/her ideas. Even if an idea seems a bit far-fetched, he finds a way to bring it back to the discussion and to tie it to the intent of the passage or play. His exams are very fair, including only ID's that were discussed in class; and the grading of the timed essays was very generous. The two papers were also fairly graded, with positive remarks and constructive criticism. I am not an English major, but I am seriously considering signing up for Shakespeare II because Shakespeare I was so wonderful. Take this class! :o)\nOh, and if you need any further proof that the man is brilliant, consider this: on the first day of class, there were well over 200 people who showed up for the lecture (some of whom were sitting in the hall because there wasn't enough space in the classroom). Professor Platt truly rocks :o)!\nWorkload:\nOne play a week as reading, which can sometimes get heavy but is not so bad (they're interesting!). Two papers, a midterm, and a final exam (ID's are not cumulative, but essays must include at least one play from the first half of the semester).\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "December 27, 2004",
            "review_content": "\nBeware: it's at 9am. But Platt is such a wonderfully engaging lecturer, and such a physically expressive guy, that it really won't matter that much.  The reading load is on the heavier side (one play a week) but dude it's SHAKESPEARE deal with it. What did you expect?\nOverall, great class. Highly recommend it. He picks favorites which is annoying, but he knows his Shakespeare and he'll get you to love even the weaker plays.\nWorkload:\nTwo papers, one 5-7pp and one 7-10pp. Midterm and final. Plus the weekly plays, this builds up (I am personally morally opposed to having essays AND exams, but what can you do?) The exams have quotations, so you better read all the plays. They're fair tests, though. He's a tough grader, so be warned.\n"
        },
        {
            "course_name": "Junior's Colloquium",
            "review_date": "December 16, 2004",
            "review_content": "\nPlatt is a kind, respectful, extremely intelligent man, and I loved his class. He really listens to and considers what his students has to say and never makes anyone feel that, in this case, her opinions or interpretations are invalid. I was really impressed at how quickly he can evaluate and idea and intelligently respond to it. I would definitely reccomend Platt to anyone who enjoys analyzing lit.\nWorkload:\nNot bad- 2 papers, 11 short writing responses to reading spread out over the whole sem and handed in at the end, and a final\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "July 17, 2004",
            "review_content": "\nThis professor and his course are equally delightful.  I entered the course a few classes late, without any prior interest in/knowledge of Shakespeare, and ended up really enjoying myself and learning a lot. The papers, midterm, and final are exceedingly fair (the final was even on the easy side, since it was almost exactly like the midterm) - he only asks questions on the exams about passages we went over in class. You don't have to participate, but he will really, genuinely appreciate it if you do, and he never puts down a student if she gives an answer he wasn't looking for, or rambles, etc. He always finds a way to incorporate it.  And he makes it fun, which is hard for both professor and student at 9 am on a Monday in the dead of winter. I highly recommend this class.\nWorkload:\nOne Shakespeare play per week, preferably read in its entirety by the first class of the week (Monday 9 am) - that gets a little heavy after a while. Midterm and final as described above. Papers were interesting and challenging - first is 4-6 pp, second is around 8 pp.\n"
        },
        {
            "course_name": "Renaissance Drama",
            "review_date": "April 13, 2004",
            "review_content": "\nI love Professor Platt.  I was dreading his class because I personally hate renaissance literature but had to take it to fulfill the pre-1800 requirement, and I was definitely pleasantly surprised.  He leads discussion like a pro...he lectured very, very little and tries to call on everyone as equally as possible (if you have your hand raised).  I found him generous with his grading...and any professor who writes \"Thanks\" on my paper for...I don't know, providing him another paper to grade?...is awesome to me.\nWorkload:\n1 3-4 page paper, a 1 6-8 page paper, a comprehensive final with IDs, close reading and comparative essay\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "March 30, 2004",
            "review_content": "\nI liked the first class so much I took the second! A little too much Shakespeare maybe, but Professor Platt is engaging and enthusiastic. Just the right amount of lecture and discussion. He won't call on you unless you raise your hand, so no surprises (in case you didn't do the reading). By far one of my favorite professors!\nWorkload:\n2 papers, midterm exam, final exam\n"
        },
        {
            "course_name": "Shakespeare",
            "review_date": "October 05, 2002",
            "review_content": "\nWhy do people like this man so much? I took the class on a friend's recommendation and was horribly disappointed. Platt's lectures are dry -- you don't need to pay attention, in fact, since he outlines each one on the board before class begins. Yes, he lets you read aloud in class -- in my opinion if he likes you. In my class, the same ten people read every single damn play. The man notices if you're absent, so do show up -- pillow firmly in hand. If the lectures were a mixed bag, the papers were even worse. Show a shred of intellectual curiosity or creativity that deviates from Platt's rather unoriginal standard and prepare to be run over the coals unmercifully. Grading on the papers is excessively harsh; especially if you dare to try something new. The exams were exactingly difficult, which would have been fine if they had been graded fairly, but again, I found that favoritism played a large role when the essay portions of the exams were graded. Look, if you want to kiss up to someone who seems to be \"a nice guy\", take this class. But if you want to learn something about Shakespeare, the real stars of the field are at Columbia. Take a class with Shapiro or Kastan. I sure wish I had.\nWorkload:\n2 papers, midterm, final. Study hard for the exams, and make sure the papers are absolutely perfect.\n"
        },
        {
            "course_name": "Renaissance Drama",
            "review_date": "May 17, 2002",
            "review_content": "\nProf. Platt is a sweet little elf of a man, and I enjoyed his class immensely. I haven't taken his much-lauded Shakespeare class because of my irrational and contrarian prejudice against the Bard, but now I'm very tempted. He generously attributed the liveliness of our class discussions (this is technically a lecture, but given its size it's run more like a seminar) to our brilliance as a class, but really it was his intelligence and skill as a discussion leader that made the class what it was.\nWorkload:\nNot light, but not awful. Two papers, I think 4-5 pp. and 6-8 pp. Readings can be tough going, but that should come as no surprise. There's no midterm, which makes the final that much harder: trying to review thirteen barely distinguishable and often extremely dense 16th- and 17th-century plays read over the course of four months makes for a helluva weekend.\n"
        },
        {
            "course_name": "W3335-W3336 Shakespeare, Renaissance Playwrights",
            "review_date": "December 31, 1999",
            "review_content": "\nYes, he's on sabbatical this year, but do not take Shakespeare with anyone else. The man has often been compared to Robin Williams from The Dead Poets Society for a reason. He is an exciting lecturer--even though the class is always on the early side, you will never fall asleep. He makes \"Shakes\" (as he refers to him) very contemporary. Students often read pertinent passages aloud, and Peter will frequently do so himself, declaiming them with a joy that is great to see. He really worships Shakespeare, but is able to criticize, as well. His usage of the Writing Fellow's system at Barnard is very useful for turning in a good paper--they see a draft of it, criticize it, and then you turn in a final copy. He is always very available to talk to students outside of class. Basically, he made a 60 person class feel like a seminar--he knew everyone's name, he was actually interested in what was going on with us--it was a really good experience.\nWorkload:\nSeveral papers and a final.\n"
        }
    ]
}