{
    "prof_info": [
        {
            "prof_name": "Tristan Lambert",
            "prof_id": 3199,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 28, 2013",
            "review_content": "\nTristan is fab. \nNo matter who you take Orgo with, let's face it, it's going to suck. It's a hard subject and a hard course, and no teacher is going to detract from that. That being said, Tristan has been doing this for a while, and he has refined his style and his course to make it as painless as possible, even - dare I say it - kinda sorta (sadistically) fun. \nTristan cautions that he will openly laugh at you if you call him \"Professor Lambert.\" He is friendly and helpful, and holds office hours regularly. He genuinely wants everyone to do well. He knows the subject sucks, he acknowledges this, and he does throw in a good joke here and there, generally keeping the class light, to try to relieve one's inevitable mid-orgo depression. \nHe posts meticulous lecture notes that he follows to a tee in class, which not only are a perfect resource for studying/knowing what's on an exam, but which make note taking in class a breeze - I just printed out and annotated his own notes, and was able to actually listen to what he was saying as opposed to missing key points while frantically scribbling down molecules. If you prefer to take your own notes from scratch though, he writes everything down on the chalkboard in an easy-to-follow, progressive manner. His content layout is organized and straightforward, sensible to the student who's glanced at the notes beforehand and can see where he's going. The book matches what he says, but he doesn't go directly by it, which is a plus really since it can give you an independent second perspective on a topic that may seem confusing. \nSo anyway. Take Orgo with Tristan. He'll make it better, I swear. \n \nWorkload:\nThree midterms and a final. You can drop a midterm or half the final if I remember right.  Readings and problems suggested and listed, but nothing turned in except the exams. \n"
        },
        {
            "course_name": "Orgo I and II",
            "review_date": "January 26, 2013",
            "review_content": "\nTake this class if you have to take orgo. Tristan is a no bullshit kind of guy on this material, he delivers straightforward lectures, and the exams a twisted a bit so not everyone will get A+s. I didn't even spend that much time on the material, the key is to understand every concept he stresses and know how to apply them. He is super smart, and he's not looking to prove himself by making orgo a nightmare for tired premeds. This has actually been my favorite class at columbia so far! <3\nWorkload:\nquizzes. study before and they pay off\n3 exams(drop one) and a final\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "November 11, 2012",
            "review_content": "\nI agree with the reviewers before that Tristan has very clear notes depicting every single mechanism. However, it is true that he does not really prepare us for exams. He lectures on the mechanisms but never actually connects each mechanisms to likely exam problems, so for me at least, it was difficult to apply what we learned in class to the exams. He presented the mechanisms and explained them but then we were left to figure out how to apply mechanisms to an actual question. \nI was also disappointed when I was having trouble in the class and emailed him asking to meet with me so we could figure out what was going wrong in the course. He never responded and I was sort of shocked since he always said he is really sympathetic to students who are trying, etc etc. He responded very quickly to other emails I sent regarding just logistical things but never that. I am not sure what happened. Again when I emailed him saying I may drop from the course and needed help, he didn't say anything.\nLambert is probably the best option in terms of the orgo professors and I am not saying he is a bad professor or a bad person. He is very funny in class and it was enjoyable going to lecture. I just think for me personally, I needed more than just presenting material and moving on. I needed someone who would connect ideas to the bigger picture i.e. more difficult reactions. That's just my 2 cents.\nWorkload:\n3 midterms and final. The lowest midterm was dropped or the final became weighted less.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 03, 2012",
            "review_content": "\nLambert is a very nice and available professor.  He also holds office hours which is another mini classroom session.  He is brilliant and a good lecturer. \n However, when it comes to feeling prepared for exams I'd have to rate him very low.  I personally need more than just a professor with a good personality and who is available- I need a professor who prepares me well for exams and gives me a good idea what to expect. I understand that this was his first time teaching organic chemistry I, but I had to literally dig for practice problems from other professors teaching orgo I to feel prepared for his exams. \n I think that as he teaches more Organic Chem I classes, he will have more problem sets and practice tests to give students. Also, doing the McMurry problems and knowing how to do all of the textbook problems will not guarantee success in his class.  He does not teach out of the textbook and his exam problems are MUCH more involved than any textbook problem.  I'd recommend taking him in 2 or three years once he has more materials and problem sets to give out. \nHis synthesis was challenging but doable. However, I personally his predicting the products and mechanism questions were the hardest- watch out for those. \nRecitation quizzes are easy but misleading. His tests are 4X harder than any quiz\nWorkload:\nokay. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 20, 2011",
            "review_content": "\nI was lucky enough to have  Tristan as my professor.  He taught orgo in a way that made me actually want to go to class (whereas with physics, I had to fight myself to go).  His notes are incredibly clear, his explanations all make sense, and he is more than willing to take questions.  He also holds a number of office hours, and is very sympathetic towards students making an effort.  He says at the beginning of the course that he wants everyone to do well, and he makes an honest effort to help people out by giving plenty of study material and exams that are very similar to the practice tests.\nThe 1st midterm was a joke, the next 2 midterms were challenging, and the final was cumulative but way more straight forward.  \nThe grading is superfair- 91% of the grade can be made up of the four tests each worth around 22.5%, with the final 9% made up of recitation quizzes, or the best 3 grades worth about 30% and the recitation quizzes worth 9%.  It's nice to go into a final knowing that it isn't 40% of your grade like other science classes, but instead is worth as much as a midterm.\nBottom line, take orgo with Lambert.  Honestly, the subject is tough, but as a Pre-Med you have to take it anyway.  He makes it as painless as possible, and is an all around great guy.  He is pretty funny too, I'd party with him.\nWorkload:\n3 midterms, a final.  9 recitation quizzes, ungraded problem sets that only help.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 12, 2011",
            "review_content": "\nProfessor Lambert is a really nice guy that cares about his students. Lectures are not too bad and he tries to make it interesting with the occasional lame joke or funny story. He'll make the reactions seem easy and logical during lecture but you'll still find yourself often confused when you do the questions yourself. The reality is that the material in Orgo 2 is not easy and will require a lot of studying, regardless of which professor you take it with.\nThere were 3 exams (drop 1) and a final. The averages were 77, (actually 87, but he was being nice and set the average lower cause he thought the class did really well), around 50 for the other 2 midterms and 78 for the final. I thought the exams were quite fair. Yes, there were questions that were tricky and tough to get without a really thorough understanding and intuition of the material, but there were enough points to go around to score well on all the exams. Synthesis questions are tough and you need to develop a good strategy or you could get stuck on those questions during the exams.\nIn contrast to the previous reviewer, I felt like I learned a lot of Orgo from Lambert and it seemed like he was a better choice than the other options available. I did quite well studying primarily from his notes, while checking the book occasionally. I thought it really helped that all his notes were posted online. Teaching on a blackboard is also infinitely better than powerpoint (which Turro did in my previous semester). \nThe major complaint I had was when he was away for several lectures--- and the fact that the 3rd and final exam was scheduled only 1 week before our final. Also, he gives a ton of ungraded problem sets, but the problem sets often don't match with what's being tested and there are sometimes mistakes in the answers (there are no step-by-step solutions, which makes it hard sometimes to figure out how they get their answer). But he also gives several practice exams w/solutions before each exam/final. I would advise to do those last and use those as your real test of the material, and just casually go through the problem sets to make sure you know what you're doing.\n\nWorkload:\n3 exams (drop 1), 1 final (cumulative). 3 exams + final worth a total of 91%, quizzes in recitation worth the other 9%\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 12, 2011",
            "review_content": "\nTristan is a good professor and deserves a silver medal. He is so enthusiastic about organic chemistry and very willing to respond to questions. Although it is true that he spent too much time on aromaticity, which in turn prevented him from covering the biochemistry chapters, the reactions he covered, particularly on carbonyl chemistry (crux of orgo II), were presented extremely thoroughly. The beastly nature of orgo II can be frightening, but Tristan makes it much much more tolerable. Plus, he has lots of supplementary problem sets (ungraded) and exams on courseworks. What more can you ask for? \nI learned a lot from this class and actually developed a love for org. chem. If you really pay attention and am genuinely interested in the subject, lectures are extremely valuable, since he presented lots of nifty-little tricks here and there and occasionally threw in jokes to cheer everybody up. He may initially seem intimidating, but as the term wore on, I got the impression that he was nowhere close to being arrogant and really cared about students; no offense, but think about the patience he has for some of the annoying post-bacs who tend to be show-offs and make one sick to the stomach.\nIn response to some of the complaints in the previous review(s):\n1. Occasionally, Lambert's notes do contain mistakes - that is why one should take his or her own notes and attend class. Besides, organic chem only sinks in through repetition and writing out the reactions yourself. The posted lecture notes are a good way to check stuff over and truly reveal the dedication that Lambert has for teaching, given the time spent on writing them. Profs are humans and thus not perfect. Please appreciate Lambert's efforts and quit whining. Also, the notes are already much better than the crappy, insufficient McMurry textbook. \n2. Exams - Usual Format: predicting the products, synthesis, mechanism (also extra credit available). They are hard, but not impossible to do well on, with partial credit awarded very appropriately. I find them to be rather fair (potentially fun) and focus proportionally on the stuff he taught. The tests are not meant to demoralize people, but rather to test for an extra level of understanding. Don't expect to be spoon-fed the material here at Columbia. Apply what you have absorbed in lecture and don't rely on rote-memorization (epic-fail!!!). Besides, everything is curved, which means that Tristan does not intend to mess people up on purpose. Stop fussing only about grades - try to be humble and actually learn. \nExam 1: Avg 85, STD 10.5 (To be nice, he actually rescaled the avg to 77).\nExam 2: Avg 53, STD 19 \nExam 3: Avg 49, STD 19 \nFinal Exam: Avg 236/300, STD 58 -> This was like a gift to us, although somehow people still did pretty badly on it. Either, they are retarded or stopped caring/ studying. \nIf Tristan wanted to, he could have just made this a killer, but instead chose to make it resemble the practice exams very closely. Pretty easy. \nBtw, for your information, we had Jim Leighton and Scott Snyder as guest lecturers for a couple of classes and they were also great. \nWorkload:\n9% Quizzes (be sure to shop around for a good TA, since one of them gives completely nasty quizzes that are harder than the exam itself and thus useless). Lowest quiz grade dropped. \n91% Exams (Three Midterms, One Final)\nOption 1: Drop 1 midterm. Remaining exams count for 30.3% each.\nOption 2: Each of three midterms count for 22%. Final is worth 25%.  \nAdvice - don't head into any one exam thinking in advance of dropping it. Take everything seriously and do not slack off. Otherwise, catching up will be hard and painful.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 12, 2011",
            "review_content": "\nEasily one of the best chem lecturers Ive had. Somewhat dry but overall very clear about the material, approachable and also has a good sense of humor. The exams ranged from straightforward to hairy (mean of 50 on two of them). Everything gets normalized at the end, probably curved to a B+, so I wouldnt be deterred by the CalTech mystique that surrounds some of the more difficult synthesis/mechanism problems. And the TAs were excellent, make sure to go early to office hours to avoid the herds of postbacs. \nWorkload:\n3 exams, 1 final, weekly quizzes. He'll drop the lowest exam if it improves your grade. \n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 05, 2011",
            "review_content": "\nI have no idea how this guy got a silver medal (or whatever that is). His tests are terrible. They are so long that lots of people don't finish and they are significantly harder than the material he goes over in class. The grading is really random so I suggest ALWAYS asking for a regrade because you're pretty much guaranteed to get more points. No basis to how many points you get at all and the TAs are all basically doing their own thing. He spent weeks and weeks on aromaticity and then expected us to memorize almost a hundred reactions that he barely covered in class. Lots of mistakes in his notes too (which he sometimes doesn't mention in class. watch out for that) He thinks he's funny, but really just seems pretty cocky. I don't think I learned much. I wish I could go back and drop this class. So make a better choice than me and pick another professor !! \nWorkload:\nA LOT. 3 exams, 1 final. weekly quizzes in recitation that count for not much (9% of grade). Most of the work is on your own trying to figure out what he's talking about since he didn't really go along with the text. \n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "June 24, 2009",
            "review_content": "\nProfessor Lambert is a fantastic professor. He is approachable and passionate about organic chemistry. I didn't do well at in Organic I, was horrified to take this class but thanks to Tristan I did well and somehow found organic chemistry surprisingly enjoyable. It's orgo, so you'll either love it or hate it, but Professor Lambert at least tries to appease the people that hate it. His exams are straightforward and he goes through different tools in his office hours that give a way to approach the material. All in all this is one of the best pre-med requirements I have taken at Columbia and if you can get Professor Lambert consider yourself blessed. \nWorkload:\nMedium. No homework, weekly quizzes. \n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 20, 2009",
            "review_content": "\nWhat a great professor! He is approachable, humorous and human. He put together clear and very cohesive lectures and posts all his notes online so if you miss class you can check the lectures online. That said, it is best to go to class since sometimes he will clarify mistakes he's made in his notes or change what's in them. He will take any amount of time after class to answer questions from students; additionally, while he sometimes delivers lectures in a sleep-inducing tone of voice, he crams in jokes whenever he can. His exams were very fair; if you understand the reactions you will do very well. One sidenote - there were two sections; one would take midterms on Thursday and one would take the exam the following Monday and usually the latter exam was more difficult. However, the MW section took the final exam three days before the other section and had a little less material and I've heard a slightly easier exam. So it's a compromise. I would definitely recommend taking organic chemistry with this professor. \nWorkload:\n3 midterms (one on the last day of class), recitation with weekly quizzes; psets (not due), one 300 pt final. You can drop one midterm if it helps your grade.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "August 07, 2007",
            "review_content": "\nProfessor Lambert is a sweet guy and in five years will be a truly excellent teacher.  This semester was his first teaching the class, so it hit the expected road bumps.  The exams were either too easy or far too difficult, which was frustrating in terms of gauging how much and what to study.  Also, he used a microphone, which is a huge soporific for some reason and always seemed to start feedback-ing at the most inconvenient times.  However, Lambert was highly approachable and seemed to really want everyone to do well.  He is enthusiastic, which is to me one of the most important traits in a professor.  After a semester of Cornish (highly organized and highly demanding) this was a bit of a letdown, but as he becomes more organized and develops a more sure teaching style he will become one of the department's best teachers.\nWorkload:\nIt's Orgo.  There were 4 midterms and one final = 7 units; drop two of the first five.  Occasional problem sets that were long but straightforward, and weekly quizzes during section.  Study hard for the third midterm especially.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "April 15, 2007",
            "review_content": "\nLambert is a nice normal youngish guy and he explains things fairly well in class.  That being said, he also is a horrible tester.  His tests are way too long/difficult and the synthesis problems often border on nightmarish. Part of the blame lays with Orgo itself - it is a necessary evil that is going to be painful no matter who you take it with (especially 2nd semester). But Lambert's tests are worse than Doubldeday or Cornish (I've been told by classmates) on difficulty level. \nThe peak of the bell-curve on our last test was in the 30s (with an ave of 45). Lambert seems to assume we are at a level a bit beyond first year Orgo, that this isn't all new and confusing stuff - i.e. he raced through an entire chapter's worth of complicated reactions the class before the exam and *poof* we were expected to be at an advanced level of understanding of all the mechanisms in addition to the last 3 chpts in time for the lengthy exam of jumbled synthesis problems.\nI understand the idea of testing a level beyond where the class is at, to get a distribution, but it is frustrating to feel like you know the material but cannot reflect that on the exam because the complexity is just one step out of reach.\nTo give some context, I took Doubleday last semester, had no trouble getting an A. Lowest premed/science grade before this class: A-.  I am expecting something in the B range.  Like I said, a lot of it is just the nature of the Orgo beast.  Put in enough time and you can do well with anyone - Lambert's tests  will just take a lot more prep time if you want to get an A. \nWorkload:\n4 midterms, Pop-Quizes in recitation, a \"3-midterm\" Final.  Lowest 2/7 \"midterm\" grades dropped (but max of 1/3 of the final may be dropped).\n"
        }
    ]
}