{
    "prof_info": [
        {
            "prof_name": "Rachel Silveri",
            "prof_id": 9450,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 04, 2016",
            "review_content": "\nI took this class over the summer and was pretty happy with it. You'll spend a lot of time in the dark looking at slides but that's to be expected I suppose. I found that Rachel graded fairly. The exams were open note. The only thing I would warn about it messing around during class with your phone or something like that, because she will basically cut you. Also, she doesn't seem to love being disagreed with, which was odd. However, the lectures weren't boring and the material wasn't difficult. \nWorkload:\nAverage.\n"
        },
        {
            "course_name": "Art Hum",
            "review_date": "February 03, 2012",
            "review_content": "\nI had Rachel as my Art hum instructor in fall 2011. I basically knew nothing about art history coming into the class, but I learned a lot and plan on taking many more classes in the department. She's a fantastic lecturer and the readings weren't bad at all. The material gets way more interesting near the end of the semester when you hit Pollock and Warhol. \nFor the first two papers, she gave us a list of works to choose from and write about (if you wanted, you could propose any other relevant work as long as it could be tied back to concepts we learned in class). For the third paper, we could write about any work. I really loved the flexibility she allowed with our topics/thesis choices for our essays -- I found that it was enjoyable and engaging to do research about an artwork that truly interested us.\nOverall, HIGHLY RECOMMENDED. \nWorkload:\n-Reading and 1 double paged response due before every class\n-3 papers (the final one is research)\n-1 group presentation about an NYC museum \n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "May 16, 2011",
            "review_content": "\nI loved this class, it was by far my favorite.  I am an art history major as a result.  I thought that Albero was great but I absolutely LOVED my TA, Rachel.  There were weekly assignments of readings but she outlined all the important points so there was no need to actually do them. She was so knowledgeable and super engaging...discusssion section was the best part. \nAlbero was a pretty good lecturer, at points he was a bit boring but BRILLIANT. I loved when he would deviate from his notes and expand upon something he was so passionate about. \nDo yourself a favor, no matter what you are interested in, TAKE THIS CLASS. \nWorkload:\nAs long as the subject matter is of intrest, not hard a lot. requires studying before midterm and final. Wish I had worked a bit harder on paper (5-7 pgs), but still got an A.\nMidterm, final, paper, weekly readings and going to lecture (even if you are only half listening...it really helps).\n...Also no ID's, major plus!\n"
        }
    ]
}