{
    "prof_info": [
        {
            "prof_name": "Uttara Coorlawala",
            "prof_id": 2978,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Indian Dance",
            "review_date": "May 15, 2014",
            "review_content": "\nThis review is written by two authors from two separate semesters.\nUttara is just awful. Dance- wise: she is obviously very talented and experienced. But, she constantly mixes up and forgets steps, is not organized in her counts, and we only dance for about 15- 20 minutes- the first 35 minutes is yoga. \nPersonality- wise: if you're in a class with Indian women,she will automatically and very blatantly favor them. One of these authors was in a class without any Indian women, but was still treated horribly. Uttara comments on your flexibility, is incredibly critical in a nonconstructive way, and worse, she does it all in a fake, sickeningly sweet voice. She is incredibly difficult to deal with and very unorganized.\nAll in all, if you are willing to have a less than ideal professor, and are really interested in learning classical Indian  (NOT Bollywood!) dance, then this class will provide you with a snapshot of bharatanatyam. It really matters whether or not you're willing to put up with her shenanigans.\nWorkload:\n2 absences allowed.\n"
        },
        {
            "course_name": "Indian Dance",
            "review_date": "December 25, 2007",
            "review_content": "\nPlease take this class! I had so much fun learning Bharatanatyum. It's not an easy style by any means; you leave dance class with very sore heels. But Uttara is such a sweet and patient woman! She will go over steps as many times as needed, and she will give you individual attention if you need help. She also tells great stories and gives all the cultural significance and history of Bharatanatyum.\nEach class starts off with around 20 minutes of yoga, and by the end of class, you'll know your  sun salutations, lol.\nWe performed a short piece at the end, which was nerve-racking, but still fun. Nothing negative about this class at all. GO FOR IT.\nWorkload:\nIt's a dance class! You show up, you dance, you leave, lol.\n"
        },
        {
            "course_name": "Indian Dance",
            "review_date": "August 09, 2006",
            "review_content": "\nAt first I was really excited to take this course. \nUnfortunately, Professor Coorlawala quickly crushed any expectations I had. Firstly, she obviously favored all the Indian students in the course, asking them to demonstrate moves for the class, even if they were unfamiliar with what she was teaching. Secondly, she often forgot the order of moves of the dances and the timing of the steps that she was teaching us and would have to be reminded by the students how the dance was supposed to go. Thirdly, and perhaps the biggest disappointment was that Professor Coorlawala made students feel really uncomfortable if they had to miss class for religious holidays. She would often make comments such as, \"the students who missed for religious holidays still need more practice\"- even though this was untrue. She forgave students for coming late to class because they overslept, but was unable to forgive students who had to miss for holidays (even though the policy of the dance department is that if you come late to class, it's an unexcused absence but religious holidays are excused). \n"
        }
    ]
}