{
    "prof_info": [
        {
            "prof_name": "Duane Lee",
            "prof_id": 3395,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "January 07, 2010",
            "review_content": "\nI almost completely agree with the last review of Duane. I just wanted to add how ridiculous it is that he expected us to write papers with our lab partners. None of the other labs had to write papers. It was such a waste of time and it happened around midterms for my lab. We mostly just sat inside and did lots of math. Also, I think he chose favorites and he could be rude to some of the students. He didn't explain things wells and would go back and forth about his thoughts. He seems nice at first, but as the semester wore on, I couldn't stand him and he became more temperamental.  \nWorkload:\nwe were suppose to have weekly quizzes, but sometimes he would cancel them.  we had to keep lab books with our work from each lab and write our reflections at the end of the lab. He was pretty nitpicky about the reflections when they were our thoughts. I couldn't believe we were graded on that.  \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "January 20, 2008",
            "review_content": "\nNice guy, horrible teacher. All other sections of this lab got to look at the stars...considering it was a nighttime astronomy lab, I don't think it was unfair to believe that was what our section would do, too. However, we just ended up doing physics labs all the time. They were poorly taught, the math was explained so horrendously I almost had panic attacks during our quizzes, and he was just not a good teacher overall. Even the assistant TA agreed with us that he wasn't doing a good job.\nWorkload:\n2 quizzes, one of which he threw out because he realized it was ridiculous to quiz us on calculus he hadn't taught us. Also a final paper and presentation.\n"
        }
    ]
}