{
    "prof_info": [
        {
            "prof_name": "Lan-Hsuan Huang",
            "prof_id": 9794,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "December 02, 2011",
            "review_content": "\nI would highly recommend Lan's Calculus II. Though her English is impressive for a non-native speaker, I could see how the language barrier might be a hindrance in Calculus I; however, in Calc II, after you've already been introduced to calculus, it's not a problem. She also makes a point of writing everything on the board (which may be in response to previous complaints), so your notes are comprehensive and relatively easy to use for studying. \nThere are 10 homework problems a week, which are highly manageable. Also, one week when she thought we'd be particularly busy, she only gave us 5 problems (and recently, because she thought a homework was really difficult, she allowed us to do an hour-long Q&A; session on it in class, which was very helpful). \nDespite a relatively short time in teaching, she both anticipates questions and answers them quite well. She understands what trips people up and has many alternative ways of explaining concepts. \nOn top of all this, she's an incredibly nice and modest person--particularly when you consider that her academic accomplishments (e.g. writing a dissertation on differential geometry and teaching a seminar in Riemannian Relativity--all in her second language) could make her very arrogant. She's also adorable, and it's hard to leave her class without a smile.\nWorkload:\n11 sets of 10 (or fewer) HW problems, two of which are dropped. 2 midterms, the first of which is not hard at all and the second of which is quite manageable if you do all the homework sets and make sure you understand them. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "September 08, 2010",
            "review_content": "\nI am going to be perfectly blunt.  Ms. Huang is a nice lady, but an absolutly ineffective professor.  \nFirst of all, she doesn't cover the homework in a meaningful way in class.  That is to say, she will go over some simple examples, which she will explain in a convoluted and confusing way, then assign problem sets which far surpass, in terms of difficulty, the examples she goes over in class.  \nShe also has a nasty habbit of going over the homework after it's graded, and says things like, \"oh most of the class missed these questions\".  But it never occurs to her that of course the class missed those questions, SHE NEVER WENT OVER IT IN CLASS!\nShe did the same thing with her midterm exam.  Instead of doing a comprehensive review before the test, she spent an entire class - after the exam was handed back - going over the questions that most of the class missed.  \nSecond, her english skills arent the best.  And I feel bad saying this, but it was a bit of a problem. Especially when someone would ask a question in class and she didn't understand the question and gave an answer to something completely unrelated.  \nThird, the TA's were worthless, and she was just as bad.  At one poit I was having a problem with one of the HW questions, which wasn't covered in the text, and emailed the TA, who - not at all promptly - emailed me back and essentially told me to figure it out on my own.  When I emailed Ms. Huang, she never responded and when I approached her in class she directed me to he TA and when I told her the TA's were of no help she told me to consider getting some tutoring and suggested that I wasn't studying hard enough. \nMost of the class quit attending the lectures as they were completely useless, and I am fairly certain that a significant percentage of the class was using a website called cramster, which is essentially a website that enables cheating.  I didn't use it and felt a feeling of helplessness thoughout the semester, had I not had a good friend who knew calculus and helped me though it I probably would have failed Ms. Huangs course.\nI would suggest you do not take this woman's class.  In my opinion she shouldn't be teaching until she A.) learns how to teach and B.) significantly improves her english.\n\nWorkload:\nheavy, she gives double problem sets.  and the exams are a nightmare to study for.  \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 29, 2010",
            "review_content": "\nWhen I chose to study calculus 1, I knew it would be like diving into icy water.  What I didn't realize was that Lan's class was frozen solid; I came out of the first two weeks with a mental broken neck and an unconscionably useless understanding of limits or whatever the hell it was we were learning back then.\n   Lan's spoken English is not perfect, which can cause some confusion when she doesn't write everything down on the board.  Frankly this made easing into her class most difficult, and I found myself skipping lectures about a month in or so simply because I didn't feel I was learning anything.\n   The first midterm was absolutely brutal; 26/50 was a B.  Plus Lan spent half the term giving us double-sized problem sets; no fun.\n   The math help room in Milbank became my weekly haunt, which will always be an option: regardless of whoever teaches your section, the TAs are really helpful and explain everything with remarkable clarity.  They'll tell you the book is straightforward and you should just read that but they're lying.\n   Strangely, about halfway through the term I came back to Lan's classes and started warming up to them.  While what she teaches won't seep through in one go, the TAs will explain all that you don't understand.  Plus Lan's stories about ancient Greek mathematicians and blunt addresses of Asians' propensity to allergies are amusingly cute.\n   In the end I am a fan of Lan's, although perhaps only for her quirkiness and not for her ability to teach calculus.\nWorkload:\nProblem set every week, was about 20 questions for the first half of our term but dropped to 10 later.  fewer than 10 webwork questions per week: written homework and webwork together 20% of grade.\nTwo midterms, first mind-battering second acceptable.  Cumulative final.\n"
        }
    ]
}