{
    "prof_info": [
        {
            "prof_name": "James Danoff-Burg",
            "prof_id": 2125,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "SEE-U",
            "review_date": "November 04, 2009",
            "review_content": "\nI \"experienced\" the SEE-U program with James a few years ago. We lived for 5 weeks at the Punta Cana Resort where James lectured 30 minutes each morning by the massage hut, then spent most of the rest of each day windsurfing and sailing while we students were doing our \"projects\" with the TAs. Mostly we were pretending to work since he didn't know the difference, but the TAs were serious about it, and were it notr fore them, we all would have been on vacation and no one would have been the wiser. We hardly ever left the resort grounds all month, the most artificial habitat in the DR except maybe for the golf course. Oh once Jame took us all to a night club in the back of a pick-up truck (not safe). The TAs were horrified with the entire program because they were real field biologists, unlike James who was clearly just there for vacation. Not a single fact about the DR was conveyed during this course except from the TAs. I heard James asking the TAs each night during dinner what they should do the next day, as in he had nothing planned for the course. The TAs carried the course, but there was no substance at all. I learned nothing, my entire project was made up including the results, but I got an A and fulfilled by Columbia science requirement!\nWorkload:\nNo brain power necessary, no text books or notes, only really graded on \"participation\" and your final repsentation which means just make it look like you're working and you're fine. Sometimes the days are long, but you're at a resort, so come on.\n"
        },
        {
            "course_name": "SEE-U",
            "review_date": "September 21, 2006",
            "review_content": "\nProf Danoff-Burg is a very nice man that teaches the world's easiest course.  That is actually the problem.  Unlike a course in the school year where an easy class is a nice break, living and breathing the course everyday is almost intolerable.  For the first couple weeks, you will enjoy yourself.  Eventually though, the fact that you are being asked everyday to argue as kindergartner over \"what the world should do if all just wanted it bad enough\" is kind of hard to take.   Especially when you bumb against his grumpy side.  A very sweet man that likes to teach but only offers you one point of view.  If you have any, truly, any relevant knowledge about sustainable development, environmental science or the like, be prepared to keep it to yourself or you will find out that he does not like contradictory views.  The tests are so easy you would think it would be a relief.  Memorize 5 definitions at night, get tested on them in the morning.  Unfortunately, he will then spend an hour or two explaining the five definitions or ten pages of reading.  At the end of it, you will be filled with confidence you can do science, but with a huge doubt that the scientits know what they're talking about.  And you may start to wonder how you got tricked out of you 7000 dollars to sit bored in a dormitory somewhere and come back probably less capable of arguing effectively for protecting the environment with only a very limited to cursory understanding of ecology.  It was really a shame too because the experience of living in a natural setting was truly extraordinary.  \nIn short, if you are interested in pursuing the natural sciences, definitely don't take this class.  If you care deeply about sustainable development or policy, definitely don't take this class.  If you're curious how science works, don't take this class.  If you really need a break from studying and want to go enjoy yourself for five weeks, this program is great.  Fair warning though: if you ever feel tempted to get interested in the material, ask questions, enjoy working, keep it  to yourself.  There are a whole bunch of hours to kill during the day and the course really wasn't set up for you to try to be productive or learn.  Your grade may suffer to because sometimes you will get so bored that its hard to stay awake through the daily tests of invented jargon.  \nWorkload:\nEasy.  About five pages of reading a day and daily group projects.  Five people to a project.  Enough work for only one person=  nothing to do all day long.  \n"
        },
        {
            "course_name": "Ecology",
            "review_date": "December 14, 2005",
            "review_content": "\nProf. Danoff-Burg definatlly does not put any effort into the class. He assigns problem sets and other work without even looking at it (as evident by the fact that we didn't cover some of the material we were tested on). He seems to have the class all laid out and then assigns the work even though he is never really caught up to where he wants to be. He also phrases his questions really badly - making problem sets and exams very confusing. Could be an easy class, but because I feel he does not communicate well, my grade is suffering. He also gave us a takehome final on courseworks for which we were asked to do research online about certain models we studied. If you couldn't find anything online, or found stuff but it wasn't exactly what he was looking for, you were penelized. He is a pretty harsh grader. Aside from that, he is a very nice guy and means well.\nWorkload:\nCould be an easy A if you understand him. Don't have to do any reading in Molles, but should read Gotelli. We had 3 problem sets and a few Ecobeaker (computer program) problem sets. He puts his notes online at the beginning of class and you can just add onto them. Warning - his questions are very badly phrased!\n"
        },
        {
            "course_name": "Ecology",
            "review_date": "January 02, 2005",
            "review_content": "\nProfessor Danoff-Burg is kind, but does not seem to put a lot of effort into the class - he has office hours just once a week at the West End, often corrects his notes in the middle of lectures, and can be slow in handing back graded items. He also does not seem to have a firm grasp of the subject. I find Ecology to be very dull, but Danoff-Burg gets students involved in the lectures with his wacky antics, personal anecdotes, and often so-lame-they're-actually-funny jokes. The readings are unnecessary and I did not purchase any of the texts, required or not, because his exams are based purely on the notes. Although the exams are not curved, they are quite easy and do not require much preparation at all. The final exam is cumulative, and Danoff-Burg covers a significant amount of material from the beginning of the semester on the exam (which is annoying), but overall, the exam is easy and the final grade is curved. If you want to avoid Evolution (and Morton) like the plague (I know I did), take this class. It may be boring subject-matter, but it's easy and Danoff-Burg makes it as entertaining as possible. \nWorkload:\nWorksheets, Two Midterms, and a cumulative Final Exam. Very easy!\n"
        },
        {
            "course_name": "Ecology",
            "review_date": "December 31, 2004",
            "review_content": "\nHe is a very personable man and really wants his students to do their best.   He uses powerpoint presentations to lecture, and prewritten notes can be downloaded off his homepage ahead of time.  He is the only professor that holds office hours at the West End, so its possible to have lunch and have your questions answered at the same time.    \nWorkload:\n2 midterms, 6 or 7 problem sets and a final\n"
        },
        {
            "course_name": "Ecology",
            "review_date": "December 29, 2004",
            "review_content": "\nThis class is EASY!  You don't have to do the readings, everything comes form the lecture.  Gotelli's \"Primer To Ecology\" is the only text on the list you need to buy.  It helps clarify the theorietical models gone over in class.  Overall this prof just wants you to have a general understanding of ecology. \nWorkload:\ntwo miderms, and final, and 5 problem sets\n"
        },
        {
            "course_name": "Island Ecology",
            "review_date": "June 03, 2004",
            "review_content": "\nThe class is easy. He wants his students to have some background in environmental biology or ecology, but his class is just a repeat of basic concepts. Be sure to participate in class (your grade depends on it). He seems to be a pretty good scientist, but I feel that he misuses philosophical terms.\nWorkload:\nNot bad - 1 short paper a week, and a big paper at the end.\n"
        }
    ]
}