{
    "prof_info": [
        {
            "prof_name": "Natasha Gill",
            "prof_id": 1154,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Re-Acting to the Past II",
            "review_date": "October 13, 2005",
            "review_content": "\nTake Reacting with Carnes.  It's his baby.  Gill was good, and I learned a lot, but you should really take the class with the man who invented it.\nWorkload:\nTons of reading (especially for the India game), and about 10 pages due for each game.  If you want to do well, you have to do much outside research.\n"
        },
        {
            "course_name": "Re-Acting to the Past II",
            "review_date": "June 16, 2005",
            "review_content": "\nFirst of all, Reacting II is NOT like Reacting I.  Reacting I was super easy, I wrote all my speeches randomly whenever I felt like it during the hour before class.\nReacting II is hard core, and it's largely because of Gill.  She expects a LOT out of her student, so definitely don't pick this up as a 5th course or if you think your semester is already so busy you can't handle an intense course.  It's 4000-level for a reason.  You have to do heavy heavy reading before each game, particularly the India game where the workload will be insane for a couple weeks, and you are expected not only to do research for everything you write or your speeches, but also to be able to off-handedly dispute everyone else's argument in class.\nThat said, you'll get a lot out of Reacting, particularly if you put a lot into it.  Reacting is such a unique class that is both challenging and interesting and frustrating at the same time, and Reacting II is far more so than Reacting I.  The games are a LOT more complex and you're expected to really know the background information and how to manipulate tricky situtions.  For some reason, the games also seem a lot higher stakes in Reacting II.  It was fun, but a lot of work sometimes.\nGill is a great Reacting professor--she is one of the most intelligent, articulate, and brilliant women I have ever met.  Her smarts can be intimidating at first, but by the end she really warms up to the class and is a very helpful and deft Gamemaster throughout.  She expects a lot (I think she said \"research\" more than any other word) but she turned out to be a generous grader (I was surprised to get an A at the end of the semester, sure that I would be getting an A-).  The one complaint I have is that she NEVER handed anything back.  By the end of April, we were all complaining because we had no idea how we were doing or if we should improve upon our papers or any way of measuring what type of improvement we should be doing, so I think she handed back one paper.  That's one thing that would be good to see changed in future semesters.  You turn in 3 newspapers for the French Rev. game, one per week, and you get absolutely no assessment for that entire game expect via the awards she gives for the best papers, which give you more clout in the game.  But Gill is very accessible, urging (sometimes even requiring) us to go to her office hours for 15 minutes before class and immediately responding to e-mails.  She'll really help you with anything that you need in a second.  Don't forget to use her as a resource--Gamemasters know more than the players.  \nI don't think I'm going to take another Reacting class, but I'm glad I continued with this one.  It was a great educational experience and one of those classes that make you happy you're at such a prestigious institution so you get opportunities like this.  I miss my fellow Reactors, as you become a big family by the end of class, and I have fond memories of the experience--that's really what Reacting is, an experience.\nWorkload:\nHeavy reading at the beginning of each game.  2 games: French Rev & India in 1945.  French: 3 papers of about 3 pages, turned into one person from your faction to be compiled into a newspaper for class.  India: 2 six-page papers which can double as speeches.  A multiple choice test on the readings which supposedly she never gives in other years but decided to give to us--I did miserably but it somehow didn't affect my grade.  Heavy research if you want to excell, mild research if you merely want to do well; how much is necessary is largely dependent on your role.\n"
        },
        {
            "course_name": "Philosophy of Education",
            "review_date": "December 20, 2004",
            "review_content": "\nPhilosophy of education was one of the most thought provoking and exciting classes I've ever taken at Barnard.  The class is based on discussion.  Professor Gill is really intelligent and upbeat. She also helped me tremendously with my writing. I'd recommend Professor Gill to anyone and everyone!\nWorkload:\n2 papers and an oral report.  no midterm or final.  reasonable amount of really interesting readings.\n"
        },
        {
            "course_name": "Philosophy of Education",
            "review_date": "July 11, 2004",
            "review_content": "\nProf Gill is an ex school teacher who thinks of her students as high school kids. Contrary to what the below reviewers said, I don't think she expects much at all from her students except good grammar and all that high school bull. And her students oblige her by acting like school kids. I won't deny that the woman is pretty smart, but for a person whose focus is educational theory, she doesn't run a very good classroom. We students are supposed to lead the way in discussion, but the discussion inevitably degraded into inane crap about some student's experience last summer or something similarly stupid. Or, worse yet, for one of the last books we read (Paolo Freire's Pedagogy of the Oppressed), we spent the bulk of classtime calling out concepts that we didn't understand from Freire's work with her writing them on the board. We pretty much filled the whole board with Freire's confusing words - and then Gill didn't explain anything about them. All she did was to draw lines connecting words that were somehow linked together - but we didn't know what he damned words meant! The woman cannot teach herself out of a paper bag. And how are you supposed to take notes to that? Write down a bunch of words and draw some lines?\nOh, and half of every class would be spent talking about class organization issues. Who wanted to meet with the proffessor this week, who couldn't make it to class next week . . .  It was absolutely infuriating. Straight out of high school. \nYeah, fine - the woman is pretty smart. But she can't teach.\n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "June 08, 2004",
            "review_content": "\n This was my favortie class. Yes Professor Gill expects a lot out of her Reacting students. But, truth be told, the more you put into this calss the more you get out of it. She is a really great instructor for Reacting, generally finding a good balance between letting us go at it, and getting involved. She really tried to mix up the factions for the second game so that the \"quiet people\" would be able to work in different groups and perhaps be heard. It is a second semester Reacting course, which by nature demands public speaking, so it is not crazy that she expects real particapation.  She does however approach the \"louder people\" as well, in hopes that they will allow the quiet people more room to get itn ot hte debate, which  was generally very heated. She was very encouraging; less than an hour after I gave my first speech, I  got an email  about it, giving me a needed confidence boost. She truly cares about her students both in class and outside of class. We went ot her house for dinner and were there for hours. The more work you put into this class the better you will do and hte more you will learn. I know more about India than france, becuase i worked my butt off for the second game, and am glad i did. she said herself that\"it is hard not to inflate grades in Reacting\" so grading is not so frightening. But you do feel a responsibility (or should) to do the work so that you dont screw over otehr people in your faction. Professor Gill is great, as was her Reacting course. If you are going to take Reacting II take it with Gill.\nWorkload:\nFrench Game-  3 weekly faction papers, which can be a pain becuase you need to submit them to your faction first so they can be assembled, but there is a lot of room for fun and creativity. \nReading: how much you depends on how well you wnat to be prepared, but a lot is assigned, and you can tell the difference between those who read it and those who don't\nIndia game- two 6-10 page papers, again alot of room for creativity in terms of paper. In this game research is ESSENTIAL but again, how much you do depends on how much you care about the class and its easier to do if you get into your character.\n"
        },
        {
            "course_name": "Re-Acting to the Past II",
            "review_date": "May 16, 2004",
            "review_content": "\nOne critical thing that Professor Gill must learn when teaching this course is that it is NOT her Philosophy of Education class. While it is appropriate for a professor to expect hard work, preparation, and dedication from her students it is not appropriate for her to expect the same type of performance for Reacting that she might receive in her Philosophy of Ed course. I repeat, Reacting is not a Philosophy course! Professor Gill is very approachable and kind, but her comments can be somewhat off putting at times. She doesn't ever take into account that some students need to be drawn out a bit more from their shyness and is quick to criticize the \"quiet ones\" of the class. This, however, does nothing to encourage students to be more vocal. What prepetually annoyed me was the professor's utopian ideals regarding learning and the fact that one is bound to always feel quite stupid in her presence.  Also, she ought to keep in mind that students have classes other than hers and cannot spend eons in the library researching every tidbit regarding France or India. Watch out for this course as you are bound to get much more than you bargained for.\nWorkload:\nReading, reading, and more reading. Papers as necessary for arguments and speeches. No midterm, no final.\n"
        },
        {
            "course_name": "Philosophy of Education",
            "review_date": "February 03, 2004",
            "review_content": "\nOK, first of all-- I was really surprised to read the reviews posted on Professor Gill.  Yes-- she does challenge her students.  However, Gill is one of the best professors I've had at Barnard/Columbia and I cannot recommend her highly enough.  I would encourage any other student to take a class with Gill before graduating.  Give her enough time; she'll be the next Dalton.  (You heard it here first)  She's dynamic, inspired, sincere and yet still grounded.  I don't really understand how anyone could leave one of her classes without a profound respect for Gill as a person and as a professor.  This was the kind of class where you bonded with your classmates whom you never met before over how wonderful the professor was.  You got the sense that Gill is one of those people that lives her life on a fuller, richer, deeper level and this vitality permeates her classes.  As far as the issues raised in the other posts: Gill is not married to the syllabus, but is by no means disorganized-- she's just realistic and will take more or less time as needed for certain subjects.  She does have high expectations but not unrealistic ones.  This is not the kind of class that you can sleep through-- but trust me, you'll never want to.  Her classes do seem to be run more like seminars with a lot of discussion.  She's sensitive to those who are quieter, but still encourages them to participate.  There was no favoritism in my class with her.  My only complaint would be that she likes to understand her students, but can label them too quickly.  I don't think she locks into those opinions though.\nWorkload:\ntwo papers, 6-8 and 8-10 pages.  no midterm.  no final.\nreading was reasonable.  you will have to do the work for this class.. and it helps to do the reading so you can participate in discussions.  but the workload is really not crazy.  nothing like a hard-core seminar.\n"
        },
        {
            "course_name": "Philosophy of Education",
            "review_date": "March 26, 2003",
            "review_content": "\nOk, so, She's harder than nails. But I can't fault her for that. I loved every second of the class; and she really forced me to go above and beyond. If you want a good grade, forget it. If you want a great experience that will truly make you an awesome student, a must-have. However, her level of expectation is extremely high which I feel is discouraging to all. But she will let you rewrite papers after she destroys them, so its all good.\nWorkload:\nno mid/final, 2 papers and oral presentation. Lots of reading\n"
        },
        {
            "course_name": "Philosophy of Education",
            "review_date": "August 30, 2002",
            "review_content": "\nNothing is ever enough for Professor Gill. Her expectations of students are very high, often irrationally so. She likes \"deep thinkers\" who participate frequently, and quiet students should beware before taking her course. While she was approachable to students, she was very forgetful and scatter-brained. Essentially, to be her student is very frustrating because her assignments are so unclear and she is very disorganized!!! \nWorkload:\nlots! many pages of readings, responses to readings, 2-3 papers, no midterm, no final\n"
        },
        {
            "course_name": "FYS: The Idea of Justice",
            "review_date": "June 04, 2002",
            "review_content": "\nThe title of this course makes me laugh because I can't express how exasperating Prof. Gill is-her teaching style and her comments are extremely unjust to students. While she demands much from her students, it is obvious that she is unprepared and disorganized with planning her classes. Our syllabus continuously changed and we only received 2 papers back (out of 4). She doesn't define her standards for grading and this ambiguity makes it impossible to get a sense for how you're doing in her class. I think she's a great teacher with respect to leading discussion and exploring controversial issues, but I often felt that she overstepped boundaries as a teacher. Prof. Gill quickly made assumptions and judged many of us because we asked for our papers and we wanted to know about grading standards. She can be a difficult person to talk to at times because she thinks she knows everything. The plus side is a good reading list, but I hope that you can avoid this class and her in general (she also teaching Philosophy of Education) if possible.\nWorkload:\nabout 4 papers (one supposedly ungraded, but who knows?). significant amount of reading. i have no idea (no one in my class does) of how she calculates grades, so maybe reading isn't even necessary. lots of people skipped from time to time. i guess she doesn't care about effort at all, cause i think they ended up okay.\n"
        }
    ]
}