{
    "prof_info": [
        {
            "prof_name": "Maja Cerar",
            "prof_id": 6915,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 22, 2015",
            "review_content": "\nMaja is a really nice person, but she isn't the greatest teacher. She isn't the loudest person, so she has to compete with the NYC sounds outside of Dodge. Her explanations in class aren't extremely clear, but not horrible to follow along with. She doesn't allow much discussion in class at all, and at least in my class the few kids that talked kind of engaged in a fancy pancy pissing contest. The blog posts, ten of which you have to post to the class blog, are kind of stupid, just busywork in my opinion. And the papers weren't that great. One was a cross-Core paper, which was not my favorite. We had to write it about super medieval stuff, and lot of my favorite stuff in the Core is of more recent history. The concert and opera papers also involved a lot of BS on my part. I wish she'd just ask us to write about our experiences at the events. The only period of music where I felt she wasn't on top of her game was jazz, which I personally enjoy. We did get three or four live performances during class from our classmates, a choir, and a jazz ensemble, which was really nice. One day she brought in her violin and played, which was awesome! I wish she did that more often. Where you'll actually learn something in this class is in the textbook, which actually is pretty nice to read. You can find it for free online as a PDF and rent the CD's from the bookstore (saves $$$). Overall, I wouldn't necessarily recommend her, but you have her by chance, just read the book and listen to the music, and you'll be fine. \nWorkload:\nA few chapters per class (and maybe a few extra readings) with listening pieces with them, three papers, ten blog posts throughout the semester, and a midterm and final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 22, 2015",
            "review_content": "\nMaja is a really nice person, but she isn't the greatest teacher. She isn't the loudest person, so she has to compete with the NYC sounds outside of Dodge. Her explanations in class aren't extremely clear, but not horrible to follow along with. She doesn't allow much discussion in class at all, and at least in my class the few kids that talked kind of engaged in a fancy pancy pissing contest. The blog posts, ten of which you have to post to the class blog, are kind of stupid, just busywork in my opinion. And the papers weren't that great. One was a cross-Core paper, which was not my favorite. We had to write it about super medieval stuff, and lot of my favorite stuff in the Core is of more recent history. The concert and opera papers also involved a lot of BS on my part. I wish she'd just ask us to write about our experiences at the events. The only period of music where I felt she wasn't on top of her game was jazz, which I personally enjoy. We did get three or four live performances during class from our classmates, a choir, and a jazz ensemble, which was really nice. One day she brought in her violin and played, which was awesome! I wish she did that more often. Where you'll actually learn something in this class is in the textbook, which actually is pretty nice to read. You can find it for free online as a PDF and rent the CD's from the bookstore (saves $$$). Overall, I wouldn't necessarily recommend her, but you have her by chance, just read the book and listen to the music, and you'll be fine. \nWorkload:\nA few chapters per class (and maybe a few extra readings) with listening pieces with them, three papers, ten blog posts throughout the semester, and a midterm and final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 19, 2012",
            "review_content": "\nProfessor Cerar did an incredibly poor job of communicating anything worth knowing in this course.  She often spent an entire class on a tangent, never addressing the topic we were actually supposed to cover.  Her notes on the board seem to be placed at random and make no sense, making it impossible to take notes.  In the middle of a sentence, she might write down one of the words she has just used, and expect that one written word to make all the difference to her poorly constructed lesson plan (assuming she even makes lesson plans).\nIf attendance weren't mandatory, who knows if I ever would have shown up, since I often felt like I wasn't gaining anything from her lectures and could have easily learned what I needed to know for the midterm/final just by staying home and reading the assigned readings.\nFor the midterm and final, she gave us a study sheet that included 140 vocab words (some of which included words that are impossible to define or to use in the context of a composition, such as \"octave\" and \"scale\") that were clearly copied and pasted from some online music dictionary, and told us that of the 140 words, 8 would appear on the tests.\nPlain and simple, she's a bad teacher.  The only time I ever learned anything in the class was when reading the textbook or when the TA would take over for a class period.  If you can, switch out.\nWorkload:\nWeekly readings from the textbook (that I put off reading until finals week and still did fine), you have to attend 3 concerts and write 3-4 page papers on the first two, and a 5-6 page paper on the last one.  A midterm and a final (that lasted an hour).\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 17, 2012",
            "review_content": "\nMaja, like the other reviewer mentioned, clearly cares about the well-being and interests of her students. The only problem is that this doesn't always translate to her teaching style, which at times can feel disjointed and vaguely non-sequitur. It was often unclear what her expectations were for various things (papers, midterms, etc) and even though she is rather generous as a grader, it was always difficult to discern where the grades came from and what they were based on, which made it a little difficult to cater to her style. \nShe covers the basic material necessary, but not in a way that evokes any particular interest or deeper understanding; it certainly feels like an obligatory course. \nIf you happen to get her for Music Hum, it's not the end of the world; you won't have a very difficult time in the class, but you might find yourself uninspired more often than not. \nWorkload:\n10 blog posts over the course of the semester (best to do these early in the semester while you still have the time and motivation)\n1 midterm (fairly easy) + 1 final + 2 short papers + 1 longer paper (6 pages).\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 27, 2010",
            "review_content": "\nMaja is a really nice person who clearly loves the field she's working in but as far as teaching goes she has more than a few kinks to iron out. Even when she seems to have a good grasp of the material (which is most of the time) she usually has trouble passing it on to her students in a clear way. Her writings on the board reflect this and are usually disjointed and not really worth copying into your notebook. That being said she is always open to questions during class or office hours which is a plus. Overall if you get her for this class it's not the end of the world as it's a pretty easy class anyway and she shows you lots of videos to make the time go by faster.\nWorkload:\nA joke. There's light readings twice a week, a departmental midterm and final and 3 papers that she grades. Two papers were ~3 pages, one of them was ~6 and 2 of them will be based on concerts that you go to as a class. She also offered up an extra credit assignment for which you had to come up with a topic by yourself. And there's ten blog posts of unspecified length which are easy to do if you start them early enough so you won't have to do all of them in the last 2 weeks of class. Overall, I ended up with an A- starting all of the papers the night before and never doing any of the readings so this is definitely a course that's light on workload especially if you boost your grade by using the extra credit assignment and talking in class, for which you don't really need to know anything, just talk about your feelings regarding the piece of music you're currently listening to. \n"
        }
    ]
}