{
    "prof_info": [
        {
            "prof_name": "Catherine Steindler",
            "prof_id": 11652,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 09, 2017",
            "review_content": "\nI came into Columbia feeling pretty confident that I was a good writer. Catherine reminded me that I still have A LOT to work on. Even though we only wrote three essays, the class felt quite difficult. She really pushed us to improve our writing. She gave us extensive feedback on ungraded rough drafts, which was nice. On every essay I wrote, I found myself completely starting over once I had her comments on my rough draft. Overall, I think Catherine was a really great teacher. She's kind, funny, and understanding. Even though I found the texts we read quite boring, I think she gave me a lot to improve on as a writer. The class didn't make me want to go into literary criticism, but definitely gave me a lot of tools that will be useful in the rest of my academic career.  \nWorkload:\nReading is very light. We wrote three essays. One of them was a research essay. \n"
        },
        {
            "course_name": "First Year Writing: Women and Culture ",
            "review_date": "December 08, 2016",
            "review_content": "\nCatherine is such a sweetie and I recommend her to everyone!!! She is great at facilitating class discussions and she has a terrific layout to the course. I love the material we cover and she is so knowledgeable on the topic so we always learn extra stuff from her each class. The class surveyed the history of women and their role in society from ancient times to modern, jumping around in between. \nCatherine gives great feedback on her essays, though sometimes it will take a bit for her to return the essay. She is not an easy grader, but I think she is very fair. It is definitely a bit of a crapshoot on the first essay, but after that you will have a really good idea of what she is looking for. The essays aren't too difficult and the reading is hardly ever over 20 pages. Overall I highly recommend Catherine's class. \nWorkload:\nReading due almost every class (around 20 pages, so nothing heavy) \nParticipation in discussions - 10%\n2 regular essays (1200-1500 words) - 25% each\nResearch Essay Prospectus (a couple pages) - 5%\nFinal Research essay (1800-2500 words) - 35%\n"
        },
        {
            "course_name": "First Year Writing: Women and Culture ",
            "review_date": "December 08, 2016",
            "review_content": "\nShe is amazing!!! Her feedback on essays and ideas are infinitely helpful and extremely constructive. She's extremely intelligent and articulate and it really rubs off on her students. She pushes you to improve your technical skills, while still encouraging creativity and imagination. \nWorkload:\n2-10 page readings assigned for each class. 3 graded papers. Workload isn't overwhelming and is actually productive. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 21, 2012",
            "review_content": "\nCatherine is a wonderful University Writing teacher, and I'm so glad I had her.\nHer class was more difficult than I feel like a lot of other sections were, and sometimes I felt that the homework got tedious or became unnecessary, but overall, I learned SO much from her about how to write, improve, and revise. She is absolutely fantastic.\nCatherine is incredibly caring, and she really wants you to get a lot out of the class and improve. All of the readings were really helpful, and a majority (I'd say 85%) of the assignments were helpful in guiding us toward good arguments and claims and framing our essays (especially the research essay). \nOn top of that, she always leaves very extensive comments on everything you hand in (especially the drafts) so that you know where you need to improve and how. I think she also develops some of the assignments and classwork based on what she thinks the class needs to do more of. During conferences, she was always open if I needed to meet more than once or she would give me some extra time if there was a lot I wanted to talk about/go over with her, and she made really good points and explained all of her comments.\nThe only thing is that we also did a lot of peer conferencing which I didn't feel was as helpful of feedback and could sometimes be counterproductive. However, if someone makes a comment in class about your essay that she doesn't agree with (i.e. she would/wouldn't want you to change) she'll usually say so so that your grade doesn't suffer.\nAs I said, the class is harder. She gives more assignments and work (we always had a lot of reading at the beginning of a unit (lens/conversation/research) and there's an assignment due basically each class). And she's a harder grader. She really pushes you to be a better writer. \nBut it's completely worth it. I wouldn't trade the experience for any other section, and anyone lucky enough to be in her section should definitely stay in it.\nWorkload:\nHeavy:\nLens essay - 20%\nConversation essay - 30%\nResearch essay - 40%\nRetrospective essay - 10%\nReading each unit, assignments due each class\nExploratory, formal, and final draft for each unit\n"
        }
    ]
}