{
    "prof_info": [
        {
            "prof_name": "Xin Wan",
            "prof_id": 12679,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus IIA, IIIA",
            "review_date": "April 15, 2016",
            "review_content": "\nDr. Wan is the best professor ever for a Calc III class. He has a slight accent but it does not affect understanding in any way. He make lecture so clear and concise. 10 minutes of his lecture make you understand everything that would have otherwise taken you an hour to figure out the textbook yourself. He will stop after finishing theorems and examples and literally wait quite some time to make sure you understand and have no more questions. His homework is fair and easy. His exam is similar to practice exams, but only a little more on the volume of calculation. I became a Calc 3 tutor afterwards. Compare to my tutees' professors, his section is way more structured and fairly graded/curved. If you see his section for Calc 3, take him. If you are a math genius who like the professors to be more confusing or challenging, then pursue others. \nWorkload:\nFair. Weekly written Hw and Webassign. 2 Midterms and a Final curved. \n"
        },
        {
            "course_name": "Calculus IIA & IIIA",
            "review_date": "January 17, 2015",
            "review_content": "\nLet's nuance these reviews... Xin Wan is not a \"terrible\" professor. \nHe's a nice, young guy who certainly is not a good lecturer, but does have good intentions. During class, he would skip steps in problems and write notes quite fast, but he would gladly pause to answer any questions (he actually asks specifically if we have any questions at the end of each example/problem/demonstration). However, I must admit that his goodwill won't always answer the question and most often you'll have to resort to other students or to the textbook to understand entirely. It's true that a lot of the work will have to be done on your own (mainly going through the notes again after class and reading the entire chapter and practising the examples in the textbook). Prof. Wan takes almost all of his problems on the midterms/final from the textbook so honestly it's not that hard once, you understand the concept...\nwhich is why I would encourage you to take Xin Wan's class if you are already slightly familiar with the concepts covered in Calculus II. If these are totally foreign to you, then the class might be harder, preciely because Prof. Wan has a hard time giving abstract definitions and introductory notions (the basics). \nIf you're familiar with Calculus II concepts, then th class will actually be quite easy. Prof. Wan is an understanding person who will honestly admit that the examples/demonstrations he does in class are much harder than the problems that will be on the final. \nThe weekly homework is about the same level of difficulty as what is on the exams. \nOverall, I would encourage you to take Wan's class if you don't want to spend your entire week doing calc (the worload is really light) and if you're already slightly familiar with Calc ii concepts. \nWorkload:\n- 1 Webassign problem set a week (between 4 and 10 questions) \n- 1 written assignment a week (about 2-3 problems from the textbook)\n- 2 midterms (same format as the final)  \n- 1 final \n"
        },
        {
            "course_name": "Calculus IIA & IIIA",
            "review_date": "January 17, 2015",
            "review_content": "\nLet's nuance these reviews... Xin Wan is not a \"terrible\" professor. \nHe's a nice, young guy who certainly is not a good lecturer, but does have good intentions. During class, he would skip steps in problems and write notes quite fast, but he would gladly pause to answer any questions (he actually asks specifically if we have any questions at the end of each example/problem/demonstration). However, I must admit that his goodwill won't always answer the question and most often you'll have to resort to other students or to the textbook to understand entirely. It's true that a lot of the work will have to be done on your own (mainly going through the notes again after class and reading the entire chapter and practising the examples in the textbook). Prof. Wan takes almost all of his problems on the midterms/final from the textbook so honestly it's not that hard once, you understand the concept...\nwhich is why I would encourage you to take Xin Wan's class if you are already slightly familiar with the concepts covered in Calculus II. If these are totally foreign to you, then the class might be harder, preciely because Prof. Wan has a hard time giving abstract definitions and introductory notions (the basics). \nIf you're familiar with Calculus II concepts, then th class will actually be quite easy. Prof. Wan is an understanding person who will honestly admit that the examples/demonstrations he does in class are much harder than the problems that will be on the final. \nThe weekly homework is about the same level of difficulty as what is on the exams. \nOverall, I would encourage you to take Wan's class if you don't want to spend your entire week doing calc (the worload is really light) and if you're already slightly familiar with Calc ii concepts. \nWorkload:\n- 1 Webassign problem set a week (between 4 and 10 questions) \n- 1 written assignment a week (about 2-3 problems from the textbook)\n- 2 midterms (same format as the final)  \n- 1 final \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 23, 2014",
            "review_content": "\nXIN WAN IS THE BEST THING TO HAPPEN TO COLUMBIA. every time I went to calc II he was there with a bright confused smile to help me through this course. without his adorable optimism and happy face, I would have hated calculus. BTW HE SENDS ADORABLE APOLOGETIC EMAILS ABOUT CULPA REVIEWS. ok it says this review isn't long enough and ihave to go so                                                                                                                                                                                                                                                                  fjkLE/JKLT4OP5490595 FDWOT LOGN TDOES TS TEXT HAVE TO BE JEEZEE OUSSSIIEEEE\nWorkload:\n1 problem set a week. 2 mid terms. 1 final. so reasonable\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 16, 2013",
            "review_content": "\nXin Wan was a horrible teacher. Do NOT take him, especially if you have a choice about it.\nFirst of all, the first day of class he sent out an email in Mandarin. I'm not joking. MANDARIN. It was ridiculous. It was only later on we discovered it was meant to be a syllabus, which he re-sent to us in English.\nHe teaches by taking his notepad and putting up notes on the board. Now, usually that is the way I like to work - I hate powerpoints in Math. However, instead of actually presenting his notes, Xin Wan faces the board while he copies his notes on the board, and then mumbles to himself as he copies. His low mumbling, combined with his body blocking most of what he is writing, made taking notes in class nearly impossible. Even worse, his notes didn't follow the textbook, were usually too small to read, skipped multiple steps in each problem, and were usually erased before you could copy them all down.\nHe would never answer questions on problems or review questions. Instead he would say \"You've already learned that in class. We're moving on.\" Um, okay, but how does that help people who want to know how you got the answer on the board? He would then tell us that to review for tests, since he didn't give us any practice problems, we should look at our notes. The notes that he erased on the board too fast for us to copy down.\nAll in all, don't take this class unless you are prepared to teach yourself all the material. It would take about 5 hours of work per lecture, because his problems are much harder than the ones in the textbook.\nWorkload:\n1 weekly webassign\n1 weekly written homework\n2 midterms, each counting for 20%\n1 final, counting 40%\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "September 05, 2013",
            "review_content": "\nNever take Xin Wan. He has no idea how to teach.\n1) Even though it is obvious HE knows what he is doing, he doesn't explain it to the class. He asks for questions, but he always regurgitates what he said before the question, because he doesn't know how to explain it.\n2) He transcribes his notes from his paper notepad onto the board, standing between the board and the class so nobody can see what he's writing. Even after he has moved from in front of the board, the writing is so small that no one besides the first four rows can see anything. There are over 15 rows of people in the class. If I can barely hear him or read his writing from the second row, I can't even imagine what the people in the last row are doing right now.\n3) Instead of talking to the class and explaining what he is doing, he faces the board and talks to himself while he writes. The fact that he almost whispers and has a pretty strong accent does not help my (and other students') understanding.\n4) He assumes that the class knows material that he is teaching, so he skips over equations, solutions, responses, and answers questions by saying \"you can look that up in the book\".\nHonestly. Don't take this class. It is a bad idea. I can already tell that most of the material is going to have to be done on my own time, especially because he doesn't answer questions and doesn't have a TA. The weekly homeworks are not enough practice to actually do well on his exams - most of your studying time should be taking notes from the book and doing extra problems on your own. It's the only way to survive this class.\nWorkload:\nWeekly homework assignments on WebAssign\n2 Midterms\nFinal\n"
        }
    ]
}