{
    "prof_info": [
        {
            "prof_name": "Michael Golston",
            "prof_id": 1902,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Poetry and Poetics",
            "review_date": "December 22, 2010",
            "review_content": "\nIf you are a poetry or lit person this class is probably for you. If you are neither of these things, DO NOT take this class. The only part of this class that makes it an \"Intro\" is that it is a survey of 1000 years of poetry. Besides that, it is completely taught for lit majors and 'poetry people.' The professors are both lively and brilliant (especially Golston), but at the end of the day the class is an unbelievable drag. Murray's lectures are rushed and scattered, and she can be quite condescending if you visit her office hours. Golston is much better, but the lectures lack big picture ideas and spend too much time on historical background and abstract concepts. Too much time is spent reading into things that aren't in the text. Overall, very disappointing and a huge pain in the ass as a non-lit person.\nWorkload:\nA 5 page technical paper in which you analyze a poem's structure and how that plays into its content (not easy). A 6-8 page paper in which you choose one technical term (i.e. rhyme, meter, enjambment, etc.) and discuss it in relation to 3 poets. (Also not fun).\nThe final was without a doubt the worst aspect of this class. One of the reasons I was willing to take this lit course was knowing that the exam (as stated on the syllabus presented on the first day of class) had a take-home final. However, it was only AFTER the add/drop deadline that Golston nonchalantly informed us that \"it was not possible\" to have a take-home, but that we would rather have an in-class 3 hour exam.\nThe exam requires literally knowing everything. You must be able to recognize passages of poems and poetical papers, scan a difficult sonnet, and write an essay (which is open-handout) in which you are required to quote from different poets, etc. For the ID section, I'd advise focusing ONLY on the major works discussed in class, as those are what primarily show up on the test.\n"
        },
        {
            "course_name": "Intro to Poetry and Poetics",
            "review_date": "December 15, 2010",
            "review_content": "\nProfessors Murray and Golston were both incredible. They are brilliant, passionate, and knowledgeable, and their lectures were both insightful and fascinating. They also worked really well as a team. It will be a great loss for the department if Columbia ever loses either of them. Prof. Murray is truly inspirational (and well dressed) and was always willing to recommend extra books and articles. My bookcase is now filled with books that she and Prof. Golston recommended. \nBesides their amazing lectures, though, Profs. Murray and Golston were also very available and friendly. They never hesitated to stay and chat about poetry after class and were very encouraging when I asked paper questions. \nAs for the course, for anyone interested in poetry, what could be better? The readings were all amazing, and Profs. Murray and Golston interspersed them with insightful analysis and interesting anecdotes. Even though I had read many of the poets before, I learned a great deal from this class and really enjoyed tracing the progression of English poetic theory. \nWe also had a guest lecture on hip-hop by Kalefa Sanneh and two poets read for the last class--both really wonderful things.\nWorkload:\nThe assignments all seemed very reasonable, and I really enjoyed writing the final paper. I'm sure the final will be fair & intellectually engaging as well.\n"
        },
        {
            "course_name": "Intro to Poetry and Poetics",
            "review_date": "December 15, 2010",
            "review_content": "\nProfessors Murray and Golston were both incredible. They are brilliant, passionate, and knowledgeable, and their lectures were both insightful and fascinating. They also worked really well as a team. It will be a great loss for the department if Columbia ever loses either of them. Prof. Murray is truly inspirational (and well dressed) and was always willing to recommend extra books and articles. My bookcase is now filled with books that she and Prof. Golston recommended. \nBesides their amazing lectures, though, Profs. Murray and Golston were also very available and friendly. They never hesitated to stay and chat about poetry after class and were very encouraging when I asked paper questions. \nAs for the course, for anyone interested in poetry, what could be better? The readings were all amazing, and Profs. Murray and Golston interspersed them with insightful analysis and interesting anecdotes. Even though I had read many of the poets before, I learned a great deal from this class and really enjoyed tracing the progression of English poetic theory. \nWe also had a guest lecture on hip-hop by Kalefa Sanneh and two poets read for the last class--both really wonderful things.\nWorkload:\nThe assignments all seemed very reasonable, and I really enjoyed writing the final paper. I'm sure the final will be fair & intellectually engaging as well.\n"
        },
        {
            "course_name": "Intro to Poetry and Poetics",
            "review_date": "December 15, 2010",
            "review_content": "\nProfessors Murray and Golston were both incredible. They are brilliant, passionate, and knowledgeable, and their lectures were both insightful and fascinating. They also worked really well as a team. It will be a great loss for the department if Columbia ever loses either of them. Prof. Murray is truly inspirational (and well dressed) and was always willing to recommend extra books and articles. My bookcase is now filled with books that she and Prof. Golston recommended. \nBesides their amazing lectures, though, Profs. Murray and Golston were also very available and friendly. They never hesitated to stay and chat about poetry after class and were very encouraging when I asked paper questions. \nAs for the course, for anyone interested in poetry, what could be better? The readings were all amazing, and Profs. Murray and Golston interspersed them with insightful analysis and interesting anecdotes. Even though I had read many of the poets before, I learned a great deal from this class and really enjoyed tracing the progression of English poetic theory. \nWe also had a guest lecture on hip-hop by Kalefa Sanneh and two poets read for the last class--both really wonderful things.\nWorkload:\nThe assignments all seemed very reasonable, and I really enjoyed writing the final paper. I'm sure the final will be fair & intellectually engaging as well.\n"
        },
        {
            "course_name": "20th Century Poetry: Race, Gender, and the Rhetoric of Poetic Form",
            "review_date": "December 22, 2005",
            "review_content": "\nas long as the title of this course is, golston repeated it at least once in every class -- maybe to remind himself about what he was supposed to be talking about.  it's not that he's a bad professor, just that this was a poorly conceived course.  the course is based on golston's thesis that modernist poetry was heavily influenced by eugenics, and he's probably right.  it's a pretty interesting idea, and i'm sure it would make a great book.  it didn't, however, make for a good class.  sometimes he would base an entire class on pretty improbable hypothesis, as he did when he claimed that Ezra Pound's first imagist poem  was based on a machine designed to test racial health through graphing the modulations of the voice.  other times, he would spend the entire hour and fifteen minutes reading the assigned courseworks homework outloud, which was espescially painful when the assigned reading was from some crackpot eugenecist who wrote poorly.  i'm sure Golston would make a great poetry teacher -- he's funny, has a captivating speaking voice, and unpacks poems really well.  the problem with this class was that it wasn't really about the poetry.  if you take a class with golston and you want to actually learn something, make sure the class really is about poetry.  and, one last word of advice: beware of the mean graders who you may never meet, and of other students in the class, whom, as you might be able to tell from reading the below reviews, believe that golston is the man without really taking time to think about it.\nWorkload:\nturn in 2 ten page papers.  lots of courseworks reading, which is sort of fun until you realize it's completely irrelevant.  \n"
        },
        {
            "course_name": "Race Gender & Poetic Form",
            "review_date": "November 10, 2005",
            "review_content": "\nIt does not get any better than this. Quite simply, the best teacher you could ask for... and so on and so forth.\n"
        },
        {
            "course_name": "Radical Poetries of the 20th Century",
            "review_date": "January 17, 2005",
            "review_content": "\nProf. Golston hardly needs another positive review. The simple truth is that you should try to take a class with him no matter what. Even if you don't like peotry, you should take a class with him just to experience the experience that is Michael Golston. That being said, if you DO like poetry, you should DEFFINATELY take this seminar. Not only do you get to spend two hours a week in a small room with Golston, you also get to read some of the craziest, coolest poetry there is. The texts studied start with early modernist experiemental poetry (Stein) and end up with contemporary conceptual poets. \nThe work in this class puches language and poetry to the limit. The beauty of it is that you could be reading a bunch of nonsense syllables but Prof. Golston will show you how it is the most beautiful and exciting thing in the world. Please take this class.\nWorkload:\nResponse paper every class, midterm paper and a final paper. It's a fair amount of work, but its worth it.\n"
        },
        {
            "course_name": "Poetry and Poetics",
            "review_date": "January 11, 2005",
            "review_content": "\nMichael Golston is the funniest man alive. I'm such a huge fan that I'm in the \"Michael Golston is the Man Club\" on facebook. \nProf Golston knows so much about poetry and is so happy to share it with the class. Every lecture was not only packed with information, it was entertaining. He has incredibly funny habits with the blackboard, which is always fun to watch. \nGolston is also available outside of class and is willing to schedule meetings with you. I'm planning on taking every course he offers at Columbia. Yeah. He's that good. Take this course. Prof Murray is also very good. \nWorkload:\n2 papers and a final \n"
        },
        {
            "course_name": "Poetry and Poetics",
            "review_date": "January 11, 2005",
            "review_content": "\nMichael Golston is the funniest man alive. I'm such a huge fan that I'm in the \"Michael Golston is the Man Club\" on facebook. \nProf Golston knows so much about poetry and is so happy to share it with the class. Every lecture was not only packed with information, it was entertaining. He has incredibly funny habits with the blackboard, which is always fun to watch. \nGolston is also available outside of class and is willing to schedule meetings with you. I'm planning on taking every course he offers at Columbia. Yeah. He's that good. Take this course. Prof Murray is also very good. \nWorkload:\n2 papers and a final \n"
        },
        {
            "course_name": "20th Century Poetry",
            "review_date": "July 25, 2004",
            "review_content": "\nOh, where to begin with Prof. Golston? The man has one of the most interesting personalities you'll find in a department filled with aging eccentrics and young assistant profs with varying degrees of insecurity, and that's saying something. Quite simply, he's fun. He knows what he's talking about - he had personally met nearly every poet (Charles Bernstein, Lyn Hejinian, Susan Howe, John Ashbery, and others) on our syllabus, and often broke out with random exclamations or comments in class that would resound through the staid corridors of Philosophy Hall. Don't let his vibrancy fool you, however - Golston is smart, critical, articulate, and genuinely interested by both the material and what you have to say about it. You can't sleepwalk through this seminar - he'll make you talk even if you don't want to. Since Golston's specialty is avant-garde poets and poetics, you're not going to be reading easy stuff - one of his favorites, Clark Coolidge, wrote entire poems filled with conjunctions and prepositions. Basically, this is the only class in the Department where you read anything really experimental and postmodern. The material, therefore, is pretty hard and can take more work than you might think at first, but it's worth it just to see Golston get so worked up about the readings. You'll be surprised how engaged you are by the end of the class - I, a self-professed hater of poetry, grew to enjoy the material and the professor quite a bit by the end. He's also exceedingly nice and willing to talk during office hours. Take a class with him; even if you're not interested in the material, you're sure to be won over by his personality and will probably come to enjoy whatever he teaches.\nWorkload:\nNot too bad - two papers, one 3-5 and one 5-10, plus response papers. He wants you to talk, but also spends a fair bit of time introducing each poet. He's a fairly strict grader in a department that hands out A-s like they were Kleenex, so you'll have to work to get a good grade. But he's always willing to look at drafts and rewrites.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 22, 2004",
            "review_content": "\nLit Hum was one of my favorite classes all year - and let me tell you, it wasn't because of the course material, but because of Golston. He is no meek professor. Like the other reviewers have already noted, Prof. Golston has a flair for the dramatic. He does voices, acts out scenes from the readings, and basically just makes class extremely interesting. Because he raises wonderful thought-provoking questions during the disucssions, most of the class time was spent learning about the history behind particular novels and plays. Most of the information I remember from the class deals with the myriad of off-topic discussions he mediated, such as why English has more words than other languages. He knows that the departmental lit hum final is pretty much BS, so he spends most of the time talking about other related subjects. That being said, you will have absolutely no difficulty with the final.\nAlso - Professor Golston teaches the Bible extremely well. He spends about a month on the readings and poses wonderfully exciting and interesting questions to the class.\nTo summarize, I loved this class.\nWorkload:\nTwo papers that add up to 15 pages. One midterm. One final exam. Extremely fair at grading papers and exams.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2004",
            "review_content": "\nI completely agree with the first two reviews. I switched Lit Hum professors mid-year and it was the best move I made the whole semester. For me, Lit Hum transformed from a boring, lifeless, bullshit class into what I would consider my most enjoyable and scintillating class all semester. Golston is everything a lit hum professor should be... he is incredibly bright, encourages class participation (but by no means relies on it like my first semester lit hum prof), provides insightful and poignant comments into the works read, and to top it all off, he's entertaining. One particular aspect of the class I enjoyed was the historical contexts he would place the books in. He sometimes devoted whole class times to lecturing on a book's background before we actually delved into discussion. (He is a truly inspiring lecturer.) It was obvious he put much time into preparing for the class. In grading essays, he doesn't slap an arbitrary letter on... you will receive a number of insightful comments, and he will be honest if your essay is BS. \nA GREAT CLASS! If you can get in, do so. \nWorkload:\nTwo essays that have to add up to 10-15 pages. Midterm and final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 16, 2004",
            "review_content": "\nFirst, let us get one thing straight: Michael Golston is the man. That being said, we can go into the specifics. He has an incredible presence in class; he employs effective body language and facial expressions to convey his point. To take an extreme but comedic example, one day Prof. Golston was explaining Freud's notion of the id, and he decided to demonstrate the effect of the unsuppressed id if he was craving a hamburger. So he naturally threw a desk aside and leapt toward a classmate, (who was holding an imaginary burger) he yelled \"Gimme your [explitive] hamburger.\" That, he explained, is the unsuppressed id, and our ability to suppress it, according to Freud, is one of the defining factors of our humanness. \nHe mediates class excellently by interpreting and elaborating on the points that students make. He also knows a lot of random but fascinating facts that always liven up class. \nI don't plan on being a comparitive lit major, but I am going to take other classes Golston offers because that is how good he is\nWorkload:\nTwo papers per semester which must have a combined page length of 10-15 pages. Midterm and Final. He is a fair grader and will edit and woodshed your papers in office hours if you come to him before the due date\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 28, 2003",
            "review_content": "\nProf. Golston is a really good teacher.  He was out in California teaching at Stanford, so he's definitly got a Califronia-guy vibe. He describes himself as a Dutch Socialist, doesnt take attendance, and seems mad that he has to put up with he called the Bolshevikish Bureaucracy of Lit Hum. He's really funny and very knowledgeable about English, even though its not his first language...Dont let that scare you, if he didn't tell you that on the first day of class you wouldn't know. His class is lots of fun, especially when he goes off topic, woah, its like, ride the Golston Train.....If you have the chance, take a Golston Class. Great Prof.\nWorkload:\nTwo Papers, split up however the student wants, no weekly homework at all apart from Lit Hum reading, Very Fair Midterm, and the Final. Fair Grader. \n"
        }
    ]
}