{
    "prof_info": [
        {
            "prof_name": "Simone Oppen",
            "prof_id": 12653,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Greek I",
            "review_date": "January 07, 2015",
            "review_content": "\nSimone is very nice and has a lot of potential for teaching. She can get a bit flustered during class, which shows her inexperience, but she also works very hard to explain the nuances of Greek - a difficult task. Not only is she willing to put in the effort, Simone also was willing to experiment with a flipped classroom. This willingness to innovate should help her with teaching in the future. She is flexible in terms of late assignments as long as you turn them in and is very willing to work with you to succeed in the course. Her grading is not easy, but fair.\nThe course in general was fairly standard as far as (my impression of) classical language classes go. Quizzes every class mean regular memorization of vocabulary and grammar. Homework is also on a very regular basis. Make sure you go to class prepared; you'll almost certainly be cold-called and embarrassed if you don't prepare. Don't be fooled by the slow pace early on, the class really picks up after the first of two midterms. Greek is a fascinating language, but it's a ton to cram into your head. Make sure you have the time to dedicate to it.\nAlso, make sure to take advantage of the random Greek / Classics things that Simone presents (e.g. trip to the Met, ancient Greek music, random accentuation pronunciation, etc). I found them to be quite enjoyable even though I have little exposure to Classics.\nOn the whole, I would recommend Simone, especially if she continues to improve her teaching (which I predict she will).\nReviewer's Grade: A-\nWorkload:\n1. Short (~8 minute) quiz every class\n2. Homework every class\n3. Two midterms with corrections allowed\n4. Final with no corrections, similar to midterms (exams get harder as time goes on)\n5. Extra credit opportunities at the end of the semester\n"
        },
        {
            "course_name": "Selections from Homer",
            "review_date": "May 24, 2013",
            "review_content": "\nSteiner is quite intimidating at first and runs a pretty no-nonsense class, but in the end she's really rather chill :) She genuinely wants to give you the best grade she can--you can fuck up a few quizzes (and even the midterm..!) and still end up with an A if you improve throughout the semester and are consistent with your reading/translations/participation. On the other hand, since she assigns final grades impressionistically rather than using a strict breakdown of quizzes/exams/recitations/etc., you really have no idea where you stand until the end of the semester. \nAnother nice thing about her is that if you don't volunteer to translate, she will not call on you and force you to do it. So it's not the end of the world if you don't quite get through the reading before class. Which is not to say that you're fooling her or anyone else by staring intently at your book to avoid her eye contact, but at least she won't call you out on it in class.\nShe also absolutely knows her stuff and likes to go on really long, interesting tangents about myth or Homeric reception. Yay!\nSimone is really nice. She seems new and nervous, but she's willing to go above and beyond to help students out. Friday morning sessions on Homeric grammar are rough in the best of circumstances, but she did her best and made us some killer handouts. \nWorkload:\nAround 150+ lines per week (not turned in). Weekly quizzes with translation and grammar questions. A midterm and a final, each covering half a semester's worth of text (fairly brutal). Small recitation (first 10 lines of the Iliad, no big deal). \n"
        }
    ]
}