{
    "prof_info": [
        {
            "prof_name": "Justine Rosenthal",
            "prof_id": 1903,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "American Foreign Policy",
            "review_date": "April 21, 2004",
            "review_content": "\nI'm not sure which Justine the other reviewer from this class had, but she's fabulous.  Very very smart, extremely knowledgeable, very available, willing to tell you what is actually going on.  Hard grading but fair, and she has a blessedly low tolerance for the stupid, obnoxious, or arrogantly long-winded in section, and, I suspect, on papers.   Nothing wrong with that, unless, of course, you are one of those three things, but if you aren't you will be very very grateful.  She was the one saving grace of this class, and I would gladly take another class she was TA-ing.  Ignore the other review - if she's a TA in your class, you should definitely seek her out.\n"
        },
        {
            "course_name": "Conflict and Cooperation in World Politics",
            "review_date": "January 08, 2004",
            "review_content": "\nJustine Rosenthal, though a very tough grader, is a fabulous TA. She is thoroughly versed in the material and offers different perspectives in the discussion sections rather than just repeating Jervis' lectures. She is always available for meetings or consultation and willingly read drafts of the research paper.  As a graduate student, I found her demanding yet fair.  \nWorkload:\n1 research paper (20-25 pages for graduate students) and 1 exam\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "December 29, 2003",
            "review_content": "\nBy far the worst TA ever. If you see this women, run! Not only did she not offer any feedback on papers She is also the most parsimonious grader you will ever encounter during your academic career. And if you choose to take a class with her be prepared to battle for every meaningless, arbitrary point that she will begrudgingly give. Like a war hardened Soviet General Rosenthal will never budge an inch, no matter how much common sense she sacrifices. She was the worst TA I ever had the misfortune of meeting. When appealing a grade the chain of command should be avoided and the student is advised to go directly to the professor. But be warned one false step with this TA could land you on her bad side and if you get on her bad side you can count yourself out of recieving a decent grade or at least a grade that you deserve!  \nWorkload:\nIt doesn't matter how hard you work, you will always be confused about her methods for calculating your grade. \n"
        }
    ]
}