{
    "prof_info": [
        {
            "prof_name": "Orit Karni-Schmidt",
            "prof_id": 13613,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 19, 2020",
            "review_content": "\nShe is such a nice and sweet lady. She is so passionate about the subject and really tries to make the class as enjoyable as possible.\nWorkload:\nLike every other frontiers of science class - 9 smartsparrows, discussion post, weekly hw, midterm, final - everything except midterm and final is graded for completion\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "November 30, 2020",
            "review_content": "\nDr. Karni-Schmidt is the kindest professor I have ever had. She is very attentive and will work with you should you need help. Her classes are usually interesting, with her changing up the format from week to week, sometimes conducting a debate, holding a kahoot, utilizing small group assignments, and presenting small review presentations for especially complex material. \nWorkload:\n6-7 pages of HW per week that takes about 1-2 hours to complete. 1 Smart Sparrow per week takes around 45 minutes. 1 mid term exam and 1 final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 14, 2020",
            "review_content": "\nYou should be SO HAPPY if you get assigned Dr. Karni-Schmidt as your FroSci instructor. Dr. Karni Schmidt is so attentive to her students, and as the previous reviewer mentioned, never wants us to feel stressed. She really works hard to ensure we understand all her concepts through presentations/office hours/HW corrections. We went on a trip to the American Museum of Natural History and she bought us all shake shack after – so sweet of her!\nWorkload:\nWeekly HW (6-7 pages), one project, midterm, final, trip to the AMNH.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "November 16, 2019",
            "review_content": "\nDr. Karni-Schmidt is the sweetest person I've ever met! She told us on the first day that she gets butterflies every year because she's so excited to meet us. That joy for teaching us did not waver a bit by the end of the semester. Additionally, she is very well-being focused. She is very aware that her class isn't the only class you have, and that it isn't at the top of most people's priorities, either because they aren't studying science, or because they are, and FroSci is remedial to them. It is a primary concern of hers that she does not add stress to the Columbia workload, which she does a very good job of, given that she grades for completion and effort, and strongly emphasizes the value of really thinking about the content rather than just trying to get at A. In my opinion, given my experience as an art major who was poorly educated about science, her lax grading policy really fosters that thoughtfulness if you care to put the time in, which is wonderful for understanding the content long-term. I've never been stressed about her class, but instead have found it to be a pleasant change of pace from my other classes. Because of her kind, empathetic nature and absolute dedication to ensuring that step-by-step, we are following her, I feel like I have the room to experiment with my learning and learn really well. \nAlso she throws us pizza/movie nights with really yummy baked goods which is the most wholesome thing ever. :)\nWorkload:\n1 five-minute group presentation on one reading from the class, weekly written HW, weekly-ish online HW, a creative science project, and standardized frosci midterm/final \n"
        }
    ]
}