{
    "prof_info": [
        {
            "prof_name": "Joshua Davis",
            "prof_id": 3555,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Social Psychology Lab",
            "review_date": "April 30, 2013",
            "review_content": "\nAs a person who was TERRIFIED of taking a lab course, I can say that I am pretty glad I took this class because I didn't have to immerse myself in the discipline to do well.  That being said, in order to do well we had to do an extraordinary amount of busy work, which was my main problem.  Davis has all of these stupid specifications about powerpoint slides and shit that we're expected to follow which kind of defeats the purpose of being a college student if you ask me.  I feel like he'd give seniors in high school a notebook check quiz.  Anyway, my first impression of him was that he was really nice, which is true-- he's just also weirdly attention-seeking and annoying.  The epithet \"well-intentioned\" appears a lot in these reviews; I guess I'd second that.  Whatever.  Take this class for the lab requirement I guess, but be prepared to fall asleep during some of the most boring-ass 3 hour lectures EVER, be sure to ask him questions DURING CLASS BECAUSE HE TAKES 19088Q97W DAYS to answer his emails, and don't work with a group of people who you know will be unreliable, because you have all of this pointless shit due each week that takes a few hours to do.\nWorkload:\na bunch of shit due each week; powerpoint presentation; final research paper at the end (mostly putting together your results and pieces you handed in previously)\n"
        },
        {
            "course_name": "Social Psychology Lab",
            "review_date": "September 20, 2011",
            "review_content": "\nProfessor Davis is awesome. He is so nice, cute, friendly, and approachable. He is one of the most enjoyable professors that you could spend an otherwise wasteful weekly 3 hours. He really wants his students to succeed in conducting their own research. He is extremely supportive and reachable, and the fact that he is a rather attractive 30-something from Brooklyn only adds to the joy of this lab. \nOf the three labs in group \"C\" (all of which are taught by Davis) social psych is the most interesting. And Davis is just really, really cool.\nWorkload:\nThe work is fairly light at the beginning and very clearly explained on the syllabus. The work becomes heavier at the end due to the fact that there is a formal research paper due. If you keep up with each week's assignment (which you basically have to as each week a part of the paper is due for Josh or the TA to look over) the paper is completely manageable. \n"
        },
        {
            "course_name": "Psychology of Personality ",
            "review_date": "December 11, 2010",
            "review_content": "\nProfessor Davis is really nice and approachable, and he definitely wants his students to succeed. I think he might have taken note of some of the reviews on here, because he now gives extremely detailed instructions for every assignment he gives. Every assignment is clearly laid out so you know exactly what he is looking for. Yes, a lot of the work is busywork, but it isn't very difficult, and it is almost all done in groups, so that leaves much less work for everyone individually.\nAll in all, this wasn't a very difficult lab and Professor Davis is very nice and understanding. I would not necessarily recommend taking personality psych, because I found the lecture half of it terrible, but the lab is definitely not the reason why the class was so bad.\nWorkload:\nA lot of busywork at the beginning, then a final group project that takes up most of the semester and ends with a presentation and a final paper (all in a group)\n"
        },
        {
            "course_name": "Psychology of Personality ",
            "review_date": "December 10, 2009",
            "review_content": "\ni agree with many points of the reviews below. while josh seems really nice, takes interest in his students, i think he makes TOO MUCH effort, and that's where the problem lies. having a lab for psychology of personality itself is kind of a joke, so i think his overzealousness is trying to compensate for that. so much of the work was total busy work, and often too much for the 1.5 credits. if we knew as a group that we would be writing our lab report together, it was pointless and annoying to have to write our own first. and 3 hours for this lab is ridiculous, superfluous and boring as hell. i struggled to keep awake because it was the 9-12 time. i think josh needs to reevaluate the class structure and not take it too seriously.\n\nWorkload:\na lot of stupid work. final lab report on our own project.\n"
        },
        {
            "course_name": "Social Psychology Lab",
            "review_date": "September 09, 2009",
            "review_content": "\nI agree with the first reviewer. Josh Davis was one of the worst professors I've ever had, mostly due to his unclear assignments and tendency to fill up the three hour lab period with irrelevant talk and tasks. While he is nice and I assume well-intentioned, that doesn't make up for the fact that I never had a very clear idea of what was expected of me, and for a course worth only 1.5 points, there was a lot of work, mostly consisting of figuring out how to write a psychology lab report through the hand outs he gives you, since in class he does a very poor job of explaining anything. While it was not an especially difficult course, I found it frustrating and uninteresting, which is a shame because the social psych lecture with Prof Stroessner was pretty enjoyable.\nWorkload:\nYou begin by writing segments of a lab report for in-class studies or hypothetical ones, and eventually you will be assigned to a group and as a group you design a study, do it, write a lab report and do a presentation. Except to do numerous drafts of each section of the lab report. Mandatory meetings with a writing fellow (which was not helpful at all, since the writing fellow didn't know anything about psychology).\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "May 06, 2009",
            "review_content": "\nAs a lab professor, Josh is great. Although he can be awkward sometimes, he is very passionate about helping you become a better psychologist. He works with groups individually so that your experiment can be as successful as possible. He brings us to the toddler center so that we can observe the toddlers who attend there every day, which is great hands-on experience. I did more work in my lab than in my lecture, but the work is pretty enjoyable and practical.\nWorkload:\n1 big lab report that you work on all semester, weekly assignments (not too demanding)\n"
        },
        {
            "course_name": "Psychology of Personality ",
            "review_date": "January 26, 2009",
            "review_content": "\nReally nice guy, extremely patient and approachable. Mostly not very engaging, but funny and well intentioned. \nWorkload:\nyou have to go to every class, develop a mock group project and then an acutal group project which you have to test, mostly thorugh quesstionnaires. Then a final lab report explaning what you did and what you found. just as long as you follow the guidelines and everything is coherent you should do fine. \n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "December 17, 2008",
            "review_content": "\nJoshua Davis is the worst professor I have ever had in my experience at Barnard-Columbia. He is a nice guy, true, but a wreck as a professor.\nHe never explains assignments, never budgets time, and never uses class time in an efficient manner. For the first month and half of this lab course, we spent three hours doing busy work that was extremely difficult and poorly explained. We spent about twenty minutes of the allotted three hours actually observing the children in the Barnard toddler center.\nHe is incapable of commanding attention and treats his students like they are toddlers, since is the only mode of communication he is familiar with.\nHe laughs everything off as if it is a huge joke and as if the material is in fact very easy, resulting in an infuriating and trying semester of psychology lab.\nAvoid him as a professor at all costs.\nWorkload:\nExtremely hard to explain...many meaningless assignments that had nothing to do with the goal of the course\nten-page final lab report based on ridiculously little data\n"
        }
    ]
}