{
    "prof_info": [
        {
            "prof_name": "Ilari Kaila",
            "prof_id": 11958,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Ear Training V",
            "review_date": "November 13, 2012",
            "review_content": "\ni do not understand why Ilari doesn't have the most golden star on culpa. i took ear training IV with him and it has been one of the best courses i've taken at columbia, if not the best. it usually is the case with most ear training courses (or music courses at cu, for that matter), that you get from them as much as you put into them; you get a lot more if you're with ilari. this man is an amazing musician with unbelievable ears, so he's really helpful in improving intonation. he's also very rhythmically knowledgeable, which is very rare for classical musicians, having studied carnatic music, and he teaches some of this in his classes (which sets him apart from other ear training instructors). if an exercise involves hearing unusual harmonies, he will usually explain the theory behind them, often showing examples where they appear. i just wish he taught ear training V too... and everything else.\nAND, he's a very fair grader. what more could you ask for?\nWorkload:\nmostly up to you; i imagine some people can get by without doing some of the assignments, although some of them are graded and have to be sung or performed in the class, so you can't really avoid those.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "May 11, 2012",
            "review_content": "\nHaving Professor Kaila for Diatonic was a fantastic experience and I feel like I learned so much, despite having studied theory for 2 years. The first month of the course is spent on species counterpoint, and the rest of the first semester is spent usages of basic chords. The 2nd semester is spent primarily on ornamentation and learning how to write more than just music based off of chords. He works especially hard in getting everyone involved when working on assignments together in class to make sure that everyone understands the material. Also, he addresses every question fairly, even if it's been asked repeatedly in classes before, and doesn't make anybody feel like their question is dumb, which made the class very oriented towards learning. Grades are based more on the homework than on the exams, and the midterm and final should seem incredibly easy after the work you do throughout the course. He tends to stick straight to the textbook, but it is a great resource. If you can, get Professor Kaila for this class.\nWorkload:\n1 figured bass assignment or harmonize 1 melody per class that's intended to help you reinforce the lesson. Should not take more than 1-2 hours of work per assignment.\n"
        }
    ]
}