{
    "prof_info": [
        {
            "prof_name": "Geoffrey Mac Adam",
            "prof_id": 1728,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 05, 2008",
            "review_content": "\nGreat professor. Approachable, charming, knowledgeable to an unsettling level (I don't care the conditions you should not know every name in Herodotus; it's unnatural).\nMy only reservation would be his tendency to add a final point to open-ended matters. I guess that's the role of the professor but with work that is so ambivalent I sometimes fail to see how his conclusion (which to be fair he does leave open to discussion in essays but that nevertheless leads the rest of the class discussion) is the most valid one. VERY small qualm. Seriously, with him you have one of the greats.\nAnd also, on a more superficial level; the man's pretty alright. Like a hot Clark Kent. 100% of the girls and 30% of the guys (eat your heart out Kinsey) in my section  blatantly check him out.\n I mean he's married, has a kid, and is an authority figure so no schoolgirl crushes or anything but after going from lecture to lecture with a pre-geriatric crowd, it's nice to have something nice to look at as you learn.\nWorkload:\nDoable. One essay less than the other sections which makes it the lightest of all Lit Hums. Reading is brutal but universal to Columbia so...\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 05, 2008",
            "review_content": "\nGreat professor. Approachable, charming, knowledgeable to an unsettling level (I don't care the conditions you should not know every name in Herodotus; it's unnatural).\nMy only reservation would be his tendency to add a final point to open-ended matters. I guess that's the role of the professor but with work that is so ambivalent I sometimes fail to see how his conclusion (which to be fair he does leave open to discussion in essays but that nevertheless leads the rest of the class discussion) is the most valid one. VERY small qualm. Seriously, with him you have one of the greats.\nAnd also, on a more superficial level; the man's pretty alright. Like a hot Clark Kent. 100% of the girls and 30% of the guys (eat your heart out Kinsey) in my section  blatantly check him out.\n I mean he's married, has a kid, and is an authority figure so no schoolgirl crushes or anything but after going from lecture to lecture with a pre-geriatric crowd, it's nice to have something nice to look at as you learn.\nWorkload:\nDoable. One essay less than the other sections which makes it the lightest of all Lit Hums. Reading is brutal but universal to Columbia so...\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 03, 2008",
            "review_content": "\nAlot of the alumni complain that with a larger undergraduate population it becomes more difficult to provide the best core experience to all of the college students. Experiences with Lit Hum were extremely varied with some dying of boredom, others dealing with absurd professors, and some just stressed out. Geoff on the other hand is bar none one of the BEST LIT HUM PROFESSORS OUT THERE. My class unanimously agreed that he needed to be nominated for and win the award for best litreature humanities professor. Geoff is a genuine person and a true intellectual. He doesn't want his students to make trite comments and obvious statements about the readings, he wants a well thought out intellectual discussion. In addition he has the amazing ability to teach his students a great deal about the litreature even if they didn't do the readings. When it comes to essays his care shows with the amount of detailed and relevant comments, when you get them back half your essay will have red marks. He also prepares students extremely well for the midterms and finals. He is extremely approachable, willing to meet outside of class and overall a great guy. Count yourself extremely lucky if you have him and if not try as hard as you can to switch in.\nWorkload:\nExtremely manageable, long readings first semester (200 pages a week) shorter second semester (100 pages a week) and 2 essays per semester. Midterm and Final both semesters that are a breeze\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 07, 2008",
            "review_content": "\nGeoff puts his heart and soul into this class and in the end you learn a ton. He has a true passion for the subject, which makes it fun just to listen to him talk. He is a true intellectual and renaissance man! TAKE GEOFFERY'S  CLASS!\nWorkload:\ndecently high expectations, but a very fair and reasonable grader. \n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "September 20, 2007",
            "review_content": "\nToo many people conflate \"nice person\" with \"good professor.\" MadAdam is a nice guy but really just an average prof. Sticks closely to the book (which is barebones), not particularly adept at explaining the grammar nuances, way too lenient. He's the way to go if you just want to slug through the language requirement but if you actually want to learn as much as you can then there are better options.\nWorkload:\nStandard.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "July 19, 2007",
            "review_content": "\nbon prof!  my french improved a lot during his class.  you don't have to speak if you don't feel comfortable, but make sure that you are attentive (class participation is a part of the grade).  his teaching style is awesome for a french prof.  and he is very open and wants to see the students do well.\nand if the work load is too much (which it rarely was) he will take a poll and alter it.  great class overall, i'd recommend him to anyone :)\nWorkload:\nfour compositions (first and second/final draft), 5 examens, midterm, course-wide final, presentation with a partner.  (very manageable hw and tests and everything)\n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "July 10, 2007",
            "review_content": "\nI am in love with this man.  He's cute, he's funny in a totally geeky way, he's really nice, and he totally improves your french - the language, I mean (unfortunately).\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "December 30, 2006",
            "review_content": "\nBy far the best French instructor I've ever had. His comments on the grammar are clarifying (probably more so than the strangely organized textbook), he's funny and kind, and unlike past instructors, emphasizes how to tackle the important and difficult points instead of belaboring the simplest stuff. He probably grades too generously. I never went to office hours or emailed him for help, but he made himself very accessible to students. Class discussions were more fun than I thought was allowed in French courses. There's something kind of wicked and elf-like about Geoffrey, but in the best way.\nWorkload:\nFour compositions, five quizzes, a short presentation with a partner, midterm and final - I think this is the standard work for 1202.\n"
        },
        {
            "course_name": "1202",
            "review_date": "November 14, 2006",
            "review_content": "\nHe's amazing. There's no other way to put it. I thought I knew a lot of French when i took his class and I still managed to learn alot. Our discussions were really interesting. He has very interesting points. He is the nicest guy and can be very funny. The best part (and what you probably want to know the most) is that he is a really good grader. He is very fair (maybe even too fair sometimes). If you are someone who struggles with French I think his class is really good because as a native English speaker, he knows what it's like to learn French from our point of view. He really wants to see you succeed in the language and therefore encourages you and motivates you in class. J'aime Geoffrey! \nWorkload:\nGrammar and Reading every single night, but its not too bad. The reading isnt very long. Biweekly tests that arent too hard. Standard stuff. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 02, 2005",
            "review_content": "\nI don't think he's teaching Lit Hum next year, but if he is, definitely try to get into his class. He's a great guy, very understanding, I enjoyed his class alot. He knew how to direct discussions well, and even when it was obvious many didn't do the reading (midterm weeks for example), he was able to salvage the class. Pretty laid back, fair grader. \nWorkload:\nUsual stuff, 3 essays first semester, 2 second, midterm, final, postings on courseworks every so often (nothing to stress over). Short presentation second semester. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 29, 2004",
            "review_content": "\nGeoff is truly the best instructor I have had at Columbia thus far.  He made our class discussions engaging and challenging, and he was always able to provide some interesting commentary about the current text.  Geoff also made an extra effort to supply our class with a lot of additional materials that were relevant to the texts.  He was always on time and always prepared, even if several of his students were not.  He never picked on anyone or called them out for an on-the-spot analysis.  Rather, he instead presented the class with thought provoking questions that made everyone want to respond and join in the discussion.  Despite his own opinions about the meaning of the different texts, Geoff listened to everyone's interpretations and never made anyone feel stupid.  He is also ALWAYS avaliable to talk about papers, difficulties, etc., even outside of his allotted office hours.  He is kind and supportive and really cares about his students.  I feel like I learned so much in his class, and I feel very lucky that I had the opportunity to take Lit Hum with Geoff. \nWorkload:\nFirst semester: three papers, short weekly assignments, fair midterm, final.  Second semester: two papers, short presentation on a text, short weekly assignments, midterm, final.  Geoff is also a very fair grader, and provides lots of extensive commentary on papers.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 14, 2004",
            "review_content": "\nGeoff is a true gem. Any other professor and my lit hum grade would have been horrible; why? Because I would not have gotten up for a 9 AM class for a prof that was not enthusiastic. Geoff is smart, funny, kind, and caring. He's more than happy to help you with anything during office hours, and we'll even schedule those around student needs. Extremely talented teacher and all around nice. Switch in or take his class next year, I guarantee a good time!\nWorkload:\nshort weekly assignments, regular lit hum reading, 3 fairly graded essays. Geoff does a very intensive job when correcting your papers.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 03, 2003",
            "review_content": "\nEveryone should be so lucky to get Mr. Mac Adam for Lit Hum. He is simply a great guy, for a number of reasons. For one, he is the only teacher I've had who I'd voluntarily  come to class at 9 am just to stare at.  But \"more importantly\", he made the material very exciting, even those texts I was prepared to detest.  However, he doesn't try to force you to like any of the books, and encourages you  to criticize any texts you wish. My only complaint would be that sometimes in class discussion he looks for very specific answers to his questions; occasionally it felt like he just wanted us to notice the same things he had instead of coming up with our own ideas.  That tiny thing aside, Mr. Mac Adam is just fabulous.   I can almost assure you that if you get Mr. Mac Adam, you'll have an exciting year and be the envy of all your friends who hate their lit hum teachers. \nWorkload:\nfine - no extra readings, 3 papers, very short weekly assignments on the reading\n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "October 25, 2003",
            "review_content": "\nIf you have troubles, questions, or concerns about French then this is the professor for you. He is helpful and makes his students feel comfortable and relaxed. French is hard enough, and without the support of a solid teacher one can get lost in the language. If you have the chance this professor is engaging and quite gifted in his ability to see the potential in each and every student.\nWorkload:\nNormal\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "October 25, 2003",
            "review_content": "\nWhat a teacher, seriously this instructor was patient and had a unique ability to make his students feel comfortable with the french language.  Simply speaking, his transition from french professor to tutor to a person understanding that people are doing the best they can with the language and will, eventually, get better...was flawless.\n\nWorkload:\nNormal for this level\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "September 08, 2003",
            "review_content": "\nHe is such a great instructor!  He is organized, intelligent and completely engaging.  He is methodical in his teaching which makes the material easy to absorb.  Not only that, he's a lot of fun in class and offers a great deal of help in office hours.  Completely approachable and genuinely kind. \nWorkload:\nThe norm for intro french classes\n"
        }
    ]
}