{
    "prof_info": [
        {
            "prof_name": "Nicholas Higgins",
            "prof_id": 2374,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 16, 2009",
            "review_content": "\nNico is a pretty good music hum teacher. not the best, but definitely not one I would try to avoid. He takes the class really seriously though, and always wants to get into intellectual discussions. He grades kinda harshly on concert reports, and he expects you to really be super analytical about your experience. Also, his tests are tricky, and you really need to know everything in the book/class notes about the songs AND the composers. The good thing is we watch interesting performances in class...  His class can be a struggle for people with no music background, but all in all, it was an all right experience. He isn't a super hard or super easy music hum teacher. \nWorkload:\nkind of heavier compared to other music hum classes because he gives annoying articles outside of the textbook. You don't have to do the reading or listening, but then have fun trying to learn it all before the tests. The good thing is the final isn't cummulative\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 17, 2009",
            "review_content": "\nThis has been one of the most torturous classes I've taken at Columbia. He used to teach elementary school, and he seems to believe he's still there. He wields the constant threat of pop quizzes, which he never fails to mention each class, as a sort of punishment if discussion is not up to his expectations. Classes are boring, pedantic, and uninspiring for anyone who has any musical experience or simply life experience. I shudder at his childish jokes, and try to avoid eye contact during class. Misery is a constant companion. Life has lost all meaning. Are there any decent music hum teachers out there?\nWorkload:\nIf you don't check courseworks before each class, he scolds you like a nanny whose charge has wet his bed. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 02, 2005",
            "review_content": "\nNiko's a fun enough guy, but he's serious about his class. Make sure you go to class, since he adds a lot in class that you won't find in the book. Keep up with the reading, especially the occasional handouts, and you'll be fine. The reading's always light anyway, but be careful...he sprung three short 5-minute pop quizzes on our class based on the readings. Those quizzes are usually from the handouts, but the last one was from the book, and the final had a question referencing one of the handouts. His concert report guidelines are sometimes a bit strange, so make sure you force him to fully explain it in class. \nBut even though his workload is pretty heavy compared to other classes, he's really excited about teaching music hum (impressive at 9am!) and he knows his stuff. You'll definitely gain a new appreciation for Western music by attending his class, and he loves class participation, whether by you bringing in your own music to listen to before class, or discussions. \nWorkload:\nThree concert reports, three pop quizzes, two one-hour exams, final\n"
        }
    ]
}