{
    "prof_info": [
        {
            "prof_name": "Andile Khumalo",
            "prof_id": 9693,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 15, 2011",
            "review_content": "\nIt's actually been a while since I was in Andile's Music Hum class, but I realized how few reviews there were for him and I wanted to make absolutely sure that everyone knew about this class. It was almost too horrible for words. I was so excited for this class, but after the first week I started dreading walking into the door.\nFirst, while he seemed completely knowledgeable about music, his knowledge about related subjects (such as history) was incredibly sub-par. You might think this wouldn't be necessary for this class, but a huge part of Music Hum is the history of music and it's a serious problem to have a professor who is frequently corrected by his students on this subject.\nSecond, he knew his craft but had no way to transmit that knowledge to us students. If I hadn't already had a background in music, I would have never passed this class. And I don't mean pass as in get a B. I mean I would have failed this class with an F if I hadn't studied music in the past. We spent two classes going over concepts that had I spent months learning. He would also do things like tell us that beforehand that a quiz would cover period X to period Y, and then include questions from a period that was not within that range or tell us the midterm would have certain kinds of questions and then have different kinds of questions on the midterm.\nWhat horrified me most about this class, though, was Andile's attitude. Our class was very engaged and curious, but whenever one of us would ask him a question, he would act as though we were questioning his authority. Although the class is supposed to be discussion based, he would just lecture and lecture and then throw out a random question. When no one answered within 3 seconds he'd get upset with us even though most of us were just caught off-guard. Also, when he was blatantly wrong about something and someone would correct him, he would act in the most childish manner. For example, once Andile made an incorrect statement about the organization of the Bible (Old Testament vs. New Testament stuff) and a girl corrected him very politely. The next thing he did was ask her to recite a random verse off the top of her head because \"she obviously knew the Bible so well.\"\nHonestly, Andile seemed completely uninterested in teaching us anything. It's a shame, because Music Hum could be a truly amazing class. I'd like to give him the benefit of the doubt and hope that he's improved, but don't risk an entire semester of misery on it. Seriously, if you see that you've been put in his class do everything in your power to switch.\nWorkload:\nModerate\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 28, 2011",
            "review_content": "\nAndile, as he asks we call him, is one of the worst professors I've had in quite a while.  The major issue I faced in his Music Hum class was that he didn't seem to realize what level the class is supposed to be - introductory.  Our first quiz, a week and a half into class, dealt with hearing a piece we'd never heard before and identifying musical color, meter, form, tempo, texture, and key.  As someone who had absolutely no musical experience before this class, it was impossible to have gained the abilities he expected after 9 days of study.\nAnother major problem is that he cannot explain his assignments.  While we only had a single concert report, he never explained until a week before it was due that the report was actually a research paper on the cultural history of our chosen piece, or that he wanted us to do research beforehand on our chosen work.\nOverall, if you see his name on your Music Hum section, run for the hills as fast as you can.\nWorkload:\n5-20 pages of reading and a piece or two to listen to per class, a handful of quizzes, a midterm, a research paper/concert report, and a final.\n"
        },
        {
            "course_name": "Fund. of Western Music",
            "review_date": "December 23, 2010",
            "review_content": "\nThis is by far the worst professor Columbia has to offer.\nI should have followed my instincts and do like many did drop the course. You are warned, if you see his name drop it. He would make your life miserable for an introductory music class. \nAgain, if you want to save yourselves a lot of headache skip his class. Or you can chose to be like me and try it out and bite your fingers at the end\n \nWorkload:\nWorkload: At least 4 quizzes. 2 Concert reports, a midterm and a final.\nWith this said, he is never clear as to what he wants you to do. One example, during all my life I have understood extra credits to mean more than the actual total. not in his case. if a problem is graded 20/20. Extra credits means to him that 15/20 is the maximum points you can get and the 5 remaining points are the extra credits. Students even wrote a letter complaining about this teacher.\n"
        }
    ]
}