{
    "prof_info": [
        {
            "prof_name": "Alexander Cooley",
            "prof_id": 847,
            "total_reviews": 22
        }
    ],
    "reviews": [
        {
            "course_name": "International Relations of a Post-Western World",
            "review_date": "May 06, 2015",
            "review_content": "\nProfessor Cooley is an extremely laidback guy, and you can tell he knows what he's talking about. He's done his research. He's fascinated in the material. And he's an interesting lecturer too. I went to class often during the first half of the class, but then workload from other classes got too heavy so I missed a lot the second half. Going to class isn't *necessary* to do well at all, but I do generally find the class interesting. Sometimes, though, I thought he focused too much on global regions that I'm not fascinated in (mostly Middle Eastern countries). That said, I did learn more about it because he brought it up a lot.\nWorkload: not bad. There's a lot of reading, but I did most of it while writing the papers. There are 3 papers--one short one (4-5 pages), one long one (10 pages), and a take home final (2 prompts, 4 pages each). They're pretty straightforward and you only need the readings as sources. And if you actually do your readings, it should be fine. Even not doing the readings (like me), you can read what you need and write the paper. I usually wrote them pretty last minute, but still managed to pull decent grades, which leads me to my next point: it seems like a pretty easily graded class. There are a lot of grad students, so I think they're a little easier on undergrads.\nOverall: not a bad course at all. Not necessarily the most interesting, but still relatively interesting with a pretty awesome professor.\nWorkload:\n3 papers: 1 short (5 pages), 1 long (10 pages), 1 take home final (2 prompts, 4 pages each)\n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "May 07, 2012",
            "review_content": "\nProfessor Cooley is really fantastic. He knows his stuff- particularly Central Asia, his research focus. He's had some really interesting grad students and he will mention insider tidbits he learned from them about what happened behind the scenes in various institutions.\nThe class is divided between three sections- international economy, international security, and international civil society. The economy section is about global finance- the IMF, World Bank, WTO, credit ratings agencies, CDOs and financial crisis, etc. Part two is about terrorism, private security firms, and how globalization has changed the nature of international security. Part three is about transnational advocacy networks, like NGOs and various other groups dealing with human rights, international justice, and more.\nEach class is pretty well organized. He talks very quickly- from the minute class starts, he's going! until the last minute of class- you ain't putting that pen down. Don't come late. (unless you're like that girl who sat there shopping on her laptop, buying herself a new wardrobe, for the entire semester...to each their own?) Do not take this class unless you already have a rough familiarity with the political institutions of the current world we live in. There are no pre-req courses and you don't really need them, though a previous polisci course will be helpful. If not- as a rule of thumb, if you read the New York Times a lot (not arts or sports) then you are probably okay. He throws around a LOT of acronyms and assumes you know them.\nProtip: Start the longest readings ahead of time. I deeply regret not buying the book \"Who governs the globe\" since it comes up repeatedly in the semester and is really important. The other books less so, you can get from the library. All the articles are online if you google for them, you can print them and mark them up as you read. Many of them are worthwhile reads, or classics on the topic that every other article ever will quote, and in your future life you'll be like, ha I read that one.\nWhile normally I don't like when professors assign their own writings for a course (a couple of articles he wrote or co-wrote), in this case it was ok, it came across (to me at least) like he was assigning it the same way he assigned all the other readings on the syllabus: because he thought that topic or theory was important, which is presumably the same reason he had decided to write about it.\nOverall I thought it was a really fascinating class and I got a lot out of it- lecture and readings both. I have a much more complete and detailed perspective about the modern world and the way states and global actors interact. If you want to understand international politics and how it all works in real life, this is the class for you.\nAlso- Elham is the best! Super nice and helpful and really smart. I'm sure Emily is a good TA also I just never had much to do with her. But go to office hours, ask questions, get help with your papers, and you will do much better in the class.\nWorkload:\nA lot of reading due for every class. He usually refers to the content but doesn't necessarily review it. Helps if you read them before class.\nAssignments: One short paper, due early in the semester. Midterm is multiple choice (that is not a synonym for easy). Longer 10p paper about broader themes of course. In class final, IDs short answers and essay. Tough but doable, overall.\nI cannot stress enough- KEEP UP WITH THE READINGS. otherwise it piles up on you. You can get someone else to summarize it or whatever but even if you just read most of it for yourself it helps. I fell behind second semester and studying for the final was much harder because of it.\n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "December 30, 2010",
            "review_content": "\nCooley is awesome - he's a great lecturer, covers some fascinating material, and, for a class with an open-ended title like \"Globalization,\" is extremely organized.\nThis was absolutely one of the best classes I've taken at Columbia -- but it definitely wasn't easy. I'd recommend it highly for other Economics-Politics majors looking for a class that is actually inter-disciplinary, or for students who don't mind that the first semester seems to randomly require a pre-existing knowledge of financial markets. The second semester has more of a focus on international law as it pertains to terrorism and international jurisdiction.\nThe workload is tough, but interesting. You definitely need to know what you're getting into (as the reviewer below mentioned). Lots of readings (four or five articles per class), which you can get along without doing, but they're generally really good, so I'd do as many as you can. If you don't do as well on the first short paper, you can make it up on the second paper - which is worth a lot more. Beyond the useless \"paper-writing session\" the TAs held this semester, they were very helpful in responding about outlines during their office hours.\nCooley can come off as full of himself, but having spoken to him a couple of times during office hours, I think he's genuinely a decent guy -- and he seems happy to talk about the class with students.\nFinal disclaimer: you really need to be interested in the topic to enjoy this class -- check out the syllabus and make that decision based on your level of interest.\n\nWorkload:\n2 papers (one 4-5 pages, the other 8-10); 2 exams (multiple choice midterm, short answer final)\n"
        },
        {
            "course_name": "Colloquium on International Organization",
            "review_date": "December 26, 2010",
            "review_content": "\nProfessor Cooley is a wonderful seminar leader--he managed to encourage everyone's participation and never fully shut anyone down, but he made it clear what was and was not a good interpretation. His feedback on written assignments is extremely helpful, and it's pretty clear what is expected of you. This was my favorite class this semester, and I'd definitely recommend it.\nThat said, the previous reviews are pretty accurate. Prof. Cooley can sometimes come across as an arrogant jackass, but that is more apparent outside of class and really does not get in the way of his teaching.\n\nWorkload:\nThe reading was way more manageable than I'd expected for a colloquium. There were usually about 4 full length journal articles assigned each week, which came out to be around 100-200 pages. Some weeks were heavier than others, and a couple of times we had to read an entire book in a week.\nTwo \"memos\" (a 2-2.5 page single spaced response/analysis on the weeks readings), one \"presentation\" for the readings of a certain week, the standard 30 page final paper.\n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "December 21, 2010",
            "review_content": "\nThough Cooley comes across as an arrogant douche some (alright, most) of the time, it's really just because he knows that he's the man. Cooley is really knowledgeable about the subject material, is a solid lecturer, and writes extremely helpful outlines on the board of what he plans to cover during lecture in case you ever space out or miss something. There's TONS of reading, to the point where it's literally impossible to do all of it for each class, so make sure to take this course with at least two friends so you can split up the readings for the two midterms. That's probably the most important thing to do or else you stand no chance on the two midterms because he almost exclusively tests on the readings. Overall, it was a great class, excellent professor, learned a lot, and though I definitely needed to put in effort, I didn't have to work overly hard to do well.\nWorkload:\nOne 1500-word short paper (10%), one 8-10 pg research paper which requires only using the syllabus readings (thank God), two midterms (all worth 30%). SOOOO MUCH READING.\n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "December 17, 2010",
            "review_content": "\nThe other reviews are pretty accurate - Cooley's a great lecturer but he can definitely be a jackass. \nPros: \n- writes a logical outline of the material on the board that takes up every minute of each class\n- connects the class to events in the news\n\nCons:\n- fair to fairly tough grader\n- Cooley isn't the kind of professor you'd willingly go talk to in his office hours, and forget ever questioning a grade\n- paper expectations were only discussed when he returned papers\n- TAs aim their help at the bottom 10% of the class (advice on the essay boiled down to \"write logically\" and \"use the active voice\")\nOverall an informative class led by an egotistical professor. For the work of an A in a regular Poli Sci class you can eke out an A- so adjust your expectations accordingly. It's up to you if the subject and competent lectures make the grade hit is worthwhile.\nWorkload:\nAverages about 75 pages of reading for each class. First paper isn't bad but requires a good amount of effort for only 10% of your grade. Midterm was brutal - nitpicky multiple choice where around a 50% curved up to a B but a 90% was an A. Final paper asks you to argue an opinion based on class readings so it was easier to tackle, but very few get in the A-range. Final exam was easier, short answers and essays that were almost completely doable if you just attended lectures and paid attention but an opportunity to shine if you were better prepared. \n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "December 10, 2008",
            "review_content": "\nHe's the man.  The best lecturer I've ever had.  Presents the material in an articulate way, that is easy to understand.  I learned more in this class than in any other class I've taken.  \nWorkload:\nquite a bit of reading, a paper, a midterm, and a final.  \n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "February 28, 2008",
            "review_content": "\nNo doubt that Cooley is a witty and clever guy, no doubt that he is a provocative lecturer,but there is also no doubt, that Cooley can be a jackass. \nHe lectures in a condescending and cynical manner and if you are not a Political Science major or into econ. the material is most probably going to be painful and boring. His no BS approach and resolute belief in his own pet theories will become annoying.\nIf you enjoy professors who think the world of themselves, this is the place for you.\nWorkload:\nLots of reading, that you can get away with not doing until the final rolls around and then you're screwed, so do the reading. He's a fair grader. 2 papers, a mid-term and a cumulative final.\n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "January 19, 2007",
            "review_content": "\nGreat professor. One of the most interesting and well taught classes I have taken at Columbia. He is highly organized, and though he does give a LOT of reading, it's managable if you follow the syllabus. He covers the 3 important topics of globalization: economic, security, and civil society. His readings are very interesting, though they may be slightly obvious. Overall, I highly recommend you to take his classes because he really knows what he's teaching and does it well. \n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "November 14, 2006",
            "review_content": "\nCooley is a great professor and this has been my favorite class in the Poli Sci department.  He is really well organized, which is refreshing.  He is a great lecturer too.  Even if you aren't a poli sci major, you should take this class so that you have a better understanding of what is going on in the world.  The midterm is pretty tough, but if you work hard, you'll do fine.  Plus you actually learn something in this class.  And isn't that really why we are in school?  I highly recommend Cooley and this class.  \n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "May 12, 2006",
            "review_content": "\nWhat a great professor. Without a shadow of a doubt the most interesting class I've taken in Poli Sci, if not Columbia in general. This guys  knows his stuff inside out and his command of the material is deeply impressive. \nHe made it really interesting, and I really LEARNT something with him - unlike many other profs at this place. His lecture on IPE remains the single most brilliant lecture I've been to at Columbia. \nIt was a lot of work, but honestly it was worth every second of it.\n\nWorkload:\nA lot of reading. Manageable if you split it up, but its tough so make sure you trust the people you work with to properly explain it. \nMidterm was really tricky, final not so much (but still not a walk on the park).\nA heavy workload, but as I said before, it's worth every second - this professor is a god. \n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "May 12, 2006",
            "review_content": "\nWhat a great professor. Without a shadow of a doubt the most interesting class I've taken in Poli Sci, if not Columbia in general. This guys  knows his stuff inside out and his command of the material is deeply impressive. \nHe made it really interesting, and I really LEARNT something with him - unlike many other profs at this place. His lecture on IPE remains the single most brilliant lecture I've been to at Columbia. \nIt was a lot of work, but honestly it was worth every second of it.\n\nWorkload:\nA lot of reading. Manageable if you split it up, but its tough so make sure you trust the people you work with to properly explain it. \nMidterm was really tricky, final not so much (but still not a walk on the park).\nA heavy workload, but as I said before, it's worth every second - this professor is a god. \n"
        },
        {
            "course_name": "Globalization and International Politics",
            "review_date": "December 04, 2003",
            "review_content": "\nI loved this class.  Its my favorite class in political science yet.  The subject matter is so relevant, and you will learn some really cool stuff.  He's a great lecturer with great anecdotes and organization.  \nWorkload:\na lot of reading, pretty constant heavy load.  midterm, 10-12 pg paper, final\n"
        },
        {
            "course_name": "International Political Economy",
            "review_date": "January 19, 2003",
            "review_content": "\nOK so here's the lowdown on this class. IPE is NOT for non-majors. There is a ton of reading that you cant skimp on. The readings are all incredibly interesting by the way. You can skim some of them to get by, but must read the more important ones thoroughly, and to get an A you need to read a good percent of it (or split the readings among friends and explain the arguments!). Cooley does a great job of outlining the course and each lecture. Be wary though, of Cooley's tragic flaw: he gives his opinions as if they are facts. You must keep in mind that he does not know everything, although he talks as if he does. Even so, he's a good prof. He likes his voice too much as well--has trouble listening to students. Is very critical (was not at all helpful outside of class), but I liked him, and loved the class (and got an A to boot). I highly recommend this class to a Poly Sci major willing to work, and intelligent enough not to take Cooley's views as God's.\nWorkload:\nTons of reading, moderate midterm, take home 10 pager, moderate final (cumulative)\n"
        },
        {
            "course_name": "Research Seminar on International Relations",
            "review_date": "December 09, 2002",
            "review_content": "\nProfessor Cooley is very good at providing constructive criticism. His outlines of the semester breaks the thesis down into manageable mini assignments, like a bibliography, an outline, a rough draft. Optional weekly meetings. Terrific thesis advisor.\nWorkload:\nManagable because of the way he lays it out. But you need to do a lot of pushing yourself to write a thesis.\n"
        },
        {
            "course_name": "colloquium",
            "review_date": "November 18, 2002",
            "review_content": "\nYeah, Professor Cooley is a young, intelligent and well-published protege from Johns Hopkins. And if you forget that, he will remind you on a daily basis. His abilities to facilitate a good round-table conversation are really good- which is important for a colloquium. But he gets a bit too into the spirit and really hits you over the head with his opinions rather than focusing on a more balanced conversation mediating. Overall, if you can get over his arrogance and insensitivity, you will have a very stimulating class experience. But this can be a challenge on some days...\nWorkload:\nA lot of reading, but nothing out of the ordinary for a colloquium. A fair grader.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 21, 2002",
            "review_content": "\nOrganized, dynamic, and extremely engaging. Cooley doesn't let the lecture format of the course stop students from participating actively in class; several times per session, he stops and asks if anyone has questions, then gives thoughtful and detailed answers. He digresses at points, but seldom rambles, and does a wonderful job of sticking to the syllabus and covering the necessary material in the time allotted. Those already taken with international relations will likely enjoy the course just for the readings, but Cooley's skill as a lecturer adds an extra element to a well-designed course.\nWorkload:\nA lot of reading, but the material is well-chosen and interesting. Students also write two 6-8 page papers on their choice of topics and take a final exam consisting of identifications, short answers, and an essay.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 20, 2002",
            "review_content": "\nabsolutely awesome prof... Great  lectures, interesting, etc..... Although  it is a large class, there was  discussion.... I would def.  recommend this class!\nWorkload:\nenough, but not overwhelming (that  is, if you do the reading... most ppl  don't). The reading, however, was  interesting and worthwhile\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 12, 2002",
            "review_content": "\nContrary to some other reviews, I found Professor Cooley's class an interesting, organized, well-delivered, thorough (if you did most of the readings) introduction to International Relations. While the class may seem a bit easy at times, Cooley himself is a dynamic, incredibly intelligent, yet fun lecturer who encourages questions and participation in a large lecture class and gives straight-forward answers. Taking his class this past semester was also very helpful for me to deal with Sept. 11, as we would have a quick update almost each class; he changed the final class to one on Islam, which I found fascinating. I would definitely recommend taking any class professor Cooley is teaching.\nWorkload:\nNot bad at all: 2 6-8 pg papers for midterms, which were graded well, easy final. TA was very easy, however, the required discussion sections often felt like a waste of time.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 28, 2001",
            "review_content": "\nUm, um, um, Um--be prepared to listen to this sequence of speech for 3/4 of the class, but don't get me wrong this man is SMART. He's published, gone on TV, and he's from Hopkins IR department etc. BUT there's a catch, HE'S BORING!!!! If you can stay awake in one of his lectures then you are either on acid or a strong strong dose of espresso. He's fair--his final is straightforward, his papers are manageable. However, Its not easy getting an A, but if you have a brain you can get no lower than a B-. The TA's are nice and this is an intro class so don't expect to be enlightened. Cooley will not make you want to be a Poli Sci major, but he won't make you not want to be a Poli Sci major either. Honestly, he's funny, cute, and a down to earth nice guy, but you wonder sometimes why only 40 ppl show up to a 180 lecture class all the time. Not bad, not great-- your choice.\nWorkload:\n2 papers, 1 final, mandatory sectionals (1 fifteen minute presentation).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 19, 2001",
            "review_content": "\nIn a five minute survery, Cooley said \"huh\" once every 4.3 seconds. Other than that, he is a good teacher and is really into international politics.\nWorkload:\nModerate. There are a lot of readings, two papers based on the readings and a final.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 19, 2001",
            "review_content": "\nI thought he was a good professor, he'd make an outline on the board that usually would really help you understand the readings, and even though the class was huge, he was open to questions and discussion. In the first class, he comes off intimidating and scary, but hes really not, and the TAs are really helpful. Classes supplemented the readings, and as someone not really interested in poli sci, this wasn't exactly such a good class for a beginner, but I thought it was interesting. He doesn't try to trick you, and his rule for the two papers was just to defend your views logically using the sources, as long as you backed up your arguments, it didn't really matter what you said.\nWorkload:\n2 papers (6-8 pages), a lot of reading, a cumulative final on a hell of a lot of material.\n"
        }
    ]
}