{
    "prof_info": [
        {
            "prof_name": "Wendy Muniz",
            "prof_id": 11280,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Hispanic Culture",
            "review_date": "November 22, 2013",
            "review_content": "\nWendy is possibly one of the most pleasant people, let alone professors, I have ever met. She came to class smiling every day, and genuinely seemed like she wanted to be there, which always made me happier to be there too.  I also enjoyed being in class because she was a hilarious professor and kept the class entertained. She encourages everyone to share their opinion, and a lot of the homework for our class just required us to share our opinions, without expecting a specific answer.  She never makes students feel dumb, even though people definitely said stupid shit or were unable to articulate it throughout the semester. She also really cares about the subject matter and knows a ton about Spanish-language cinema, which makes it really fun to discuss those things in class.  I wasn't wild about the subject of the class I took with Wendy (I'm just not super enthusiastic about literature) but having her as a teacher made it a great class.  Wendy never made me feel embarrassed to ask questions and made herself available to students whenever necessary. I wish I could have her as a teacher again, but I'm grateful I got to be in at least one of her classes!\nWorkload:\nmy class had kind of a lot of reading, but she was VERY fair about grading, and definitely understanding about needing extensions/missing class for legitimate reasons. there were probably like 8 or 10 single page write-ups and then a final paper (I think it was like 8-10 pages?) and a partner presentation at some point\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 22, 2011",
            "review_content": "\nProfessor Muniz was a really kind, funny, and energetic professor. She was also a very fair grader. Many classes would offer more hands-on learning experiences, such as putting on an impromptu play with your classmates, doing yoga in class, and playing games. Her assigned workload was also very manageable, though nothing to ignore. \nHowever, only speaking in Spanish all the time in an Elementary Spanish I class meant that several students stayed behind and never understood very basic concepts, because it was only being taught to them in a language they did not know. A couple students dropped and some just suffered through knowing they were going to get a really bad grade. Those that shined in the class were the ones that already spoke Italian or Portuguese, or took Spanish for 4 years in high school. \nWalk into the course knowing that it will be taught to you full immersion style and do yourself a favor: go beyond the requirements and study ahead of time and more than what she suggests, because you will often feel lost in class unless you have a background in Spanish. Do this and you will do well. If not, realize that many students make Bs and Cs in Spanish, and you may be one of them.\nWorkload:\nOnline MySpanishLab work several times a week, four compositions plus their corrections, one presentation and its accompanying essay, a midterm, final, and an oral exam. Attendance is mandatory and counted, and missing too many days means you're dropped by a full letter grade.\n"
        }
    ]
}