{
    "prof_info": [
        {
            "prof_name": "Joao Neti",
            "prof_id": 12303,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Portuguese II",
            "review_date": "May 11, 2012",
            "review_content": "\nJoao is an amazing, easy-going professor.  You'll learn your Portuguese without all the unnecessary pressure - in a way that allows the language to seep into your brain so that you're not worried about making a mistake and on guard while you're trying to learn how to speak. He teaches in very simple, practical ways- breaking everything down to its simplest form. He also teaches using lots of music, the kind that \"sticks\" in your head for days. You'll leave class singing Portuguese in no time!  Search Youtube Eduardo e Monica O filme Oficial.  Joao provides an insightful look into the culturel (not boring details that you'll forget in no time), but today's culture: for example, how prejudice, race, sexual orientation (Lea T), the women's movements in Brazil affects a person's life in Brazil. \nHe assigns lots of homework but really very manageable. He doesn't collect all your homework, but reviews it in class. For the homework that is collected, if you don't hand it in, he's not a stickler but he'll remind you that your grade will be affected if you don't get it all in by the end of the semester.  He also gives online quizzes. If you miss 3 classes, your grade slips, so don't miss any classes. I've never had a professor prepare students so well for an exam so you'll definitely be ready for the midterms and finals. \nHe teaches a more generic Portuguese dialect, which I liked, because I am finding my research requires language skills for more non-Brazilian lusophone countries - African Portuguese speaking countries, and the dialect he teaches is more compatible with those countries.\n\nWorkload:\nAssignments every night, very manageable (not all collected).  About 5 1-page paper (not difficult). Online quizzes and Courseworks commenting section on a cultural/social/statistical aspect of Brazil. Sounds like a lot but Very Manageable!\n"
        }
    ]
}