{
    "prof_info": [
        {
            "prof_name": "Goran Ekstrom",
            "prof_id": 4367,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "January 25, 2017",
            "review_content": "\nThe class is the most straight forward class you will ever take at Columbia. Dr. Ekstrom's lectures are clear, slightly dull, and completely unnecessary to do well. He posts perfect lecture notes on his websites from which the exams are verbatim based upon. \nThe problem sets are easy if you've taken any high school statistics or math class.  Good science filler. \nThe TA, Max Cunningham, was excellent for the course. \nWorkload:\n30%- Two midterms- 3 hours of studying\n40%- Final- Still 3 hours of studying\n30%- 10 Problem sets. An hour or two(max) each\n"
        },
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "August 24, 2014",
            "review_content": "\nTERRRIBLE COURSE. I completely agree with the comment below. it was misleading and Goran taught nothing. Hes cute and old and sweet but trust me under that endearing accent is a man with no clue how to successfully and properly assign homework, write a test or run a course. \nEvery single student of his was disappointed with his actions and misleading behavior and every single student in Logan Brenners TA class was automatically given a disadvantage because she was the HARD TA and unjustly took off points. Best part is she had no idea what the hell she was doing and looked cometplely confused and lost the entire course and the entire time she was teaching. I felt like I taught myself for a full semester, they did absolutely nothing to help or teach any student. \nThis class was a mess, AVOID EKSTROM AND ESPECIALLY AVOID LOGAN BRENNER AT ALL COSTS!!!!!!!!!!!! \nWorkload:\ndoesnt matter, youll get two grades below what you deserve anyway. \n"
        },
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "May 19, 2014",
            "review_content": "\nI am completely SHOCKED by the comments below this and in even more shock that Goran has a silver nugget. \nYes he is cute and adorable, however these qualities do not make a good professor. And trust me Goran is anything but a good professor. \nI have never been more disappointed in a professor or mislead by a professor/course in my life. On the first day of this course, Goran told his students that there would be 3rd grade math, adding and subtracting basic numbers only, and that there would never be calculators needed. This was a blatant lie; not only were calculators REQUIRED for every single test and homework assignment (without a miss), I found myself attempting to teach myself statistics, calculous, economics, trigonometry all myself in order to successfully even attempt to do the homework as this math was ON the homework however, was literally never gone over in lecture. \nGoran tells you that discussion sections are optional- seems nice right? However, what he doesn't tell you is that 70% of this class is based PURLEY on information from discussion sections. We learn all the math in discussion sections, however the TA's (Hannah L & Logan Brenner) are too stupid to understand the math and literally have no idea what theyre doing or what theyre explaining. Basically, you end up teaching yourself everything because these TAs are not only incompetent but give you CONFLICTING information with what Goran says in class.\nThere is absolutely no standardized grading in this class and EVERYTHING, repeat everything, is graded unfairly. If you bring this up to Goran or the TA's they will turn a blind eye OR do everything in their power to cover up their own mistakes of taking off unfair points. It is extremely frustrating and I would warn everyone and tell everyone to NOT take the class and run as far away from it possible. I am a sane normal person and I cannot believe people ever ENJOYED this disgusting joke of a course. \nWorkload:\nliterally no point in me talking about this because no matter what you do or how hard you try youll get unfair points taken off in all areas because there is no grading rubric. They take off points whenever they feel like it with no explanation and no justification. \n"
        },
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "May 08, 2014",
            "review_content": "\nJust wanted to throw in the mix below; this is one of the easiest-feeling classes I've taken at this school, and I'd definitely recommend it for a science requirement filler. Not to discount the opinions below, maybe it just happened to be a good match for me, but I don't want the thread to sound too discouraging. (I'm pretty good with numbers and understanding probability/stats, so maybe that helps?)\nI'm loving the material and the low commitment (maybe 2 hours a week to do the HW and a few hours to review before exams. as long as you listen to the lectures that's really all that's needed). \nNot loving the 8:40 am. The TAs are both wonderful. Prof Ekstrom is really clear, concise, and adorable. The material is generously posted online. Textbook might help but I'd have no idea because I didn't buy it. \n\nWorkload:\nweekly p-sets (a couple of hours work), two midterms (review for a solid night and you should be good), a final that's supposed to be the same difficulty as the midterms. You can do a presentation in the voluntary discussion section to replace a low p-set grade if you want to. Not a bad idea.\n"
        },
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "May 01, 2014",
            "review_content": "\nOthers have already said it: Professor Ekstrom is adorable. He is genuinely passionate about the topics and  his enthusiasm makes him a great person to learn from. \nOne thing you should know is that this class really covers an amazing variety of risks and disasters from earthquakes to tornados to arsenic to asteroid impacts-- it's not just about climate change (which I think some people thought it would be entirely about, although you do spend two lectures on climate change). You really get to learn about such a variety of topics (and they are topics that are generally good to know more about to life a long and healthy life), which is why this class has been one of my favorites at Columbia (and I'm not even in a science major). \nI do agree that the course can be a but challenging at times, but you should really give it a chance. If you have any experience in basic statistics and physics, you will be fine. If you don't, you might need a little more help from the TAs, but it's still not that bad. For me, the payoff of useful and interesting knowledge was definitely worth the effort.  I took this course as a second semester senior, and I am so glad I did. The tests were a but challenging but fair, and as long as you actually go to lecture, you will probably be fine. \nProfessor Ekstrom, like I said, is great. He knows that many people in the class are not science majors and makes the topics accessible. The TAs do, as well (and they never talked down to us or made us feel stupid for not already knowing some of the stuff). The class is a average level of commitment in terms of work level, but a really worthwhile and enjoyable experience. Give the class a shot if you even have the slightest interest in emergency management, basic environmental science, the sociology and psychology of disasters, environmental or civil engineering or real world statistics. Or if you just want to understand what's happening that next time a Hurricane Sandy comes along. \nWorkload:\nWeekly problem sets (they take about an hour to do), two midterms and a final. Also a weekly hour-long discussion section where they basically tell you exactly how to do the problem sets. \n"
        },
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "April 23, 2014",
            "review_content": "\nEkstrom is adorable, and he really cares about the material he's teaching, and it shines through in his lectures. He tries, but, unfortunately, he doesn't always succeed. I end up spending half of the lecture on my phone, and he's a bit dry for an 8:40 AM class.\nThe class material is all really interesting, and he tries to make it accessible and engaging and humorous, but this class can get HARD. The TAs can be tough graders, and there will be curveballs on the midterms (of which there are two) that you will not have seen before. The problem sets were all over the place -- some were ridiculously easy and quick, while others were incredibly difficult and could take hours for me to finish. There is roughly one a week (except the weeks when there are exams). My grades were all over the place in the class, and reflected that -- some were A+'s and some were C-'s. You win some, you lose some. This class is essentially a statistics class taught through the lens of environmental science: they want you to do some mathy stuff, so they throw it into what could be a really genuinely interesting class.\nDiscussion sections are optional, but are helpful in making sure that you can at least do the problem sets. They don't do much else, and that's the reason anyone goes.\nI ended up P/D/Fing this course like the person below me did, which makes it easier on me, but it's not worth it over all if you're not a science person looking to get through your science requirement with an easy A. It's just not happening in this class.\nBottom line: take it if you're interested in the material, but don't go into it expecting to coast. Take it if you really, really, really want to challenge yourself.\nWorkload:\nTwo midterms, one final exam, can be rather harshly graded. Problem sets every week after the first that there isn't an exam (so there are roughly 11 over the course of the semester).\n"
        },
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "April 15, 2014",
            "review_content": "\nGoran is adorable-- but it's hard to go to an 840 class every other day. \nHomework is really hard if you don't go to office hours (which I did, every week). If you aren't good at memorizing and decent at math/science, this is not the class for you.\nThe TAs throw random stuff at you on the midterms. It's really annoying. As someone who studied EVERYTHING, I didn't appreciate that.\nFinal is 40%! So if you fail, you really fail.\nBut discussion sections aren't mandatory, which is great.\nI ended up P/D/Fing this course which was the best decision ever. The class went from an enrollment of 80-something to 20-something if that gives you any hints about the difficulty of this class.\nWorkload:\n15% 2 Midterms\n30% Homework\n40% Final\n"
        },
        {
            "course_name": "Environmental Risks and Disasters",
            "review_date": "November 18, 2013",
            "review_content": "\nProfessor Ekstrom is awesome! He is engaging and certainly a scholar on environmental disasters. During my time in the class, he actually decided to cancel for a week so he can go to Japan and study a minor earthquake that happened there. He is super approachable and wants to help his students. Ekstrom knows how to hash out concepts that non-science people struggle with. He is a pretty easy grader. For example, if there is a math-ish question on an assignment, you do not need to get the right answer, just follow the correct procedure to get there. The TA's that I had were amazing and I suggest you go to discussion section if you need further explanation on certain formulas utilized in class. \nWorkload:\nWeekly problem sets that are a breeze (30%), two tests (15% each), and a final (40%).\n"
        }
    ]
}