{
    "prof_info": [
        {
            "prof_name": "Isabelle Urban",
            "prof_id": 1814,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary French I",
            "review_date": "December 16, 2008",
            "review_content": "\nMadame Urban is really great. She expects you to work hard, but it's very obvious that she's putting just as much effort into preparing for class as you are. She is pretty no-nonsense, and she won't switch into English just because you don't understand her, but you will learn A LOT of French in this woman's class. She also has a great sense of humor and is really fun!\n\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 16, 2008",
            "review_content": "\nMadame Urban is really great. She expects you to work hard, but it's very obvious that she's putting just as much effort into preparing for class as you are. She is pretty no-nonsense, and she won't switch into English just because you don't understand her, but you will learn A LOT of French in this woman's class. She also has a great sense of humor and is really fun!\n\n"
        },
        {
            "course_name": "Third-Year Grammar and Composition",
            "review_date": "May 09, 2006",
            "review_content": "\nIsabelle expects a lot from her students, and this is not an easy class.  That being said, she puts at least as much work into the class as each student does.  She was always prepared with enough to do, she explained grammatical nuances very well, delved deep into the texts that we were writing papers on during class time so we understood them, and always went over the homework and explained anything anyone had trouble with.  She gave back compositions the next class with thorough corrections and comments, and responded to email questions promptly.\nIsabelle expects everyone to be in class prepared - with all the homework done -  and on time.  There is a lot of vocabulary and grammar to memorize, and she expects you to be able to use what she teaches you - even some of the more minute details - on quizzes and tests.  Some of her assignments - fiches de corrections- are frustrating because it seems as though she is trying to make you feel stupid and prove that you don't know french, but they are really helpful, and she repeats the same mistakes on the sheets so you get practice with them.  She truly loves explaining grammar and differences in vocabulary and preposition choices/meanings, and she teaches you how to think and write in French instead of translating from English.  Overall, she is an amazing instructor, very dedicated, and she puts a ton of work into the course and her students.  She really wants you to learn, and she gives you the tools to do well.\nWorkload:\nHomework for every class - usually some reading (1 or 2 page articles/excerpts), some grammar exercises, and a 10-15 line composition.  2 major commentaires composes (3-4 pages).  Rewrites for compositions to get a third og a grade higher.  2 Midterms, final, plus a quiz or two.  A tough grader initially, but she gives you lots of opportunities to correct tests/papers for a higher grade.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "January 02, 2005",
            "review_content": "\nShe speaks French, which is probably already a leg up on your high school French teacher. She makes you get involved, and her class is really easy (I got a B+ with not too much effort, an A would not be really hard). If I didn't really really hate taking French, I might have liked her class. On the downside, there is a lot reading and vocab.\nWorkload:\nHomework (optional), weekly quiz or 200-300 word essay, midterm and final\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "November 24, 2003",
            "review_content": "\nGREAT teacher, if you've taken French before. She assumes you know certain things, which some complain about, but that's because this is INTERMEDIATE and not ELEMENTARY French. She is so funny and very approachable. She is very energetic and sweet, and loves participation. There's no way to mess things up, even if you're having a hard time. She practically gives you the answers to tests before and during them. She does everything in her power to get you an A.\nWorkload:\nHW every night, but she doesn't collect it. She says it's for your personal enhancement, which means you don't have to do it. There's no way you'll get below a B+.\n"
        }
    ]
}