{
    "prof_info": [
        {
            "prof_name": "Shou-Wu Zhang",
            "prof_id": 1112,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Number Theory and Cryptography",
            "review_date": "January 10, 2011",
            "review_content": "\nZhang is a very difficult professor to write an accurate review for. His class could accurately be described as hell, but I don't really think it was his fault. He is both very smart and very funny. My issue was with the textbook - the thing was horrible; it didn't explain anything well, and the homework problems were abstruse. To be fair, Zhang also hated the textbook, and said he would change it up for next semester. Given that, I think this class will be a lot more reasonable in following semesters. Still, be wary. Zhang is kind of a wild card when it comes to out of class accessibility; sometimes he's nice, sometimes he makes fun of you. If you have trouble with proofs or are short on time, I'd probably advise against this class.\n\nWorkload:\nI admit I kind of lol'ed at the previous reviewer's statement that all the homework problems could be easily \"checked by hand using a simple computer program or applet online\". What!? Maybe that will make sense to CS people, but certainly not to me. The homework was extremely difficult, and took hours upon hours to do. The tests, however, are more reasonable because Zhang gives in-depth outlines beforehand, so you'll know what's coming.\n"
        },
        {
            "course_name": "Number Theory and Cryptography",
            "review_date": "December 16, 2010",
            "review_content": "\nHe's a brilliant mathematician and quite the nice guy.  However, this class was a bit of a failure.  He admitted to not having looked much through the textbook, having gotten it via a colleague's recommendation, and as a result was taken aback when it turned out to be far denser than he thought.  The course's pacing was off; most of the time we went too slowly.  I would feel rather dishonest to say that I know even elementary number theory after this course\nI'm willing to chalk a bit up to the fact that he's a busy mathematician with other commitments and did not take much time to set up this course.  I suspect were he to teach again, he'd pick a different textbook that was more user friendly, as well as spending more time designing the curriculum.\nWorkload:\nRather easy - Weekly homework assignments that could almost all be checked by hand using a simple computer program or applet online, 2 midterms whose difficulty was on par with homeworks, and the choice of an actual final (weighted accordingly) or a third midterm (we chose the latter).\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 20, 2009",
            "review_content": "\nProfessor Zhang is an interesting professor. The first day of class when he opened his mouth, I thought I was totally screwed because of his accent. I thought it was going to be one of those classes you have nightmares about, you know, the ones where you can't understand ANYTHING the professor is saying and the material is SUPER difficult to grasp.\nWell, anyways, once you get past his accent, he's actually a pretty good teacher. He often let's you out of class early, holds regular office hours and will not show you the answer but guide you through a problem if you had one.\nTo be honest, I failed the first midterm. The second midterm I got a C-. I would have failed the class except...\nhe gave me this ultimatum basically. I never went to class or did homework, but if I turned in all of my homework for the rest of the semester and went to class and got an 85 or above on the final, he would make my overall grade for the class the same as my final exam grade. Needless to say I scraped by BARELY with an 87% and received a B+. How's that for procrastination!\nWorkload:\nNot too bad from what I can remember, but I never did it. One problem set a week (45 minutes tops?), two midterms and a final. Hw was 15%, midterms were 20% each and the final was 45%.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 15, 2005",
            "review_content": "\nZhang is one of those professors and every smart kid hopes for.  I personally only went to the first class ended up with an A in the class. Ok, so he does have pretty bad English, but he did seem pretty humorous.  He assigns weekly problem sets that are optional.  There are two midterms and a final.  All of which are pretty straight forward.  A lot of professors say that \"if you can do the problem sets, you will be fine\" but Zhang really means it.  They are *exactly* like the problem sets but with different numbers.  You pretty much just needed to memorize formulas and you'd do fine.  I.E. i got a 92 on the first midterm and a 100 on the second.\nWorkload:\noptional weekly problem sets, 2 very straightforward midterms and a very straightforward final as well\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "August 22, 2005",
            "review_content": "\nI took this course in the Fall of 2004 and did very well. Professor Zhang was pretty funny. The course was definately slack. I would imagine that people who were hardcore about calculus might have been disappointed with the lack of rigor. I mean, the course is not some cakewalk, but it had a nice calm sense to it. I liked how Zhang emphasized fundamentals. It really tied together the different conepts and theorem's well. I think this class was really good. For me it was a nice mix of non-hardcoreness and fundamental concepts.\nWorkload:\nWeekly assignments. The midterm and final were very predictable because he went over old ones that were really similar.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 27, 2005",
            "review_content": "\nProfessor Zhang is a mathematician, and he teaches like one. Calculus IV might thus seem ridiculous to this man and boring, and as the other reviews said, you are better off studying it on your own. But I think that is the rule for math classes in general. You simply can't expect to learn calc 4 if all you do is have somebody lecture you the material twice a week, especially if you are not intelligent enough to understand people with accents: Columbia has the best scholars from the globe.  That said, his teaching is better for moral advice than for getting a clue about the material. He does do mistakes on the board, but if you are clever enough, you can learn a lot more from mistakes than from perfectly prepared lectures. He won't spoon-feed you during class, but do go to his office hours, and he will be very friendly and help you. All in all, a great guy.\nWorkload:\nWorkload: Weekly problem set from the book, 2 midterms, final. Although getting by is easy (the exams are a joke), you will learn the material only if you do study it on your own.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 22, 2005",
            "review_content": "\nA class consists of him writing stuff on the board while making no sense at all and confusing everyone, and then everyone reading the textbook the night before an exam and all of a sudden, everything makes perfect sense! Zhang confused me more than anything. He is almost incomprehensible, Stoke's Theorem = \"Stock's Theorem\", Green's Theorem = \"Corin's Theorem\", and he will never know what he is talking about..such as \"use the Fundamental Theorem of Calculus or whatever\"......As you can see, class is a joke. You go to class to laugh, not to learn. The book teaches way better than Zhang can. The only reason why people like him is because he gives easy exams (but you don't learn). By the way, I got an A in the class, so I'm not writing this because he screwed me over..I'm writing this because his class is pointless and is just a waste of time. While you are at Columbia, you might as well learn something.\nWorkload:\nWeekly Problem Set from the book, 2 midterms (very easy), and a Final (the easiest final at Columbia..takes 45 minutes to finish at best) ..remember, easy does not mean good..Calc IV is easy material, so might as well have a good prof...it's a lot of $ per lecture, if you do the math...\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 17, 2005",
            "review_content": "\nProf. Zhang (whoÂ’s name apparently would mean dirty in Chinese if said Â“ZangÂ” according to him) is the worst Calc teacher I have encountered at columbia. The first impression you will get of Zang is that his English is horrible. I have encountered asian professors before (Prof. Cao and Prof. Kim) and in comparison they are both scholars of the English language. In the beginning you will, if youÂ’re lucky, understand about 30% of what this man is saying and by the end of the semester you will probably understand 70%, which is still quite sad. However ZangÂ’s strange pronunciation results in amusing terms like Â“Russian numbersÂ” (rational numbers) but can be very confusing at the same time like Â“the Corin TheoremÂ” (GreenÂ’s theorem). The language problem notwithstanding, Zang does not come off as a very good mathematician, continuously giving up in the middle of problems and being surprised when problems come out to be zero. He also finds that his students should take mathematics simply on belief as he always says Â“do you believeÂ” at the end of horrible explanations. A great example of ZangÂ’s math skills were demonstrated when he was solving the second midterm on the board after handing it back (of course he didnÂ’t have answers or an answer key nor did he correct the exam, the TA did), the professor only barely got 3 out of 5 problems completely correct even though he wrote the exam! And the exam was not hard. Bottom line is I WENT TO EVERY SINGLE CALC 4 CLASS, NEVER MISSED ONE, UNLIKE THESE OTHER REVIEWS FROM PEOPLE WHO CLEARLY WENT TO AT BEST A FEW CLASSES, and after experiencing a full semester of Zang I can honestly say that he is a pretty bad teacher. Granted he is the most amusing teacher IÂ’ve encountered at Columbia due to his many blunders and his ridiculous smile, but that doesnÂ’t make him a good teacher. If you are considering Zang as a teacher this is all you need to know: HE IS A PRETTY BAD TEACHER, TEACHING SIMPLE MATERIAL, AND GIVING VERY STRAIGHT FORWARD EXAMSÂ…READ THE BOOK AND GO TO CLASS TO SEE ZHANGÂ’S UNINTENTIONAL STANDUP COMEDY ROUTINE. Oh and if anyone was wondering, no I am not bitter because I did badly in the class, I did well, I just donÂ’t think making a class simple makes the teacher good.\nWorkload:\nProblem set every week (10 problems from the book), 2 midterms and a final. All very straight forward.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 12, 2005",
            "review_content": "\nGoing to class is pretty pointless, and though he's nice, he starts to get sort of annoying towards the end.  He's sort of in his own world, and I would definitely say you get most of your knowledge of the subject from the book.   The midterms are not bad, but the grader is super stingy with partial credit, and you're never told what the curve is.  But who cares, the final is pretty easy, and it seems like, as in most math classes, if you do well on the final, that's the grade you get.  \nWorkload:\nusual problem sets, they aren't long, and i don't think they end up really mattering anyways.  2 midterms and a final, both short, and no surprising, although our grader was a bit harsh sometimes i thought.  final is the easiest of the three tests.  \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 10, 2005",
            "review_content": "\nI like this professor.  He's funny and explains everything well, and is about a million times more approachable than some of the others in the math department.  Also I found Calc IV easier than both I and II, not sure if that's due to the prof. or the subject matter.  Anyway, I recommend him if you can get him.\nWorkload:\nWeekly problem sets-10 problems, totally doable the night before, and probably easy if you start earlier (I never did and I did fine).  2 midterms and a final, all with problems *really* similar to the ones he gives on the sample tests. (Hint: go to the two classes before each test!)\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 09, 2005",
            "review_content": "\nA really, genuinely nice guy.  He definitely wants to help his students do well in his class.  The first and last thirds are pretty straight-forward; he teaches complex numbers and differential equations for the umpteenth time at the end.  Go to class, don't go to class, it probably doesn't matter that much.\nThe middle part of the course is a different story.  Both Zhang and the book seem to give up on the material.  Classes degenerate into \"I don't know how to do this.  It just equals zero.  Do you believe?\"  \nWorkload:\nA problem set per week, shouldn't take more than an hour or two.  Two midterms and a final, all very short.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 09, 2005",
            "review_content": "\nI wanted to add to the chorus of good reviews. Even if he's hard to understand at first Zhang is an entertaining professor. Homework and exams are reasonable. \nThe one thing nobody mentioned that I appreciated a lot is he's as far as I know the only calc professor who tries to prevent cheating during exams. I had 2 calc classes here previously, and they used to sleep at the front of the room while the back row passed answers to each other. Zhang patrolled like we were prisoners at Alcatraz, which was nice.\nWorkload:\n3 midterms, 1 final. weekly problem sets of 10 problems each. all relatively easy.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 28, 2004",
            "review_content": "\nShou-Wu is definitely a character, and his class is very painless. He's superflexible, sometimes funny, and gives very little work.  The midterms and final were very straightforward and not too difficult.  He also lets you out early every day.   It's still calc, so it's not necessarily fun, but he makes it bearable.\nWorkload:\n4 weekly written problems, 4 webwork problems (cut down from 8), 2 midterms, final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 17, 2003",
            "review_content": "\nIn the first class he'll tell you how to pronounce his last name.  (It rhymes with 'king-kong' not 'gang.' ) Anyway, he does have an accent like most math teachers but it's not that bad and you'll get used to it quickly.  For example, he pronounces 'secant-squared-theta' as 'seekene-squayah-seta.'  He is a genius and is very nice.  He cut the webwork for our class in half because we complained to him that it was too hard.  He won't notice if you don't go to class but you have to go to get the homework problems in the textbook which he assigns at the end of class.  You can either call somebody or just show up for the last few minutes if you really don't wanna go.  Also, he often ends class as early as half an hour before the end of class.  He pretty much teaches with examples and finishes when he's done covering the material.  If you don't understand something, read the textbook.  I actually suggest reading the section that will be covered before class.  He is very open to questions.  One more thing, don't let him catch you leaving class in the middle.  There's not much he can do but he gets very offended and you will sit back down very embarrassed.  So if you come to class, plan to stay there till the end.\nWorkload:\nweekly webwork and 4 textbook problems.  ask him to do them for you on mondays so you can just copy them down and hand them in if you can't do them at home.  20% hw, 20% each midterm, 40% final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 15, 2003",
            "review_content": "\nI really don't see where these other reviews are coming from. Are they talking about the same professor? Sho Wu Zhang is useless. He is disorganized and unintelligible. I also disagree that he is a genius - he often would make simple mistakes early on in problems that he would need to go back and fix, confusing the class and wasting our time. If you want a professor who will bring the material to life, do not take Sho-Wu Zhang's class. Overall, he is an awful professor.\nWorkload:\nFour handwritten problems per week and some webwork.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 07, 2003",
            "review_content": "\nShou-Wu knows his stuff and has a much more bearable accent than many other profs in the math dept. His lectures are informative, at times amusing, and generally more helpful than the text, though I would agree that he lost some clarity near the end. He's easy to approach and very flexible (he cut the webworks in half when students complained, and points given on exams can be easily contested). Based on my peers' complaints of their own calc sections, I'd say Zhang is the best way to go when he's available.\nWorkload:\nweekly written problems and webworks sets (not complicated), 2 midterms and a final\nweighted 20/20/20/40 respectively\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 03, 2003",
            "review_content": "\nA wonderful, likable professor. Trying to understand his English, however, is a challenge in itself. Once you do, you realize that the man himself is a math genius, a flexble professor, and throws all sorts of corny references and jokes. And when he realizes that no one gets them, it only gets funnier when he tries to salvage them. In beginning of the course, his lectures helped a lot, but towards the end as the material became more complex, he started getting harder and harder to understand. I eventually skipped a few classes and learned right out of the book, and it worked out just fine.\nWorkload:\n2 problems on paper, 4-8 problems on WebWork each week, 2 easy midterms, 1 final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 18, 2003",
            "review_content": "\nAn absolute genius in math and even threw his unintelligble English it shows.  Luckily, he does not expect his students to be math geniuses and curves are generous even though the midterms are easier than those in other calc II classes.  If you can understand him then lectures are helpful, if not just read the text.  Either way it works and he is very understanding about not giving too much work.  \nWorkload:\nWorkload: Light: only weekly homework problems and a webwork problem set or two (the amount of questions which he halved because people complained), two midterms and a final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 04, 2003",
            "review_content": "\nShou-Wu is a genius in math, flexible (he cut our problem sets in half because two people complained it was too much work) and funny, but has some communication problems with his hilarious Chinese-American accent.  The lectures were more helpful than reading the text, but when a student would ask a question, the response was usually unintelligible, or at the most, unhelpful.  In his class, unlike my physics lecture, the seats were never empty.  He can be strict (don't try to leave his class early!) and unorganized, but no one is sorry for taking his class.\nWorkload:\nWeekly problem sets, four homework problems from the book each week, two easily-curved midterms, and a final.\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "May 20, 2002",
            "review_content": "\nThe guy is a Math Genius! This semester (Spring 2002) was his first teaching this course. Said on the first day that he doesn't teach from the book - a plus right away (gives you a reason to want to go to lecture - although the book is still enough). English isn't bad, and his wild accent will get laughs at first - \"What do you doooooooo\" -(eventually I didn't notice anymore). Kept the material as basic as possible. Very approachable. Answered everyone's questions. Problem is he doesn't teach many classes........... Catch him when you can.\nWorkload:\nWeekly problem sets (not too many problems - some other teachers definatly had more) - I also heard that he only assigned problem this semester because the other professors did so; 2 midterms and a final - very basic and straightfoward; easy to ace with some preparation\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "May 14, 2002",
            "review_content": "\nZhang is brilliant. His English, on the other hand, is not so much. After a few lectures of laughing at his English, however, you realize that the man can definately teach. Very well-prepared for class (without even using the book; he commented at the beginning of the semester about the text: \"Very heavy book. I no bring to class.\") and VERY knowledgeable about calculus and math in general. Not only is he flexible and very approachable outside of class, he cracks jokes and provides amusing anecdotes (in his broken and heavily accented English, this can be very funny). I loved this class, mostly because the entertaining and knowledgeable professor made the material come to life.\nWorkload:\nProblem set every week, 2 midterms, final\n"
        }
    ]
}