{
    "prof_info": [
        {
            "prof_name": "Shayoni Mitra",
            "prof_id": 10543,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "World Theatre",
            "review_date": "April 05, 2013",
            "review_content": "\nI have taken two classes with Shayoni and have loved both of them. Incredibly intelligent and eloquent, Shayoni's approach to theatre theory and theatre practices reflect a sorely needed critical perspective of theatre in a global and societal context. Her classes don't just teach me about theatre conventions or theories. They also challenge me to reflect on the implications of these conventions and theories in the larger paradigm of race, gender, class, and other power struggles in our local and global environment. \nShayoni does assign a heavy reading workload, and she does expect her students to read all of it. This can be particularly challenging, since the heavy discussion aspect of her class can easily reveal who had and hadn't done the readings. It takes time and effort to learn how to balance such a workload, but it is doable. \nShe is incredibly approachable outside of class, whether during office hours or at random encounters on and off-campus. Every time I see her, she always asks about me and what I am involved in. Also, Shayoni has quite the presence in theatre academia. She was mentored by Richard Schechner, and she has the connections to bring in professionals in the industry and scholars in the field to run workshops or hold guest lectures.\nIf you can, take a class with her. She's a good person to know, and a great connection to have.\nWorkload:\nAssigns a lot of reading for every class. Expects discussion and participation.\n"
        },
        {
            "course_name": "Theater History II",
            "review_date": "December 03, 2011",
            "review_content": "\nThis professor is on a total power trip- she constantly talked down to students and either didn't respond to or was very rude in e-mails. She had a bad habit of uploading extensive readings to Courseworks the evenings before class, so that even if we wanted to read them, we had little time to. Even though I learned quite a bit, I found it was mostly from students' presentations and my own reading of the material- this class should be taken with a more understanding and less pretentious professor.\nWorkload:\nOne 15-minute presentation on lecture topics; one midterm (easy); one 15-page research paper (fairly graded); attendance mandatory (2 free skips); a lot of assigned reading (3-4 hours per class), but since it's normally summed up by her/the students presenting, it's easy to get by without it\n"
        }
    ]
}