{
    "prof_info": [
        {
            "prof_name": "James Warfield",
            "prof_id": 1721,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Behavioral Biology of the Living Primates",
            "review_date": "July 26, 2006",
            "review_content": "\nI dropped this class in the middle of the summer semester because I couldn't take it. There is hardly any actual discussion of primate behavior. Instead he lectures for 4 and a half hours in a maddening style, continually asking questions whose answers could be anything. He is fishing for something in particular that no one can figure out. For example, he asked the women in the class why they shaved their legs and then stood there for several minutes waiting for an answer. No one was amused.\nHe spent most of the time (the first 2 and half weeks of a 6 week course) talking about the merits of logical arguments and his quizzes tested us on our understanding of them. Everyone failed the first one, even though it is open-note,  because his questions were so cryptic.\nDuring breaks we all comiserated about how terrible the class was. I don't regret dropping the course. My time is worth more than that.\nWorkload:\nImpossibly difficult open-note quizzes (in other words, the notes you take will have nothing to do with what is on the quiz. It's just a ruse to get you to write down everything he says. A paper and an observation project.\n"
        },
        {
            "course_name": "Behavioral Biology of the Living Primates",
            "review_date": "August 16, 2003",
            "review_content": "\nTake any class this man offers!  He is clearly passionate about this work and his lectures are almost always engaging.  I just finished summer school with him, and if I can say that after class twice a week from 1-5:25 (yeah that's right) than he's worth taking.  Here's an example of why: he starts the class with general philosophical concepts, to get us in the mode of thinking about the process of science.  Not only was it interesting, but it framed the class really well.  I am so thankful my last science requirement was this class -- it left a good taste in my mouth about Columbia's core. \nWorkload:\nOpen-book / open-note quizzes daily (much harder than that seems though!), primate observation project (difficult but really interesting), final exam (difficult but open-book / open-note because he wants you to learn, not to memorize -- hi, isn't that why you came to college?) and one paper, topic of your own selection, which was fun to write.  TONS of reading, but he'll tell you what you need to concentrate on so even the boring stuff is do-able.  Plus some of the books are fun, like anecdotes about primate observation.  NOT EASY -- don't expect to get away without working! -- but worth the effort 100%.\n"
        }
    ]
}