{
    "prof_info": [
        {
            "prof_name": "Kori Litt",
            "prof_id": 3966,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 29, 2013",
            "review_content": "\nShe is probably the best teacher I've had at Columbia so far. I didn't expect myself to be so awake for an 8:40 am class. She made all the discussions interesting and relevant to our every day lives. When I told her I was a SEAS student, she decided to incorporate the mechanical aspects of art and architecture into the discussions. Kori knows how to keep everyone engaged and she will go out of her way to make sure you know the material. And we even got to paint in one of the classes. Her enthusiasm is infectious. Honestly, if you get Kori as an arthum professor, consider yourself very lucky.\nWorkload:\n3 essays. 1 midterm and 1 final. Some short readings each week and some class participation is expected. The workload is relatively light. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 24, 2013",
            "review_content": "\nProfessor Litt was my absolute favorite professor my freshman year. As a SEAS student I was very skeptical going into art hum but it quickly became my favorite class thanks to her. Class discussions were always lively, intelligent, and informative and I felt like I left each class with a new way of thinking. She was great at encouraging students to participate in discussions and opened my eyes to new ways of viewing art and the world in general.\nHer assessment of my papers also helped improve my writing ability more than any other teacher I have ever had. She must have spent at least an hour on each draft of each essay per student, it was clear she cared about both our writing and content and worked to help us improve. I saw my own writing improve significantly throughout the year and my excitement for art grow. \nArt Hum was a fantastic experience for and I wish I could take her class again. \n(Did I mention she's hella cute?)\nWorkload:\n3 essays, occasional readings, occasional site visits (which are a lot of fun), class participation. \nVery very manageable workload\n"
        }
    ]
}