{
    "prof_info": [
        {
            "prof_name": "Robert Fucci",
            "prof_id": 11263,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 26, 2012",
            "review_content": "\nHonestly, Rob was one of the best teacher's I've had at Columbia. I'm not that into art and would never, ever have taken an art history course in college if it wasn't for the Core. Rob, as he asked us to call him, is a real honest to God teacher: you can tell he likes teaching and that he wouldn't rather be cloistered away in the library studying 17th century Dutch prints (which is his speciality). \nRob's greatest asset in my mind is that he is willing to engage students and in our section this allowed for really interesting conversations to develop. I would honestly do the reading in order to participate, which I think demonstrates how engaging Rob made class. (I don't do this for my other classes...)\nWhat I also found incredibly appealing is that Rob isn't stuck up and lost to critical theory / post-modernism. This in no way means--and should never be taken to mean--that he isn't a scholar. That was very clear, he really knew his stuff and was very intelligent. He just wasn't always spouting off about Foucault or talking about dialectics (whew!). I also like that he would sneak in prints whenever he had the chance, which is when you really saw his passion for his speciality. However, he was just as compelling on late 20th century works!\nHonestly, every class I walked away feeling like I had used my brain (and learned something about a masterpiece artist). That doesn't even really happen very frequently in my major. My expectations for Art Hum were pretty darn low. I was hoping to just not fall asleep and BS my way through the compositions. With Rob as a teacher this isn't an option, but for only the best reasons. \nGive Rob a silver nugget! Take his section if you get the chance!\nWorkload:\nVery reasonable. Normally the reading could be done in 30 minutes to an hour. Do it half the time and you'll be fine. Grading was fair, not sure if it was easy per se, but he definitely isn't a ball buster. Some said he was a tough grader, but I think if you do a conscientious job you can get yourself an A no big sweat. \nGRADING: Attendance/Participation is 20%; Paper 1: Formal Analysis is 10%; Paper 2: Formal Analysis is 20%; Paper 3: Reading Response is 10%; Midterm Exam is 20%; and Final Exam is 20%.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 16, 2011",
            "review_content": "\nRob is a pretty nice guy and creates a pretty relaxed class environment. He does a good job of making everyone feel comfortable no matter their background with art. Class can get a little boring here and there, and he sometimes struggles to create a good class-wide discussion, but I usually found class pretty enjoyable. Given the very reasonable workload (see below) and his lenient grading standards (at least from my perspective), consider yourself lucky if you're placed into his section.\nNote: He's particularly interested in art history, so he spends a fair amount on the lives of the artists. That could either be good or bad depending on your preferences.\nWorkload:\nNightly reading, but he pretty clearly didn't care if you did them except in 5 or 6 instances where he emphasized that everyone should do the reading. One 3-4 page paper (15%), one 5-6 page paper (15%), and one 2-3 page paper (10%). The first two of the papers required going to a museum to see the works in person. A midterm (15%) and a final (25%) for which he gave us a slide set containing all the pieces we'd have to know. 20% of the grade was for class participation. We also had to go to the Met and to the Cathedral of St. John the Divine with the class.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 10, 2011",
            "review_content": "\nAmazing Art Hum professor!  He really knows his stuff and is very clearly hugely into art.  I enjoyed every class and all of the field trips, and this is coming from someone who never was interested in art in the slightest before this class.  Rob is one of those people that draws you in simply by virtue of his own passion for the subject matter.  Plus, he knows the ins and outs of the Met, and is actually friends with a lot of the employees there, so we had great access to the reserves.  Highly recommend!\nWorkload:\nVery reasonable, 3 or 4 papers, 4 museum visits.  Reading for each class, but most are not entirely necessary to appreciate the subject matter or get a good grade.  \n"
        }
    ]
}