{
    "prof_info": [
        {
            "prof_name": "Alastair Ager",
            "prof_id": 5916,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Fundamentals of Global Health",
            "review_date": "May 13, 2013",
            "review_content": "\nI really liked this class. The professors who structure the class, Ager and Somer, really know some VERY important people in the Public Health world so you hear from very interesting and insightful speakers on a variety of topics. Like Les Roberts, a Prof A Mailman comes in twice, and he's basically responsible for taking on the Bush Administration for not accurately depicting the death toll of civilians during the war in Iraq. And also the Dean of the Mailman School lectures, and so does the International Director of Doctors Without Borders. \nAlso Ager and Somer are profs at the Mailman school and both do really interesting research that they lecture about and would be happy to talk more about if you ask. Really approachable. \nThe grading is reasonable, the workload is very manageable and the midterm and final are reasonable too. Ager and Somer are definitely dedicated to making this class interesting, but not a crazy time commitment on any of the students' time.  \nWorkload:\nmidterm, online daily reading quizzes, group project, final, and participation is determined by attendance\n"
        },
        {
            "course_name": "Fundamentals of Global Health",
            "review_date": "May 18, 2011",
            "review_content": "\nThe reviewer below does bring up a few good points, though somewhat harshly. \nThe class is, on the whole, very interesting. You have many people from Mailman and other schools as well that give guest lectures on a wide variety of topics. Drs. Ager and Sommer also give lectures, and Dr. Ager in particular is actually quite a good lecturer. Dr. Sommer's work is also quite inspirational. \nNow on to the class itself. Honestly, I don't know if this class should be a class. The information is mainly 'common sense' but the real impact is the actual work and research being done by the professors and guest lecturers (and yes, Jeff Sachs also gives a lecture that is a summary of End of Poverty; his slides were from last year (and overall outdated) as he had the date as last year's lecture and changed it in front of us). \nPerhaps the class should be like a 2 credit seminar where you would attend the lectures (which, again, are really interesting in and of themselves) and write a paper at the end (similar to the final). \nBut otherwise, good class, interesting topics/applications. If you think you might be interested in global health at all, take this class and see. Pre-meds: taking this class will be a 3 point GPA boost. Besides, you may find yourself interested in the topics after all. \nWorkload:\ndaily quizzes (online). midterm. final (essentially take home, except you actually write it in class). group project that i think everyone did ok on. \n"
        },
        {
            "course_name": "Fundamentals of Global Health",
            "review_date": "May 06, 2011",
            "review_content": "\nThis class is a joke. \n3/4 of the classes consist of guest lecturers. While some are fascinating, they don't make the overall course worth it. The information you learn is extremely basic. Read the NY Times and you'll get the same info. I felt that the class was so easy that it belittles the students - do we really need an entire class explaining to us how a mother's education and a child's health go hand in hand? Really? Also, much of the things covered were too broad and vague to be of much value.\nThe class is an easy A, sure, but not worth your tuition money. \nWorkload:\nEasy mid-term, group project (back to high school), final (essay questions provided 3 weeks before). \n"
        }
    ]
}