{
    "prof_info": [
        {
            "prof_name": "Emlyn Hughes",
            "prof_id": 3242,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Physics 1401",
            "review_date": "June 08, 2015",
            "review_content": "\n-no graded homework -> discipline yourself to practice!!!\n-awesome stories -> very charismatic\n-speaks fast\n-knows his stuff\nWorkload:\n3 exams (300 pts) & a final (200 pts) -> drops lowest 100 pts\nI only took 2 exams and the final\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 14, 2015",
            "review_content": "\nLet me preface this by saying I switched from 1601 first semester to 1402 second semester. This class was a let down in comparison to 1601. Dodd(the Physics 1601/1602 teacher) was the absolute best! He really cared about his students and makes an effort to learn and remember your name if you go to office hours. So if you do have some physics background and you're stuck between 1601 and 1401 from the get go, I'd say choose 1601. It's a lot of work (graded online PSET every week), but if you go to office hours Dodd helps you out. Now that I'm done gushing over Dodd...\nHughes is an Okay teacher. His teaching style is basically giving you the formulas and rules on the board and going through some examples. This is good preparation for the exams which is 20 free response questions, each worth 5 points. If you go over notes, do the practice exams, and do the homework, you should do fine. Since I had some physics background, his lack of in detail explanation was ok, but I could see how someone without any physics background might not fully understand and may need to put in a lot more work. I never went to his office hours so  I don't know if he was helpful. \nHe broke his hip towards the end of the semester, so he was unable to walk around and do problem examples on the board. His teaching turned into him sending us the lecture notes via email before class and then reading from those lecture notes during class. The lecture notes were literally just formulas, no examples. Going to lecture became useless and at least 60% of the class stopped showing up after that. \nIf could do it over again, I would have stayed in Dodd's class. The weekly PSETs made me stay on top of the class. And because some of the problems were really hard, I went to office hours, which definitely helped with homework and with understanding the material in general. \nBut if you feel you can stay on top of the material yourself, then choose Hughes. It's less work. \nWorkload:\nWeekly problem sets, not collected (watch out! its easy to get behind if you constantly put the homework off because its not graded. I would advise that you try and stay on top off it every week\n3 exams, each worth one equivalent (last exam on the last day of classes)\n1 final, worth 3 equivalents\n lowest equivalent is dropped\n\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "April 27, 2015",
            "review_content": "\nTake him, he's great.\nHe broke his hip this semester, and has been cracking jokes nonstop about morphine and his hip. He's hilarious.\nHe is also a clear lecturer, and I understood all of his chalkboard work. However, after he broke his hip he switched briefly to reading off the slides - which was not that helpful. The textbook presents all the material, so you can study from the textbook, but sometimes he does slip in some hints about the exams in lecture, so I would encourage you to attend the lectures before exams.\nThree midterms - the last one is right before finals week, so be prepared for some cramming. The lowest equivalent is dropped (so either a midterm, or half the final if you bomb the final). The midterms are fair - they're usually short answer, and range from easy to difficult.\nAnd no homework!\nWorkload:\nHomework is ungraded. Just do well on the tests.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "January 05, 2013",
            "review_content": "\nEmlyn's a nice guy but it drove me crazy how hurried he always seemed. He always began the class with \"I think I'll be able to get you guys out really early this time!\" If I'm paying for the entire hour and fifteen minutes, I'd rather he take his time through concepts or do more examples.\nOne of the most valuable things I did to study for the final was go through all the practice midterms and actual midterms until I felt confident with every single question. Sometimes very similar if not the same questions show up on the final...\nWorkload:\nSuggested problem sets but they're not collected. That means that your grade is based entirely on the midterms and exams. He drops the lowest midterm grade (of which there are 3).\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 12, 2012",
            "review_content": "\nGreat lecturer, very clear, single most enjoyable lecture class I had this semester.  He's a cool dude.  Frequently let us out of class early; cancelled class a couple days too (the ones before breaks).  Everything is well organized; homework and hw solutions posted on time, practice exams and solution posted.  \nExams are relatively easy, material still kind of difficult (I got a B+) Though be warned, for the exams, the TAs can be sticklers; make sure you show ALL your work.\nTake this class!\nWorkload:\n3 midterms, 1 final.  lowest midterm dropped.  hw uncollected/ungraded.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 09, 2012",
            "review_content": "\nNeedless to say, the December 21, 2011 review is absurd. Professor Hughes is a really cool guy, and I considered myself lucky to have wound up in his section. In addition to providing engaging and entertaining lectures on physics, he did a really nice job of leading our section with a helpful review of the material covered in the week's lecture. Professor Hughes would explain the topics in a clear and straightforward way, and would emphasize the topics we needed to be sure we knew for the exams which I appreciated. His grading on the midterm seemed a bit harsh - but this was perhaps meant as an encouragement to work hard on the term paper and on preparing for the final. I enjoyed the laid back atmosphere of his section and thank him for a pleasant and enlightening semester.  \nWorkload:\nSame as all other sections. The weekly assignments did not take very long. The midterm and final rely on a sound understanding of these assignments. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 21, 2011",
            "review_content": "\nProfessor Hughes clearly did not want to teach FoS. It was very evident that it pained him to reduce the complexities of particle physics and quantum mechanics to a group of students that frankly didn't want to be there. This underscores an interesting phenomenon of FoS: neither the instructors, nor the students, want to engage. It's a curious thing when a physicist attempts to explain neurobiology (though I guess I am lucky in that I didn't have a neurobiologist trying to teach quantum mechanics). \nProfessor Hughes also indicated that he's not at Columbia because it's Columbia, but merely because it \"lessens the length of his trips to Geneva, which he frequents.\" \nThis class is insulting, uninspiring, and a plain tedium. Everyone raves that the Core educates you, makes you a better person, etc. While this may be true for LitHum and CC, it is certainly not the case of FoS. This class made me question my choosing to go to Columbia. \nWorkload:\nWeekly assignments (dead easy). Mandatory reading (which is really optional), a dead easy midterm, a dead easy final, and a dead easy term paper. The class is dead easy. \n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "August 12, 2010",
            "review_content": "\nThis was the single most enjoyable class I took all of freshman year at Columbia. The lectures that I went to were interesting, though the 1:00pm class is way too early, and too hard to wake up for. Even if you do wake up on time, lunch is probably more important than class.\nEven though this class is important to have, so students can get a good foundation for more advanced classes, actually attending Professor Hughes' lectures are completely optional, since he posts up lecture notes every week, and all the information is in the textbook (Fundamentals of Physics by Halliday Resnick and Walker). A quick skimming of the chapter review in the textbook before the midterm is all that is needed to do well in the class, since a very extensive formula sheet is provided.\nWorkload:\nThe workload is definitely manageable, since this is basically a high school physics class, taught at a slightly faster rate.\n3 midterms-- 1 equivalent each--you only need to go to 2 of them. Which is helpful, since you will probably end up oversleeping and missing one.\nFinal Exam-- 2 equivalents\n\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 09, 2010",
            "review_content": "\nIf you do the (ungraded) homeworks and read the book sections, there is absolutely no reason for you to go to the lectures, even if you only do the reading and homeworks the night before the midterms/exam. They are dry and not very useful, and the chance of you falling asleep are higher than the chances of you learning something. The midterms are not bad if you cram and the median is always very low, making the curve fantastic. One is dropped too, allowing you to not even show up for the third if you do well on the first two. Also, I think he is a pretty high-profile researcher since he works in Switzerland all the time at the Large Hadron Collider @ CERN. \nWorkload:\nMidterms: 3 x 1 equivalent\nFinal: 3 equivalents\nLowest equivalent is dropped.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 25, 2009",
            "review_content": "\nI think some of the earlier reviews may be outdated: Emlyn Hughes is an outstanding professor, and he teaches Intro to Mechanics and Thermodynamics superbly well. He speaks quickly and clearly, demonstrates some sort of concept with some physics-related apparatus every class, and ensures that you are entertained. His lectures are extremely straightforward, and if should you decide to skip them, you can access his lecture notes online, which are equally straightforward. \nHe assigns homework, but does not collect them. He posts handwritten solutions to homework assignments online. Grades are based purely on exams. Exams are returned in timely fashion, and if there's a legitimate mistake in grading, you can file regrade requests.\n\nWorkload:\n3 midterms, each worth 100 points, and 1 final worth 200 points. Of these five exam equivalents, each worth 100 points, one is dropped.\n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "April 21, 2009",
            "review_content": "\nHughes is a great professor and very organized lecturer. It's too bad less than half the class regularly attends lecture. He'll often tell you what's on the agenda for the class, and occasionally finishes early. He also says whether he thinks the topic is easy or difficult, which I find strangely reassuring (like he understands if you don't get it or something)\nHomework isn't collected or graded, but I recommend you do them (and the practice tests) before his midterms. \nMidterms (3 of them) are difficult. By the time you finish the third one (which is about 2 weeks before the final) you are done studying for the final. Average was around the 60s. He gives 20 problems (rather than the standard 3 multi-part problem tests), progressing in difficulty. Last 3 or 4 are really tough. Work steadily but don't expect much time to re-check answers. Try to attend the last lecture before the test because he'll give a few hints (nothing huge, but rather nice.)\nHe'll spend some time talking about his research at CERN in Geneva ( it seems like he flies there every weekend) but it is interesting stuff and relates to the course material. He spends the last few lectures on topics not on the final (quantum mechanics and more on his research).\nAs far as science lectures go, this was an enjoyable class.  \nWorkload:\nProblem sets that aren't collected. 3 midterms (easy questions at the beginning, but tough overall) and a final. \n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "April 06, 2008",
            "review_content": "\nhe's a great teacher although he goes really quickly but i think that's how all the general physics 1200 level classes go.... he has 4 exams and a final exam.... the reason he has so many exams is because there is a lot of material to be learned in the course.... however.... he drops the 2 lowest exams... and if u do well on the 4 exams throughout the semester he will drop 2/3 of your final exam grade because the final exam grade is the equivalent of 3 exams.  Therefore, you will have 7 grades in the end (4 from each of the 4 exams and 3 of the identical grade coming from the final exam so he dropped the 2 lowest grades).... his exams are fair but you should definitely know the material as well as possibly.... he said that he gives 40% of the class at least an A- in the end.... \nthe averages on his exams were in the 70s so if you know your stuff pretty well you should be able to beat the average....  the problem sets aren't graded and you should definitely keep up with them because you will just have a ton of problems to do for the exams otherwise.... i wouldn't listen to the other reviews because he changed the curriculum of his course because it's his 2nd year teaching now and i think he heard the complaints.... all my friends who took him in the past and failed miserably were jealous that he changed his grading policy... he's a nice man and i would definitely recommend him\nWorkload:\nfair.... ungraded problem sets.... 4 exams throughout the semester and a final exam\n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "September 08, 2007",
            "review_content": "\nI wanted to defend Hughes from all these negative reviewers (well, partially defend him).  Let me start out by saying that while I received an A in this class, I found it very difficult.  I haven't taken biology with Mowshowitz yet, but my guess is that Hughes is basically the physics department equivalent of Mowshowitz.  His exams are very hard and require both knowledge of the material as well as an advanced problem-solving ability.  The average grade on the tests was consistently around 50% (obviously there was a substantial curve).  So yeah, this class is hard.\nThe positives?  First of all, Hughes is an excellent lecturer (again like Mowshowitz?).  He also devoted the last few lectures to explaining how atom bombs work, saying that he wanted to teach us something we'd actually remember after the MCAT (and he gave a lecture on developments in modern physics, which I found very interesting).  Most physics professors at Columbia give exams with a few long, multi-part problems, but Hughes' tests had a more rapid-fire approach, with lots of short-answer questions.  Basically, his exams get you ready for the MCAT.\nOverall, I thought this class was difficult but well-taught and fair.  There was calculus on the problem sets but none on the exams, if that's important to you.  I would also expect the quality of the class to improve a little in the second year.\nWorkload:\nIt's a premed class, obviously its a lot of work.\n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "July 24, 2007",
            "review_content": "\nDo not be fooled by the nonchalance of Professor Hughes.  He may be \"cool\" but his tests sure as hell aren't.  He claims that they  are \"MCAT style\", but they aren't.  They are cruel and painful (10 times harder than the MCAT physics questions), and sometimes you feel that studying for 3 hours vs 23 hours won't make a difference.  The TA was rather useless, considering he didn't show up half the time and when he did he gave incomprehensible explanations.  In any case, unless you desire to stress yourself out unecessarily, spare yourself from the misery.\nWorkload:\n1 collected Problem set a week, 2 midterms, and a Final.  \n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "July 24, 2007",
            "review_content": "\nDo not be fooled by the nonchalance of Professor Hughes.  He may be \"cool\" but his tests sure as hell aren't.  He claims that they  are \"MCAT style\", but they aren't.  They are cruel and painful (10 times harder than the MCAT physics questions), and sometimes you feel that studying for 3 hours vs 23 hours won't make a difference.  The TA was rather useless, considering he didn't show up half the time and when he did he gave incomprehensible explanations.  In any case, unless you desire to stress yourself out unecessarily, spare yourself from the misery.\nWorkload:\n1 collected Problem set a week, 2 midterms, and a Final.  \n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "June 14, 2007",
            "review_content": "\nLet me tell you this, if you know the beloved Prof. Moshowitz, this man could quite be her equal (or maybe even she's his mistress).  This class was totally demeaning and this professor made us feel that way from the very beginning by saying what i'll never forget which i think resonantes throughout the premed sciences at columbia.  He said, \"well, i'm tenored here, so i don't care if you like me or not.\"  what a way to set the tone/environment of the class. i suppose it was beneath him for him to have to teach us these topics.  let me break it down for you in categories why: NEVER UNDER ANY CIRCUMSTANCES TO GO AGAINST SUCH _____.\nEXAMS-- a joke, completely.  the average on every midterm was exactly the same 50%. AND, this is the biggy, they were ALL MCAT style. the questions will take you away to another place (definitely physics unrelated). you will spend hours upon hours doing his ACADEMIC TEXTBOOK problem sets(amounts of problems from certain sets are unreasonable) only to be awarded the 10% of your grade \"prize,\" which by the way some will simply go to the TA to get the answers, while the graduate students as tutors were making a fortune off desperate postbacs and motivated undergrads alike. what i would like to impress upon you (and i think a large majority of my colleagues would agree with me) is that MCAT physics and ACADEMIC physics are very different animals, and b/c he was so pathetically lazy (more on that later) we were assigned problems from the text which even if we understood them had very much difficulty applying that theory to the very different STYLE of questions on the exam compared to the homework problems.  YES, many of us purchased or used mcat practice books, but to no avail they were of no help.  he allowed us to make our own formula sheet, 1 double-sided page for the second midterm but for the topic of magnetism you will come to see that it is useless.  \nFINAL EXAM-- i think we were all raped.  WAY WAY WAY toooo many formulas, and at the last 2-3 weeks of the course very quickly covered numerous chapters on relativity, diffraction gratings, optics etc. etc. that we had no chance to really learn but needed to prepare for this charade.  he allowed 3 pages of formula sheets--spent half the exam trying to find the right formula and the problems were much too difficult.  i walked out looked at someone, he said to me, \"what just happened?\" i too hadn't a clue.  i studied like a masachist day and night for a solid week for this final, i really felt terrible, the worst i've ever felt leaving pupin that day.  i must admit that i was upset.  that is the very reason i decided to write this review, b/c i am hopeful that i can prevent others even a tenth of this experience or feelings that i did. if i can, then it was well worth it.\nLECTURES-- if i'd give the man anything, which it kills me to do, objectively, he really isn't a bad lecturerer at all-- about an overall B grade.  that being said, when i went to the exams i said to myself where are all these people coming from.  i've never ever seen them before.  40-50 students usually attended of a class of almost 200.  i presume the numbers dropped b/c people's disgust and frustration of the entire situation.  ultimately, he really is quite a decent lecturer, but this will DO absolutely NOTHING to alleviate your semester-long torture or help your grade.  so since we are primarily concerned with our grade and possibly learning something in the class, this guy is not going to do either of those for you at all. he told us his purpose was to help prepare us for the physics section of the mcats.  i would submit that he did a terrible job and diservice to us all that were unfortunate to participate. \nIf you need to take this course do yourself a favor, and if at all possible plan or commit yourself to schedule it ONLY with prof. alan blaer, so that you may learn this tough tough material in a humane fashion. briefly, i did mention earlier i would return to his laziness, and i found this one thing particularly annoying.  he was new here, so he needed to give us a practice exam for the first midterm.  he photocopied Prof. alan blaer's first midterm AND formula sheet. AFTER we all spent time studying it and using it to prepare for the upcoming first midterm, he later told us that he changed his mind and would be giving an mcat style exam so that Blaer's exam wouldn't really help us too much and neither would the formula sheet.  you can imagine the fury.  he exercised poor judgement here and was very insensitive of our very limited time.  that was his first mistake, and for me his last. trust me, shop elsewhere. don't be fooled by what seems to be a nice person lecturerer b/c i promise you, you will be sorry.   i hope this helps anyone.  \nWorkload:\nINSANE PACE.  10% practically unsolveable weekly problem sets that you end up copying the TA's work.\n2 midterms worth 25% each. the pace and difficulty of the amount and breadth of material you need to learn is unreasonable. \nFINAL EXAM- 40%.  maybe PRAY instead of studying?? \n"
        },
        {
            "course_name": "General Physics Lab II",
            "review_date": "May 13, 2007",
            "review_content": "\nOkay so here it goes.  I got an A- in the class, so mind you, even though I am bitter, it is not because I wasn't satisfied with my grade.\nProfessor Hughes was a HORRIBLE professor. \nHe never wanted to be there.  He told us he only came to Columbia because he wanted to shorten his commute to Geneva for his research. \nFor our first practice mid term, he gave us another classes exam.  On it was material we had never even covered.  So the weekend before, while I should have been studying for stuff that was on the exam, I spent 50 bucks with a tutor and a couple of hours learning new material, only to discover on Monday morning that none of it was relevant to the test.\nThe tests are VERY difficult.  The average was 50 for both midterms and a 56 for the final.\nObviously, the curve fared well for those who could keep above it even by just a little.\nBut the work load is enormous.  You'll either have to spend three hours a week in reciatation to figure the problems out, or hire a tutor.  The problems and VERY heavily calculus based.\nThe physics II material is difficult.  But instead of using the whole class to teach, professor Hughes would just seem to wing a lecture it seemed he hadn't looked at since he last taught at Cal Tech.  And he would even end class early.  Many time he said, \"You're just not going to get this.\" or \"Just stare at it if you don't get it.\" \nOne time when I asked him a question, his response was, \"That's just the way it is.\" and then he turned around and walked away.\nDon't get me wrong.  He's a nice man.  But a horrible professor.  He clearly has NO desire to be teaching.\nWorkload:\nFairly heavy.  The homework takes a long time, and is very calculus heavy.  Sometimes it even throws the grad students for a loop.  The material is challenging, but you can master it.  What's most difficult is the ammount of material for the cumulative final.\n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "May 09, 2007",
            "review_content": "\nProf. Hughes is new to Columbia, having taught previously at Cal Tech.  He is definitely tough, much tougher than Prof. Shaevitz (I had him for Physics I).  He has very high expectations for his students, thinking we're all engineers from Cal Tech.  The material is also much tougher than first semester.  I don't mean to scare you away from him, but if you do take this class, be prepared to spend time learning and reviewing the material on your own.  Class does not really help, the textbook is the best.  For some, it may just be over their heads, but if you enjoy Physics and grasp the concepts well, you'll do fine in this class and you'll probably learn a lot.  I enjoyed this semester more than last because I learned more.  This semester goes beyond the high school physics stuff.  It's very interesting, but Hughes does not make it easy.  Although Calculus is not required on the exams, all of the homeworks require it because the book likes to use it.  The exam questions are very simple, easier than the homework questions, so the best preparation for the tests is to do as many questions out of the book as you can.  Don't expect to walk right through this course like 1201.  \nWorkload:\nHomework Assignments every week (some long, some short), Two Midterms and a Final (cumulative).  Much time will need to be spent comprehending the material.\n"
        }
    ]
}