{
    "prof_info": [
        {
            "prof_name": "Alvin Krasna",
            "prof_id": 1963,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "General Biochemistry",
            "review_date": "January 06, 2014",
            "review_content": "\nI took this class because the undergraduate biochemistry class conflicted with my schedule. And it was perhaps one of the best decisions I ever made. Professor Krasna goes through a lot of material and you're expected to memorize and know a lot of information. I think at some point, I had all the amino acids and the structure of every (important) intermediate in the Krebs cycle memorized. But aside from the amount of things we're expected to memorize, Krasna's class is INCREDIBLY straightforward. He created his own \"Syllabus\" with detailed summaries of lecture notes, diagrams, problem sets and practice exams. His notes are so organized my friends in the other biochemistry class were using them. Krasna is very honest with what he expects from his students; his powerpoint lecture also cover all material for the exam. Some tricky questions on the exam that require you to apply what you know to a new situation, but nothing too bad/impossible (unlike Mosh). After hearing horror stories about how difficult the undergrad biochemistry class was, I'm really glad I took Krasna's Biochemistry class. \nProfessor Krasna is also such a nice elderly man. He does his best to accommodate the students (he made the final worth 60% for those who didn't do so great on the 2nd exam) He worked with Chargaff and lived through the years most of biochemistry was figured out; there's a lot of wisdom and interesting scientific knowledge he offers in class. There are also several demonstrations in class using traditional methods of biochemistry which are kinda cool. \nTAKE THIS CLASS. Best decision of my undergrad biology career. \nWorkload:\n2 hours of class per week, which is a lot less than the undergrad class. 2 exams, 1 final worth 50%-60% of your grade. problem sets that are not handed in, but very helpful for exams. practice exams very much like the actual exam. \n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 21, 2010",
            "review_content": "\nI took this class because my schedule conflicted with the undergraduate biochemistry course. It is not easy. I don't think any biochemistry class can truly be called \"easy,\" but his exams are somewhat similar to Mowshowitz exams - deceptively simple questions, especially on the 2nd and 3rd exams, that require you to know every single detail of every one of the twenty metabolic and synthetic processes involved. Lecture is only once a week, which may be useful depending on your learning style, but you can do well without going to lecture and just reading his lecture summaries in the back of the syllabus that he will hand out. If you are good at organic chemistry it will be made somewhat easier for you. There IS a pretty generous curve based on class averages. \nWorkload:\nThree exams, psets that you should do if you know what is good for you. \n"
        },
        {
            "course_name": "General Biochemistry",
            "review_date": "January 16, 2010",
            "review_content": "\nHe is a little difficult to follow and doesn't encourage discussions which may be because the syllabus is huge to cover and doesn't allow time for it.\nThe class is boring as there is no discussion on the contemporary research or development in the field which makes other Columbia classes apart from a small teaching oriented university undergraduate lecture.\nSo basically it will not make a difference whether you attend the lecture or not as the slides(the only good thing about the class) are  available in coursework.\nThere are three exams -20%,30% and 50%.The exams are very straightforward but require a lot of memorization rather than analytical thinking .\nI advise taking the biochemistry class offered by department of biological sciences.\nWorkload:\nFair for a student with strong organic chemistry background else need a little effort.\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 13, 2005",
            "review_content": "\nIn this class you are on your own. You can basically skip the lecture, because you won't learn there much.  When Professor Krasna lectures, he is in a trans where only he knows where he is. He jumps back and forth from one thing to another. To follow him you have to come to the lecture knowing the material cold. \nI have attended every lecture and read all assigned text and that was a waste of time. You need to solve the assigned problems  and go back to the text book to read up on specific topics as you go along.\nOne thing he loves is Carbon labeling, so learn that well. \nWorkload:\n1st test 20% - do well on this one or you will be crushedMidterm 30% Final 50%, which is a cumulative.There is no curve.\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 19, 2004",
            "review_content": "\nProf. Krasna is a wonderful old man.  He loves his biochem.  But don't expect to learn much in class.  Get nice and close with your textbook and don't procrastinate.  I repeat, DON\"T procrastinate.  Krasna's class isn't hard, it's pretty straight forward esp if you're coming from a right and proper orgo screwing.  But he expects you to memorize tons and tons of structures - sugars, fats, amino acids, you name it you have to know it.  It's not too bad if you're into that sort of thing, but you can't put it off til the night before an exam.  His tests aren't tricky at all, you just have to do a lot of learning and memorization and all of it by yourself.\nif you're the disciplined worker, take this class - you'll do well.  it's full of postbacs and they're super annoying, there's no curve in the class (which sucks coz it'd have helped me) and there is nothing due ever. the other alternative is cranky zubay and co. in the undergrad class where there's a curve and tests are open book but also recitations and weekly quizzes - pick your poison.\nWorkload:\n2 midterms and a final.  Final is a motherf**ker cumulative as all hell took me 4 hours straight and i still didn't do that great. \n"
        }
    ]
}