{
    "prof_info": [
        {
            "prof_name": "Brenda Perez",
            "prof_id": 10163,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Genetics",
            "review_date": "May 05, 2010",
            "review_content": "\nMaybe, in a couple of years' time, these two instructors will be decent lecturers. For the present, they're just plain bad (consider the fact that Mowshowitz sat in on two of our lectures). Perez-Cheeks is marginally better than Lim, but I may be biased because I found her material more interesting. \nThe first couple of lectures were insanely rushed because Lim assumed we'd learned it all in intro bio. Like the previous review said, whenever Lim didn't like the Clicker responses, she'd tell us that we needed to review the material. The fact is, we never actually LEARNED that stuff in intro bio (at least not in such depth), which only covered the very basics. My main frustration was that with all the time she spent talking about how we needed to review intro bio material, she could have just taught the material to us.\nEven when she did slow down to re-cap the more confusing concepts, it wasn't that helpful because she couldn't explain it any differently from the book. I'm fine with textbook lecturers if the textbook is any good, but our textbook was terrible, so Lim's offhanded responses (\"Well, this was in your book, so take a look at that\") were hardly reassuring. She also liked to work out problems on the overhead, but her explanation of the process sounded like something regurgitated and didn't really give us time to absorb the information. \nPerez-Cheeks was at least a clearer lecturer, but she lectured heavily from an unassigned textbook (which was kept on reserve). With such a heavy emphasis on prokaryotic genetics, I wish they'd assigned us a more comprehensive textbook. \nI think my main issue was that it was so obvious neither of them really wanted to teach this class. For the most part, they slavishly followed the textbook's explanations without stopping to consider whether the textbook was all that good at explaining the concepts. At the beginning of the semester, they told us that they would prefer it if we emailed the TAs instead of them because it'd be too time-consuming to respond to so many emails. On top of that, they didn't hold office hours because neither of them worked on the Morningside campus (the logic being that in the past, no one had bothered going to office hours when they were held at the medical campus... So why couldn't they have reserved a room on campus for an hour or two before each class?). This meant that if we wanted to ask them questions directly, we had to cram them into the few minutes before and after class. I'm sure a lot of people just resorted to emailing them anyway, but I was floored by how eager they were to distance themselves from the class.\nWorkload:\nMedium for a bio class for undergrads. Weekly problem sets (mostly from the textbook, which makes it easy if you have the solutions manual, but they take off points if it's obvious you just copied the answers). Five 10-minute, MC quizzes throughout the semester. Two midterms and one final. Participation is taken via the clicker (so you can't miss too many classes). \n"
        },
        {
            "course_name": "Genetics",
            "review_date": "May 02, 2010",
            "review_content": "\nThe semester started out pretty inauspiciously, with Lim rushing through the lectures absurdly fast, making obvious errors/getting somewhat offended when people pointed them out, and spending over 15 minutes fiddling with the stupid iClicker software. This software was particularly useless during these first few lectures when, even when she saw that less than half of the class got the right answers to the clicker questions, she dismissed the class's lack of understanding telling us \"You should have learned this in intro bio\" and that we should \"go review it on our own time.\" Eventually she got the picture and slowed down for a few lectures, unfortunately to a snail-like pace that left many asleep. \nThankfully, by a month or two into the semester she figured out a decent pace and started getting her act together. There were still a few topics that seemed very rushed, though, and more than once I had to go home and reread the lecture notes before I understood a lick of what she was talking about. \nI preferred Perez-Cheeks as a professor, though I wasn't crazy about the actual material she taught.  The class discussed more prokaryotic genetics than I particularly cared for. This was especially problematic due to the fact that our textbook was primarily eukaryote focused, leaving Perez-Cheeks to assign homework out of a textbook nobody owned (she thought she rectified this by keeping the secondary text on reserve, a slightly laughable idea since it was two copies for about 80 students.). Not that the book was particularly useful for the material it actually did cover. In fact, I found myself referencing Becker (World of the Cell, from Mowshowitz bio) more than our textbook. \nThere were some times when the class felt exceedingly disorganized, which had me feeling nostalgic for Mowshowitz's wonderfully choreographed teaching. The material was often presented in a strange order, material awkwardly switching between eukaryotic and prokaryotic or being taught almost piecemeal.\nBut all in all, the class ended up being decent, despite its flaws. They definitely weren't the best professors, but they weren't the worst by any means, and were generally nice people. It was even somewhat interesting at times, and I could stay awake through it most of the time.\nWorkload:\nWeekly homework that ranged from incredibly tedious and long (during the recombination section) to generally fair. One problem graded at random, lowest two scores dropped. Six easy/moderate difficulty quizzes, lowest score dropped. 80% clicker participation (right answers not necessary, you just have to be in class Two challenging (but surmountable) midterms with NO DROP EXAM. One CUMULATIVE final.\n"
        }
    ]
}