{
    "prof_info": [
        {
            "prof_name": "Wanda Knauss",
            "prof_id": 2675,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Intro Lab to Cellular and Molecule Biology",
            "review_date": "March 20, 2015",
            "review_content": "\nI too walked in the first day of lab panicking from what legend says about Wanda. I shook as she hovered over me watching me micropipette and sweat whenever she asked me a question. After some time i started to understand her. She just has a really dry sense of humor and most people take it as her being mean. She means business but also really wants you to understand what the experiment is. She breaks down the procedure for lab to make it really easy to understand. She repeats herself constantly and makes sure you know what you are doing. She tells you exactly what she wants in her lab reports so while she goes on an hour rant about her expectations DON'T ZONE OUT! She really tells you exactly what to write so pay attention! \nSo all in all she is really scary but she's also really funny once you break down that barrier of intimidation.  Also always ask your TAs for help they are amazing. \nWorkload:\n2 lab reports, final midterm, weekly quizzes\n"
        },
        {
            "course_name": "Introduction to Organismal/Evolutionary Biology",
            "review_date": "November 19, 2014",
            "review_content": "\nThe first day I walked into bio lab I thought this semester was going to be HELL in lab, but I really ended up liking Wanda. The first day she came off as a total bitch and I was scared to say the least. However labs 2-9 she was nothing but wonderful. She is a very knowledgeable woman and very intelligent and she explains things VERY WELL! (far better than my lecturer professor Hertz). I don't know why she seemed rude the first lab, but she was never that way the rest of the time. She smiled and made jokes proving that she is not a stuck up bitch as the semester went on. Her grading on assignments was very fair. I only got a B on each lab report but I don't think that is terrible.Her corrections made perfect sense and the points I got off were definitely my own fault.Unlike other lab professors, Wanda very clearly describes what she wants EXACTLY in her lab reports (i'm talking she tells you exactly what words to use in each sentence for each section). Each time we had a lab report due she would spend an hour going over what we needed to do on the lab report.This made the lab reports a no brainer. I would actually highly recommend Knauss. I learned way more from her than my friends who have other lab professors. I'm not sure why she has such scathing reviews from the past, but I am here to tell you that you do not need to worry. Trust me I was terrified the first day but I felt very comfortable from then on and I think it is easy to ask her questions and she is always very helpful. \nWorkload:\nquick 5 pt. lab quizzes at the start of each lab, midterm with a practical portion, final -all written with diagrams. only 2 lab reports. Most labs had a somewhat quick lab homework assignment, but not all labs did. oh and an American Museum of Natural History assignment! pretty simple, not too difficult. \n"
        },
        {
            "course_name": "Intro Lab to Cellular and Molecule Biology",
            "review_date": "March 29, 2010",
            "review_content": "\nWanda Knauss has a really bad reputation but is no where near as bad as people seem to think. I've had her for two semesters now and am glad for it. She's extremely intelligent and is always willing to help. However, she doesn't spoon feed you answers. Instead she asks questions in a way that lead you to the correct answer. In other words, you actually have to use your brain. She's also not an easy grader and can be picky, but I learned a lot from her. Frankly, too many people seem keen on blaming her for their own mistakes. A lot of the corrections she makes make sense. If you want to do well in her class just pay attention, actually learn the material, and be ready to think.\nWorkload:\nModerate: two lab reports, one midterm, and a final.\n"
        },
        {
            "course_name": "Intro Lab to Cellular and Molecule Biology",
            "review_date": "May 12, 2009",
            "review_content": "\nWanda is a mean-spirited person and will ruin your grade.  By all means avoid her lab section.  She made me miserable all semester and Dr. Goldstein,who runs the labs did nothing about it, even after I went to her for consolation. \nWorkload:\nShe made writing lab reports extremely unpleasant.  Her instructions were always vage and and was a completely unfair grader.  As a result, you'll work harder and do worse than if you were in another section. \n"
        },
        {
            "course_name": "Intro Lab to Organismal and Evolutionary Biology",
            "review_date": "February 17, 2009",
            "review_content": "\nWanda is a horrible lab professor. With an obvious chip on her shoulder, she obviously believes that not only is she above teaching, she is in every way above you. Asking questions will only end up with her literally laughing in your face and a condescending comment. \nShe does not explain lab procedure clearly enough (she is incredibly long-winded) and she grades much too harshly. When I took my lab report to the head of the department, it was basically her telling me that all the things Wanda marked off for were things that she found no problem with. Wanda even decided that she didn't like the way the head of the department had told us how to cite references and TOOK OFF POINTS FOR THAT TOO. \nLabs are always hard to reschedule, but if you can, get out of her section. \n\nWorkload:\nShe makes almost all of the assignments that are supposed to be individual, group assignments merely because she's obviously above grading too. This can be a good and bad thing, but mostly make sure that you have your own copy of all the work, it comes in handy when studying. \n"
        },
        {
            "course_name": "Biological Diversity Lab",
            "review_date": "December 26, 2006",
            "review_content": "\nShe is a lunatic.  Horrible horrible horrible.  She crushes all curiosity out of you.  She treats you like a leper.  Basically she is intolerant of all life and it is ironic that she is a bio instructor.  Please avoid her lab section.  And by the way she prides herself on ruining your grade.  \n"
        },
        {
            "course_name": "Biological Diversity Lab",
            "review_date": "December 01, 2005",
            "review_content": "\nI know you can't choose your lab instructor, but if you can avoid Wanda, you should. She is incredibly condescending and admitted to the class that she grades lower than any other lab instructor and that that's just too bad for us. She makes you feel stupid for being curious and asking more questions and if it's 5:01 and class is over, she'll tell you to email her with any questions because lab is over and she doesn't want to answer any more questions. So.. if your schedule is flexible, get our of her lab section-fast. \n"
        }
    ]
}