{
    "prof_info": [
        {
            "prof_name": "Michelle Smith",
            "prof_id": 11391,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Political Theory I",
            "review_date": "May 05, 2013",
            "review_content": "\nProfessor Smith's enthusiasm for political theory shows is contagious and I really enjoyed her teaching style. In addition to giving engaging lectures (she utilized Prezi rather than slide shows, included videos, and funny images), she facilitated discussions in the classroom which made what could have been a boring subject very interesting.\nShe was also extremely understanding with regards to extensions if you come to class, participate, and do the work.\nAlthough there is a lot of reading assigned, the Prezis are extremely informative as to which sections of the readings you should focus on.\nWorkload:\n4 essays (varying in length from 2-6 pages)\nNo final. Instead 2 drafts of a persuasive essay (6-8 pages)\nA lot of reading.\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "November 11, 2012",
            "review_content": "\nProfessor Smith is very nice, however, she seemed to be much less knowledgeable about political theory than either of her two TAs. I understand that she is a new professor, but her level of mastery in the field could easily be that of an entry level graduate student. For example, I tried to explain to her in her office hours how classifying people as \"the other\" is polemical. She couldn't quite understand this concept, and frankly, didn't even seem like she wanted to. Her TA however, Andreas Avgousti, did a superb job at elucidating the basis for this idea. \nThere were also times when her feedback conflicted with that of her TAs. This resulted in a game of grading roulette, where your grade simply depended on who received your paper, regardless of the quality of your work. This was probably the worst part of the course, for it invoked a feeling of helplessness at the hands of an instructor who couldn't quite comprehend complex arguments.     \n\nWorkload:\nTen Pop Quizzes + Four to Five Essay Progressions\n100-150 pages of reading per week\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "March 20, 2012",
            "review_content": "\nNot my favorite course. To begin with, Professor Smith is a perfectly nice woman. But something about her teaching style just didn't work too well for me. She is a lecturer not a notes giver so you kind of have to make your own guesses as to what's important.\nThe readings were the only part of the this course which I particularly despised. For a 1000 level class, this class had ABSOLUTELY excessive amounts of reading for every class along with pop quizzes for those readings. The papers were graded kind of harshly by the TA, and not so much by Professor Smith herself. The one thing about essay prompts is that they are very unspecified while the TAs look for specific things. It's hard to do well when you are playing a game that you don't know the rules to.\nConclusion: This class is not for the weak-stomached.\nWorkload:\nSO MUCH!! 100-150 pg per class, 10 in-class pop quizzes, no final or midterm but 5 essays which are no walks in the park\n"
        }
    ]
}