{
    "prof_info": [
        {
            "prof_name": "Tarik Belhoussein",
            "prof_id": 5571,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Arabic I",
            "review_date": "December 30, 2013",
            "review_content": "\nTarik is very sweet, easy-going, and understanding. He doesn't make you feel bad if you don't know something, and makes the classroom environment comfortable. That being said, a one-hour class for Arabic is not enough to really learn new things, but simply to solidify knowledge and go over things students are having trouble with. This means that you are responsible for dedicating 2-3 hours every night to Arabic (homework, vocabulary, grammar, etc.) While Tarik is a fair and relatively lenient grader,  he does expect you to speak in class, consistently attend and participate, know your vocabulary, turn in your homework, etc., which makes it hard to get an A as a final grade.\nWorkload:\nHomework every night, quizzes every other week, an oral presentation, and a final exam\n"
        },
        {
            "course_name": "Arabic I",
            "review_date": "March 23, 2012",
            "review_content": "\nIf you want to learn Arabic do not take this class. Although he might seem nice, he is not what students need in the first year. He was horrible at explaining grammar, which will curse you for years if you dont get it down. \nHe never wrote on the board!!! This was extremely annoying because we had no class notes, no examples, no visual aid! Even when students would as him, he wouldn't do it. I ( and my fellow classmates) were scared to come to class because he always put students on the spot. \nNow that I have a different arabic teacher, I realize how deprived I was. Teachers are suppose to guide you and make themselves available to you. Tarik would frequently skip out of all OH appointments students made. All in all, he is not someone you should take for year 1 or 2. He did not prepare us for the quizes. When we asked him what we should study, he would always respond \" Know everything\".  He is an okay guy ( even wrote me a good rec letter) but in all honestly the other teachers in the department are heavenly!!! \n\nWorkload:\nstandard arabic. \n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "December 21, 2011",
            "review_content": "\nI have to respectfully disagree with the previous professor. I had a different Arabic professor for first year Arabic, and found that compared to her, Tarik did not help us feel at ease in the classroom. He also is not so great at explaining grammar, which is frustrating because second year Arabic gets very technical and detail-oriented. Unlike other Arabic professors - I know of at least two others that do this - he does not pause the recording or give the class extra chances to listen to the listening portion of quizzes/exams. I know of several fellow students in my class this semester who have expressed that they are not continuing with Arabic next semester because of Tarik. Definitely try for a different professor, if you can -- compassion and clarity go a long way in learning a new language. He's a pretty nice guy, so don't be deterred from taking Arabic altogether with him, just know he is not the best that the department offers. \nWorkload:\nDepartmental 2nd year Arabic syllabus - nightly homework, 4 quizzes over the course of the semester, presentation, final exam.\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "December 21, 2010",
            "review_content": "\nI'm surprised no one has waxed lyrical about this man yet!  He is a fantastic professor: very easy-going, very friendly, makes a very comfortable environment for learning such a difficult language, and certainly a very effective teacher.\nThough he doesn't tally participation, speaking is a daily activity.  While it's scary at first, you relax into it.  When the final oral exam rolled around, it felt very natural to answer interview questions (from a different professor) -- there was minimal stuttering and umming and wild gesticulating.\nThe nightly drills are fairly standard language exercises, covering listening, writing etc. that definitely help.\nDefinitely review the grammar and vocab every night. Just a good habit that will save you a lot of trouble in the long run.  (Quite honestly, I did not form this habit and managed to scrape by; but I definitely regret not spending more time on the language...you get as much out of it as you put in, I suppose.)\nThe biweekly quizzes are straightforward and fairly low-stress.  Expect to never be surprised by what is on these: they're \"cumulative,\" insofar as each chapter builds on the last.  For example, you might be expected to recognize past grammatical constructions but if it wasn't a focus point in the two weeks leading up to the quiz, you probably won't be expected to use them yourself.\nIf Arabic seems like an impossible language, have no fear!  Tarik makes everything very clear and doesn't move too fast through the material.  \nWorkload:\nNightly drills that don't take more than half an hour to an hour.  BUT it is definitely recommended that you take time to review the grammar and learn the vocab! (While there isn't an overwhelming number of words, there are enough to cause a headache come the final.)\nQuizzes are every other week.  \nFinal --> Listening, Oral, Written Sections\n"
        }
    ]
}