{
    "prof_info": [
        {
            "prof_name": "Kyoko Loetscher",
            "prof_id": 10748,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Third Year Japanese I",
            "review_date": "April 16, 2016",
            "review_content": "\nMatsui sensei, as we call her in class, is fantastic. She is an incredibly kind caring teacher, who will be patient with you in your questions. If you have the chance, I highly recommend taking Japanese with her.\nThe workload is manageable, and even if you get behind she will not penalize you but instead help you catch up!\n\nWorkload:\nWorkload:\nDaily quizzes and HW\n4 Tests, 1 Midterm, 1 Final\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "November 09, 2012",
            "review_content": "\nMiss. Kyoko Loetscher, or Matsui-sensei (as we call her) is truly a wonderful teacher. \nShe is sweet, funny, and very approachable. She understands those sometimes quirky questions we can make about language, and will explain everything in a way that will be simple and effective. She makes the class feel comfortable, and will make sure that nobody gets left behind. Matsui-sensei is more than willing to go out of her way and help each student. Other past students to which I've talked to always remember her with much affection.\nHer classes will start with the daily quiz, for which you can a few spare minutes to revise before she starts. Then she announces the homework, and begins the powerpoints presentations which always involve reading aloud as a group and then individual practices with (non-intimidating) interrogations.\nI guess she sounds like an ideal teacher with this review. I personally think she is, but if I had to say something about her it would be....... mm.... I don't know really, If you're too advanced in Japanese, you might find the class a bit boring or slow, but her comments are always funny. In all honesty, I highly recommend her, and especially to those students who have never been exposed to formal lessons on japanese :) Go for it!\nWorkload:\nSame as all the other classes I guess. If you work hard and participate in class, Matsui-sensei will notice and will forgive you once or twice if you ever forget the homework :)\n"
        },
        {
            "course_name": "First Year Japanese II",
            "review_date": "September 26, 2012",
            "review_content": "\nMatsui-sensei is simply fucking fantastic. She explains lessons well without the intimidating, expectant stare as the whole class waits in silence for you to spit out that verb conjugation. Also, she always makes sure to repeat important information in English so that you won't misunderstand grammar rules, homework directions, etc.\nClass starts off reviewing the previous day's lesson with some partner practice. Then Matsui-sensei lectures on the new lesson and some more partner practice ending with her quizzing each person, just remember a half-decent sentence you said to your partner and you'll be fine. Class ends with a quick review of tomorrow's assignments and then the vocab quiz. Oh and everything and done with the help of a Powerpoint, for all you visual learners.\nIn short, I wish she taught every year of Japanese so I can have her again and again.\nWorkload:\nTests every 2 chapters, 2 midterms + oral, 1 final + oral. Daily vocab quizzes and one homework assignment each night. Same as every other first year Japanese class.\n"
        }
    ]
}