{
    "prof_info": [
        {
            "prof_name": "Rebecca Fitle",
            "prof_id": 9448,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 31, 2011",
            "review_content": "\nRebecca is a GREAT teacher, although it seems like she is still experimenting what's the best way to teach an art hum section. But give her a break! She's a grad student--and a good one too. She is not only extremely knowledgeable but also very amiable. I am so grateful that I had Rebecca as my Art Hum teacher, because I had neither knowledge nor interest in art before I had her but now I actually know/like art! \nThe way she teaches is as follows. She prepares powerpoint presentations for every class, which were neatly done. She frequently refers to outside sources such as clips on youtube, the MoMA website, etc. Not only is this fun, but it also allows us to actually see and think for ourselves rather than to just look at some paintings and memorize some dry info. \nIf you see yourself registered for her section, you should be glad and NOT switch out. Just make sure you go to class. Sometimes it's boring--of course, its a friggin core class--but you do learn a lot. And make sure you show at least some effort to participate. It can be BS, but she'll take into account how you're trying a lot. For me, I missed only one class, went to all the museum visits (just 2--to MoMA and to the Met), spoke a few times every session, didn't take notes AT ALL (She explains well enough), and still ended up with an A. \nWorkload:\nManageable readings (not necessary to read all), Midterm, Final, One group (3-4 ppl) presentation, 4-6 pg paper, and a Final Project (6-8? pgs paper, a separate \"bibliography\", and a short powerpoint). Sounds like a lot, but it's really not.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 15, 2011",
            "review_content": "\nProfessor Fitle is a very nice person who genuinely likes art and wants to impart that knowledge to her students.  However, she spends way too much time on some artists and completely skips over others.  She teaches this course like an art history class - learn about technique, subject matter, for tests memorize artist/title/medium/date/description.  She does not have a lot of control over her students.  I was in a class with a lot of know-it-all art history and architecture majors that insisted on interrupting each other and the teacher constantly to impart their \"invaluable\" knowledge.  I did not come away from the class with a new way to look at art and go, \"ooh, now I can sense this differently than before\" or \"I now know how to properly look at art.\"  So too bad for that.  However, I did learn a lot about some very famous and/or important art movements and pieces.  On a recent trip to the National Gallery, I was able to sound intelligent as I told my friends about various pieces.\nThis class takes several trips to famous art museums.  The teaching section of the trip is okay, but real treasure is walking around in the museums afterwards. You've already made the big trip to the east side and now, you get to spend time in the Met or the MoMA or wherever you are.  It's amazing to see all of this work up close and in real life.  \nWorkload:\nSeveral short papers, a few homework assignments, LOTS of reading.  The tests aren't bad only if you memorize artist/title/medium/date/importance of piece.  If you don't prepare, you won't do well at all.\n"
        }
    ]
}