{
    "prof_info": [
        {
            "prof_name": "Carol Prives",
            "prof_id": 3030,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Molecular Biology",
            "review_date": "November 28, 2006",
            "review_content": "\nThis was her first year teaching molecular bio, so I will give her some leeway for that. And surely, Prives knows her stuff as a researcher.  However, she did not do a very good job of explaining the material on her slides.  Actually, it's not quite accurate to call them her slides, since she just re-used Carol Lin's slides (the prof who used to teach mol. bio) for most of the course.  Since they were not her slides, she sometimes did not know the significance of one slide or another, and when they'd come up, she'd look confused and then just move on. In general, she didn't do a very great job of explaining the more complicated concepts.\nThe big upshot was the textbook.  Which was awesome, and extremely straightforward and clear (which Prives was not).  I studied the book for hours, and then referenced it with her notes, and only then understood what she was trying to say in lecture.\nI think our TA made our tests, and it wasn't very difficult, as long as you read the book and understood it.  If you tried to study from class notes alone, you might be a bit lost.\nWorkload:\nminimal.  Optional problem sets (not very helpful).  A midterm and a final.\n"
        },
        {
            "course_name": "Molecular Biology",
            "review_date": "November 13, 2006",
            "review_content": "\nCarol Prives is without a single doubt, one of the worst, unimpassioned teachers that this University employs.  Her hour and 15 minutes of slow droning lecture seemed to last forever and often made me regret being alive.  I as most students in the class found our only solace in the exceptionally deep sleep that her badly organized and uninspired lectures put us into.  I'm not even sure that the woman even knows what half of the things covered in her course are.  Most questions during lectures were met with \"umm, I don't know\", or \"i'm not sure about that, i'll have to check,\" and were never followed up.  The material is not otherwise so uninteresting, but there was no clear overall structure to the course and the facts that we needed to study were often random.  Her powerpoint lectures were clearly not made by her, and the slides were often filled with errors where she did make an effort to change them.  Professor Prives seems to want nothing more than to not have to teach at all, and perhaps this would be better for us all.  Her half of the course is followed by Manley's, whose is marginally better.  He is a terrible lecturer in his own right, but at least he knows what he is talking about and has an idea of what the word \"organization\" means.  Exams mainly asked for explanitory definitons and rarely for any kind of analytical thinking.  Prives really solidified an idea in me that upper level Biology at Columbia strips the fun and critical thinking that Biology is supposed to be about.  \nDo not take this course.\nWorkload:\ntwo midterms and a final...\n"
        }
    ]
}