{
    "prof_info": [
        {
            "prof_name": "Gareth Williams",
            "prof_id": 780,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Latin Elegy",
            "review_date": "November 18, 2014",
            "review_content": "\nProfessor Williams is truly brilliant! He is always exceptionally well-prepared for class and takes class very seriously. In this class we read Catullus, Propertius, Tibullus, and lots of Ovid. Williams' definitely prefers Ovid out of all of these authors, but spent quite a bit of time on all of them, except Tibullus. We actually ended up reading far less than was on the syllabus, and therefore spent a lot of time on each poet and poem. \nWilliams truly has a gift when it comes to the Latin language and that is evident as he teaches the course. He will periodically ask students grammatical questions, but never puts anyone on the spot. Nor does he take attendance, but why would you ever not want to go? \nWilliams' grading can be a little difficult when it comes to translation, but that really only improves your Latin. I came away with a keen understanding of Latin Elegy, and especially the works of Ovid and Propertius, the latter whom I have come to love.\nWorkload:\nThere was a take home midterm, a final, and a final paper. While they weren't easy per se, they were fun to write and really engaged your mind. The reading is fairly minimal, not usually topping 100 lines per class!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 27, 2010",
            "review_content": "\nI LOVED Professor Williams. Although I only had 8 teachers 1st year, Professor Williams was my favorite Teacher by far and will probably remain one of my most favorite teachers (he even trumps my few amazing high school teachers).\nProfessor Williams has been teaching for how many years? (i know 15+ at least.. i think?) so obviously he's read the texts many times and has a clear and firm grasp on all possible aspects of the reading. He provides great insight and maintains a clear direction while teaching class, but he's also entirely open to students' own points of views. He encourages the class to dicuss views other than his own as well. \nUnlike my first semester teacher, who was an absolute nightmare that made you feel afraid of participating, Professor Williams was genuinely kind and encouraging. He made even the quiet people in my class speak on a somewhat regular basis. In my 1st semester's teacher's class, I was constantly sneakily looking at the clock (since i was scared he would catch me looking at the clock).. but in professor Williams' class I probably looked at the clock once a lesson and was shocked when there was only 10 minutes of class left since the class was so engaging.\nNow, instead of heaping the due praise Williams deserves, I'll mention other points.\nHe's NEVER gotten angry at anyone. He understands other college activities, classes, and commitments, getting sick, etc. I came in late once 15 minutes because I was delayed at another class/speaking to prof after class and after class I apologized but he just said to me \"you've always been on time, so don't worry about it.\" He DOES take note of who comes to class and whatnot, but he won't get mad at people for being late (and very rarely do people come late over 3-5 minutes to class because we all respect him).\nHe doesn't even get mad when people are CLEARLY not paying attention. THis one time, one of the kids who sat next to williams fell asleep and started snoring REALLY LOUDLY. Gareth didn't even pause his lecture and ignored it. He didn't even get mad nor treat the kid meanly at the next lesson. Also, when he calls on some people and they go \"huh? errr....\" because they weren't paying attention, he makes a joke like \"not enough sleep last night?\" and moves on to call someone else.\nWhat I loved most about Professor Williams was probably his British accent haha. And his British humor and lack of \"up to date\" terminology. He calls the computer \"the magic box.\" Sometimes his British humor is a bit dry but since he's so charming it's funny nonetheless and puts you at ease.\nProfessor Williams also is VERY flexible about moving essay deadlines and midterm deadlines. Our midterm was originally before spring, but a kid in our class wrote on the board \"PLEASE MOVE THE MIDTERM\" and it was really funny because while he was writing it professor williams walked into class and was like \"ahh... so you don't want the midterm before spring break?\" and the kid was embarrassed but williams was really nice about it and he let us vote on it... and the class voted to have it after spring break.\nSame thing with essay deadlines. He moved one of our essays from being due on wednesday at class to Friday at 5 pm.\nAnd on another essay.... which was due in class on wednesday..... we also had to read like 200 pages of Montaigne by wednesday so obvoiusly nobody read the book and he called on random people since it was the first time nobody volunteered and no-one read the book so it was very awkward and embarrassing...and everyone was falling asleep from pulling all nighters. Probably a good 4-7 / 22 kids were falling asleep/asleep and he was like \"none of you got sleep last night? oh wait.. you were all busy writing the essay since you put it off until the last moment.\" and then he told us \"well, I'm assuming none of you read it then? haha\" and then he told us we'd just go over the book... kind of summarizing it. Not mad at all, just amused. \nWonderful man and prepares you VERY well for the final (since he's the chair of lit hum and decides ultimately what goes on the final). \nWorkload:\nVery light. No pop quizzes or anything. Just do your standard lit hum reading and 2 essays. he grades leniently on essays... the class average is usually a high B to low B+ range. The first essay he only gives out 2-3 A's but then on the 2nd a lot more since he wants you to be motivated to improve your writing. THe midterm was VERY straightforward. ALL passage ID's were obvious AND we'd either discussed it in class or read through the pages they were on. Thus if you want to get 10/10 on passage Id's, just take copious notes on passages we discuss and write down page numbers of the pages we read in class (ie: we might read pages 102-105 and then discuss... and on the midterm a passage from pgae 103 will be on it).\n\n"
        },
        {
            "course_name": "Latin Prose Composition, Latin Literature of the Empire, Classics Major Seminar",
            "review_date": "January 22, 2006",
            "review_content": "\nI LOVE this man.  His passion for Latin literature and Roman culture is infectious.  He genuinely respects the opinions of his students insofar as critical analysis of literature is concerned, though he can be a stickler for traditional grammar rules.  Gareth is incredibly accommodating, if only a little absent-minded - which can be understood given that he is the chair of the department, involved in his own research, and teaching at least one undergraduate course a semester.  I'll give a brief outline of my review of the three classes I've taken with Prof. Williams...\nProse Comp: Difficult.  I'm sure it would be tough with any professor, given the nature of the course, but Gareth demands perfection.  We used an out-of-print text, as well, which was rather old-fashioned and, at times, confusing.  Prof. Williams requires class participation and often calls on students randomly, which can be intimidating when you're an undergraduate in a course with graduate students.  Even so, you leave the course with a sense of accomplishment and a much deeper understanding of the language.\nLatin Lit of the Empire:  Ehhhh, no one really likes the survey.  There's a ton of reading/translation for which you are responsible on a weekly basis and a quiz every session.  You're not supposed to know what to expect on the quizzes...  But Prof. Williams becomes predictable, and you will find that you only really need to know the first 150 lines or so of whatever assignment you have.  The one time he tried to quiz us on a passage from the interior of the text we looked at him blankly until he went and photocopied another segment, though he did express his disapproval.  No midterm, but a paper is due halfway through the semester.  Prof. Williams is primarily concerned with discussion, though he tends to focus on his areas of expertise more than anything else.  You'll get to know Stoicism VERY well.\nClassics Major Seminar:  Hmm.  The topic of this course changes year to year, based on the preferences of the instructor.  Initially Prof. Williams was going to focus on luxury in the ancient world, but decided over the summer to focus instead on ancient perspectives of nature.  Not quite as interesting, though I ended up much more pleased with the course than I expected to be.  You get to read a variety of authors and genres, and Prof. Williams was very sensitive to the fact that students in this class are primarily seniors and laden with work.  Consequently, the reading isn't too long or intense and the only graded assignment is a 20-page paper (topic of your choosing) due on the last day of exams.\nWorkload:\nOverall, Professor Williams is very flexible and willing to negotiate courseload, even on an individual basis.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 10, 2005",
            "review_content": "\nProf. Williams is this gentle and soft spoken british man who is extremely  caring and leniant. He is very accomodating to the class's needs and realizes the reality that no one really reads at all. He is a pretty easy professor to take if you don't want to do much work and want to get the basics of lit hum. \nIf you really want to get something out of the Lit Hum class, dont take this prof. He doesnt really go in-depth into the philosophy/theology/history etc. We basically would mention the obvious observations and make obvious analyzations of the texts. Truthfully, I dont feel enlightened at all from this class (perhaps because I read many of the books previously). Students in the class would often say the stuppidest things and make the most obvious dumbest comments and prof. Williams would say \"yes, very good, ok\". So basically he is really nice but doesnt offer a very enlightening class.\nWorkload:\nthree papers (the third was optional) each worth 10% (or 15% if did only two). The first was 2-4 or so pages the other was 5-7. A fairly easy mid-term and a fairly-easy final (department-wide final). Tons of reading (which he never really checked in any way so most people didn't read at all)\n"
        },
        {
            "course_name": "Latin Elegy",
            "review_date": "January 15, 2002",
            "review_content": "\nGareth Williams is a truly brilliant man. His connection with the literature is deeply personal. He analyzes the text with great care and reveals layer after layer of complexity that is present within the text. His speeches in classes are awe-inspiring and his voice is great. He's got this great soothing British accent -- that is also great to make fun of. PROPS TO HE WHO MADE THAT 5 MINUTE IMPERSONATION OF PROF WILLIAMS! His class focuses on the beauty of the Latin and how this beauty brings out universal themes of human complexity and man's struggle to define himself and his condition in a world where uncertainty may be the only definite entity. Williams expresses these themes powerfully to his students -- with conviction as well as with rational analysis. He is funny and very understanding as well. This man surpasses the title of scholar. He does it all not for the love of scholarship (as so many Columbia professors do) but for the love of knowledge. He is a great teacher and man who lives and breathes this literature.\nWorkload:\n80-100 lines/week with careful analysis. 3 essays and one hell of an easy final.\n"
        },
        {
            "course_name": "Latin Literature: Prose",
            "review_date": "December 18, 2001",
            "review_content": "\nProfessor Williams is a brilliant man. He is possibly one of the few people in the world that may be called a \"Latin scholar.\" This guy knows Latin as if it were his first language. He also speaks with a very cool British accent. An internationally known expert on Ovid, Williams called for parts of Cicero's \"Pro Caelio\" speech and parts of Apuleius' \"Cupid & Psyche.\" He emphasizes grammar heavily, with weekly quizzes to check that you have an absolute mastery of the logic needed to translate such difficult works (ESPECIALLY the Cicero!). Beware, however, that the Cicero will scare you off at first. Keep at it and devote quality time to its translation and you will be amazed at your increase in Latin prowess. Williams is a very understanding man, but also expects that you spend time with the assigned Latin. Class was filled with undergraduate and graduate students as well as an MD.\nWorkload:\nTranslations for each class (not checked but you should do them in case you are called on in class), weekly quizzes (alternating between oral and written), final exam (quite straightforward).\n"
        },
        {
            "course_name": "Latin Elegy",
            "review_date": "November 26, 2001",
            "review_content": "\nProfessor Williams is an extraordinary professor, a man who cares tremendously for the Latin and for his students. He bears a deep respect for literature (references ranging from Homer to Wilde abound) which shines through in almost every class. While the reading assignments can prove a bit daunting, it is in class that Williams draws all the strands together into a comprehensive and insightful understanding of the text. Generally, his views about the literature are firm and well-grounded, shaped over years of study. Indeed, he does not assign a work without a plan to entwine it within the larger themes he sets forth. At times, the momentum with which he presents these themes can be daunting, and may deter students from participation, particularly from disagreement. Don't be deterred. If you've thought through your point, he will almost always entertain discussion (particularly in your papers). In some respects, Williams defines and defies changes in modern academia. He has a personal, almost religious respect for the Latin canon, and is known to disagree with students, saying, \"Not my Horace.\" At times, he refers to the poetry as \"dead serious.\" But in spite of his love of classics and tradition, Williams is somehow capable of recognizing his own idiosyncrasies and the near absurdity of hyper-serious academia. At one point, Professor Williams allowed a student to do a five minute impression of him during class, an impression that was full of light parody and mockery. This, of course, included Williams' rather bizarre Welsh-British-Cambridge accent, and all the catch phrases. The professor smiled away. When a student drew an analogy to Austin Powers, Williams responded, \"Austin Who? Is that someone on the TelyVision?\" Of course, he knew perfectly well who Austin Powers was. But Williams had enough wit and enough confidence to caricature his most serious self. His ability to poke fun at his own persona is strikingly rare among Columbia professors. A course with Professor Williams can be the highlight of a semester, particularly for students willing to set aside their cynicism for a couple hours a week and embrace the literature. It sounds absurd, but Gareth Williams is truly one of Columbia's gems.\nWorkload:\nWorkload is reasonably demanding, especially for 3rd year Latin students: Approximately 50 lines per class. Don't worry about his habit of assigning 100 lines or more. You'll never get through them in a class meeting. Still, it's manageable, and Williams is happy to talk if you have trouble. 3 Papers of 3, 5 and 6 pages. None terribly difficult. No Midterm. A comprehensive Final.\n"
        }
    ]
}