{
    "prof_info": [
        {
            "prof_name": "Robin Thomas",
            "prof_id": 1377,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 01, 2003",
            "review_content": "\nYou are very lucky if you land this professor.  There are no required readings in this class, because he does not want to overwhelm his students. Art is a visual exercise and Robin understands its intrinsic value, so he does not assign any readings, only recommends them. The workload is fair and the tests are pretty standard. I highly recommend this professor for he has made a topic so subjective as art, a unique and individual experience. \nWorkload:\nFour papers each 3-4 pages long. Standard midterm and final; 10 ids, 2 open-ended  questions and a short essay.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 16, 2003",
            "review_content": "\nRobin made Art Hum a genuinely rewarding experience because he knows how to challenge students without overwhelming them.  He encourages active participation in class and requires very close analysis of works for essays, but if you attend class and pay attention the written assignments and tests should prove quite manageable.  Besides, Robin's easygoing, discussion-oriented teaching style will make you want to attend just for the sake of studying interesting material from a very knowledgeable and talented instructor.  His only shortcoming is that his feedback on essays is sometimes too pithy and vague, so go to his office hours at least once to discuss your work in detail.\nWorkload:\nPretty minimal.  Short readings for every class, four 3-4 page papers, midterm, final.  Students may write on their choice of several topics for all but the first paper; each topic has its own due date, so working the assignments into your schedule is easy.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 23, 2002",
            "review_content": "\nHere's to you if you get this guy. There are a lot of nightmare Art Hum teachers out there, but this is not one of them. He has a slight, Southern sense of humor and a kind nature that is conducive to a 9am class. His lectures are always productive and his papers always clearly graded with comments. Our first class began with a thoughtful analysis of vodka ads, which was a fun and canny ice breaker. All and all, if you can figure out which section this guy's in, go for it. Otherwise email him before you register.\nWorkload:\n4 Papers about 3-4 pages each. Midterm and Final. Pretty standard Art Hum syllabus.\n"
        }
    ]
}