{
    "prof_info": [
        {
            "prof_name": "Hlonipha Mokoena",
            "prof_id": 3707,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "African Civilization",
            "review_date": "March 11, 2014",
            "review_content": "\nThis is a cautionary tale which is utterly different from what you are going to see downstairs.\nYou CANNOT step on instructor Mokoena's toes, this woman got a pinched nerve.\nTranslation--she is extremely sensitive about any racial commentaries(She is a black woman from South Africa), even though she is teaching African Civilizations. If in any way that she thinks you might have any bias or prejudice against blacks, then you are doomed. She will fail you regardless how good you think your essays are and how hard you worked on your papers.\nDespite the fact she gives a lot of As in her class, she also failed a legion of students in the past for the above reasons. She even got threats from former students. This is not what I said. All the information in this review is what she said in class herself.\nSo be warned if you are not black. \nWorkload:\nHeavy Workload\n"
        },
        {
            "course_name": "Africa and the Anthropologist",
            "review_date": "November 18, 2013",
            "review_content": "\nI took Africa and the Anthropologist last spring to help fulfill my Global Core requirement. I'll preface everything by saying Professor Mokoena is a very nice, approachable lady. At a school where so many profs are so self-absorbed and inaccessible, Professor Mokoena was a refreshing personality. \nActual Work (Literature Reviews): We had three \"literature reviews\" over the course of the semester, spaced about a month apart, maybe less. Of the 6-10 readings assigned over each unit, we had to write a literature review that included two of them. She said there was no suggested structure or form to these reviews and provided no examples of such a review. I essentially ended up finding a few common threads two or three of the readings, and piecing them together (BS'-ing) to show how they revealed some underlying reality/attitude/perception of the time. Professor Mokoena has a very interesting grading system; on a 100 point scale, anything above a 75 is some type of A, 70-74 ome type of B, 0-69 some type of C, and anything below either a D/F. I believe the average grade on these literature reviews varied greatly from TA to TA, but was around a B to B+ course-wide. I got some type of A on all the reviews, but I saw no correspondence between how good I thought my paper to be and the grade I received. That is, I received my lowest grade on what I believed to be my best paper and my highest grade on what I believed to be my worst. \nLecture: Basically Mokoena presenting the main themes and context of each reading. Really boring. By the third week or so, only 15-20 people in our class of ~100 students were still attending lecture. This made Mokoena send out an email notice stating that she would begin taking attendance in lecture, and that each unexcused absence would result in a full letter grade decrease of our final grade. So, everyone started attending lectures again but nobody paid attention.\nDiscussion: Once a week. Anschaire, my TA, was pretty good. Really tried to get everyone to participate. If we were losing sight of what he thought to be the central points of the readings, he might do a little lesson of his own. Can't say those were very helpful, though... Accessible to discuss papers. \nOverall: This course was an easy A in my view. Well more than half the class got some type of A, and I only worked hard for this class for a few days when writing the literature review and final paper. However, I can't say I know anything more about the discipline of anthropology than before the course. Part of this is admittedly my failure to do most of the readings, but I also attribute a lot of it to the overall lack of direction and clarity in the course. \nWorkload:\n3 literature reviews (6-8 pages): 20% each\n1 final paper (10-15 pages): 40 %\n\n"
        },
        {
            "course_name": "Rewriting Modernity",
            "review_date": "December 10, 2010",
            "review_content": "\nProf. Mokoena is AMAZING! Our seminar became very tight knit by the end of the year and I think we all thoroughly enjoyed every minute of the class - even though it was most of our last Thursday class before the weekend. \nAbout the class - although the name is Rewriting Modernity, Prof. Mokoena makes it clear on the first day that it is a class on South Africa. Even if this isn't a place you were particularly interested in learning about (I knew almost nothing about the country), consider taking this class because it's a very dynamic country, you will not get bored, and you will learn so much. Plus, Prof. Mokoena creates a comprehensive reading list that hits a lot of topics - from scientific racism to black identity formation - and she has a whole lot to say on each subject. \nBut really, take the class because of the professor. She is INCREDIBLY intelligent (daunting at times), but also very down to earth and genuinely funny. Her tangents - which happened just frequently enough to break up any monotony but always got back to her main points - were very insightful (and often hilarious), and she will make you seriously consider studying in South Africa if you haven't already. She's also good at getting everyone involved in the discussion, and she's refreshing because she hasn't spent as much time 'inside the Columbia bubble' as most professors have. \nIn sum, Mokoena is truly a Columbia GEM! I will take absolutely every class she offers in the future. \nWorkload:\nOne book/week. Often can be long (Mokoena likes to read whole books because she wants you to get the author's voice), but none are uninteresting and all teach you a lot. They also range from history books to political speeches to ethnographies to short novels. That said, it is a reading-heavy class and since she tends to cap it at 12 students, don't take the class if you don't plan on actively participating in almost every discussion. \nEach student makes one in-class presentation on one of the books (in conjunction with a 10-15 pg. paper), and there is a final 20-30 pg. paper worth 70% of your grade. That said, she is not a harsh grader and she leaves a lot of comments. She is also very good at helping you find sources for your final paper, etc. \n"
        },
        {
            "course_name": "African Civilization",
            "review_date": "December 13, 2009",
            "review_content": "\nI got an A in this class (I average an A-) so I am probably biased, but this was one of my favorite classes this semester. She is a really smart lady. Just google her and tons of interviews will pop up. That being said, she is not pompous at all. She actually loves to laugh and is one of the nicest teachers I've had at Columbia. She runs the class very informally. She will show up 5 minutes late, and expect you to do the same. \nThe class is run like CC. The discussions tend to be very lively and at the least, very entertaining. There is about 10-20 pages of reading each class, and if you have even a marginal interest in Africa, these will be some of the most painless readings you have ever done. I really felt like I learned a lot about Africa by taking this class. But, Africa Civ. majors will probably find this class pretty boring and redundant.\nI would highly suggest this class to people trying to get a good grade in a relaxed setting. Visual hour on monday nights does suck, but you can just bring your laptop and rage out on some facebook, online poker, or whatever floats your boat. The guy who teaches visual hour is a librarian and reminds of Treebeard with how he talks. I would highly suggest ignoring him and distracting yourself with the conveniences of a laptop. Especially because none of what he says is in anyway relevant to the paper topics you will probably choose. \nWorkload:\nThree 4-6 page papers on topics of your choice. Take home final that should be 8-10 pages. There is no reason people should not get at least a B+. Attendance is very necessary.\n"
        }
    ]
}