{
    "prof_info": [
        {
            "prof_name": "Pamela Cobrin",
            "prof_id": 2177,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "The Writer's Process",
            "review_date": "December 31, 2008",
            "review_content": "\nwhile i find it kind of funny writing a review for this class, and you have no choice but to take this class to become a fellow, i thought i might as well anyway.\nthere were parts of this whole experience that i loved, and parts that i did not really enjoy. i loved the practical aspects of the course, which go along with training and meeting with first-year students. i loved learning techniques on how to properly look at the paper. i can honestly say that this class was so important to me, as i have greatly changed as a writer (for the better!) and i understand myself more as a student now than before. the whole experience was so positive for me. pam is also such an amazing instructor who really cares about her students; this is evident in her dedication to the center, as well as her presence in class and in conferences. i don't think i have ever had a teacher so engaged in my writing, especially since the essays were so short.\nbut there were aspects of the class that were not as wonderful. personally, i found some of the readings a little boring, because i am not that passionate about the philosophy of teaching and learning. another thing about the whole process that i did not know coming into the job of fellowing: this class, while three credits, asks for work that is more like a 4 or 5 credit class. there is a lot of practical \"training\" that we as writing fellows in training were not compensated for.\nWorkload:\nshort, yet sometimes boring, articles: about 4-5 a week; three essays, which rewrites, journals, and LOTS of outside training (working with first years).\n"
        },
        {
            "course_name": "Black Theater, Writer's process",
            "review_date": "April 06, 2007",
            "review_content": "\nIf there is one word to describe Pam (sorry, i can't call her Professor Cobrin but you can feel free, she's cool with either) it is PRESENT.  When she is teaching a class she is right there with you, and she sort of embodies that idea most teachers say but don't really think, \"I learn as much from my students as they do from me.\"  The greatest thing about Pam  is that the woman knows how to lead a discussion--a rare talent for professors, and a very important one for English/Theater instructors.  She also is not afraid to do a little house-keeping-meta-discussion if there is something going on within the class that is creating tension or any sort of problem, which is really special for a prof to be able to do.  She is so engaged with her students and the material, and just really down-to-earth and no nonsense.  She's flexible and doesn't assign too much reading, is totally accessible outside of class and just...rocks. \nWorkload:\nvery reasonable reading in general, midterm and final papers, working with writing fellows.\n"
        },
        {
            "course_name": "Black Theater",
            "review_date": "November 18, 2005",
            "review_content": "\nShe is extremely dedicated to what she teaches. Shes totally unpretentious and focused on her students participating and challenging themselves to contribute to the knowledge in the field. Shes EXTREMELY accessible and dedicated to the classes, I mean a family member was sick and still she came to class. The material was very engaging and so were the classes. Highly recommended. \n\nWorkload:\nTotally fair. Two papers, reading every week with responses. Two performances.\n"
        },
        {
            "course_name": "Women and Theatre",
            "review_date": "May 09, 2005",
            "review_content": "\nThis class should be renamed \"feminism, feminism, and more feminism.\" We read a number of interesting plays by female playwrights and (a lot!) of feminist theory, which wouldn't have been so terrible if Pam allowed for some discussion other than the feminist perspective. We did virtually no close readings of the plays and only really talked about them as they pertained to the theory or as evidence of \"strong women.\" This is the cliche Barnard feminist class (and that's coming from a Barnard student). The class tends to attract mostly self-avowed feminists, so discussion was pretty one-sided, and Pam didn't do much to foster dialogue between opposing viewpoints. That being said, if you love feminist readings then this course is definitely for you. \nWorkload:\nAbout one play, two or three theoretical articles per week. Relatively light, and you don't have to do it all. Weekly response papers based on the readings. One midterm research paper (8-10 pages) and one final research paper (10-12 pages). Meetings with a writing fellow for each paper after submitting the rough draft.\n"
        },
        {
            "course_name": "The Writer's Process",
            "review_date": "December 29, 2004",
            "review_content": "\nThis was easily my favorite class of the semester. The readings get progressively longer as the semester goes on, but I actually looked forward to reading them because, whether I enjoyed the readings or not, the class discussions on them were awesomely interesting and engaging. This is due the way Pam structures the class--- she allows us to really own the class and what we get out of it, and I learned much more in this class than any I have taken so far. The classroom atmosphere is one of openness and respect, and Pam takes everyone seriously and is great at guiding discussion and responding thoughtfully and intelligently to our comments. She also puts SO much effort into conferencing with us and reading our papers; I am very impressed. I am done gushing, but I will just finish by saying that this class is fantastic.\nWorkload:\nI agree with the previous review: there is a good deal of work (3 papers with multiple conferences on each and around 2 hours of reading a week), but it doesn't really feel like it because I found that I LIKED the work... only in retrospect did I realize that I put a lot of time into it, but I don't regret any of it.\n"
        },
        {
            "course_name": "The Writer's Process",
            "review_date": "October 11, 2004",
            "review_content": "\nIt's difficult to review Prof. Cobrin in the context of this class, which is designed to train future Writing Fellows. I mean, we call her Pam and eat soy chips as we discuss the theory collabrative learning and how to teach ESL students...that being said, she is absolutely a human being, and is quite amicable and approachable. The material isn't really my thing, but the class is relaxed and dicussions are interesting. I genuinely look foreword to going twice a week. \nWorkload:\nA lot of reading and writing, but you can skim most of the readings for class and all of the essays are personal narrative, which to me is a lot easier. Also, you are attached to a class and have 5 students to meet with twice each, plus you have to put in an hour a week at the writing center...all in all it is a lot of work, but I promise you will only realize it in retrospect. \n"
        }
    ]
}