{
    "prof_info": [
        {
            "prof_name": "Michael Meere",
            "prof_id": 10608,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French I",
            "review_date": "October 25, 2010",
            "review_content": "\nHe is the best french professor you could ever ask for. He is a very fair grader. He doesn't make the test because they are made by the department, but they are not out of the ordinary. He uses clips, songs, poems, and games for the students to grasp the language. He's a stickler when it comes to language and that helps so much. In class we partner up and do worksheets pertaining to vocab and grammar. The class is small so he knows all of our names. He is also really easy to reach; he responds to emails quickly. If you can't make it to his office hours, he will find some way to meet with you. If you can, you should definitely sign up for his section. I usually hate french class, but he make learning enjoyable which is very refreshing. \nWorkload:\nWe usually have quia exercises online. They are a pain but are generally can be completed for the week in one sitting. We have a composition do every other week and a test on 2 chapters the weeks we don't have compositions due. \n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "September 02, 2010",
            "review_content": "\nConfession: Professor Meere was so good I didn't want to write this review until after I had secured a spot in his Intermediate I class. I took this class over the summer so it was quite intense, but it was an excellent way to finish Elementary I and II in less than three months. Not recommended for the faint of heart, especially if you're taking other summer classes as well.\nProfessor Meere is also not recommended for the faint of heart, but in a good way. He was meticulously organized (refreshing) and provided chapter quizzes that don't count, but provide helpful feedback before the tests. I didn't realize how helpful this was until my Elementary II teacher (who was also awesome) didn't do this.\nHe brings in lots of interesting exercises, music, and film clips. He was a stickler for pronunciation, which is all kinds of helpful. He is not a hand holder and the class can be a bit scary at times, but he is very responsive and patient if you ask for help. He is a challenging teacher, but will leave you very well prepared for whatever's next.\n\nWorkload:\nI took this as a 6-week summer class, along with a reading-and-paper heavy other class. The phrase \"Dear God, make it stop\" comes to mind. But in truth, the assignments were interesting and satisfying since I was excited to start learning French. Very straightforward, if voluminous.\n"
        }
    ]
}