{
    "prof_info": [
        {
            "prof_name": "Milan Mincek",
            "prof_id": 3109,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "April 24, 2012",
            "review_content": "\nAlex (he goes by Alex) is definitely one of the best instructors I've had here. I can say with certainty that my appreciation for music, music history, music theory, philosophy in general, etc. has been changed for the better. He's one of those instructors that makes learning fun (I know that sounds cliche, but it's true) and I will take the lessons I've received from this class with me for as long as I have music to listen to. Definitely deserves a silver nugget at least; I'd give him gold. \nQuite nonconventional style very well executed. No handouts and hardly any work out of class (2 readings all semester), but it makes for an even more engaging learning experience with a focus on experiencing the music and discussing it at the same time. Again, his style isn't conventional. After missing class once, I was told to get notes from a classmate because he didn't know what he had covered that day. He told me he has a notebook full of the things he wants to cover, but it's in no particular order and there's so much that it's hard for him to know exactly what he actually got to. This sounds a bit disorganized, but it doesn't feel that way at all; the course always feels like it's moving with clear and organized direction. Participation is encouraged, but I don't think anyone ever feels pressured to chime on, nor do I think we're penalized for keeping quiet. That said, the class is engaging enough that you'll want to participate and ask questions.\nHis class would probably be considered \"easier\" than most, but I've learned a great deal without ever feeling like I'm memorizing or learning it for the sake of the class. Alex makes the class feel like a pursuit outside of just a grade; I can say with certainty that I'm substantially more interested in music, music history, and music theory because of this class. Great Core experience; as a previous reviewer put it, he's one of the few instructors left that really captures the Core experience we're all hoping to have. \nIf you're looking to fulfill your Music Hum requirement (which I suspect we all are), TAKE HIS CLASS. If you're already interested in pursuing music beyond the requirement or know a bunch already, it may be a bit simplistic for you, but I still think you'll have a lot to gain from his funny demeanor and insightful commentary. \nWorkload:\nQuite, quite simple. Midterm was a bit harder than we'd been led to believe, but still quite manageable. Two readings for the ENTIRE SEMESTER, and not even long/difficult ones. One concert report (3ish pages?) and one final (which I haven't taken yet). \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 03, 2011",
            "review_content": "\nAlex is a really good and occasionally pretty hilarious teacher. Having to deal with a student population that ranges from the completely confused to the super-musically-knowledgeable-and-I'm-not-afraid-to-show-it takes some craftiness, and he pulled it off well. At the same time, he managed to generate a lot of interest (and suspense even) in the subject matter and during some classes I found myself wishing that the class was longer so we could go over all the composers/pieces that he listed on the syllabus. Definitely one of the academic highlights of this semester, and it's classes like these that are part of the reason why Columbia's core still retains semblances of legitimacy.\n\nWorkload:\nA midterm, concert report, and a final. Easy.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 07, 2011",
            "review_content": "\nI guess I should get to these things before college ends. \nYeah, Alex is kind of awesome. I've put off taking this requirement for two and a half years now and this is a teacher that definitely highlights the stupidity of that decision. \nDon't get me wrong; the material is what it is. \nI mean, I'll discuss the new Radiohead's mediocrity or Trent Reznor's Social Network soundtrack until I pass out but classical music isn't my thing; it's just not. And no, I haven't been moved to tears by a Sonata, Major/minor recognition is still a best-guess approximation, and I can only list the many ways in which the recitative can suck it, but I've enjoyed this class a lot more than I suspected I would. \nIt's painless, easy to follow, and borderline fun. Participation is encouraged but not mandatory and after a day of interning or back-to-back seminars it's a relief it's nice not to have to try to outshine other students for points by talking (and sidebar: self-awareness goes a long way, folks. If your anecdote has no other purpose than to drop an obscure ballet term only tangentially related to the material, maybe consider saving it for the diary, mm?). \nPlus Alex's kind of hilarious. He very occasionally has this pointed, almost-douchey-but-not-quite way of answering the really super-inane questions that really makes you chuckle. I don't know; I'd grab a beer with him. Maybe it's because all my other teachers are geriatric Powerpoint readers this semester but I really like him. It verges on the man-crush.\nTake it, you won't do better in the blind lottery that is Music Hum.\nWorkload:\nCome to class; take notes, participate....and then mid-term, paper, and final (non-cumulative). Easy as pie. Occasional readings.\nHe's a really easy grader. We got our midterms back this week. I have a working theory that grading starts at 90. It's really the only explanation. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 06, 2009",
            "review_content": "\nAlex Mincek is a fantastic music hum teacher! i came in with almost no music background. he managed to make the subject really interesting and I  learned so much from this class. he is very laid back - he just wants students to become interested in the material. there is more lecture than discussion but most of that was because the students didn't know so much. with a different group of students he would have been happy for more discussion. however, it didn't matter - he is very interesting to listen to as he knows a lot not only about music but other subjects related to the material. \nTake him for an enjoyable core class where you will learn a lot and do well. (Trust me, from my experience doing my core classes, it's worth picking a good teacher for music hum/ahum.) Just take notes, maybe speak once or twice in class, and you'll get an A. the concert reports are not difficult at all and he does a great and comprehensive review for the midterm and final so you know how and what to study. If I haven't said it already - this class was awesome!!!\nWorkload:\nmidterm (1st half semester), final (2nd half semester), 2 concert reports, participation. the midterm and final are easy. the short answer questions are from the notes and any readings he mentions in class as \"important\" (but that was 2 articles in total). he prepares you for the listenings and how to study for them in the review session. the concert reports are just descriptive and thoughtful reflections on what you saw. do not stress about them or any of them or any of the other work. \n\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 17, 2008",
            "review_content": "\nEvery time I casually apply what I learned in this class I remind myself to review Alex. I came in with absolutely no music knowledge--none--and little interest in it to boot, and walked out with a solid foundation and a healthy interest in most everything from beethoven onwards. He's easy going, funny, and understanding (especially towards us music dunces) and yet we learn a hell of lot in a compacted time. It's actually fun to participate in his class. He takes observations that might not seem like much on the surface and explains the mechanics in detail. There were plenty of people in class who came in with abundant music knowledge/experience, and yet it was seamless--not too fast or slow--and we all seemed to have a great time. The concert reports were fun to write, he's very open what it is you want to explore in these assignments. Take this class with Alex, especially if you are apathetic towards music, because he'll change that pretty quickly.\nWorkload:\nreadings, concert reports, class participation\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 20, 2008",
            "review_content": "\nAs the other reviewers have said, Alex (he told us to call him by his first name) is a nice guy and very approachable. He is very laid back and one of the few core professors that I have had that actually want you to learn the material. He creates a relaxed environment where students are encouraged to participate. Alex is very knowledgeable about a variety of topics in music and a good lecturer to boot. In other core classes attendance is taken however Alex not once took attendance. A drawback to this was that he didn't actually learn any of the students' names. \nWorkload:\n2 papers on a musical pieces (one classical and one contemporary), midterm and non-cumulative final. Easy grader. Highly recommended!\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 10, 2007",
            "review_content": "\nHighly recommended. Nice guy--makes sure everyone knows the material. Had insightful things to say. Knows you don't really care that much, so he takes it easy. Has you read good stuff, but doesn't use that piece-of-crap textbook.\nWorkload:\nStandard.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 27, 2006",
            "review_content": "\nEasy and enjoyable class.  Sometimes provocative.  And if you take the class very seriously, you can learn quite a lot from Mincek.  If you don't take it that seriously, well, Mincek is a good guy, very open and accomodating, and by his own admission, he makes the class incredibly easy.  \nYou do need to actually study for the midterm and final exams, or you will be at a loss.  He does a very detailed review, so it won't be hard to do well in this class if you are able to do well in, say, literature or art classes.  \nMincek's specialty is new music, with a generous helping of jazz.  So until you hit Beethoven, the class doesn't really take off.   Once you hit Beethoven, Mincek is able to make the material very accessible.  \nPersonally, I learned a lot and enjoyed the whole thing.  \nWorkload:\nVery little reading, and what is assigned is never tested.  But it would be nearly impossible to pass the class if you don't review all of the listening on your own time before the midterm and final, and that takes time.  \n"
        }
    ]
}