{
    "prof_info": [
        {
            "prof_name": "Idra Novey",
            "prof_id": 10099,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "The World and the American Writer",
            "review_date": "May 08, 2010",
            "review_content": "\nThis creative writing seminar was a new addition this year. The department wanted its creative writing majors to read more literature written by people who do not speak or write in English. In other words, world literature. Even today, only three percent of all books published in the US per year are translated books. In other countries, the percentage of translated books goes up to 40, and sometimes 60. Writers in the US don't seem to reading enough world literature, and the creative writing undergrad department wanted to remedy that.\nUnfortunately, this class was a HUGE MISTAKE. Idra attempted to cover too much material too quickly. We whipped through translated poems, prose poems, flash fiction, fiction, and essays in one semester. Although exposure to the radically different styles was beneficial, our class discussions were mostly shallow and superficial. The discussions often petered out half an hour before class ended, which is just plain sad.\nIf the syllabus focused on one form of writing (for example, short stories), then students would've been able to find common language when discussing the texts. Sadly, this was not the case and discussions were comprised of people talking about their own emotional responses. \nIdra does come off as a person who has vast knowledge about translation and world literature, but she did not share enough of her insights or analyses on the readings. When she did share her opinions, she talked about American rejection of translated works in general terms. \nIn addition, Idra made people read their \"creative responses\" to the assigned readings. The class was then expected to respond to the student readings of their own work with positive comments and constructive criticism. It felt like a very bad, very boring imitation of a workshop. Actually, she did host two workshops that were probably exciting for beginner writers. But seriously? Did the course really need a workshop aspect? No.\nI couldn't get into any other creative writing seminar, so I took this one. I have never disliked a class at Columbia so, so much. It was a waste of my time and money. \nFact: some people couldn't stand the class to such a degree, they came to class DRUNK.\nWorkload:\n.\n"
        },
        {
            "course_name": "Translation",
            "review_date": "March 05, 2010",
            "review_content": "\nI went into the class excited to learn about translation, but frankly, this class has been the most useless writing class I've taken at Columbia. Idra is sweet and vocal, but the class just lacks the depth needed in any introduction to translation studies. We only touch on theories of translation in the first two weeks of class, which was framed in a simplistic way of either being faithful to \"sense\" or \"meaning\" of a text. The readings chosen were not terribly provocative. They were mostly taken from the translator Eliot Weinberger, as if he is the definitive model for any type of translation.\nSad to say, this class makes translation look cheap, parochial and new as a discipline. Idra spends way too much time talking about sending our work out to publishers/journals, because she has had some success in recent years with her translation work/poetry. I walked out of the semester thinking writing is all about getting recognised and paid. Nevertheless, the hands-on part of the class was pretty neat, and we got to workshop our classmates' pieces. If anything should change, this should be listed as a \"workshop,\" and the readings should be more thought-provoking. \nWorkload:\nlight reading, revised translation pieces \n"
        }
    ]
}