{
    "prof_info": [
        {
            "prof_name": "Stuart Raphael",
            "prof_id": 1321,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "August 11, 2006",
            "review_content": "\nI took Stuart's class and I thought it was great. He is really smart, patient and yes a nice guy too, which seems rare around here. The thing is if you are a snoozer or try to bs in class or on papers he won't give you much attention. I was in that class with the annoying jazz guy and everyone wanted to slap him silly. I cannot believe Stuart didn't kick him out. Anyway, I actually learned a lot and somehow was able to impress my parents who are major music freaks. I guess the TA was okay too but I don't remember him much. Bottom line is Stuart did the job and then some.  \nWorkload:\nNot too bad. Maybe a little more than other sections but probably not the heaviest one out there. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 12, 2005",
            "review_content": "\nStuart is a great guy -- heÂ’s super laidback, funny, and he sends witty e-mails.  But if you like a professor who gives clear, concise, well structured lectures.... avoid Stuart.  Another reviewer called StuartÂ’s overall approach Â‘unconventionalÂ’ Â– IÂ’d call it unstructured.  The dec 16th 2004 review is dead-on: class time is full of Â“mindless philosophical conversation tangentially related to music.Â”  This class was full of disconnected topics Â– I found it impossible to pay attention and hard to separate important points from his abstract observations. And although parts of the midterm and final are open-ended essays, a section asks you to recall those super-specific facts which got lost in StuartÂ’s classtime rambling (do your best to take good notes of the detailsÂ– it will pay off on the exams).  There is, as another reviewer said, a lack of consistency between Stuart's teaching style and grading style Â– despite his relaxed demeanor, he really expects a lot in your essays and on tests.  \nThe essays were ok Â– one asks you to analyze any song (your choice).  The other asked us to analyze a specific piece and the concept of the doppelganger.  This was a hard one to write as it wasnÂ’t clear what exactly he expected.  ItÂ’s nice that allows you to concentrate on whatever aspect of the topic interests you most (whether that be the historical context or a piece, or the technical musical aspects).  The massive amount of feedback on the papers is indicative of a truly caring professor.\nA few weeks into the class I had the realization that i really hadnÂ’t learned anything so far in MHum.  I naively assumed that the learning was just so incredibly effortless and painless that I wasnÂ’t consciously aware.  But studying for the midterm made me realize how wrong I was.  Thank god for the book.  Ironically, heÂ’s considering getting rid of the textbook.  Bad choice.\nThe highlight, for me, were the courses taught by the TA (Eric) whose teaching style was the exact opposite of StuartÂ’s.  His presentations made me realize how much I COULD have been learning about music had Stuart not been teaching. Instead, Stuart cut material from the syllabus and blamed it on the shorter music hum class times Â– in my opinion, if we had simply been more efficient with that class time, we would have had no problem finishing the material.  One particularly memorable class was the one Stuart wasted arguing with one particularly belligerent student (a self-claimed jazz expert).  As the rest of the class fell-asleep with boredom, these two battled it out.  In my opinion it seems that instead of teaching in class, Stuart more often used long emails (some as long as 4 pages) to replace class time learning.\nSo if you are a philosophy lover-type, you might really enjoy this class.  If you want to learn about music in a straightforward and clear manner, youÂ’d be better off choosing a different professor.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 04, 2005",
            "review_content": "\nGreat class and even better prof.  Stuart knows the subject very well, doesn't hold back praising his favorite music, and encourages students to do the same.  His overall approach seems pretty unconventional, which is refreshing given what I've heard about how mind numbing music hum can be if you're in another class.  Somehow Stuart managed to jump back and forth between things like Bach, Hannibal Lecter, and theories of madness while making it all come together and make sense.  I think he also likes to mix up the pieces/topics from semester to semester since one of my friends also took the class with him just before I did and studied different things.  We both loved the class, however, and got a lot out of it.  Stuart also has this hilariously dry sense of humor that pops out when you least expect it, which made the class pretty entertaining.  If you can't manage to get into his class try to email him in advance--that's what I did.\nWorkload:\nHe assigns some additional readings unrelated to the textbook and he doesn't like to follow the textbook too strictly.  Fair grader and actually spends time reading your papers.  Final exam was not cumulative.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 04, 2005",
            "review_content": "\nI guess like almost everybody I was worried about taking Music Humanities but this ended up being a great experience. I feel really lucky since Stuart was so supportive and encouraging of somebody like me who is seriously tone deaf. I think he genuinely cares about his students since he is a genuinely caring person. After sending him something on the order of a thousand e-mails I was sure that I was driving him crazy, but he told me not to worry and was always responsive to the questions I had. He has a cheerful disposition in class and I didn't even miss one all semester. I definitely recommend taking Music Humanities with him. He also takes the class out at the end of the semester, which was really fun!\nWorkload:\nOne midterm and final that weren't too bad. Stuart is flexible about how you make your arguments in your essays. There were a few short writing responses besides the essays but they weren't graded. Reading and listening for each class but none of it was overwhelming.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 25, 2004",
            "review_content": "\nI totally disagree with that previous negative review about StuartÂ’s class.  His class was among the best IÂ’ve had at Columbia overall and definitely, hands down, the best one in the core.  And while the grades arenÂ’t in yet, I can even say all this with the knowledge that I probably wonÂ’t be getting an A.  To start with, itÂ’s really unfair to completely blame Stuart for having to cut things from his syllabus.  The word is that Music Hum is doing an experiment this year with shorter class meetings, and just about everyone I know who took Music Hum this semester in other sections said their instructors also had to wipe out a lot of material.  Stuart even said at the beginning of the semester that the syllabus contained much more material than we could have time for.  To fill in some of the holes he would even send out these long e-mails in between classes.  One of them about Schoenberg was like a mini research paper and it got me to appreciate Schoenberg much better than any textbook could.  Stuart always found really creative and insightful ways to teach even the most boring music.  On one of the papers he gave me back some of the best comments that IÂ’ve ever gotten in any class (it was 2 pages long of really useful suggestions).  Sure heÂ’s a bit chatty sometimes; but would you want some robot instructor for your Music Hum requirement?  So hereÂ’s the bottom line: Stuart is an informative and enthusiastic teacher, but if he figures out that youÂ’re not trying very hard in his class, or if you try to BS him, then heÂ’ll turn his attention to someone else that cares and makes the effort.  As for me, I learned a ton in his class and IÂ’d take his section over again in a second.\nWorkload:\nWorkload: 2 exams (the final was not as hard as the midterm), 2 papers and the concert report.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 15, 2004",
            "review_content": "\nI decided to take this class with Stuart because he had received only glowing reviews on Culpa and I was excited to have what I believed to be an enthusiastic and informative teacher. One semester later, I have not only learned very little about music but I feel like a part of my enthusiasm for music in general has died. In class Stuart is very friendly and chatty, and thus ends up wasting upwards of 10 minutes before each class talking about how much we have to do; needless to say, we ended up not covering a good portion of the syllabus. Those topics that we did cover tended to be muddled by A) mindless philosophical conversation tangentially related to music by students uniformed in the details of both philosophy and music and B) a discouraging disclaimer at the beginning of most units on why Stuart didn't like the period. This total absence of class structure and efficiency was worsened by the lack of consistency between Stuart's teaching style and grading style. On a number of occasions, Stuart came to class unwilling to teach and content to instead chat about a topic of our choice, but papers and exams were graded rather harshly. Overall, a negative experience. Not recommended.\nWorkload:\n2 papers (1 10-pager assigned late in the semester because of a failure to cover enough material in class), 1 concert report and two exams.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 10, 2004",
            "review_content": "\nThis was an awesome class and definitely the one to take if you want an outstanding Music Hum experience.  Stuart makes the class interesting and fun at the same time.  As a musician himself, he has extensive knowledge of music theory and a genuine interest in the material.  But what really sets him apart (as another reviewer says) is that he relates music to larger philosophical questions and encourages you to think about music in a broader context.  There is also a great use of film clips to discuss certain pieces.  StuartÂ’s a smart guy and always helpful and available to answer questions.  His tests and assignments can be challenging but if youÂ’re willing to put in some effort this class is amazing.  I was dreading Music Hum but this turned out to be one of the best classes IÂ’ve had at Columbia.  \nWorkload:\nOne 4-5 page paper, one 7-10 page paper, concert report, midterm and final exams.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 21, 2004",
            "review_content": "\nStuart Raphael is one swell guyÂ… You know how most teachers and most TAÂ’s just go through the motions of teaching but donÂ’t really care? You know how you end up leaving for the summer and you canÂ’t remember what you did in the class or if you learned anything? All you do know is that you spent more time watching the clock and hating your time in class then it took for you to hand over the fatty 40 grand to CU. Where is all that money going? Well, it certainly isnÂ’t going to StuartÂ… but it SHOULD! Stuart Raphael is great guy and a great teacher. For anyone who is afraid of music theory and considers the more abstract and philosophical topics as a light aperitif then they should take this class. While Stuart does teach the more technical aspects of music he wonÂ’t turn all Gestapo on you if you canÂ’t repeat his teachings like a little boy in a Saudi Madrasa.  What makes StuartÂ’s class so interesting is how he relates Music Hum to the fundamental questions that create a bridge between every core class. Once one begins to have an understanding of some of the technical aspects of music the class searches to answer the greater questions. What does music mean? What is it trying to tell us? How does it relate to the human psyche? How does it relate to Society? How do we interpret music? Is there one meaning? Who creates the meaning, artist or listener? These questions and more make for a fast moving class that is worth all the big bucks and the 2 hours a week. \nWorkload:\nTwo papers two exams... review sheets given out one week prior... one concert report... my only warning is if you can't be creative and you can't think for yourself... then don't take this class... NO mindless zombies allowed!\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 20, 2003",
            "review_content": "\nStuart is very knowledgeable, cool, and lively.  I was completely nonplussed by classical music before taking this class and he helped me really appreciate it.  The only problem was that we had a lot of other people in the class who were intent on wasting time with administrivia, asking dumb questions, and not understanding simple points (e.g. is a piece minor or major).  Nevertheless, if you want someone who will really take you deeply into music, go with Stuart.  You can joke around with him and have fun at the same time.  He brings in movies and filmed operas.  He also sends out an email update the day before each class telling you what to expect and being funny at once.  I give him an A+.\nWorkload:\nConcert report, like in all sections, but it's not too hard.  One 4-5 page paper on a musical piece of your choice, and one 7-10 page paper on a piece of his choice.  Not too bad though.  Midterm and final which were hard but easily graded.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "July 08, 2003",
            "review_content": "\nStuart, in my opinion, is essentially a graduate student who knows his material, but lacks teaching skills.  His class is run like a TA's study group.  If you treat him as one of the class and your best buddy you will do fine.    An easy class, and he is a pretty easy grade; but he makes each class feel like a life time.  \nWorkload:\nWork load is easy; a Mid-term, a Final and two papers \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 06, 2002",
            "review_content": "\nStuart is excellent, engaging, and understanding. However he could be classified as being almost overly sensitive and intensely into the philosophical grounding of music. With the majority of the focus on 'interpretation', one could possibly get away with bsing yourself through the class. He is not one to spend a lot of time on the technical so if you are rusty, or have little bearing on that -- that is definitely on your own time. Hilariously funny and laid back, stuart is one of the best. Every day, he comes in with a cup of coffee...\" today's going to be on the light side\" or something along that effect. you'll be very lucky to get him....\nWorkload:\nNot taxing: 2 short papers, 1 concert report, midterm/final (with review sheets)\n"
        }
    ]
}