{
    "prof_info": [
        {
            "prof_name": "Phoebus Dhrymes",
            "prof_id": 61,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Econometrics Seminar",
            "review_date": "January 03, 2014",
            "review_content": "\nThese days, it seems Professor Dhrymes only teaches the econometrics seminar, which seems to be his strength.\nGiven the previous reviews, I was expecting the worst when taking this class (which was required for me). However, I was very pleasantly surprised - it ended up being one of my best classes in the economics department.\nThe class is typically very small - usually around five people. He's a soft-spoken man, but has a good sense of humor once you get to know him, which happens quickly in a class of this size.\nHe's rather flexible and amenable when it comes to the final paper. In my case, the paper I proposed writing used techniques slightly different from the ones he taught in class (which is what we were supposed to use), but he gave me permission to write it anyway, because it was still closely related to what we had covered, and because he felt it was better to have us write on topics that we found interesting. He won't treat you like you're in kindergarten like certain other professors in the department do - if you've made it this far, you're an adult, and he'll give you the respect of one.\nThe material may be a bit dry if you're not a fan of math and statistics, but if you're considering taking an econometrics seminar, hopefully that should be what you're looking for. Prof. Drhymes does a very good job of making the techniques relevant to real-world examples, so if you were the type of person who was bored with Intro to Econometrics and Advanced Econometrics, this may be the class you've been waiting years to take.\nWorkload:\nFor a four-point seminar, very manageable. A little bit of reading each week. Each person had to present two papers over the course of the semester (one from the course reader, plus the one that you write). \n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "May 28, 2004",
            "review_content": "\nDhrymes has a wealth of knowledge, but simply cannot deliver the content to his students.  He teaches very poorly, and it should be said that the generalites of the other reviews hold true.  However, I can see this professor appealing to a select few.  Those who prefer/well-versed  in mathematics/statistics will do well (IEOR folks seemed to have an easier time with this particular class.)  Those suited to more abstract, theoretical ideas will also do well in this class.  Dhrymes teaches more from a \"general concept,\" appealing to methods and theories rather than numeric examples.  That said, it is incredibly easy to get lost in his class, but if you are capable in this style, his tests reflect this tendency and may even complement a few students, although from my experience, not many.\nThe TA was the saving grace, and if you do not have a competent one, you might as well drop this course, as there are really no other resources that will make anything easier to understand.  In all, a select few may benefit from Dhrymes' experience and style, but it's not for the majority of students.\nWorkload:\nmidterm, short final.  biweekly problem sets that have absolutely nothing to do with the exams.\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "May 20, 2004",
            "review_content": "\nMr Pheobus was the worst teacher I have ever had in my life. He simply has no teaching ability. His knowledge of Econometrics is great, but he just cannot deliver that knowledge to the class. By the end of the second week, half of the class already dropped out. \nMost of people in fact only go to recitation section. The TA was very helpful in the class, though what she taught was totally different from the midterm/finals. \nThe average grade that professor Pheobus gives is a C, so if you're slightly below average, you could get a D in the class. Overall, a horrible experience. Just avoid this class, you wont learn anything and get a bad grade. \nWorkload:\nFair. bi-weekly problem sets. Midterm, Finals. \n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "May 17, 2004",
            "review_content": "\nBy far the worst professor I had in Columbia. He makes this already hard subject even more difficult to understand. More than half of the class dropped after the first few weeks, and I'm telling you, just avoid this guy. His curve and grading are also very unfair..\nWorkload:\nFair. Bi-weekly problem sets. Midterm. Finals\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "May 20, 2002",
            "review_content": "\nI called this class \"econo-fxxked-up-metrics\" for obvious reasons. As early as the first week I started to wonder what the lectures had to do with the book and what the book had to do with economics. Such confusions did not ameliorate but got worse as the course proceeded. By the third week no one in the class knew what was going on. The professor, who was reasonably nice though oldishly apathetic, was obviously very knowledge in this field. But/Therefore he often seemed to forget the word \"Introduction\" in the course title. It is fair to say that he taught the class like it was a graduate-level course, which is probably what he is used to teaching in the regular academic year. As the other reviewers suggested, the book sucked. Even the professor himself admitted that it was chosen only because it was the best of all very badly written books available. When asked if he wrote \"a lot\" of books about econometrics himself, he answered \"Not at this level\". Still, a search on CLIO for his name yielded a long list of books (most published around the 60s) that might be useful in estimating the locus of his lectures and his exam questions, which I suspect were intended as real-life examples of extreme randomness. The TA, a tall European guy who is always slouching and who mumbles gibberish pretending it is English and who can often be seen walking around in SIPA and Uris, was extremely irresponsible; he obviously did not care a bit about the class. Overall, I learnt absolutely nothing from the class; I can't even say what I was supposed to have learnt.\nWorkload:\nRandom, like everything else about this class\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "December 31, 1999",
            "review_content": "\nThis class is hard enough without Dhrymes in your way. He teaches nothing, complains that the class doesn't study and assigns the 4-5 hour weekly problem set before you even know what the heck it's about. A communal tragedy. The class holds hands, groans, and sinks together (kind of like the Lusitania). The speak-no-english TA didn't help.\nWorkload:\nweekly problem sets, midterm, final.\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "December 31, 1999",
            "review_content": "\nI know that Econometrics isn't supposed to be easy, but dude, this class was so hard and so awful. Professor Dhrymes doesn't teach very well, and he gave these totally impossible tests. The book doesn't help much either because you won't be able to understand a thing in there. I would suggest to you that you look for another professor to take this class with.\n"
        }
    ]
}