{
    "prof_info": [
        {
            "prof_name": "Julia Kennard",
            "prof_id": 10109,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "BC 1101 Statistics",
            "review_date": "April 01, 2012",
            "review_content": "\nJulia Kennard has been one of my favorite professors in my three years at Columbia. Aside from being an altogether amicable woman, she is a very approachable professor who sincerely cares about the success of all of her students.\nProfessor Kennard is very knowledgeable about psychology and statistics and qualified to teach the Statistics course I took at Barnard; she is a forensic psychologist by trade. Her lectures were always engaging and yet she also remained on task every class. She allowed us to leave early if the lesson plan was very straightforward and nobody had any questions.\n\nWorkload:\nHer straightforward homework assignments, class expectations, and tests made it easy to succeed in her class (I got an A- without having devote more than a couple hours per week to the class). I highly recommend taking any class offered with Prof. Kennard!\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 11, 2012",
            "review_content": "\nThis class was very objective and a strong one overall. Professor Kennard put a copy of the textbook in the library so I never bought the book. Although the powerpoint lectures (which she put on courseworks ahead of time) were mostly just restating what was in the book, Professor Kennard was good at making the material interesting and allowed us to respond to the material and ask questions although the class was mostly lecture-style. Exams were very objective, if you read the textbook and attended the lectures you had all the material. She was very friendly and flexible as far as arranging office hours and allowed us to send her our rough drafts of our papers, which helped a lot. I think Professor Kennard's APA manual of style was different from mine because I thought I had followed all the formatting rules in my paper but she marked quite a few things so in the future I'd check what edition she uses.\nWorkload:\n60-70 pages of reading per class, 4 non-cumulative exams, all multiple-choice and true/false, 1 research paper.\n"
        },
        {
            "course_name": "BC 1101 Statistics",
            "review_date": "December 21, 2011",
            "review_content": "\nProfessor Kennard is extremely nice, and extremely easy. \nI got 100s on all of the exams and hardly needed to study. Just go to class, do the homework (you only need a 70% to pass), and you'll be fine. Cheat sheets are allowed for exams but you never actually need them. Kennard explains everything in very very simple terms and goes very very slowly. I took this class because it was required for the psych major. Annoying that there was a recitation scheduled for the same day we had class, but it's the easiest 4 credit class I've ever taken.\nWorkload:\n2 midterms and a final (not cumulative). Homework problems from the textbook due every week. EASY. \n"
        },
        {
            "course_name": "BC 1101 Statistics",
            "review_date": "May 10, 2010",
            "review_content": "\nThis was Professor Kennard's first semester teaching at Barnard, and I liked her a lot. She is really sweet and helpful, and applies the statistics you learn to actual studies and research that has been done and that she has done. She explains things really basically, which may be annoying if you took AP stats in high school, but for someone who has never taken stats, it was perfect. She is really approachable. Class usually got out early, and you could print out the slides she used for her slideshow beforehand to have in class and take notes on. Recitation usually lasted about an hour to an hour and a half. Her exams are really fair and straightforward. She separates the exam by chapters, so the information doesn't get confusing. She took attendance, but I don't think it counted for anything since a few people never came to class (but still did well on the exams).\nWorkload:\n1 homework assignment per week (anything about a 70% counts as full credit, and you get an opportunity to redo the homework if it's below 70%), three exams non-cumulative with 'cheat sheets' that you make yourself\n"
        },
        {
            "course_name": "BC 1101 Statistics",
            "review_date": "April 05, 2010",
            "review_content": "\nPretty easy class. Her lecture slides are right from the textbook so I just zoned out in class \n(she took attendance though I don't technically think counted for anything) and we had recitation a third day of the week to practice the stats problems which was supposed to last for two hours but always only lasted for one. She's not a very interesting professor but she is very sweet and you could tell she was trying really hard. She also had us use data from her own research which was pretty interesting. Overall an easy way to fulfill quantitative req or psych major req. \nWorkload:\nPretty easy. 10 or so hw questions a week and 70% or over was passing. 3 exams, we could bring in a cheat sheet.\n"
        }
    ]
}