{
    "prof_info": [
        {
            "prof_name": "Katherine Thorson",
            "prof_id": 13767,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Psychology Statistics",
            "review_date": "January 02, 2021",
            "review_content": "\nI love Kate! I am NOT a math person and she definitely makes all these stats concepts really understandable and easy to approach. A big contributor to this is that she herself is so easy to approach! She really makes herself available in any way she can and is so accommodating with office hours, email responses, and the amount of help we get. So while the concepts may be challenging at times she's always there to clarify and clarify again if you didn't get it after the 5th time haha. Kate makes stats easy and made me want to continue learning more advanced concepts.\nWorkload:\n1 HW assignment every week (they're all easy and like the eg we do in class)\n3 tests\n"
        },
        {
            "course_name": "Social Psychology Lab",
            "review_date": "June 09, 2020",
            "review_content": "\nThis class just traumatized me lol. This is no commentary on Kate personally, but the whole ordeal, from start to finish, had me in at least three stupid nervous breakdowns. I never wrote a single review on here, but I legit haven't been able to share this experience in terms of the alienating pain I felt with anyone other than my mom lol. \nI do not remember the last time I cried this much over a class, maybe it was just my karma. I variously spent hours working on assignments after lab because I did not have a good grip on SPSS at the time, having taken stats years prior. The final project was a final blow to my self-esteem. My group members and I did not have sufficient time to thoroughly go over our specific parts before Thanksgiving break for different reasons (underestimating the technicalities of SPSS analyses we'd have to conduct in a few days thereafter). Well, they smartly managed it in the end, but I ****ed up big-time, spending hours in the library confidently working on my ~results~ only to very awkwardly discover that I had done my whole part wrong as we were tying things together last minute. IT DID NOT help matters that my group members just proceeded to eye me awkwardly and designate me with a last-min easy part for the presentation, and then later that night delete the powerpoint artwork I tried to contribute to the powerpoint. And next morning, they just shunned me lol. In the end, I believe they collectively rated me w like a 3/5 for participation (Kate distributes these surveys after every ~collaboration~). \nANYWAY, in the end I got an overall grade of B. But did I come out of this with new confidence about how I might be working in collaborative or teamwork situations in the work environment? Big no. I'm just afraid, and I wish this class could have been a better learning experience. While I understand most of my problems here are unfortunately personal, I think that, at least with the final project, there should have been a less compressed time allotment (with regard to the holidays), so that we could independently work things out or individually seek Kate's time for assistance. I did not expect to finish this class with an A, but I also did not expect to finish feeling like I sh*t my pants in public and would probably avoid all people involved in future scenarios.\nWorkload:\nPlease take stats before taking Barnard psych lab courses\n"
        },
        {
            "course_name": "Psychology Statistics",
            "review_date": "January 13, 2020",
            "review_content": "\nKate is amazing!!! She is incredibly kind and friendly. She teaches very clearly and is always willing to take time to explain anything you are struggling with. I was really worried that stats was going to be a hard class but it ended up being extremely manageable and my favorite class.\nThe content was broken up into 3 units. Z-scores, T-tests, and ANOVA. She makes the complicated and intimidating content simple! I personally found the class realllly easy. \nIf you come to every class, pay attention to what Kate says and take notes on the lecture. You will do well. You don't need to even read the text book as long as you take note in class. The assignments are easy As. The tests are not difficult if you study. I never had to spend more than 2 hours studying my note before the exams. \nShe is a fair grader and does not design the tests to trick you. If you are confused about ANYTHING, she will spend as much time as it takes to explain it to you in simple terms until you understand.\nAwesome teacher, 10/10\nWorkload:\n9 assignments that are for completion and just are a way to practice applying the content we learn in class. About a page and again they are just for completion. \n3 unit tests, non-cumulative.  \n- the tests are 1 part multiple choice and 1 part written answers\n\n"
        },
        {
            "course_name": "Social Psychology Lab",
            "review_date": "December 10, 2019",
            "review_content": "\nKate is an incredibly kind and brilliant scholar in psychology. Her niceness made her high grading standards a bit surprising. I would not say she is an unreasonable grader, but I think she demands a type of perfection and accuracy that other lab instructors might not. If you take this lab, prepare to go above and beyond to get an A or even a B. That being said, she makes course material interesting and explains concepts very clearly so that even people without psych backgrounds can understand.\nWorkload:\nLiterature review (3-5pg), method and results section based on an in-class study (2pg), observational field study group project and write-up, final research experiment/study with a group presentation and individual paper. Reasonable for a lab IMO\n"
        }
    ]
}