{
    "prof_info": [
        {
            "prof_name": "Julien Dubedat",
            "prof_id": 6381,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Analysis and Optimization",
            "review_date": "December 23, 2011",
            "review_content": "\nThis class was probably one of the most painful experiences I have had at Columbia. Honestly, I am that kind of student who really tries to pay attention etc but I just dreaded our morning sessions with Julien. \nThe syllabus itself is quite interesting, with many topics relevant to higher-level economics courses, so it's understandable this is a requirement for econ-math majors. Though the first part of the course can be very abstract, the optimization part is very interesting (and easier). However, Julien, despite probably being nice outside the classroom, is incredibly dry, does not say anything that isn't directly related to the class - not even good morning or \"the class is over\". If only this meant he was very pedagogical... Not at all: his blackboard method is frustrating, he barely uses any examples, and more generally is INCREDIBLY BORING. 90% of the time I left class feeling I hadn't learnt anything substantial. \nFurthermore, the weekly problem sets are extremely confusing and the averages were regularly below 65. I suppose this is because Julien demanded notions that were not properly covered in class, or also that the TAs were incredibly harsh graders. I understand that math is about precision, but how can the TAs ask for precision on topics that were absolutely not covered in class? It was a clear case of then the TAs have no idea of what is going on in the classroom. The graduate TA, in particular, was incredibly helpless: he answered questions on the course using topics from higher math courses and his solutions to the HW were so arrogant. \nThis class is a requirement for many majors so you probably won't have a choice anyway, but beware Julien, unless you are extremely motivated. I highly recommend that you reach out to other students for the HW because they are very hard.\nWorkload:\nHard weekly HW\nTwo quizzes on definitions and properties seen in class\nMidterm and final (more geared towards problems like in the psets)\nDespite the somewhat harsh grading, I guess is curved considerably. \n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "May 14, 2011",
            "review_content": "\nThis course is required for Econ/Math majors, and from what I'm told it can replace Modern Analysis for Math Majors. Apparently also some engineers take it for some reason or another. It is a mix of some real analysis, with a chapter or two of topology, and linear programming of the sort that would be seen in an operations-research type class. There are a lot of beautiful, incredibly profound results that come out of this course- but unfortunately, it is taught so poorly and the notes so worthless that only someone who is already very interested in math, or works very hard, will appreciate it. Everyone else will more likely hate this class for the amount of work it requires to understand, the uninterested teaching, and the frustratingly opaque and obscure book. \nProfessor Dubedat is very smart, and was helpful during office hours before and after class, but clearly did not care at all about lecturing. His thick French accent, distracted mumbling, and uninterested approach to covering (or not covering) what was covered in the book meant that for the most part, the class was entirely self-taught. The notes used in class were almost entirely taken from the 'book'- Pinkham's incomplete, unclear, and almost entirely useless (more so for optimization than analysis, but still) set of lecture notes that he is attempting to publish or something. They are useless because they are often garbled and unclear, referring to future sections before they are covered and referring to long past results by number rather than name (ie in chapter 12, something like \"this follows from theorem 3.4.2.\" as if you could remember what that was without trying to find it), and provide \"examples\" along the lines of \"example x.y.z- work this out for yourself.\" Seriously, one of the most frustrating classes I have experienced. At the time I started, one of the chapters and one of the essential sections of another had been left unwritten, although a later edition was finally released. \nIn a sense all math is self-taught, but this is much more so than it needs to be. If you do take this class, make sure to sample the different professors and get your hands on a copy of the book \"Further Mathematics for Economic Analysis\" and \"Mathematics for Economists\" for clearer examples and expositions of the second half. Perhaps you should find one for analysis too, although I don't know. \nFor me the homework and material were all very hard (though with more time, some of them perhaps could have been medium), and if this is your first rigorous math course and you attempt to do this with the provided book and notes alone, I suspect they will be for you too. \nThe grading is rather odd though. The problem sets seemed to be graded incredibly leniently, with only the most egregious mistakes resulting in lost points- for the last problem set, I remember not even arriving at answers at 3 out of the 5 problems, and still receiving a perfect scores. I had a hundred on one of the quizzes, even with red writing and some crossed out sections. The average on the first mid term was a 34 out 54, and 38 was the border between A and B, while 25 was the border between B and C. After each exam and quiz, I consistently felt like I failed, even after long nights of attempted self-teaching every problem set and exam, and yet somehow I did well. I think the grading is almost designed to test how much you care- ie a sketch of a proof with mistakes will get a lot of partial credit. This will work heavily in your favor, if you stick with the class and put effort into it. \nWorkload:\n12 problem sets, from medium to very hard. 2 quizzes, a midterm and final. \n"
        }
    ]
}