{
    "prof_info": [
        {
            "prof_name": "Rashmi Sahni",
            "prof_id": 10785,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 21, 2013",
            "review_content": "\nRashmi Sahni is an amazing UWriting professor. Don't worry after reading her syllabus which sounds very strict- she is one of the most understanding professors at Columbia! She really understands that people are busy and as long as you communicate with her she is very understanding. She also is a really fair grader- she is not an extremely easy A but certainly respects the work you put in and will reward you for doing so. She really encourages you to meet with her and will always be available if you want feedback or for her to look over a draft. You definitely should feel lucky if you have her!\nWorkload:\nUngraded homework assignment for each class. Reasonable workload for each of the major essays- she requires drafts (ungraded) but you will be thankful she does.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 13, 2012",
            "review_content": "\nCouldn't have asked for a better UWriting teacher. I loved the readings she chose for us, and she is really sincere about helping you improve as a writer. Her grading is very fair, and you will find yourself focusing more on what she has to say about your progress as a writer than the little letter mark on the bottom of the page. She's very personable and relates to your struggles as a student. I have talked to other students in UWriting as well, and I think it is safe to say she gives a little less work than other professors.\nOverall fantastic professor, and I am grateful to have had her for UWriting. She occasionally brings snacks into class during Exam periods or when an upcoming essay is close to due. The class has a very laid back attitude and you will feel comfortable bringing up anything you had to say about the readings or assignments. \nWorkload:\nStandard four UWriting essays, with an Exploratory Outline/Draft and a Formal Draft due before each. Reading/Exercises due every class, though most are generally capable of being completed a few hours before the class. The weekly exercises are not graded, but rather checked off to make sure you got the basic concept down and at least did the assignment. However she does write comments on each assignment to help guide you as the upcoming essays come up.\n"
        }
    ]
}