{
    "prof_info": [
        {
            "prof_name": "Joe Sheppard",
            "prof_id": 13222,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Lit Hum",
            "review_date": "August 12, 2016",
            "review_content": "\nI loved Joe, but not everyone will. If you enjoy the reading and discussing the texts, this is the right professor for you. Joe has an unreal amount of knowledge about anything humanities related but especially classics (first semester). His insights into the texts are thought-provoking and give you a deeper understanding of why the text is important and considered to be so great. Plus, his New Zealand accent, his ridiculous fashion sense, and his frequent tangents make him extremely entertaining to listen to. His mind works at a million miles an hour and he's one of the most eccentric people I've ever met. He's also generally very casual, joking around with his students with a very dry, sarcastic sense of humor that he thinks we don't get/is unique to New Zealand.\nThat being said, he is not very forgiving to students who don't keep up with the reading or who are late to class, he gives lots of stupid/unhelpful assignments every night (I remember having to translate an ancient text into \"modern English\"), and he is extremely moody. On a good day, he's the best professor you'll have all year, but on a bad day he is temperamental, seems disappointed in the class, or is just plain bored. Also, he requires you to go in and talk about your paper topic with him beforehand, and most of the time you do this he tears it to shreds and you leave feeling much worse. You will probably either love him or hate him, because there's not really an in between with him, but however you feel, I promise you'll have a more interesting professor than your friends!\nWorkload:\nSame amount of reading as every other Lit Hum class (maybe even a bit less because he cut out some sections from some of the books). Three 4-6 page papers first semester, although the first one was actually only 2 pages and he allowed you to revise it after. Two 5-7 page papers second semester. A smaller writing/preparation assignment ranging from 5 minutes to an hour pretty much every night.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 04, 2016",
            "review_content": "\nJoe is witty, self-deprecating, and absolutely brilliant. His humor and dedicated passion to the texts makes class enjoyable, even if his expectations are sometimes alarmingly high. Joe dominates the discussions in class, not only because he has a deep understanding of the texts and their histories (he is an archaeologist, a Ph.D. candidate for Classics, a Fulbright Scholar, as well as is fluent in Greek and Latin) but because he is so smart that he often intimidates the rest of the class into silence. That being said, he cares about each of his students deeply and is always willing to meet with us outside of class for hours on end to discuss the readings and our writing assignments. Joe also makes an effort to help us understand and appreciate the texts in an extracurricular context, through taking us to museum exhibits, film screenings, plays, or to a restaurant just to get to know his students better. A+ guy, B+ teacher (due to his high expectations, not due to his teaching style).\nWorkload:\nFor every class he would ask us to do a (largely unfeasible amount of) reading, as well as some exercises that help generate discussion for class. We had three 4-6 page papers first semester and two second semester.\n"
        }
    ]
}