{
    "prof_info": [
        {
            "prof_name": "Charlotte Gross",
            "prof_id": 12576,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "FYS Women and Culture",
            "review_date": "April 15, 2013",
            "review_content": "\nProfessor Gross was perfectly nice, but her class was horrible. We were all so bored and discussion lagged continuously. We never discussed anything of interest to anyone and she really didn't seem to care. She never said what she expected from us until we had all already done it incorrectly. \nHer paper comments were muddled and confusing. Often, I got the sense that she didn't even really know what she wanted. She changed her mind constantly, often mid note. Meetings with her were unhelpful and left me unbelievably frustrated. They did more bad than good. \nWorkload:\nThree papers (two drafts each). The last paper was a 8-10 page research essay.\n"
        },
        {
            "course_name": "FYS Women and Culture",
            "review_date": "December 29, 2012",
            "review_content": "\nProfessor Gross is a very sweet woman, but not a very good professor. She didn't tell anyone what she wanted or expected from an assignment until after we had all done it incorrectly. Meetings with her left almost everyone completely frustrated. In discussing essay revisions, she wouldn't say anything about any major problems she had with your essay and then dramatically lower your grade because you didn't read her mind. Class was really boring and the readings became entirely optional. She was one of the worst teachers I've ever had, which was such a bummer because this could have been a really great class. I don't think I learned anything.\nWorkload:\nThree essays with two drafts each (the first draft is ungraded), light reading (a medium amount is assigned, but you very quickly figure out how much is actually required to participate and it's not much)\n"
        }
    ]
}