{
    "prof_info": [
        {
            "prof_name": "Rafael Alarcón",
            "prof_id": 13120,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Mexican Migration in the US",
            "review_date": "April 30, 2015",
            "review_content": "\nI doubt that this course will be offered again, though I should still write something here in case it is. \nEven though Prof Alarcón was a visiting professor here, I should write a review in case he comes back to visit or if you find this review and he's at another school. Rafael was a very knowledgeable professor able to answer all our questions and incorporate the latest research and information into our class. He works in migration studies at the Colegio de la frontera Norte in Tijauna, Mexico.  \nThe class was incredibly small (six students) so we all got to know each other and partake in small discussions from time to time. This class was honestly a joy, as a Mexican American it was great to be able to learn about the trends of Mexican migrants in the US and how they were treated or characterized. All in all, the course was straightforward and Prof Alarcón was a very reasonable professor. He would upload his PowerPoints and make himself available to discuss exams and the final paper. His lectures were a bit boring but he made up for it by being incredibly knowledgeable and open to answering any and every question. \nThough the course was mostly historical in nature, Prof Alarcón was more than interested in looking at the issue of Mexican migration through other lenses. We discussed issues of gender, race and sexuality and how they have changed, impacted and continue to impact Mexican migration. I also felt there was a large sociological aspect in the way we discussed social networks, monetary remittances, etc. In the end, I took in a variety of approaches to the question of Mexican migration and I wrote a research paper about a topic that was not so explored in migration studies, the issue of queer immigration (both historical and contemporary). The paper ended up being a mix between queer-studies and historical analysis, but he was more than happy to accept it. \nIf Prof Alarcón does come back to Columbia or if you get the chance to take a class with him at another school, I would highly recommend it. \nWorkload:\nMidterm and final were all reasonable and he told us in advance what to focus on. \nFinal research paper (about 10pgs) on a topic of your choice. He was very willing to meet and discuss this. \nReadings were informative and often short. Some readings were long, but most could be skimmed for main argument and supporting details. That being said, they were all informative and illuminated some aspect of the lecture and Mexican migration. \nI highly recommend him in the off chance he comes back to Columbia. \n"
        }
    ]
}