{
    "prof_info": [
        {
            "prof_name": "Pier Tommasino",
            "prof_id": 12972,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 21, 2016",
            "review_content": "\nProfessor Tommasino is encouraging, friendly, humorous, and really wants everyone in the class to do well! He is very knowledgeable as well as fun and makes you really interact with the texts and learn a lot from discussions. Plus, it's a pretty easy A as long as you are engaged during class discussions! \nAfter a pretty miserable fall semester of Lit Hum with a different professor, I switched into Prof. Tommasino's class and I am so thankful and glad that I did. \nHis discussions are lively and energetic and students really want to participate. Whenever we start a new text, he usually goes over the context and sometimes a brief history about the book, the time period, and/or the author. He is funny and makes light-hearted comments throughout our discussions. \nHe also really wants everyone to succeed and the class is designed so that mostly everyone does well. You can get by without doing all of the readings and it definitely helps to pay attention in class. He also allows computers which is a GREAT WAY to do some quick Sparknotes reading and type notes. \nHe's on sabbatical this coming year, 2016-2017, but hopefully when he returns he'll continue to teach Lit Hum! \nWorkload:\nReadings as usual (but you can get by without doing all the readings) \n1 Take Home Essay (graded very fairly) \n1 Paper (at least 5 pages, the topic was very fun to write about) \n1 Midterm (mirrored off the final) \n1 Final (the passage IDs are not as important as the 2 written essays so don't worry about the IDs)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 10, 2014",
            "review_content": "\nTo all you freshmen out there who get the chance to take Professor Tommasino's class...\nYOU ARE LUCKY DUCKS. My class and I simply LOVED him. He had this great way of encouraging class participation and discussion. Didn't matter if it wasn't super related to the text - his teaching philosophy emphasizes learning to think on your feet. BUT don't let that deter you!! Mostly participation is voluntary unless no one raises their hand but someone always did because he posed such interesting, yet open-ended questions. \nComputers: check yes! Literally was on buzzfeed or online shopping half the time, still got an A. \nHomework: None besides the Lit hum reading! (And maybe two papers, but they both had CREATIVE options so super fun and not stressful to write.) I got by just fine with Shmoop summaries. \nGrading: Generous. Don't think anyone ever got under a B on any paper. \nFinally, this class involves a lot of laughing! He is a very charismatic teacher who you actually want to participate in the class for. \nWorkload:\nSee above. \n"
        }
    ]
}