{
    "prof_info": [
        {
            "prof_name": "Janet Conrad",
            "prof_id": 159,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Physics for Poets I",
            "review_date": "January 13, 2009",
            "review_content": "\nIn a nutshell:\n- The powerpoints are informative and clear enough, and Conrad is a capable enough lecturer, that I never opened my book\n- The workload is minimal, but I still learned a huge amount of brain-stretching material\n- The concepts are relevant to the lives of everyone who lives in this universe (i.e. physics is incredible)\n- Conrad passes out physics toys about once a month (I still have my diffraction grating glasses!)\n-NO CALCULUS.*\nI highly recommend this class to anyone and everyone who hasn't taken a college-level physics course\n*Conrad occasionally adds more advanced or complicated math to the powerpoints, but she usually flips through the slides really quickly in class, and we weren't tested on any of it. For people (like me) who know calculus and just get really angry at math homework, this means you can understand some of the concepts mathematically as well!\nWorkload:\nOptional weekly problem sets (I did zero and still did really well), weekly quizzes (basically repeats of the problem sets), and a midterm and final, both of which are very predictable and fair (and not particularly challenging if you've shown up to at least half your classes). \nExtra credit for showing up to class and answering the question of the day on an index card.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "December 29, 2007",
            "review_content": "\nThis is a great science class to take if you are just trying to get your requirement done.  There is very little work to do as long as you go to lectures.  All you have to do in this class is do the weekly assignments, which take an hour or less and that you don't have to hand in, to study for the weekly quizzes.  Also, if you bomb a few of the quizzes, there are many opportunities to replace the grades.  The final is also very easy.  Professor Conrad is quite interesting, and is a particle physicist at FermiLab in Chicago, but she somehow manages to be a very capable teacher and manages to keep things interesting in a physics class that really doesn't involve much math.  You are almost guaranteed an A.  She showed us the final curve from fall 2006, and 55 percent of the students got above an A-, and I think something like 15 got below a B.  \nWorkload:\n10 weekly quizzes, final\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "November 29, 2006",
            "review_content": "\nIf you are looking for an easy class just to take to boost your GPA, this is the class to take.  If you have a previous knowledge in physics it will help you greatly, and if you know it well you could almost get by without going to any lecture, except to take the quizes.  The lectures are boring and monotonous, contain many useless facts and just all together not informative.  The quizes could be a little tricky, just be sure to completly the assignments, because the quiz will resemble a few problems on the assignments.  If you aren't familiar with physics, you might have to go to lectures, but its not that bad.  The class is curved, so as long as you have decent knowledge of physics you should get a relatively easy A.\nWorkload:\n10 Quizes (66%), and  Final (33%)  \n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "September 11, 2006",
            "review_content": "\nThis class was definitely harder than I thought it would be. Professor Conrad is one of the nicest people I have ever met, but the lectures are extremely long (often around 100 powerpoint slides) yet somehow completely devoid of information. The format of the class is easy-10 quizzes, each worth 10 points, and a final worth 50 points. If you screw up or miss a quiz, you can make up tp 3 of them by writing \"Alternative Essays.\" The lectures are boring, but dont do what I did and stop showing up-in mid-semester I had a C, and had to work and go to office hours to end up with a B. All in all, a relatively easy science class for non-science people; just, please, go to class!\nWorkload:\n10 10-point quizzes, 50 point final\n"
        },
        {
            "course_name": "Honors General Physics I ",
            "review_date": "December 31, 1999",
            "review_content": "\nA lot of premed students steer clear of this course because they're worried about the \"with calculus\". This has the pleasant effect of making this a smallish lecture, but even with a larger class Prof. Conrad would be worth the inconvenience of the extra math. The workload is heavy: two chapters a week to read, and ten to fifteen problems, but homework is not collected. Instead, a weekly quiz closely modelled on the Homework problems is given. Prof. Conrad sees her mission as the enlightenment of the general population as to the beauty and relevance of physics, and she carries out her mission with a good deal of dedication and charm. She is always willing to interrupt the lecture for a question (an unusual characteristic in large lecture courses), and I know of people who practically camped out in her office to go over the homework problems with her. She is also highly acessible via email, and generally returns answers to questions within a twelve hour period. Add to this a sense of humor and a social conscience about the real-world uses of physics and you have a truly exceptional teacher. How many classes are there where the TA administering the final says: \"Professor Conrad asked me to make sure that everyone has a final, a scantron, and a doughnut\" when you come in. (You also get doughnuts for the midterm, an advantage in a morning class.).\n"
        }
    ]
}