{
    "prof_info": [
        {
            "prof_name": "Christopher Weiss",
            "prof_id": 1025,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "sociology of education",
            "review_date": "August 01, 2002",
            "review_content": "\nWeiss is a really nice guy, despite the 9am time slot, you (might) find yourself actually setting your alarm to go to this one. The class and subject matter was simple- leave it to sociologists to write an entire article on research of crowds in middle school -\"from nerds to normals\". Granted this is a private university and the majority of the students are from elite public schools and private schools and were confused by some of the seemingly basic concepts discussed (\"students in public schools are TRACKED? and it's not their choice??\"). But if you're one of the few who went to a run of the mill public school you'll have a much easier time. TA is a picky grader- this isn't an english course and she pays too much attention to grammar and structure of essays. Weiss has you buy 4 books and an overpriced coursepack, the books are somewhat useless.\nWorkload:\nNot terrible, 2 papers, a midterm and a final. The exams aren't easy but there's nothing on them that you won't know if you haven't prepared. Papers have you argue about a course topic- magnet schools, etc and another one is more geared towards research.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "June 02, 2002",
            "review_content": "\nAny class that this guy is teaching, you should take. He's super-bright, energetic, and entertaining. The workload is very reasonable for a social science class, and he's generous with the grading. If you stay current with the reading (which is on the light side), you will walk out of the semester having definitely learned something and with a very good grade to show for it. I just graduated with honors as a Sociology major, so I can attest to the fact that this department has its fair share of nitwits. The problem is that it's superb guys like Weiss that this sucky department can't hold on to (as with David Gibson and Mary Ruggie -- two sociology professors who both left Columbia last year to teach at Harvard). So, take Weiss while you still can......he's worth it.\nWorkload:\nA few very short papers; one longer term paper of 10 pages or so; and a final.\n"
        },
        {
            "course_name": "sociology of education",
            "review_date": "April 20, 2002",
            "review_content": "\nChris Weiss is great. He's new, he's fun, he's energetic. You are bound to laugh (sometimes at him) almost every class. Even at 9am, his class is good. the subject material is pretty interesting, and the work is mostly articles from a reader. If you aren't interested in education, take another class wtih him. you will not regret it. He is a wonderful guy and a good lecturer.\nWorkload:\nnot bad. all articles or books = one's called \"jocks and burnouts.\" 2 short papers, one midterm, one final. not a harsh grader\n"
        }
    ]
}