{
    "prof_info": [
        {
            "prof_name": "Rosalyn Deutsche",
            "prof_id": 1512,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Feminism/Postmodernism in Art",
            "review_date": "May 23, 2013",
            "review_content": "\nI loved this class. Rosalyn Deutsche is a fantastic lecturer and an extremely kind person.  The theories that govern this class are very complex, but she does a fantastic job at clarifying them. She repeats the important points multiple times in multiple different ways so as to make sure everyone is on the same page. \nThe way the class is structured makes complete sense. First, she introduces the theories of modernism as posited by Clemente Greenberg and Michael Fried. Then, she discusses the ways in which postmodern discourses in art and literature deconstructed these theories and eventually paved the way for a feminist art practice. \nIt is not a normal art history class. You do not look at 20 images per class and memorize your notes on the slides for the exams. You go over the readings and she discusses theories. She brings in one or two works per class, sometimes more and sometimes none at all. She leaves it up to the class to apply the theories of the course to the works of art. After hearing everyone's take, she briefly states her own opinion and then moves on. \nJust take this class. Whether or not you are an art history major, if you go to Barnard, you should just take advantage of the opportunity to learn about the development of post structuralist thought and feminism. \nWorkload:\n1 midterm: 3 slide IDs with questions, term definitions and reading IDs. Straight forward and easy\nTerm paper: 7-10 pages on a work by a choice of artists. Prompt is very broad and she is flexible with topics. \nFinal: Same format as the midterm. Very easy. You should come out with some form of an A. \n"
        },
        {
            "course_name": "Feminism/Postmodernism in Art",
            "review_date": "April 27, 2013",
            "review_content": "\nHmm, where do I begin? I guess my expectations were higher than I previously thought because, unfortunately, this class didn't meet them (and I don't really set expectations for classes). We spent the first three months of the class talking about everything before the actual subject of the course...which IS helpful and useful but maybe as a beginning of the semester refresher. But after that, the course becomes repetitive until April. I can't say anything regarding the TAs -- they seem very nice but I have only had brief contact with them. Deutsche is repetitive to the point of exasperation. She takes a lot of input from the students during class but I have seen her shoot down a few ideas because they didn't agree with whatever point of view she decided upon at the time. I've taken several Art History courses and know many of the professors in the AH Department. I tried, I really tried to like this class, but I just didn't. \nWorkload:\nMidterm (including identifications, short-answer questions, and an essay), 7 - 10 page final paper, and a final. Doing the readings is extremely helpful for the exams but, lecture-wise, she does repeat it all back to you and will occasionally give you quotes in class and explain them. \n"
        },
        {
            "course_name": "Feminism/Postmodernism in Art",
            "review_date": "August 26, 2009",
            "review_content": "\nProf. Deutsche is by far and away the best professor I have had in the Art History dept. and probably in all of Columbia.  Not only does she have a warm and engaging - almost motherly - approach to teaching that puts me at ease, she is brilliant in her observations while still being open to different interpretations.  The first half of the class focused on art theory through the modern era into the postmodern era that spanned philosophical/political contexts.  While I had already read some of those texts, it was a helpful review that was necessary for contextual purposes when we finally got to see and discuss the amazing feminist art in the second half of the semester.  I found myself always interested during her lecture, and she has a great sense of humor as well: \"I see phalluses everywhere!\" Again, an amazing, wonderful professor - she deserves a GOLD STAR already!\nWorkload:\nmidterm, paper, final - light to medium workload but you have to do the reading for the exams \n"
        },
        {
            "course_name": "History and Theory of the Avant-Garde",
            "review_date": "January 27, 2007",
            "review_content": "\nGod, I love Deutsche. This class was seriously one of the easiest As I've gotten, either at Columbia or at Barnard. \n(Although, admittedly, it was the TAs who were responsible for grading. Thanks, Emily and Yeats!) Deutsche herself, though, is incredibly easy-going, as most of the other reviews have pointed out: she's also smart, she's been around the block (apparently she got called away the Thanksgiving weekend to give a talk at the Courtauld Institute - now that's jet-setting), she respects her students, and she obviously wants the classroom experience to be enjoyable for all involved. \nNow the downside: this class was, well, a tad more ... \nunchallenging than I'd expected. Here's the formula for doing well: show up to every single lecture, try - as best as your aching fingers will let you - to take down everything she says, don't waste too much time on the texts themselves but just memorize whatever's in your notes, and regurgitate - and I mean SPEW - during exams. \nVoila ! - grade happiness. While that sits just fine with students of a certain stripe, however, the rest of us would've preferred to be spoonfed a little less. Don't get me wrong, its great having someone explicate difficult, abstract ideas for you - as opposed to having to figure things out on your own, courtesy of some unrepentent lazy asses here on the faculty, and then nearly keeling over from the shock when you get your grade - but Deutsche's approach tends to be a little too summary, in my opinion: she'll break the text down into its major ideological components for you, but, unsurprisingly, a lot of nuance gets lost in the process. You'll learn about Marxist aesthetics - and Marx - and its role in the formulations of certain avant-garde movements, or the social theory of the Frankfurt School and its impact, but you won't get more than, say, a superficial treatment of the equally important twentieth century critiques of those ideologies, for instance. \nDon't let that deter you from taking a class with Deutsche, though - she's still definitely worth the tuition dollars. \nWorkload:\nLots of reading, not all of it terribly engaging. A fairly manageable midterm and final, and a 8 - 10 pg research paper.\n"
        },
        {
            "course_name": "Feminism/Postmodernism in Art",
            "review_date": "May 12, 2006",
            "review_content": "\nrosalyn deutsche is a sweet lady, and she's really cute.  she's certainly knowledgeable and communicates a lot of\nvaluable information, but feminism has gotten boring and she fails a little bit at reviving it. \nher class feels a little too granola and i found myself rolling my eyes a too frequently.  very obvious feminist arguments are presented and you've probably already heard most of them.\nthe work studied is good stuff to know though, so you should take the class just because you won't learn it\nanywhere else.\nbut while it's good that she encourages discussion, the specific discussions in her class kind of suck.  picture fifty wannabe feminists spewing ass liquid for an hour and a half.  it gets irritating, and she takes attendance, so you can't skip.\nWorkload:\naverage\n"
        },
        {
            "course_name": "Feminism/Postmodernism in Art",
            "review_date": "August 24, 2005",
            "review_content": "\nThis class took my breath away. Prof. Deutsche is really an amazing teacher. The subject-matter is comlicated and often dense, but Prof. Deutsche managed to bring it to her students level without bringing it down to her student's level.  No matter how little or much you know about feminism and postmodernism in the 70s and 80s, you will learn a lot from this class.  There is a wide variety of theory and criticism that she meticulously explains, so that you are always learning without being overwhelmed. She is a clear and organized lecturer who occasionally expresses her own (interesting) opinions, but she is very open to questions and encourages class participation.  \nWorkload:\nVery dense readings, which she explains in detail in class. Typical slide i.d. midterm and final, final paper. Very fair grader.\n"
        },
        {
            "course_name": "Feminism/Postmodernism in Art",
            "review_date": "August 24, 2005",
            "review_content": "\nThis class took my breath away. Prof. Deutsche is really an amazing teacher. The subject-matter is comlicated and often dense, but Prof. Deutsche managed to bring it to her students level without bringing it down to her student's level.  No matter how little or much you know about feminism and postmodernism in the 70s and 80s, you will learn a lot from this class.  There is a wide variety of theory and criticism that she meticulously explains, so that you are always learning without being overwhelmed. She is a clear and organized lecturer who occasionally expresses her own (interesting) opinions, but she is very open to questions and encourages class participation.  \nWorkload:\nVery dense readings, which she explains in detail in class. Typical slide i.d. midterm and final, final paper. Very fair grader.\n"
        },
        {
            "course_name": "History and Theory of the Avant-Garde",
            "review_date": "January 02, 2005",
            "review_content": "\nI always looked forward to her class. Though a large lecture, she tried hard to field questions and reserve time for discussion. In a class of 60, she knew almost everyone's names. She's very set in her ways (attendence taken each class, her requirements for papers), but she is excellent. She is quick, is extremely knowledgeable, well published and respected in the field, and surprisingly understanding. She wants to get to know you, to hear your thoughts, to meet with you outside of class, though she's very busy. Her class is a thorough, and at times repetative, but always informative, honest, and opinionated in a very good way. I both learned a lot, and enjoyed her class. Two minor downsides: the classroom was way way too small for the class size, and her TAs were utterly incompetant.\nWorkload:\ngreat readings (optional, since she goes over all in class), one real research / analytical paper.\n"
        },
        {
            "course_name": "Discourse on Public Art and Public Space",
            "review_date": "April 13, 2003",
            "review_content": "\nProfessor Deutsche is a brilliant professor and a noted scholar in her field.  She is extremely knowledgeable about art and has personal experience with many artists in the NYC art world of the past 30 years.  She is an interesting lecturer and cares about her students and makes sure to answer questions without letting annoying and pretentious questions dominate the class.  I have learned a lot in this class.\nWorkload:\nA lot of dense reading but always discussed in lecture. Two exams and one 10 page research paper.  Fair grader.\n"
        },
        {
            "course_name": "Feminism/Postmodernism in Art",
            "review_date": "April 07, 2003",
            "review_content": "\nProfessor Deutsche is the most amazing professor I've ever had. Her love of the material makes it hard for you not to be interested. I wish I could take all my classes w/ her.\nWorkload:\nmidterm/paper/final...if you go to the lecture, you dont need to do all the reading.\n"
        },
        {
            "course_name": "Feminism/Postmodernism in Art",
            "review_date": "April 07, 2003",
            "review_content": "\nProfessor Deutsche is the most amazing professor I've ever had. Her love of the material makes it hard for you not to be interested. I wish I could take all my classes w/ her.\nWorkload:\nmidterm/paper/final...if you go to the lecture, you dont need to do all the reading.\n"
        }
    ]
}