{
    "prof_info": [
        {
            "prof_name": "Xin Wan",
            "prof_id": 12680,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "January 23, 2014",
            "review_content": "\nXIN WAN IS THE BEST THING TO HAPPEN TO COLUMBIA. every time I went to calc II he was there with a bright confused smile to help me through this course. without his adorable optimism and happy face, I would have hated calculus. BTW HE SENDS ADORABLE APOLOGETIC EMAILS ABOUT CULPA REVIEWS. ok it says this review isn't long enough and ihave to go so                                                                                                                                                                                                                                                                  fjkLE/JKLT4OP5490595 FDWOT LOGN TDOES TS TEXT HAVE TO BE JEEZEE OUSSSIIEEEE\nWorkload:\n1 problem set a week. 2 mid terms. 1 final. so reasonable\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "September 05, 2013",
            "review_content": "\nHonestly, he isn't the best teacher for this class. I wouldn't recommend trying to get him as a teacher for a few reasons.\n1) He doesn't seem to understand that he needs to be able to explain topics to the students rather than just read the problems. \n2) He assumes that the class knows what he is doing and has memorized every derivative and integral known to man, which then causes him to skip steps and explanations that are necessary to understanding what he is doing. \n3) His \"lectures\" are essentially him copying down exact definitions from the book, then writing them on a chalkboard, followed by examples that you can't really follow if you aren't sure of what he is doing. \n4) He speaks to the board, and stands directly in front of what he is writing so taking notes is extremely difficult\n5) He clearly knows what he is doing, but when you ask a simple question, he does not seem to understand why you wouldn't know what he is talking about.\nThe homework is not too bad, but I only wish that he was better at explaining the concepts to those who need it. If you haven't taken BC Calculus before, I would advise you to seek out another teacher.\nWorkload:\nWeekly homework assignments on WebAssign ~ 10-12 problems\n2 Midterms\n1 Final Exam\n"
        }
    ]
}