{
    "prof_info": [
        {
            "prof_name": "Ana Petrovic",
            "prof_id": 3454,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 18, 2010",
            "review_content": "\nWhen I signed up for Ana's Frontiers discussion section, professors hadn't been posted yet, so I blindly chose hers -- and I was incredibly lucky to wind up with Ana.  Of all the frontiers leaders I've heard of, Ana is by far the best.  While others blamed their sections for doing poorly on the midterm, Ana apologized by saying that the leaders clearly weren't teaching the material as well as they should.  And isn't that the truth!  For as much as I was willing to put into this stupid required class, it's impossible to get much useful out of it (seriously, though, what can you expect when all they talk about is \"back of the envelope\" estimations??) But Ana invested a lot of time in making it as easy for us as possible; she grades fairly; she explains things clearly; she is always available for one-on-one explanations.  At the end of the semester, she typed up a summary of everything we were supposed to know.  It was so clear and concise that I sent it to all my friends -- whose section leaders had done nothing of the sort.  If you find yourself in Ana's section, consider yourself lucky -- and even though sections are an annoying obligation, be as nice to her as you can, she deserves it.  And if you  can, do yourself a favor and switch into Ana's section!\nWorkload:\nMaybe half an hour a week doing the WIA (weekly worksheet).  Then one day prepping for midterm and final, each.  FAR more reasonable than other frontiers leaders.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "April 22, 2009",
            "review_content": "\nAna is the best. She manages to teach to multiple levels of students at the same time. She did a chem doctorate on chirality and really knows her science but is also good at simplifying the lecture material and working with you until you understand a concept. Ana is always upbeat about a class that excites few people (I found this to be a big plus and actually enjoyed her class quite a lot). If you happen to get her for discussion, consider yourself very lucky. If you didn't, switch in!\nWorkload:\nStandard midterm and final; a handful of quizzes based on lecture and discussion material; slightly easier homework load than other classes (she tailors the homework packets a bit). Ana always grades with your best interest in mind: if you have a logical explanation and support your answer with some evidence, you will usually get most of the points, even if the final answer was incorrect.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 29, 2008",
            "review_content": "\nAna is great! She has an enthusiastic, extremely fast-paced lecture style, but will immediately slow down or stop if someone is having difficulty. Her classes actually made frontiers of science tolerable - almost fun! (almost, because can you really have fun with an astronomy unit?)  She is very lenient with homework assignments and other graded work - in the sense that she understands how everyone may not be a science whiz and may not grasp every concept right away. As long as you are putting forth your absolute best work, she will help you with any problem areas and give you the best grade she can. \nBe grateful if you have Ana! She is brilliant, and truly a great teacher! \nWorkload:\n1 written assignment per week / usually about 3-4 problems in each packet\nshouldn't take more than an hour for any given assignment\none dull lecture / week that you probably should attend or peruse online before discussion session\nscary, scary midterm that they give you next to no time to complete. \n\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 28, 2008",
            "review_content": "\nAna was great! She was really very helpful, always went out of her way to make herself available and gave lots of hints where the frontiers material was a bit vague. The sections are a bit boring, but this isn't her fault. She does her best to try to keep the material as lively as possible and her grading is very, very lenient.\nWorkload:\none homework a week, midterm, final. Unlike in some other sections, Ana doesn't really require that you do the reading and doesn't really seem to care about class participation.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 18, 2008",
            "review_content": "\nAna is the best Frontiers teacher you can get. If you're going to suffer through the course, suffer with Ana every week. Not only is she the nicest, warmest teacher you can have, but she makes sure that her students really understand the material and will do everything she can to help you. Go to her office hours; she will walk you through the homework and make sure you understand everything before you leave. Before the midterm and final she focuses on what is important for the tests so that you know the material better than all your friends. By the end of the semester you feel as if Ana is your best friend rather than your teacher. Thank your lucky stars for having Ana; SHE IS THE BEST.  \nWorkload:\nStandard Frontiers weekly assignment. If you can't do it, she is always at her office hours to help you. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 21, 2008",
            "review_content": "\nAna rocks. Ana was pretty easy going.  She understands that students are forced to take the class and the material could at times be boring so if you space out or fall asleep she won't hold it against you.  She tries to make the assignments as easy as possible and if you email her the night before its due asking for help she'll basically give you the answers.  She is also always willing to make additional appointments beyond her office hours to meet with students. She explains the material pretty well and prepares you for the midterm and final.  Overall, good teacher and a good way to harmlessly get through frontiers.\nWorkload:\nEasy. The weekly WIA's but she makes the due a week later than all the other classes so you can usually get help from friends who already did them.  She also goes over a lot of them in section the week before they're due so she gives you a lot of the answers.\n"
        }
    ]
}