{
    "prof_info": [
        {
            "prof_name": "Tsolin Nalbantian",
            "prof_id": 2666,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "July 09, 2006",
            "review_content": "\nTsolin is a great TA. The other reviewers probably did not do as well as they expected and are taking it out on her. The work is quite minimal and easy you just have to make sure to send the questions every week. If you do even some of the readings, email your questions every week and participate in discussion, you'll have no problem. And you can talk to her anytime when you don't understand something. She also holds review sessions before the midterm and final, which I definitely recommend going to. \nWorkload:\nquestions/responses once a week, attend discussion sections\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "July 09, 2006",
            "review_content": "\nTsolin is a great TA. The other reviewers probably did not do as well as they expected and are taking it out on her. The work is quite minimal and easy you just have to make sure to send the questions every week. If you do even some of the readings, email your questions every week and participate in discussion, you'll have no problem. And you can talk to her anytime when you don't understand something. She also holds review sessions before the midterm and final, which I definitely recommend going to. \nWorkload:\nquestions/responses once a week, attend discussion sections\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 23, 2005",
            "review_content": "\nNot the worst TA, by any means, but I would suggest avoiding her sections for related courses.  She requests strenuous weekly postings/questions on the readings without really detailling what she is looking for.  In section she is helpful in reviewing the lectures and sorting out the themes/topics of the course, but she is also mildly brash.  She is extremely PC in a \"careful with how you use that term\" manner, and puts up the friendly screen while in reality being a bit aggressive and stand-offish.\nWorkload:\nAmbigous weekly postings/questions on the readings.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 01, 2005",
            "review_content": "\nI totally disagree with the previous reviewer. I have found Tsolin to be a great TA - she is prepared with questions for discussion, has clearly read all the material and cares about it. It is true that she will call you out on bs and make you explain yourself - but this is not because she wants everyone to think as she does - rather she just wants the students TO THINK. I look forward to section with her. She also makes an immense amount of effort in grading - I think I've never been returned a paper (each student writes one short paper in response to the readings during the semester) with more feedback, and constructive feedback at that. I would definately recommend her to others as a fantastic TA - concerned, challenging and caring.\n\nWorkload:\nModerate - weekly readings. students email two questions/comments each week to TA.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "November 21, 2005",
            "review_content": "\nNot the sharpest tool in the shed, but it could be worse. It would be unfair to call her completely dumb, but it was obvious to most of us that while she is unyielding in her views, either she didn't understand or doesn't listen to what people say a lot of the time. But she does speak English fluently, and she's not totally boring; she's just not that helpful. Not a born teacher, but not a total wreack either.\nWorkload:\nShe made us turn in questions for discussion at noon on the day of our sections. It felt like busywork, but I guess it helps her understand what's going on.\n"
        }
    ]
}