{
    "prof_info": [
        {
            "prof_name": "Bonnie Baker",
            "prof_id": 554,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Karate",
            "review_date": "December 11, 2016",
            "review_content": "\nBonnie Baker's karate class is reasonably fun for a phys ed requirement. If you enjoy martial arts and general calisthenics/fitness, then this class is a decent introduction. Since basically everyone knows nothing (including me), I would not walk into this class with the expectation of making much progress. If you can buy into her pseudo-East-Asian-spiritual beliefs and teachings, you may get more out of this than I did. On the other hand, if you are uninterested in the spiritual aspect of this class, it's not so much that it's abrasive. She's nice but somewhat intense.\nWorkload:\nOne page paper about a documentary we watched. The documentary, although dated, is somewhat interesting (Budo - the Art of Killing (1978))\nDon't miss class more than 6 times.\nPushups, situps, leg-raises, jumproping, puching, kicking, etc.\n"
        },
        {
            "course_name": "Karate",
            "review_date": "April 29, 2011",
            "review_content": "\nconsider yourself lucky that this high caliber of a karate instructor teaches at such an academically focused school. you won't get something like this at another ivy school, at least i highly doubt it! Absorb everything you can with her, because she's amazing! She is really helpful, and walks around the class giving personal advice to each student. She is really committed to giving you a better life- sound wierd? It isn't wierd. She is honestly and genuinely concerned with giving you a sense of pride and confidence in your ability to walk around the streets of new york with a sense of security. She wants you to be able to stand up for yourself and to gain street smarts. Give her a gold nugget please.\nWorkload:\nwork on your front kick!\n"
        },
        {
            "course_name": "Karate",
            "review_date": "November 14, 2006",
            "review_content": "\nTo put it briefly, Sensei Baker is fantastic.  She handles a class of beginners well and is dedicated to helping her students develop a solid foundation of basic technique.  What does that mean?  Expect lots of repetition.  The class moves slowly in terms of learning \"new\" material, but remarkably quickly in terms of improvement.  Sensei is eager to help after or before class and clearly is passionate about her art.  Whether you're completely new at martial arts or have had training, but would like to spend time focusing on refining the basics, I would highly reccomend this class.\nWorkload:\nPushups, situps, jumping rope, and (more tiring) practicing technique\n"
        },
        {
            "course_name": "Karate",
            "review_date": "December 13, 2005",
            "review_content": "\nSensei Baker is probably the best professor on campus! She actually cares for her students, which is rare trait in college professors in general. She is also very strong and talented - at the age of 50-60ish, she is stronger than everyone in the class! She also teaches very well - but you have to be serious about whether you want to learn anything in the class. A very fun class to take if you are serious, but if you are not, just go take another PE class and not waste our time. \nI wish the class were more competitive though. We have had small \"competitions\" - really 2 people against each other pulling or pushing for like 30 seconds. If you have more of a competitive spirit (like me), I would suggest taking Judo instead, although I don't think that any other martial arts program could really beat Karate. I've heard that the club is very competitive, but it's also expensive - worth joining once u are done with the 2 required Karate classes.\nWorkload:\nOne 1page paper... over a video. Really didn't matter much. Other than that, 6 absences allowed during the semester - save them for the end to study for finals!!\n"
        },
        {
            "course_name": "Hatha Yoga",
            "review_date": "April 26, 2005",
            "review_content": "\nIn the begining she can be kind of strict on attendance and punctuallity, but towards the end she is cool. All in all it is a relaxing class, lots of meditation, and sun salutation (LOTS OF SUN SALUTATION).\nWorkload:\nit's a pe class just show up and enjoy.\n"
        },
        {
            "course_name": "Karate",
            "review_date": "January 04, 2005",
            "review_content": "\nBaker rocks. The CULPA reviews I read made me scared that I would be whipped while running 10 miles a day. However, jump roping and pushups were about the extent of her physical intensity. She has  a very strong aura and is clearly dedicated to karate. I'm pretty awful at karate, but she did all she could to help me personally without actually publically humiliating me. She is certainly intense, but it is in a motivating rather than intimidating way.\nWorkload:\nKarate\n"
        },
        {
            "course_name": "Karate",
            "review_date": "May 30, 2004",
            "review_content": "\nThis course is seriously one of the best courses I have taken at Columbia - Baker is a great teacher, even though most people find it extremly strenous at first. Although she barely covers any Karate due to lack of time, she makes the class extremly enjoyable. I defintely recommend this course for any phys. ed reqs.\nWorkload:\nYou should practice karate on your own if you're serious about it\n"
        },
        {
            "course_name": "Karate",
            "review_date": "April 21, 2004",
            "review_content": "\nI just read through these reviews; it seems that Sensei Baker has mellowed out since the first ones were written.  She doesn't single people out as much any more (and if she does, it's for good things, like form).  She doesn't talk so much about Zen, and the only customs we learned were those that were related to what we were doing (ie, courtesying your partner, tapping out, lining up in order of skill).  I loved this class, and I'm signing up again.  Baker's awesome.\n"
        },
        {
            "course_name": "Karate",
            "review_date": "October 17, 2003",
            "review_content": "\n\"Oh my god\". \nThats about sums up Sensei Baker, as in \"Oh my god, they let you teach??!\"\nBaker's got serious issues about control, has little or no actual knowledge of the discipline of karate. \nAs for her technique: I know a woman half her size and strength who's taken karate for a year forma  real instructor. She snuck into class with me one day to see if I were merely exaggerating about her. She came out with two opinions:\n 1) \"This woman is nuts.\" 2) \"I could kick the crap outta her with those weak-ass techniques she's teaching.\"\nWorkload:\nUsual with gym classes, but for some reason, she thinks she's toughing people up. The woman, as others have stated, is two steps short of a schizophrenic.\n"
        },
        {
            "course_name": "Karate",
            "review_date": "October 17, 2003",
            "review_content": "\n\"Oh my god\". \nThats about sums up Sensei Baker, as in \"Oh my god, they let you teach??!\"\nBaker's got serious issues about control, has little or no actual knowledge of the discipline of karate. \nAs for her technique: I know a woman half her size and strength who's taken karate for a year forma  real instructor. She snuck into class with me one day to see if I were merely exaggerating about her. She came out with two opinions:\n 1) \"This woman is nuts.\" 2) \"I could kick the crap outta her with those weak-ass techniques she's teaching.\"\nWorkload:\nUsual with gym classes, but for some reason, she thinks she's toughing people up. The woman, as others have stated, is two steps short of a schizophrenic.\n"
        },
        {
            "course_name": "Karate",
            "review_date": "March 27, 2003",
            "review_content": "\nAnyone who expects genuine Zen insight or expects to attain any real knowledge of karate in a 50 minute PE class needs a reality check. How often do you really get to take a karate class? You could play pickup basketball or run on a treadmill whenever you want for the rest of your life, but this is an opportunity to try something new. Yes, Sensei Baker is scary as hell at times, and sometimes she does single people out (but at the same time, she will also help you individually if you are willing to learn) but she is totally right when she says that you only get as much out of the class as you put into it. So if you're willing to sweat and occasionally make a fool of yourself, then you should take this class. \n"
        },
        {
            "course_name": "Karate",
            "review_date": "December 15, 2002",
            "review_content": "\nThis was a great class.  She takes herself really seriously, which adds to the fun.  You get a really good workout, and you have fun doing it.  I definitely recommend it. \n"
        },
        {
            "course_name": "Karate",
            "review_date": "March 12, 2002",
            "review_content": "\nBaker is about as likable as a midterm on a Friday morning. Despite \"years\" of martial arts training, her skills are about on par with someone whose taken it for three years and likes to boss people around. She's got a psycho image of karate gi's intimidating people, so she makes you run on the track to scare them. If you don't do an exercise right, she'll hold up the class to focus on you with loud, rude comments. Her self-defense moves are worthless; there many other simpler, more effect moves she could teach to a group of novices. \nWorkload:\nLike most PE teachers, stickler on attendance. Just fake the motions and get in the back row, far out of eyesight. Get your credit and move on.\n"
        },
        {
            "course_name": "Yoga",
            "review_date": "January 28, 2002",
            "review_content": "\nI just saw a review of Baker's Karate class. I would concur with most that was written and apply it to her yoga teaching style. Baker often singles people out in a very non-yogic way. She points to either limitations, successes or phyisical boundaries some people have. She even made someone cry out of embarrassment or pain, probably both. Also, she twists Zen theory to the point that the only thing recognizable is the bowl to sound Om. Spare yourself the frustration/anguish, don't take this course. I can't believe this woman is still here. I know so many people who filed deadly course evaluations.\n"
        },
        {
            "course_name": "Karate",
            "review_date": "December 31, 1999",
            "review_content": "\nIn this course you will learn a handful of rather creepy and relatively useless self defense techniques (e.g. how to totally incapacitate someone who's shaking your hand), nitpicky \"samurai\" ettiquette that in reality has far more to do with late 19th and early 20th Century Japanese nationalism than any real feudal warrior values (if you even wanted those in the first place) and will quickly grow tiresome for all but the most pathetically obsessed Orientalist, a wide range of misinterpretations of Zen that are more often than not tired Plato stuff in disguise, and several different ways of doing irreperable harm to your knees (Sensei Baker's own catalogue of injuries attests to this). Sensei Baker is obviously really into what she teaches (she has studied karate for over 40 years), but it is sad to see such skill directed towards such a mentally counterproductive and physically damaging interpretation of the martial arts. If Japanese martial arts are your thing, I would more highly recommend the rather goodnatured Sensei Matsumura's judo class, which is far less ambitious but probably more worth your time as far as Columbia PE classes go.\n"
        }
    ]
}