{
    "prof_info": [
        {
            "prof_name": "Xiaoyang Zhu",
            "prof_id": 12899,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Chem C3080 PHYSICAL CHEMISTRY II",
            "review_date": "May 24, 2015",
            "review_content": "\nPre-requisites: \nCalc I-III (IV Supplement) While you may not necessarily be doing complicated partial derivatives and double integrations, being able to set them up is something you will be doing quite often\nLinear Algebra (Supplment)Helpful, but you won't be asked to do something more complicated than a 3x3 determinant.\nPhysics III (Supplement) Its offered the semester before this class is and I believe that is purposeful. Having seen wave functions makes the introduction less intimidating. \nCourse: \nPhysical Chemistry II covers Chapters 1-10 + spectroscopy in Mcquarrie. Major topics include the Particle-in-a-box model, harmonic oscillator, The Hamiltonian of the Hydrogen Atom and approximation methods used for multi-electron atoms, LCAO-MO Theory, and Spectroscopy (Ch. 13). Quantum Mechanics is fascinating. Many questions you may have had as a chem student are FINALLY answered...and thats a great feeling!\nClass (Professor Zhu): \nProfessor Zhu really knows how to lecture. I would best describe his teaching style as a balance of humor and clarity. His enthusiasm/passion for the subject matter really shows in each class (and lasted throughout the semester). I wasn't sure what to expect going into this class. It soon became the highlight of my week. He doesn't use powerpoints. He writes/speaks very clearly and is very easy to follow. The material mimics the textbook but I still found class extremely useful in order to see what was emphasized (see Workload), ask questions, etc. His constant jokes/poking fun of classmates created a really interactive/friendly atmosphere and made him very approachable as he soon began to learn a lot of our names over the course of the semester. He truly wants to see each and every one of his students succeed. Overall, he was a much better professor than most \"silver nuggets\" and I can highly recommend him as a lecturer in this subject matter. \nWorkload:\nHH: Weekly problem sets concerning material covered that week in class.\n4 Midterms (20% each/lowest dropped)\nMidterm 1: Ch 1-3 \nMidterm 2: Ch 4-6 \nMidterm 3: Ch 6-7\nMidterm 4: Ch. 8-9\nFinal (40%)\nCumulative: Ch 1-10+13\nExam questions resembled HW problems. If the professor says \"try this out\" in class while discussing something, its fair game on the test. Overall exams were very fair. If you study and keep up with HW you will be fine.\n\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 22, 2014",
            "review_content": "\nProfessor Zhu was great in the beginning of the semester, when he took the time to actually make his powerpoints and explain concepts clearly. As the semester moved forward, however, it was obvious that his enthusiasm for the course paralleled that of his students: very minimal (in a class of 100+ students, less than 50 students showed up to lectures after the first midterm).\nHis exams are slightly harder than the practice problems he provides before each midterm; final was a copy/paste of midterms. Class is curved to a 3.20 (B average). Not a great time overall, but maybe better than the other professors.\nWorkload:\n20% quizzes, 20% each midterm (3 total), 40% final= 120%, but he drops the lowest 20% of your grade. Weekly homework assigned, but not graded.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 17, 2014",
            "review_content": "\nProfessor Zhu was a good lecturer, and tied concepts together in a relatively clear fashion.  However, his powerpoints were rarely mistake-free, which was frustrating during class and when trying to study from notes.  Moreover, he was somewhat aloof on which topics were relevant to the midterms, which made studying unnecessarily difficult at times.  Another drawback was the pacing in the course; we devoted three weeks and the entire first midterm to just one chapter, only to then rush through eight chapters in the remaining two-thirds of the course.  Similarly, midterms varied wildly in difficulty, going from \"too easy\" to \"too hard\" as Professor Zhu tried to find the right median for Columbia students (his words).  Having said that, he does provide a lot of practice material, assigned from the textbook, as well as 10-15 of his own sample problems before each midterm and the final.  The class is doable, but not without its frustrations along the way.\nWorkload:\nThree midterms, and eight quizzes in recitation, worth a total of 60% of the grade.  You can drop either [one midterm and two quizzes] or [all eight quizzes] to make up this 60%.  A final makes up the remaining 40%.  Ungraded homework assignments after each lecture.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 08, 2014",
            "review_content": "\nProfessor Zhu (affectionately known as XYZ) was a pretty basic professor. He speaks English far better than his name had me fearing, and he ran a solid class which covered everything that it needed to cover. He wasn't the best at covering the math-y parts of Chem II, and I found myself teaching myself most of them, but he was solid conceptually (though he just read off the slides some percentage of the time). He's very obviously a great scientist, and he spent the last day of class describing his research with solar cells (which he was quite passionate about). All in all, a decent class which left me without too many complaints.\nWorkload:\nHis tests are fair, non-mandatory (but very, very important for understanding) homework\n"
        }
    ]
}