{
    "prof_info": [
        {
            "prof_name": "Rebecca Kim",
            "prof_id": 646,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 14, 2004",
            "review_content": "\nRebecca is an exercise in trade-offs.\nOn one hand, she GIVES YOU EXACTLY WHAT YOU WILL BE TESTED ON in excellently outlined notes with the important words in boldfaced (with definitions!). She supplements this with a handout before exams detailing what pieces she'll be listen-testing, which words she'll want defined, which text passages she wants you to know, and what essay topic she wants you to write on..\nOn the other hand, she is so boring that I started counting planes taking off and landing at LaGuardia Airport just to make it through her class. Class periods are a lot of listening, a lot of insight delivered by Rebecca, a lot of questions thrown at the class (most of the time met with dead silence), and a lot of naps.\nHer class isn't hard at all. It's just tedious, frustrating, and boring. That's a choice you're going to have to make. If Music Hum is just another GPA-padding requirement you need to get out of the way, take her class. If it's a class you actually want to get something out of, run like hell.\nWorkload:\n3 exams (final is non-cumulative). 1 paper. I think I spent 20 hours this semester on this course (4 hours per exam, 8 hours on the paper) and landed me an A-.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 19, 2003",
            "review_content": "\nImagine the most boring two hours you have ever spent in your life and multiply it by a trillion and this how boring Rebecca's class is. She will give you the lecture notes before every single lecture. Because she know that you will never listen to her. She will ask weird questions and wait for 5 minutes and then say how disappointed she is since noone has the energy and knowledge to answer her stupid questions. Anyway, I have never done the readings or listening assingnments. You only need to work before the exams. Some of the material is interesting. However, the way she presents it makes this class unbearable. It is simply a waste of time. She almost made me hate music. Music Hum is a boring course and she makes it worse. At least her section is not hard which is the only good thins about her...\nWorkload:\nTwo midterms (straight from her notes and 10 listening IDs). Final (you have to memorize 28 pieces - ridiculous). One long and boring concert report...\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 08, 2003",
            "review_content": "\nPoor misunderstood Rebecca!  An obvious product of the \"highlighter and flashcards\" method of teaching, she actually GIVES YOU HER NOTES for each class, and if you don't feel like reading, she puts the most important points IN BOLD TYPE.  I found it took the mystery and inconvenience out of studying.  Yyes, she counted awkwardly when she played blues (\"one... two..., one... two...\"), but she's no-nonsense and gets things done.  She focuses on musical forms, a bit of history, etc., over the \"How did you feel when you heard this?\" approach, but having taken other Hum classes, I was not disappointed.\nWorkload:\nThree exams (all with listening IDs, short answers, a long essay which you can prepare for beforehand), one concert report (wide range of possible topics).  Reading is light, and summarized in the notes as well.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "March 01, 2003",
            "review_content": "\nnot the worst teacher, but not the best either....i think her biggest problem is probably that in my class, we had a group of people with extensive musical background, and she definately directed the class more towards those people than towards those (like myself) with no background whatsoever.  at the beginning i found her incredibly boring, altho towards the end, i found at least her sense of humor (if not her presentation of the subject matter) improved.  \nWorkload:\nincredibly difficult, if you want to get an a in the class, you have to memorize all the terms on the review sheet, as well as being EXTREMELY well aquainted with the music pieces, as she will pick very obscure sections to id.  the concert report is not mad, fairly reasonably graded....and she definately takes into account your background in music and how much you improve in the final grade, which is nice.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 15, 2003",
            "review_content": "\nI blame the class, not Rebecca, whom I thought was nice enough, and actually very funny in a dry, dry way when she let her guard down a bit (her mock ? panic when we crowded into her space to examine a John Cage piano preparation was priceless).  That being said, Music Hum is rotten in that, \"If it's Tuesday, it must be the Renaissance\" kind of way.  And Kim may have added to the problem when she chose a textbook of secondary historical readings instead of the standard \"Listen,\" so we were reading Beethoven's suicide note and excerpts from \"Song of Songs\" instead of material that would have actually aided in appreciating the music, especially for novices.  I was one of the people in the class who did have a music background, and I was very, very thankful that I did--I can't imagine trying to succeed in that class without some basic background on major and minor chords, orchestration, etc.\nWorkload:\nA total, total grind.  Memorize everything on the handouts that appears in the term list and essay list she gives you before the exams and regurgitate it word for word, and start memorizing the songs well in advance.  I took the research paper option (instead of the concert report) and was rewarded, grade-wise, for an honest effort.  Be prepared to take this class as seriously as your other classes if you want to do well.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 10, 2003",
            "review_content": "\nRebecca Kim, although a nice enough woman, runs an awful class. Many of the musical works that you will be responsible for are wonderful, but she successfully manages to make everything horribly boring. Much of the fault lies with the way that Music Hum is structured. Half your class will be comprised of people who know every bit of music theory and the other half will not, leading to imbalanced discussions and high levels of annoyance. Rebecca expects non-musicians to understand enough theory after two classes to be able to understand Shoenberg's 12 tone row...and her \"explanations\"--though she seems to be trying--don't simplify anything at all. Indeed, she gears her teaching to the people who seem to need her help least of all. I did pretty well in her class, so I'm not ranting because of my grades. I was simply disappointed that a class I was looking forward to in the hopes of learning more about music theory and the the history of music was utterly boring and didn't teach me much of anything besides how to regurgitate information on class handouts.\nWorkload:\nOne 8 page paper on a piece of music/composer of your choice. (Don't expect to get any comments/explanation of your grade on it; don't expect her to return the CD you lent her so that she could hear the piece you're writing about; don't even expect that she will read the first paragraph carefully enough to realize that a fact has been stated explicitly--she'd prefer to ask you at the end of the paper why you didn't include that piece of information when in reality that information is right IN THE SECOND SENTENCE!) and 3 non-comprehensive tests which take forever to study for. You won't necessarily understand the material, expecially if you're not a trained musician, but she just wants you to memorize [all your class notes in addition to 23 listening pieces per test] and spit the information back at her.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 25, 2002",
            "review_content": "\nthis woman is bright enough and clearly knows her material, but make sure you bring your pillow to EVERY CLASS. she seems to associate scholarship with a corpse-like demeanor, and i was continually amazed by her complete and utter lack of a personality. granted, the material may be tiresome for some, but i am actually a musician, and she managed to virtually suck the life out of the music studied. someone, please, give this woman some B12 and perhaps some confidence-- maybe her soporific effects will diminish one day.\nWorkload:\nheavy-ish-- i found her exams (3) really comprehensive and had to study my ass off to get a decent grade. she's a stickler for attendance too--\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 25, 2002",
            "review_content": "\nthis woman is bright enough and clearly knows her material, but make sure you bring your pillow to EVERY CLASS. she seems to associate scholarship with a corpse-like demeanor, and i was continually amazed by her complete and utter lack of a personality. granted, the material may be tiresome for some, but i am actually a musician, and she managed to virtually suck the life out of the music studied. someone, please, give this woman some B12 and perhaps some confidence-- maybe her soporific effects will diminish one day.\nWorkload:\nheavy-ish-- i found her exams (3) really comprehensive and had to study my ass off to get a decent grade. she's a stickler for attendance too--\n"
        }
    ]
}