{
    "prof_info": [
        {
            "prof_name": "Gail Gerhart",
            "prof_id": 2001,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "20th Century South African History",
            "review_date": "September 30, 2004",
            "review_content": "\nProfessor Gerhart is a great teacher.  She comes off a little stern, but she knows more about the political history of South Africa than anyone I have met.  The class is challenging but not too hard.  She definately has set answers in mind and her own way of doing things (She wont accept papers if you come to class late).  You get to read some really interesting primary source material and Nelson Mandela's autobiography.  She invites the class to her apartment on Friday nights to watch African docuementaries and to eat food.  She is always available if you need her.  This was the best history class I took at Columbia.\nWorkload:\nAbout 6 short two page papers, a midterm and a final  Class participation counts.  She is pretty picky about dates and details, but a fair grader\n"
        },
        {
            "course_name": "20th Century South African History",
            "review_date": "March 03, 2004",
            "review_content": "\nThe class is great, she is not.  While she teaches the material in a straightforward and and interesting manner, she is not one to cultivate an air of free-thinking in the classroom.  She assigns bi-weekly exercises, in which she asks really detailed essay questions but requires a 500 word limit.  When you turn in the exercise which obviously could not include everything, she grades you down for not including everything.  It's like she wants you to fit 2,000 words worth of content and analysis into 500 words.  Everyone in the class had a problem with this.  Also, when she asks questions in class or on the exams, she asks questions that could result in various interpretations, but you get graded down if you don't give her interpretation.  And, what's worse, when you ask her questions or try to get a feel of what her viewpoint or interpretation is, she's very elusive.  You just have to wing it and guess and hope that when she returns the paper you've guessed right.  Not a great class because of this.  Unless you want to be her clone in terms of thinking, and you have an innate ability to read her mind, don't take her class.\nWorkload:\nnot too bad - but tricky, since you never know exactly what she wants.  Harsh grader because of this.  \n"
        }
    ]
}