{
    "prof_info": [
        {
            "prof_name": "Mikhail Smirnov",
            "prof_id": 601,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Calc IV",
            "review_date": "January 03, 2014",
            "review_content": "\nThis is a fairly straightforward class. If you have a tough schedule and want a clear class, that presents the material in a logical method, I would suggest you take Smirnov. I know that there are things said about his accent and teaching methods, but I found his class very palpable and comprehensible. His examples are very representative of what to expect on the exam. Don't fuck up the first exam, and study hard for the second exam. Overall, you don't want to be the one in the harder Calc IV section while all your friends are in Smirnov. \nWorkload:\nweekly psets 2 midterms and a final.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 02, 2014",
            "review_content": "\nProfessor Smirnov's Calculus IV class is not the most inspiring. His class is usually in the evening so that's a bummer. Also, his voice is a bit monotonous thus can lead to dozing off. Professor Smirnov gives out powerpoints of his lectures. However, these lectures are pretty much verbatim from Stewart Calculus textbook so do as you please. He provides practice exams and has a mini-review session on the class before the exam. He however seems quite eager to get the approval of his students thus is very responsive to constructive criticism. \nOverall, he teaches a fair section of Calculus IV and just wants his students to understand the material and do well in his class. The time section is just a little annoying though. Would recommend this class for people needing Calculus IV but are not particularly interested in the subject matter\nWorkload:\nhomework: one pset a week, can take a significant amount of time, difficulty: easy to med/hard (35%) \nexams: 2 tests, difficulty medium, exams can get a bit long (17.5% each)\nfinal: deceptively harder than exam. (30%) \n"
        },
        {
            "course_name": "Calc IV",
            "review_date": "August 09, 2013",
            "review_content": "\nWhere to begin?\nI know where I'll begin.  I'll begin by telling you, prospective Calc IV students, that the review written about Smirnov on May 29th was almost certainly written by Smirnov himself.  I can hear him sounding out \"deef-i-cult\" as I read it.\nSmirnov is useless.  His lectures consist of him reading directly off PowerPoint slides that are condensed versions of Stewart's textbook.  (I'd argue that, in this respect, Smirnov is no different from the average math professor).  His problem sets (which - by the way, are graded both inconsistently and slowly) are drawn, you guessed it, directly out of the textbook.  Exam questions also come from the textbook.  In other words, you could learn Calculus IV just as well from the textbook alone as you could while using Smirnov's lectures and problem sets as a supplement to it.   \nSmirnov frequently arrived late to class, refused to give the TAs an answer key to the two midterms, answered questions condescendingly, and - in spite of all this - reminded us about a dozen times by email to write a positive evaluation about him.  If you'd like to be exposed to the material that you're meant to learn in Calc IV, skip class, and do practice problems in the textbook, you might consider taking Calc IV with Smirnov.  But if you'd like to have a lecturer with a modicum of interest in his students, take Calc IV with another professor.         \n \nWorkload:\nLight-medium.  I'd recommend doing the practice problems in the textbook.  I think there were around a dozen problem sets, two midterms, and a final.  \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "June 30, 2013",
            "review_content": "\nPROS\n+ Adorable old Russian man. His English is perfectly digestible, and he's so obsessed with getting good evaluations that he'll go far out of his way to address any of your concerns.\n+ Structured approach. C'mon, PowerPoints and hardly any handwritten notes required? Piece of cake! Although everyone else (not exaggerating) had taken advanced physics or stats or analysis before, which really intimidated me, I ended up with the highest grade by sitting down with the PowerPoints a few days before each exam to extract the most important information. Smirnov includes everything he wants you to know on his slides. Extraneous studying might actually hurt you.\n+ Light workload and fair exams. See below.\nCONS\n- Late time slots. He must be the token professor for GS and postbac students, but even as a first-year I signed up for his section because my schedule couldn't accommodate any other Calc IV class. \"Should I take a 6:10 class, or should I kill myself?\" is basically what I was contemplating during registration.\n- Mediocre presentation of the information. Mmhmm, Smirnov is egregiously guilty of word-for-word spewing sentences you can read for yourself. You'll have to work a little harder than you're accustomed to absorb things while you're sitting in class, since you won't be writing much down or seeing concepts presented in new ways.\nWorkload:\nWeekly problem sets that are short (three to five hours) and easy (lots of perfect scores), at least until the intro to complex analysis toward the end of the year.\nTwo midterms and a final. The first midterm is straightforward but easy to screw up, the second one is tough but curved generously, and the final is comprehensive but reasonable.\n"
        },
        {
            "course_name": "Calc IV",
            "review_date": "May 29, 2013",
            "review_content": "\nSmirnov was one of the best Calculus professors that I had. He is very organized. Used slides and gave excellent handouts before each lecture. First midterm was easy, second more difficult. He provided sample midterms and sample final and put solutions on Courseworks. Also he put homework problems and then later solutions on Courseworks and that made my studying easy.\nFollowing lectures was easy because he provided handouts and\nhe additionally did extra examples at every lecture.\nHe is not a native speaker but accent was fine. \nI enjoyed this class a lot and highly recommend it.\nWorkload:\nWeekly homeworks 2 midterms, Final\n"
        },
        {
            "course_name": "Calc IV",
            "review_date": "May 20, 2013",
            "review_content": "\n    I was in his Calc 4 section last semester, which was the worst experience in my freshman year. I was originally in Siegel's section but had to switch out to smooth my schedule. However, Smirnov hardly qualifies as a professor. He reads literally every word on the handout and there never seemed to be anything that he could teach me. Plus, his English level is highly questionable. \n    Despite all these complaints, I think getting an A can still be easy, though I am not sure about the percentage. \n    If you want to learn math, plz plz plz don't go to Smirnov's section, or you would be disappointed in this subject. \nWorkload:\nweekly assignments, quite doable. 2 midterms, the first one pretty easy while the second one sucks a bit. The final can be easy if you go over Stewart well, but the last question is a killer.\nAll homework=35%, 2 midterms=35%, final=30%\n"
        },
        {
            "course_name": "Introduction to the Math of Finance",
            "review_date": "December 27, 2006",
            "review_content": "\nI took this class while taking a Stats 4000 level Probability course and after taking the IEOR Intro to Financial Engineering (FE). Basically, I would have never gotten through it without the Into to FE class and the material from the Probability course.  The undergrads without this background had no clue what was going on.  Smirnov gives a practical view of various markets which is interesting and good to know in industry; except, none of that stuff is on the HW or Exams.  You basically need to read the book to learn the actual material that you will be tested on.  As for the project, I strongly suggest choosing a topic on technical trading strategies (and keep the presentation short, he says 10 min, but he would rather you do it in 6 min, otherwise, you will be cut off before you finish).  I would recommend this class as an easy A for those who have had previous background in quant finance (graduate level); otherwise, you will have a tough time.  \nWorkload:\n4 problem sets that you will need to read the book to finish (none of the material is covered in class) Also, the questions are easy but ambiguous, which can extend the time needed to finish them.  Take home midterm, take home final, in class final, and group project (paper and presentation)\n"
        },
        {
            "course_name": "Introduction to the Math of Finance",
            "review_date": "December 20, 2005",
            "review_content": "\nHaving taken Discrete Time Models in Finance before, I was expecting MoF to be a thorough introduction to continuous time asset pricing. I was sorely disappointed -- both with the material that was taught and the professor. Because there are no advanced probability thoery and differential equations prereqs, many of the results are derived through intuition instead of rigorous math. Indeed, it is necessary to understand how to derive the Black-Scholes pricing formulae from start to finish. Instead, we are pretty much asked to memorize it. Even fundamental concepts such as Ito's Lemma and risk-neutral measures are glossed over. You'll be better off reading the Hull textbook (which is an excellent primer, by the way). My advice is to take this class only as a resume stuffer, and learn the material on your own.\nWorkload:\nApprox. bi-weekly problem sets, take-home midterm, take-home final, and normally in-class final (although this year it was canceled due to the MTA strike).\n"
        },
        {
            "course_name": "Introduction to the Math of Finance",
            "review_date": "September 08, 2004",
            "review_content": "\nSTAY AWAY!!! Extremely difficult course, even for a senior majoring in math - the material is not explained properly. As this class is 95% filled with students in the math of finance grad school program, expect the material to be EXTREMELY difficult. You will receive homework problem sets that are designed for people with several years research exposure in finance. And NONE of it is explained in class. The lectures jump randomly from topic to topic, and most of it is not worth listening to because in won't help you on the midterm/final. As a math major, I got a B- in this class after working my butt off and spending almost no time on other classes that really mattered. And grading is also extremely random - I know people who deserved at least an A- but ended up in the C range (and vice versa)\nWorkload:\nEXTREMELY DIFFICULT unless you have had serveral years exposure to building complex financial models ( a lot of programming, macros in excel, etc. required). If you are an undergrad, be warned almost everyone in the class is a grad student in the math of finance program and has done the above. The material is even above the  TAs so expect to receive no help from them. If you are a math major, like I am (and a senior), expect to receive no better than a B- unless you can tag along with someone in the class who would be willing to let you copy their stuff.\n"
        },
        {
            "course_name": "Discrete Time Models in Finance",
            "review_date": "April 10, 2004",
            "review_content": "\nOK, so you've read the other reviews.  This man does not care about undergrads and he does come late and cancel a lot of classes.  If you are intrested in stocks and want to take a class with a brillent man who will talk to you about them for hours this is the class to take.  I took it cause I heard it was easy and it was- he gave you a practice test just like the test you took (sometimes numbers changed but it was the same).  So... what do you want?\nWorkload:\nnot close to any other class.\n"
        },
        {
            "course_name": "Introduction to the Math of Finance",
            "review_date": "December 30, 2002",
            "review_content": "\nProfessor Smirnov started off as a witty Russian mathematician and ended up...well, we don't know, he was hardly there. And when he was, he hardly taught. During our end presentations at the end of the semester, he fell asleep or left to buy muffins and a coffee. \nEvery other week his lectures were substituted by other Russians in finance, perhaps his neighbors?? They were unintelligble.  But as an undergraduate, the course is not too helpful. Much of the finance you're expected to know, since the class is 98% masters students who have worked in major financial firms. Don't expect anyone, particularly smirnov to explain. But the math side of it is pretty interesting-atleast you get a taste of how math is and can be applied to real world phenomena. \nWorkload:\nHomeworks (~15 questions each) every two or more weeks. Became increasingly difficult towards the end. \nTake home final, in class final, take home final, and final presentation in a group.\n"
        },
        {
            "course_name": "Introduction to the Math of Finance",
            "review_date": "December 26, 2002",
            "review_content": "\nI was very disappointed in this class. He is a really bad professor and itÂ’s not just my opinion most of the people whom I spoke to feel the same way. He has absolutely no concept of finance, he presents the material in a haphazard way, and he does not follow the syllabus nor his notes, or a concept for that matter. He said that Â“there are two basic investment philosophiesÂ” thatÂ’s it, he doesnÂ’t tell you what it is. He basically lacks the ability or the desire to teach.  You never get some of your homeworkÂ’s back and the ones that you get back they mark stuff wrong that is right. We never got out midterms back. I CAN NOT EMPHASIZE ENGOUGH MY DISSAPOIMENT IN THIS CLASS. I DID NOT LEARN A THING.  I can't believe that they let these people teach, when we are paying TOP dollar for tuition. \n"
        },
        {
            "course_name": "Introduction to the Math of Finance",
            "review_date": "December 08, 2002",
            "review_content": "\nHorrid. Smirnov is every student's nightmare of a teacher. First, you shouldk now he hates undergraduates, and doesn't want you in this class. He does everything he can to discourage that (besides making it a graduate level course...) His accent is bearable, but annoying, and his grammar is just bad. More to the point, his lectures are terrible. He cancelled maybe a fifth ( which includes bringing in outside guest lectureres to talk about who knows what). He doesn't follow the text, doesn't follow the syllabus, doesn't even follow his own prepared overheads. doesn't answer questions. does idiotic things like reading verbatim every problem set, like it's the congressional record. Homeworks require knowledge of things not in the text or in class. Divine intervention is pretty much the only solution. He comes late to class regularly. But, he schedules office hours for about 15 minutes before class and is never there. So where is he? Most importantly, you might think that you need to take this class in order to know the math of finance. well you don't learn that here, so don't worry. we didn't learn any math until well into the second month. \nWorkload:\nHomeworks every two weeks, and they are longer than any math homework you've ever had. there is a term-project that you do in groups, and the graduate students all do their projects on topics that have nothing to do with this class, leaving undergraduates in the dust.\n"
        },
        {
            "course_name": "Discrete Time Models in Finance",
            "review_date": "April 28, 2002",
            "review_content": "\nThis class is downright unbelievable. Unbelievable in the sense that on the third day of classes, Smirnov decided to cancel half of the semesters lectures. He would consistently show up to class over half an hour late. When one student asked a question about programming in excel in the beginning of the semester, Smirnov simply stared him down, then declared \"Maybe Columbia made mistake when they admitted you.\" You will wonder why you ever considered taking this clas.\nWorkload:\nlight if you know how to program in Excel, understand esoteric financial nomenclature\n"
        },
        {
            "course_name": "Discrete Time Models in Finance",
            "review_date": "April 11, 2001",
            "review_content": "\nWow, pretty much everything that is wrong with the Math department here summarized in one Professor. He has a limited comand of the language, answers questions by repeating the last five minutes of his lecture verbatim, and gives all the grading to the TA (who is unreachable) who he refers students to in regards to any questions (despite repeated complaints that the TA is unreachable). Ow, he also takes every opportunity to have guest lectures come in or combine the class with one of his graduate courses to save himself the workload.\nWorkload:\n3 homeworks, 1 takehome midterm. 1 final (half takehome)...most of the material on the midterms and homeworks are not coverde in class so have to be self-taught.\n"
        }
    ]
}