{
    "prof_info": [
        {
            "prof_name": "Rebecca Kobrin",
            "prof_id": 3118,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Immigrant New York",
            "review_date": "May 06, 2015",
            "review_content": "\nThis class was a bit disappointing. The premise is great - studying late 19th/early 20th century immigration in New York City and comparing it to current immigration patterns/issues. Unfortunately, Professor Kobrin typically teaches seminars, and this class - her first lecture course - wasn't great. I am already very interested in the topic, but the lectures didn't quite meet expectations - they just didn't feel very in-depth or rigorous. Professor Kobrin kept saying \"next week we'll explore xyz,\" but we just never seemed to get there. The best lectures though were presented by Jessica, the teaching fellow, who is fantastic! I felt that she covered more material within the class period, but still provided more insights into the greater theme for each week (i.e. race, gender, cross-neighborhood interactions) than Professor Kobrin. If you're a self-directed learner who will be satisfied with interesting readings, then this may be the class for you. Otherwise, I'd wait until Professor Kobrin teaches it again as a seminar (or until Jessica teaches a course!).\nThe best aspect of the class, however, was the mandatory volunteer component. Immigrant New York was supposedly Columbia's first service-learning lecture course, and overall that part was a great experience. We volunteered 2-4 hours per month at the Riverside Language Program as conversation partners for students in their English classes (immigrants living in NYC who have been here for less than 2 years). RLP, as we called it, is a fantastic organization and volunteering there seemed like a great way to learn about (and interact with) some of the most current issues that the city is facing (for example, how to provide language learning services to the huge population of newly arrived immigrants; how to make healthcare and education resources available to residents who don't speak English). \nWorkload:\nweekly blog posts, 5-7 page paper, midterm, 10 - 15 page paper, and 4 hours of volunteering per month at the Riverside Language Program.\ntoo much reading\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 21, 2007",
            "review_content": "\nI didn't hate Professor Kobrin's class, but she was by no means anywhere near decent.  I enjoyed the types of readings that we did in class, but the conclusions that we did arrive to were so superficial and sometimes, I felt even wrong.  I felt that the first semester of CC included all of the texts that you've ever MEANT to read and this is why I learned the material in the class, but it wasn't due to her.  \nIt honestly felt like Professor Kobrin did not want to be there, and her teaching really reflected that.  She would cancel class sometimes and continually come to class late and end class early.  Now while in a way this is not a bad thing, it is terrible when our class was continually behind on the work, prompting a mad dash at the end to rush through Hobbes and Locke, two of the most interesting writers in this class. \nI would have thought that Professor Kobrin would have learned to teach CC better since this was her 2nd or third time, but she has all of the marks of a teacher who doesn't.  Incredibly long and boring readings (which became shorter when we complained), combined with minimal class discussion where you can virtually say whatever you want because she does not really check you at all, I began to question whether or not she even knew the texts on a deeper level than sparknotes, since during the midterm/exam reviews, when going over the material, if someone didn't know a question that she posed, she would tell us to go look it up (but it's a exam review! you're SUPPOSED to answer what we don't know).  \nIt is my honest opinion that Professor Kobrin is an incredibly unorganized professor and approaches CC very impersonally yet tries to keep up a good attitude with the class (The best thing about the class was the supplied breakfast at the end). For example, in the syllabus, she states that she wants to give us 2 weeks to do the essays, and nicely hands out the paper topics a month before they're due, which is nice.  But you can hand out the paper topics at the beginning of the semester but if you finish the material in the essay topics a week before the essay is due, you're screwed.  She extended the paper due date very unwillingly by 2 days.\nBut the most telling sign of Prof. Kobrin: She didn't provoke any discussion or argument.  In some of the most thought-provoking books and writers, we all would sit there in silence.\nProfessor Kobrin's mentality to the class definitely plummeted after the course evaluations were submitted, which was even more frustrating. She's by no means anywhere close to being a silver nugget.\nWorkload:\n2 question responses, submitted at every class.  Readings began at 300 pages, then tapered off to about 75-100.  Two essays (5-7 pages), graded fairly, but by no means graded in depth.  Midterm (ID's, 1 essay) and Final (ID's, 1 short response, 1 essay)\n"
        },
        {
            "course_name": "Jews and the City",
            "review_date": "May 18, 2007",
            "review_content": "\nThis was one of the most genuinely rewarding classes I have had at Columbia, no doubt due to the professor.  She was a bit hard to read, but was completely committed to the class and her students.  On all our work, she gave us comprehensive comments.  She brought a vast library of knowledge to the subject of Jewish history, which all the students benefited from, but always took time to explain more elementary concepts to the class when some students were not familiar with them.  She did a good job of getting through the material, although her syllabus was occasionally a bit heavy on the reading.  Classes that were rescheduled due to Jewish holidays she arranged to have in the evenings and ordered dinner for us.  She also frequently brought home-made and store-bought cookies to class for us.  I have seriously never seen a professor so committed to my appetite before.  It was crazy, but it was really sweet too.  I think sheÂ’s new to teaching at Columbia, but sheÂ’s worth taking a seminar with!\nWorkload:\nPresentation of a topic one week, including posting 4-5 questions online and reviewing assigned texts in a short paper of about 1000 words, and a final essay (15-25 pages for undergrads, a bit longer for grads).  Also, the weekly reading is about 200 pages and is neccessary for class participation.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 02, 2007",
            "review_content": "\nHmmm, it's hard to sum up my experience with Professor Kobrin. She wasn't excellent, but she was by no means terrible; I think her class is best described as supremely frustrating. She is obviously smart, but she doesn't really know how to make discussions consistently strong. I think she wanted to make the syllabus seem relevant, but she went too far and didn't force us to closely read the texts. We generally arrived at basic, superficial conclusions, many of which can already be found on Wikipedia or Sparknotes. Still, the semester wasn't all bad. Professor Kobrin was very nice and wanted to maintain a good rapport with the class, and she was good about organizing a few outside events to facilitate this. I think she would be much better in a class she was actually passionate about teaching, and CC is definitely not that. For what it's worth, I don't hate her, even though I didn't like the class.  \nWorkload:\nA lot of reading, but if her approach stays the same (she's new), you can get by with doing half of it. She does her best not to make exams stressful, and they were fairly easy (a few IDs and an essay or two). Two papers at 5-7 pp., fairly graded. Also, each student has to write two 500-800 word responses to pre-assigned texts (although these had little impact on what we actually discussed, and people really didn't read them).\n"
        }
    ]
}