{
    "prof_info": [
        {
            "prof_name": "Ian MacDonald",
            "prof_id": 4580,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "September 06, 2009",
            "review_content": "\nI'd have to say that I was turned off by his deeply philosophical approach. All of our readings were philosophical and, as a first year student who hasn't taken CC yet, it was hard for me to grasp at first. However, once you understand how to read and write philosophically, your writings will be geared towards what he wants. \nAlso, he gives you a plenty of opportunities to rewrite your essays so getting A is  doable (as long as you do the rewrites). His comments are detailed and useful. They get longer if he sees that you put in a lot of effort and sees improvements in your writing. (Could be more than one-page singled-spaced.) As long as you rewrite your essay based on his comments you can boost your essay grade at least by half the letter grade. \nHe is a nice guy and very friendly and approachable. \nWorkload:\nStandard UW papers\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 30, 2009",
            "review_content": "\nProf. MacDonald is a pretty nice guy, but he takes the class very seriously. I found the readings to be fairly interesting, but the \"discussions\" in class to be mind numbingly boring. \"Discussion\" consisted of identifying sources (this went a lot faster if there were footnotes and you didn't actually have to try to find names in the article) and identifying what type they were using the BEAM method. He gives a lot of feedback on drafts of papers, but it is often difficult to give him what he wants. Be careful about drafts--just because you got a B+ on one draft does NOT mean you will get an A or A- on the next one!! Make sure you make EVERY change he \"recommends\" or he WILL give you the exact same grade on the next draft. That said, he's not evil and is willing to help, but the class can be very very frustrating at times.\nWorkload:\nStandard UW papers, 1-3 articles to read for each class, and short (getting progressively longer to work up to the first draft of each paper) written responses to the reading for each class\n"
        }
    ]
}