{
    "prof_info": [
        {
            "prof_name": "Peter Pazzaglini",
            "prof_id": 27,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "October 25, 2016",
            "review_content": "\nProfessor Pazzaglini is the best teacher I've met during my college career. He really listens to his students and cares deeply about their mental and physical well-being more than many teachers I've met. He then adapts his teaching method and the length of reading assignments to meet what he understands as a reasonable requirement.\nFrom the day we first met, Pazzaglini brought his extensive knowledge of Latin and the Catholic Church into class discussions, thereby enriching our understanding of Core texts. As a scholar himself with many years behind him, he is a source of great knowledge in the classroom, allowing him to clearly and confidently articulate complex philosophical ideas.\nHe is most importantly attentive to his students in ways many teachers are not. He notices the small details, the small gestures of friendship students make or the moment a student reaches out to help another in need. He pays attention to these details and accesses a student not only on how she performs academically but also on how well she treats her classmates and herself.\nProfessor Pazzaglini is more than a teacher of CC. He is a teacher of life values of companionship, friendship, and caring. He is a teacher whose lessons transcend the text themselves and enter our hearts and minds. In short, he is a mentor and a leader.\nWorkload:\nNah... Work? You'll love the work if you love the teacher.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 05, 2012",
            "review_content": "\nIn short, Pazzaglini is an extremely interesting professor in class who will expand your knowledge, be reasonable in the amount of reading, and is a fair and relatively easy grader.  The structure of the class consists of reading at home, discussion, and he will read key passages in the text.  The reading is standard and manageable.  The discussion is pretty good but he is not interested so much in the actual meaning of the reading material but rather the connections.  Students who are interested more discussion on the actual content of the text may be disappointed.  He will then proceed to read (or rather assign a student to read) passages from the text.  The two problems here are that he does not discuss the passages and it is also fairly boring.  It would have been better if he highlighted the passages ahead of time.\nThe good things about Pazzaglini are the following:\nHe genuinely cares about learning and his students.  He takes a personal interest in his students.\nHe is an amazing speaker.  After watching him speak for a semester, I think I have definitely improved my own speaking abilities.\nHe is very knowledgeable about the texts.\nWorkload:\nStandard Reading\n2 Essays 33% (4-6 pages and 6-10 pages).  Write about basically anything.  Very fairly graded\nClass discussion and 1 presentation 33%\nFinal 33%.  Straightforward and pretty easy\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 30, 2006",
            "review_content": "\nWhile I'm slightly sceptical of the Dead Poets Society-esque experience that some students claim to have had, I really did have an amazing time in Prof. P's CC class.  In many ways, he is what Columbia promises with the Core but rarely delivers.  He is truly personally invested in the class, and I mean that both in the sense of what you learn and who the 20-some individuals ARE.  As far as CC goes, he takes a more \"big-picture\" approach, looking for connections between texts, across cultures and time.  That, to me, made the class infinitely more meaningful than dissecting Descartes' view of the soul.  That said, you may need to turn to Wikipedia or other (more human) sources to understand the details of Kant, for example, because he may skip over them.  He structures the class based on what he percieves as the ability and level of committment from his students - if he thinks you haven't done much of the reading, for example, he might schedule a midterm, or if he feels the discussions are solid, he won't.  Be warry of getting randomly called on in class - trust me, it can be scary.  So make sure you're following the discussion, even if you haven't done the reading, which gets difficult to keep up with when you are reading a different book for each class second semester.\nAs a person, he is incredible, and he is truly interested in his students.  Make sure to make time for an office-hours visit with him, it can be extremely meaningful.  He also has an amazing network composed of previous students, and if you are lucky he will connect you with an alum or two who could turn out to be a wonderful mentor or a critical contact in your field.  \nWorkload:\n2 papers (very straight-forward and open-ended as far as topics go), maybe a midterm, and an essay-heavy final for each semester.  His tests are very straight-forward, and require good writing more than careful reading.  The reading load is quite heavy though, especially second semester.  My advice: read more of the texts that stimulate you, and Sparknotes/Wikipedia the rest.  That way you'll at least know what's going on in class each day, and you'll have a better knowledge of the works you respond to, which you can use for papers and exams.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 21, 2006",
            "review_content": "\nOK, Pazzaglini is definitely an entertaining lecturer and he clearly cares a great deal about his students and about the class he is teaching. While I was dazzled at first, I like his class less and less with each successive lecture. I went from loving the class and devoting myself to it at the beginning of the year to not caring at all by the end of the year. I became increasingly disenfranchised as I realized that for the most part his class is more flash than substance and he is really infatuated with some of his own BS. That being said, he is a relatively easy professor and truly one of the nicest guys I've encountered at Columbia. I like him a lot personally, his class just didn't resonate with me the way it did with other people. Regardless, I'd still recommend him because he cares about his students and he's much better than most of the alternatives.\nWorkload:\nVery quick pace of reading (he added ten additional texts second semester). Two papers. One semester there was a midterm, the other there was a presentation. Final. All very straightforward and manageable.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 22, 2004",
            "review_content": "\nRemember Robin Williams and his ability to inspire his students in The Dead Poets Society? This CC section was no movie, and yet Professor P possesed the uncanny ability to truly touch those in his classroom. His erudition and sheer passion for knowledge is astounding, and Prof. P. is able to instill a sense of purpose into the souls (and I don't use that word loosely) of his pupils. The one criticism one may have is that close textual analysis suffers as a result of all the added selections and the style of Professor P. You may not walk away with a complete grasp of Kant (which sophomore really does?), but your exposure to great texts and important life lessons will serve you well in the future. This is the kind of classroom experience we all crave for in college, and only a few of us are lucky enough to experience. \nWorkload:\n13 books were added to the syllabus second semester (which may seem daunting), but each selection was superb. Professor P. chooses sections of the texts to enable close reading, and the workload is managable. The number of papers/midterm vary by semester and year, but all are graded fairly. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 21, 2004",
            "review_content": "\nYou know how Columbia stands for progressive education? How it promises four years of mind changing and life altering education? How the core is something that is meant to stimulate and aide our understanding? You also know how 99% of the classes we take donÂ’t represent or fulfill the promise of Columbia? Well, search no more! Professor Pazzaglini is a diamond in the rough. He is the total embodiment of all that is good in Columbia. He has a magic touch and intensity that breathes life into the entire class. His way of teaching is simply amazing. His success in motivation, unprecedented. His love for students and books, simply spine numbing. Who ever interviews professors, should use Prof. P as a template. Whoever wants to know how Columbia should be run, should pick Professor PÂ’s mind. In fact, why is Professor Pazzaglini not our provost? Why isnÂ’t the head of school Prof. P instead of Bolinger?  Bottom line is, we came to this school to learn and enjoy ourselves in the process. If you want to be amazed, and you will be, then hop on the 10 year waitlist to get into this amazing manÂ’s classÂ…\nWorkload:\n1 sometimes two papers... class discussion is very important... 1final sometimes a midterm. A final project which you will love doing...\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 05, 2004",
            "review_content": "\nProf. P is a god!  I have never been moved (I actually cried in a conversation with him) in the way that CC managed to change my life.  His passion and knowledge are unmatched by any other professor in the university.  If you want to learn, and change your way of thought, TAKE THIS CLASS! There is not a single thing wrong with Prof. P. and I will actively hunt down anyone who dares to criticize this genius.  I would give both my kidney's to take this course.\nWorkload:\nNOT BAD!  You don't need to do all the reading... just speak up in class and provide truthful answers to his questions (which are not related to the text).  We only had 1 paper, a special lecture assignment and a final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 04, 2004",
            "review_content": "\nThank god, finally I get something back for my tuition. Prof. P is scintillating, energetic, innovative, and stimulating. One thing guaranteed by taking CC with Prof. P is that you wonÂ’t want to leave or put your books downÂ…youÂ’ll want to write papers, discuss youÂ’re thoughts, and youÂ’ll begin to incorporated the methods of thinking that Prof. P draws out of the literature, as well as his own insights. Nobody this talented has ever been so organized eitherÂ…he rarely goes off schedule, and demonstrates unbelievable preparation. Keep your handouts! There are a lot of them, I know, but the exam questions, and even the two paper questions, are definitely based on the handouts. TheyÂ’ll also take you a long way years after you leave CC. He cares about his students, and wants to meet with them individually as frequently as possible Â– and he cares that you strive to sharpen your knowledge of philosophy Â– so much that heÂ’ll pick on you in class if youÂ’ve been quiet for too long. Even if you donÂ’t have much prepared on whatever topic he jumps to (not always directly related to the text), paying attention during class will help you stay part of the discussion Â– you really have to be quite a drone to not appreciate Prof. PÂ’s passion for the subject. YouÂ’ll realize that almost every sophomore complains about his/her CC class, and so come earn some bragging rights Â– be aware of how historical philosophy relates and provides the foundation for the huge issues of the present day Â– especially in science, heÂ’s a maniac about physics and technology. YouÂ’ll understand so much more about the old and modern world because of his emphasis on current events and the themes they share with the literature. \n\nWorkload:\n2 papers, a midterm, and a final. Although heÂ’ll disagree with you a bit and really throw you in the hot seat one-on-one during class, heÂ’s a good grader, and very complementary. \n\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 09, 2003",
            "review_content": "\nProfessor Pazzaglini is one of the most amazing people and professors I met at Columbia in all four years. His preparation for each class in incredible and his knowledge is so extensive in all areas that CC touches upon. If you allow yourself to get very involved in the class you find that you want to be in class and you actually want to write papers so you can express all the ideas and thoughts you have about the day's class' content. Consider yourself very lucky if you get a chance to take his class.\nWorkload:\nClass is so amazing it doesn't really matter. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 07, 2003",
            "review_content": "\nMaster P is by far the best professor I've had at Columbia.  If you ever thought you'd find yourself sitting in a cafe in the East Village with a professor debating the great mysteries of life, Prof. P is for you.  He is very passionate about learning, life, and the big questions posed by all the philosophers of CC but have never been decidedly answered.  He must have read about half the books in Butler, and probably owns the ones he has yet to read.  Prof. P does an incredible job of linking difficult concepts from the readings with current affairs.  The reading is pretty heavy, especially second semester when he adds about 10 books to the reading list, but fortunately they are all worthwile and well-chosen.  Prof. P is very into linking other disciplines with CC, and he absolutely loves charts and visual representations of abstract concepts.  He is a little intense and tends to scare a few who aren't prepared to put a good effort into explaining what they think things like the \"soul\" are.  If you want to get the most out of CC, Prof. P is the cream of the crop, not to mention someone who is fair, challenging, and genuinely interested in students. If you and Master P hit it off, you'll have not only a friend for life, but a mentor (with good connections).  \nWorkload:\n2 papers, one 10-minute presentation, and a final each semester.  Finals are very straight forward.  Paper topics are always interesting and well-thought out, but he demands quality and effort--only you don't notice because you don't want to let him down.  Heavy reading, but very possible and interesting.  Grades fairly but harshly, and wants something other than a regurgitaion of concepts.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nA teacher who is genuinely passionate about teaching the class. Most of the time, he is giving mini-lectures and turning them into class discussions, always bringing the topic back to the material at hand (an important distiction from just talking about anything, which can be fun but isn't as rich). He is full of ideas, from the interesting (students should learn by teaching, serious solicitation of student ideas) to the quacky (belief in psychic powers). He prepares heavily, and augments the reading list with excellent choices. Some students would say he is self-centered; but while he certainly takes the course where he wants it to go, he is also rabidly interested in knowing what we make of all this talk of the meaning of life. In all, he is a prize CC teacher\".\nWorkload:\n2 papers per semester, graded harshly but fairly; one presentation per semester; Final exam.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nHe's awesome...intense and emotional, it sometimes seems like hes putting on a show for the class. scares some, but draws in all. ties in current events and your personal life to issues faced in readings. the best professor ive ever had, but watch out for the many student presentations, which suck up Prof P's time and put you to sleep.\nWorkload:\nmoderate - 1 presentation, 2 papers, 2 surprise in-class essays (hes easy on them), final and maybe a midterm.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nPeter Pazzaglini: A bit of a Jungian, a bit of everything else, Prof P will blow you away if you connect with his energies right. There have been some misses in his class, but rarely. Reading list is almost a book every class, but his selections are so good its worth it anyway. Class discussion can hit or miss, but its always there and theres always a lot of it. no lectures. two papers and a final and a presentation. Very into the personal side of everything, and relating these old issues to our contemporary selves. Took his class from last year to lunch at the faculty for a 'reunion' last term. This is the reason we have core classes. A must take, but good luck getting in. the waiting list is usually full by the middle of the first semester.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nHe was one of the best professors I had at Columbia. His class discussions were really interesting, and he was able to engage almost everyone. I really felt that I got to know the other members of the class. His take on many of the readings was unorthodox, but he always succeeded in getting us to think and often to open our minds in a new way to a new idea. He also really seemed to care about the students, and made a point of meeting with each one in a comfortable one-on-one environment.\nWorkload:\n2 papers and a final per semester, graded strictly but fairly \n"
        }
    ]
}