{
    "prof_info": [
        {
            "prof_name": "Sidney Rosdeitcher",
            "prof_id": 5869,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Constitutional Law",
            "review_date": "January 02, 2013",
            "review_content": "\nOne of my favorite classes at Columbia.  Professor Rosdeitcher truly cares about his students and despite his busy schedule, scheduled trips to the Supreme Court to meet Justice Ginsburg and to his law firm to meet one of the lawyers arguing the DOMA case before the Supreme Court next year.  He was very willing to help us out with our papers and point us towards the right direction.\nThe seminar started out being discussion based but the Professor soon realized that most of us had no idea what we were talking about even though most people did the readings.  It soon became mainly him lecturing, which was probably better overall since Professor Rosdeitcher is very intelligent, knowledgable, and eloquent, although he does have the tendency to ramble at times (because he gets very excited about certain topics).  Yes it would have been better at times if we could have more discussion about our perspectives and opinions on a case, but it probably would have been pretty hard considering our limited knowledge.  \n\n\nWorkload:\nThe readings were Supreme Court cases, but he crossed out the passages that weren't essential to make things easier for us.  Yes the reading would take awhile since it was quite dense (being Supreme Court caes) and lengthy, but the issues covered were interesting enough that it didn't matter since if you were interested in the topic, you'd do the readings throughly.  Very short midterm that I don't think factored into the final grade and a 25-30 page final paper that was manageable if you planned ahead and used the Professor as a resource.\n"
        },
        {
            "course_name": "Constitutional Law",
            "review_date": "December 12, 2011",
            "review_content": "\nProfessor Rosdeitcher's Constitutional Law seminar was my favorite class I have taken at Columbia. First of all, you should take this class for the field trips alone. In October, we went to the Supreme Court. We listened to three cases being argued, then afterwards we got to meet Justice Ginsburg and ask her questions. At the end of the semester, we went to Professor Rosdeitcher's law firm for a presentation by a lawyer arguing one of the cases on same-sex marriage. Aside from the field trips, the class was great, too. The cases are really interesting, and cover a broad range of topics. Professor Rosdeitcher kept the class current with cases that are making their way up to the Supreme Court right now (health care and same-sex marriage.) He is very mellow and understanding. He has also had an amazing career, and has argued a lot of cases before the Supreme Court, so there is no doubt that he is an expert. Definitely take this seminar if you get the chance.\nWorkload:\nReading is about average for a seminar. One 25-30 page paper at the end. We also did a 2-page writing assignment in the middle of the semester, but he didn't seem to be factoring that into the final grade.\n"
        }
    ]
}