{
    "prof_info": [
        {
            "prof_name": "Henry Pinkham",
            "prof_id": 2416,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Analysis and Optimization",
            "review_date": "February 15, 2011",
            "review_content": "\nI know what you applied math majors are thinking: math 2500 has to be better than math 4061. FALSE. if you plan on taking analysis and optimization with pinkham, well, i am very very sorry for you. this class is IMPOSSIBLE. pinkham cannot teach. the end. choose modern analysis.\nokay details. the analysis part of the class was terrible-- the textbook, which he is currently writing, makes no sense at all, and you will have to depend on google and yahoo answers (surprisingly helpful!) for any helpful hints to the ridiculous proofs that he wants you to spell out. each hw was like 5 proofs, taking maybe 5 hours per proof. the optimization part of the course wasn't too bad, since i could at least find other sources online to help with those problems, and they were generally simple calculations, using linear algebra at the most complex parts. \nmidterm: incredibly incredible. but you can pass as long as you memorize the hundred definitions, theorems, and proofs that he has in his book. same with the final. the key to passing this class is to show up so he knows who you are. im pretty sure that bumped up my grade a little. \nWorkload:\nquiz in the first week, weekly psets, midterm, final\n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "January 21, 2011",
            "review_content": "\nIf the previous reviews were not enough to dissuade you from taking this class with Pinkham, then you clearly do not care about your GPA. You need this class to graduate you say? Forget about it. Graduate a semester late. Do NOT, i repeat, do NOT take this class with Pinkham.\nSaying he is a harsh grader is an understatement. You will have a quiz the second day of class that counts for 5% of your grade - according to Pinkham, this is to 'weed' out people. He will say he gives partial credit but he doesn't really - I got one part of a three part question wrong and he gave me a 0 on the whole thing. Appealing won't help. \nHis lectures are abysmal and have nothing to do with the problem sets which are IMPOSSIBLE. You will be working 30+ hours on each problem set and if you are smart, you will be able to do perhaps half of it. He also didn't assign a TA for the first few weeks so that wasn't very helpful. Neither was the Math Help Room - after multiple unsuccessful trips, I realised that no one there knows any Analysis and even the ones who do will not be able to help you with the problem sets.\nHe also wrote his own (unpublished) book for the course and is pretty proud of it. This book might as well be in greek - he uses lots of complex abstract methods to illustrate what could actually be simple concepts. There are also no examples of concepts in his book which he leaves as an exercise. Expect to learn everything you will need in this course from google (and fail at it). If you are lucky, you will get a C in this course. There were plenty of people who failed the first midterm. \nPinkham is the best argument you will ever get against tenure - avoid him like the plague.\n\nWorkload:\nquiz, 2 impossible midterms, one final. \n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "December 25, 2009",
            "review_content": "\ndon't take this class with pinkham.  it will be the worst experience of your college career.  you'll come out having learned nothing.  from the lectures, you'll wonder if pinkham even knows the math he's teaching.  he has a phd, but it sure doesn't seem that way.  the lecture notes are long, have unworked examples, and are riddled with typos.  in office hours, pinkham doesn't even work out the homework problems...probably because he has no idea how to do them.  on that note, neither does the TA.  and the homework is long and difficult and graded harshly.  finally, the book is a waste of 80 bucks.  we used it once all semester and it's horribly written so you can't even learn anything from it.  unfortunately, you're going to have to teach yourself all the material (and fail horribly).\nand you'll probably have a C to go along with it.  the grading is ridiculously unfair.  pinkham should have never been allowed to teach a mathematics course (or any course, in general).  avoid at all costs.  \nWorkload:\nmidterm was difficult but doable.\nfinal was impossible.  absolutely horrendous.\nthe grading is harsh.  that's an understatement.\n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "December 19, 2009",
            "review_content": "\nanalysis and optimization has the potential of being a very useful and applicable subject but you will get none of this from pinkham. the first half of the course was pure analysis for which there was no book and the only study notes we had were the ones that he typed up. these were not clear at all and the important parts were left as exercises for us to do. in class he only talked about the idea behind the proofs and then expected us to know how to do them with the rigor expected from the 4000 level class.\nthe second half of the course is optimization and we used the pedregal book which is one of the worst and most useless books i have ever had for a class.  you're basically wasting $80. again he typed up his notes but these were useless. by the end of the semester the whole class had no idea what was going on and no one could do the homework ... not even the TA!\nhis grading at least for the midterm was also pretty bad. he didn't curve according to how the class did but according to how he thought we should do. i'm pretty sure that this man won't hesitate to fail half the class or at least give out loads of Cs. after all, he's a dean.\ndon't take a class with him.\nWorkload:\nweekly problem sets that you will have no idea how to do and will need to go to the TA to get help with. towards the end even the ta couldn't do some of the problems. \nmidterm - not terrible if you crammed definitions and proofs from his lectures into your head. \nfinal\n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "December 17, 2009",
            "review_content": "\nPinkham is hands down THE WORST professor I have ever had in my 3 plus years at Columbia. Not only is he rude and pompous (because hes the Dean) but he can't teach. He stumbles around class posing questions that he doesn't give answers too and going off on unrelated tangents, and then expecting us to learn 60% of the material on our own. We had weekly problem sets that were long and harshly graded- often he couldn't even find answers to them or explain the questions, yet we were expected to be able to do them. I spent at least 20 hours a week on this class and still struggled through. The material shouldnt be difficult but he makes it hard-- he never uses concrete examples, instead theorizing without explaining where any of it comes from.  \nAll in all, do not take this class with Pinkham. He cant teach and is a super hard grader who curves around a B-/C+. Not worth the anxiety in any form.\nWorkload:\nWeekly problem set that take at least 15 hours, Recitation, sometimes quizzes, midterm (that has nothing to do with the problem sets) and final\n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "December 07, 2009",
            "review_content": "\nPinkham is absolutely horrible! He is by far one of the worst professors I've had at Columbia. The subject matter was the potential to be very fascination, but Pinkham absolutely kills everything. He throws notes on the board, barely explains anything and is not capable of answering even the most simple questions. Also, he is incredibly capable of putting anyone and everyone to sleep. He is so unhelpful during office hours, it is not even worth going. He assigns problem sets that take hours to complete and does not teach you the necessary material. The TA (Irina) was amazingly helpful, and even admitted that Pinkham teaches horribly. Also, the textbook (Pedregal) might be the worst book out there. If you take this class, be prepared to work your butt off and learn absolutely nothing. Avoid this class if you can...\nWorkload:\nWeekly problem sets that take HOURS and are impossible to complete. Be prepared to spend quality time in the math help room. Midterm, final.\n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "January 23, 2007",
            "review_content": "\nIn my opinion, this man is a horrible professor.  He can easily put people to sleep.  He just talks about examples from the book and doesn't completely go through them but expects us to know how to and puts the hardest questions on the test and fails a lot of students.\nWorkload:\nhorrifying\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 14, 2006",
            "review_content": "\nDon't take Pinkham for Music Hum. He is a really nice guy but has a real knack for making this class insanely boring.  Music Hum is supposed to be one of the best classes at Columbia, but Pinkham really doesn't seem appropriate to me to be teaching it.  Just because you have a big cd collection, doesn't mean you can teach music.  Plus he gives you bad grades on top of it.  Unless you are a music major, you will have no idea what is going on in the class. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 21, 2006",
            "review_content": "\nIf you get Prof. Pinkham, I suggest you switch out NOW. I heard music humanities was supposed to be one of the best courses at Columbia, but taking it with Prof. Pinkham ensures that you will definitely disagree. He not only teaches in an extremely boring way, but he seems to grade essays and papers almost arbitrarily, by simply placing a mark on top of the page without any markings on the entire essay to indicate any reason as to why you deserve this grade.  Also, after giving listening homework, he would sometimes surprise us with listening quizzes wherein he would play the song and expect us to recognize it and say something about it, seemingly easy, although sometimes he would play a different version of the piece than what was assigned and expect us to realize that they were both the same pieces. He is extremely aloof and almost indifferent to teaching, never really acknowledging or getting excited when a student would contribute his or her thoughts. His midterm and final were extremely hard to study for, they consisted of him playing pieces we had listened to throughout the semester, and some we had not, forcing you to always second guess whether or not you were identifying a piece you had already listened to or  a new one. All in all, a terrible professor who may care for music but not for teaching music. His class made me wonder, why is he even allowed to teach this course??\nWorkload:\nAssigned reading and listening every night with occasional pop quizzes, a three page opera report and a ten page research paper which he basically said, \"write.\" He never gave any clue as to how he wanted this paper done and if you ask to meet with him outside of class, he was always slightly reluctant. Definitely not an accessible professor to say the least. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 01, 2006",
            "review_content": "\nPinkham is actually the dean of the graduate school for arts and sciences, which means that he doesn't have the kind of time to devote to music hum.  Furthermore, while he may have an extensive music collection, he can't seem to figure out how to teach.  If you have a background in music theory you may find his lectures more understandable, but if not, he can be confusing.  His lectures are disorganized, and he doesn't focus on the interesting things, like music history or culture.  Try to get into a better section.\nWorkload:\n2 short papers, a midterm, a long final research paper, and a final.  He grades on a generous curve, but just because people do so badly.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 27, 2005",
            "review_content": "\nIf you've been assigned Music Hum with Dean Pinkham, I would suggest that you head straight to the Core Office and find a way to switch out! Dean Pinkham is a math professor and a Columbia administrator. While he is a music connoiseur--as evidenced by his constant allusions to a childhood spent at the Opera and Classical Music concerts with his parents, and by his enormous collection of classical recordings--he appeared to have no idea of how to teach the class, and he was typically unable to answer our questions. He doesn't teach music history, and he doesn't teach what's in the book. Instead he stumbles through the class on tangents that never seem to go anywhere, and then plays recordings we hadn't listened to for homework. And of course, he loves to put these recordings that you can't hear at home on the final and the midterm! Dean Pinkham's manner in class and in office hours was generally curt, and expressed little connection with our generation. He expects students to see the immediate relevance of gregorian chant without explaining why it's important. And he never talks about the history surrounding the music--the composers lives, the politics of the time, the repercussions the music had. Instead he hands out musical scores for every piece we hear and expects the class to understand the musical notation. Only the accomplished musicians in the class had any idea of what was going on in this course. On the whole, I can honestly say I learned nothing from this class. And going to it was a generally painful experience. \nWorkload:\nListening and Reading assignmetns for every class (sometimes followed by pop quizzes), a midterm, a 10 page research paper (with no clear guidelines), 2 concert reports, and a final exam. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 24, 2005",
            "review_content": "\nI pretty much agree with the last review except on a couple things. He does talk about the music in ways that you may have not discussed in class, but he will not expect you to know this for exams, so don't worry about it. That said, he is very passionate about the music and brings in tons from his personal collection so that you're not stuck with only what is in the Listen book, which can be pretty meek. He also usually brings in copies of scores/text to whatever we listen to so you have more resources to understand the music. He encourages opinions of the music above all, so  you don't have to do much research for the papers.  All around he is very accessible and lenient and if you have an inclination toward music he will definately make the class worth going to (aside from the fact that he takes attendance so you have to).  \nWorkload:\n1 opera, 1 concert report, max 3 pages..basically your opinions. 1 8-10 page paper on topic you can choose from several given. 1 midterm -5 ids, 1 final - 10 ids,  and maybe an essay\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 19, 2005",
            "review_content": "\nI think that the previous reviewer was pretty on target with Prof. Pinkham. He is a really nice guy, though aloof. I think the problem with him teaching this course is that he is not primarily a music teacher, more of a music conoisseur, and so the teaching is much more general and less specific than a student not well emersed in classical or baroque styles would want. I think that in general his teaching skills leave much to be desired, and classes were mostly just listening to music that was assigned, as he asks who has an opinion (rarely anyone does) and we all kind of sit there in a awkward silence as he moves on to the next piece. A lot of this course is self-teaching, being able to recognize a song and saying something about the song and where the period is from. In theory, you really don't need to attend class, though he does take attendance before every session. I have to stress though, he is genuinely a nice person and though he is not too available for office hours, and not too receptive to any \"wrong\" ideas that you might present in class, he is very pleasant. \nWorkload:\nA chapter or two to read everyday and a few songs to listen to. One opera report (three pages) and one concert report (three pages). Also culminates in a 10 page research paper on basically anything. Be prepared to basically make up your own topic and your own thesis on generally anything covered in the entire course. In this way, the paper is not difficult at all. Also, towards the end we would have pop quizzes on identifying homework pieces and also bring in thoughts for the day on which piece we liked best. One midterm and one final. Both consisted of one or more short essay questions mostly about the history of music and identifying pieces that we may or may not have heard in class. This part is definitely challenging and if you are not up for intense musical study, do not take this class. You basically have to be able to recognize about 30 pieces and say something about them. Also, because he also plays pieces you might not have heard before, it makes it all the more difficult.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 11, 2005",
            "review_content": "\nProfessor Pinkham is actually DEAN Pinkham, the dean of GSAS to be exact, and a respected math professor to boot. You will ask yourself, \"Where the heck does he get off teaching Music Humanities?\" No one knows. However, if you happen to get him, stick with it, as long as you have some sort of background in music. Although he is a genuinely nice guy, and sincerely likes the subject (you can infer his personal music collection is quite extensive from all the CD's he brings in), teaching music is not his forte. Many students who had no background in music dropped the class because he would often throw in terms like \"fermata\" and \"key signature\", etc without actually having taught them. Don't worry, he doesn't get very in-depth with the musical terminology...to someone who was in band in high school, no sweat. If you have no background in music at all, consider dropping the course. Also, I hope you like Gregorian chant, because he must have spent 4 classes on it, while leaving only one for jazz. \nIn a nutshell, keep him if you have a basic background in music and are looking for a pretty easy grade, drop if you have no background in music or are looking for one of those music hum professors that's going to inspire you to major in music. I hate to criticize his teaching though... he really is a nice guy. Somewhat aloof sometimes, but a really nice guy. \nWorkload:\nPretty basic... reading from Listen and Music in the Western World. Towards the end of the semester when he saw some people weren't listening to the pieces, he started making us hand in a \"thought of the day\", which is basically 3 sentences on what you thought of any piece that was assigned (this shouldn't be considered a burden). Two concert reports (3 pages) graded on check, plus, minus basis, a 10 page final paper, a midterm and final. The midterm and final were comprised of about 5 pieces which you had to identify and describe, relating them to what you learned. Again, having just a simple background is music is crucial. He doesn't teach the very basics. \n"
        }
    ]
}