{
    "prof_info": [
        {
            "prof_name": "Partha Chatterjee",
            "prof_id": 1379,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Social and Cultural Theory",
            "review_date": "January 08, 2014",
            "review_content": "\nProfessor Chatterjee is brilliant and a fantastic lecturer.  The readings could be at times a bit dense, but Prof Chatterjee coherently explains the material in his lectures.  He relies heavily on powerpoint in class, which are extremely helpful in writing your weekly response paper.  The in-class midterm is very easy if you attend the lectures.  The take-home final is 50% of the grade which is a little nerve-racking, but it is pretty straight forward--choose two essay questions (1200words each) out of five.  His grading is also a bit deflated (e.g. A+=100-98, A=97-95, A-=94-92, etc.), but staying in the A-range isn't very difficult.  \nTA Guangtian Hs is an angel.  He's approachable, coherent, and really wants everyone in the class to do well.  His sections before the midterm and final are especially helpful.  \nOverall, great class, great professor, great TA!\nWorkload:\nNormal amount of reading, weekly (graded) response paper, in-class midterm (30% of grade) and take-home final (50% of grade)\n"
        },
        {
            "course_name": "Nationalism",
            "review_date": "January 13, 2012",
            "review_content": "\nIf you're interested in the subject, take the class. It wasn't the most exciting one I've taken, but there wasn't anything to complain about either. Prof. Chatterjee knows his stuff, and is always articulate and open to discussion. The texts themselves are really interesting for the most part, and it will change the way you think about Nationalism and how you view contemporary issues. Think the best advice would be to pick a TA who suits you. \nI can't vouch for the other TA, but Sophia was great. She's organised and on top of her stuff, almost to a fault, but she keeps discussions light and will make sure difficult concepts are broken down and argued thoroughly. She will push you to think past superficial comments, which keeps things interesting too. \nNo regrets taking this class. Liked the subject, professor, and TA. \n\nWorkload:\nHeavy, but only because it's weekly. 500 words responses every week on all texts, and a 20 page final paper. \n"
        },
        {
            "course_name": "Nationalism",
            "review_date": "May 13, 2006",
            "review_content": "\nI don't want to gush because then people will not take this review seriously.  Partha Chatterjee is, simply put, a fantastic professor, and for so many reasons.  1) You do the readings and then Chatterjee has a way of boiling down the concepts and making them so much easier to grasp all while raising issues you would not consider on your own.  Just a wonderful lecturer.  2) He's clearly brilliant, distinguished in his field, and without much spare time, but for an hour and a quarter 2 days a week he makes you believe that the class is the most important thing to him.  3) His writing is often the most impressive stuff on a subject but he doesn't ram his own work down your throat -- we read one book and one article by him out of the 5 books and dozens of articles over the semester.  The list goes on and on -- there's tons to say about Chatterjee, but there's limited space here.\nThis class is not easy.  It definitely brough out what I thought was my best writing, but he (and the TA) expect a lot from the papers.  But if the topic intrigues you at all, you will probably love the class and the prof.  I think I came away from this class with both a grasp of the information and also the methodology behind this field.\nSince this class does address hot-button issues of what constitutes a nation and how nations are constructed and conceptualized, you will invariably get holier-than-thou, soap box standing, pontificators whom you may or may not want to punch in the face.  If you can laugh off the fact that they use classtime as a pulpit for their radical commie views and concentrate on the substantive and wonderful things that Chatterjee says each and every day, you will love this class and it will definitely be up there with the best classes you've ever taken here.\nWorkload:\nweekly readings, some long and some short. midterm, 2 5-page papers. Final -- either an in class similar to the midterm or a take home.  The take home is 2 papers -- difficult but definitely worth it b/c you get it out of the way.\n"
        },
        {
            "course_name": "Advanced Studies in South Asian Culture, Society and History ",
            "review_date": "December 23, 2005",
            "review_content": "\nBreathtaking stuff for an undergraduate. Left me wishing I had set aside more time during the semester to do the readings and go to office hours. For any undergradutates interested in going to grad school for anthro/history this class will def. push you in the right direction. I think I'm the only undergrad to have taken it...  the stuff we talked about is still kinda zinging in my head... Oh no I have to go write another essay about it now in order to not go insane ... It's a monster!\nWorkload:\nA monograph a week, at the cutting edge of a field that many see as the cutting edge of both anthro and history. \n"
        },
        {
            "course_name": "Introduction to South Asian History and Culture",
            "review_date": "March 02, 2004",
            "review_content": "\nI agree with the second reviewer. Prof Chatterjee provided deep an insightful comments on the various texts we read, raised  issues that weren't immediately obvious from a first reading of the texts, and argued on both sides of the issues raised in class, leaving us to give our own opinions in papers and such: basically, he did all the things a good professor should do. The class was arranged by topics, something that was most definately emphasized on the syllabus. I do have previous knowledge of South Asia, and I found that this class, far from being  elementary or boring, gave a depth of inquiry into the four topics discussed not found in other South Asian history classes which have so much ground to cover. If anything, previous knowledge of South Asian history was helpful. The four topics were \"Nationalism and Modern Statehood\", \"Modernity and Religious Reform\", \"Modernity and Women\" and \"Modernity and Caste\". (Lots of discussion about modernity) Basically the course was about the production of opposing categories like modernity and tradition in a colonial context, and how these categories were worked through different areas like gender, religion, caste and the state. I really recommed this class to anyone actually interested in South Asian history rather than just getting rid of their core requirement. \nWorkload:\nNot at all bad. 2 papers, 5-7 pp, a midterm (that was slightly a joke, it was so easy), and an interesting take home final. The TAs did most of the grading, I think.\n"
        },
        {
            "course_name": "Introduction to South Asian History and Culture",
            "review_date": "January 17, 2003",
            "review_content": "\nI felt compelled to write in response to the previous review.  After 3 1/2 years as a Columbia undergrad, I thought that this class was one of the most interesting, informative, and inspiring courses that I have taken (let alone a major cultures A course).  While Prof Chatterjee does not have a set lecture, I thought he did a great job of flushing out the basic issues of south asian history.  More importantly, Chatterjee's  \"wanderings\" give details and insight that a student will not find in a textbook or a traditional lecture.   Further, the significance of the course's structure--divided along major south asian issues rather than a linear progression--was stressed plenty of times throughout class and definitely explained throughout the readings.   Prof Chatterjee is very accessible in and outside of class--a rare quality for prominent anthropology dept faculty.  I definitely recommend this course to anyone who has some knowledge of south asia and who wants to take a critical, seminar-style course with a world-class professor.  \nWorkload:\nLess than the average list A major cultures class.  Fair amount of reading.  2 essays, midterm \"quiz,\" and take home final.\n"
        },
        {
            "course_name": "Introduction to South Asian History and Culture",
            "review_date": "December 24, 2002",
            "review_content": "\nWhile Professor Chatterjee is a brilliant man, and has a huge depth of knowledge about South Asia, his lectures were totally disorganized (he lectured without notes), and he had a tendency to go off on long tangents and not come back to the original subject.  The structure of the class was interesting, in that it was not a chronological history but rather a history of issues, but Chatterjee did not emphasize this structure at all, until the last day of class.  The TA does all the grading and Chatterjee barely looks at the papers and midterms.  Overall, an interesting class, but not recommended, esp. if you have previous knowledge about South Asia.  Chatterjee teaches difficult concepts at a very basic level, which is not helpful at all.  He also fields far too many questions from students who are unable to keep their mouths shut for 5 minutes.  Interesting but not worth the time or frustration.  \nWorkload:\nToo much -- lots of reading, 2 (supposed to be 3) papers, a midterm, and a take-home (12 page) final exam.  \n"
        }
    ]
}