{
    "prof_info": [
        {
            "prof_name": "Todd Davis",
            "prof_id": 2153,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 11, 2009",
            "review_content": "\nUnfortunately Todd Davis says he won't be returning to Columbia after this year, so I guess this review is somewhat pointless, but he still deserves CULPA fame.\nTodd was undoubtedly the BEST professor I have had at Columbia so far.  His grading was a bit harder than most LitHum teachers, from what I gathered from talking to friends,  but you really get alot out of his class, and it's not too hard to do well if you put in the effort.  His background in ancient Greek texts makes for really interesting discussion in the first semester, and once in a while he'll share one of his stories about his year in the Amazon, which immediately captures everyone's attention, no matter how tired they are.  His policy is that he will put in as much work as you do, and he follows it religiously.  If you seek his help on anything, he is more than willing to meet with you (multiple times if necessary), and he makes an effort to get to know everyone as individuals.  \nDefinitely a professor I hope to keep in touch with even though the class is over.\nWorkload:\nTends to assign more writing than most other LitHum professors, but he lightened it in the second semester.  It's really not too bad once you figure out what he looks for in essays, and it really only helps you in the end.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 04, 2009",
            "review_content": "\nFantastic! The best professor I have ever had. Enlightened, knowledgeable, passionate, and no nonsense.  \nWorkload:\nStandard for Lit Hum, he expects a lot but you get a lot. \n"
        }
    ]
}