{
    "prof_info": [
        {
            "prof_name": "Esther Pasztory",
            "prof_id": 1222,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Aztec Art & Sacrifice",
            "review_date": "May 14, 2011",
            "review_content": "\nThis was an art history class, but we all agreed that the approach was overwhelmingly anthropological - you learn about the entire Aztec society structure, government religion, economy, and the whole damn centuries-long conquistador affair. You spend maybe every third day on an \"artistic\" topic. But you know, it felt very logical to do so. This is essentially a dead culture, so all the assumptions you bring with you to a regular Eurocentric art history course are of no help.\nLook. There are three experts in Aztec studies alive in the world. Pasztory is one of them. She's obviously incredibly well-versed in the issues, and always has some transcendental reply to whatever your comment, intelligent or idiotic, was. Almost every discussion was genuinely interesting (I know. But really). She's sort of bluntly unfriendly sometimes, but I would attribute that to a generation gap rather than anything personal. You absolutely have to do the readings. You have to do the homework. You should probably go to class as much as possible (and usually you get out early, anyway). But the only really relevant question to ask yourself is, \"Do I want to take advantage of one of the Holy Trinity of Aztec experts in the world before either she or I kicks it?\" I can't answer that for you.\nWorkload:\nOne-page response to weekly readings, two ten-minute oral presentations (with visual accompaniment, which is always more of a pain in the ass than you think it's going to be), one final 10-15 page paper that's quite easy by the time you get to it, as almost all of your research is done during the semester.\n"
        },
        {
            "course_name": "Andean Art and Architecture",
            "review_date": "July 29, 2007",
            "review_content": "\nI expected this class to be a whole lot worse than it was.  The workload was fair, and although the lectures were dry at times, they were not completely unbearable.  The worst part of the class were the discussion sections which were usually an utter waste of time.  Pasztory knows so much on the topic it is amazing, and she organizes the class well making this otherwise obscure topic a little easier to organize in your head.\nWorkload:\nTotally reasonable: Midterm and Final (slide testsreview_contentk review_content, Paper.\n"
        },
        {
            "course_name": "Pre-Columbian Art & Architecture",
            "review_date": "January 08, 2006",
            "review_content": "\nWhile Prof. Pazstory is not extremely charismatic, she absolutely knows her stuff and teaches in a very methodical and straight-forward way.  She never rambled on and always connected facts to the bigger scheme of things.  I am not an art history major, and I wasn't really even interested in Pre-Columbian art, but I found her lectures to be engaging and informative.  The reading is light- there are some books on reserve at Avery- but attending the lecture is of the utmost importance (since there really is no textbook that is used).  Also, the TA's are fabulous and are willing to help.  Overall, an amazing and enlightening class.  Pasztory is a wonderful professor.  \nWorkload:\nKeep up with the readings as they should be referenced in the exams.  Midterm.  Final, with take home paper, which was really easy.  \n"
        },
        {
            "course_name": "Pre-Columbian Art & Architecture",
            "review_date": "January 16, 2004",
            "review_content": "\nAlthough Professor Pasztory does seem to know just about everything concerning the Pre-Columbian world, her lectures are by no means \"riveting.\" In fact, that is about the last word I would use to describe them. \nThe saving grace of the class is the fact that the material is so incredible and different. It is a frustrating experience to sit through a class which examines works as exciting and unique as those of the Pre-Columbian world, but to have a professor who cannot remotely reflect this excitement. Pasztory's presentation is so hurried and unvaried that it is hard to really allow anything she says to sink in. I would still recommend the class to anyone interested in Pre-Columbian art, but it is largely a disappointment.\nWorkload:\nLight - midterm and final (both straightforward slide IDs and comparisons). There is also a short paper to be handed in on the day of the final exam.\n"
        },
        {
            "course_name": "Pre-Columbian Art & Architecture",
            "review_date": "December 16, 2003",
            "review_content": "\nThis class fulfills either the second half of the major cultures requirement or the pre-1750 lecture requirement for architecture, and it was a good class - in the beginning it looked to be a dull lecture, but Professor Pasztory is incredibly knowledgeable in the subject.  Also, most people tend not to know as much about pre-columbian art  as about other ancient culture's, so that made it more interesting.  It's mostly a lecture class, though you can ask questions (she's not as cold as some reviewers say).  Pasztory is incredibly organized and has a set agenda for each class - just make sure to be there, since she moves quickly and can cover as much as a culture per session.  There's reading, but it's not really too pertinent...just go to the lectures and you'll be fine.\nWorkload:\noccasional reading, midterm and final, with final paper tacked on (pretty much your entire grade is in tests)\n"
        },
        {
            "course_name": "Pre-Columbian Art & Architecture",
            "review_date": "May 04, 2003",
            "review_content": "\nThis woman is the most engaging lecturer I've had in my 4 years at Columbia.  She is an expert in her field and is very comfortable speaking in front of the class.  While I wasn't sure if the subject matter interested me (I was only taking the course to get my major cultures requirement out of the way), Pasztory presented the material in such a way that really grabbed my attention, and held it for the entire semester.  This course was truly unique and I recommend it to anyone who is at all interested in being introduced to the way of life of a number of ancient cultures.\nWorkload:\nMidterm and Final (with a final paper composing part of the exam).  Exceptionally fair slide exams.  Just go to class and you'll be fine.\n"
        },
        {
            "course_name": "Pre-Columbian Art & Architecture",
            "review_date": "February 14, 2003",
            "review_content": "\nProfessor Pasztory is recognized as a leader in the field of South American Art History and she deserves to be. This is one of those times when we are lucky to have access to someone as knowledgable and broad minded as Prof. Pasztory available to us and I recommend fellow students not to overlook this course. One is taken through ancient Meso- America and South America at breakneck speed. Do not be deceived by the disorganized first impression Prof. Pasztory gives, her lectures are well-organized, focused and detailed (dense).  She is clearly passionate about the subject matter, and her unexpected, quirky humor can often be missed because it surfaces unexpectedly. It is true, there are no discussions, as a matter of fact, she gives a puzzled \"It speaks?\" look when someone asks a question and looks as if her rythmn has been interfered with. I found the lack of \"discussion\" a blessing, because her lectures are in a word: riveting. Pasztory gives all current theories even-handedly and does not shove her personal theories on the students. I respected that. A LOT of material is covered in this course, but many were left wanting more. Quite a few students went on to take her course on the Andes this semester (I wish I had.) There is no image data-base so you must attend the lectures. There is a reasonable amount of reading at Avery Library to augment Pasztory's lectures. The TA sessions were helpful (yes there is a weekly scheduled TA session) only if you had done the work. The TA was not there to spoon feed students the readings, but to answer questions and discuss the subject matter. The TA's were accessible and bent over backwards to help..both of them went the extra mile and both clearly share Pasztory's delight in Pre-Columbian Art and History. Pasztory is a superb asset to Columbia University. Take advantage of her availability to us.\nWorkload:\nStudy for the exams! That's it. Your mid-term and final ARE your grade. (She says she won't \"trick\" you on the exams and she doesn't. They are straight forward and no-nonsense, just like Pasztory) Moderate reading. Go to all the lectures. Read her book well. If you do the above, it is hard to not get an A in this course, and have a great learning adventure to boot.\n"
        },
        {
            "course_name": "Pre-Columbian Art & Architecture",
            "review_date": "October 15, 2002",
            "review_content": "\nProf. Pasztory is extremely intelligent and her lectures are concise and, frankly, brilliant. However, be warned. Her lectures are not seminar-style things -- they are true lectures, meaning that she will talk a lot, and you won't get to. That isn't to say that she doesn't throw out a question to the class every so often, but most of the time she keeps the floor. Since she's brilliant and knows a crapload about her subject matter, it isn't really a problem unless you're one of those people who can't sit still for an hour and forty minutes. The class IS an art history class, which means that the lights are going to be off a lot and slides are going to be shown. Don't fall asleep, though. This professor's got a lot of things to say, and Pre-Columbian art (that is, Maya, Olmec, Aztec, Teotihuacan, Inca, etc) is difficult to interpret if you don't know something about it already.\nWorkload:\nPasztory gives a vague outline of the cultures she's going to cover during the semester. This outline is by subject, not by date, so there's an assigned reading about every three weeks or so. Most of the stuff is from Avery Library, so don't look for it at Butler. There's a midterm and a final. I'm halfway through the semester and we haven't had a paper yet.\n"
        }
    ]
}