{
    "prof_info": [
        {
            "prof_name": "Joan Ferrante",
            "prof_id": 918,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Dante and Medieval Culture",
            "review_date": "August 19, 2003",
            "review_content": "\nMs. Ferrante tried to cover an enormous amount of material in this class (basically, all of Dante's oeuvre) which resulted in a very fast pace which left little time for discussion. Not that discussion is all that feasible in an 80 person class, anyway. \nShe is obviously incredibly knowledgeable and seemed delighted to share that knowledge with us. Her enthusiasm was contagious, I felt, and despite the difficulty of writing fast enough to keep up with her lectures, I felt I not only learned a great deal but developed an interest in Dante beyond my expectations.\nWorkload:\nReasonable - midterm, short paper and final for undergrads, longer paper and no exams for grad students.\n"
        },
        {
            "course_name": "Dante and Medieval Culture",
            "review_date": "May 29, 2003",
            "review_content": "\nThis lady obviously knows everything there is to know about Dante, but that just makes her a walking version of Charles Singleton notes on Dante -- it doesn't make her a good literature teacher.  In my opinion, she was horribly inept at making you feel like the Comedy was a beautiful or important text, much less at thinking about why and how that might be true.  Also, she didn't have a reading schedule and often got bogged down on a single canto; then, in the next class, she would advise us that we really had to keep the questions to a minimum or we wouldn't be able to finish Paradise.  This was plain stupidity, and sort of insulting, since she seemed not to realize that the reason for our scheduling problems was her complete unwillingness to make a schedule.  She gave a lecture on Dante's Convivio, which she didn't even ask us to read, and one lecture on Dante's Monarchia, which we never referred to again and which we were never asked to write about.  I learned nothing from either of these lectures.  In sum, she is surprisingly clueless about how to design a class, and surprisingly bad at teaching literature.\n"
        },
        {
            "course_name": "Dante and Medieval Culture",
            "review_date": "May 18, 2003",
            "review_content": "\nStay away.  Yes, Professor Ferrante is personable and obviously loves the material.  She is an enthusiasitc lecturer and has a very open, refreshing attitude towards student questions.  BUT,  I ended up loathing this class.  She does not have a syllabus.  Although it wasn't hard to keep up, since we plowed through the Divine Comedy, the class expectations were not made clear beforehand.  She'd kind of mumble about the paper at the beginning of class two weeks before its due date (which she shifted around a few times) causing MUCH confusion.  I understand professors' loathing of administrative detail, but I felt it was not respectful of what the students need.  I'd say this was my general complaint about the course.  Ferrante wasn't sensitive to the fact that at the end of the day, we are students taking her class.  She seemed content to give her lectures to admiring listeners, and didn't want to mire herself in the irksome, mundane aspects of teaching.   Did I mention she refused to make a syllabus when asked?  We need to know the exact date of the midterm.  We need to know the format of the final, not just a vague: \"Oh study everything and you'll be fine.\"  Granted, Professor Ferrante is not a particularly difficult grader, so if that's what you're in the class for, then take it.  And as the other reviewers stated, she does grade everything herself, but can any of you READ her comments or understand the numerical system?  What's wrong with good old As, Bs, and Cs???  And the LECTURES.  I feel like I learned all I learned about the Divine Comedy by reading it and by reading the notes in the Mandelbaum version.  Anything that Ferrante may have added beyond what was contained in the textual notes was lost in the harried flurry of her lectures.  It's impossible to catch what she's saying, and I felt that she pitched the level of her lectures too high: as in, she assumed we knew about medieval culture and the major historical figures, so would lecture accordingly, which made for confusing lectures.  She also gives her own very particular political interpretation of the Comedy, so beware of that as well.  All in all, an unenjoyable class.  Just read the Comedy on your own.\nWorkload:\nMidterm and final.  Plus 12 page paper on \"whatever you want to write on, as long as it includes Inferno, Purgatorio, and Paradiso.\"  Um, how are we supposed to include Paradise in our paper when we haven't finished covering it in class??  (And yes, this means she doesn't give paper topics.)\n"
        },
        {
            "course_name": "Dante and Medieval Culture",
            "review_date": "April 23, 2003",
            "review_content": "\nI'm not quite sure how useful this review will be, since Prof. Ferrante (or Crazy Joan, as my friends and I called her) will only be teaching seminars after this semester. This class was very odd in that there was hardly any reading, but every class period was pretty much Prof. Ferrante discussing every single detail about the Divine Comedy and Dante possible. She goes incredibly fast, so there's no point in even trying to write everything down. The midterm was graded on a very strange scale (1 to 9), and there was one final 12-15 page paper for undergrads, as well as a final. Yes, we didn't have a syllabus, but she pretty much said before we began Inferno to read five Cantos per class (not that hard to remember) and she clearly explained what she wanted on the midterm and the paper. Prof. Ferrante also graded *everything* herself, and how often is that going to happen in an 80 person English class?\nWorkload:\nNot much: five cantos per class, midterm that was graded by Prof. Ferrante, and she's not a difficult grader. 12-15 final paper on at least two parts of the Divine Comedy, and a final. Go to office hours - she is incredibly understanding and willing to help!\n"
        },
        {
            "course_name": "Dante and Medieval Culture",
            "review_date": "April 22, 2003",
            "review_content": "\nohmigod, she's smarter than you!\nexpect aching wrists (it is impossible to take notes in this class)...her copious information is impressive but overwhelming. the lecture will go over and you'll never be quite where you should. chances are you won't enjoy the poetry as you thought you would...this class is more of a history lecture than anything else. that's not to say her lecturing is irrelevant...it's just that it would've been nice to dig deep into the poem, the art, rather than all of Dante's drinking buddies (and enemies).\n"
        },
        {
            "course_name": "Dante and Medieval Culture",
            "review_date": "April 22, 2003",
            "review_content": "\nDespite being very interested in Dante's oeuvre, I cannot overemphasize how disappointed I am with this course, and particularly professor Ferrante's lecturing style. Not only does she spend the majority of class time trying to explain the history or biblical allusions behind each line Dante ever wrote, she seems completely incapable of addressing any of the larger issues involved. Sitting through class is unbearable, and luckily the grading on exams and the paper doesn't have much to do with the lecture anyway. Also, the fact that the course had no syllabus-- although it couldn't have been too hard to type up a list of required books, exam dates, and an explanation of what she was looking for in the paper-- caused a lot of confusion among the class. Of course, you could satisfy one pre-1800 requirement here while showing up to class only rarely, but why not take a class that's actually interesting?\nWorkload:\nFairly relaxed but graded a bit erratically (don't ask about her grading system): reading on your own schedule, 12-page paper, midterm, and final.\n"
        },
        {
            "course_name": "Dante and Medieval Culture",
            "review_date": "April 18, 2003",
            "review_content": "\nFabulous.  I loved every minute of it and her.  Granted, she knows everything there is to know and can move too fast at times (and go on and on about things \"we don't have to know\"), but this is the first time since LitHum that the professor and not the TA graded midterms.  She's always excited and jumps right into lectures---she loves this stuff and made me want to take Italian.  Go to class (and take GOOD notes) and it's a fairly easy grade---plus it's much better than the other options for pre-1800 courses...\nWorkload:\nVita Nuova, Monarchia, and the Comedy.  Once we get into the comedy, it's 5 or 6 Canti a session MAX...but GO TO CLASS if you want to really understand them.  Difficult midterm and final (STUDY!), longish paper (12pp.)\n"
        },
        {
            "course_name": "European Literature in the Middle Ages",
            "review_date": "January 21, 2002",
            "review_content": "\nThis class provides an excellent  introduction to medieval literature; Professor Ferrante is obviously exceedingly well-versed in the  material (she's been studying it long  enough). Although she does tend to  emphasize the sometimes limited  extent to which the material can be  interpreted (dwelling on  unanswerable questions) she  effectively covers the essential points  of all the works studied; the time  spent on each work is limited  (generally one lecture), but Ferrante  is good enough at \"summing up\" that  her lectures are satisfying rather than  mystifying. Furthermore, Ferrante is a  personable and pleasant professor,  who is genuinely enthusiastic and  happy to be teaching.\nWorkload:\nFor undergraduates a midterm, final,  and final paper (min. 15 pgs). For  grad., just final paper\n"
        }
    ]
}