{
    "prof_info": [
        {
            "prof_name": "Nathanael Shelley",
            "prof_id": 5584,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 06, 2014",
            "review_content": "\nProfessor Shelley was absolutely one of the most brilliant professors I have ever had, and he remains to this day (after three years) a wonderful friend and mentor of mine. I do hope he never reads this so that he doesn't get all flattered. I do hope he goes on to teach in the future, as I think he'll inspire many, but I hope as well that I remain his favourite student. Besides knowing all that there was to know for the class, he has awesome taste in music, film, and wardrobe, and he's very kind and approachable. Although I did not care so much my freshman year and skived off, not doing quite a few readings, I still learned an incredible amount. He graded very difficultly, but it has improved my essay writing more than I can express. A brilliant man who will do brilliant things if given the chance.\nWorkload:\nthree papers, midterm, final, short quizzes, so on...\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 14, 2013",
            "review_content": "\nProfessor Shelley is hands down my favorite professor. He is not only extremely intelligent, well organized, and interested, but he also genuinely cares about his students. That said, Shelley is one tough professor, but I wouldn't have considered changing Lit Hum sections for a second. He pushes the entire class so that discussion is always rich and challenging. He expects a lot from his students, but he also holds himself to high expectations as a professor. \nThere was never a boring moment, and we often found ourselves staying in class 10-15 minutes after it had ended because we were all so engaged. The class is structured as follows: occasional short reading quiz, historical background, close reading, cookie break, partner work and more close reading, student presentation, and open-ended discussion. \nSimply said: Professor Shelley is the best.\nWorkload:\nExpected to do all of the reading pretty thoroughly. Short reading quizzes every other class. 2-3 short papers (he's a pretty tough grader, but you'll thank him for it), one presentation a semester (20 mins), midterm and final. He is also pretty strict about participation, but trust me, you'll want to participate!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 29, 2013",
            "review_content": "\nHe takes his teaching very seriously. You can be sure you'll learn what you need to know and more for the midterm and final. His classes are mostly discussion-based, with a very small amount of lecturing. However, he usually has a goal in mind when opening a subject up for a discussion, and he will guide students toward a certain conclusion. If it takes too long for the students to reach that conclusion by themselves, he sometimes just says it outright or drops it and says he expects the class to think about it in their free time. He's very no-nonsense without being stifling or intimidating, and he's always available and helpful during his office hours. Do not take this class if you want to babble bullshit all class long and waste time because he will (kindly) shoot you down. He grades a bit harshly on essays, and the class is curved to a B. \nAll that said, one of my favorite teachers this term and truly eye-opening if you're willing to put in the time and effort into his class. A wealth of information, great guy, and he really knows what he's doing.\nWorkload:\nThe typical Lit Hum workload. He doesn't give busy work, just the typical two essays, midterm, and final. Oh, and a 20 minute presentation that must relate in some way to one of the texts, which is much less stressful than it seems. Midterms and finals consist of: IDs, close readings, and broader themed essays. He expects a date within a few hundred years of the correct one, the character who said the quotation, and context for the IDs as well as title and author. He understands that getting the reading done is tough and he's sympathetic, but he expects you to get it done anyway. Short, difficult reading quizzes at the beginning of class when he suspects that people have not been doing the reading. \n"
        }
    ]
}