{
    "prof_info": [
        {
            "prof_name": "Peter Abeles",
            "prof_id": 1914,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Land-Use Planning in the US",
            "review_date": "January 15, 2006",
            "review_content": "\nI have taken a bunch of Urban-related classes in both the Urban Studies and History departments and have enjoyed them.  However, what winds up happening is that the books read, the discussions lead and the lectures themselves wind up being very theoretical and sometimes almost to idealistic.  That's not to say that they aren't great, but more that the other classes are very academic yet not always practical.\nProf. Abeles is an adjunct professor who also teaches in the grad school for Urban Planning.  He got a Master's in City Planning and practiced planning and real estate development with a lot of success.  What he taught us was not all that academic but instead more business-y and practical.  I enjoyed taking this class as a complement to the other ones offered about cities because we got to hear from someone with work experience directly in the field.\nThe seminar had only 8 people though in the past it's been bigger.  It was very laid back, the reading was done as we pleased (he gave a list of recommended books and we could basically read as much or as little as we wanted) and the assignments didn't take more than a night or two to complete.  The assignments were also really interesting - for one we had to obtain the master plan for our hometown and write a critical review of it.  The syllabus at first seemed a little daunting based on the sheer amount of assignments but it was scaled back, partly because almost half of the class was on the football team and were in season throughout the class (he was fair and gave us all the same amount of work rather than just giving the football team freebies).  He talked most of the time, though we were able to interject.  We were allowed to ask him to talk about subjects that interested us - we spent most of the semester talking about Housing, Urban Development, and how to rebuild New Orleans so that it will be a successful city.  \nOverall I really enjoyed the class and would definitely recommend it to Urban Studies students who want a more practical class in their curriculum.\nWorkload:\nCritical review of our hometown's master plan (3 pgs), Population Projection (4 pgs in 2 parts), Reading review (1 pg), Final Paper (any planning subject we wanted, 5-10 pages).  Not bad at all.  A lot of the books on the reading list (there was no reading check aside from the reading review) were assigned in other Urban Studies/History classes, such as Crabgrass Frontier and Devil in the White City.\n"
        },
        {
            "course_name": "Land-Use Planning in the US",
            "review_date": "August 31, 2003",
            "review_content": "\nAbeles was a lot of fun.  He's not a professor by profession, but a planner, so he brings a practical approach to the class.  The assignments are pretty easy--don't worry about the massive reading load...because you have to write reading responces you can get away with only reading a chapter--or just a few pages.  We got to sit in on a planning board meeting which was a lot of fun.  Abeles is kind of crazy and sometimes lets his political views slip out a little to much, but his views are interesting.  I really recommend this class.  It's one of the most practical classes I've had in college.\nWorkload:\nOne paper, attendance at a planning board meeting, reading responces every other week.\n"
        }
    ]
}