{
    "prof_info": [
        {
            "prof_name": "Karen Seeley",
            "prof_id": 1705,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Cultural Psychology",
            "review_date": "January 05, 2015",
            "review_content": "\nI agree with the review below: this one of the best psychology classes I have taken at Columbia so far. Informative, educational, rigorous but with a moderate workload, this is the ideal class to fulfill your seminar requirement. Prof. Seeley is just wonderful, and I highly recommend this class.\nWorkload:\nWeekly readings, one discussion leadership, two papers (midterm and final).\n"
        },
        {
            "course_name": "Cultural Psychology",
            "review_date": "August 10, 2009",
            "review_content": "\nOne of the best, if not the best, psych courses I have taken ever. This class opened my eyes to the fact that the psychology we learn is through a Western, specifically American lens. This course is key for psychology majors to realize that what we learn in other courses is relative to an American culture. A mental disorder in America may not be categorized as such in Bali. Though not overly invested in the clinical applications of psychology, the course does teach what can go wrong when non-Americans are treated according to American psychological theory. \nThe class also attracts a diverse student population thanks to the subject matter, so you may hear points of view you have yet to encounter. The class is exactly the title, a combination of in depth study of psychological theory and culture.\nOverall, the readings were reasonable in length and almost always fascinating. There was a lot of in class discussion, refreshing after so many psych lectures and droning powerpoint presentations. \nProf Seeley may seem cold at first, but she truly is passionate about her work and the course. She is dedicated to teaching her students new information, so unlike many other courses you will not be bored by overlap. The content she presents is more captivating than her lecture style, but I was never bored. \nProf Seeley is also extremely helpful on a one-on-one basis. Be sure to meet with her, especially if you are struggling with a direction for your papers. When I started, I had a very broad topic, but her guidance helped me hone in on a real thesis and she even named dozens of volumes to look at for research so I didn't waste time.\nIf you are a psych major, you HAVE to take this class.\nWorkload:\nRead 3 articles weekly. Midterm paper 8-10 pages, Final paper 12-15 pages. One time lead a discussion on one of the 3 weekly readings.\n"
        },
        {
            "course_name": "Psychological Anthropology",
            "review_date": "January 11, 2009",
            "review_content": "\nI was underwhelmed by this course. As a Psychology major, I took the class to expand the breadth of my knowledge into another field. However, I found that Karen Seeley barely touched on any issues of psychology, and went straight into deep anthropological issues, which for the non-anthro majors in the class made it quite a challenge. I also found the class extremely dry; while the books we were reading were interesting, her interpretation of them sounded more like preaching, and she was extremely pretentious in handling student comments. Towards the end of the course I didn't feel like sharing my thoughts and having her tell me why I had interpreted the book wrong. It went the same way with the essays -- any insightful thoughts that were new or different to Karen Seeley would result in a bad grade.\nWorkload:\nModerate. Several dense chapters a week which would be discussed in class once a week. 10-12 page midterm paper, 12-15 page final research paper. One week of generating discussion questions and leading discussion.\n"
        },
        {
            "course_name": "Intro to Social Psychology",
            "review_date": "February 14, 2007",
            "review_content": "\ngreat class, seemed somewhat redundant at times but really eye-opening, especially if you're a psychology major. The readings were interesting, she used a psychological and anthropological approach which you never really get from other, more traditional psych classes. She always tries to make herself available to the students too. No matter what you say in class, she listens and uses your comments to build upon. \nWorkload:\none midterm paper (not sure, 10 pages?  maybe less) and one final paper (15-20). She's really receptive of whatever you write, gives a lot of positive feedback, and is an easy grader.\n"
        },
        {
            "course_name": "Intro to Social Psychology",
            "review_date": "February 14, 2007",
            "review_content": "\ngreat class, seemed somewhat redundant at times but really eye-opening, especially if you're a psychology major. The readings were interesting, she used a psychological and anthropological approach which you never really get from other, more traditional psych classes. She always tries to make herself available to the students too. No matter what you say in class, she listens and uses your comments to build upon. \nWorkload:\none midterm paper (not sure, 10 pages?  maybe less) and one final paper (15-20). She's really receptive of whatever you write, gives a lot of positive feedback, and is an easy grader.\n"
        },
        {
            "course_name": "Culture, Mental Health, and Clinical Practice",
            "review_date": "August 28, 2003",
            "review_content": "\nThe class was well organized and the reading was usually really interesting.  Seeley has a gentle manner and seems quite friendly if a little reserved.   However the class was seminar style but Seeley would spend most of the class giving back ground on the reading essentially telling us what it was about, which made reading unnecessary and also killed most opportunity for discussion since she spent so much time talking. Part of the reason discussion in the class might have failed so horribly was that it was at 9am, the class was small and in my opinion half of the kids in the class were really boring and the other half had no idea what the reading was let alone what it was about. Bottom line you will end up learning something no matter how little work you do.  If you can write coherent big papers, actually do the reading, and don't mind being bored occasionally, you can do well and actually learn something too.   \nWorkload:\nTwo big papers, one 10-15 the other 15-20, one in class presentation on paper, mandatory class participation.\n"
        }
    ]
}