{
    "prof_info": [
        {
            "prof_name": "Kate Heidemann",
            "prof_id": 9699,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 09, 2010",
            "review_content": "\nDefinitely agree with the previous post. \nKate was literally amazing. Her instruction on musical forms was actually excellent. Her lectures approached the material from multiple perspectives. She would begin with a new historicism interpretation and then delve into the musical theory behind each piece. I'm an econ, math major, but I've been playing music since an early age. I knew very little of the history of music or about many elements of form and texture. This class will take music, some of which you may recognize, and force you to engage it from a completely different perspective. One example: The Rite of Spring, Stravinsky. This piece has made multiple appearances in popular culture, but this class will help you to understand the primalism that motivates the composition. Class atmosphere is very laid back and not at all hostile. \n\nWorkload:\nAll of the work, quizzes, written assignments, and final are extremely manageable. Kate is a very fair grader and isn't looking to catch you on little mistakes. If you go to class, there are literally no surprises on any graded assignments. Final in particular. This 90 multiple choice exam had nothing but reasonable questions. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 09, 2009",
            "review_content": "\nKate's a great instructor. If you have to take Music Hum (which you do) I couldn't think of anyone better to take it with.\nShe's got a great temperament, is very knowledgeable about the material, and is clearly very passionate about Music in general.\nWhile I am a science major, I found this class very enjoyable and I really learned a lot. You don't spend too much time on any one genre so even if a style of music is not your thing, you're quickly onto the next section.\nI'm glad I ended up in Kate's section. The course is graded on the following...\n2 concert reports due at the end of term.\n5 small quizzes she makes it super easy to prepare for\n4 short written assignments (1-2 pages)\nNo midterm\n1 final\nIt probably sounds like a lot, but it's really not. The papers are really short and only require a flick through your class notes and the\ntext book to do well.\nShow up, do the work and you'll do great!\nWorkload:\nVery moderate. Probably on par with any other section of Music Hum.\n"
        }
    ]
}