{
    "prof_info": [
        {
            "prof_name": "John Magyar",
            "prof_id": 4150,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "February 06, 2014",
            "review_content": "\nI had a pretty good experience with Gen Chem. I personally loved the way Magyar lectured.He's very good at walking through the points in a logical way and he's not as boring as most lecturers. I do concede that he focused heavily on the big picture and occasionally moved quickly, but what do you expect? He has to teach an entire textbook in one semester and he's not going to be an expert at every single topic. He definitely tried his best to help and he's the least intimidating person I can imagine. The optional weekly problem solving workshops were incredibly helpful especially for exams or even just to clear up general confusion. For everything Magyar didn't go over Sapling totally covered. As long as you don't wait until the last minute to do the problem sets, Sapling was completely manageable and was like a second instructor.\nThe only actual negative comment I have to say is that the exams were sometimes worded strangely in which case you would waste time trying to figure out what the crap you were supposed to do which was totally possible. The curve at the end of the year was very generous in my point of view. \nWorkload:\nweekly sapling- 8%\n4 exams- 42%\nfinal- 20%\nlab (different prof)-30%\n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "February 06, 2014",
            "review_content": "\nI took Gen Chem with Magyar last semester and I really just don't understand all of these bad reviews. I don't think people realize how hard he tried to make us understand the material. Yeah maybe he wasn't the best at teaching ALL of the material in depth, but it's not his responsibility to teach us all the small details. He's just supposed to present the basic principles and we're the ones who are supposed to study the rest. I thought sapling was a fair amount of work. \nThe tests weren't easy, but neither is Gen Chem. You need to study the labs and sapling if you want to do well. \nMagyar is always willing to help during office hours and he holds weekly workshops that really help! \nGive Magyar a chance!! He's a bit awkward but he truly is adorable. You'll do well if you put in the time and effort that Gen Chem deserves. \nWorkload:\nWeekly Sapling- about 25 questions\nweekly labs \n4 tests\n1 final \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 02, 2014",
            "review_content": "\nProfessor Magyar has to be one of the most frustrating professors I have ever had. At first, you find him adorable and funny, but once you take the first exam and realize he hasn't prepared you AT ALL, you start to find his jokes forced, awkward, and obnoxious. He spends the whole class time doing pointless demonstrations with balloons and eggs (LIKE...IT GETS OLD AFTER THE 7TH TIME THANK YOU) and solving easy, straightforward problems on the board which end up being nothing compared to the hard problems on Sapling and on the exams. As the lessons get harder he becomes progressively worse. He started off pretty strong when teaching the lessons on the periodic table and quantum chemistry, but you can forget it when he gets to electrochem, redox, thermodynamics, etc. He teaches them in a very elementary manner so you basically have to do depend on the textbook/internet COMPLETELY to prepare yourself for the exams. \nAt first, I attended every lecture, but then decided that all it did was make me frustrated so I read the textbook instead of going to class and took my own notes. Just find a friend who goes to class so you know what sections he covers per chapter (he leaves the ends of most chapters out). By the way, you should DEFINITELY buy the solutions manual for the textbook. It gives answers to all the even problems from the textbook with step-by-step instructions so you know how to solve it (because god knows Magyar can't explain it). He also doesn't curve the tests until the end of the semester so you have absolutely no clue how you're doing until you receive your final grade. My advice: make sure you get above the class average if you want to do well. \nOh and it's January 2nd and I still haven't gotten my final grade back. (Or the final grade on my 4th midterm which we took after Thanksgiving break, which reminds me...he loves giving out exams right after long breaks so you're forced to spend your whole entire break studying). He also told us that the final exam was going to be a completely different format than anything we've ever done and wouldn't give us any hints; he told us that we were not to try to contact him during the reading period because he wouldn't respond and that he wouldn't hold any more office hours or review sessions. Oh cool, thanks!\nDo yourself a favor and start your Chem sequence at Columbia, unless you don't mind devoting hours a day to reading and taking notes from the textbook. This is even coming from a student who did 3 years of Chemistry in high school (regular, AP, and IB). \nWorkload:\n4 in-class exams- 42% \nOnline Homework- 8% \nLaboratory- 30% \nFinal Exam- 20%\nVERY TIME CONSUMING. You will have to prioritize this class if you want to do well.\n"
        },
        {
            "course_name": "General Chemistry 2001",
            "review_date": "December 26, 2013",
            "review_content": "\nI got 95+ on all the sapling hw, did every odd problem in the back of the book (additional problems) and understood the material, and I feel horrible after the final. I want to write this review before I get my grade for this class, which will probably be a GPA dropper. I  didn't have prior experience in chem so I studied a lot for this class. I learned every required chapter literally and still couldn't do well on the exam. The book asks easy direct questions, while the exam has these \"If you take beaker A and mix it with beaker B which is 20% of this, then dilute it by 10, do this, do that, do that, what is the pH or something. You had to read a whole paragraph of this to understand the question and you had less than 50 minutes for a bunch of these. The question had part a, b, c, d, and e and you really had to know how to answer part a to do part b, c, d, and e. So if you don't get what part a asks, you got like half of the exam wrong. \nYou never know what grade you are getting in the class. He said that everyone can get an A and that tests are not curved. So does this mean everyone can get C? It's December 26 and he still has not given our grades for Exam #4. Really? My grade in that class will be a complete surprise.\nHe is a nice and funny guy I have to say. I liked going to lectures and I liked the demos, which cover like the review before said 10% of the material you should know. At first he appears as a sweet professor and you think how this guy could possibly be such an asshole.\nHe is not really approachable at any time except his office hours, lecture time, or problem solving workshop.  \nThis class, along with lab consumed my whole semester. I also did not have a fall break or thanksgiving break because of exams right after.\nHe said that the final could substitute your lowest exam grade. I think the final was my lowest grade! The multiple choice was some standard test and it suggested i believe 140 minutes. Magyar said he expected us to finish in much less than that on the final and do hard short answer questions and write an essay. I was so disappointed for the final. \nFor the lab, the grading I feel is totally random. Sometimes I do one thing wrong I get a B. At other times, I get a B+ for nothing wrong. All the comments say Yes! Yes! Excellent! Great Calculations! B+- Great Job. What? Why not A? At other times I get an A- and I mess up a few times. The lab also took forever to write!! I spent the whole afternoon all the time before the lab is due. The labs are not organized and some labs are extremely long while others are really short. One lab was so long that it was not even graded.\nThe timing of the class is so annoying. You cant have a 10:10-11:25 class or 11:40-12:55 class, which is a really popular time. \nOverall I hated this class. The exams were not representative of sapling and book and you are always confused on what you need to know and how you are doing in the class. I am so glad I am done with this class. Every time I check for my grade I get a mini heart attack before I see that it is not posted yet.\nWorkload:\n70- lecture 30- lab\n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "December 25, 2013",
            "review_content": "\nMost of these reviews make Magyar seem like a jerk which he isn't, I guarantee you that. He is a great professor if you intend to learn. Notice how all the previous negative reviews are from people who were very grade focused and probably couldn't manage to get a stellar grade to impress med school admissions or such. Many of them are pre-med and are trying to get oh you know an A or A+ because they deserve it so well. Funny thing is they haven't learned that you have to put in the effort and earn a good grade. If you're pre-med, you know you have to to take it and many of your science pre-reqs will consist of lectures where you learn the concepts and you do problem solving on your own. Why is Magyar so bad that he lectured and you had to learn to solve problems on your own? All this negativity on a professor who teaches well and means well when all one could do is basically go to his lectures and then apply the concepts on the given problems online or those corresponding to the topic in the book that he did ask you to get in the beginning. Sure, he may assume that you have some previous chemistry knowledge but it's gen chem, most profs will. If you don't know something you feel he has assumed you do, the book will clear it up plenty for you or ask him in office hours. It's just wrong to say a good professor cannot teach when perhaps you were too busy trying to get good grades while putting in the minimal amount of effort. What's with complaining about having to read the text or solving problem on one's own? That's part of the course, it's expected. It seems like many of these negative reviewers wished Magyar to sprinkle some pixie dust on them so all his knowledge and skills could transfer to them, without them having to put in any effort to learn. and now they're expressing their disappointment on culpa after learning a truth of life. \nI don't want any of these grade-oriented, most likely premeds, to scare off anyone who wishes to take gen chem here. You'll do great if you put in the effort and it doesn't require too much. It's gen chem and i'm sure you're aware the higher level courses will require you to put in more no matter where you are. \nWorkload:\nmidterms, final, online homework --70%\nlab (not in magyar's hands)--30%\n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "December 23, 2013",
            "review_content": "\nGen Chem at Barnard is a tough class. From the very first couple of weeks of school, I had been so surprised at how quickly the class speeds through topics, wondering how students with no AP/IB experience were doing (I had 3 years of chem prior to this class). Despite my experience, however, I still found the class to be difficult and spent hours studying for midterms I ended up doing poorly on anyway. Though I use the word \"poorly\" loosely since you never really know how you're doing in this class since midterm grades range from 12% to 99%. They weren't lying when they called this the weed-out class.\nIt's a tough class, but I had a terrible HS chem teacher so I will have to disagree with other reviewers and say that Magyar is an okay (not bad) professor. Sure, it is sometimes difficult for him to answer questions, but most of the questions asked weren't important (as in wont show up on exams/don't need at this level of chemistry) anyway. I was surprised and even applaud him for always asking for questions in a 150-student lecture class. He incorporates a demonstration for almost every topic, which I think really helped with understanding of some topics but not so much in others. His lectures covers the basic chemistry that we need to know, but students are expected to take a lot of time outside of class practicing more difficult problems. Sapling problems (the online homework) are a great resource for more difficult questions, but it's easy to just speed through them and look through hints instead of understanding how to actually do them. The latter half of the midterms contained questions very similar to sapling questions, so I recommend taking time and actually understanding how to do each problem! Yes, there is quite a bit (a lot) of math involved. \nOverall, it's a tough class, though I don't think it's Magyar's fault. The class covers a lot of information in one semester. He has to get through all this information in one semester so he really can't and don't spend a lot of time going over examples after examples during class. He really should have had more office hours though! Office hours with TAs were a waste of time, in my experience.\nWorkload:\n4 midterms, lots of online HW every week, one final. Do your best in everything and hope for the best because it's difficult to know how you're doing in the class unless you're the student who gets the 99s.\n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "December 22, 2013",
            "review_content": "\nI disagree with some of the previous reviews. First of all, any professor (no matter how good or bad he/she is) deserves all our respect. They have put in a lot of effort to reach where they are today. So, derogatory words or statements should not be used. As students, we also expect the same from professors. Also, as an integral part of academia, a professor should carry more weight and responsibility to encourage more students to feel comfortable in the classroom (rather than making them feel awkward) and thereby encouraging them to pursue a career in pure/physical sciences and research fields. I don't know why I am writing this but I felt the need to write this. I personally gave and continue to give Prof. Magyar the due respect he deserves for his hard work and for his expertise in his field of study. \nTo be very honest, I literally felt as if someone is writing what was on my mind after the final exam in the last review. Whoever wrote that, that's how I exactly felt after turning in my exam and just walked out of the classroom. But later I realized, there is no point in getting a straight A in an easy exam. If a professor gives you an easy exam, and you end up getting an A, but believe me, that's never going to help you in real life. Yes, that will help you if you want to get into a normal job as every normal person does, but you will never be able to do anything on your own. You can work under someone and earn enough of money, but you will not be able to make hundreds of people work under you. This is where grades matter to many people, and doesn't matter to a few original thinkers who want to create something, not to work under someone. \nI myself didn't do well on any of my exams in this course but believe me, I enjoyed solving problems Prof. Magyar gave us on tests. These questions were challenging not just randomly chosen from textbook. They required us to think. I believe Prof. Magyar just can't give us easy questions because he himself does in-depth research work and he wouldn't like to give us a direct formula based questions. I did really bad on exam 1, but I appreciated the quality of questions, exam 2 was pretty normal, exams 3 was great, had really interesting questions,  exam 4 was pretty straight forward and final exam was just a bad surprise. I studied a lot (I have never studied for a test, as much as I did for finals). He should have at least given us an indication on the format of the exam in the last class but he didn't. I didn't know what I did on the final exam. \nBut still, I liked the class because I was not taking the class for just requirement or getting an A. I took the course, to learn more and I was taught the course in the best possible way. For me, this was one of the best classes I took at Barnard. \nPS: I do not write reviews on these sites but I really wanted to write reviews for two of my professors this semester. The other one will be up soon :)\nWorkload:\nDepends on the student. If you are doing in-depth study, you will need all your time. If you are studying to pass the exam and get an A -- Do weekly sapling problems, write a lab report every week (the more you work, the worse grade you get).  \n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "December 20, 2013",
            "review_content": "\nI really wanted to like Magyar as he seems like a nice person, but I just couldn't. He does move quickly which wasn't a problem for me as I pretty much learned to teach myself through reading the book and doing the Sapling online homework problems. He probably actually lectures on 10% of the material that we need to know. Like the other reviewers said, the problem solving workshop is great to hear more from him and to actually apply the material in ways that you will be expected to do on the homework/exams. The biggest thing was the exams which most of them were incredibly unfair as they were nothing like what we had been doing in class/for homework. This wasn't for all of the exams but definitely the final which I walked out of completely shell shocked. A little less than 70 multiple choice, 2 short answer problems with about 4 parts each and an essay in 3 hours is A LOT. I had no idea what I was doing. I scribbled down equations and some work to try to get some partial credit but I wasn't able to solve ANY of the short answers. Two of the regular exams were scheduled immediately after breaks which was a dick-move. Also, he never keeps promises on when he will return our exams, which is a bit ridiculous considering he doesn't even grade them all. If he says he'll get it back to you by a certain date, expect it to be a week later. Regarding the curve, he never explicitly told us what to expect, and the ballpark that he did give us was not very encouraging nor  big considering how poorly a majority of the class is doing. We'll see how things work out. This was his second year teaching Gen Chem and it was a miss. Better luck next year Johnny boy. \nWorkload:\nIn-class exams (4)- 42% \nOnline Homework- 8%\nLaboratory- 30%\nFinal Exam- 20%\n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "December 16, 2013",
            "review_content": "\nI agree with the last review.Just finished my Gen Chem final exam and IT WAS THE WORST EXPERIENCE EVER. Magyar has screwed us throughout this semester.He kept us confused with exams, what to study and how to prepare for the test. He said the final exam will be like all other previous tests but he changed the format in the last minute with 61 multiple choice questions. \nJust made up my mind to change my major from Chemistry to Political Science.   \nWorkload:\nTakes your whole semester. \n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "December 11, 2013",
            "review_content": "\nMagyar isn't the best lecturer you'll have but his problem-solving workshops are a god-send! During the lectures, he tends to get nervous and scatter-brained when confronted with questions on the spot, but if you go to him after lecture or during office hours, he tends to do better at clearing confusion. I seriously recommend the workshop though (during lecture we barely go through any problems and that's what the tests entirely consist of)! Lab office hours are said to be for everything in the course but most of the time students come in and out for lab questions. Also, both lab profs and Magyar say they won't entertain questions about sapling problems which is annoying since how else are we supposed to get any help! Their method is to answer your questions back with questions so that you think, but in my opinion, it's NOT VERY HELPFUL!!\nFor Gen Chem, Magyar assumes you already have a background in chemistry from high school (although most students do not!). He also kept putting exams inconveniently after breaks so this semester has been a nonstop, uphill run. Be warned, this class is very consuming time-wise.\nWorkload:\n70% gen chem lecture (exams, sapling, final). 30% lab\n"
        },
        {
            "course_name": "BC1601 General Chemistry I",
            "review_date": "November 25, 2013",
            "review_content": "\nMagyar means well, but he isn't a very good lecturer. Sometimes he gets confused, which is okay, because he usually clarifies his mistakes. However, he's awful at answering questions in class. He looks at the board for a long time, looks at the student who asks the question, smiles winningly, attempts to make a joke, and sometimes attempts to answer the question. Sometimes.\nMagyar trying to teach electrochemistry was almost unbearable. Quote: \"this is new for me too - we're all in this together!\"\nUnless you've taken AP chem and done well, or have gobs of free time on your hands, gen chem with Magyar can be brutal. The class goes fast. You can do well on the tests by practicing problems over and over, in Sapling and in the textbook. Go to office hours with the student instructors. The problem solving workshop can be helpful, but often slow-moving to sit there for an hour an half on a Tuesday night.\nHe's also irritating about what material will be on the test. His classic line is \"don't worry about it too much.\" Too much? Somewhat? How much?!\nHe refuses to be explicit about curving in addition to what material will be on the test. Apparently, at the end, there's a small curve (no individual tests are curved). So you never really know exactly how you're doing in lecture. The average of our first test was like a 65% or something.\nMoral: gen chem at Barnard is a weed-out class.\nBe prepared to do chem ALL THE TIME. It definitely needs to be your priority if you want to do well.\nCan't say I'll miss Magyar. But, in his own words, don't worry about it too much, guys.\nWorkload:\nSapling problem set every week (normally about 30 questions), four exams, final. This is 70% of your grade for chem (other 30% is lab).\n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "November 18, 2013",
            "review_content": "\nRumor is he is leaving the college, so you shouldn't have to worry about him. He isn't the best teacher, but I attribute this to his inexperience in teaching an into level chem class. He is really interested in what he teaches and does a lot of fun experiments, so if you like chemistry at all he will foster this love. If you have never taken chem before, good luck. He assumes you learned a lot in high school chem, especially in the beginning of the semester, so you are pretty screwed if you didn't take AP chem or remember any past chemistry courses. He doesn't always make sense in lecture, but clarifies things in problem solving workshop when he explains how to do problems. BASICALLY, you teach yourself by reading the book and doing all the homework problems.\nTake chem at Columbia if he teaches again. Columbia Chem moves at a slower pace too so its relatively easier to follow along.\nNote: He is a really awesome and considerate guy, just a really bad lecturer.\nWorkload:\nOne or two online sapling problem sets, usually 20-35 questions in length, a week. 4 hour-long in-class exams, total worth of 42%. 1 final, worth 20%.\n"
        }
    ]
}