{
    "prof_info": [
        {
            "prof_name": "Promiti Dutta",
            "prof_id": 11087,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "April 13, 2011",
            "review_content": "\nIn taking Gateway, Promitti rather reminded me of a childhood friend on mine, \"Where's Waldo?\"  Even though she is technically the head of Gateway, now that Jack McGourty has moved on to greater and better things than tormenting SEAS freshmen, this semester she has shown to class for perhaps 2 lectures, not including the first half-hour session for introductions and making friends and other hippy crap.  I suppose to compensate us, only a brief section of the design midterm was actually on design, specifically around 9 questions out of 40.  I have this theory that Promitti is turning into Mr. McGourty and slowly leaving us to suffer in Gateway.\nWorkload:\nWeekly \"required\" readings of Dieter and design lectures which aren't worth anyone's time, I mean, do I really have to read a 500 page textbook to understand teamwork, milestones, and design parameters?\n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "March 13, 2011",
            "review_content": "\nDecent class. The lectures were boring and quite frankly, pretty useless. Sometimes, things got unreasonably though because of the requirements for the assignments or the lack of information we were given for them. There was a lot of writing involved especially for our project proposals and presentations.\nFavorite part was definitely Prof. Sanchez and the modeling. Though sitting through his demonstrations were quite boring, I liked working with Maya.\nIn the end, other than gaining Maya skills, I don't really think I learned much from the class.\nWorkload:\nWeekly modeling assignment, project proposals/assignments (around bi-weekly), design midterm, modeling midterm, final project\n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "December 25, 2010",
            "review_content": "\nI am prepared for a lot of disagrees on this. Gateway WAS NOT THAT BAD. In fact, I could go so far as to say that I liked Gateway. I do agree that this positive turn of events was almost entirely due to the fact that I had a good group. Yeah sure, we had a couple members of our group that didn't do their share, but really Gateway was way less painful that most people make it out to be. Honestly, you can make as much or as little of it as you want. You can go through Gateway bitching about how dumb it is, or you can suck it up and just do the BS. Yes, I agree that Gateway is BS, but at some level that's how the world is. Binding our reports and making them look \"professional\" may sound useless, but there is something to be said for making kids go through the motions of doing it.\nThis year, we were given the option of making a prototype. But the people so-called \"running\" gateway have no sense of communication. Thus, although at first it was required to build a prototype, they never told the mech-e lab that suddenly 200 students were going to need to use the tools and instead it was made \"optional\". \nThe Design Fundamentals Exam was stupid. The questions were either ambiguous or idiotic (Teamwork starts with who? A. your group B. your team leader C. your friends D. you E. all of the above). The modeling exam was fine, as long as you actually understood the basics behind modeling and don't just follow the videos blindly. \nThe modeling assignments were pretty useless (read: engineers don't use Maya), but fun. You don't have to listen to Jose, however. Only a small component of what he says during the modeling lecture doesn't show up on the video. Go ahead and sleep. You will not be the only one, and Jose doesn't care.\nThat is actually one thing that I appreciated about Gateway. All the instructors understood the college dynamic. The two midterm presentations were due at 1AM and the final was due at 6AM, and trust me, a lot of groups needed that time. The part I don't appreciate is that they are withholding our final grades under the excuse that we have to get them at a \"normal\" time in comparison to our other classes. \nOh and, I never saw McGourty in class. Not once. Not even for the final presentation. \nWorkload:\nA lot. But not as painful as you might think. Make sure you budget your time. The presentations are best done over a couple weekends, not the last one. But as long as you put the work in, you should get a good grade. Our presentations scored over 95 every time. \n"
        }
    ]
}