{
    "prof_info": [
        {
            "prof_name": "Jonathan Owen",
            "prof_id": 9484,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "January 03, 2017",
            "review_content": "\nThis was the single worst class I have ever taken at Columbia. Maybe it was because he just came back from a break from teaching, and maybe he was rusty. But this class assumes you already have a solid foundation in chemistry before you even step foot in the class. Things start out simple but then skyrocket and all of a sudden you're sitting in a quantum physics lecture with no idea of what is going on. Piazza is very active, which can be both a blessing and a curse. There's valuable questions there, some of which he uses for quizzes. However there is so many questions it is nearly impossible to sift through it all. Additionally, there are times where what he is saying verbally contradict what is on the lecture slides or in the textbook. This creates confusion that carries over into exams\nWorkload:\nlight workload. Piazza is used. Reading the textbook + using OWl is not required. There is no Homework. A couple quizzes. Final is required in order to pass\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "April 25, 2016",
            "review_content": "\nI completed Prof. Owen's class last Fall and it was honestly the best class I took in Columbia. I am surprised I don't see more reviews on his class here.\nHis PowerPoint is clean, neat and easy to follow. I rarely had to read the textbook. Reviewing his notes and attending his lectures are sufficient to do well in his class. He states clear what will be tested in his lectures and tries his best to make sure you understand complicated concepts. His office hours are awesome as well. He breaks down ideas, gives you more examples of applying the concepts, and is more than happy to answer any questions regarding the topics. He is truly passionate in teaching and is a great lecturer with a subtle sense of humor. All in all, I can't recommend his class enough!\nWorkload:\n3 midterms, 1 final, weekly 10-minute quizzes which are great motivation for you to review the materials.\nHe also uses Piazza and OWL which won't be graded.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "September 13, 2015",
            "review_content": "\nFirst week of class under the belt and Prof Owen is great! I was worried about registering for his course because there are no reviews to be found as this is his first time teaching the subject at Columbia. I was pleasantly surprised as he has a fair grading policy (refer to workload), his lectures are organized and to the point, and he really hones in on real world applications so everything begins to make sense. Lectures...he leads the lecture by powerpoint, which is helpful because slides are posted following lecture for review (he says he will try to post them prior to lecture in the future, but either way works for now). He moves at a comprehensible pace, will take student questions, and gives lots of examples. He definitely wants you to know the concepts, but the examples really drive the information home. He has an upbeat, approachable demeanor and his subtle sense of humor makes an appearance now and then. He also focuses on the information that we will be tested on. He made a point early on that he would rather us know what to study and have the exams be a little more difficult on the subject matter, rather than study and memorize entire chapters because we have no idea what will show up.\nProf Owen uses an online discussion board. He would like you to utilize this as class participation, which is a great alternative to cold-calling and answering questions during lecture. I have found the discussion board to be very helpful because anyone can start a thread on any topic. We can see what our peers are having issues with, and we see a very comprehensive answer. Also, the answers are posted quickly because 150+ people are able to respond. The discussion board is not graded, rather taken into account if in between grades. That's all for now!\nWorkload:\nGrading:\n\"Best four grades out of the 6 grading units below will determine the final grade. Grades will be assigned on a curve using your course participation to increase or decrease your grade in the event that your final score falls between two letter grades (e.g. between B and B+) (see below). In a typical year fewer than 1/3 of the class receives a grade of A+/A/A-. Failing grades are likely if less than 1/3 of the total available points are obtained.\n**Quizzes - Tuesdays beginning of lecture (one unit)\nMidterm Exam 1 - 10/1  (one unit)\nMidterm Exam 2 - 10/27  (one unit)\nMidterm Exam 3 - 11/19  (one unit)\nFinal Exam - Date TBD (two units)\"\n**NOTE: he will announce the quiz dates. So far they are on Thursdays at the beginning of lecture.\nHomework:\n\"Practice homework problems are assigned on Owl and will not be graded. However, the homework problems will be used to make questions for the midterm exams. It is strongly recommended that you complete the Owl assignments on a weekly basis. Your progress on Owl will be monitored by the TAs and will increase or decrease your final grades in the event that your course score falls between two letter grades (e.g. between B and B+).\"\nQuotes from Owen Syllabus W1403\n"
        },
        {
            "course_name": "3071- Inorganic Chemistry",
            "review_date": "December 29, 2014",
            "review_content": "\nThis is a class for people who love chemistry and people who are chem majors. Not that anyone would take it on a whim. I worked harder than I have in my life for this class and did very well. Some concepts came naturally to me, but there are others I still don't understand. \nThe first part of the class (up to the midterm) introduced point groups and covered main group chemistry: periodic trends, drawing lewis diagrams using natural resonance theory, and molecular orbital diagrams. The second half covered transition metal chemistry: more MO diagrams, electron counting, and some organometallic chemistry. Final was cumulative but focused more on the TM stuff. \nAbout Jon Owen: while he is a great teacher, he is not the best person to go to if you have specific questions. If you have a question about the grading or a nitpicky thing from the notes, fine. Asking him a conceptual question will lead to a 30 minute long answer that is very interesting and ultimately useless. Talk to the TA or other students instead. He's a great lecturer and the notes were usually pretty well organized (and he has great handwriting). The second half of the course was a bit rushed and much less focused. I'm pretty sure Prof. Owen didn't cover all the material he meant to. \nPset questions are much harder than class examples, exam questions are somewhere in between. Sometimes molecules are taken from recently published literature. Find a study group or at least someone to talk through answers with. But do all the psets with intent! They are the only practice you will get for the exam!\n\nWorkload:\n8 or so problems sets (Hard! Hours of work!)\n1 Midterm, 1 Final exam\n"
        },
        {
            "course_name": "Introduction to Inorganic Chemistry",
            "review_date": "May 14, 2012",
            "review_content": "\nIn the interest of full disclosure, I got a C+ in this class.  Despite this, taking this course with Professor Owen was still a good choice.  He is by far one of the best teachers in the entire Chemistry department, right up there with Leighton.  This is a difficult class, and this was evidenced by the midterm exam.  Not a single person in the class finished the test.  The highest grade was an 86 with an average in the high 50s or low 60s.  A lot of knowledge that you are assumed to remember nearly perfectly from General Chemistry, like VSEPR, Lewis dot structures, periodic trends and the like is absolutely necessary for success in this course.  Memorize the periodic table up to Ac (not including the f-block elements) over the break beforehand if you can.  It will save you valuable study time later on.  Although the course bulletin only requires Organic Chemistry II as a co-requesite, a strong intuition in chemistry is required, and it may be beneficial to have an extra semester of \"lower\" level chemistry before attempting this class.  That said, it is unlike any chemistry you have ever taken before in your life.  There are also no more humanities pre-meds to help the curve.\nThere is a lot of information to cover, and if you want to have a chance at doing well, you best have some familiarity with matrices and group theory for symmetry.  If these concepts are entirely new to you, you will either struggle with this class, struggle with your other classes or both.  The material itself is quite interesting, and begins with a 2-3 class overview of the entirety of General Chemistry.  From there, the class moves into symmetry and molecular orbital theory before moving into transition metal complexes.  A little bit of spectroscopy as it relates to transition metal complexes is covered, before the course enters the realm of organometallic chemistry, and finishes off with a brief overview of metals and semi metals.\nThe problem sets ranged from easy to difficult, but Professor Owen explicitly permitted collaboration between students.  If you can set aside a few hours a week to meet up in a group to work through the problems, it will be highly beneficial to you.  If you are taking 6+ classes, and can barely find time to do the problem sets, waiting until a lighter semester would be ideal.\nIf you are a Chemistry major, then you have no choice.  You have to take this class, and hopefully, for your sake, Professor Owen will still be teaching it.  If you are a Biochemistry major, be sure that you are really interested in chemistry before taking this class.  It is difficult, and it will consume a significant amount of your time.  If you like chemistry though, I highly recommend it.  If you are only somewhat interested in the chemistry aspects of the major, save yourself the agony and take more biology classes.\nOwen will help you if you ask for it, and he scheduled review sessions at times that could not have possibly been convenient for him.  One was two nights before the midterm at 9PM, and the final review was at 9:30AM during reading week, when he otherwise would not have had to teach.  He tries to allow student participation to the extent that it is possible in a science lecture class, albeit a smaller one.  Go to office hours.  Ask your TA.  \nWorkload:\nPeriodic Table Quiz (unknown % of grade), 7 Problem Sets (30%), Midterm Exam (30%), Final Exam (35%), \"Class Participation\" (5%)\nEach problem set varied from 3-5 hours or more, and 10-12 hours total study time for each exam would be a decent estimate.  The more time you spend, the better your grade will be.\n"
        },
        {
            "course_name": "Advanced Inorganic Chemistry",
            "review_date": "April 09, 2012",
            "review_content": "\nThe course was split in two, and a lower undergrad curve was given (which was not cool). The course is hard, especially if you're 3D challenged (since half the course deals with conformations and turns of molecules). While Professor Owen is an excellent teacher that deserves more praise for teaching than any other chem professor I've encountered over my time here, taking time out of his schedule to meet with students and further explain difficult topics (along with the T.A.), Professor Norton is a bit more disorganized and awkward to approach. Both of them are good teachers, but while Professor Owen sticks mostly to the book, Professor Norton sticks more to his notes and myriad handouts. It's not an easy class, as I have said, but you'll learn a lot and gain many chemistry skills that were missing in gen chem.\nWorkload:\nLots of problem sets that take a long time to complete (hence 4.5 credits), midterm, final\n"
        },
        {
            "course_name": "Advanced Inorganic Chemistry",
            "review_date": "January 11, 2012",
            "review_content": "\nTo be completely, truly honest, I'm not smart or disciplined enough to learn this material on my own.  However, thankfully, I had a lot of help, and I knew several people who were extraordinarily patient and kind enough to teach me and answer my countless stupid questions.  Quite frankly, the course isn't designed for intrepid explorers wanting to learn about inorganic chemistry for the first time, and especially not for undergraduates.  I think most of us managed to stumble through it, and I'm (sort of not really) proud of the grade I got, proof that I survived through the material and the, at times, poor teaching.  But the grade I got wasn't that great, even with the effort I put into the course.  I know that there will be others like me who think that they're invincible and reckless and relish the challenge of taking a grad school class.  (And I know that this class hasn't stopped my desire to learn more chemistry; quite the opposite.)  I just hope that you will register for this course with a huge grain of salt and I greatly recommend that you know nice people who do inorganic chemistry for a living, *especially* if Jack Norton is teaching the course, because asking them is what helped me the most in understanding the material. \nProf. Owen's part was difficult and frustrating, but it wasn't entirely his fault.  The material is hard, and one of the biggest flaws of this course is that it's for graduate students.  Everyone except for three or four undergraduate students will have taken some form of inorganic chemistry before.  They all know about character tables and Mulliken symbols and molecular orbitals, even if they don't remember a lot of it and even if the majority are organic chemists that don't live and breathe the stuff.  Even among the undergrads who I took the class with, three out of the seven of them had taken it prior.  The problem sets aren't that bad when you have a rudimentary understanding of how to do the problems and of the subject matter, but it's that rudimentary understanding that will take a lot of effort to obtain.  Group theory is rather abstract and mathematical, and there's a lot of tricky geometry hidden in inorganic chemistry.  \nOccasionally Prof. Owen would move quickly and be difficult to understand, but overall he was very clear and his blackboard notes are amazing.  Even when I forgot most of the stuff (I'm not a morning person and tend to get through 9 am classes half asleep, just copying what I see on the board), my class notes saved me.  The textbook is pretty good, but he diverges from the material by the time he gets to SALCs, and while it helps in one's understanding, it is the class notes and the problem sets that will prepare you best for his exams (though I only took one exam of his, so I'm not sure how good this advice is).  The best part about his half of the course was that, while he seems a little intimidating at times, he's super-friendly and he will go out of his way to help you if you ask for help.  A group of us once asked him for an appointment, and he stayed until almost 8 pm (three hours, I think) answering our questions and patiently guiding us through how to understand the material and do his problem sets.  It still fills me with amazement and gratitude when I think about how much time he gave us when we were in trouble.  \nMy major gripe is that I would have appreciated a practice midterm.  I don't understand why teachers of grad school classes don't follow the example of classes like Gen Chem and Physics, where the teacher will freely give the student old exams as practice, especially since the majority of our grade is the final exam and, especially for this course, we didn't have any midterms as preparation.  The same criticism I have of Professor Norton.  It's such a help... \nProfessor Norton's half ... was okay.  He's not a particularly good teacher.  He's bad at communicating clearly and succinctly (not that I am, either, but compared to Prof. Owen he's quite poor), doesn't have good blackboard notes, sometimes contradicts himself in lessons, has condescending habits (i.e. asking people if they know something specific, and then if someone does, having a conversation about it with them in the middle of teaching; he has pet students that he always calls on; he doesn't seem to understand the difficulty of the subject for undergrads), and his problems are worded badly at times.  Not to mention it's difficult to talk to him one on one. I found that the only way of reasonably dealing with his ridiculousness was just to laugh at it, because otherwise I would cry.  \nHowever, he does know his stuff, he brings up examples in class that are interesting even if his presentation of them is not very effective, and he likes the material.  I've had poor teachers who don't like what they teach, and it's awful--he's better than that, at least.  \nHis problem sets can range from doable to indecipherable and completely ridiculous.  There were way too many times when a group of us undergrads would laugh hysterically while trying to figure out how to answer the problems... Outside help saved my grades on problem sets, but not by much, since I had a TA who didn't seem to understand the concept of mercy.  \nHis final exam was somewhat horrible.  I remember one question where he asked us to copy from memory a catalytic cycle from a paper he handed out in class, and then explain some essential detail that, to be honest, I don't think he ever talked about himself.  (I still kick myself in the butt for not being proactive enough to ask someone before I took the test.) You pretty much have to memorize your class notes and the parts of papers that he talked about in class if you want a good grade.  The one positive of that test was that he brought coffee to the exam, which was a nice gesture of him (though I was so pumped up on adrenaline that I didn't need it).  And to be honest, while taking it, I was kind of happy about how much I actually knew of the material.  Even though I didn't do so well, it made me glad to think that I had gained something out of it, that I understand inorganic chemistry marginally better than before.  It's some crazy shit, and it was a hard semester trying to learn it, but I'm kind of glad I did it. \nThe problem one other reviewer mentioned about his organization on problem sets in Advanced Organic also happened in this class.  He assigned us a long, confusing problem set that covered things we didn't talk about in class, and didn't seem to understand that us undergrads had exams and papers in the interval.  It was okay for me, so maybe I'm complaining too much.. but it just seemed frustrating that he wasn't considerate and didn't understand how much harder it was for us undergrads who had to deal with four or five other classes at the same time, compared to graduate students with only one, or two if teaching.  Plus I'm pretty sure Prof. Norton didn't have a separate curve for undergrads, which in this class I have a feeling would have made a huge difference... \nI don't know if this sums up everything I have to say, but I hope it helps someone!\nWorkload:\nIt's 4.5 credits, and every credit does count... The problem sets take a long time and definitely need to be done with other people.  The exams are long.  If you have a half-half course, it will probably be problem sets every week or other week, plus one exam at the end of each half that acts as a final for that section.  \n"
        }
    ]
}