{
    "prof_info": [
        {
            "prof_name": "Caio Ferreira",
            "prof_id": 13580,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (LitHum)",
            "review_date": "April 06, 2021",
            "review_content": "\nIf you have the opportunity to have Caio as a professor, please please please take his. He's the best. I could not have had a better instructor going into my first year while completely online. Caio was able to make LitHum interesting and engaging for us, even while the entire course had to be done virtually and with most of us never having been on campus at all, which is not something I can say for most of the professors that I had this year. Caio is the most encouraging instructor I've had here, and he gets so excited for and about our participation and contributions to the class. Caio also sends out Google forms very often as well to make sure that the class is going well for everyone and to get our feedback on how to make the course better for us. Overall, he's just an amazing person, amazing instructor, and amazing source to go to for advice. \n\nWorkload:\nLitHum readings, group midterm and final projects, 2-3 papers per semester, and weekly class discussion board\n"
        },
        {
            "course_name": "Lithum",
            "review_date": "May 07, 2020",
            "review_content": "\nCaio is SUCH a great instructor. If you make the effort to speak up a few different times in class, do the work, and communicate with him then his class is a great one to be in. He is extremely understanding and sympathetic to personal hardship or struggles, and he is genuinely concerned for his students' wellbeing and does all he can to make his class manageable but still challenging enough. He takes a lot of class surveys to gauge the opinions of the class and try to meet the needs of as many as possible. His classes were engaging and the approaches that he takes to each book emphasized the similarities and differences between each installment in the LitHum syllabus. If you can get into Caio's LitHum section, do it!!\nWorkload:\nStandard reading associated with Literature Humanities, 3 essays + midterm/final\n"
        },
        {
            "course_name": "Lithum",
            "review_date": "December 21, 2019",
            "review_content": "\nHis discussions were thought-provoking and prepared us well for the final. Midterm only had passage IDs from class discussion so it wasn't too bad. He also gave a lot of opportunities for extra credit. I'd say that he does have high expectations and, as a result, is a little harsh on grading. But overall a really nice guy and would recommend taking lithum with him. \nWorkload:\nstandard lithum workload (with weekly discussion posts) \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 18, 2019",
            "review_content": "\nCaio was a GREAT lithum teacher. His discussions were thought-provoking and engaging, material was not too challenging, and there were lots of opportunities for extra credit. Take his class if you get the chance!\nWorkload:\nOne discussion post a week, 3 essays, midterm + final\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "June 28, 2018",
            "review_content": "\nIf you have the mobility in your schedule to take Caio - DO IT. He may be a doctoral candidate, but he is by far one of the best teachers in the department. A native speaker of Portuguese, he gets the grammar AND why it's so confusing to english speakers. He's incredibly intelligent, but is also very patient when students get confused. He does teach a few literature courses in the department so you may read a good bit of Baudelaire, but he does his best to not make things boring. Caio knows that students don't share the same interests in readings and works to give a range of things so you aren't bored out of your mind during class. A lot of the videos we watched were interesting and didn't feel as if they were designed for kids, but rather geared towards people of college age. In terms of grading, he's very generous, taking into account what you have and haven't seen in class (which also means he won't put something on the test that hasn't been discussed just to trick you), gives a reasonable amount of bonus on the exams if he can, and will even give you a chance to make up points on an exam if he can tell you are struggling with a concept. He's taught both the regular semester version and the summer, so if you need to finish up your language credits in either of these times he is definitely a good choice!!\nWorkload:\nSome readings, but reasonable in length. 3-4 compositions depending on the flow of the course. 4 exams (summer didn't have a cumulative version, just the 4) with the lowest one potentially dropped when doing final grades. A video here and there, but nothing crazy. Homework in the workbook before every class, due at the end of the week. \n"
        }
    ]
}