{
    "prof_info": [
        {
            "prof_name": "Cathy Popkin",
            "prof_id": 114,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Literature and Empire (Russian Lit)",
            "review_date": "November 16, 2016",
            "review_content": "\nListen, I know that all these reviews basically state, \"yada yada yada, the woman is a delight\". But she absolutely is - and it's worth the reiteration.\nCathy Popkin is considerably more than just a highly qualified academic. Despite the fact that she must have read, heard or considered nearly everything there could possibly be to say on the subject matter, my often half-baked ideas have never been so engaged with by somebody in the teaching profession. Her love for the readings is palpable, and her patience and enthusiasm for discussion verges on superhuman. In all sincerity, the hardest thing about the class is not having enough hands to have one in the air, one in the book, and one taking notes at any given moment. If I could come back as an animal, it would be an orangutan, just so I could take this class again and type with my feet. And yes, I'm keenly aware that the tone of this review has gotten well out of hand. You might well conclude that I'm some kind of sycophantic lunatic... but I regret nothing. If you're even remotely curious about Russian lit, please take one of her classes.\nI've also had a class with the equally lauded Liza Knapp. If you're deciding between the two... take both. It's a horrible choice to have to make. If there was any justice, both of these instructors would have gold nuggets. God bless them. God bless Russian literature.\nWorkload:\nThere's a lot of reading, but it's all literature rather than non-fic, and you'll be surprised at how fast you get. Other than that, the only regular work you'll have to do are postings. And as mentioned in other reviews - the posting prompts are great. Honestly the answers write themselves, and it'll help you engage with the material.\nThe tests are graded fairly. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 08, 2014",
            "review_content": "\nI really can't say enough good things about Cathy Popkin. Every classmate I talked to came away from that class last year adoring her, with good reason. She didn't give us some of the busywork that other LitHum classes have (quizzes or blog posts), but we still really engaged with the texts.\nShe's funny, engaging, kind, and for sure the best professor I've had so far. She more than deserves the silver nugget on Culpa.\nWorkload:\nA few papers a semester. I worked hard on them, but I got a good grade.\nParticipation in class is not strictly necessary.\nMidterm and final. Midterm was only passage IDs, where she asks for a couple paragraphs for each that analyze the passage in terms of the novel it comes from. Final was the standard final for LitHum, but she asked us to spend less time on the long passage analysis and more time on the passage IDs. Very fair grader.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2014",
            "review_content": "\nOh man. To be honest, Cathy Popkin is probably the best professor (and teacher in general) that I have ever had. I honestly don't understand how anyone can have such a detailed understanding of so many different works (especially when she's a Russian lit professor by trade). Her class is amazing, and she succeeds in making you interested in some books which are really, really uninteresting on their own. She has an uncanny ability to encourage discussion, which is actually interesting and relevant--none of the wishy-washy grasping at straws you so often see parodied when people talk about English classes. She makes the course as much about life as it is about literature, and about the ideas from the books which relate to us. Yet it's done subtly and tastefully, like so much of this class. She also will go out of her way to do interesting activities on the weekends, such as having the entire class for dinner at her house. Definitely would recommend. Ice skating 6 for sure.\nWorkload:\nIt is what you make of it. Though there's less work in concrete terms than in other LitHum classes (2-3 papers/ semester, no other assignments), a lot is required of you on each one. I'd imagine it's pretty easy to skate by with a B in this class, but Professor Popkin has high standards for giving out As (though you'll find yourself wanting to put in the work to get one).\n"
        },
        {
            "course_name": "Literature and Empire",
            "review_date": "December 28, 2011",
            "review_content": "\nProfessor Popkin is a real treat.  She is always so excited about the reading and full of infectious energy.  She always had a well-prepared organized lecture, which she would deviate from based on comments and questions from the class.  (Speaking of which, it's been my experience that the students in the Slavic Studies department are really impressive.  You can't make culpa reviews of classmates, I guess, but mine were so insightful!)  Every week she posted a discussion question which absolutely stumped me, in the best possible way, making me see patterns in the reading that I could only barely bein to make sense of.  She's not one of those professors who ask questions with one correct answer.  She is completely open to the possibility of a student pointing out something she'd never considered, and it was so great to watch her reanalyze the work in light of a student's remark.  At the same time, she doesn't beat around the bush to call someone out on their bullshit.  If you like Russian literature, take this class!\nWorkload:\nA LOT of reading, often 100 pages for each session, but occasionally skipping a section won't kill you.  Paying attention in class is the most important.  Weekly responses to a discussion question.  A brutal midterm and final, simple identifications but then way more close readings than you could do in the allotted time, although I have a hunch she considers your annotations of the prompts along with your actual essays.  A poorly defined class participation grade (She said you wouldn't be penalized for never saying a thing in class, but it's listed as 10% on the syllabus.  Who knows.)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 18, 2009",
            "review_content": "\nGreat professor, take her class. Her class does more work and she gives only 5-6 kids (out of 25) A-/A grades, but you'll learn more and have more fun than other sections. Our class had outings to museums and her apartment for dinner. She really takes an interest in her students. If you do the reading and put in the work you'll do well. Very macro focus is on broad themes, not a traditional English class you took in high school. Seriously take this prof. \nWorkload:\nStandard LitHum reading (try to do all of it, though you can skim certain assignments), 2 five page papers, midterm final. Final is standard, but her midterm is all passage IDs. She doesn't care about \"who said this\", but wants full bodied answers that relate the quotes (often obvious, including names so you know where they came from) to say something insightful about broad themes of a particular work/the semester as a whole.  \n"
        },
        {
            "course_name": "Literature and Empire",
            "review_date": "December 12, 2008",
            "review_content": "\nThe reading list for this class is wonderful and well worth the time it takes to get through all of it! Professor Popkin is also a great teacher; she is incredibly enthusiastic and it is clear that she truly cares about the material and the students. However, expect a LOT of participation from students even though it is listed as a lecture course. Popkin (and sometimes the TA) also takes a lot of time and effort giving feedback on the weekly question sets, which is nice to receive. If you're interested in Russian lit, this is a good class to take!\nWorkload:\nLots of reading, 2 paragraphs-ish of questions/response per week, midterm, final (no papers)\n"
        },
        {
            "course_name": "Literature and Empire",
            "review_date": "January 01, 2007",
            "review_content": "\nProfessor Popkin is an engaging, enthusiastic professor.  She put together an interesting, well-rounded reading list for the class.  The class is supposed to be a lecture but it really a discussion.  Prof. Popkin is respectful of all students and encourages everyone to speak.  My favorite class thus far at Columbia!  \nWorkload:\nVery light - you write two questions for each assigned reading.  Although it's a Russian lit class, there are only two or three novels over four-hundred pages, and Professor Popkin spaces the readings out well, so the longer assignments are mangeable.  A mid-term and final that allow you to review what you've learned during the semester and which don't require studying if you've gone to class and paid attention .\n"
        },
        {
            "course_name": "Literature and Empire",
            "review_date": "December 24, 2006",
            "review_content": "\nThis class was worse than Frontiers.   It was more like Oprah's Book Club than an actual class.  Professor Popkin asks questions like \"do you guys like Anna?\"   By asking questions that could only produce incredibly subjective answers, no one learns anything.   You will not learn anything about Russia.  Whenever a book contained long passages about Russian politics, history, or religious thought, she would say things like \"don't you just want to skip all over that\" and \"I don't think that's really important.\"  Basically, don't be misled by the \"and Empire;\" Professor Popkin does not encourage you to read the books in their historical context.   You also don't learn much about the authors, how the books were received, where the criticism stands.  It's basically a bad Lit Hum section instead of an upper-level literature course that posits itself as a historical analysis of Russian literature.  The 20th century survey that's taught by Professor Stanton, \"Literary Avant-Garde and Revolution\" is a MUCH better class.     \nWorkload:\nMidterm, final, 2 questions per class (which was actually kind of time consuming; most of us wrote about a page single spaced for each class)  However, this shouldn't be important to you because hopefully, you will not take this class.  \n"
        },
        {
            "course_name": "Literature and Empire",
            "review_date": "March 25, 2006",
            "review_content": "\nCathy Popkin is simply amazing.  With an excellent book list, and her knowledge, she is by far one of the best literature profs I have had.  She is passionate and enthusiastic, interested in what the students can contribute to class and runs a discussion based class very well. I highly recommend, she can seriously help shape the experience of 19th century Russian lit.  \nGrading:  Popkin says that she believes in recognizing the amazing from the less than amazing, so don't expect to breeze through even though the assignments are pretty easy.  If you read the texts and engage with them, there is no need to worry about the grade.  \nWorkload:\nShe assigns students to write two developed questions based on the text for every class.  There is also a midterm and final.\n"
        },
        {
            "course_name": "Literature and Empire",
            "review_date": "December 24, 2005",
            "review_content": "\nI'm not quite as big a fan of this class as previous reviewers.  Prof. Popkin is very nice and intelligent and knows the novels inside and out.  She is also totally approachable, and in a class of about fifty students she learned every name, which is amazing.  And yes the reading list is great.  But this class is too heavily dependent on the students.  If you're in a boring section, the class will be boring.  If people haven't done the reading, the discussion will stagnate (though this only happened a couple of times toward the end of the semester).  In my class some of the most interesting students didn't speak that much, and some of the least interesting babbled profusely.  I have a low tolerance for students who talk even when they have nothing of interest to say, so this really drove me crazy.  Overall, though, the reading list makes this class worth taking.\nOne very good piece of advice--Popkin's main concern is themes.  The whole midterm consisted in identifying five paragraphs by work, author, and a brief (like one sentence) explanation of where the paragraph fit in the story, and then listing themes from the novel that came up in, were hinted at by, or in any way related to the paragraph--you didn't even have to use full sentences.  The themes are the most important part, and the more good themes you can come up with the better your grade will be.  When reading, and in class notes, make sure to note down every theme you can, then make lists of themes for each novel and use them to study for the tests.  If you have read the books, then studying your theme lists is all you have to do to prepare for the midterm (and get an A--geeze I with someone had told me this).  The final was the same as the midterm with the addition of an essay.  She gave lots of choices for the essay topics, all pretty straight forward, and many allowing lots of room for personal opinions, interpretations, etc.  Themes, themes, themes...you'll thank me.\nWorkload:\nlots of reading (especially after the midterm), midterm, final, 2 discussion questions a week (if you pick up on important themes she will love your questions)\n"
        },
        {
            "course_name": "Literature and Empire (Russian Lit)",
            "review_date": "January 12, 2004",
            "review_content": "\nIt is a challenge to describe what Professor Popkin has done to me, how she has influenced me, how incredibly powerful her classes are and how intelligent, knowledgeable, intellectual, nice (extremely nice)... she is so complete. She is definitely the best teacher I've had in Columbia. And about the syllabus -WOW!!! Yes, it's a lot of reading, but reading the last lines of Fathers and Sons or Brothers Karamazov can make you see the world in a very different way, while inviting you into the complex but unique realm of word and metaphor, of color and painting, of PURE PASSION! (You can see how much this course excited me!!!) And as one of the other reviewers comments, the students who took this course with me were quite incredible (of course we got more than one boring and sometimes irrelevent comment -but there's a con to every pro). Also, visit her during her office hours. She is always open to any questions/comments... and I can say that this goes beyond the classroom topics. She's a theacher in both Russian lit and life in itself. A must take course, a MUST KNOW PROFESSOR!!!\nWorkload:\nTwo questions per week (a kind of reaction to the readings) which are challenging but not impossible. A midterm and final. No papers.\n"
        },
        {
            "course_name": "Literature and Empire",
            "review_date": "December 20, 2003",
            "review_content": "\nCathy Popkin is a fabulous teacher.  The secret is she teaches courses that she feels really passionate about-- that's why everyone in this class enjoyed it so much.  Even though there were literally thousands of pages of reading to do, almost the entire class shouldered through them because in her discussions the books just seemed so interesting.\nWorkload:\nWeekly questions (they can be very brief), simple midterm and less simple final.  Her grading system helps the student out a lot-- every question on the midterm was worth 20 points, but you could earn 25... you could actually get a perfect score without touching a question.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 02, 2003",
            "review_content": "\nI completely disagree with other review about Professor Popkin. I am also in her lit hum class and I think that she is a great teacher.  The reason why the class seems boring is that most of the students only read SparkNotes and have nothing to contribute to the class.  Popkin is passionate about every work on the lit hum syllabus. Sure, some of the books are boring and there are times when I don't want to be there but overall it is a great class. She is such a great teacher! Definitely take this class. \nWorkload:\n2 discussion questions each day, 2 papers per semester, a midterm, a final  it's not bad at all\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 16, 2003",
            "review_content": "\nThough well-read and well-organized, Professor Popkin manages to bleed the life out of every single piece of literature we discussed. Breeding a general sense of apathy, Popkin inspires most of her students to only read the Sparknotes, if that much. The two hour sections are interminable, and 95% of the class is so bored that they don't participate. Those who do listen leave the class wondering if anything concrete or useful was discussed.\nWorkload:\nFor each class, you have to prepare two long, thoughtful questions about the assigned readings. One essay each semester (which she grades very hard), a midterm, and a final. Most semester grades fall well below the A range.\n"
        },
        {
            "course_name": "Literature and Empire (Russian Lit)",
            "review_date": "April 10, 2002",
            "review_content": "\nAn incredible course. ItÂ’s hard to find a more interesting reading list, though be ready for some long hours especially when you hit Anna Karenina and Brothers Karamazov. This was a lecture course, but run basically as an engaging discussion. Popkin is passionate, knowledgeable, and very very kind. She honestly cares about students and their ideas, and believes that she can learn from them. She loves meeting with students and provides thorough, insightful comments on exams. Russian literature also seems to attract an interesting group, so look forward to good discussions.\nWorkload:\nTwo questions/comments about the reading o be submitted for each class. Say what you think and feel and you will do fine. Mid-term and Final, challenging but thought-provoking. No papers, if that jiggles your jelly.\n"
        },
        {
            "course_name": "Slavic Languages and Literature",
            "review_date": "December 31, 1999",
            "review_content": "\nVery knowledgeable of the texts, befitting the head of the Lit Hum \"program.\" Lectures are great -- enlightening, often funny, and delivered with an infectious enthusiasm. Mercifully, she also has a sensitive bullshit-detector (an essential for core classes) and will politely point out nonsense for what it is. Paper comments are very helpful. Added texts: \"King Lear\" & \"The Brothers Karamazov.\" Great class, but she's a harsh grader, there have been semester where the entire class went 'A'-less.\n"
        },
        {
            "course_name": "Slavic Languages and Literature",
            "review_date": "December 31, 1999",
            "review_content": "\nVery knowledgeable of the texts, befitting the head of the Lit Hum \"program.\" Lectures are great -- enlightening, often funny, and delivered with an infectious enthusiasm. Mercifully, she also has a sensitive bullshit-detector (an essential for core classes) and will politely point out nonsense for what it is. Paper comments are very helpful. Added texts: \"King Lear\" & \"The Brothers Karamazov.\" Great class, but she's a harsh grader, there have been semester where the entire class went 'A'-less.\n"
        }
    ]
}