{
    "prof_info": [
        {
            "prof_name": "Vidya Dehejia",
            "prof_id": 3960,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Indian Art & Architecture",
            "review_date": "January 01, 2014",
            "review_content": "\nMasterpieces of Indian Art and Architecture (AHUM V3342) was a good class with a manageable work load and somewhat interesting course content. Take it if you need a Global Core which isn't too heavy, yet you still want to learn something sort of neat.\nDehejia is a good lecturer who is concise and straight forward in identifying important characteristics and theories about Indian architecture and paintings. She covers Buddhist, Hindu, Mughal, British and contemporary art in India over the course of the semester. The first half of the course has a lot of religion in it since it shapes the architecture of the period. The class isn't very interactive and pretty much just involves her putting up a PowerPoint presentation and talking about the art in the slides. It's very important that you take good notes on everything she says since it will be on the test. For the most part, the TAs were responsible for this class, not Dehejia.\nIn addition to the lecture, we had hour long discussion sections on Mondays (make sure this fits in your schedule, they're not flexible with the timings) about the topics covered in class and the readings for the week. Arathi Menon was my TA and will be teaching this class in the future I hear. She is nice, but strict and expects her students to actively take part in discussions and do the readings - no BS will help you here. The TAs graded both the exams and the papers. Grading on exams wasn't bad, it's not too hard to get an A. However, paper grading was pretty harsh - very few people got As.\nThe requirements to do well in this class are very straight forward. If you put in the required effort, you should do fine. Expect to do about 50 pages of reading a week. The reading is not too dense and is very similar to what's covered in class, so if you do after the lecture, it's not that bad. Exams ask for definitions and slide descriptions and essays. Slides of art and architecture seen in class are put up. You have to identify the site/piece, date and talk about the theories from the readings and class about it. The exams were mostly verbal diarrhea requiring you to just spill whatever information you memorized about the work. Your hand will definitely ache by the time you're done writing the tests. On the bright side, it's pretty easy to spew various facts on the slides she puts up. To do well on the exams, you must do the readings and pay attention to important points brought up by Dehejia and the TAs in class. I advise summarizing the readings as soon as you do them so you don't have to read them again right before the exam. If you're really lazy, you can manage to do all the readings about 2 days before the exam, but be warned, many of the books are on reserve at Avery, so you might not get the book at the last minute.\nDehejia covers most of the important theories in class. Pay attention to those in particular and look for them in the readings. Note them down as points, and make sure you mention them in your exam responses. Everything else is extra material which isn't as important.\nAll in all, this is a pretty decent class to fulfill the Global Core requirement. If you're an engineer, this is a good class. No vague BS nonsense, just straight forward facts. It's a guaranteed A if you do what is expected of you, which isn't much: about 2-3 hours of effort a week on average.\nWorkload:\nTwo 3 page papers on idols from the Met (15% each)\n1 midterm (30%)\n1 final (30%)\n10% participation in discussion sections\n"
        },
        {
            "course_name": "Masterpieces of Indian Art & Architecture",
            "review_date": "December 17, 2013",
            "review_content": "\nThis is coming from a math major who took this class as a global core not knowing what to expect and trying something completely outside of my comfort zone.  Who knew I would elect to take another art class outside of art humanities?  And let me tell you, it was damn well the best decision that I ever made.  From the first lecture I knew that I found my global core class - her power points are so well put together, and the class is so interestingly organized - we started with Buddhism art, Hindu art, Islamic art, then Modern art.  It was such a fantastic way to set up the class and I learned so much than I ever thought about these interesting religions.  She is by far the best lecturer I've ever had, speaking very clearly and connected (actually this isn't saying much considering I'm from the math dept, but still).  Also the work load is very manageable -  low, even.\nWorkload:\n2 3pg essays on an artwork, midterm, non-cumulative final.  assigned readings for every class but you can prob get away without them if you pay attention during class and recitation \n"
        },
        {
            "course_name": "Indian Temple",
            "review_date": "March 19, 2012",
            "review_content": "\nProfessor Dehejia is first and foremost one of the top art historians of Indian art and architecture...in the world. She is cited in almost every article and book that has been published since she began her career. It's kinda scary but true. However that's not to say that she is above and beyond teaching a smallish lecture class. The class is structured in such a way that almost every class she presents a powerpoint, gives out a handout with important dates/names/info and perhaps discusses an assigned reading (articles relating to the temple site that's discussed).\nHer powerpoints are  clear yet thorough and it is obvious that she knows her shit. As someone who never studied Indian ANYTHING, she made it incredibly easy to understand. Granted the articles may be a bit confusing, given the wording and the fact that you have to read them before the lecture so have no idea of the site they refer to, Dehejia does a great job clearing that all up in class. She strongly encourages class participation and it's somewhat expected that everyone will at least comment once if there is an article for that class. She does not necessarily judge you on how smart those comments are however, she will give you a look if it's clear you haven't done the reading. She was familiar with all arguments of the topics brought up and most of ones that students diverged on. That being said though, it really didn't matter what you said although, she really does love to hear new theories.\nThe powerpoints were very informative and if you go to class and take notes or write down whatever it is that will help you remember what she says, you will be golden for the midterm. She clearly is very passionate about what she does and wants her students to have as well-rounded views on the topics as she has herself. Given how little most will know going in and how foreign the concepts were, it doesn't take too much effort to get a decent grade.\nWorkload:\nReadings: maybe once a week or every other, sometimes longish and perhaps confusing for someone unfamiliar with the topic but that will be made clear once she presents her ppts in class. Overall quite manageable considering that is the only work required for a class that meets twice a week.\nGraded on: Participation for discussion of readings in class, one comment will suffice. Submitted work: 2 small critical analyses/papers (3-4 pgs) on readings done for class, making an argument about a point in them. Midterm (EASY ids and discussion of material covered in class, very straightforward) Final paper (no exam) that was about 8 pgs on one of the choice of topics handed out\n"
        },
        {
            "course_name": "Patronage and Monuments of S. Asia",
            "review_date": "May 15, 2007",
            "review_content": "\nThe previous reviewer needs to find another forum in which to grind his obviously personal axe. Granted, he or she may have had real problems with Dehejia - whatever the nature of the bereavement - but how on earth is someone's choice of writing surface an adequate reason for resorting to name-calling ?  Or the lack of differentiation between students: I'm sorry, but the proof's in the pudding. If the work doesn't cut it, no amount of in-person recognition is going to make a difference. \nPerhaps writing about \"obscure caves\" can be tough going, but that's what office hours are there for - then maybe you'll give the prof a chance to get to know you. \nWhich will obviate the need for the vitriol and the whining. \nTrue, Dehejia doesn't exactly set the classroom on fire, but she is 1. a lucid speaker, 2. unassuming of prior knowledge (this both a pro and a con), 3. very fair in all respects, and 4. absolutely solid (and then some) in her scholarship and area of expertise. And this, I'm positive, applies to ALL students whatever their major. \nWorkload:\nFairly manageable for a seminar. \n"
        },
        {
            "course_name": "Patronage and Monuments of S. Asia",
            "review_date": "May 15, 2007",
            "review_content": "\nThe previous reviewer needs to find another forum in which to grind his obviously personal axe. Granted, he or she may have had real problems with Dehejia - whatever the nature of the bereavement - but how on earth is someone's choice of writing surface an adequate reason for resorting to name-calling ?  Or the lack of differentiation between students: I'm sorry, but the proof's in the pudding. If the work doesn't cut it, no amount of in-person recognition is going to make a difference. \nPerhaps writing about \"obscure caves\" can be tough going, but that's what office hours are there for - then maybe you'll give the prof a chance to get to know you. \nWhich will obviate the need for the vitriol and the whining. \nTrue, Dehejia doesn't exactly set the classroom on fire, but she is 1. a lucid speaker, 2. unassuming of prior knowledge (this both a pro and a con), 3. very fair in all respects, and 4. absolutely solid (and then some) in her scholarship and area of expertise. And this, I'm positive, applies to ALL students whatever their major. \nWorkload:\nFairly manageable for a seminar. \n"
        },
        {
            "course_name": "Rock-cut Architecture of India",
            "review_date": "December 19, 2006",
            "review_content": "\nI seem to be in the minority in my opinion here, so I am not going to write this review for art history majors, who, as far as I can tell, seem to have a vastly different view of what defines a 'god-awful' teacher. As an architecture student I feel that  Vidya Dehjia is exactly that; God-awful.\nFirst of all she doesn't distinguish between her students at all. That might be fine for a grad student with experience in writing exausting paper on obscure caves, but for the undergrads it can be brutally hard. \nSecondly, when given a choice of blackboards to write on, she will invariably choose the one that impossible to see for as many students as is possible.\nThirdly, she will make rather unpleasant insinuations about the (ficticious) nature of your grandmother funeral. \nYou have no idea how badly I wish this last part wasn't true.\nThe catharsis of sending off the final paper, and therefor NEVER having to have ANYTHING to do with this professor EVER AGAIN, has completely drained me of my will to spew obscene comments about how she has wasted her life doing a god awful job of teaching an absolutely horrendously boring and meaningless subject with no greater connections to the larger realm of art history (or at least no connections she was capable of conveying) but I must reiterate:\nVidya Dehejia is a hack. \nIf you need this class for a requirement, I dont care how hard it is to reschedule, there is NO POSSIBLE WAY that you have exhausted all the other options you have for filling an art history credit. \nWorkload:\nExactly as much as it will take to make you sick of the subject, but not nearly enough to motivate you to do a speck of work before it is absolutely necessary. \n"
        },
        {
            "course_name": "Indian Art & Architecture",
            "review_date": "December 28, 2005",
            "review_content": "\nProfessor Dehejia was terrific. I went into this class with pretty low expectations (looking to take care of the art history/cultural diversity requirements) and was pleasantly surprised. This class ended up being my favorite last semster due to the expert lecturing ability of Dehejia and the fact that the class was so well run. The lectures and the reading relate well to the exams and in the end if you do poorly it's your own fault. There's a fair amount of reading but not too much, especially for an art history class, and it all fits well with the course so you don't feel like it's all superfluous or a waste of time. The exams are a little daunting before hand but if you go to the review sessions and attend class (very important if you feel like slacking off on the reading a little). The TAs were great and always available for help. The papers were fun and fairly graded as well. My only complaint is that before the mid-term Professor Dhejia and the TAs kept saying they were looking for the broad strokes but when I got my exam back I wasn't very happy with my grade (particularly because I listed all the major points and nailed every ID). \nAnyway, I scored an A- for the class in the end and you should too if you attend all the lectures.\nWorkload:\nNot bad at all. In fact, I would recommend taking this class if you have a heavy load elsewhere. There was an average amount of reading but it's easy to get through and pretty interesting. The mid-term and final are in the fair to tough range but if you just study your notes or some flashcards a few days behorehand you should be okay. One two page paper on an object from the museum and another two pager on a trip to a mosque or temple.\n"
        },
        {
            "course_name": "Masterpieces of Indian Art and Architecture",
            "review_date": "December 17, 2005",
            "review_content": "\nDehejia is an extremely competent teacher and well-\nversed in the subject. In addition to her quite literally writing the book, she expounds upon the subject in accessible and enjoyable ways.\nSubject matter is relatively easy to comprehend and the tests are not difficult. Essentially, the readings comprise the majority of the instruction, so pay attention when doing so. The class discussions are not as extensive as other classes, but lively nonetheless. \nThe tests are a \"name that tune\" affair. Slides remain on view for 10 minutes as you write about the significance of the piece and detail any arguments and theories heard in either the class or in the readings. It is easy to fill 2 bluebooks front and back writing about the pieces though.\nI would wholeheartedly recommend this class. A perfect class to take for Art Humanities requirements and a fine one indeed for meeting people and making connections.\nWorkload:\nmidterm of moderate length; final of attrition... very long and arduous affair, but relatively easy; 2 papers both requiring first-hand off campus research; nightly readings (ranging from 5min - 2 hours); attend class... it is nigh-essential\n"
        },
        {
            "course_name": "Masterpieces of Indian Art & Architecture",
            "review_date": "July 12, 2005",
            "review_content": "\nProfessor Dehejia is a very good instructor who clearly knows her subject about as well as anyone in the world.  She lectures well, she is friendly when students ask questions, and she gives reasonable assignments and middle of the road exams that don't require an undue amount of memorization for an art history class.\nYou can do well in this class if you pick two of the three: show up at every class and take good notes, then go back over the excellent course web pages and match your notes to the slides shown there -- they're almost all there -- OR do not just the reading from the pretty, but lightweight, main textbook but also the more serious academic papers from the course reader too - OR go to the TAs review sessions and cram, cram, cram all the IDs so you never get one wrong.  If you're willing to do all three, you will do very well and learn a lot, too.\nBefore I came to Columbia I was a Bacherlor of Fine Arts candidate (in the visual arts) at another university.  Let me just sum this up by saying that if you don't like taking art history with Professor Dehejia, I could recommend a few instructors to you who would make you *beg* to go back to this class instead!\nThe TAs seem to do most of the grading, but they are well managed and seem quite consistent.  No real complaints there either.\nWorkload:\nReading -- you can get away with doing the heavier reading from the course pack just before the midterm/exam but you probably can't get away with skipping it completely.  Papers: one on an object, one on a visit to a mosque or temple (you'll need a weekend day free for this, but it's fun).  Midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Indian Art & Architecture",
            "review_date": "January 03, 2005",
            "review_content": "\nYou will not regret taking this course.  There is no BS here. Everything is straight forward.  The subject is quite interesting. If you know nothing about the subject, you will be pleasantly surprised. Prof. Dehejia is extremely knowledgeable and approachable.\nWorkload:\nManageable reading for every class, 2 short papers, a midterm, and final.\n"
        },
        {
            "course_name": "Indian Art and Architecture",
            "review_date": "December 27, 2003",
            "review_content": "\nIt was great to be taught by someone who has so much authority in this field -- simply put, Professor Dehejia is outstanding. Her quiet, calm manner and vast knowledge of the material made for one of the best experiences I've had with the Art History department yet. She is thorough, engaging, and loves to answer questions and to hear different ideas from students. She breaks down a part of the world about which little is known and makes it accessible and fascinating. Take this class to fulfill the non-Western distribution requirement. You won't regret it.\nWorkload:\nOne research paper about an object chosen in a museum, one floorplan assignment, a midterm, and a final. Make sure to be concise in your answers and thorough in your explanations. She's not a tough grader by any stretch of the imagination. This is one teacher who wants her students to do well and is always on-hand during office hours to help any way that she can.\n"
        },
        {
            "course_name": "Masterpieces of Indian Art and Architecture",
            "review_date": "December 21, 2003",
            "review_content": "\nProfessor Dehejia is really solid on her material. She's worked extensively in both research and curating fields, and is a pretty well-renowned figure in Indian art circles. Her lectures are extremely informative and insightful, and she tends to encourage student participation at all times, especially on class readings. Her command of the subject is overall terrific. The only problem that I found, and it wasn't really a huge issue at all, was her lack of warmth. While she occasionally liked to joke with students, she was one of my least personable professors, which was particularly frustrating as she's such an authority in her field. Other than that, it's a great class to take if you're interested in this topic.\nWorkload:\n2 fieldtrip assignments: one is a discussion of a painting/sculpture with some research involved, and the other a floor plan sketch of a monument. there's a midterm and a final, non-cumulative - all graded really generously. she really helps you to do well. \n"
        },
        {
            "course_name": "Indian Art & Architecture",
            "review_date": "December 02, 2003",
            "review_content": "\nProf. Dehejia is a great professor, and her classes are definitely worth taking.  She's well-informed and well-organized, and the workload she assigns is eminently reasonable, as are her tests.  The focus here is on learning rather than memorizing, which is welcome in a department whose profs and TAs can be overly anal when it comes to memorizing details.\nIt's a fantastic subject, and not one that most people know much about.  This is a great class to take if you know nothing about the subject -- you'll learn a hideous amount without having to stress.\nWorkload:\nA midterm, a final, and 2 short papers.  No curve, but she grades easy.\n"
        },
        {
            "course_name": "Masterpieces of Indian Art & Architecture",
            "review_date": "December 19, 2002",
            "review_content": "\nIf you don't want your GPA to plummet, if you don't want to sit pointlessly in a lecture where you'll know as much about Indian art as when you started (absolutely nothing), if you don't want to be taught by someone who makes your life miserable, then don't take this course!! Save yourself!! She takes points off for putting the correct answers in exams and papers, and seems to have a policy of giving hard workers a C or D. It was a horrible mistake. Please avoid it.\nWorkload:\nReadings are not excessive but come out of a book that is written for elementary school children, yet the exams are graded as if you were getting your doctorate.  One midterm, final, a paper, and a required excursion to a mosque or Indian temple\n"
        },
        {
            "course_name": "Masterpieces of Indian Art & Architecture",
            "review_date": "November 21, 2002",
            "review_content": "\nExcellent! She's a winner. Her lectures are both informative and allow for dialogue in a class of 40: ask questions as she likes it and you'll learn more. For GSers dreading that Art Hum requirement - THIS IS THE WAY TO GO! Made herself readily available for assitance with readings and assignments, and in general a very approachable professor. \nWorkload:\nmidterm, final, object paper, and temple/mosque floorplan. 30 - 40 pages of INTERESTING and THOUGHT-PROVOKING reading each class. exams required some memorization of definitions, dates, and names, but mainly worked on visual analysis.\n"
        }
    ]
}