{
    "prof_info": [
        {
            "prof_name": "Dorothea von Mucke",
            "prof_id": 1846,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Survey of German Literature: 18th Century",
            "review_date": "May 23, 2011",
            "review_content": "\nThere is no doubt that this professor is smart. But there is also no doubt that she is biased and grades according to who she likes and dislikes. A couple of weeks into the class, it becomes obvious who makes her list and who doesn't - and if you don't, beware. She will pick on you for everything - be it because you're 1 minute late once (while ironically enough, she is late herself most of the time), be it because you didn't do the reading (irrespective of the fact that she didn't list it in her every changing, never up-to-date syllabus) or be it because your essay is too long, too short, too wordy, or simply \"a sequence of true enough statements.\" But if you're her favorite, you're good. You can be late, miss at least 30% of class, do about 50% of the homework and barely participate and still do just fine.\nI do not doubt her intelligence, but I have never had a professor that was unorganized, subjective and unprofessional to such an extent. If she does not like you, she will be mean on a personal level. She is also an avid advocate of fighting grade inflation, so don't expect an easy class. I obviously wasn't one of her favorites and getting an A- out of the class was no easy task: I did all the homework, attended and participated in every class, and was always among the first to post on courseworks. \nThe class definitely is intellectually stimulating, the readings are for the most part interesting, and class discussions were abundant. Just hope that she decides to like you.\n \nWorkload:\nShe expects about 8 hours of preparation for each class.\n"
        },
        {
            "course_name": "Aesthetics & the Philosophy of History",
            "review_date": "January 14, 2011",
            "review_content": "\nA REVIEW FOR UNDERGRADUATES:\n   Definitely take this course. In my years at Columbia, I've been greatly disillusioned by how \"specialized\" and myopic some professors in the humanities seem to be, but Prof. von Muecke is gold. She has the ability to cover such a wealth of topics in this class that it's impossible for you to not find something that makes this class worth taking--it will definitely be valuable for your humanities major, whatever you're studying. It sounds like a bold statement to make, but it is so true. Because a lot of undergraduate major requirements are twice-a-week mind-numbing surveys and lectures with professors who don't care about you and petty TAs, take advantage of the seminars offered in small departments. Prof. von Muecke is a jewel (who actually cares about her students) and this class is in English. There's no reason to not take advantage of one of the richest intellectual experiences you can have as an undergraduate. It also lets you focus on or explore something you find of interest for when you have to write your final paper, instead of having to stress about memorising a bunch of lectures for a midterm and final and/or writing a bunch of papers for TAs to grade (meaning writing a bunch of papers that don't let you think outside the box and have to be limited exclusively to what the professor has superficially covered in a 1 hr and 15 min. lecture). This class is simply a perfect example of what I expected out of a college education. \n   Also, if you're intimidated by the fact that this is a graduate 4000-level seminar, don't be. The class is serious business and the material can be difficult sometimes, but the professor's lecture and the class discussion make everything so much clearer. I think Prof. von Muecke values participation, but if you're the quiet type, just visit her during office hours. Like I said before, she *really* cares about her students.\nThe class material includes Winckelmann, Lessing, Herder, Hegel, Kant, Nietzsche, Heinrich von Kleist, etc.\n\nWorkload:\nThe professor asked the class if they wanted response papers to be optional or not. She reads your response papers if you want (e.g. if you had trouble with the reading and want her to comment on your response, you should probably do this). You have the choice of either a take-home midterm + take-home final (I don't remember how many pages) OR a final paper on the topic of your choice (Prof. von Muecke prefers quality over quantity, the paper can range from about 8 pages to I think a limit she'll give you--she's not one of those professors who's out there to count pages, she actually cares about content). The readings are roughly 50-100 pages per week, but there's no reason you can't do it--just read 10-20 pages per day. She's also not out there to \"catch you\" if you had difficulty with the reading and couldn't complete it. Just go to her office hours. Also, the reading can become \"pleasure reading,\" so if you're complaining that school doesn't let you read what you want, take advantage of classes like this, which are actually interesting.\n\n"
        },
        {
            "course_name": "Intro to German Literature",
            "review_date": "August 02, 2005",
            "review_content": "\ni sometimes dreaded the class because the readings weren't fun.  but no one can deny Dorothea's brilliance.  yes- she's strict- but only because she wants to maintain an academic environment and not allow class to turn into coffee hour. she'll invite you to coffee, wine, cake at her place. \ni would take her class again \nWorkload:\nwasn't bad EXCEPT the time she gave an extremnely difficult assignment. so difficult 1/2 the class opted not to do it; and so she decided we would do it as a group effort. it sucked for those of us who spent days struggling with it on our own \n"
        },
        {
            "course_name": "Intro to German Literature",
            "review_date": "January 11, 2005",
            "review_content": "\nProf. von Muecke is at times very severe and quite strict (no eating in class, no late assignments, usw), but one of the most intelligent teachers I have met at Columbia/Barnard.  She expects a lot of work and class discussions are painful when noone has done this, but the topics discussed are fascinating (when one is interested in literature and literary theory.)  She is personally very nice: responsive to personal questions and quite willing to alter the course to better fit the students.  A very engaging teacher.\nWorkload:\nshe expects 3 hours of preparation for each class session; when you don't do this, discussion does not go well!  the grade is out of 4 small papers and participation and a small oral report\n"
        },
        {
            "course_name": "Intro to German Literature",
            "review_date": "January 14, 2004",
            "review_content": "\nThere was certainly the high expectation of intense preparation for each class, which she aptly called seminars.  The syllabus was packed, but each of the the carefully selected readings was examined through a rich class discussion, so I never felt like I was wasting my time with time-consuming preparation for each seminar.  It was tough for some of the less-fluent speakers to follow some of the abstract ideas being covered, but there was such a volume of discussion being had in each seminar that sooner or later a subject that everyone could understand was bound to come up.  I admire her dedication to her profession, which showed every time class ran 20 minutes overtime (Be prepared, that's pretty much every time.), and trust me, she is more than charming enough to get away with it.\nWorkload:\nA few hours of reading/prep time for each class, 5 short (1-2-page) papers, and a 10-20 minute oral presentation.  Grading seemed fair, and feedback was plentiful.\n"
        },
        {
            "course_name": "Intro to German Literature",
            "review_date": "December 09, 2003",
            "review_content": "\nProf von Mucke is a wonderfully sweet lady who is intelligent and caring at the same time.  Although she had a tendency to speak very fast, she was willing to slow down for some of the students who were less fluent and even explicate some vocab and idioms.  The material was interesting and challenging but she made it accessible.  She's also quite demanding in terms of the amount of work we put into this class (she expects at least four hours a session??)  but if you do that, you end up getting a lot out of it.   Prof von Mucke is absolutely brilliant and not condescending at all, we felt very comfortable posing questions and stating comments at any time.\nShe invited us over to her house for strudel and cider, and really tried to get to know us personally by making us go to one of her office hours.  All in all, highly recommended--she's awesome! \nWorkload:\nfive short papers (1 pg each), but you only need to do four; an oral presentation and a LOT of reading\n"
        }
    ]
}