{
    "prof_info": [
        {
            "prof_name": "Taryn Zarrillo",
            "prof_id": 9685,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 23, 2010",
            "review_content": "\nTaryn was absolutely wonderful to have as a teacher. I took Art Humanities during the summer, so she had the difficult task of cramming the course into eight weeks in two hour class sessions. She really values discussion, even when people are not comfortable with the subject material. Anyone can have an opinion as long as they are willing to defend it.\nShe also really encourages field trips. We visited museums five times (including the Met, the Cloisters, and MOMA), and each experience was wonderful. Taryn is a superb lecturer, and she really shines outside of the classroom. We also visited Christie's in order to gain a sense of what artwork is worth.\nIf you get Taryn, feel very lucky. My only regret is not getting a chance to do her famous Pollack project due to summer time constraints.\nWorkload:\nTwo papers; two group projects (horrible to organize, but assigned in order to ensure that no one hides in the back of the class per se); midterm; final. Tests were heavy on identifications but always contained a loose component like organizing an exhibition.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 10, 2010",
            "review_content": "\nCould not agree more with the previous reviewer!! Prof. Zarrillo is a very nice, engaging and fun lecturer who presents Masterpieces of Western Art with a very refreshing mixture of personal knowledge on the material, documentaries such as \"The Power of Art\" by CU's own Simon Schama (well worth checking out on YouTube) and even let the class make their own \"Autumn Rhythm\" style art piece near the end of the semester. This last bit was not only very enjoyable but helped me really get a sense of what the interaction with an artistic medium is really all about, something that you really can't understand from just reading about it. Overall, primarily given the light workload for this course, I can't recommend Prof. Zarrillo enough!\nWorkload:\nShort readings for each class, two papers (one formal analysis, one exhibition review), a midterm (IDs, comparisons, and essay) and a take-home final (design your own exhibition from the course artworks)... everything is graded very fairly\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 29, 2009",
            "review_content": "\nHonestly, I couldn't have loved Art Hum more. She is super passionate about art, and wants her students to love it too. She even incorporates interesting and entertaining videos by her Advisor that are relevant to the subject matter. For the Jackson Pollock lecture, she surprised us by bringing in a canvas the exact same size as Pollock's \"Autumn Rhythm\" and brought the same color of paint, and many brushes for us to try to recreate his art. It was a great bonding experience for the class, and honestly, how many times are you going to be able to splatter paint on a canvas at Columbia.\nWorkload:\nExpected Art Hum workload, fairly light ... light readings, two short papers, mid term and final, all graded pretty fairly\n"
        }
    ]
}