{
    "prof_info": [
        {
            "prof_name": "Anar Akhmedov",
            "prof_id": 6617,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "April 28, 2009",
            "review_content": "\nRun...just run.\nWorse professor in the world.  Everything about him repulses me... from his teaching style to his profuse use of cheap cologne.  Sound harsh? It's meant to be.  I had to pass/fail this class.  First exam was fairly easy, the next two were impossible. The homework sets are endless, and the problems he chooses are the last and hardest ones in the problem set.  He covers topics in class only on a surface level, but expects you to know the topic inside and out.  If you can, avoid him at all costs. \nWorkload:\nincredibly long and difficult weekly homework sets, 2 midterms, final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "February 17, 2009",
            "review_content": "\nWorst teacher/professor I have ever had. I went to lectures the first 2-3 weeks and found myself having to read the sections in order to understand what the hell was going on. Eventually, I stopped going to class and only showed up for exams. I think my friends and I went to class about 7-8 times total the entire semester. His English is horrible, he hates being asked questions (mostly because most of the time he does not understand your question and will answer everything else besides the question you asked), and he makes you feel dumb when you ask something, because he just points to the boards and says, \"Well it is all here, what don't you understand?\" He was very disorganized, spent a lot of time on proving formulas, and no time at all on showing you how to use them or what they meant. Yet, he expected you to know what the meaning of every variable and every formula on the tests, without having taught it.\nThere was a problem set every week, which ranged from extremely easy (will take you 20 minutes to complete and can fit it on 1 page), to ridiculously hard (will take you up to 10 hours and you will write 20 pages). However, he did not weigh them according to difficulty, so each problem set was worth the same, which is unreasonable. \nThe first midterm was \"too easy\" as he put it, since the mean score was a B, so he made the second impossible, with an average of 60%. After much deliberation, we somehow convinced him to curve it, so he made the average a 70% and said that this was reasonable. About half of the problems he hadn't covered in class, and the people that got them right said they had basically memorized the entire book. He made the final possible, but only if you studied your ass off and knew every definition and every proof in the book. He curved the final grades but only because he had to. Without the curve, there would have been about 5-6 A's (all the grades were public) in a class of over 70 people (and those were the people that had taken Calc III before).\nOverall, if you can avoid taking him, run as fast and hard as you can, because this man will make your experience miserable. I felt like I never even had him because I basically taught an entire year of Calculus to myself. He did not help whatsoever. \nWorkload:\nReasonable - one problem set a week. Most took 2-3 hours to complete with a few exceptions on both sides (as mentioned before).\nTwo midterms - have to study A LOT, like learn the entire book forwards and backwards if you want to even have a shot at getting anything higher  than a C. Knowing the material fairly well might get you a B in another class, but here it will result in an F...a low F\nHard final, but reasonable\n"
        },
        {
            "course_name": "Calculus IIA & IIIA",
            "review_date": "January 08, 2009",
            "review_content": "\nA pretty good and fair teacher. \nLectures:\nFor a good majority of the semester, his lectures were mostly straight out from the textbook's own examples, and I was tempted not to go to class, especially since his style is not very exciting. However it seemed near the end he started to pull questions from the textbook and demonstrate how to solve them. He tries his best to explain new concepts, but his explanations were often quite theoretical and I found that real-life examples (in the textbook) made the problems more accessible. He will spend a lot of the time on proofs, although towards the end, it was more problem-solving oriented. He tries to get the class involved occasionally by asking, \"How do you think we should approach this problem?\" but for the most part we just sit silent.  \nOffice hours:\nHe's very free and very willing to help and repeat what he said in class. Very approachable due to his soft-spoken and mild nature.\nGrading: course grade is curved, so that's nice. \nHomework - TA grades the assignments. Picks 2 problems out of the 6-108 assigned a week to grade. I found the homework the hardest, in comparison to the midterm and the final. The questions were usually doable, but he would throw in a few really complex ones. Homework counts! So turn it in. You get to drop one though. \nMidterm and final - 6 questions for mid (two midterms), 10 for final. One or two Extra Credit questions. The midterm and final are very straightforward, straight from the examples and homework. Virtually nothing was unexpected or highly complex like a few of the problems on the homework, or \"a new twist on an old problem.\" When there were a few, he basically curved it so that those problems were dropped. He preps you pretty well for the mids and final by listing suggested problems to go over. \nWorkload:\ntwo midterms, one final, about one homework assignment a week consisting of 6-10 problems \n"
        }
    ]
}