{
    "prof_info": [
        {
            "prof_name": "Richard Korb",
            "prof_id": 445,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Accelerated Elementary German GERM 1125",
            "review_date": "April 30, 2015",
            "review_content": "\nHE IS AMAZING!!!!!!!!! The class is really fun, and you'd be surprised at how much you actually learn. I took the class with absolutely no prior knowledge of German and I instantly fell in love with it. \nIf you're thinking about taking German Richard Korb is your man! He's smart, funny, creative, helpful etc etc...basically everything you want in your language instructor.\nAnd if you're deciding between German I or Accelerated I and II, I say go with the accelerated! It's obviously more work, but I do think spending 2 hours a day 4 days a week in class speaking the language helps tremendously with getting comfortable with it. And the class will typically consist of 6-10 students, who you will grow really close to. \nWorkload:\ndaily assignments, papers, presentations, group projects, little skits, tests, written and oral final\nthis class will probably take up quite a bit of your time, but it's totally doable \n"
        },
        {
            "course_name": "Accelerated Elementary German GERM 1125",
            "review_date": "October 08, 2011",
            "review_content": "\nI've taken a class with prof Korb. he's alright. he makes mistakes cause he's not a native speaker (Alex von Thun is the man if you really want to know stuff and not just taking it  to pass it). otherwise if you like the kindergarten way of teaching languages common at Columbia U, this is your class. korb does what he's requested to do: make you feel good and not a complete moron unable to learn languages. this is his profession and life. personally, already speaking 5 languages, this class was very slow, and I hate being treated like a baby. But if you're American and  an idiot, this is the class for you! as you will want to study more German, the intermediate and upper classes are even less demanding! this is really the easiest way to prove you speak a language without actually knowing much about it. and this is Columbia, grade inflation is the real shit!\nWorkload:\nAverage. you won't be too stressed. Korb, like any other lecturer, is dependent on his evaluations, so there won't be any brain damage. you'll be able to be stupid for the rest of your life.\n"
        },
        {
            "course_name": "Accelerated Elementary German GERM 1125",
            "review_date": "December 30, 2008",
            "review_content": "\nProfessor Korb is an amazingly talented instructor, and that's a very good thing if you're taking Accelerated. His specialty is language pedagogy, and it shows. The class meets 2 hours a day, Monday through Thursday, but the time always felt worthwhile and the class activities were always well-planned. \nThis is immersion teaching, which could be scary for some, but it makes you learn so much (especially when you have class essentially every day), and Korb definitely facilitates participation. \nDon't let the title scare you, this course is for absolute beginners with 0 German.  I wish I had known about this class when I was a freshman!\nWorkload:\nNightly homework (2 or 3 textbook exercises), a composition (never more than a page) every 2 weeks or so, group presentations. Tests about biweekly, midterm and final. It can be frustrating to have homework every night of the week, but considering the class is 8 points, it's not bad at all, you'll definitely spend less time on it than if you had taken three 3pt- classes.\n"
        },
        {
            "course_name": "Accelerated Elementary German GERM 1125",
            "review_date": "April 17, 2008",
            "review_content": "\nIf you have any interest in learning German, TAKE THIS CLASS!  Richard Korb is an excellent choice for language instruction (and as one reviewer mentioned, it is his specialization--he even teaches a class for the grad students on language pedagogy).  From the very first session, everything is taught in German, and with 8 hours of class time per week, this turns out to be very helpful in getting an ear for the language.  Korb is very personable and makes sure that everyone feels welcome to and actually does participate; he also has a wonderful sense of humor.  You will spend the entirety of every session interacting with the instructor and with other students and the time really does fly by.  Even if you spend little time outside of class studying (which is not wholly recommended, you will learn a tremendous amount of German.  [And if the above isn't enough of a testament, 4 of 6 undergrads in our class who had never studied the language in their lives decided to major in German (myself included), and a 5th decided to minor.]\nWorkload:\nDon't let the 8-point thing scare you.  You will have homework everyday (about 1-2 hours), but this is the case for any language class; chapter tests every other week (which are not difficult if you are keeping up with the work); 4 short 1-2 page compositions; oral exam & final.  And you get 8 CREDITS.\n"
        },
        {
            "course_name": "Elementary German",
            "review_date": "May 07, 2004",
            "review_content": "\nComing from the land of 7 years of absolutely insane French teachers, I braced myself when singing up for this class. Don't. Richard is wonderful, and is a hundred times better than any language teacher I've had in the past. In fact, I haven't met a single person in the German department here that I haven't liked immediately--it's a fantastic department. Richard knows his stuff, he is smart, incredibly funny in class, and devises clever and engaging assignments and activities. In one semester you will leave the classroom with an impressive arsenol of words and grammar constructions... in French, it took me at least 3 semesters to get to where I am now in German. I really cannot offer enough praise for this class, this was the only class I looked forward to this semester. I did not originally intend to continue German classes for very long, but I have totally fallen in love with the language and plan to take it through my college career. Honestly, I think than Herr Korb is largely responsible. Deutsch is sehr toll!\nWorkload:\nIt's a pretty fast-moving class, so you need to spend time on it and keep up. Bi-weekly tests (fairly easy), 4 essays, frequent written homework, oral exercises on the computer, and small projects. The assignments are usually fun... over spring break, we were required to keep a journal of our daily events and then translated it into the past tense when we learned it upon return to school. \n"
        },
        {
            "course_name": "Elementary German",
            "review_date": "May 07, 2004",
            "review_content": "\nComing from the land of 7 years of absolutely insane French teachers, I braced myself when singing up for this class. Don't. Richard is wonderful, and is a hundred times better than any language teacher I've had in the past. In fact, I haven't met a single person in the German department here that I haven't liked immediately--it's a fantastic department. Richard knows his stuff, he is smart, incredibly funny in class, and devises clever and engaging assignments and activities. In one semester you will leave the classroom with an impressive arsenol of words and grammar constructions... in French, it took me at least 3 semesters to get to where I am now in German. I really cannot offer enough praise for this class, this was the only class I looked forward to this semester. I did not originally intend to continue German classes for very long, but I have totally fallen in love with the language and plan to take it through my college career. Honestly, I think than Herr Korb is largely responsible. Deutsch is sehr toll!\nWorkload:\nIt's a pretty fast-moving class, so you need to spend time on it and keep up. Bi-weekly tests (fairly easy), 4 essays, frequent written homework, oral exercises on the computer, and small projects. The assignments are usually fun... over spring break, we were required to keep a journal of our daily events and then translated it into the past tense when we learned it upon return to school. \n"
        },
        {
            "course_name": "Elementary German",
            "review_date": "May 07, 2004",
            "review_content": "\nComing from the land of 7 years of absolutely insane French teachers, I braced myself when singing up for this class. Don't. Richard is wonderful, and is a hundred times better than any language teacher I've had in the past. In fact, I haven't met a single person in the German department here that I haven't liked immediately--it's a fantastic department. Richard knows his stuff, he is smart, incredibly funny in class, and devises clever and engaging assignments and activities. In one semester you will leave the classroom with an impressive arsenol of words and grammar constructions... in French, it took me at least 3 semesters to get to where I am now in German. I really cannot offer enough praise for this class, this was the only class I looked forward to this semester. I did not originally intend to continue German classes for very long, but I have totally fallen in love with the language and plan to take it through my college career. Honestly, I think than Herr Korb is largely responsible. Deutsch is sehr toll!\nWorkload:\nIt's a pretty fast-moving class, so you need to spend time on it and keep up. Bi-weekly tests (fairly easy), 4 essays, frequent written homework, oral exercises on the computer, and small projects. The assignments are usually fun... over spring break, we were required to keep a journal of our daily events and then translated it into the past tense when we learned it upon return to school. \n"
        },
        {
            "course_name": "German V1101",
            "review_date": "December 31, 1999",
            "review_content": "\nHe's an extremely happy, extremely forgiving, extremely engaging teacher. You could scout around for less course work, but I'm not sure you'd find as good a teacher.\nWorkload:\nStandard tests, short \"essays\" (30 minutes), and daily homework (15-30 minutes maximum). The biggest problem is keeping up with vocab and studying for test. \n"
        },
        {
            "course_name": "German V1101",
            "review_date": "December 31, 1999",
            "review_content": "\nHe's an extremely happy, extremely forgiving, extremely engaging teacher. You could scout around for less course work, but I'm not sure you'd find as good a teacher.\nWorkload:\nStandard tests, short \"essays\" (30 minutes), and daily homework (15-30 minutes maximum). The biggest problem is keeping up with vocab and studying for test. \n"
        }
    ]
}