{
    "prof_info": [
        {
            "prof_name": "Ellen Hoobler",
            "prof_id": 3931,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 11, 2011",
            "review_content": "\nEllen is great--she's really nice and she tries to make the class interesting and relevant, sometimes even going into what her own research is about, which is really fascinating given the relatively dry nature of the course. She's relatively laid back and doesn't really require you to do the readings, though I would suggest you do because they tend to be interesting and sparse anyway, but she can be a tough grader on the papers. Her midterm is relatively easy, but I would suggest that you put a lot of effort and thought to the formal analyses. And meet with her! She really appreciates you trying in class. \nWorkload:\nPretty easy--4-5 formal analyses, and a visit to a museum.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 13, 2010",
            "review_content": "\nEllen is amazing. If you get her you are really lucky. She is really understanding and cares about all her students. Even though her class was at 9am she made it enjoyable and tried her best to make it interesting. You really learn to appreciate art and the goals of the core are definitely fufilled. She is very approachable and you should definitely talk to her if you have any questions. She showed us how art is important in our everyday lives by trying to relate all the art we learn in class to facebook portraits for example. She really encourages participation and makes you feel confident to talk in class. She never puts anyone down. Overall, Ellen is great and definitely take her class!\nWorkload:\nreally easy. two 4-5 page papers that you can hand in whenever you want, and two 1 page papers. a midterm and a final both of which are really easy.\n"
        }
    ]
}