{
    "prof_info": [
        {
            "prof_name": "Huffa Forbes-Cross",
            "prof_id": 10580,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Art Hum",
            "review_date": "December 13, 2016",
            "review_content": "\nHuffa is a great professor. I would definitely recommend him for Art Hum, as he leads interesting discussions and is very relaxed. I would definitely encourage anyone to take his class. \nWorkload:\n Two papers during the semester, plus one final paper that is an extension of one pre-existing one, 4 reading responses. Extremely manageable workload. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 14, 2012",
            "review_content": "\nI thought that Huffa was amazing. Yes, he seemed more interested in the modern art, but that is his specialty, and he did a good job of researching and presenting the earlier artwork thoroughly. He encouraged class discussion and led highly informative field trips to the Met and the MoMA. Honestly, I don't really understand the negative review. He was never late to class this semester, and was constantly engaged and on top of the material. He encouraged us to go to exhibits on our own time as well, and recommended specific exhibits and relevant books to us as we developed our papers. Art Hum was definitely one of the better Core experiences I've had at Columbia, maybe the best.\nWorkload:\n3 short papers, midterm, take-home final, and a few reading responses. grading is highly centered on participation and reading responses, so make sure to come to class\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 28, 2010",
            "review_content": "\nI completely disagree with the previous reviewer. I enjoyed art hum with Huffa greatly and I believe most others in the class did as well. \nI did have reservations in the very beginning because Huffa seemed to be not at ease with the materials and also because architecture history in general was quite boring to me, but as soon as we started talking about sculptures and paintings, Huffa was very engaging and I found the materials very interesting. \nHuffa does like to pose open-ended questions to class, but this is a discussion-heavy class (CORE!) and I enjoyed hearing what others had to say about the paintings. Also, almost everyone participated at some point or the other, which is also nice. At times, the comments did become creative (stretching a little bit too far), but this did not happen that often. Also, I think this precisely is the fun of interpreting art in a discussion setting to begin with. \nThe anecdote the previous reviewer provides is very misleading. The misinterpretation of the subject matter in the painting of Judas should not be attributed as Huffa's lack of preparation for the class. For the first class, Huffa asked everyone to send him a favorite painting, and he prepared a slide show so that each person could introduce him/herself when the painting showed up. The person who picked this particular painting was either not present in the class or did not know what it was really about, and Huffa(as well as the entire class) had to guess what was going on in the painting. He clarified the confusion in the next lecture, and I think it is unfair for us to expect Huffa to know every single painting (one obscure medieval painting on Christianity) that was present on the slide show. Of course, he could have looked them up beforehand just in case such thing happens, but this is not and should not be representative of Huffa's overall performance in the class.\nI do agree with the whole late issue. Huffa did show up late to class a couple of times (esp. rainy days), which was unprofessional, but most of the times, he was ready to go when the class started. He was also pretty late in giving back our papers and midterm. Our third paper and final was kind of crammed in the end... but honestly, it was not that bad. It was annoying in the beginning, but, at the same time, this is a hipster guy whose name is Huffa. Give him some slack. \nOverall, this class might not be ultra-cool and mind-blowingly-amazing kind of class, but it still is far better than the average core experience. He also provided many optional field trips that were fun. I absolutely enjoyed the class, and I don't think you should worry that much if you get him for art hum.\nWorkload:\nStandard Art Hum load. In the first paper, stick to extensive formal analysis (don't go tooo creative). But with the other two papers, you can provide more interpretations and creative analysis as it is appropriate for more modern stuff.\nI got an A with doing almost no readings (but I did a couple of the readings pretty closely).\n\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 08, 2010",
            "review_content": "\nThe bottom line is don't take a class with Huffa. He is simply put a bad instructor, and I wish I had transferred out of his Art Hum class.\nAlthough I want to maintain hope that Huffa is academically rigorous in areas of his personal interest, he failed to convey this as a teacher. The questions he asked were often open-ended to a fault, and he often beat topics to death by continuing to ask the same question over and over again, \"so what else can we say about this work?\" Often, it seemed like he was fishing for a specific answer, but rather than offer it, he would repeat the question in the exact same terms, waiting out interminable pauses as the frustrated class fell silent, knowing that we weren't giving him what he wanted. Other times, in the free-for-all of class discussion, people would give answers that were clearly off the mark, but he would nonetheless spend a significant amount of time fleshing out speculative student comments rather than forwarding clarifying points of his own, even when it meant blatantly contradicting something he'd just said.\nIt was so extreme, that one day a student completely mischaracterized the subject of a painting, and Huffa, who apparently hadn't done his homework expanded on the faulty interpretation, talking about how line, shape, lighting, etc. reinforced this idea. When another student pointed out that the figure in the painting was not in fact Judas, but Jesus, and not preparing for a kiss of betrayal, but warning the pharisees against worshipping money, Huffa hemmed and hawed, simply underscoring his lack of preparation for class or underlying knowledge of the works on the syllabus. As a result, general themes from the class were muddied, and I came away without clear footing on any basic concepts. I have a genuine interest in visual arts, and felt like this class invalidated the discipline of art history and theory for me.\nOther times he would make up answers on the fly, which sometimes the class let stand, but other times fell apart when questioned, which only made us feel uncomfortable and made him look incompetent. One time someone asked him if the distance between columns differed from ionic to doric temples and he pulled up a slide that supposedly reinforced his point that they were. It was apparent to the class that the distance was the same for all, but Huffa got flustered and defensive and wouldn't change his position even though it seemed like he'd realized he made a mistake. The class stopped arguing out of pity and he said to see him after class to talk further, but it put a bad taste in everyone's mouth.\nSometimes I felt bad for him because he seemed so uncomfortable explaining himself, but other times it was maddening that he was supposedly responsible for helping us understand, discover, or explore the fundamentals of western art. His verbal tics and constant pacing were annoying, yes, but also seemed to betray some discomfort with standing in front of a class.\nHuffa was also consistently five to ten minutes late to class, and on at least two occasions, actually twenty minutes late to class. He would then fumble with the technology (the projector and syncing up computers) for another five to ten minutes, and apologize when his phone would ring in the middle of class because the silencer was evidently broken. He would ask over and over, \"any questions?\" desperate for one of us to ask him something to cover for the awkward silence while he fumbled with cables. \n\nWorkload:\nThree short papers, midterm with IDs, take-home final. Standard nightly AHum reading that didn't need to be done to participate in class.\n"
        }
    ]
}