{
    "prof_info": [
        {
            "prof_name": "Jill Shapiro",
            "prof_id": 8,
            "total_reviews": 42
        }
    ],
    "reviews": [
        {
            "course_name": "Human Origins and Evolution",
            "review_date": "April 19, 2016",
            "review_content": "\nTL/DR: Go for it!  The class, professor, and even major program are all fantastic.\nProfessor Shapiro is hands-down one of the best professors I have ever had -- the best so far.  The only reason she isn't the best is I have yet to finish all my degrees.  This is a good thing.  She cares about her students and lives to teach.  \nAre her classes difficult?  Yes.  Does she have specific and strict rules regarding electronics and general classroom respect?  Yup.  Are her classes amazing?  Absolutely.\nWhile, yes, you will likely have to memorize ALL of your notes for her classes (especially Human Origins), it is a genuine pleasure to do so. \nHere is an example of how great her classes are:  I had surgery one semester right before finals.  I was taking Human Origins that semester.  I woke up from anesthesia and one of my friends/classmates in Human Origins was there to help me get home.  What did I do before they even took the IV out of my arm?  Started drilling Human Origins flashcards with my friend, of course.  I didn't have to -- I knew my stuff and so did she -- but I WANTED to.  Professor Shapiro kindles a kind of respect in her students that they simply cannot bear to let her down.  \nOf note, Prof. Shapiro is the major coordinator for the Evolutionary Biology of the Human Species (AKA Physical/Biological Anthropology) program as well.  A better coordinator could not exist.  Take Human Origins early to see if you like it -- the major is great and often missed until it is too late!\nIf you are on the fence, give Prof. Shapiro and her Human Origins class a shot.  As long as you work for the classes you pay for, you will have one of the best experiences in your college life.\nWorkload:\n-Memorizing all of your notes and having perfect attendance to get an A- is normal.  The thing is, seriously, you will WANT to do so.\n-Do the required readings.\n-Attend all the \"lab\" sections with the TAs.  The TAs are always great.\n-Worth it!\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 12, 2014",
            "review_content": "\nI'd like to give y'all and update as I read the \"dear brilliant slacker\" post and think that another perspective could be useful.\nwhile it is definitely helpful to study week by week, it is not necessary. if you are willing to study for 3 days straight then you can get to the midterm and do perfectly. if you are willing to study for 3-4 days straight then you can do that for the final and know everything too. \nYes it is a TON of information to memorize, and some of it i think is not useful for us to learn, however you can memorize it all if you try. Also, you don't need to memorize absolutely everything because she gives you options on the tests and asks for 3-5 traits, so you don't need to know them ALL as she tells you in class.\nGoing in to the class I thought this would be a fascinating class on the story of human evolution, and would incorporate theories on why things happened (like bipedalism etc). However, sadly, this did not happen at all. Theories don't mater to Shapiro, only what you see in the fossils. \nWhen the previous reviewers said \"memorize a lot of bones\" , I'd like to clarify that it is BONES AND ONLY BONES. Nothing else is important to Shapiro. Only bones/ skeletal morphology , and how the traits of the bones relate to taxonomy. In that regard, it is boring material - you learn bones and know that they relate to other species. \nAlso something I would have liked to know before taking the class: the first half of the class is all about evolutionary principles and morphological trends for primates and humans etc, and the second half is about the actual evolution of humans. However, this is thoroughly detailed, as we start with the evolution of primates and work out way up the phylogenic tree to hominins. just letting you know... there's a LOT. 65 millions years worth. I personally thought that primate evolution was excessive...\nOverall, Shapiro herself is an incredibly dedicated professor, and it committed to having every student pass the class. She is incredibly particular and specific about what she wants you to know (throughout lecture she'll point out what you need to know and what you don't need to know for the test. she writes most notes on the board. anything on the board is fair game). this is helpful, though annoying to be always reminded about the tests every day in lecture. \nShe also doesn't like taking questions in lecture, but makes you ask them after lecture is over. I found this good because she uses every single minute of lecture to cram information in, and she can't get sidetracked. However i know that some students would rather ask questions in class. She is very welcoming of any questions in office hours and via email, and is extremely punctual at answering email!\nknow that she is very very very specific about what she wants - it shows in her emails, her exam instructions, and lecture, all the way down to what writing utensil to use on the exams, and whether or not you come to lecture (yes she takes attendance). I found this helpful but a bit overdone. \nWorkload:\nbrief articles to read every week. don't get or read the textbook, completely unnecessary. midterm 30%, final 70%, optional lab/discussion sections, some of which are helpful.\nmidterm: short answer questions with choice - you can choose some questions and within the question you can choose what to talk about, within her parameters of course. specific questions about the articles.\nfinal: two essays and short answer questions.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 12, 2014",
            "review_content": "\nI'd like to give y'all and update as I read the \"dear brilliant slacker\" post and think that another perspective could be useful.\nwhile it is definitely helpful to study week by week, it is not necessary. if you are willing to study for 3 days straight then you can get to the midterm and do perfectly. if you are willing to study for 3-4 days straight then you can do that for the final and know everything too. \nYes it is a TON of information to memorize, and some of it i think is not useful for us to learn, however you can memorize it all if you try. Also, you don't need to memorize absolutely everything because she gives you options on the tests and asks for 3-5 traits, so you don't need to know them ALL as she tells you in class.\nGoing in to the class I thought this would be a fascinating class on the story of human evolution, and would incorporate theories on why things happened (like bipedalism etc). However, sadly, this did not happen at all. Theories don't mater to Shapiro, only what you see in the fossils. \nWhen the previous reviewers said \"memorize a lot of bones\" , I'd like to clarify that it is BONES AND ONLY BONES. Nothing else is important to Shapiro. Only bones/ skeletal morphology , and how the traits of the bones relate to taxonomy. In that regard, it is boring material - you learn bones and know that they relate to other species. \nAlso something I would have liked to know before taking the class: the first half of the class is all about evolutionary principles and morphological trends for primates and humans etc, and the second half is about the actual evolution of humans. However, this is thoroughly detailed, as we start with the evolution of primates and work out way up the phylogenic tree to hominins. just letting you know... there's a LOT. 65 millions years worth. I personally thought that primate evolution was excessive...\nOverall, Shapiro herself is an incredibly dedicated professor, and it committed to having every student pass the class. She is incredibly particular and specific about what she wants you to know (throughout lecture she'll point out what you need to know and what you don't need to know for the test. she writes most notes on the board. anything on the board is fair game). this is helpful, though annoying to be always reminded about the tests every day in lecture. \nShe also doesn't like taking questions in lecture, but makes you ask them after lecture is over. I found this good because she uses every single minute of lecture to cram information in, and she can't get sidetracked. However i know that some students would rather ask questions in class. She is very welcoming of any questions in office hours and via email, and is extremely punctual at answering email!\nknow that she is very very very specific about what she wants - it shows in her emails, her exam instructions, and lecture, all the way down to what writing utensil to use on the exams, and whether or not you come to lecture (yes she takes attendance). I found this helpful but a bit overdone. \nWorkload:\nbrief articles to read every week. don't get or read the textbook, completely unnecessary. midterm 30%, final 70%, optional lab/discussion sections, some of which are helpful.\nmidterm: short answer questions with choice - you can choose some questions and within the question you can choose what to talk about, within her parameters of course. specific questions about the articles.\nfinal: two essays and short answer questions.\n"
        },
        {
            "course_name": "Biology, Systematics and Evolutionary History of Apes",
            "review_date": "October 15, 2014",
            "review_content": "\nGod bless Jill Shapiro. She is everything a professor should be, and she genuinely cares about her students and about the subjects she teaches. I've found that her advanced courses require a lot of dedication and interest on the part of the student, but if you put time into learning the facts then you will be just fine. \n Explorations in Primate Anatomy is a wonderful course which focuses mainly on the skeletal system of extant primates. It is structured like a guided bone lab with intermittent lectures throughout, which I found was the perfect mix of hands-on and theoretical learning needed for an anatomy course. I actually found this to be the most challenging class I had taken with Professor Shapiro due to the amount of memorization required, but by the end we had all learned an immense amount about comparative primate anatomy, and had an awesome time doing it.\nThe Biology, Systematics, and Evolutionary History of the Apes (or Apes, Apes, Apes as everyone calls it) is a mix between a small seminar and a lecture. While it requires a thorough breadth of knowledge, I found it a bit easier to handle in terms of studying than Primate Anatomy. Of course, Professor Shapiro's passion for the subject (and particularly Orangutans!) shines bright in this course, making the learning experience that much more worth it. The workload was completely manageable, but be aware that you can not get away with not doing the reading in such a small class! The best part: Professor Shapiro brought snacks to class every week.\nWorkload:\nI thought it was a bit heavier for Primate Anatomy: \n-Weekly readings that could sometimes be dense\n-A midterm that requires a very thorough/exact answers to each question, particularly in the short and long answer form. \n-A short but well-researched write-up where we do an anatomical examination of a chosen primate.\n-8-10 page term paper on any topic of interest relating to primate anatomy\n-Hard final with the same sort of thoroughness required for the midterm.\nFor Apes:\n-Readings for each class which range drastically in subject, density, and even era!\n-A fun short review on a pop-sci primate book (she gives you a list of books to choose from) that is generously graded.\n-An 8-10 page term paper which you have to spend a lot of time on. The good thing is that you can basically choose any topic you want as long as it pertains to the Apes. \n-An essay based final which required a thorough knowledge of everything learned in class and in the readings. Seriously. It's hard but if you keep up in class and take the time to use the study guides and advice she gives you, then you'll be just fine. I got an A and so can you. :)\n"
        },
        {
            "course_name": "The Neandertals",
            "review_date": "April 30, 2012",
            "review_content": "\nThis was a phenomenal class. The Human Species course was more than enough preparation - most of the information that I had forgotten came back naturally over the span of this class.\nDr. Shapiro is excellent, as usual, and this class is as easy as it is educational. Yes, I just said educational. It feels weird to use that word when referring to one of my classes. I learned an enormous about of information about both Neandertals and modern humans. This class covered everything from the nitty gritty science (dentition and bones) to the intangibles like culture, religion, and logic.\nIf you pulled this course up because it sounded even mildly interesting to you, then you owe it to yourself to sign up and do it. You won't regret it.\nWorkload:\nRoughly 50-70 pages of reading per week, much if from scientific journals. But all doable in a single evening.\nWritten response to the readings each week with the occasional one-sentence summary of specific articles. Not hard at all - this is more of a self-driven assignment.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 21, 2012",
            "review_content": "\nDear brilliant slacker,\nDo not take this class. It is not for you. I don't care what you've managed to do in the past, but the squeaking by with minimal effort stops here. I promise.\nIf you (for some godforsaken reason) are legitimately interested in learning about the shapes of primate skulls and are honestly excited about memorizing 65 million years of primate evolution, then by all means take this class. You will have a blast. If you are looking for an easy science credit that doesn't really demand your attention or involvement, DO NOT PROCEED. I mean it. Heed my warning. I ignored the warnings and regret it.\nThe frustrating thing is that this class is theoretically so easy. It is 100% memorization. Nothing is conceptually difficult. Shapiro, to her credit, is extremely straightforward about class expectations. She writes the important points of her lecture on the board and tells you exactly what articles to read. This information (the board stuff and the articles) and ONLY this information will appear on the exams, in exactly the layout that it was first presented. If you take detailed lecture notes and STUDY AS YOU GO, there is no reason you should not get a 100 in the class. It's that simple.\nThat said, you obviously won't do that. You will see that she only gives a midterm and a final with no other sort of work in between, and you will forget to review anything until the night before, at which point you will remember that 65 million years is a lot of evolutionary history and there is simply no way in the physical universe that you could ever, ever commit it all to memory, regardless of how simple the information is. Sorry.\nUnless you really, honestly trust yourself to stay on top of the material--and if you can, good for you--or are genuinely interested in learning all about bones, find some other way to fill your science requirement.\nShapiro herself is tricky. In some ways she could not be more helpful. She really, really wants every single person in the class to come away with not only an incredible amount of knowledge but also a love of the material. She probably cares more for her subject than any other professor I've encountered here. Her lecture style is very clear and her exams are very fair. However, her classroom policies are a little absurd. She kept us needlessly overburdened by FAQs, course packets (20 pages!!), and clerical business. Any criticism of her teaching or classroom style was dismissed (preemptively, in the aforementioned 20-page behemoth) by her statement of her pedagogical philosophy. She doesn't seem to trust her students not to be stupid or dishonest, which I found very annoying. Borderline tyrannical computer policies, too.\nIn the end, this class wasn't a good one for me, but I can understand why people who like the material and are willing to put in the time like it a lot. Your call.\nWorkload:\nMinimal. A 33% midterm and a 67% final. Textbook readings that you shouldn't bother to do. Some required articles, which will turn up on the exams. FOR THE LOVE OF GOD STUDY FOR THE EXAMS MORE THAN ONE NIGHT IN ADVANCE.\nDon't buy the textbook. It's expensive and useless. The material tested is entirely from the lectures and the articles.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 07, 2011",
            "review_content": "\nYou really have to follow Jill's advice. Take the notes exactly how she dictates, study in exactly the manner she proposes, do the readings she requires. If she says \"write out five sentences,\" or \"practice saying it out loud,\" you'd better do it. Likewise, make sure you read her other emails and instructions for the exams and way the class works. She has a clear and intentional pedagogical method that she has painstakingly devised, and she's right, so go along with it and you'll do great.\nSome people don't think the textbook is necessary--it's easier to handle all the info if you read the book, but you can do well without ever opening it. I suggest not buying the book, but reading it (they usually have the newest edition in Butler). It's an expensive text and it gets outdated like every year. \nI've been using the previous edition, and it's almost identical (but all the page number are off). Pearson Higher Ed will show you a sample of every page in the new edition on their website, so you can cross check from an older edition to do the right readings.  \nWorkload:\nChapter Readings from the textbook, articles (a few a week), midterm (30%), final (70%), one Hardy-Weinberg problem set (mandatory, but just for practice). A lot of optional work for the interested. \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "May 16, 2011",
            "review_content": "\nI learned so much in this class. The emphasis is on memorization, but it's taught in such a way that you'll retain most of the information. Jill Shapiro is a really entertaining lecturer and her exams are very fair if you take good notes and prepare accordingly. You can do very well in this class as long as you take excellent notes, which she makes very easy to do since she organizes her notes on the board.\nWorkload:\nSome reading (do as she recommends and write five-sentence summaries of the articles!), midterm (30%) and final (70%)\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 22, 2011",
            "review_content": "\nProfessor Shapiro is an interesting woman, and one whom I respect. She seems to only have one mode: extremely overzealous. This translates into everything from teaching with genuine passion for the subject to yes, writing 10 page single-spaced documents on what writing utensil to use for her tests. I can definitely understand how this personality would rub people the wrong way. Personally, I didn't have a problem with it at all--in the big lecture class, she was a remote enough entity that when she said that she would be checking the inside rim of every head covering during the midterm for cheat notes, I could just chuckle and think, \"Ah Professor Shapiro. You card.\" One on one, a level at which I've interacted with her plenty, she's very personable. Her enthusiasm is genuine and not overblown or overbearing. She's just interested. You will be, too. \nI respect her because she is very straightforward, without being rude. She speaks her mind and is not afraid of her own opinion or duty as a teacher. For example, after all, students DO cheat in all the various ways she warned against. I know someone personally who wrote equations on the inside of their shirt cuffs. Some teachers act almost apologetic of the silliness or inconvenience it causes to be rigorous about anti-cheating, perhaps trying to ignore a reality that disappoints them (that their students cheat). Professor Shapiro does not. (I personally have no crusade against cheating, this is just a good example about how Professor Shapiro addresses everything--even touchy topics--with refreshingly active honesty and unflagging vigor). \nOne important thing: she speaks loud enough, and clearly; she writes all information of the lecture, as she goes, in chalk on the blackboard--clearly and organized extremely neatly in an outline format. The information is not \"easy,\" but her teaching style is. You will be grateful for it!\nThat being said, there is a LOT of information to learn, and she expects DETAIL on her exams--you can get something \"right\" and still get lots and lots of little point reductions due to a lack of specificity that translate into one or two grade letters lower. Her exams are like her: straightforward and rigorous. You can ace them, but you will have to actually STUDY, not just \"review,\" which can cut it in so many other classes. \n\nWorkload:\nWeekly readings from articles and textbook sections. Not too bad, maybe an hour or two of reading a week. Midterm and final that require a LOT of specificity, but offer no slimy trick questions or anything designed to fool you or make you slip up. \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 05, 2011",
            "review_content": "\nTAKE THIS CLASS! It was one of the best experiences I've had at Columbia and Shapiro is probably the best professor I've ever dealt with. I see others have criticized the way she runs the class and her lectures. They clearly have no sense of humor. Shapiro is funny, obsessed with her field, and genuinely cares about her students learning and enjoying the material she's teaching. She's incredibly organized and that makes it easy to study and learn the material. The assigned readings were short and really interesting and her lectures are fantastic - incredibly interesting and well organized. Again, this also makes it easy to study for the exams because she specifically outlines what you're expected to know. Yes, there is a ton of material we covered over the semester but she and the TAs are very helpful in guiding you through it. Her pre-exam packets were especially helpful. She puts way more time and energy into her class than any other professor at Columbia (I'm a senior and I've dealt with them all). I would recommend this class to any Columbia student, science major or not. It was an overall great experience.\nWorkload:\nHeavy but manageable. As long as you go to class, take notes, and read the assigned articles, you're fine. She often assigns chapters from the required book but I never read them because her lectures were sufficient. You need to read the assigned articles for the exam but they are short and interesting, I usually read them on the subway. The exams aren't hard if you study your lecture notes. \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 22, 2010",
            "review_content": "\nI am going to be the only person here who did not enjoy Jill Shapiro, but someone has to be the minority report. Although much of what is written here is accurate, I found her to be extremely obnoxious and irritating and the class structure ridiculous.\nEssentially, she has hypergraphia and OCD and treats the class like dim-witted kindergarteners in the way she explains the material. I always felt like I was being talked down to; concepts were explained in terms of things like Power Rangers, in what I found to be a very smarmy and patronizing way of speaking. \nThe course is just memorization and regurgitation (she has a strict no-questions, no-one-but-her-may-speak-during-class policy).\nMost annoyingly, there was more meta-reading (i.e. rambling housekeeping / logistical notes) in this class than I have had actual reading in other classes. She spent the ENTIRE FIRST TWO class sessions (~3 hours) on content-free housekeeping, and before the midterm she distributed a rambling document that she instructed us to read - eleven pages, single-spaced. It was COMPLETELY DEVOID OF ACTUAL COURSE CONTENT, but contained such crucial information as:\n- \"All hats (though not religious head coverings for Moslem, Muslim or Sikh students) will be examined before the exam.\"\n(Oh, Moslem AND Muslim! Wow!)\n- \"They will also be grading in green ink, none of that horrid red.  [After all, red cues in this culture to stop while green cues to go.  We want you to read the comments without fear.]\"\n(I'm so glad I internalized this crucial information as I study for a test where I will be asked to regurgitate dozens of dates!)\n- \"If English is your second language, you may bring a dictionary to class but we will have to check it for notes and scribblings.\"\n(Really? All of it?)\n- \"If you write in another color ink or if you write in pencil, your entire exam grade will be dropped by a full grade.\"\n(Glad this important information was in an 11-page document)\nAnd on, and on, and on. The instructions for her tests were much longer than the tests themselves.\nThis was just for one exam, passed out ahead of time. And then what do we have handed out to us on the day of the test? If you guessed \"the test\", you'd be wrong. Yet another all-new instructions document! This, too, was full of wisdom, including a paragraph on why it is important to be quiet when leaving the room if you've finished your test early. It was useful for me, because I was planning on finishing before everyone else and loudly yodeling on my way out.\nThe syllabus and various supplementary housekeeping manifestos were a total of SIXTY-TWO (yes, I counted on Courseworks) completely content-free pages (including an entire page on how annoying laptop keyboard clicking sounds are and the implications of this for where laptop users are allowed to sit in the room and the penalties for use of laptops to do anything other than take notes. REALLY?!).\nWorkload:\nJust memorize the hundreds of dates and names that she gives out and regurgitate them on the tests in short answers and essays. No higher-order thought required. There are dozens and dozens of articles (divided into \"optional\", \"not optional\", and \"required for the test\", handouts, videos, and textbook chapters that were assigned, but I did OK just memorizing most of the key factoids given in class.\nNow, here's a quiz:\nWhat professor has a strict \"no asking questions in class\" policy?\nWho takes attendance in a 80+ person lecture class? \nWho writes a 60-page logistics novella? \nWho proclaims their class to be one of the hardest at Columbia, but explains everything in terms of children's cartoons and funny voices, as if speaking to a child?\nThe answer to all of these is, of course, Jill Shapiro.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 20, 2010",
            "review_content": "\nI, like many others, took this class for the science requirement.\nMaybe this isn't the best time to review Professor Shapiro, as I just took the final, but let me just say:\nThis class is NOT easy, it's actually really fucking difficult, so don't think it's an easy A. You can get an A, but most people won't, even the science people.\nThere is just an INCREDIBLE amount of data that is almost impossible to know. She's clear about her expectations, though, so no surprises. Everything is fair. It's just that no one person can devote as much time to Human Species as her exams require.\nThat being said, take this class. It'll really change how you see things. The difficulty is worth it, because it's fascinating material most of the time.\nWorkload:\nNot heavy - just take lecture notes. AND GO TO EVERY SINGLE LECTURE.\nOh, and don't forget to read the articles.\n"
        },
        {
            "course_name": "Forensic Osteology",
            "review_date": "May 17, 2010",
            "review_content": "\nThis was A LOT of fun! Basically, we got to play with bones all the time, lectures were awesome, and the readings were carefully chosen -- nothing short of fascinating, just like the whole course.  You also have complete freedom to research what you want for the term paper and she reads them closely, providing EXTENSIVE feedback. Everything describing Shapiro in previous classes/reviews held true here -- insanely enthusiastic and willing to help, brilliant, amusing, and exceptionally fair.  Toward the end of the semester she talked about adding lab time onto lecture in the future -- this would be helpful as we often just needed more time to actually handle specimens and apply what we were learning in lecture. All in all, a wonderful experience.  \nWorkload:\nVery reasonable. \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "February 07, 2010",
            "review_content": "\nThis course is rigorous, and taught very old-school style. Notes are meticulously organized on the black board, and the midterm and final are very fair, but extremely extremely intensive--you will have to regurgitate all that you have been taught so far. That said, you absolutely DO NOT need the text book. I repeat, YOU DO NOT NEED the text book. It's prohibitively expensive--I couldn't afford one; but Professor Shapiro will very kindly let you borrow her copy, and there are several in the library on reserve. Even so, the notes she provides are really more that sufficient. I never looked at the text book. Master the notes, and the handouts she provides. That will be a lot, and I mean, A LOT of information on it's own. Really, you'll save yourself  more than $100, and be far far less confused-- because, Prof. Shapiro disagrees with the textbook on numerous occasions. Go to lecture, copy EVERYTHING that's on the blackboard, and internalize it. If you can do this, you will ace the class. If not, you will do very, very badly. Prof Shapiro, is , as all reviewers have already pointed out, unbelievably comitted to student learning, and EXTREMELY passionate about her subject. Her enthusiasm is remarkable.\nWorkload:\nMidterm, Final. GO TO EVERY LECTURE, and TAKE NOTES. DO NOT BUY TEXT BOOK\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 13, 2010",
            "review_content": "\nEverything has already been said extolling the virtues of Prof. Shapiro.  My only addition is that she had a magical way of making the material l of her EEEB class live.  As she guided us in tracing the beginnings of our human lineage, I awoke to the science and the mystery of who we are and where we came from.  In many ways it was like being guided on a vision quest.  The reading was intense & the memorization was intense.  Yet her teaching style drew you in and made you grasp the material.  It was nearly mystical. Yes,she deserves TENURE.  She is a wonderful teacher.\nWorkload:\nIntense reading from the workbook but you must be careful because  new discoveries and dating methods often rendered the book outdated.  But she tells you what is changed in the book.  Ultimately her lectures are what one has to remember.  Lab is not mandatory but don't be fooled.  It was so helpful in pulling it all together.  AND it was actually thrilling to touch the actual touch early tools and handle skulls.  The final and midterm were serious but no tricks!  She is accessible to any student and really explains the material for you. \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 04, 2010",
            "review_content": "\nThere is absolutely no reason why you should not take this class with Professor Shapiro. True, she does squeeze all the material she can into every single lecture (she vocally measures time, i.e. \"don't pack up yet, we have a whole minute left and much to cover), but this material is FASCINATING. Professor Shapiro never disregarded anything such as Creationism; rather, she encouraged us to look at both ends of the spectrum and come up with our own theories. Seriously, the essays on the final, though strenuous to complete, were actually interesting to write because Professor Shapiro basically says \"I've taught you all you need to know, now where do you stand?\" All this woman needs is TENURE for Christ's sake! I was a first-semester Freshman who screwed up his grade by not attending discussion, lecture, etc. so if you take this class my best advice is suck it up! I wish my grade in this class would reflect how much I actually took away from it but nonetheless Professor Shapiro is kind, engaging, approachable, extremely knowledgeable in her field, and overall the most enthusiastic professor I had this semester. If more people loved their job as much as Professor Shapiro does, it'd be a better world. If ever at any time at all you asked yourself \"why am I here?\" or \"why do we exist\", I think it's about high time you take this class. Honestly, I have no regrets and Professor Shapiro is amazing.\nWorkload:\nWeekly readings which are on the midterm and final so read them! The textbook is interesting but I think it deviates too much from Professor Shapiro's lectures and is rather not worth buying for that reason. The midterm and final are MASSIVE but you are given a packet of relative size which outlines EVERYTHING for you waaaaay before either test. Attend section and try to get to at least three quarters of the lectures (at the very least) or else your grade will ride on these two tests alone. Other than that, the workload is extremely, and I mean extremely, manageable. \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 21, 2009",
            "review_content": "\nI sit in the library after my Human Species final, my hands trembling, while I write this. I refrained from reviewing prof. Shapiro's class before the final exam because so much of my grade (70%), even though little of my experience, is riding on this last pull. Now that it is done I can be honestly say that this was an amazing experience I would recommend to every student at Columbia.\nThe class is exactly the way it is described in the earlier reviews. There is a lot of work, a lot of reading and memorization and a necessary comprehension of the material. The details are as equally important as the big picture so there is no way of avoiding learning the massive amount of information the professor covers in each class. The best advice I can give you is to GO TO CLASS WITHOUT EXCEPTION and take extensive notes, DO THE READING assigned and read everything she posts on Courseworks (optional articles are not necessary) and DON'T WAIT till the exams TO STUDY. If you still have trouble, speak to prof. Shapiro in person and find out everything you need to know.\nThe reasons why I loved this class are many. Prof. Shapiro is upfront about her expectations and is very honest about what her midterm and finals will look like. There is absolutely no ambiguity about what lays ahead. The exams were never a surprise because everything that was expected of us was already explained beforehand. The class itself is very interesting and a good thing to know no matter your field of interest, but the way prof. Shapiro delivers the material is what deserves praise. Her classes are structured in a way in which she can expose you to enormous amounts of information without you feeling too overwhelmed (you will, at some point or another, nonetheless). She is very approachable and eager to answer all questions one might have after class or during her office hours. \nThe first part of the semester was easier than the second and there was a lot of pressure for the final as it is such a big part of your grade. I fell behind on the work after the midterm, but what saved me is that I still went to class and took notes even when I wasn't sure what she was talking about. Her classes tend to make little sense at the beginning but somehow always tie in towards the end (sometimes it takes 2 or 3 classes to see where the material is going).\nHuman Species is a great science requirement since there is no math whatsoever (unless we count one question that demands you know how to add and subtract to a 100 and divide with 10 ON A CALCULATOR!!). This is my first semester and I'm very glad I took this class. I hope I will have more professors like this in the future.\nWorkload:\nMultiple articles to read on a weekly basis (best red before class in question and reviewed before exams as you will be tested on them directly)\nNO NEED TO READ OR EVEN BUY THE TEXTBOOK AT ALL!\nMidterm that takes an hour and a half to complete (30%)\nFinal that takes 2.5 to 3 hours to complete (70%)\nSections are not mandatory, but are recommended as they can help swing your grade. The sections in which we were dealing with fossils were extremely helpful for exams.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 16, 2009",
            "review_content": "\nEven as I sit avoiding review for the final, I think she must be one of the best professors at this University. Having Shapiro as a freshman or sophomore could be dangerous for a couple of reasons: the class is no joke and if you don't do the work you will not do well - no sliding by here.  That said, Shapiro is utterly straightforward when it comes to what you have to know....a characteristic of her approach that is more rare among professors than it should be. She is great enough that you may never find someone who matches up to her level of engagement and enthusiasm for teaching. \nWorkload:\nSignificant. Worth it. Don't miss class. \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "November 18, 2009",
            "review_content": "\nWhere is her gold star?!?! I have been here for three and a half years and never found a professor who seems to love teaching as much as Professor Shapiro. She is intense, brilliant, and has high expectations for you, but as one reviewer before has said, she is unambiguous about those expectations.  She makes the material accessible without dumbing it down and will answer any questions you have without even a hint of condescension.  After many semesters of tweed jacketed folk standing behind lecterns, I found her enthusiasm a little overwhelming at first (you will NOT need your coffee before this class). It is refreshing to be taught by someone who is a remarkable teacher in every sense of the word and an incredible scholar as well. \n\nWorkload:\n2 exams. The reading is very manageable. A TON of memorization from class notes. I actually found discussion section to be really helpful. Stay on top of it and all will be well. \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "October 26, 2009",
            "review_content": "\nI'm only halfway through the semester yet felt compelled to review this woman. \nShe seems really genuinely sweet, like she actually cares about the students. Very refreshing in what can feel like a cold university. She called me by my name despite having never spoken to me individually before and the class having nearly 70-80 kids. How does she do it? Who knows. She is also clearly passionate about the material, which shows.\nWhat I really appreciate is how organized her lectures are: she gives them in a neat, useful, outline form that makes studying so much simpler. I'm so tired of professors who ramble aimlessly, leaving my notes a useless jumbled mess.\n The readings are fascinating, the kind of \"popular science\" stuff I read for fun. \nThe midterm was harder than I expected, but only because I underestimated the class. I'm a bio major and thought that, as my \"fun\" class, it would be a breeze. I was wrong. You have to go to class! The stuff she says is not in the book! I learned the hard way, don't make my mistake. But now I've learned my lesson and know what to do for the final. Again, I can't stress this enough: GO TO CLASS.\nInteresting stuff, great professor, reasonable workload= highly recommended!\nWorkload:\nModerate/Low. Keep up with the readings and go to class and you'll be fine.\n"
        },
        {
            "course_name": "Biology, Systematics and Evolutionary History of Apes",
            "review_date": "September 10, 2009",
            "review_content": "\nGo ahead, ask me whatever you've been itching to know about the systematics, morphology, behavior, dentition, and taxonomy of apes.  There isn't much I don't know.  After taking Biology, Systematics and Evolutionary History of Apes --or, as it is fondly known, Apes, Apes, Apes-- Professor Shapiro told the class we were as well-informed and up to date as the leading researchers in the field. She wasn't kidding.  It was fascinating, and it was intense, as is anything Jill Shapiro teaches.  I amazed myself by signing up for the class after having taken Human Species to fulfill a science requirement the previous term, and getting the worst grade of my college career in the course after failing both the midterm and the final. I had never failed a quiz, much less an exam, but I'd also never had as much stuff to commit to memory.  I was astonished to see people crying like babies --at Columbia!-- during the final, but Professor Shapiro had seen the weepers before and was armed with a giant box of kleenex.   I failed without shedding a tear, and she gave me the chance to redeem myself, and I did, and I'm proud of how hard I worked for that blasted C that destroyed my GPA.  Prof. Shapiro is an extraordinary teacher and a wonderful human being.  She is also a quintessential New Yorker: brilliant, funny as hell, well-informed on a host of topics, and referencing all of them while lecturing at the speed of light and simultaneously covering every blackboard in multi-colored chalk.  She wears sandals and Indian skirts even in February, is extremely sensitive to people's feelings and the political correctness of things, and enjoys feeding students cookies and strawberries whenever the opportunity arises.  She also teaches you the arm signals needed to get her to slow down, stop, or repeat.  It is for the opportunity of learning from professors like Jill Shapiro that one goes to Columbia.  I'm feeling bereft not having her this term.\nWorkload:\nLots of reading for both classes, including scientific literature, which can be very hard and time consuming and which in Apes you write prÃ©cis about.  The Apes class requires a good deal of writing.  If you don't stay on top of things, you'll have a hard time. \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "March 02, 2009",
            "review_content": "\nProfessor Shapiro is an angel! She is insanely smart, hilarious, and extremely personable. She will work with you one-on-one if you are having trouble. The workload though is not easy. Make sure you do all of the reading and learn anything she tells you to know!\nWorkload:\nKiller midterm, killer final, weekly TA section\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 21, 2009",
            "review_content": "\nA true gold star professor!\nIt is only based on my truly wonderful experience with Professor Shapiro that I have felt complled to write this my first CUPLA review. Ah yes, long have been the days of simply being a passive CULPA reader, content to sit back and benefit from the labor of others, but no longer! I write only to taut the incredible merits of this great teacher and I say teacher in the purest sense of the word. She TEACHES and makes every effort to ensure that students do learn. Professor Shapiro is compassionate and very understanding. \nGranted, Human Species was not easy and it will challenge you in new and unexpected ways yet do not despair nor shy away from a good intellectual romp!\nProfessor Shapiro will go out of her way to teach you the material, encourage you to come to office hours, and then never reprimand any ignorance on your part. If you want to CONNECT with a professor at this storied yet often coldly-distanced university then please take a course with Professor Shapiro. \nProfessor Shapiro cares about her students more than any other Columbia professor I've had. Take 'Human Species' from her simply for an engaging, rather fascinating, and incredibly humorous journey through our collective history. \nProfessor Shapiro is truly a saint! She provided her home phone number to contact in case of some emergency questions and even calls students who require extra assistance, though is never intrusive. She also reads CULPA reviews but this is in no way seeking any sort of favor from her as struggle I did with the course and by no means came out of it with a shiny top notch grade. \nAfter three years at this venerable institution, Professor Shapiro is truly the only professor who I feel has gone out of her way to help students and make a personal connection with them. \nWorkload:\nVery involving and detail-oriented Midterm and Final (not cumulative) plus lab sections of loosely required attendance \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 19, 2009",
            "review_content": "\nProfessor Shapiro was by far my favorite instructor this semester. Her lectures were always well organized and informative. She is so passionate about what she teaches and it makes the material, which can be boring for many, seem very interesting. She does expect a lot from her students but she also offers help. She is available during office hours and you can even contact her by phone during midterm and final cram time for last minute questions. \nWorkload:\nThere is a lot of mandatory reading. A text that follows the lectures pretty closely and about 20 or so articles before and after the midterm. These articles are necessary because questions will be asked about them on the exams. 1/3 of the grade is the midterm, 2/3 is the final. There is a massive amount of memorization, I mean MASSIVE. But as long as you study and keep on top of your readings getting an A/B is manageable.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 04, 2009",
            "review_content": "\nAt the beginning of the semester, Jill Shapiro - clothed in dowdy vestments, arm upraised emphatically - declared to our class of lazy laymen trying to pass out of the science requirement: \"This is a hard class.\"  This was true for me, but it didn't have to be.  What Shapiro won't tell you at first is that her midterm and final - which comprise the entirety of your grade - are directly from lecture.  If you go to lecture, you will understand what she wants you to understand.  If you don't go to lecture, you'll be stuck in the labyrinthine textbook, trying to sort out relevance from irrelevance in a discipline about which you are completely clueless.  Plenty of reviews have already extolled Shapiro's endless list of virtues - kindness, energy, accessibility, humor, wit - so all I really have to say is GO TO CLASS.\nWorkload:\nMidterm and final; just go to class and read the articles (not the textbook).\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "April 24, 2007",
            "review_content": "\nGreat educator who makes the effort in and out of class to get through to the students. She expects you to work, though nothing unreasonable. If you pay attention to lectures, which are very well organized and presented you will do well. Fascinating subejct matter, and a teacher with a really great personal touch, make any of her classes rewarding academic experiences.\nWorkload:\nTake notes and know them well\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "April 09, 2007",
            "review_content": "\nIf you have a chance to take a class with Jill Shapiro, do it. She is the best professor I've had at Columbia, enough to reverse a lot of the disillusionment I have had with uninspiring profs and grad student instructors. She is hyper-organized - you will never be at a loss as to what she wants from you. Her lectures are fast-paced, exciting, interesting, challenging. The entire grade is based on two exams, so make sure to go to class. Plus, the subject is fascinating. It will challenge the way you think about what it means to be human. She presents all sides of each issue, in a humorous and engaging way. The class did not convince me switch to from archaeology to EBHS, but I am 100% glad I took it anyway. I look forward to taking a class with Prof. Shapiro in the future. Please, do yourself a favor - take this class!!\nWorkload:\nMidterm, final, optional weekly discussion sections\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "March 06, 2007",
            "review_content": "\nI took this class because it sounded interesting, and thanks to Jill Shapiro, I am now seriously considering the EBHS major.\nShe is a fascinating lecturer and her enthusiasm about the subject matter is contagious.  She tends to be very specific about the way she teaches (borderline obsessive-compulsive, like when she times every single lecture and \"makes up\" for letting us out early by keeping us late, to the minute) but it makes for very organized lectures.  Once you know her style, the expectations of the class are very clear and there is little to stress about as long as you stay on top of the material.\nWeekly discussion sections are not required but can bump up your grade.  The sections earlier in the year were not that informative, but are definitely worth it once the skulls come out (especially if you are a visual learner).  Prof. Shapiro specifically dictates the content of the sections and so the it sometimes seemed forced coming from the TAs.\nThere is a LOT of memorization.  The midterm and final (non-cumulative) are 1/3 and 2/3 of the grade, respectively.  The midterm is entirely short answer, and the final is short answer and long essays.  YOU WILL NOT DO WELL IN THIS CLASS IF YOU DO NOT DO WELL ON THESE EXAMS, and the only way to do well is to set aside time to memorize.  Find a method that works for you and just memorize.\nWorkload:\nVery doable reading (~2 short articles per class).  One midterm (1/3 of grade) and one final (2/3 of grade), which require A LOT OF MEMORIZATION.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 18, 2006",
            "review_content": "\nTwo thumbs up! :)\nWorkload:\nNot much if you are interested in the subject. And very very engaging.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 27, 2005",
            "review_content": "\nAmazing professor, fascinating but difficult class.  \n1:  PROFESSOR REVIEW.  Professor Shapiro is the most enthusiastic and best organized professor that IÂ’ve encountered yet.  One senior who took the course with me said, Â“This is the kind of professor IÂ’ve been waiting for for 3 years.Â”  SheÂ’s very kind, and while she expects a lot from her students, she is unambiguous about those expectations.  During each lecture, she writes outlines on the board of everything related to the dayÂ’s topic that we must know for the exams.  If she says something during the lecture but itÂ’s not written on the board, we arenÂ’t expected to know it.  This system makes explicit what we need to study for and what we donÂ’t.\n2:  CLASS CONTENT.  The course has four sequences: (1), a simplified overview of evolutionary biology, (2) an overview of the living primates, (3) a section on pre-hominid primate evolution, and (4) hominid evolution.  The work for the first two sections was mostly reading, but in the last two sequences, much emphasis was placed on analyzing fossilized skeletal morphologies (especially skull casts during discussion section).\n3:  WORKLOAD.  LOTS of memorization.  Short required textbook readings (not essential), short required articles (essential), attendance at discussion sections (these recitations are definitely worthwhile).  Midterm (one-third of grade) and non-cumulative Final (two-thirds of grade).  Both tests required memorizing (i.e., being able to recite out loud) the lecture outlines, and understanding the required articles.  Short answers on both tests, essays on the final only.  AÂ’s are difficult, but with sufficient studying, youÂ’ll get a decent grade.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 11, 2005",
            "review_content": "\nI took Prof. ShapiroÂ’s class to fulfill my science requirement. IÂ’m glad I did for two reasons: (1) Prof Shapiro is aware that some students take this to fulfill a requirement and embraces this fact instead of resents it and (2) one can learn solid study strategies to add to their toolbox and use long after one forgets what allopatric speciation is. \nProf Shapiro rolls up her sleeves and digs into teaching up to her elbows. Within the first few weeks students get a rather long, (and I discovered after the mid-term) useful document on study strategies, as well as a long document on Â“class rulesÂ” with contact information. The web site for the course is excellent. It is clear Prof Shapiro puts a lot of thought and effort into every aspect of teaching this course. If you can play by the rules (which are not that difficult) and try to tackle the material, she will move mountains to help you. For example, she is very easy to contact and encourages students to take advantage of this. You can email her (most of my emails were answered within a day and the answers were friendly, informative and encouraging), she has regular office hours: go. She even allows students to telephone her at home! \nThere is a lot of material to cover in the course. Her objective seems to be that everyone will master the bulk of the material.  Those who failed the mid-term were given the opportunity to enter into a Â“contractÂ” where they would go through a series of steps to prove that they revisited and mastered the material (this includes meeting with her, she will help a lot if you show effort) and the student must agree to follow steps for the rest of the semester to avoid falling behind again. Fair, but strict and clearly beneficial. (She is focused and a strict taskmaster.)\nThe readings fit well with the lectures and are important when exam time comes around. She recommends reading the articles AFTER the lecture. I ignored this advice until the second half of the semester to my detriment. The lectures are good, I liked Prof ShapiroÂ’s lecture style. Her lectures are fast, clear, and she peppers them with silly asides that are not gratuitous: She does it to help you remember something! For example for Homo habilis she said think of James TaylorÂ’s Â“Handyman.Â” Sounds really silly, but these little things help. It is apparent that Prof Shapiro has sat down and asked herself Â“How can I present this material best?Â” For the dentition lecture, we bit into three different types of food and described which teeth we used for the initial bite.  It is clear that she puts a lot of thought into every single aspect of the course, and I appreciated that a lot. \nThere is an average amount of reading for the class, but it covers a lot of material and one has to know it. (The articles are important!) The lectures are important. She usually brings a recent clipping from the NYTimes to each class that relates to the class. So, even during the semester, she is still trawling around for relevant information. The labs are generally not that great except for the ones we examined artifacts and skulls. (Shapiro keeps a record of who goes to the labs and good attendance reflects well on the student and translates into effort on her part to move mountains to give you help when you need it.) As a matter of note: she keeps cards with notes on each student, so she knows whatÂ’s going on with each student. The mid term is Â“time pressuredÂ” and detail oriented. The museum visit assignment (Prof Shapiro was at the museum to answer questions) got a groan and an eye roll from me but I ended up realizing it was a useful review for the final (if one studies a bit before doing the visit.) Overall, I highly recommend this course. Professor Shapiro is an excellent teacher who goes the extra mile for her students. If you meet her half way (and you must), she will do whatever she can to make sure you get something valuable out of the experience.\nWorkload:\nReading: average to a bit above average. Mid-term, Final, Museum Visit, Labs (not required but recommended)\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 04, 2005",
            "review_content": "\nThe best professor I've had at Columbia.  She is absolutely crazy about anthropology, and by the end of this course you'll love it too.  VERY CLEAR LECTURES, and the one class that I truly looked forward to because it was so interesting and because Prof. Shapiro is so funny.  In contrast to many professors, Prof. Shapiro is great at teaching and explaining things so that they are fascinating.  Wonderful course.  \nWorkload:\nThe concepts aren't hard to grasp, but there's a ton of material to remember.  Do not skip class - it's easy to fall behind.  \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 20, 2004",
            "review_content": "\nShe is a great professor. The most important thing is going to class- she takes test questions right from her notes. And the lectures are excellent- not only are they interesting but well-organized. The first half of the class is more science-y, the second half is more interesting but a little more memorization, (concerning past primate species that eventually leads to the human species.) She is very helpful during her office hours. If you don't understand something, go right away or else you'll start lagging behind. \nWorkload:\nMidterm, Museum Report (at the Natural History Museum), Final. Alot of reading every week, I recommend reading the textbook before class and the articles after. The midterm was alot of work with a little time. The museum report will really help you out with the finals- I recommend going twice if you want to really understand the class. \n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "November 30, 2002",
            "review_content": "\nHow anyone could ever submit a negative review about Professor Shapiro or this class is completely beyond me. This class ROCKED MY WORLD!!!! Professor Shapiro is, without a doubt, the greatest teacher Columbia has EVER seen. As a bright-eyed first-year, I walked into her class, and I'm sorry I had to leave. This was my first encounter with a true New Yorker, who talked faster than I could think and whose enthusiasm for oranguatans and fossils filled the room and our brains. Her love for the subject, for teaching and most importantly, for her students made the work load okay. Yes, it was a hard class. But she warned us the first day, and every day afterward. If you don't have any interest in evolution, this probably isn't the class for you (although you're still better off here than in chemistry if you're science-phobic). If you have any miniscule interest in the subject, you will leave her class completely enthralled. So TAKE THIS CLASS!!!! One problem: Professor Shapiro isn't teaching it any more. Unfortunately, the university is allowing the anthropology department to rid itself of its physical anthropology component, so Professor Shapiro is now working as a dean in the junior class center, where her incredible knowledge and enthusiasm of human evolution languishes. If you care at all about such an amazing field, let the university know that you want this importat subject taught, and you want this incredible woman back teaching it!\nWorkload:\nSo it was hard. A midterm (1/3) and a final (2/3) with weekly readings and a museum project (which was incredibly helpful for the final and a lot of fun, besides). Don't worry, if you go to her office hours, she WILL get you through and she won't fail anyone who tries.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 22, 2002",
            "review_content": "\nTwo words--pretty hard. If you're looking for an easy A forget about it, if you're for an easy B forget about it. 1/4 of the class failed the midterm, need I say more? Shes NOT THAT great of a professor, people seem to rave about her but shes really not that approachable unless you can recite all the articles she gave and even then she can make you feel stupid in a second. Eh, cute class, but don't expect a break. Choosers BEWARE.\nWorkload:\nGO TO LECTURES!!!! LOTS OF MEMORIZATION FOR FINAL!!!!!!! Museum trip that is awesomly long. (it is awesome for a reason)\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "January 21, 2002",
            "review_content": "\nAfter years of swearing to leave, Prof. Shapiro has, and that's a shame; she's a gem. She is the only redeeming thing about this class. I can't imagine wading through the only vaguely interesting high school bio review, primate facts, and endless lists of primate and human ancestors were it not for the promise of being taught by her.\nWorkload:\nSilly textbook readings and a long list of articles; museum project that will eat five or so hours and be promptly forgotten; midterm; final. The physical workload is next to nothing, but the amount of memorization for the midterm and final is sadistic. Beware. The weekly recitation is recommended, but not really required.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 03, 2001",
            "review_content": "\nA perfect example of why a great professor does not always make for a great class. Shapiro is one of the best profs at Columbia, hands down; her energy and passion fill the room and reverberate off the walls. Her lectures are incredibly well organized and make for great notes. In addition to being an expert in her field, she seems to know everything there is to know about both pop and haute culture, filling her lectures to the brim with references to everything from obscure, artsy foreign films to cheesy 80's pop to The Simpsons. Slightly insane and a virtual wellspring of corny jokes, but always incredibly engaging. Also really dedicated to her students; on Sept. 11 she sent out her home number and told students they could call as late as 3 am if they wanted to talk for any reason. Very clear about the course requirements, INCREDIBLE about answering students' questions, just overall a fantastic, brilliant teacher who makes students her #1 priority. You almost forget while you're under her spell that you're being forced to memorize a bunch of long Latin names and annoying details about every single known human ancestor. Not her course, she only fills in from time to time, and I suspect it would be a better class if she took more liberties with it. Recommended for the experience of having her, and because it's a way of fulfilling the science requirement without having to take a lab, but you won't likely find the material itself particularly thrilling.\nWorkload:\nShort textbook reading and 3 or 4 articles due every class. Textbook readings are useless, but read the articles carefully. Going to class also a must. Mandatory, time-consuming trip to the Natural History Museum, midterm (super-picky but easy if you have a decent science background), and final (study your ass off). No papers, problem sets, or written work of any sort (except study guide from aforementioned field trip.\n"
        },
        {
            "course_name": "Race: A Tangled History of a Biological Concept",
            "review_date": "November 12, 2001",
            "review_content": "\nThe best professor at Columbia University! This is the most controversial class on campus... and if that isn't enough to get you to class, her well thought out class notes that lead to phenomenal lectures will!!! Her enthusiasm is like no other professor here - she never loses a listener. \nWorkload:\nThis is a graduate course - I took it as an undergrad - so there is heavy reading, but the information you are learning and the lectures make it all worthwhile.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "September 09, 2001",
            "review_content": "\nI took this class two years ago, but it's still one of my favorites. I LOVE Jill Shapiro, she will always amuse (to some people, annoy) you and she's very committed to helping you pass the class. An excellent teacher, very organized, and very helpful.\nWorkload:\nFair amount of reading, second half of course deals with lots of memorization.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 31, 1999",
            "review_content": "\nThinking about taking this class because you think it's going to be an easy science req class? Expect to memorize tons and tons of crap that you will quickly forget. Very boring subject matter.\nWorkload:\nmuseum project, midterm, final.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 31, 1999",
            "review_content": "\nI took this class over the summer as part of the anthro science sequence. Overall, I feel that this class was more interesting than the next semester's Behavioral Biology of Living Primates. There's quite a bit of material to memorize in this class, and it didn't help that everything was compressed into one summer session. There's also one project where you have to go to the American Museum of Natural History and spend literally at least half a day copying down tons of information that you're just going to forget anyways. Decent class I suppose. The professor has a great personality and obviously tries to get students interested in the material. I do respect the fact that Prof Shapiro cares a lot about teaching unlike many of the other klumps Columbia hires to do research.\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Shapiro has an excellent teaching method. She is articulate and exciting, and displays an obvious passion for Anthropology. A note to those who don't actually like Anthropology but are taking the class to fill a science requirement Don't. If the origins of humans interests you, it won't be so hard to pick up the bunch of different species names, but if it doesn't, be prepared to memorize gobbledegook and hope to understand it. Also, since the textbook almost never covers what's \"current\" in Anthropology, don't expect to not go to the lectures, do the reading, and pass.\nWorkload:\nReasonable amounts of reading, midterm, visit to Natural History Museum and Final\n"
        }
    ]
}