{
    "prof_info": [
        {
            "prof_name": "Seema Vora",
            "prof_id": 4587,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 18, 2010",
            "review_content": "\ni can understand the previous review. she's not stupid and she seems like a good teacher at first. but i didn't really get anything out of the class. she just repeats over and over again that you have to have 'stakes' in your essays. that's her advice for every essay. i still don't know what stakes are. she thinks this is really thought-provoking advice, but it's incredibly frustrating. i have no idea what she considers 'stakes'. as she explains it, 'stakes' is what makes the reader want to read an essay. but, honestly, i wrote an essay with CLEAR stakes (i.e. a reader would definitely be interested) and another WITHOUT ANY STAKES (i.e. i wrote it in about two hours on a topic i didn't give a shit about) and i got a better grade on the second one. she never elaborates on what she wants, she just repeats that your essay needs some 'oomph' behind it, yeah? i'm speaking in seema-isms now. they get so fucking frustrating.\nSIMPLIFIED REVIEW: she's really into herself and a really hard grader. she really only values her own opinions. \nin two semesters at columbia, i've had only A-range grades. except for uwriting. i worked hard in it, but seema's a bitch who doesn't value anyone's work but her own, so she gave me a B. \navoid.\n\nWorkload:\nthe same as other uwriting classes. you will just have to know that she will probably give you a bad grade.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 10, 2009",
            "review_content": "\n***In the interest of presenting an un-biased review, this review was written before the final grade was received***\n    Quick-Statement: You're at Columbia now, so there is no way to avoid University Writing. This Core Curriculum class is taught almost entirely by TA's, some good, some bad. That said, one could do far worse than take this class with Seema Vora. \n    The GOOD: Columbia, unlike many other institutions, does not slavishly hold to the \"Intro-Point 1-Point 2-Point 3-Conclusion\" or \"Three Prong Thesis Paper.\" University Writing strives to teach you the mechanics of how to write genuine journal-worthy material, although the consensus is that it does not have the proper staff with which to do so. Seema is NOT a teacher by trade; she is a writer. That said, she has a good understanding of what exactly it is that she is teaching - and she is more than accessible to students who are struggling with the concepts. \n     Peer-teaching is a huge component of her class. Almost all course work is done in small groups, often randomly assigned. This is good, though, as you will get unbiased reviews of your work by people who are not necessarily your friends (although you will likely end up their friend by term's end). Seema presents a general idea, and then the class breaks into smaller groups to hammer it out, reconvening periodically to make sure nobody has strayed too far off course. \n     Her grading policy is fair, although numerous students have complained that grading was not commensurate with effort. This is probably true; but effort alone will not/should not get you an \"A.\" Implementation of skills and mastery of concepts, on the other hand, are much more likely to do so. My advice would be to leave your High School methods of B.S.-ing papers at the door, and actually delve into what is that she is teaching. Remember, she's an MFA fiction writer...her B.S. radar is more refined than the Nautilus. \n      Attendance and participation is a component of the grade, although not as high as one might expect. That being said, it was rare to find multiple absences amongst my class. She is engaging and funny (and, though it doesn't matter, extremely attractive), and class was always made engaging and interesting. \n\n     The BAD: Seema's flaws were not necessarily her own, and she managed to rectify them. Early in the class, we were given nightly writing assignments which we were told would affect our grade per-unit. We were also told that she would read them. She did neither. That's fine - to do so would be to commit at least two hours of reading/assessment per night, and no grad student has that kind of time. As such, she simply stopped giving assignments altogether after Unit 1, and the only real assignments were draft-related. \n     She also struggled a bit providing clear, concise definitions to course terms. For instance, the question \"What exactly is a close read?\" would result in a lengthy, circular explanation. The beauty, of course, is that she KNEW she was struggling, and often asked class members, \"Does this make sense to you?\" IF you had the courage to say \"No, Seema. It's F'ing Greek,\" she would explain it again...and the second explanation was usually a winner. \n        Affirmations/Refutations:    None...she has yet to be reviewed!\n        Final Words:   You've got to take this class, and you probably won't have too much say in which section you will end up taking. Seema is a great instructor, although she will only be here for one more semester (Spring '10). If you have the good fortune of taking this course with her, do your work, read, and participate. Not because you'll get points for it -- but because by doing so you will truly make the most out of your teacher's AND, equally importantly, your peer's contributions. \nWorkload:\nLens Essay: 25% of your grade. Circa 2000 words.\nConversation Essay: 25% of your grade. Circa 2500 words. \nResearch Essay: 35% of your grade. Circa 2500-3000 words. \nResearch Presentation: 5% of your grade. 15 minutes. \nRadical Revision: A revision of EITHER your Lens OR your Conversation Essay. If it is BETTER, the higher grade is given to that essay and weighted 35%. If it is WORSE, the higher grade remains attached to that essay and the lower grade counts as 10%. \nParticipation: A 1/3rd letter grade in either direction, up or down. \n"
        }
    ]
}