{
    "prof_info": [
        {
            "prof_name": "Tina Kao",
            "prof_id": 12485,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Science of Psychology",
            "review_date": "April 15, 2015",
            "review_content": "\nIt's surprising that someone could be such a bad lecturer.  She speaks in a monotone voice and is able to make even psychology seen super boring.  In many lectures she says, \"You will not need to know this for the exam\" and i am shocked that we spend so much class going too much in depth on neuroscience and complex experiments that we don't need to know for the exam.  Her power points are mainly just graphs and images with only the broadest main points listed, making them hard to study from if you miss class.  \nHowever, she pretty much follows the book and the material is relatively easy to learn.  Over half the class was taking the course for the science requirement which brought in a curve for the exam.  \nProfessor Cornwall taught the second half and he is a great lecturer, has detailed slides, and includes many interesting and relevant examples.  His passion contrasts sharply with Kao's teaching methods.  \nWorkload:\none midterm - half multiple choice, half short answer (heavy on drawing graphs)\none final - non cumulative\ntwo very short papers\n10% of grade is just psych participation\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "March 09, 2015",
            "review_content": "\nI am amazed at how unbelievably awful of a lecturer Professor Kao is. Most of the lectures cover either obscure psych studies that are barely relevant to the material or very detailed anatomical and physiological information about psych topics that she tells us we don't need to know. She occasionally goes over some important definitions, but she basically repeats what's in the book. If she goes into anything with any level of excitement, it's usually a biological process that she tells us we don't actually need to know. \nFor our midterm, she's given us very little information (and unlike most science of psych classes, we only have one). We've been told that it will be 50% multiple choice and 50% short answer, but I honestly have no idea how to study because there is no practice exam, no list of topics, and little help from her in class. \nI'm halfway through this course and thankfully she isn't teaching the second half, but even a semester of these lectures was too much - and by too much, I mean too little important, course-relevant information and too much random, useless information. \nWorkload:\nReading for each class that is moderately helpful (the book is just okay), 2 papers that are pretty painless. \n"
        }
    ]
}