{
    "prof_info": [
        {
            "prof_name": "Maria Crisafi",
            "prof_id": 1183,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Psychology Statistics",
            "review_date": "June 24, 2014",
            "review_content": "\nDO NOT TAKE ANY CLASS WITH HER EVER. EVER. EVER.\nI had psych stats with her and she is the worst professor I've ever had it was almost unreal. \nShe never was able to explain anything and it was so evident that she had no idea what she was talking about that you couldn't help but pity her. She said on the first day of class that she specializes in developmental psychology but what she really must have beens saying is that she knows absolutely nothing about psychology statistics. \nShe is so incapable of answering questions she would blatantly admit she wouldn't understand what the student was saying and would move on. Sometimes she would avoid asking if we had questions/ going over confusing coursework because she wouldn't be able to answer questions. So we would go on to new material without fully knowing the previous material. \nAll her power points are copied straight from the book that she just reads off. And she goes so fast taking notes is impossible. \nThe only reason i ever went to class ever was to turn in homework that she only graded for completion. Other than that it was the biggest waste of time.\nshe also has the weirdest sense of humor that comes off as rude, sarcastic, and hesitant. \nI had to learn all the material from the book because words cannot emphasize how little help she was. I scored well above average on all the tests, studied a ridiculous amount, and still ended up getting a B in this class. \n\nWorkload:\n3 long, hard midterm exams with a ll types of questions. Once I didn't even finish the exam. A lot of questions that she didn't funny explain or explain at all. \nShe doesn't curve but gives 3 5 pt extra credit opportunities that aren't much help\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "July 05, 2012",
            "review_content": "\nShe's not that bad. I took her course over the summer and yes, it is DULL, but it's not entirely her fault. She's pretty funny, actually, and her parenting stories break up some boring material. True that she does basically recite what's in the textbook (by reading it off the ppt slides), but part of that is attributable to trying to squeeze a lot of information into a short period. I personally find developmental psych monumentally dull, so I don't blame it on her. And whoever said the text book was more interesting must have had a different book, because the one we used made me want to blind myself to be able to stop reading. The tests were also not that hard, and she offered extra credit because she very obviously wants everyone to do well. She IS, however, pretty disorganized, often forgetting to send us things she'd promised or sending them so late as to almost be useless. \nIn short, the class is not the nightmarish experience the other reviews make it out to be. I wouldn't take it for kicks but if you need it, don't dread it, it'll be fine.\nWorkload:\nFor Summer: Midterm and a final, each worth 45%. Participation worth 10% (but it's a lecture class, so...). A lot of textbook reading of dubious necessity. She ended up assigning a 2 page paper reflecting on a NYT article worth up to 10 points on your midterm score.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "April 25, 2008",
            "review_content": "\nThe Devil Wears Eileen Fisher!!!\nI swear this woman is missing part of her brain.  I sat through this class wishing that she would say ONE intelligent thing, but alas, nope!  She also taught both lab sections and would change her mind from Tuesday afternoon to Wednesday morning and then ask the Wednesday morning lab to repeat information to Tuesday.  This resulted in the such mass confusion that everyone failed their first assignment.  The grading rubrics she gave the TAs for the lab were absurd!  This is why more than half of the lab students are pass/failing the class.\nNot only is she a failure as a teacher but she is a failure as a parent as she tells us in class.  Her stories detail all of her children's mishaps with the law and otherwise.  I feel so badly for her, but seriously....\nDO NOT GO NEAR HER!\nWorkload:\n2 midterms where you have to memorize every word the textbook.  For the lab there are major writing assignments and 2 lab write-ups (about 40 pages each)!\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "October 31, 2007",
            "review_content": "\nI seriously HATED this class with her. The subject was interesting but she made it so dull, I can't emphasize that enough. I guess she is nice, the few times I did try to approach her, she spoke to me like if I was a 2 year old, which was not appreciated. I did well in her first exam, but couldn't take her lectures so I dropped her course. If you need to take Dev.Psych. wait to take it with Nim Tottenham, she rocks!! \nWorkload:\n3 very hard exams \n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 02, 2007",
            "review_content": "\nI looked forward to getting a bikini wax more than going to her class.  She pretty much recited exactly what was in the textbook during her lectures.  But honestly, I found the textbook to be more exciting and intellectually stimulating than she was.  Also, anyone who has taken a gender class wil probably find her lecture on the differences between boys and girls to be mildly offensive.  She takes attendance, so bring your laptop to class and play solitaire.\nHer two midterms were ridiculously hard, and require you to memorize every minute detail in the textbook.  The second midterm was given one week before the final (she obviously thinks that her class is the only one weÂ’re taking).  If that wasnÂ’t bad enough, she posted our midterm grades on the blackboard right before we took the final: 3 students got an A, and 9 students failed.  You would think a psych professor would know better.  And for the record, I got a B+ in her class (just so you know that IÂ’m not a bitter student who got a C).  However, I know the majority of the class did not do so well.\nOn the flip side, her final was really easy.  She gave us the essay questions that were going to be on the exam a week earlier, so you really only had to prepare the night before the test.\nAvoid this class if you can.\n\nWorkload:\nTwo really hard midterms (multiple choice), one easy final (essay), and class attendance.  She gives a few extra credit assignments throughout the semester. \n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "January 12, 2007",
            "review_content": "\nProfessor Crisafi is a really nice woman, but her lectures are a waste of time because everything she says is talked about in the textbook. I wouldn't have gone to class at all if she didn't take attendance and show random videos that were usually mentioned on exams.  Read the textbook and use her notes to highlight what's most important, and you will do well on her exams. It's a lot of memorization, but also a lot of common sense... overall, I recommend this as a nice blow off class.\nWorkload:\n2 exams (I thought the first one was really easy and the second one was way too difficult), 1 final that you hardly needed to prepare for, and some opportunities for extra credit.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "December 28, 2006",
            "review_content": "\nCrisafi is so kind and understanding.  And her lectures weren't as bad as other reviewers have claimed.  crisafi really cares about her students.  She will do anything to help you get a good grade--she gave THREE really easy extra credit opportunities.  And when we complained about the lab instructor, Jared Katz, not giving us enough time to write out 20 page lab papers, she extended the deadline for everyone.  I admit, the lectures weren't absolutely riveting, but if you want to take a class with a professor who actually cares about her students (in a large lecture class, too), then take a class with Crisafi. \nWorkload:\nReading through the textbook was strenuous, but taking good notes during class was most important for the midterm and final.  \n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "December 20, 2006",
            "review_content": "\nProf Crisafi is very nice. Her lectures are somewhat boring (though no more so than your average college course)and it often seems that she is not covering much material. For the tests its important to at least skim the reading highlights and know them as well as studying class notes.  A lot of material needs to be remembered for exams, but it isn't impossibleas long as you're thourough.\nWorkload:\n2 multiple choice midterms and 1 short answer final which is only worth 12%. 1 optional extra credit article summary and 1 short required article summary.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "January 05, 2005",
            "review_content": "\nHORRIBLE PROFESSOR!!  horrible lecturer.  So boring. Useless to attend classes.  Horrible grader. I was so disappointed with my grade.  not professional AT ALL! DONT TAKE THIS CLASS. NOT RECOMMENDED!!\nWorkload:\ntheres like 400 pages in the textbook that you had to memorize word to word in order to do well.. midterm final and an article summary\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "December 31, 2004",
            "review_content": "\nProf. Crisafi is definitely intelligent and knows her stuff.  I enjoyed the class very much but the lab with Fabiana DesRosier was horrrrribbbbllle.  The material is easy to learn.\nWorkload:\nmini essay, midterm and final. you can do really well if you study for it.  Materials must be memorized-which can be time consuming if psy is new to you\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "December 29, 2004",
            "review_content": "\nShe is a nice professor.... she is approachable during class and outside of class.  She seemed to truly care about the student's feelings and concerns about the class.  The matrial is very exciting... HOWEVER going to lecture can be pointless sometimes....just read the textbook.  Also the continual references to her children can be annoying...and takes away from topic\nWorkload:\n2 exams and a 2 pg paper in the beginning of the semester.\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "December 29, 2004",
            "review_content": "\nVery boring lectures, seems to not have any clue of what she is talking about unless she is going on one of her tangents about her children. Lectures were painful due to the fact that she pretty much read straight out of the textbook and was extremely disorganized, but there was a sign in sheet passed around during every class so you had to attend. \nWorkload:\nVery difficult multiple choice midterm and final. One -two short papers (one is for extra credit) that were very easy. Lab work if you are in the lab, two short quizzes and three lab reports with one final group presentation\n"
        },
        {
            "course_name": "Infant Development",
            "review_date": "October 18, 2004",
            "review_content": "\nThe worst professor I have ever taken!  You are left to your own devices to understand & cover the material because she will NOT do it.  She is completely disinterested in teaching & could not care less about your learning.  However, she will test you on EVERYTHING!\nWorkload:\nPaper & final.\n"
        },
        {
            "course_name": "Infant Development",
            "review_date": "May 21, 2004",
            "review_content": "\nCrisafi is something of a contradiction.  Her classes generally consist of her detailing some incredibly basic material for 15 minutes or so, then spending the remaining time talking about her family or showing movies that serve little purpose other than to allow you to doze off.  However, despite her incredibly kind demeanor, she is a tough grader and does expect you to know the material from the book she 'didn't get a chance to cover' in class.  Much of the semester is spent by students giving oral reports for the first half of the class, giving her another opportunity to kick back and relax.  I don't mean to sound venomous, she really is nice, but it's somewhat vexing.  The class is a relaxing way to spend an hour or two, but does require a lot of reading to figure out what the hell you're supposed to be learning.\nWorkload:\n1 oral presentation, 1 extensive research paper (with a minimum of sources that make it fairly cumbersome), and a final consisting of short essay questions.  Read the book!\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "September 06, 2003",
            "review_content": "\nProf Crisafi is really nice but the class is def not overstimulating.  Some of the material is interesting and the prof is really funny at times, but she does talk about her kids too much.  The videos shown in class helped to break up the 3 hours but didnt provide much else.  Prof Crisafi is a really charasmatic person and a good teacher but the material was too basic and the class atmosphere really lax.  \nWorkload:\nlight. some reading and a ridiculously easy \"paper\".  The tests were nitpicky but no complex thought was involved. \n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "September 01, 2003",
            "review_content": "\nBORING!  Crisafi is really nice, almost too nice to be teaching college students.  Her style is terribly laid back, and she teaches at a snail's pace.  For example, we spent hours listening to stories about her children... lovely, but totally uninteresting to anyone but their grandmother.  We also had to watch videos of childhood and fetal development- slightly educational but mostly just dull.  It got painful at times.  I hate to critisize this class because Crisafi was so good to us, but I also hate to sit in class and feel as though I could learn all the material by myself by reading some paperback, popular psych book over a weekend.  Oh, but don't be fooled. Just because you're taking it easy in class doesn't mean you'll breeze through the exam.  You'll have to study- not a lot, but she often tests on things in the book that she didn't have time to go over in class.    All in all, I'd say the professor was good, but the class was flakey.  \n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "August 04, 2002",
            "review_content": "\nProfessor Crisafi is wonderful. She's always prepared for class, and her three-hour lectures are truly enjoyable! If you're even remotely interested in taking Intro. to Developmental Psychology, I highly recommend her six week Summer Session I course - it's short and sweet!\nWorkload:\nOne easy paper, two semi-easy exams. Go to class and take notes; exam questions are drawn from lecture material.\n"
        }
    ]
}