{
    "prof_info": [
        {
            "prof_name": "Xiaodong Wang",
            "prof_id": 1816,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Information Theory",
            "review_date": "September 06, 2015",
            "review_content": "\nProf Wang isn't the most animated lecturer and the room gets hot and it's Friday and it's easy to start dozing off. None of that changes the fact that information theory is BEAUTIFUL. It's easy to get lost in the mathematics (of which there is a lot - more on that in a bit). I highly recommend taking some time after you get home and try to digest what you're learning, get an intuitive feel for what entropy and channel capacity and \"information\" are, and you will find your mind blown time and time again. The idea that something as \"dumb\" and taken for granted as zipping a file is (asymptotically) equivalent to something as profound as automatically finding all the structure in a dataset is at first unfathomable but becomes obvious as you go along and has very exciting implications. Many of the proofs and algorithms you learn about (Blahut-Arimoto, reverse water-filling, Lempel-Ziv) are extremely aesthetically appealing as well. Unfortunately some of the proofs are quite tedious.\nDon't let the department fool you, this is not an engineering class (despite being taught by an IEEE Fellow) but a mathematics class. The registrar is lying when it says the prereq is just \"probability\"; the real prerequisites should be STAT4105+4107 (probability and statistics), ELEN4815 (random signals and noise; not obligatory but good to have), and real analysis. \nUnfortunately the class is not focused as much on interpretation as I would have liked. Cover and Thomas is an excellent textbook and a pleasure to read. I also found David MacKay's videos from Cambridge helpful for intuition for the first few weeks but be warned, this class goes a lot deeper into information theory the Cambridge class.\nWorkload:\nBiweekly problem sets, somewhat challenging. A lot are taken from papers in the IEEE information theory journal from the 1980s.\nMidterm covering first half of the material, final covering second half, both proof-based. \n\n"
        },
        {
            "course_name": "Information Theory",
            "review_date": "September 06, 2015",
            "review_content": "\nProf Wang isn't the most animated lecturer and the room gets hot and it's Friday and it's easy to start dozing off. None of that changes the fact that information theory is BEAUTIFUL. It's easy to get lost in the mathematics (of which there is a lot - more on that in a bit). I highly recommend taking some time after you get home and try to digest what you're learning, get an intuitive feel for what entropy and channel capacity and \"information\" are, and you will find your mind blown time and time again. The idea that something as \"dumb\" and taken for granted as zipping a file is (asymptotically) equivalent to something as profound as automatically finding all the structure in a dataset is at first unfathomable but becomes obvious as you go along and has very exciting implications. Many of the proofs and algorithms you learn about (Blahut-Arimoto, reverse water-filling, Lempel-Ziv) are extremely aesthetically appealing as well. Unfortunately some of the proofs are quite tedious.\nDon't let the department fool you, this is not an engineering class (despite being taught by an IEEE Fellow) but a mathematics class. The registrar is lying when it says the prereq is just \"probability\"; the real prerequisites should be STAT4105+4107 (probability and statistics), ELEN4815 (random signals and noise; not obligatory but good to have), and real analysis. \nUnfortunately the class is not focused as much on interpretation as I would have liked. Cover and Thomas is an excellent textbook and a pleasure to read. I also found David MacKay's videos from Cambridge helpful for intuition for the first few weeks but be warned, this class goes a lot deeper into information theory the Cambridge class.\nWorkload:\nBiweekly problem sets, somewhat challenging. A lot are taken from papers in the IEEE information theory journal from the 1980s.\nMidterm covering first half of the material, final covering second half, both proof-based. \n\n"
        },
        {
            "course_name": "Signals and Systems",
            "review_date": "December 16, 2014",
            "review_content": "\nWith all the negative reviews I think I'll come out and say that I *appreciate* Professor Wang. I don't *like* him - I don't think anybody likes him, and to be honest he doesn't give a shit about students either. He cracked exactly one joke during the semester, completely deadpan. \nHonestly I would not trust Vallancourt to teach this class. Professor Wang presents the material in a clear, systematic manner, and test problems are basically the same as homeworks with the numbers changed. Some of the material is difficult but gives you a solid background for future signal processing courses. I especially appreciated that proved all the theorems he presented. But be careful, it's not for nothing - the exams have proofs and you will probably be asked to prove Parseval's theorem at some point.\nIf you ever have a chance, look up the research he does too - he's an IEEE Fellow and gets millions of dollars of NSF funding. \nWorkload:\n1 pset a week, two midterms. Psets very easy\n"
        },
        {
            "course_name": "Signals and Systems",
            "review_date": "December 13, 2011",
            "review_content": "\nUnless your engineering major requires it, try to avoid taking Signals and Systems with Professor Wang.\nFirst off, this man has no soul.  According to some of my classmates, he merely acted like a \"typical Chinese professor,\" but I have had professors from the Mainland/Middle Kingdom who were incredibly creative, ingenious, inspiring, and motivating.  XW is none of those.\nXiaodong typically speaks into the blackboard from only several inches away.  His accented English is very good, except for his tendency to pronounce \"delta\" as \"derta.\"  This is clearly not a deal-breaker, but you may also find his tendency to say \"this is just high school math,\" \"nothing more than...\", and \"Okay? Alright\" all extremely infuriating.  He writes extremely fast, and only uses two board panels, so that he has to erase material unnecessarily quickly.\nI recommend that you make jokes (ideally non-disruptive) in class and ask questions to lighten the mood and encourage a modicum of Socratic dialogue.\nMy last criticism of XW's teaching style is that he just shows up to class on time, stares at the class until people slowly hush up, teaches class for 75 minutes straight, and then leaves.  He does not bother to show up to exams, and is sometimes condescending and dismissive at office hours.\nHowever, Wang Laoshi does wear stylish Puma indoor soccer shoes...check it out if you need to be entertained mid-semester.\nAs for the positive parts of the course: this stuff is really useful.  Fourier and LaPlace transforms at first seem highly technical and complex in the very dense Lathi textbook, but once you struggle through the problem sets, and read the text in the soberest of moments, you will come to see the light.\nIn fact, the last class of the semester didn't cover any examples, but did a fly-through at Mach speed of all of the course material, from basic imaginary numbers all the way to LaPlace-generated block-diagrams of how to build highly-specified filters.\nThe beauty in which this course merges with Circuit Analysis at the end is both incredible and rewarding.  It makes all of the tedious, dense, analytic math seem worth the squeeze.\nIn comparison to a substitute instructor (while XW supposedly spent three class-sessions in China at a conference), XW is way more organized (we did still manage to joke that we hoped XW would be barred from re-entry at JFK Immigration at least until the final).  That said, the Greek substitute had far more of a sense of humor and presented the material in a far less rote, dry way.  That said, when you're going through your notes before a MT or exam, XW's organization pays off.\nMy final comment about this course is that many Asian foreigners (sadly not Asians born in this country, for the most part) seem to have been trained in some of this material as early as high school.  Sadly we westerners are mostly left out.  Thus, this course requires a bit of a jump in acuity from standard (advanced) Calc or Stats or Intro Circuits classes.  But once you take this class, you will feel far more confident about rocking Stats or Intermediate-to-Advanced Econ.  Just prepare to suffer unnecessarily thanks to WANG Xiaodong, since he seems to assume a lot of knowledge and acuity of his students (almost to the extent that he thinks they have seen all the material before).\nThe exams are tough but not impossible.  Prepare a good (permitted) cheat-sheet with as many formulae as you can cram in.  It will pay off.  Apparently this course was executed this year much better than last: more balanced and less challenging exams, and better feedback from TAs.\nThat said, I found myself wishing desperately on multiple occasions that Vallancourt or Zukowski could have taught us the material.\nNighTalon, NYC, 12/2011\nWorkload:\nWeekly problem sets are time consuming if you haven't read the text.  The text is very dense, so reading before class is not always useful.  However, exam problems are very similar to the stuff on the PSets, so preparing for exams should not be too tough, even though there are no practice exams.  There is a generous curve if you're in the top half of the class, but you will get shot down if you're not.\n"
        },
        {
            "course_name": "Signals and Systems",
            "review_date": "August 09, 2011",
            "review_content": "\nI completely agree with the last review. The class was absolute hell, I hated every bit of it. He CANNOT TEACH, and grades badly - not the best mix of qualities. The class was terribly dry, so I just stopped going at one point. But make sure you get the notes, because they are important for the midterms and final (which was curved to a C+ or B-, wonderful). If you cannot get the notes from anyone then just go to class and suffer through it, but just write down whatever he puts on the board. When I finally studied the material, I found that it was actually kinda interesting, although challenging.\nWorkload:\nHomework every week, not very easy. Midterm 1 - manageable. Midterm 2 - RIDICULOUS. Final - hard, but review the midterms before it because some questions were repeated! \n"
        },
        {
            "course_name": "Signals and Systems",
            "review_date": "December 25, 2010",
            "review_content": "\nTake a professor who lacks any teaching ability and would have difficulty explaining to a 4 year old how to add 2 +2, combine with a book that is completely useless, consider that this subject is fairly challenging to begin with, mix in a first midterm that is fair but a second midterm that is SO difficult that entire class bursts into laughter when time is called because they weren't able to even begin half of the problems, and as icing on the cake, put in a final grade distribution with the average grade awarded a C+, 17 % of students receiving a C- and 15 % of students receiving a D (yes, he gave 8 students a D), and you have Signals and Systems with Professor Wang. If you don't need to take this class, DON\"T take it, you will not learn anything and it will only hurt your gpa. If this is a required class for you, my heart goes out. Pray every night that a different teacher might be leading it by the time you have to take it. And by the way, he distributed grades out on Christmas, just to make us all have a great day. \nWorkload:\nProblem set every week, two midterms, and a final. You didn't have to study for second midterm, there is no way it would have helped. On final, make sure you know random definitions, otherwise you won't know how to start the problem. \n"
        },
        {
            "course_name": "Digital Signal Processing",
            "review_date": "December 26, 2009",
            "review_content": "\nLet's get the bad news out of the way:\n1.  He's HEARTLESS.\nDo not expect any concilation from him.  If you made an honest mistake and wrote on both sides of your formula sheet instead of only one, he will give you a 0, and will announce it to the class.  If you plead him to count the final more, he'll just say \"No, I'm not changing the grade breakdown.\"  If you ask him if it's at all possible to pass the class, he'll reply with \"You know the grade breakdown, go calculate your grade.\"\nHe will also tell you that he does not curve, that he will not answer any question regarding what grade you deserved.\n2.  He thinks we're RETARDED.\nIf you ask him some question that he considers dumb in class, he'll stare at you for a while, then elaborate by showing 2 more steps, and then say \"If you don't understand how I went from here to here, drop the course.\"\n3.  The TA is a Chinese PhD student.\nThat means unless you can speak Chinese to the TA, he's not very nice, and he'll hardly understand what you mean.\nNow the good news:\n1.  Tough guy has a soft side.\nOn the last day of class, he will tell you that your final will override the midterm grade ON THE LAST DAY OF CLASS!  So if you bomb the midterm, don't be alarmed -- you will get a second chance.\nHe DOES curve.  His curve is weird though.  He calculates the grade that everyone is supposed to get, and then he shifts everyone's grade up.  My real grade was 2/3 of a letter grade higher than the straight out average according to the grade breakdown  So don't believe the bullshit he tells you.  He's trying to get you to study harder.  Don't be discouraged.\n2.  Xiaodong Wang is a great instructor.\nHis organization is crazy good.  His notes are very good, and he doesn't ask anything on the final that he doesn't cover in class.  If you understand everything he said in class (easier said than done) then you're fine.\n3.  The TA is a Chinese PhD Student.\nAlso a good news, because if you speak Chinese to him, he'll love you.  If you're among the lucky ones, then go suck up to him like crazy.  He'll try to do everything he can to help you out.\nWorkload:\n1 problem set a week that consists mostly of textbook questions and a few (around 2-3) matlab questions.  The textbook questions can be tricky, especially if you understand what's going on in class, but the matlab questions are usually a joke.\n"
        },
        {
            "course_name": "Genomic Info Science & Technology",
            "review_date": "December 30, 2005",
            "review_content": "\nWang is a terrible lecturer, doesnt know the material very well and simply reads off of pretty well made powerpoint slides. The amount you will learn from going to lecture is considerably disproportional to the 3 hours that you have to sit there listening to him. If you are planning to go, bring something else to do, unless you are planning on falling asleep. The schedule for the class was also very annoying, he ended up changing the dates of the first midterm, setting a new date for the second as a result and then changing that one as well. The material in this class is quite easy to grasp and can easily be done the night before a midterm or final. Homeworks are quite long and challenging at times. The course covers alot but there is only so much you can be tested on because alot of it requires a computer to do. It also becomes a lot easier if you come into it with a biology background. Most redeeming factor about Wang is that he loves to give out good grades and will try to maximize your final grade as best he can. \nWorkload:\nWeekly problem sets graded on a good/excellent scale and handed in by email, two midterms and a final.\n"
        },
        {
            "course_name": "Signals and Systems",
            "review_date": "May 09, 2005",
            "review_content": "\nWang isn't a particularly good lecturer. He has a thick accent and just about all of his info comes straight out of the book--personally, I definitely didn't go to lecture very often. The material in the class, however, is kind of interesting, especially if you're good at math. It's pretty important stuff for a lot of the engineering applications. Wang uses a pretty complicated curve for his grading system, but the best part of the entire system is that if your grade on the final is higher than your average of the two midterms, your final counts as 80% of your grade and the midterms don't count. Wang's nothing special, but he's organized and you can always just follow from the book. Tests are challenging, but with pretty low means, you'll end up doing fine. I bombed both midterms, but nailed the final and ended up with an A-, despite going to lecture on only a semi-regular basis.\nWorkload:\nTwo midterms, final. Either a 20/20/40 split between them or the final counts for 80 if you do better on the final than the average of the midterms. Weekly problem sets count for the other 20%, but those are pretty straightforward. Tests are a time-crunch, but are definitely doable.\n"
        },
        {
            "course_name": "Signals and Systems",
            "review_date": "September 08, 2004",
            "review_content": "\nWang is a good professor. If you go to class, you will do well in his class. He provides all the information you need in class. He is also very reasonable with grading; and wants you to do well. \nWorkload:\n1 Problem set a week(towards the end they take longer to do); 2 midterms which you must study a lot for but again the notes are key & final\n"
        },
        {
            "course_name": "Signals and Systems",
            "review_date": "December 02, 2003",
            "review_content": "\nExcellent professor. He has a good approach to deliver the materials. Lectures are very well organized. The exams are easy. most exam questions are taken from the homeworks, so make sure you go through all the homework before going to the tests. \nWorkload:\nweekly problem sets with 5-6 questions. problem sets are harder than the exams.\n"
        }
    ]
}