{
    "prof_info": [
        {
            "prof_name": "David Krantz",
            "prof_id": 182,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "January 12, 2010",
            "review_content": "\nThe phrase \"bored to tears\" has never seemed to apt. On the (very) few occasions I dragged myself into this class, I fell asleep nearly every time. Krantz's slow and labored monotone doesn't help matters either. But that said, this class is probably the EASIEST class I've ever taken at Columbia.\nThe class is divided up into 3 sections, with a non-cumulative exam for each section (the 3rd exam takes the place of the final). Plan your attendance per section as follows: go to 2-3 classes to get a feel for the material, then peace out until the class before the exam, where he'll review everything (ask questions if you missed something), read the slides/review the practice exam for an hour, proceed to ace the exam. Rinse and repeat. Going over the practice exam is crucial! The class before the exam is a review day and he'll go over about 90% of the practice exam--it will tell you everything you need to know and how you should think about/answer the real exam questions, which will be similar (if not some of the same) as the practice ones.\nAs for the (very) few classes you have to slog through in order to get the easiest A of your life, bring coffee and a laptop and you should be set. He reads pretty much right off the slides, but he also tends to throw important graphs and tables on the slides without any captions/explanations, so listen for those.\nFinally, a general note about the material: the stuff you'll go over -- decision methods, optimization, social goals, etc. -- is all incredibly intuitive. You'll run into nothing you don't already know. Even if the terms/theories sound foreign, you'll quickly realize that it's just a different way of referring to something you already know.\nWorkload:\n2 (fairly easy and straightforward) 4-7pg. papers on a topic of your choosing, with re-write options for both if you're not happy with your grade. If you're a decent writer, don't worry about it. 3 non-cumulative exams. Attendance is not at all mandatory.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 24, 2005",
            "review_content": "\nI agree with the previous review.  As long as you have the ability to do some basic math and a little bit of interest in science, this class is for you.  He assigns almost none of the weekly work if any at all.  The class consists of him going of on tangents, some of which are interesting, few of which are helpful.  He has this knack for making any pause in his speech the most ackward 10 seconds of your life.  My advice: suffer through classtime b/c you are avoiding a lot of stupid work.  He definitely knows his stuff so if you have questions he will answer them.  Its when he is on his own, that things get boring, and occasionally absolutely hilarious.  \nWorkload:\nAlmost nothing except for the 4 standardized problem sets and final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 03, 2005",
            "review_content": "\nI would agree that he is a terrible teacher of frontiers. However, I am a science guy and this class was a freakin joke. I didnt really need a teacher to teach me the stuff because I got an A without a teacher. The reason he is so bad is because he rarely addresses the material at hand, but goes off on many, albeit interesting tangents. The truth is that it might not be his fault because no one really knew what material to address because everything was so up in the air. So, I enjoyed some of the interesting talks and I enjoyed getting to know the man, because he is really nice and is a very interesting guy to have discussions with. If you are a science guy/girl, he is a decent choice because this class is retarded and you might as well get to know a cool guy. If you arent a science person, definitely stay away because you will be left out in the cold. \n\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 02, 2005",
            "review_content": "\nOn the surface, Krantz does seem to be the \"worst teacher\" that the previous Frontiers review describes.  I attended every seminar and can honestly say that we did, basically, a whole lot of nothing.  Certainly nothing related to any topic discussed in the lectures.  However, Krantz's effort to make this horrendous class remotely interesting was admirable.  He tried to lead interesting discussions and debates every week, and sometimes even succeeded.  The most noteworthy blessing in disguise about Krantz's Frontiers seminar is the workload.  In an effort to be different  from the other seminar leaders, Krantz offers unconventional (aka ridiculously short and easy) assignments.  So, while other Frontiers classmates from other seminars were whining about their \"cluster questions,\" our seminar was probably reading and reflecting on a Science Times article.  The choice is yours. For a basic course like Frontiers, you can take Krantz and sacrifice a certain degree of stimulation for weird humor and a ridiculously light workload for an easy grader. If you'd rather do crazy amounts of, let's face it, relatively useless work (while actually learning and discussing the material) I'd recommend another seminar leader.\nWorkload:\n\"weekly seminar assignments\" which started off weekly, turned into bi-weekly, and then fell off the face of the planet.  These are usually SHORT, like one or two questions, sometimes involve reading, but usually don't.  The 4 Psets are annoying because they're time consuming, but he grades very fairly, especially if you ask him questions about the stats or math involved.  The Final is also pretty annoying, I won't lie.  It's like a long problem set, 5 out of 7 problems and you get to bring a cheat sheet to the exam.  Again, fair grader.  \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 19, 2004",
            "review_content": "\nKrantz is the worst teacher i have ever had.  Nothing was learned in his class.  He put us at a huge disadvantage by having limited expectations for us.  His advice for the final that is worth 30% and department wide was \"dont study, take the weekend of\".  Of corse listening to this advice would have been stupid on the part of the student, I was still left searching for appropriate material to study because he claimed the entire exam would be self-contained.  He was so wrong.  I did all the work in this class and attended every lecture and seminar.  His failure to prepare his students for the final has the potential to result in destroyed gpa's.  He is honestly the worst teacher.   \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 19, 2004",
            "review_content": "\nKrantz is the worst teacher i have ever had.  Nothing was learned in his class.  He put us at a huge disadvantage by having limited expectations for us.  His advice for the final that is worth 30% and department wide was \"dont study, take the weekend of\".  Of corse listening to this advice would have been stupid on the part of the student, I was still left searching for appropriate material to study because he claimed the entire exam would be self-contained.  He was so wrong.  I did all the work in this class and attended every lecture and seminar.  His failure to prepare his students for the final has the potential to result in destroyed gpa's.  He is honestly the worst teacher.   \n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "December 31, 1999",
            "review_content": "\nWhat I loved: He didn't want to be there either. What I hated: He didn't want to be there either. What I most wished: He had padded the grades. What I most feared: He didn't pad the grades.\n"
        }
    ]
}