{
    "prof_info": [
        {
            "prof_name": "Richard Miller",
            "prof_id": 11950,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "V2318 Diatonic Harmony and Counterpoint I",
            "review_date": "May 17, 2013",
            "review_content": "\nProfessor Miller is not only one of the best professors I have had at Columbia so far, he is one of the kindest. This is the kind of teacher who will email you about assignments over break or on weekends (even though he's on the train on his way to perform in 3 concerts), show up to Friday keyboard hearings just to smile encouragingly, and give you a little nudge towards the error you've made on the midterm when you try to turn it in. The class is difficult, especially the first part which is focuses on species counterpoint, as the previous reviewer noted. Lectures are clear, but expect to spend several hours reading the chapter and perfecting your part-writing in between. While it's not unlikely you'll get 12/30 on some assignments, Professor Miller will ALWAYS allow/require a redo, sometimes even two. If you took AP Music Theory in high school, expect to work a lot less...and somehow learn a lot more. Plus, you'll not only come out a better composer/part-writer, but a better musician, as lectures often include (spontaneous) listening exercises and discussions of what technical elements makes a piece of music emotionally moving.\nWorkload:\nTwo species counterpoint or 4 part-writing exercises per class, usually 8-12 bars, plus the redo of the previous assignment. 5 mini-quizzes (just be on time), a midterm (take home, in our case) and final, and two songwriting projects. Several keyboard hearings throughout the term (playing chord progressions). Reading the textbook if you need to.\n"
        },
        {
            "course_name": "V2318 Diatonic Harmony and Counterpoint I",
            "review_date": "May 03, 2013",
            "review_content": "\nMiller is a fantastic teacher. I have now had him for two semesters in a row, and I can truly say that his classes have been my favorite at Columbia so far. He is not only a brilliant guitarist and a wonderful person in general, but he is a fantastic teacher and really has a way of engaging the entire class. While he can get distracted sometimes (which gets annoying when we need to get through material quickly), he has really done a great job at preparing us for Diatonic II. I am genuinely sad that I won't have him again for a few semesters-- I will miss having a teacher that actually cares about his students.\nWorkload:\nHarder at the beginning of the semester when you do species counterpoint, but it drops down after spring break or so. 1 assignment due every class (usually evaluating a melody and a figured bass and harmonizing both). One midterm and a final based entirely off of the homework (its the same structure-- just one melody and one figured bass). Reading assigned each class, though its not always necessary because Miller explains things so clearly. Completely manageable workload. \n"
        }
    ]
}