{
    "prof_info": [
        {
            "prof_name": "Jeffrey Blustein",
            "prof_id": 1767,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Ethics and Medicine",
            "review_date": "May 09, 2006",
            "review_content": "\nMaybe I'm overly liberal but I thought that he did a great job this semester presenting the major issues and foundations in bioethics and making sure that we understood them in a relevant light.\nThe harsh reviewer was right in that a lot of his lectures are very watered down explanations of philosophy, but that's what the class is for. It is not to go through every thinker and expound of ethical beliefs and their foundations, but to cut to the ethical issue and use it for applied ethics. There were times however where he got some position about a philosopher wrong, like Kant's view on xxxx, but it wasn't that big of a deal. I thought he was very fair in presenting all sides of ethical issues, especially when we were discussing death and abortion. If there was one thing that he may have had an obvious liberal bias to, it would have been healthcare distribution. That was one among many issues and I think it is his job to take a position.\nI had a great time in this class and thought he was a good professor. Very receptive to questions during and after class. Responded to emails promptly, although there is the issue of him not being available b/c he works at a hospital most of the week.\nWorkload:\n1 shorter paper (5-6), 1 longer (9-10), weekly reading, take home final.\n"
        },
        {
            "course_name": "Ethics and Medicine",
            "review_date": "June 05, 2005",
            "review_content": "\nGetting an A in this class has absolutely nothing to do with your knowledge of ethics or your studying, it has to do solely with how well you regurgitate the prof's very liberal views. I have not in my two years at Columbia had such a poor experience with a professor. \nPartially this had to do with the excruciatingly long class time that is the result of the fact that he only comes in once a week, but far worse than that is the fact that the man does not even try to hide his personal biases in class or in grading. Not to mention the fact that the philosophy he teaches - and this is a philosophy class - is so watered down and simplified that it's not exactly correct. In the few philosophy classes that I've taken, I have enough of a basis to know that some of what he said was just plain wrong.  \nSo, unless you are SUPER liberal when it comes to bioethics (and by that, I mean really, reallly, really liberal, as in Peter Singer re-distribution of wealth liberal), have no actual interest in philosophy, and have a ton of patience for long, boring lectures, don't take this class.  \nWorkload:\nThree short papers, a longer research paper, a midterm, a take-home final, and a moderate amount of reading.\n"
        },
        {
            "course_name": "Ethics and Medicine",
            "review_date": "April 02, 2005",
            "review_content": "\nI had Prof. Blustein in Spring of '05 and I can say that he's the best all around professor I've had in my two years here.   He works for the Albert Einsten School of Medicine as an ethical advisor/board memer, so he obviously cares very much about the subject matter.  He explains everything step by step, and if you do the readings and attend class theres no reason why you shouldn't get an A.  He's always willing to stay after class to talk about subject matter or personal ethical dilemma.  Only one criticism: with medical ethics, there are always two sides to every coin; so no matter what side you take on an issue in a paper for the class (even if you lay out both sides and explain why one should win out) he will remind you of your own counterarguments and grade you down for them.  Other than that, TAKE THIS CLASS. He's been teaching the same class for 25 years and with medical advancements it just gets better and better.  Don't be afraid to take it because you're not a medical expert.\nWorkload:\nTwo mini papers (3-4 pages each) due any time before the midterm (inclass- not too hard).  One 8 page paper on cutting-edge issue. Take home final.  \n"
        },
        {
            "course_name": "Ethics and Medicine",
            "review_date": "November 13, 2003",
            "review_content": "\nThis was a great class taught by a great professor. It's one of the few, if only, applied ethics classes at Columbia. Blustein is an adjunct who teaches Ethics and Medicine every Spring semester over at Barnard. The course material is extremely interesting, covering abortion, organ donation, assisted suicide, etc. Blustein knows the material like the back of his hand. He really fosters class participation and he cares about his students and what they have to say. I wish he taught more than just one class.\nWorkload:\nMidterm, final or research paper, and a few 2-4 page papers.\n"
        }
    ]
}