{
    "prof_info": [
        {
            "prof_name": "Ann Warner",
            "prof_id": 1269,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Spanish II",
            "review_date": "April 17, 2005",
            "review_content": "\nExcellent professor! She makes every effort to make classes interesting and enjoyable, which they were! About once a week we had interactive classes, either by some \"social mingling\" game or pictionary, charades, you name it. She has lots of fun sing-song-y mnemonics to help you with things that might be tedious or difficult to remember. Her quizzes were on the slightly challenging side, but that may have been simply because our class was a bit on the advanced side. I can honestly say that this semester we did not have a single class i could call boring or uninteresting. Highly recommended!\nAs a side note, at least one reviewer mentioned that she is not a native speaker (as a positive attribute). I just want to point out that her pronounciation is very close to native, so there is no fear of learning incorrect pronounciation.\nWorkload:\nusual language class: quizzes every 2-3 weeks, 2-3 compositions, midterm, final\n"
        },
        {
            "course_name": "Intermediate 1 and 2",
            "review_date": "September 29, 2003",
            "review_content": "\nI enjoyed professor Warner.  She tried extremely hard to make class interesting and the fact that she is not a native speaker helped with the slower pace and understanding of her spanish speaking.  She took extra time to help me and I was sure to stay with her for both intermediate one and two.  If you come to class regularly and do all of the homework, you're going to do just fine.  I reccomend her!\nWorkload:\nSome busy work, midterm and final (some oral projects)\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "November 25, 2002",
            "review_content": "\nan excellent teacher-- along with Kasten and Ortiz-Cuevas, my Spanish teachers for the somewhat tedious language sequence were fantastic. if you put in the (ridiculously easy) work, you'll do well. Ann prepared a lot for class which made it fun and reduced the boredom for everyone. \nWorkload:\naverage/heavy: 3 compositions, workbook and lab manual... daily assignments; midterm & final\n"
        },
        {
            "course_name": "1102",
            "review_date": "November 18, 2002",
            "review_content": "\nCares about the students and is always willing to help you out, which would be fine if she didn't make class so hard in the first place. Realistically enforces the 3 absence rule, If you're not there then it will affect your grade. Means well, but takes the stuff way to seriously and will sometimes overcomplicate things. \nWorkload:\nSame as every other class. The difference is that she grades real hard. \n"
        }
    ]
}