{
    "prof_info": [
        {
            "prof_name": "Sara Murphy",
            "prof_id": 3161,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 17, 2011",
            "review_content": "\nTo summarize this review, Sara is one of those teachers you either love or hate: \n1) She is generally very bubbly and engaging. She is also very good at facilitating discussions and keeps them flowing and interesting.\n2) However, there are little things that make her explode (in a passive aggressive way). If you have Sara, here are some things NOT to do:\nNEVER say the word \"impactful\" around Sara Murphy. She will bite your head off.\nNEVER ask to write in bullet points on the midterm. She will turn into the Hulk and pwn everybody.\nNEVER use abstractions. Sara = Achilles. You and your abstractions = Hector. Nuff said.\nThere are other things on this list but these are the main ones.\n3) Class discussions are OK and she tends to break the class up into groups to discuss specific topics/ideas then we reassemble.\n4) Sara used to be a UW teacher. Thus, she will rip your papers (and your soul) to shreds. However, you will be a better writer because of it. (good luck putting your soul back together) \n5) To make up for this, though, she is really generous with the midterms and final.\n6) There are also ID quizzes on a regular basis (one every 1-2 weeks). She is increasingly nitpicky with these as the semester progresses but she always includes extra credit on them so that helps.\nPROS: She is very generous with extra credit and gives us lots of opportunities for it. We always have a 5 minute break in the middle of class with snacks. You get 5% in the class just by showing up. \nWorkload:\nID quizzes (every 1-2 weeks). 1 historical context presentation a semester (10 min max, nbd). 3 papers (2 explications and 1 revision). Class participation encouraged but only 5% of grade. Midterm + final as always.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 14, 2011",
            "review_content": "\nYou don't know what you have on your hands when you get Sara as your teacher. She's bubbly and nice for some time and then suddenly she'll flip. Her two second long spurts of obnoxious laughter aren't the most welcome thing either. Her grading is weird too: her goal seems to be to break in freshman who expect to get As--by giving everyone bad grades. And the reasoning she gives is very unclear. Basically, beware if you get Sara Murphy for Lit Hum, it's a roller coaster ride. \nWorkload:\nThree essays that are graded very stingily, difficult in class quizzes, heavy emphasis on class participation, difficult mid-term and final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 16, 2011",
            "review_content": "\nEven though she is relatively new, Prof. Murphy is among the best I've had here at Columbia! She doesn't lecture too much, and strongly encourages comprehensive class discussion. Always available to meet outside of class or via email, and very approachable in general; she also takes our feedback to heart, and teaches the course based our suggestions.\nShe always goes the extra mile to help organize (optional) events outside class that are both fun and engaging to us -some are even worth extra credit! In class, she's really fun and upbeat, and has a great sense of humor. \nMost importantly, she SINCERELY CARES about her students, and will do anything to help us through both the course and our freshman year. I'd highly recommend her, both for lit hum and any other courses she may be teaching next year!  \nWorkload:\nProbably average for this course; very manageable. Midterm and Final, with 2-3 medium short papers (one is a revision of a prior paper), and perhaps a creative assignment. Two 5-minute presentations per semester. Will substitute readings if she finds them to be too long. Very flexible on deadlines. Overall, fair grader, but tends to grade relatively easy on tests and relatively hard on essays. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 10, 2008",
            "review_content": "\nSara is harsh, but she's good. I hear this is a useless class, but I definitely think I got something out of it because of her. \nI agree with whoever said you should stay on her good side and participate in class discussions. She definitely picks favorites, and I felt like she was out to get me. \nShe is quite pretentious, and always has a snide sarcastic remark about whatever she reads - be it the assigned reading or your work. Ignore how she might make you feel - her comments are usually pertinent and helpful.\nWorkload:\nreadings for each class, which can be a lot, not a lot of assignments other than the 4 essays and respective proposal/first draft/final draft. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 25, 2007",
            "review_content": "\nFrom what I have heard from other people, there are both better and worse Uni Writing teachers out there. She comes off as a bit pretentious, and her mood greatly affects the tone of the class from day to day. That being said, she is fairly lenient about assigning due dates, so if the whole class wants it changed, she probably will change it. Also, she stopped using the Portfolio system, so you get a grade after each essay and no final Reflective essay. \nWorkload:\n3 essays (Lens, 1500-1700 words; Conversation, 1500-1700 words; CCP, 2500-2700 words). She doesn't mind if you're a little below your word count. Occasional short writing assignments, but only at the beginning of the semester. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 16, 2007",
            "review_content": "\nContrary to what other people have said, i think Ms. Murphy was a good teacher. She chose some really interesting essay to read, and made the class enjoyable. She's a harsh grader if you write crap, understandably so. If you put thought and effort into your essay, she sees it. My writing improved substatially after taking her class. There is no weekly work, which is great, cause you can just focus on the papers. She has some great suggestions on how to improve your paper. \nWorkload:\nRegular Uni Writing work. She cancelled the Reflective essay for us, which was great. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 06, 2007",
            "review_content": "\nThere are better University Writing instructors out there, from what I have heard.  That being said, it was her first time teaching the class (she is a young graduate student).  She can be pretentious at times but is not a disagreeable person.  \nShe did a good job of selecting interesting readings that led to good essay topics, better than other UW sections.  Many of the classes were not very helpful, but I suppose it is the course's fault (lots of workshopping, basic writing tips, lackluster discussions about the readings).\nGet on her good side early, because she develops impressions that lead to fairly consistent grades.  Participate in class.  We  were on the portfolio grading system which meant that we basically just got an arbitrary grade at the end based on her overall impression of us so keep that in mind if that is the case for your class.\nWorkload:\nStandard for UW.  Regular readings and short writing assignments for every class.  Lens Essay, Conversation Essay, CCP Essay, Reflection Essay.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 16, 2007",
            "review_content": "\nIf you can, get out of her class. She seems pretentious, and assumes we've read and studied every single major philosopher (ie Kant, etc). She is also a harsh grader. Even though she may have good points about your writing, she will say it in a way that completely degrades you. If you are stuck with her, do not get on her bad side. Just participate and try to do really well on the essays. Overall, a really bad experience in her class. She ruined UW for me, even though UW isn't exactly an exhilerating experience itself.\nWorkload:\nsame as Uni Writing\n"
        }
    ]
}