{
    "prof_info": [
        {
            "prof_name": "Peter Pouncey",
            "prof_id": 769,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 03, 2014",
            "review_content": "\nPeter Pouncey is...a mixed experience.\nOn the plus side, he knows his shit really, really well. He's a very smart guy with a lot of interesting things to say. Lots of historical tidbits (he's a Thucydides scholar), and we usually end up discussing broader themes in life instead of staying narrowly with the text. He's also very funny and nice.\nBut...he's not always super lucid. He tends to repeat himself several times and revolves around the same topics during discussions. It's not bad at the beginning of the semester because a lot of it's new, but it gets old at the end. He's also not always very attentive and connected to the students. Frankly, we weren't smart enough to entertain him with something new: this was his 50th year teaching the course, so he's basically seen everything and heard everything.\nWorkload:\nOne 2-page paper, the midterm, and the final (there are extra readings though). Barely any lecture, pretty much only discussion. Class lets out 30 minutes early every day, sometimes earlier. Probably the lightest workload you'll ever see.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 14, 2007",
            "review_content": "\nI agree wholeheartedly with the reviewer who wrote that Professor Pouncey does not lead the most engaging lectures, and that class consists mostly of plot summary.  He does have a few interesting points, though, and he is entertaining.  \nStill, no one can deny that he knows his stuff, that he is nice and understanding, and that he will not assign any more work than he feels is necessary.  Moreover, he always lets class out at least 30 minutes early.  If you want an easy Literature Humanities experience that, while not particularly memorable, is not entirely worthless, this is the professor for you.  \nWorkload:\nAbsurdly light: one 4 page paper (double spaced), one generously easy midterm, and the department final.  Almost no one gets a grade lower than a B+.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 01, 2003",
            "review_content": "\nPeter Pouncey is not only the best professor you could possibly hope for, but one of the nicest people. He commands enormous respect from the class -- it was the only discussion sections where the students HOPED he would lecture -- but at no point acted as though he was superior to his students. He dutifully and thoughtfuly listened to whatever comments were made, and responded to them without shaming or shutting down the student. Plus, office hours at the hungarian pastry shop, where you could hopefully grab a few hours to chat with this amazing man and get free cake and coffee. Supposedly, this is his last semester, which would be a huge loss for Columbia. If you can't take a class with him, try to get to know him anyways, he's worth the effort.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 02, 2002",
            "review_content": "\nI agree with the above sentiment that Pouncey is the best lit hum teacher out there. Sure he was former dean of the college and president of amherst, but he treats the class as equals. His command of the books is incredible. Sometimes I thought I'd rather hear him lecture on the stuff than lead a discussion. Not only is he a great teacher but he also genuinely cares about his students. I felt bad when I didn't do the reading beacuse I wanted to be part of the discussion. If you have him, thank the gods, if you don't find some way to get to know him.\nWorkload:\n2 papers 4-5 pages. easy midterm, dept final. Always lets out early.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 18, 2001",
            "review_content": "\nIf you are looking for an engaging discussion about literature, or looking for amazing insights into the understanding of literature, this is not the section for you. Class consists primarily of plot summary and the discussion of historical context, a lot of rambling about greek words etc. Not the most exciting lectures ever- although they usually end early. Towards the end, with the Old and New Testament there was more discussion and lectures were more interesting. In general- nice guy, very intelligent.\nWorkload:\n2 papers, midterm- both very easy and graded fairly\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 14, 2001",
            "review_content": "\nI can confidently say he is the best Lit Hum teacher at Columbia, bar none. A couple of facts, Pouncey has been teaching this thing forever, and he loves it. He used to be the Dean of Columbia College, and President of Amherst College. He is funny as heck, cares about you, has office hours in the Hungarian Pastry Shop (his treat), and always lets you out early, which sometimes you wish you could spend more time with the guy. Also, he is an expert on Classics and Thucydides, he commands repect, but is incredibly humble. I had to do my own research about him to found out his resume. Some of the Lit Hum professors work you hard because they have something to prove, that is clearly not the case here. He is doing this because he loves it.\nWorkload:\nEasy as it gets, along with midterm, and final, he gives out two papers a semester.\n"
        }
    ]
}