{
    "prof_info": [
        {
            "prof_name": "Koleen McCrink",
            "prof_id": 9867,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Core Knowledge",
            "review_date": "January 16, 2012",
            "review_content": "\nI have mixed feelings about Professor McCrink. I had her for the graduate seminar Core Knowledge, and while she was always engaging and funny, she didn't actually teach any of the class - instead, students took turns preparing two-hour powerpoint presentations on pre-selected material. Luckily, the presentations were usually really good, but it would have been nice to hear McCrink actually present her own area of expertise. While I can totally see how she would be a great lecture professor, as a seminar professor she was sometimes a little superficial and a bit hard to relate to. Finally, she revealed at the end of the course that she had been grading very rigorously all along, though we never talked about grading or saw any grades. The structure of the course made it difficult to understand what she was looking for in final projects and papers, and it wasn't clarified though meeting with her. In short,  I think she's probably a wonderful lecture professor, but I think her personal style could be improved a little for small seminars. \nWorkload:\nPretty heavy but understandable for a grad class: A ton of reading per week, online discussion posts, two-hour presentation, final presentation and 12-14 page grant proposal\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "July 10, 2010",
            "review_content": "\nSUCH AN AMAZING PROFESSOR!\nI cannot give Professor McCrink enough praise. She has been the most engaging and clear professor I have ever had. Even though her Psych class was at 9am, her enthusiasm for psych and her chill personality made it such a pleasurable class to sit through. Whenever I had questions, she was always available to chat, and responded to emails quickly. Her class convinced me to be a psych major. Please take her classes even if you're not a psych major, because you will learn so much.\nGREAT CLASS!\n\nWorkload:\nWeekly readings (that you don't have to do because her lectures explain everything), 1 easy midterm, 1 easier final. She weighs whichever exam you did better on more! I think almost everyone got an A, not because the exams were on the easier side, but because she taught so well.\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "January 05, 2010",
            "review_content": "\nI am always skeptical with new professors, especially in the Psych department, but there is nothing but good things to say about Professor McCrink. She's incredibly smart (Ivy League-educated), funny (during lecture and in office hours), entirely helpful and informative (in aspects even outside of Developmental).\nLectures are interesting, although some may regard them as boring because information in lecture is a mirror of what is provided in the textbook. Regardless, she plays videos during class that enhance the concept being learned. Overall, a very thorough professor who explains everything clearly and properly.\nIf you are unsure, she holds office hours right after lecture for a good 1-2 hours where she will talk to you about anything you didd not understand and will never make you feel slow or stupid. She also holds review sessions for the exams, which she calls \"freak out sessions\" the night before the test. Medium sized turn out and she goes through all of her slides, one by one, to answer any questions that any student had. Really patient!\nA true gift in the Barnard Psych. Department. I would undoubtedly urge you to take a class with her, any class. Honestly, one of the greatest professor I've had in the department!!\nWorkload:\nIf you are a Psych major, you may find it to be on the lighter side. However, non-Psych majors do not struggle. Reading may seem like a lot but you can manage to skim and still get A's on the tests. 50 MC questions, 8-10 fill-in-the-blanks from vocabulary words directly in the lecture (never tests you on definitions that is in the text, not in the lecture)\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "November 04, 2009",
            "review_content": "\nShe's absolutely wonderful! This is her first semester teaching at Barnard. She's quite funny and you won't get bored in her class. Exams are straightforward. \nWorkload:\n3 exams, not cummulative\nInteresting reading!\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "November 01, 2009",
            "review_content": "\nProf McCrink is a new professor this semester but I must say so far the class has been a very pleasant experience. Lectures are not boring at all, rather they are very interesting. She covers the subject matter and has a great handle on the area. Tests were for the most part very fair and straightforward, unlike tricky annoying mc psych tests where the teacher is out to get you. She is very approachable and is a very nice person, worth getting up for the 9:10 lecture slot. \nWorkload:\nreadings from textbook for every lecture plus occasional article, she posts her slides the night before the lecture to print out. 3 tests non cumulative\n"
        }
    ]
}