{
    "prof_info": [
        {
            "prof_name": "Eva Martin",
            "prof_id": 3264,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Major Literary Works to 1800",
            "review_date": "April 17, 2008",
            "review_content": "\nProfessor Martin likes to use a lot of slides in class to educate us about the history at the time the texts were written. While these slides are interesting, we spend so much time learning the names and events of history that we hardly have any time to look at the texts we read! No wonder we are so behind in the syllabus. She seems like a genuinely nice and caring professor and she wants to constantly engage us but she does have her own strong opinions and preferences. It is also clear that she has favorites in the class... The papers are open-ended so it makes it harder since you have to pick a topic (but a topic that she is interested in). She is definetely a hard grader but tends to ease up towards the end of the semester. She is a nice professor and the subject matter is definetely interesting but if you take this class, be prepared for a lot of reading and hardwork.\nWorkload:\nHeavy. There is a lot of reading: this class is like the lit hum of French. 1 page reactions on readings due every week. 2 papers (5-6 pages). Midterm and final were fair.\n"
        },
        {
            "course_name": "Major Literary Works since 1800",
            "review_date": "June 14, 2007",
            "review_content": "\nI took this class as a major requirement. My French was rusty, and I had an absolute loathing of literature classes acquired from several very unfortunate English classes both here and in high school. Luckily, thanks to Prof. Martin, at the end of the semester my French was much improved (both oral and written), and I had a newfound respect for lit classes. \nProf. Martin tried to present all of the works in their historical context. She showed slides, and tried to show the connections between different authors and their historical periods. The class was small and usually started out as a lecture and morphed into a discussion, but she didn't have a problem turning it back into a lecture if we didn't have anything to add (for whatever reason). \nShe was very engaging, and I think everyone felt she was very fair.\nProf. Martin is very sweet and sympathetic and interested in/conscious of her students as human beings. She requested but didn't require first drafts for papers and gave lots of comments, so there was really no excuse for doing poorly. Paper topics were open-ended (which actually made it harder since there was so much choice).\nMy main critique is the syllabus, but it was coordinated with the other section (at least at the beginning of the semester), so I don't know how much individual control she had over it. We probably would have been better off reading excerpts for some writers (Balzac, for instance), instead of skipping over others entirely (like Camus).\nWorkload:\nReading workload varies from week to week depending on the texts, so anywhere from 30-500 pages a week. Weekly \"reactions\" (1 page max); 2 longer papers (4-5 pages with optional first draft); midterm and take-home final (several questions, chose 2 to answer). Syllabus was coordinated with the other section at the beginning of the semester, but by the end we were on totally different schedules.\n"
        }
    ]
}