{
    "prof_info": [
        {
            "prof_name": "Yotam Margalit",
            "prof_id": 9849,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "International and Comparative Politics Seminar: The Left-Right Divide in the Global Economy",
            "review_date": "May 09, 2012",
            "review_content": "\nAbsolutely brilliant.\nThis class was everything that I've wanted out of Columbia. Professor Margalit is incredibly engaging. His classroom is dynamic-- you will never get bored. He constantly challenges you to clarify your thinking in ways that most professors wouldn't. Furthermore, you will learn a ton.\nProfessor Margalit really cares about his students. He goes out of his way to construct a syllabus that will encourage critical thinking and allow you to gain valuable skills. That said, he can be a little cold about deadlines. Also, he is pretty unresponsive to e-mails. Nonetheless, he gives far more of a shit than almost any professor I've had at Columbia. He obviously loves to teach, and it shows in the classroom.\nThis class was really great. Everyone in the class seemed to agree that they had enjoyed the ride.\nA few random notes: If you are skeptical about taking this class because you are afraid of Yotam being a hard-line Zionist or something, leave your fears--and stereotypes-- at the door. Also, I will say this: a lot of the texts in this class do argue against conservatism; nonetheless, this may be the only political science class that assigns Hayek. Finally, this class focuses heavily American examples, so don't expect to be talking about Left and Right in Europe (or in any developing countries for that matter) very extensively.\nWorkload:\nOne midterm, one presentation, one STATA assignment (he's not strict about this one; he just wants to familiarize you with the program); one final paper on any contentious political issue.\n"
        },
        {
            "course_name": "Politics of International Economic Relations",
            "review_date": "January 30, 2012",
            "review_content": "\nMargalit was hands down one of the best professors I've ever had. He was a decent to good lecturer, and did a great job of integrating the economics and politics with current events, emphasizing the relevance of the material. The best part of the course was that his syllabus was thoughtful and interesting. The readings all connected and bounced off of each other, even though most of them were articles from wholly different sources. I learned a lot, and the material was incredibly interesting. Margalit is also incredibly helpful in office hours, and emphasizes participation both in lecture and in mandatory discussion sections. \nWorkload:\none paper, a midterm, a final, and participation\n"
        }
    ]
}