{
    "prof_info": [
        {
            "prof_name": "Tamar Lando",
            "prof_id": 13049,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Math Logic I",
            "review_date": "January 10, 2017",
            "review_content": "\nThis was an interesting class that treated logic from a mathematical perspective. In that this was a math class, I appreciated the formality and precision with which Lando presented proofs. Each proof was done rigorously and convincingly, perhaps sometimes to a fault. Overall, the class was very understandable and appropriately detailed.\nThe material itself followed the first half of Enderton exactly. We covered set theory and notation, recursive definitions and inductive proofs, sentential logic, and first order logic. Most of the results were fairly straightforward, easy to prove, but interesting insofar as their interpretation. The last few classes were used to prove completeness and compactness of a deductive system, which is a non-trivial result with a lot of interesting implications. This was certainly the most exciting part of the class.\n\nWorkload:\nWeekly problem sets were fairly straightforward though occasionally long. They were graded for completion. The midterm and take-home final were comparable to the problem sets.\n"
        },
        {
            "course_name": "Symbolic Logic",
            "review_date": "December 28, 2016",
            "review_content": "\nPretty easy class. If you stay on top of your work the material isn't difficult. Go to class, go to the recitations. Don't get complacent in the early part of the semester, it gets tough pretty suddenly. Professor Lando is good, and the slides are good prep for the exams. The exams were significantly easier than the problem sets.\nThe median for the midterm was 82, and the median for the problem sets was 80-83. \nWorkload:\nWeekly problem sets (lowest one is dropped), in class midterm and in class final.\n"
        },
        {
            "course_name": "Symbolic Logic",
            "review_date": "December 15, 2016",
            "review_content": "\nI disagree on nearly every point with the previous reviewer. Tamar is an excellent and dedicated instructor and simply expects the same from her students, if you are not passionate about the material, do not take the course. If you ask her questions about the material without having first read it, you will obviously be frustrated when you subsequently do not understand her explanations either, there are no tricks here, it will be the most logical course you have ever taken. On the other hand, abstract ideas are not going to simply be handed to you in digestible form, effort is necessary. I had the privilege of stumbling into the course and now have an immensely powerful analytic tool that I will have for the rest of my life. I encourage every one to read a little about what logic is and its centrality in philosophy and the sciences before committing to the course. \nOne complaint: Gaifman's book has very esoteric notation\nWorkload:\nHeavy, as you need to practice the concepts regularly, problem set every week (time needed may vary) Midterm, Final, the exams cover nothing that was not explained thoroughly in class. \n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "February 11, 2015",
            "review_content": "\nBy far the worst class and worst professor I have had at Columbia. Tamar Lando, while an intelligent woman, did not make the material understandable or approachable. Even from the first day, she had this holier-than-thou attitude and told the class that they'd all be bad at the subject, no matter how smart they were.\nAvoid Tamar Lando. She is a horrible professor and an unsympathetic individual.\n\nWorkload:\nTedious and unnecessary problem sets that are not well explained. Midterm and final. Avoid this class with her at all costs if possible. \n"
        }
    ]
}