{
    "prof_info": [
        {
            "prof_name": "Daniel Rabinowitz",
            "prof_id": 500,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Data Mining",
            "review_date": "April 26, 2016",
            "review_content": "\nProfessor Rabinowitz is a very nice professor. However, in class, he is extremely unorganized and he is not the best at explaining concepts. There were many times when he would try to explain a concept again only for the MA students (and handful of undergrads) to stare blankly back at him. \nFurthermore, his homeworks were very confusing. He would constantly have to update the problems because they were not clear. They were also quite challenging and required going to office hours to understand how to solve the problems (even the TAs did not understand sometimes).\nDespite these failings, though, Dan really does make an effort. He really cares about the students and holds lots of office hours to help students. During reading week, he held at least three final review sessions, each of which were a few hours long. I think that he doesn't usually teach Data Mining, hence his inexperience. However, if you seek help, Dan will go the extra mile to help you out. \nIt's not likely that Dan will teach Data Mining any time soon again, but in case he does, I suggest taking advantage of office hours, since Dan is very helpful then. Also, there is a huge overlap with Statistical Machine Learning in terms of content. \nWorkload:\nHomework - We were supposed to have like 11 assignments, but due to how unorganized the course was, we only did 5. They had a theoretical component and a programming component in SAS.\nMidterm - multiple choice, and all the possible questions were given ahead of time.\nFinal - like the midterm, but longer. \n"
        },
        {
            "course_name": "SIEO 4150 - Probability and Statistics",
            "review_date": "November 17, 2014",
            "review_content": "\nRabinowitz is a great professor. He does tend to drift a little during class, which can be frustrating, especially if you're worried about your grade. However, his exam scheme was very fair and the scores fit the curve well. \nThe best thing about his teaching is that he makes the material very interesting. He contextualizes the mathematical side of statistics with phenomena from the world, often getting a bit philosophical. \nThis isn't an easy class as in introduction to stats, so if that's what you're looking for, look elsewhere. You will, however, learn a lot if you take Rabinowitz's class.\nWorkload:\noptional p-sets and computer assignments for extra credit\n2 midterms\n1 final\n"
        },
        {
            "course_name": "W4150 Probability and Statistics",
            "review_date": "May 26, 2014",
            "review_content": "\nA rare and exceptional professor.\nI have never seen a professor work so hard and care so much for his students.  He provided every imaginable resource, including optional weekly session to learn SAS and he wrote up complete packets detailing exactly what we would need to know for each exam.  He was always quick to respond to email and in the online class discussion with a detailed answer.  I am reluctant to write here the extent to which he modified the course to accommodate the requests of students, because it would be a shame to see people taking advantage of this guy.  But I will say that everything but a short quiz and 2 exams is optional, and he does everything imaginable to make sure you get a good grade if you want it.  \nThe structure of the course treats the student with a lot of respect - you have all the resources you could want to learn as much as you like, but in terms of the grade you are only accountable for understanding the material on the exams.  The downside to this is that when you are overwhelmed with the daily nonsense of other courses (I'm looking at you Core) , it is easy let all the great and important optional stuff slide.  Even though its optional, it would behoove you to at least try the homework.  Also, a lot of the final exam preparation boiled down to figuring out what sly little algebra trick was used in a step of a proof:  This is a curious exercise, but it became a viscous time suck that had little to do with the substance of the proof, its meaning or application.   Not difficult, just tedious.  I gather it was the first time he attempted this format, so perhaps it will be less of a problem for the next batch.  \nRabinowitz doesn't merely lecture, he communicates.  In my experience here, this is unusual for a math or science professor.  As a math major, I've had many brilliant professors, but most of them simply recite the material, and make the students into passive observers taking dictation.  Rabinowitz would regularly check in with us, engage us in little experiments, make up interesting stories and examples to summon our attention in the dry spots.  Most importantly, he was always sensitive to when something might not be clear, and always ready to patiently explore different ways of trying to get the idea across.  He seemed personally devastated when he saw people uninterested or not following, and I found this inspired in me to be less apathetic and stupid. \nThe material itself is important and fascinating (I think).  The course is theory heavy, but he spent a good amount of time on examples and more practical matters.  His exams were almost entirely theory, but it is beautiful theory.  I got the impression that he was trying to drive it more towards applications in the final weeks, and might place more emphasis on applications in future iterations of the course.  I've heard nightmares about the stat department, but this course was a gem, and I'm now doing more probability theory and statistics specifically because of my experience here.  \nSo-  great guy, brilliant teacher, interesting and useful course. \nWorkload:\nDepends on you.  required for the grade:  a small quiz, midterm and final (55%), all open notes.   All multiple choice, no partial credit (at least on final).  Complete and (almost) exhaustive review material distributed before each exam.  Except for some very general and easy applied problems, the exam is taken directly from the review material, which you can mark up and bring with you.  He seemed to be always tweaking the course, so it might be different for you.  Lots of optional stuff (homework, SAS) to gain higher degrees of mastery.  \n"
        },
        {
            "course_name": "Intro to Statistics",
            "review_date": "January 10, 2008",
            "review_content": "\nRabinowitz seemed bored out of his mind teaching our class.  He put no effort into teaching it and was then frustrated that we didn't all understand everything.  His tests in no way reflect the study guides or homework materials.  There isn't much due for this class, but it is essentially self taught.  It really makes me wonder why I'm paying so much tuition.  I would strongly recommend taking this class from someone else.\n"
        },
        {
            "course_name": "4107",
            "review_date": "December 22, 2007",
            "review_content": "\nRabinowitz is an excellent professor and somewhat of an easy grader.  I felt like I should have gotten a lower grade than what he assigned me; however, I certainly put the time in.  The stuff he teaches is hard to grasp and I think he assumes we know more than we really do with regards to linear algebra.  I struggled, learned a lot, and feel like I should know more.\nSome of the concepts he goes into aren't really mentioned in the book.  There's somewhat of a disconnect from what he says in class and what he assigns in the book.  What he assigns for homework is considerably easier to digest than what he goes over in class and can possibly assign on the exams.  Don't get too panicked when he talks about stuff you don't get in class.  The best way to deal with his class is to read and re-read the material in the book before you show up to class.  Then it makes some sense, but he still can go off on tangents that are very difficult to follow unless you have some serious background in math.\n\nWorkload:\nReasonable, but not representative of difficulty of exam content\n"
        },
        {
            "course_name": "4107",
            "review_date": "December 22, 2007",
            "review_content": "\nRabinowitz is an excellent professor and somewhat of an easy grader.  I felt like I should have gotten a lower grade than what he assigned me; however, I certainly put the time in.  The stuff he teaches is hard to grasp and I think he assumes we know more than we really do with regards to linear algebra.  I struggled, learned a lot, and feel like I should know more.\nSome of the concepts he goes into aren't really mentioned in the book.  There's somewhat of a disconnect from what he says in class and what he assigns in the book.  What he assigns for homework is considerably easier to digest than what he goes over in class and can possibly assign on the exams.  Don't get too panicked when he talks about stuff you don't get in class.  The best way to deal with his class is to read and re-read the material in the book before you show up to class.  Then it makes some sense, but he still can go off on tangents that are very difficult to follow unless you have some serious background in math.\n\nWorkload:\nReasonable, but not representative of difficulty of exam content\n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "May 14, 2006",
            "review_content": "\nThere is a reason that Prof. Dan Rabinowitz is the chair of the Stats department.  He is amazing!  He's great at explaining complex theories, using everyday common analogies to convey his points.  However, the material is hard!  He assigns homework to help you with the theories, but the great thing is that poor homework (or no homework at all) does not affect your grade.  BUT I URGE YOU TO DO THE HOMEWORK OR YOU WILL BE LOST!\nWorkload:\n1 problem set every few weeks, quiz, midterm, final\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "April 25, 2006",
            "review_content": "\nProfessor Rabinowitz clearly understands what he is talking about.  But unfortunately, that doesn't mean you will.  He's a very, very nice guy, but his being nice (a) does not mean he can teach, and (b) does not justify one's taking his course. In fact, I would advise avoiding his Stat Inference course at all costs.  The thing about Dan is that, unlike any normal stat/math professor, he seems to believe in the power of abstract explanations wholly divorced from concrete examples - which is really quite useful in an APPLIED field. This is the first and only class that has made me ashamed to be a student at Columbia.  Save yourself a few credits and read http://www-stat.wharton.upenn.edu/~dsmall/stat512-s05/ .\n\nWorkload:\nHard problem sets, annoying midterms, HARD final - I ended up with a B in the course and probably lost knowledge of Stats in the process.\n"
        },
        {
            "course_name": "Applied Linear Regression Models",
            "review_date": "December 06, 2005",
            "review_content": "\nI couldn't have been more pleasantly surprised by this course and this professor.  I was taking this class pass/fail, and so did not consistently turn in my homework, but nonetheless did extremely well on the exams.  Seriously, I would want to take any class with this man.  He has so much heart, and is engaging, and really explains concepts very clearly to non-statistics majors/students like myself.  He also spends an extraordinary amount of time personally addressing student's questions via emails, office hours, etc and is highly involved with the class.  He prepares you for the exams with practice exams that he goes over in detail, so that you will know how to answer every question on the exam.  I highly recommend this professor and this course.\nWorkload:\nproblem sets were supposed to be due once a week, but he needed to slow down the pace of the class for the students, and so assignments were further apart and very manageable\n"
        },
        {
            "course_name": "W4109",
            "review_date": "January 27, 2004",
            "review_content": "\nI second the previous positive reviews about D. Rabinowitz. If you had to choose between 2 or more sections of the same course, pick Rabinowitz.   American/English-speaker, good at explaining concepts and generous with his time for additional office hours.  He also has the 2 TAs schedule additional and evening Office hours.  Must do all Homeworks or you'll get lost in the theory.   \nWorkload:\nHomework due each class day/twice per week\n"
        },
        {
            "course_name": "Probability and Statistical Inference",
            "review_date": "January 11, 2004",
            "review_content": "\nGreat teacher! He explains everything well in fluent English (a plus for any statistics course), and he cares.  He is readily available for any extra help you might need.  However, there is homework due every class.  They don't count for much, but if you do bad on the exams they will help you.  The class is 6 points so you already know that you have to commit extra time to it.  Don't expect a curve because the grad students do ruin it by getting perfect scores.  The class is 3 hours long, but he usually lets you out around 8.\nWorkload:\nHomework due every class (twice a week), One midterm (probability), One final (inference)\n"
        },
        {
            "course_name": "Probability and Statistical Inference",
            "review_date": "December 31, 1999",
            "review_content": "\nA difficult 6 point class for the unprepared and unmotivated. If you don't do the homeworks, you will ultimately fail the class. And homework is due each class session. Professor Rabinowitz speaks fluent English, a treat for any Statistics major. However, be aware that the material covered is extremely difficult, and the textbook is not easy to read. Also, the grad students will ruin the curve with perfect scores. The professor is quite reasonable and paces the class accordingly. Prior to each exam, the professor will hold a two hour review session covering the material from the practice exam. If you can do the practice exam, the exam is a piece of cake. The exams are all open book & open note and allow a calculator. If you work hard to the end, you will have earned that A.\nWorkload:\nabout 20 homeworks - 5 to 10 problems each. 1 quiz. 2 midterms. 2 finals.\n"
        }
    ]
}