{
    "prof_info": [
        {
            "prof_name": "Mario Diaz de Leon",
            "prof_id": 9394,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 16, 2013",
            "review_content": "\nHe's perfect! Keep this section if you get into it. Everything you want in a Music Hum professor and class, you'll get from this one. The music is incredible, and the fact that Mario is so passionate about it only extends your own appreciation. I believe we covered the same pieces as most MH classes (from talking to people in other sections) but we had a textbook with listening guides and readings. Overall, an enjoyable experience. \nWorkload:\nConcert report of your own choice, plus papers for midterm and final. There were also around five short responses due in class and three quizzes (mentioned on courseworks). The final also had a listening section. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 16, 2011",
            "review_content": "\nMario is super chill and his class is too. While this certainly was not the most challenging of classes, I still learned alot and feel ready to participate in those cocktail party discussions about music that the Core prepares us for.  He loves when you participate in class but that isn't even really necessary, do some but not all of the readings and write passionate reports/responses and you should be fine.  It was a 9 am class that I never missed because I knew I could get out of bed and relax in class, listen to some great music, and gain a few insights at the same time. A painless, interesting class.\n\nWorkload:\nPretty easy. 2 concert reports (it probably will take you longer to attend the concert than to write the 4 page report), 1 quiz (easy), 1 midterm (taken right off the review sheet), final was 4-6 page take home essay and in class listening ID section (he gave us the options for IDs before hand).  Make sure to check Courseworks carefully because once in a while he'll ask for a half page/full page response to the night's assignment - easy to write but don't miss them because they count for your grade.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 14, 2010",
            "review_content": "\nTake his Music Hum section! It is exactly what you want out of a required course - interesting, slightly challenging and fun without a heavy work load.\nEven if you have little to no interest in music and music history, you will come away from this class with an appreciation of a wide variety of music and a general sense of historical relevance.\nI had a 9AM course and never missed a class because there was always something to gain from coming to class - either enjoying 10 minutes of listening to music or hearing interesting references and facts about a composer or historical era. \nMario is incredibly chill and disarmingly knowledgeable about every section he presents. He gives a really comprehensive review/study sheet that prepares you extremely well for the exams - stick to the review sheet and you won't waste time studying from the textbook (which is a little less organized than his instruction but worth purchasing/borrowing). Definitely try to find his section once you register and you will be humming a happy tune because of it!\n\nWorkload:\nLight and easily manageable. He grades the papers himself and is pretty fair.\nPapers: \n-1 review paper on a performance you attended (3-4 pages)\n-Attended a performance of his choosing  with the class (generally something you would want to say you had been to at least once, like an opera or a symphony) - performance review with more detail, using terminology learned in the class (3-4 pages)\nExams:\nAwesome study guidelines\n-1 midterm (listening IDs and short free-response)\n-1 final (listening IDs and short free-response, focus only on the second half of the course)\nModerate Participation - will boost your final grade a lot. He really cares if you are involved and seem interested. It works to your advantage!\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 18, 2009",
            "review_content": "\nMario is both a decent MusicHum instructor and a cool guy--stick with him if you get him. While sticking closely to the core syllabus, he focuses on each student's subjective experience of music and working to hone your listening abilities. Classes consist of brief lectures on the current topic and open discussion on pieces you listen to in class.\nBy the end of the semester you won't necessarily have a knowledge of the history of music that exceeds the over-simplified MusicHum syllabus, but you'll be able to listen to and analyze music more closely. \nHe's also very, very easy on grading if you show you're open-minded and have put effort into the assignment. He's totally understanding about workload and will give extensions if you need them. \nWorkload:\nPretty easy. About two short chapters of textbook reading a week, plus out-of-class listening pieces. Two concert reports, a few short papers throughout the semester. Midterm and final exam that were complete jokes (multiple choice and fill in the blank). \n"
        }
    ]
}