{
    "prof_info": [
        {
            "prof_name": "John Hunt",
            "prof_id": 4013,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 16, 2020",
            "review_content": "\nSWITCH OUT OF THIS SECTION. I doubt John will be asked back to teach this class in the future, given that our whole class destroyed him in the course eval process, but if he is SWITCH OUT.\nWhere to even begin? John is incredibly disorganized. We never once did the activity we were supposed to do during our discussion section. We spent around 1 hour each class just listening to him monologue about whatever was on his mind. His life. His musings on education. His dislike of Frontiers of Science. Literally anything except for science. I am writing this review in class right now because I know beyond a shadow of a doubt that if I don't pay attention I won't miss anything. Once I took a full-on nap in the middle of class, woke up, and nothing had happened (Fall 2020 online semester).\nThe second half of our classes were marginally more science-based, but never in a productive way. John is clearly a genius, but struggles to dumb down advanced concepts to a first-year level. He mostly teaches grad students, and doesn't seem to grasp that a lot of us need help just learning how to read graphs. We're not ready to spend a full 30 minutes deriving the gamma factor. He would often bring in his graduate-level slides and substitute the regular FroSci slides for his own, which just confused us to no end. We never got a chance to do some of the basic activities and reinforcing exercises that would have helped us on the exams.\nAlso, John took forever to get work back to us. It's the last day of class, and we still haven't gotten back some of the work we did in September. This meant that while everyone in other sections got detailed feedback on their problem sets in the run-up to the midterm, we didn't get a single problem set returned until like 48 hours before. Every other class also had access to the answer keys, but John didn't know he could give that to us until someone told him a few days before the midterm.\nTo his credit, John is a lovely person. He clearly cares about his students and wants them to do well. But that care is so misplaced. He is also super responsive to email which is nice. But that is nowhere near enough to make up for everything else.\nWorkload:\nSame as any other FroSci section except John grades problem sets for a number grade, not for completion, unlike other sections. He's very generous with the grades, though.\n"
        },
        {
            "course_name": "Theoretical Foundations and Applications of Biophysical Methods",
            "review_date": "May 24, 2016",
            "review_content": "\nThis is the most difficult course I've ever taken regarding content, but that is clearly understood in the grading process. If you are engaged and interested in class you will do well. John Hunt is possibly the most intelligent person I have met, but he is still approachable and willing to absolutely everything to help his students understand. However, these qualities seemed to cause some time-management issues and the class fell behind. Because the course is relatively new and the material comes easily to him, he occasionally spent too much time on easier topics and was forced to rush through the more difficult ones. He has made screencasts for most of the material now. If future students actually allow him to use the flipped format I don't think this will be a problem, but speaking out in this class is particularly intimidating. He will likely still get behind because he has a lot of responsibilities and he takes all of them seriously. \nSo take the class if you want to be challenged to think deeply about a cool topic from a brilliant, understanding, approachable professor. Don't take it if you're stressed out by last minute schedule changes.\nWorkload:\nTwo problem sets, two midterms, and a take-home final. Problem sets were graded but not factored in to course grade.\n"
        }
    ]
}