{
    "prof_info": [
        {
            "prof_name": "Andrew Manson",
            "prof_id": 1440,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 21, 2004",
            "review_content": "\nDefinitely one of the best Art Hum teachers.  I registered for and then dropped two sections before lucking out on Andrew.  Very good lecturer, extremely nice, loves the subject matter, organized, clear, doesn't expect you to know everything about art (or indulge too much all of those people who like to spend five minutes generously sharing with the class how a painting makes them feel).  If you can get him, take him.  I went into Art Hum wary because of the many bad experiences people have with it, but I ended up loving the class, remembering what I learned, and really feeling that it was a valuable experiences.  In fact, if it hadn't been required I would have taken his class anyway in a heartbeat.  I have to say, for a core class that's pretty extraordinary.\nWorkload:\n3 museum-visit papers, couple field trips, in class midterm and final.  The standard need to memorize, but he's great about making it very clear WHAT you need to memorize and putting photos of all the works up online.  A very fair grader.  Standard list of art hum readings.  You need to be familiar with them, but if you haven't actually read them in depth it won't matter much.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 22, 2003",
            "review_content": "\nA great teacher, very approachable, sincere and sounds interested in the subject and in teaching. He is big on analyzing art so pay attention to the discussion and his lecture, even though he says the readings are important, they arent as far as the mid term and finals are concerened. Really makes one think about art.\nWorkload:\nWorkload. Three short, and one medium paper (a few of the other art hum section teacher give a little less). Fair grader. Weekly reading - average.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 17, 2003",
            "review_content": "\nI did not have very high expectations on this class. Yet, I ended up really loving it and left with a whole new appreciation for art. It is obviously hard to be in-depth when spanning art from the Parthenon to Frank Lloyd Wright in a single semester. \nBut Andrew Manson does a brilliant job of it. He is sweet and knowledgeable which makes for a great environment in class. \nHis discreet charm is not apparent until after a couple of classes, so for god-sakes stay in his section whatever your first impression may be. His class made for a truly great Art hum experience. \nWorkload:\nFair grader, the workload is on the light side.Four shortish papers, and one mini-paper, all accompanied by sketches. If you pay attention in class and keep up with the papers the exams don't hold any major surprises. Be more concerned about taking notes and in-class discussion than the reading, (which may seem somewhat unrelated at times but provides useful background knowledge for the exams).\nFair grader, the workload is on the light side.Four shortish papers, and one mini-paper, all accompanied by sketches. If you pay attention in class and keep up with the papers the exams don't hold any major surprises. Be more concerned about taking notes and in-class discussion than the reading, (which may seem somewhat unrelated at times but provides useful background knowledge for the exams).\nFair grader, the workload is on the light side.Four shortish papers, and one mini-paper, all accompanied by sketches. If you pay attention in class and keep up with the papers the exams don't hold any major surprises. Be more concerned about taking notes and in-class discussion than the reading, (which may seem somewhat unrelated at times but provides useful background knowledge for the exams).\nFair grader, the workload is on the light side.Four shortish papers, and one mini-paper, all accompanied by sketches. If you pay attention in class and keep up with the papers the exams don't hold any major surprises. Be more concerned about taking notes and in-class discussion than the reading, (which may seem somewhat unrelated at times but provides useful background knowledge for the exams).Fair grader, the workload is on the light side. Four shortish papers and one mini-paper, all accompanied by sketches. If you pay attention in class and keep up with the papers the exams shouldn't hold any major surprises. Be more concerned about taking notes and in-class discussons than about the reading (which may seem unrelated at times, but provides useful background knowledge for the exams). \n\n"
        }
    ]
}