{
    "prof_info": [
        {
            "prof_name": "John Glendinning",
            "prof_id": 953,
            "total_reviews": 22
        }
    ],
    "reviews": [
        {
            "course_name": "Animal Physiology",
            "review_date": "April 08, 2014",
            "review_content": "\nAnimal physiology was by FAR the best class i have ever taken at Barnard/columbia. Professor Glendinning is very clear when explaining the material, is super open for questions and is always willing to meet with you if you have questions about the course material. He provides you with slides that you take notes on and his tests come  from those slides. When studying for the test, if you know EVERYTHING in his slides, you will do very well on the tests. His exams are very manageable and tho it is challenging it is definitely not impossible to do well in his class. You are also given a couple of problem sets over the course of the semester that summarize class material. I'd suggest starting them a week before they are due because they may take a long time but you can work in groups which makes it a fun experience. You also have a 5 minute disease presentation that you do as a group on a specific disease of your choosing. He grades easily on those. If you have time in your schedule I 100% recommend you taking this class! if you love physiology you will definitely love this class. I'm sad that I'm almost done if I could I would take this class again. You learn a ton and it is definetely a rewarding experience. \nWorkload:\n2 midterms and a noncumulative final. 3 problem sets and a 5 minute presentation\n"
        },
        {
            "course_name": "Introduction to Organismal/Evolutionary Biology",
            "review_date": "December 22, 2013",
            "review_content": "\nJohn is a very enthusiastic lecturer and wants his students to do their best. That being said, if you have taken AP Bio in high school this course will be painfully easy. Although I often tried to get myself out of bed for the 9 am lectures, I found as the semester went on that it really did not add anything to my learning and stopped attending. He very rarely adds on any extra information to the powerpoint slides that he puts online. If you have even a slight grasp of bio you will do well in the class, as long as you look at the lecture powerpoints and the parts of the textbook he mentions before the exam.\nMuch of the questions on the exams are less about application of concepts and more memorization of random facts, which is a little annoying, but again, the examples can all be found in the powerpoint slides.\nAlso there is a curve set by the students in the class, which is quite generous.\n\nWorkload:\nWeekly online assignments (no more than 30 min each)\n(Optional) Chapter Reading \n2 midterms (50 multiple choice questions)\n1 final (non-cumulative, 60 multiple choice questions)\n"
        },
        {
            "course_name": "Introduction to Organismal/Evolutionary Biology",
            "review_date": "December 20, 2013",
            "review_content": "\nOverall, I would say that he was a pretty good professor. He made himself available through help sessions and office hours and made an effort to be as clear as possible which was met with varying levels of success. I found it funny when he would apologize for tricky concepts saying that he didn't make this stuff up. My biggest peeve was that he tended to read from the slides though he got better as the semester went on. The exams are all multiple choice. The first exam included material from the book, but then he changed it so that the 2nd exam and the final were based on lectures only with textbook information limited to the boxes with additional information about research and applications of the material into the real world. The final ended up being non-cumulative which was a godsend, just 60 multiple choice. He emailed us the same evening with our grades which I liked. I found the course to be relatively low maintenance. You pretty much need to keep up with the Aplia online quizzes (one for each lecture/topic that is due about 4 days after it is taught) and study for exams. That being said however, this course definitely teaches you a lot about memorization so be prepared for that. \nWorkload:\nMid-term 1- 28%, Mid-term 2- 28%, Final Exam- 34%, Aplia- 10%\n"
        },
        {
            "course_name": "Intro Lab to Organismal and Evolutionary Biology",
            "review_date": "February 19, 2012",
            "review_content": "\nExtremely nice and helpful during his office hours. He was always patients and willing to answer any type of question (that is not a given for all professors).\nHe is a clear lecturer and provided slides which allowed us to spend most of the class paying attention to what he had to say and not worrying about writing everything down. \nHe summarized the textbook information in a clear concise manner and really stressed the important part of the chapters. (In terms of the tests he does ask questions about the reading but not too many that are super random and obscure)\nOverall, he is a very kind person and a clear teacher. The class is challenging and requires a lot of work but it is fair. \n(He only taught the class for half of the semester and then switched with Professor Callahan) \nWorkload:\nRead the textbook because it does reinforce what you learn and there are some questions which are just based on the readings.\n2 midterms (difficult but there was a great curve)\n1 final \nOnline quizzes which are only graded based on participation!! \n"
        },
        {
            "course_name": "Intro Lab to Organismal and Evolutionary Biology",
            "review_date": "January 09, 2012",
            "review_content": "\nI had Glendinning for Biology 1500 and as a person who is honestly enthusiastic about Biology, I found Glenddining's \"assistance\" to be quite futile in my academic ventures. Sure, I showed up to 80% of his lectures and payed attention 55% of the time. But to tell you the truth my lack of attention went unpenalized because everything he says is from the textbook. He will stand there with his powerpoint slides and talk about the textbook diagrams and information. The textbook does a great job of explaining itself so Glendinning is just a cute talking head. I honestly enjoyed reading the book! Very informative and thorough. I never had a need to go to his office hours and I never spoke to him personally, but he SEEMS approachable. I mean, lots of people talked to him after class all the time. \nBOTTOM LINE: Read the text book! (a must). He will say that only 20% of the material on the test is on the text, but since he says exactly whats on it, this is hardly a tip. \nPS: If any pre-meds are scared of this class and thinking about taking Bio 1001 in order to prepare for this class, DO NOT BOTHER. You will be fine as long as you keep up with the material, trust me. NO need to waste your time. \nPS2: I don't have anything against the guy. But he's obviously more into his research than teaching. \nWorkload:\n2 midterms. (1st easy. 2nd tricky)\n1 FINAL (difficult!) Lots of curveballs on this one\nCurves are generous. Got 50% on a midterm and curved up to a B\n\n"
        },
        {
            "course_name": "Animal Physiology",
            "review_date": "April 15, 2011",
            "review_content": "\ni completely completely, vehemently disagree with the past reviews for this professor. While Prof. Glendinning was challenging, his class was extremely rewarding. He is extremely intelligent, extremely helpful when you go to talk to him, and the exam questions are difficult but isn't that what exams are supposed to be? Just because the exam questions require you to think does not mean that they are unfair. His exams were challenging as was the class, but I came out far more knowledgeable on the subject at hand than before, largely due to his help. \nWorkload was difficult but manageable, and his lectures were often interesting and engaging. I disagree about the lectures being boring and straightforward, and am actually surprised to read them as most of the students I talked to were very happy with him as professor. I came back to write this after seeing the terrible reviews, and came to let people know that he is not nearly as bad as they write, and is in fact, extremely extremely good. He is one of the nicest and most knowledgeable professors I have had at columbia, and I strongly recommend him as a professor \nWorkload:\n6 Group Problem Sets, 3 Exams (non-cumulative), textbook reading,  Group Research Article Reviews\n"
        },
        {
            "course_name": "Animal Physiology",
            "review_date": "January 07, 2011",
            "review_content": "\nGlendinning is an awful grader and gives almost no partial credit, so you can fully expect to master the material better than him and still end up with a B+. If you attend office hours and regularly suck up to him you might have a better shot. Some of the material was useful, but the learning usually occurs through the book on your own, and he is often more of a hindrance than a help. Avoid this class if you can. \nWorkload:\nBi-weekly problem sets, sometimes short answer and sometimes multiple choice but almost always ripped from the internet so you can often google your questions. A chapter of textbook reading per lecture. Occasional readings of scientific articles with questions. Two midterms and a non-cumulative final.\n"
        },
        {
            "course_name": "Animal Physiology",
            "review_date": "December 20, 2010",
            "review_content": "\nProf Glendinning is the worst professor I've ever had. He never explains things clearly and instead of trying to explain he just says \"you've got to wrap your head around it.\" His grading is completely unfair, he gives people with the same answers different amount of points. He also gave zero credit for an answer that is what it says in the textbook, that he chose, and made up his own answer.  When you go talk to him about your exam, he won't change your grade even if you show him where the answer in the textbook was.  He cannot take criticism and will basically ignore your comment in class if it has anything to do with how he might be wrong. DO NOT TAKE THIS CLASS UNLESS GLENDINNING IS NOT TEACHING IT, YOU WILL REGRET IT.  Everyone told me not to take this class and I wish i had listened to them so please take my advice and do not take this class. It will drag down your GPA for no reason. \nWorkload:\n6 Group Problem Sets, 3 Group Research Article Reviews, 3 Exams (non-cumulative), textbook reading supposedly optional, but do it\n"
        },
        {
            "course_name": "Animal Physiology",
            "review_date": "January 19, 2010",
            "review_content": "\nBEWARE exam questions could not be less straightforward- he seems like he's purposely writing convoluted questions to trick students. Most students leave exams confused on what was asked and end up (almost always) getting the question wrong- so ASK. He even encourages students to ask, and it seems that by asking it shows effort and you'll probably get a higher grade. Get to know him, ask questions, and you're guaranteed an A/A- (as long as you study). If you don't (and still study A TON) you will probably still end up with a B/B+. Takes some time to get used to his teaching style/exams but you'll get the hang of it. \nCourse material is interesting and he adds many slides in which the information is not in the book so GO TO CLASS. \nWorkload:\n3 exams NON CUMULATIVE group problem sets\n"
        },
        {
            "course_name": "Animal Physiology",
            "review_date": "April 20, 2006",
            "review_content": "\nI found Professor Glendinning to be an interesting and knowledgable lecturer.  Taking a bio sequence before this class did help with  understanding of the material.  I really disagree with the other reviews written for this professor.  I found his lectures interesting.  In order to to well on his exams you have to come to class and you have to really know his powerpoint slides, sometimes he does throw in a minute detail that was in small font on one of his slides, but besides that, his exams were totally reasonable.  Perhaps he's changed his style since the last reviews were written, but I found these reviews offbase. \nWorkload:\nPretty light.  Problem sets (you can work together) and a final presentation.  Three exams and the last one is not cumulative.\n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "January 07, 2005",
            "review_content": "\nAWFUL, AWFUL, AWFUL!!! That is the only way that I can describe this professor.  John Glendinning was unhelpful in every way--from not answering questions, to giving exams that were not based on the material covered in class...This class requires the ability \"to get inside his head,\" as another reviewer wrote. In my opinion he is unbelieveably arrogant, and NEVER WRONG--even when he is.  AVOID THIS CLASS LIKE THE PLAGUE!\n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "January 07, 2005",
            "review_content": "\nWorst professor I've had during my 3 years here.  He thinks he's so smart, but he really knows nothing besides what he's put on his slides and reads off of during class.  Don't take this class if you don't need to.  The class looks like its easy, but since the tests are completely unpredictable and not based on the material you really have no idea what to expect.  I wish there was a way to have this man stop teaching.  It really is a crime.  A waste of my time and money.  I really can't explain how much I really hate this guy.  HORRIBLE CLASS. STAY AWAY.  \nWorkload:\n2 midterm, one non-cumulative \"final, 3 group problem sets, 3/4 article summaries, 1 final group project. \n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "December 28, 2004",
            "review_content": "\nIf you are not a Neuroscience and Behavior Major with a \"Behavior\" concentration, do NOT under any circumstances take this class!  While the title may sound innocuous, and Prof. Glendinning may come off as a nice sweet man at first, don't be fooled.  He is incompetent, arrogant, and gives exams that are ambiguous and not based on the material presented in his boring powerpoint slides.  Clearly the man is teaching in order to get the funds necessary to further his research.  He has no concept of how to answer a question...(note: his answer to a simple \"yes\" or \"no\" question may take 20 minutes, and it still won't be answered).  He will never admit that he made a mistake and speaks in circles, completely wasting your time.  Like another reviewer said, the subject matter is interesting, and I found the textbook to be very informative.  Unfortunately, we never use the text...This was such a frustrating class because the material is not inherently difficult, but Prof. Glendinning's exams are not based on the material, and he will always have a reason for why you are wrong and he is right--even when your answers match the answer key's, as did mine.... I will never take another class with this teacher (I use the term loosely), and I strongly advise all neuroscience majors to do the cellular concentration to avoid living in Glendinning's hell-world for a semester.  The man is a disgrace of a professor!  Good luck to any of you that must take it.\nWorkload:\n2 midterms and 1 final...the material is not from the text nor from his lectures...good luck.  There is also a group research project (pain in the ass!) and group synopses and problem sets due.\n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "December 22, 2004",
            "review_content": "\nWhile the material of this course could sometimes be interesting, Glendinning's dry power point lectures only sapped all the life out of this class. He simply reads from his slides and although having most of the information already on the slides is helpful when studying for the tests, it makes for very boring lectures. Glendinning is unknowledgeable and unable to admit when he does not know the answer to a question, which hapens often. He will simply talk in circles until the student gives up asking. He comes off as nice for the first few classes, but his arrogance is soon apparent. Do not take this course unless you must.\nWorkload:\n3 article synopses (handed in as groups so you not only get the grade for your synopses, but also for everyone else's in the group- even though it is independent work), 1 12-15 page group paper (again, group work that serves no function), 1 group presentation, 2 midterms, final. The exams can be random and for the midterms, time is very tight.\n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "December 19, 2004",
            "review_content": "\nThis is the worst professor I have had so far at this school.  While he seems to be a kind, mild-mannered man, he is a miserable teacher and seems to be uninterested in helping students learn if they don't think exactly like him.  He's often just flat out wrong and will never, ever admit it.  It really was annoying when the whole class agreed that his answer to one of our test questions was obviously incorrect (the material isn't difficult) and he basically told us all that we were just missing the point because how could he be incorrect?  In my opinion, hr is an arrogant man, who is not even very smart; I wonder how he was even hired in the first place.  The book is very interesting and I have a greater respect for animals now, however, I recommend that you buy the book and read it on your own rather than take the class.  I refuse to ever take another class with this man. \nWorkload:\npretty light, about a chapter of quick reading each week, 2 problem sets, a final group research paper with presentation, 3 article summaries, 2 midterms worth 25% each, a final (noncumulative) for 27%.\n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "November 11, 2004",
            "review_content": "\nJohn Glendinning has debilatating issues.  His exams are totally ambiguous.  You'll do well as long as you can read his mind.  Any misinterpretation of exam questions basically ends in the student being inarguably wrong and stupid for not thinking in Glendinnian twilight zone.\nI honestly don't know how he even got a job teaching.  He is probably the worst professor I have had in my years at Columbia (next to Prof. Fine - Chemistry).  Why he has not been fired encourages me to suspect a family donation of a ridiculous amount of cash.  He certainly was not hired for his communicative skills nor his ability to consider view points other than his own.\nWorkload:\nEntirely too much.  This course should be a 5 point class with the work load that John has assigned.  What in gods green earth is he trying to prove?  Apparently it gives him pleasure to overburden students because it is absolutely imperative that someone recognize John's grandeur and genius by wasting time on assignments that will receive credit only if recited verbatim.\n"
        },
        {
            "course_name": "Animal Physiology",
            "review_date": "June 20, 2004",
            "review_content": "\nProf. Glendinning is a JOKE! He is the most arrogant, insensitive professor I have ever met at Barnard. His exams do NOT reflect what he teaches in class and he expects you to extrapolate on the exams on dumb questions that have little to do with the material and everything to do with the words that come out of his mouth. He almost never admits that he is wrong (when its so obvious) and he is quick to make judgements about your abilities after the first exam. Although you may need this class if you are premed, PLEASE BEWARE!! You will have an awful time listening to his boring lectures, his much too often dramatic pauses to find the answers he doesn't know anyway, and his killer exams with an almost non existent curve. If you dont have too, dont take it with him. Go (or stay) on the other side of the street.\nWorkload:\nProblem sets every other week (including one due the week before the MCAT), power point presentations which you almost always have to memorize to do well, and a research paper at the end which comes right before finals. 2 midterms and a very unfair final.\n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "February 03, 2004",
            "review_content": "\nWhile he is a generally nice guy, Glendinning really doesn't know his stuff.  Anything that is not directly regurgitated from the textbook (as are 90% of his lectures, which are all powerpoint based) could be blatantly wrong.  I caught rather blaring mistakes a couple of times and who knows how many he really made in class.  Occasionally he caught himself and corrected mistakes, or at least stood at the board and tried to figure things out for 10 minutes (wasting everyone's time), but often they went unmentioned/unnoticed.  While easily accessible outside of class, it's often clear that he either doesn't understand or doesn't know the answer to questions and talks in circles with his answers.  It's a shame there isn't a better professor to teach this class, because the subject material really is fascinating. \nWorkload:\nGroup problem sets, two midterms, a final, and a 15 page paper/presentation that comes at precisely the wrong time of the year (right before finals)\n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "May 12, 2003",
            "review_content": "\nProfessor Glendinning is a nice person, but his lectures can often be quite dull. He has all of his lectures on powerpoint, which makes it nice in the sense that you can access them online if you miss a day. However, don't be fooled into thinking that you no longer have to take notes, because most of the questions on his exams that are relevant to the class (which are not many) come straight from the lecture. The book is basically pointless, and other than giving the class a slight structure, is not helpful for the exams. By the end of the semester, I was mainly focusing on the notes. The exams are tough because they are not based on anything you've learned, so there is almost no point to studying for them. I myself did not study much for them but I was able to do well, because it has to do more so with your ability to apply concepts to new experiments or problems he puts on the exam rather than your understanding of specific things from the lecture or books. He is anal about grading (not a lot of partial credit), however, the class is not tough, and I recommend it for the interesting subject matter. However, the group project is really annoying and it's tough to schedule meeting times with other people, as is the end of the semester research project that comes at the worst possible time (close to finals). \nWorkload:\nTwo midterms and a final exam. Three problem sets that must be completed in a group (ugh...) as well as a final research project that is also done in a group (:-\\ ). Overall, not too difficult. \n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "January 19, 2003",
            "review_content": "\nWhile he is a nice professor whose powerpoint lectures are organized and concise, his tests ask you to connect ideas in novel ways that were not discussed in class.  He is extremely anal with his grading and hardly gives partial credit.  He is often unresponsive and unhelpful with questions, and does not seem to be very knowledgeable in the subject. He also at times contradicts himself.  While the material covered is very interesting, the professor is not a very good one.  I would not recommend him.\nWorkload:\nTwo midterms and a final, three problem sets, and a research project.\n"
        },
        {
            "course_name": "Animal Behavior",
            "review_date": "November 10, 2002",
            "review_content": "\nThe professor has all Powerpoint lectures and makes them available online. I was actually fascinated by most of the material and came away with a lot of new found respect for animals and the ways they cope with their environments and each other. The lectures in class highlight the important parts of the textbook (which I thought was very readable and had some interesting pictures) and the professor is relatively organized, clear and straightforward. It is a higher level bio course, but not intimidating and definitely something I would recommend. \nWorkload:\nThree group problem sets, two midterm exams (each with an in class and out class portion), final exam, and a final group presentation. The exams are straightforward for the most part but not so much that its feels dumbed down. Sometimes he asks questions that are details but for the most part, he is concerned with your understanding of the concepts as opposed to the specificities of the experiments discussed in class.\n"
        },
        {
            "course_name": "Animal Physiology",
            "review_date": "January 28, 2002",
            "review_content": "\nHis lectures are terribly monotonous, and his PowerPoint presentation comes straight from the textbook. He likes to present a lot of material, and then require you to synthesize and think beyond what he has taught, for the final; i.e. the material on the test does NOT reflect the material he teaches in class. BEWARE.\nWorkload:\ntwo midterms, a final, class project and written essay done in a group\n"
        }
    ]
}