{
    "prof_info": [
        {
            "prof_name": "Coilin Parsons",
            "prof_id": 1423,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 13, 2009",
            "review_content": "\nCoilin Parsons is a good guy. yes, you will definitely not get an A in this class and will have to settle for a B or B+, but he really does try to push you. his strict grading aside, he's an excellent professor, and he's shown me on many occasions how great and fascinating literature can really be, which is exactly what I want from a professor. he knows a lot and is very intelligent, has a lot of authority, a good sense of humor, and leads the class well. his tough grading aside, he's fantastic, and I definitely recommend him.\nWorkload:\nMedium. he will probably make you write the minimum number of pages on your papers because he really wants you to keep it concise. He added Ibsen's A Doll's House, which was pleasant and short. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 31, 2009",
            "review_content": "\nOk everybody...I am doing this to save many of you hours and hours of asking yourselves why you are not getting a better grade on your papers and exams, especially when you put so much time into each one of them.  I swear to you all, I am not stupid, truthfully, I am fairly intelligent, and I justify this by the fact that my grades in every other class at this school were good.  Coilin Parsons made me feel like an idiot.\nDO NOT TAKE THIS CLASS.  The previous reviews (notice they are all like 3 years ago) will tell you that he is a brilliant, intelligent teacher who's class will be \"the highlight of your time here at Columbia.\"  Let me just say, if his class is actually the highlight of your time, then Columbia must really have sucked for you.\nHe is intelligent, I will not dispute that.  However, isn't your Lit Hum professor supposed to be smart - I mean, he is teaching at an Ivy League school.  But, if you get over the fact that he has a brain, you might discover that the discussions in class are based only on his close-minded perceptions.  If you say something that he disagrees with, you will not do well.  Furthermore, he disagrees with practically everything you say.  Put 2 and 2 together, and YOU WILL NOT DO WELL.  \nEven the most brilliant liberal-arts based thinkers couldn't pull anything above an A-.  I believe 1 or 2 people got \"A\"s.  Ask yourself, at a school that supposedly is based on grade inflation, do you think that is grade inflation?  No!, and if you think, \"well, that is good because he is the only teacher that grades fairly\" then go to Princeton where there is grade deflation.  \nOk.  I wasn't going to write this review, but I had to when I realized what a Lit Hum class is supposed to be like. (shockingly, I switched sections).  My new Lit Hum teacher is outstanding.  And guess what...anyone else who teaches this class will be outstanding after you had Coilin.\nThere is only one reason to switch into his class, and that is if you are a girl, and think scruffy-faced Irish men are handsome.  He is.\n-Dont take this class.  Actually, do...just to get at me and prove me wrong.  You are only hurting yourself.\nWorkload:\nWell, lets see, Lit Hum is a lot of reading already...how would you like for an extra book to be added to the syllabus?  Yep, he does that...seriously.  Also, 3 essays, a midterm and final.  All don't seem that hard, but your grade will tell you otherwise.  So, they are hard.  \nDon't take it, just don't.  Do whatever you can.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 04, 2005",
            "review_content": "\nColin is an overall awesome instructor of Literature Humanities. I was shocked when I found out that this had been his first year teaching the class. His knowledge of the books, and his obvious preparations make the class stimulating and challenging. He expects a lot out of you, but he for the most part gives even more back. If you have the priveledge of choosing your LitHum instructor/ta, definitely choose Colin. You'll learn so much, and your ability to read closely will greatly improve. Be prepared to work hard on your papers, but feel accomplished when you produce something far better than the average LitHum student. \nWorkload:\nStandard LitHum reading. He assigns 3-4 papers and they'll amount to between 12-15 pages total. First semester, he determined the length of the papers, but second semester he let us choose. He writes a fair midterm that shouldn't be tough if you do most of the reading, participate and pay attention. Departmental final. Breakdown: (ballpark) Papers: 60% Midterm: 15% Final: 15% Participation/Attendance: 15%\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 21, 2005",
            "review_content": "\nCoilin Parsons' Lit Hum class will definately be the highlight of your Core experience at Columbia. Discussions are dynamic and fast-paced, controlled (though not completely dominated) by this professor who really knows his stuff. Intellectually stimulating, exciting, and informative. Each class was really a thrill. \nWorkload:\nNot unlike most Lit Hum classes--4 papers of varying length--the only stipulation second term was that you write 12pages of text in all; you choose the length of each. Readings are from the lit hum syllabus, and even if you think you won't like some of them (Thucydides, anyone?), Coilin will make it fascinating. Grading is on the rough side--nothing is more frustrating than writing a good paper, receiving a 96, and still having that be an A---but it motivates you to push past your limits. Reaching far and not just settling for the sure or the obvious is rewarded.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 16, 2004",
            "review_content": "\nCoilin Parsons is one of the best teachers I have had.  He is extremely intelligent and makes sure that you are a better writer from taking his class.  Not an easy grader, but his class is worth it.\nWorkload:\nExercises every week for the first two months.  Four papers.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 22, 2004",
            "review_content": "\nI don't know whether his grading was harsh or not because I never compared grades with anyone else in the class, but it seemed reasonable considering the amount of effort I put in.  He didn't seem to respond well to improperly formatted emails, but he was nice enough to reply to them anyway.  He's rather nitpicky when it comes to grammatiks, but if you ignore the penciled-corrections it won't annoy you too much.  He's a good teacher, though, and I thoroughly enjoyed the class.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 14, 2004",
            "review_content": "\nVery good professor who makes you work hard.  His analysis of your paper's argument is excellent and incisive, and he forces you to consider the worth of every sentence.  Coilin is not an easy grader, but he is fair.  You'll get the grade you deserve.\nWorkload:\nThree papers, one of them a \"group collaborative project.\"   Short weekly writing assignments.  Six-eight short readings.  No final or midterm.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 13, 2003",
            "review_content": "\na hard ass but a fine teacher who will strip your writing of all the bullshit and make you a clear, responsible writer. he sincerely cares about \"good\" writing. \nWorkload:\nnormal l+r\n"
        }
    ]
}