{
    "prof_info": [
        {
            "prof_name": "Morgan May",
            "prof_id": 1416,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Laboratory Work",
            "review_date": "June 27, 2004",
            "review_content": "\nProfessor May is one of the nicest professors that I have met at Columbia. The section I took was co-\"taught\" by Professor Uemura, who is also great. Not only are both professors nice and approachable, the class is not bad at all. You have to do 2 labs per semester (one each half). Both have to be written up and one has to be presented in front of the class. Anyone that needs to take a physics lab should take this course. The physics is noticably harder than the other lab, but there is plenty of time to learn the new material, especially since there is only 2 reports. Attendance is not mandatory after you finish your lab (they actually never take attendance and I never came on time or stayed until the end of the class). Just show the professor that you can work in the lab and produce a decent lab report, and you will get an A, no doubt about it. They will explain anything about the lab or the report that you want and will even schedule extra time for you in the lab if you need it. I would recommend this class to anyone. \nWorkload:\nMinimal. 2 labs (which require a report, one needs to be presented), very lenient on extensions and extra help and time. \n"
        },
        {
            "course_name": "Intermediate Laboratory Work",
            "review_date": "January 08, 2004",
            "review_content": "\nThe class is so laughingly easy I'm glad physics majors have to take it thrice.  You work with a lab partner on two experiments (out of thirteen) a semester, then write up a lab report that they beg you to keep short.  The professors and TAs are more than willing to help with the experiments, discuss the results, even almost tell you what to write.  If you finish your experiments fast you don't even have to show up every single Friday.  I only ended up going about half the time.\nWorkload:\nOnly two labs for the semester with short (4-8 pg) lab reports, one presentation.\n"
        },
        {
            "course_name": "Intermediate Laboratory Work",
            "review_date": "January 10, 2003",
            "review_content": "\nI think this might be the best lab class around. Everybody knows all labs suck, but this is probably the easiest of any of them. You only do two experiments the whole semester, (TWO!) and you can get the professors or TAs to do most of the work for you. Lab reports are a cake walk -- they barely read them except to look at charts and tables and stuff, so just make sure you have lots of those and you're set to go. Just record every bit of data you can think of and plot every imaginable combination of observables. The hardest part is actually doing any work at all, since it's fantastically boring for the most part and the deadlines are not strict at all. \nWorkload:\nTwo very leniently graded lab reports and one ungraded 15-minute talk on one of your experiments. Class meets once a week and you don't even have to go regularly as long as you finish your experiments.\n"
        }
    ]
}