{
    "prof_info": [
        {
            "prof_name": "Richard So",
            "prof_id": 2532,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 22, 2006",
            "review_content": "\nRichard is one of those professors who makes you sweat all year long, and then gives you the grade you thought you were earning all year long. In this way, he truly challenges you (both your thought and your nerves). He cannot be blamed for the lackluster UWriting syllabus, and he will certainly attempt to extract the most interesting ideas from the texts. In fact, Richard's discussions are all about the ideas. He seems to appreciate heated dialogue that really pulls the meat out of any interesting text, and is not beyond appreciated an argument that hardly even seems to be there. In this way, his classes can seem incredibly annoying. The discussions, not concrete in nature, hardly arrive at a point. The essay assignments are immensely abstract--this is again, a part of the course, although other students I have spoken with have showed me other professor's versions of the same assignment, and sometimes they were much clearer. Richard's comments on papers are often unclear as well. Students had mixed experiences--some claimed he gave remarkably good feedback, including a good balance of prescriptive and well as stylistic and theoretical advice. My experience was not as good; I met with him on pretty much every available occasion (I spent much time with him in 301 Philosophy and/or Butler lounge), but typically left these meetings with no idea where to go with my papers. He said this had something to do with my style, and maybe it did. I did well in his class regardless. \nAlthough a bit foggy, Richard is certainly a great guy to have a discussion with, he loves students who have probing ideas and are willing to write daring and exciting papers (versus standard, competent discussions). If you do have him, take advantage of his willingness to meet, and CHOOSE TO GET WRITTEN FEEDBACK unless you are amazing at keeping track of ideas and suggestions given to you during a meeting! You can probably get him to sit down with you over his comments anyway if you don't understand. You won't end up gathering much helpful feedback when you trek over to Philosophy hungover on a Friday morning (and I know several people who have had this experience).\nWorkload:\nTypical UWriting, the Lens, Conversation and Constellation essays, plus a retrospective that was cancelled when I took the class.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 17, 2005",
            "review_content": "\nRichard is truly a great teacher. I wish that this class could have lasted for the entire year, rather than just first semester. We had really intense discussions and he listened intently to everyone who wanted to speak. He asked interesting questions. Class was rarely boring and it was always relaxed. My writing improved tremendously from this class because we would have \"workshop day\" where we would look over each other's work. It was really helpful and he always helped in whatever way that he could. If you are lucky enough to have him, take advantage of his teaching style and really engage yourself in the class discussions. You should also meet with him outside of class to talk about your work before it's due. Richard is a really funny, down-to-earth guy who will make you laugh and want to participate. \nWorkload:\nA good amount.. but it's a required class for freshmen so this does not matter. \nYour writing will benefit from the workload anyway. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 14, 2005",
            "review_content": "\nBy the end of the term, Richard was quite good.  I think I  might have been in his first class.  At first, he was hesitant to meet with me outside of class and insisted that we either got notes on our papers OR a meeting, but with pressure, he started making himself more available.  As he became more comfortable teaching, he became much better.  His comments on my papers became more clear and helpful. Classes were fun by the end of the semester.  I spoke to someone who had him in the spring semester (2005) and said he was very good.\nWorkload:\nlike all University Writing classes - 4 progressions... small reading and writing assignments for each class and 4 large essays with drafts (last is a research assignment that builds from a group project).\n"
        }
    ]
}