{
    "prof_info": [
        {
            "prof_name": "Niall Bolger",
            "prof_id": 2937,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Experimental Psychology: Social and Personality",
            "review_date": "February 14, 2009",
            "review_content": "\nAlthough Professor Bolger is a prestigious researcher, I would not say he is a good lecturer. The main problem I had with him was not his extremely boring lectures, but the fact that he was always absent. Luckily, we had really good TAs who taught better and more interestingly when he was away.\nOne thing you have to keep in mind is that this is probably the easiest Experimental Psychology class that most of the psych majors are trying to get an easy way out. You just have to endure with his tediousness and the apathy of your group members.\nWorkload:\n1 Midterm and a Final Paper. You also get to work your way to the final paper through the assignments.\n"
        },
        {
            "course_name": "Experimental Psychology: Social and Personality",
            "review_date": "September 02, 2008",
            "review_content": "\nomg this course what such a pain! i hated every minute of it.. the text book is a joke and the teacher is soo boring. i could not take it. the TA's are doing there own stuff outside the class so they cant really help so they cant really relate and dont help all that much. its alot of work for not alot of learning..i honestly thought this was the worst class i have taken at columbia- this is just my opinion because the teacher was boring and i also took it late--and my group was also lazy..so dont take this course if you dont have to.\nWorkload:\ntoo much \n"
        },
        {
            "course_name": "Experimental Psychology: Social and Personality",
            "review_date": "July 01, 2006",
            "review_content": "\nOk. Take this class if you dont care about psychology and just want to get it over with. You will learn from the text book and maybe your TA. Nial Bolger is apparently an amazing clinical psychologist, but his teachings leave much to be desired. He would not actually teach anything, and would just drone on about things that were not necessary, and that we would never need in his class or otherwise. I am very studious, and I would just draw in my notebook while he talked. This was his first Columbia class, so maybe it was just us, but he doesnt actually teach. All i learned in his class was how to conduct an experiment, and I learned that from the readings in the textbook. There was nothing to do in this class until the end, where he decided that we actually needed to do something in the class, and made our 20 page experiment deadline and start within 2 weeks. His time management in the schedule of the class and his lectures were horrible. If you care about actually learning something, dont take this class.\nWorkload:\nlight. big paper at end that takes a lot of work, but no work other than the big project at the end\n"
        },
        {
            "course_name": "Experimental Psychology: Social and Personality",
            "review_date": "May 14, 2006",
            "review_content": "\nWhat a personality!  Bolger will make you laugh every time he lectured but... what was he talking about again?  One class, I kid you not, we spent an hour and a half discussing the game, Plinko, on Price is Right.  The time flew, but... what?  Experimental Psychology?  Plinko?  Don't bother try and figuring out what the purpose of his lectures are because they really are quite random.  The work in the course starts out really light and then Bolger realizes that the class has to do something and leaves the entire project for the last 4 weeks of class (so those weeks can be painful).  Overall, grading is dependent upon your TA.  The midterm is REALLY easy but only 15% of your grade.  Make sure you turn in a killer final paper and you're golden.  A good way to knock out the lab requirement for a psych major/concentrator, but pretty dry otherwise.\nWorkload:\nSome busywork homework assignments, 1 very easy midterm, text readings for first half of the course (very dry), drafts of introduction, methodology, and analysis section of paper, and final paper.\n"
        }
    ]
}