{
    "prof_info": [
        {
            "prof_name": "Samuel North",
            "prof_id": 4554,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Literature Humanities",
            "review_date": "September 26, 2014",
            "review_content": "\nJoe North is simply the best. You are tremendously lucky if you get him as your Lit hum prof, but unfortunately I think this is his last year teaching here. He is incredibly nice, never pedantic or condescending, and he really values your learning and his students as people.\nHe will never shoot you down in class, or grill you like some Lit hum professors do. He may sometimes be too nice, but that is much, much more preferable to the opposite. I can't harp on how kind he is - he deserves a gold nugget!\nWorkload:\nNot bad at all. Do the readings, though, even though there are a lot. CC has much more, and having done the readings will make discussions so much more fun.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 14, 2014",
            "review_content": "\nHow does Professor North not have a gold nugget yet? He definitely deserves one. \nJoe, as he prefers to be called, is friendly, understanding, and encouraging. He approaches every text with immense enthusiasm and really knows how to engage the class. He's a fair grader and will happily meet with you about questions, comments, concerns, essays, etc. \nEach class begins with everyone going around in a circle and answering the question \"how are you?\" It's a brilliant way to get to know the people in class and leads into the discussion of the texts quite well.\nIf you got Joe as your Lit Hum professor, then consider yourself very lucky.\nWorkload:\nReadings, 3 essays per semester, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 06, 2013",
            "review_content": "\nI have always loved literature, but I've never once really loved an English/literature class. I really wasn't looking forward to LitHum for that reason, but... my expectations were just completely surpassed. Samuel Joseph North, or \"Joe,\" is just the best professor I can imagine for this class. He's really funny and makes every text accessible. Even in reading plays or philosophical writings from ancient Greece, Joe was able to frame the ideas in a way that made me feel like I could really understand what these people from thousands of years ago were thinking. And he understands that we don't have to like every piece to get some meaning out of it! At the beginning of the class, he pointed out that he doesn't care if we love or hate the works, as long as we get some feeling from them. Plus, we never got busy work, which was obviously great.\nAlso, another huge, huge perk of being in Joe's class was that we all interacted really well. I mean, we pretty much had to get to know each other because we went around the circle every day to repeat our names and how we were doing that day. That, I think, really helped us, both in and out of class, because we were able to raise our hands in discussion to say, \"I agree with X,\" or \"Well, I'm not sure if I think that Y has the right idea,\" and we could also just talk to each other around campus.\nIf you can choose a professor for LitHum, Joe is the best, hands down.\nWorkload:\nReadings (obviously) and three or four essays a semester\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 09, 2013",
            "review_content": "\nSamuel North (or, rather, Joe, as he prefers to go by) is a great professor and there's really not much more I'd ask for from a Lit-Hum professor.\nBasically, classes go like this:\nHe first has everyone go around and say their name and answer some question (usually either \"How are you feeling today\" which resulted in some depressing answers... or \"What did you think about the text? Did you like it, etc\").  He likes to have all the students in the class really get to know each other, which I thought was kind of nice.\nOn the first day after reading a text, he has us go around and talk about some of our first impressions of the text and just general thoughts. He also usually provides some background about the time period and other facts about the author.\nBased on what the class speaks about, he starts to ask some questions to prompt further discussion. We sat around in a circle (he liked to have everyone visible to everyone else) and raised our hands when we had something to contribute. Joe tries to give everyone a fair amount of speaking time (ie, if you talk a lot, he'll try to call on you less often to give others a chance to speak, and if you don't talk much, he'll make sure to call on you when you finally do raise your hand). Also, he gives us a short break in the middle of class which is nice because we're there for quite a long time.\nA lot of times, he already has an idea of exactly what points and passages he wants to be addressed, so he'll ask questions that will push us in those directions. He has a three step method for going over passages: 1) State the obvious. 2) A little bit deeper, what else is this trying to say. 3) Further analysis & how does this relate to the rest of the text.\nAnyway, he clearly knows what he is talking about and he is very enthusiastic about the literature. A very fair teacher, and he will help you develop your thoughts and phrase them in an understandable way. He's helped me see a lot of things in the text that we read that I would otherwise not see. I think the only complaints I could have is that 1) It was at 9 am but of course that wasn't his choice, and 2) as previous reviews mentioned... the \"suffers fools too lightly\" issue, but honestly, that's the problem of the fool and not the professor.\nAdvice for people taking this class: Do your reading early, time management, yada yada. Joe gives you 3 \"opt-outs\" a semester (meaning, you can say you didn't do the reading and just not participate in discussion without any harm to your grade for that day), but opting out is no fun, and you'll have to do the reading eventually anyway. Basically, just try to speak up more in class and make the most of it!\nWorkload:\nNo quizzes. Just do the reading and participate in discussion. 2-3 essays a semester (no more than 5 pages from what I remember... I think the first essay was 2-3 pgs). Midterm and Final are pretty straightforward and standard for all lithum classes (Section 1: passage/quote IDs-- identify speaker/author/text and brief summary of what is going on, Section 2: passage analysis essay, Section 3: answer an essay question using 3 texts).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 31, 2012",
            "review_content": "\nThis is a good LitHum section! Like the previous reviewer said Joe has engaging lessons and is clearly invested in the subject matter. Even at 9 AM he's always awake and asking thought-provoking questions. He also has a pretty awesome party trick the first class (I won't spoil the surprise -- hopefully he continues doing this in future semesters) where he pretty much proved in my book that he cares about getting to know his students and making sure they get to know each other. Our LitHum class is exceptionally well-acquainted, which is great for a freshman year class!\nJoe indeed writes a lot of notes on your essays and tries to give a lot of feedback. He also seems like somebody who has all the time in the world for his students if you just set up a meeting with him. He's very reasonable with giving extensions as long as you ask at an appropriate time. He also plays no favorites whatsoever. In short, he's fair.\nWhile I sort of agree with the last reviewer saying that he 'suffers fools too lightly' (YOU KNOW WHO YOU ARE [I hope]) he sort of patches up the problem through his teaching style. What he does is that when people make comments, he repeats it back to them to make sure everyone gets it. What's cool is that when somebody makes a lame comment, we a) hear it twice and laugh, b) watch the person wallow in their own idiocy by trying to change their comment and make it somewhat meaningful. This encourages people to make meaningful comments. The problem is that people who don't 'get it' don't shut up.\nGO JOE!\nWorkload:\nJoe took out a couple texts (including Histories and the one about the Polypenesian War -- the most boring ones) and added the Epic of Gilgamesh. Fortunately, especially for an epic, Gilgamesh is short, so we without a doubt had a lot less reading than other classes. \nWe were supposed to have 3 essays but for this semester he combined the last 2 into 1. It was 2 pages double-spaced for the first one, 6 pages double-spaced for the second one.\nGrading was unusually difficult for the first essay, but on the midterm, it seemed like As were easy to come by.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 29, 2011",
            "review_content": "\n\"Joe\" North is the only graduate student I would ever consider recommending for Lit Hum.  He is always engaging the class from start to finish and is meticulous with his critiques of papers.  My first 3-page paper had about a page and a half of notes and it didn't let up through the final paper.  His speaking style is clear and deep and oh so creamy-dreamy.  \nIf he has a fault, it's that he suffers fools too lightly and permits the long-winded of the class droll on and on with perfunctory platitudes and wikipedia regurgitations.  Honestly, fellow Columbians, we all know what you're trying to pull and it won't help your grade.  State your peace and shut the living fuck up.  \nWe want to hear Joe's velvety voice, not your bullshit.  \nGO JOE!\nWorkload:\nStandard for Lit Hum: 3, 4 and 5 page papers with midterm and final.  Joe has taught Uni Writing in the past, so though he's a tough grader, he is constructive.\n"
        }
    ]
}