{
    "prof_info": [
        {
            "prof_name": "Liza Knapp",
            "prof_id": 2300,
            "total_reviews": 25
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 24, 2016",
            "review_content": "\nI love Liza! She's a gem. Sweet, considerate, helpful, you really can't ask for a better Lit Hum professor. She has this endearing quirk where she will only address people in class by their last name (ex: Mr. X, Ms. X, Mx. X). You'll get into this habit too and might end up not knowing everyone's first names by the end of the year. Liza is a part of the Slavic Studies Department, so we ended up reading Tolstoy (\"Sevastopol Tales\", \"Childhood, Boyhood, Youth\") instead of Paradise Lost. She really loves Slavic literature. Also, drawing. Her class usually follows the typical (and dull) Lit Hum lecture model, but she will occasionally break it up by having students get up and draw scenes from the books on the chalkboards. There are a few class debates as well (Was Odysseus a good leader? Should Pride & Prejudice be on the syllabus?, etc.), along with some presentations to the class. Like any Lit Hum class, you probably will not end up doing every single reading and that is okay. As long as you skim and remember some key points, you'll get by. However, Liza does love to call upon students who have not raised their hands and may ask some pretty specific questions. If you don't know, it's not that big of a deal because she'll either call upon someone else, answer it herself, or get distracted completely and never address it. Her lectures aren't always that structured, and she is unintentionally hilarious. Sometimes she will get so overwhelmed by emotion after we read something that she might start crying in the middle of class. Cherish her. She really does care, and usually sets up conferences for essays. She can be pretty helpful, though I never really learned how to improve my grade over the course of the year and consistently scored a \"B+/A-\" on every essay. Her tests are incredibly different from your peers (read: better). IDs don't matter as she'll usually give the speaker in the middle of a quote or use the first lines of the book. Expect many short essays on the other hand and \"scavenger hunts\" where you'll have to compare three works and unusual essays asking you to write an Op-Ed or defend a character's actions. You generally have to post on CourseWorks after every reading, but she only asks for one or two sentences per post. Participation does help, so make an effort to talk in class. Her class can be strange and assignments creative, but Liza really cares deeply about Lit Hum, and eventually, you will want to as well.\nWorkload:\nDefinitely doable. Readings can get pretty heavy (learn how to skim, if you use SparkNotes use it wisely). Frequent posts on Courseworks. Three essays per semester, but they're short (three pages-ish). Midterm and Final follow similar formats: some quick IDs that focus on meaning rather than where it is from, a \"scavenger hunt\" comparing symbols/ideas/motifs between works, and two creative essays.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "July 13, 2016",
            "review_content": "\nProfessor Knapp was by far the best professor I had my first year at Columbia. She went above and beyond of what she needed to do, giving unconditional support and motivation. She connects with her students and provides great feedback. If you have her for LitHum, be happy. You're in for a great treat. \nWorkload:\n3 papers, midterm, final, post on discussion board per reading (only 150 words!)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 20, 2015",
            "review_content": "\nIf you're reading this because you just discovered that you got Liza Knapp as your Lit Hum instructor -- breathe a sigh of relief, because you're in for an amazing experience. I honestly don't know why Liza doesn't have a gold nugget yet, because she is certainly deserving of one. Out of all the teachers and professors I've had in the course of my education, I don't think I've quite met someone so passionate and enthusiastic and eccentric as she is when it comes to reading these texts. Liza will gasp, ooh, ah, and scream out whenever someone says something interesting or she comes up with an exciting new idea, which definitely keeps you on your toes. It's pretty hard to fall asleep in her class because she's too excited about the literature for you to not get pretty excited about it yourself. I personally have never been a really big English Lit kind of person, but I found a serious enjoyment in reading most of the books because of the way Professor Knapp taught them to us. \nThat being said, I will list whatever can possibly be seen as a negative to this course. Liza does make her own distinct midterm and finals, which tend to be longer and can be seen as more difficult than exams seen in other courses. Her quote IDs, however, are abundantly obvious and beyond fair (they're almost impossible to miss, so don't sweat these, she just cares that you can analyze themes and whatnot). Her essays can be a bit long or difficult to answer, but are usually fun and interesting prompts that provoke thought and force you to be creative and connect the books from the syllabus.\nOverall, I wouldn't trade my experience with Liza as my lit hum instructor for any other professor at this university. Her kindness and enthusiasm goes a long way in this class, considering a lot of my friends who had less than great professors ended up hating lit hum. I, however, love it, and going to class is always exciting. Also, if you're interested in the English Lit department at all, take another one of her classes. You won't be sorry. \nWorkload:\nTypical lit hum workload -- try to keep up with all reading, realize you can't, and bs your way through discussions on the days you didn't have time to read. \n3 essays per semester - each one is 1,000 - 1,250 words. Not long to write, but she is very particular on writing style and ideas and whatnot, so don't expect the best grades ever on these.\nMidterm, final - IDs are a cakewalk, you can't miss them. Essays can be long and thought provoking, but definitely nothing you can't handle if you have a decent grasp on the general ideas in lit hum.\nGrading breakdown:\nEssays 30% (10% per essay)\nMidterm 20%\nFinal 30%\nParticipation/Attendance 20%\nOverall very fair in the grading - you get what you put into it. \n"
        },
        {
            "course_name": "Dostoevsky, Tolstoy, and the British Novel",
            "review_date": "January 14, 2014",
            "review_content": "\nStop reading this and take her class. Whether it's a required course or it's just for fun, I guarantee you will not regret spending 4/5 months listening to Professor Knapp twice a week. Her enthusiasm for her subject is truly one of the most wonderful and entertaining things I have ever seen. I could not wait to sit in on her class and bask in the inspiring energy that she exudes every day. It must be said that this was only my first semester at Columbia. However, after sitting in on one of her classes during registration, I decided to take her class completely on a whim. It was a lot of work, especially considering I had never read the material before, but I would not have regretted it even if I had received a low grade.\nShe gives insightful but encouraging feedback. Not the hardest grader, but definitely think through your arguments thoroughly.\nWorkload:\nA lot of reading! One midterm and one take-home final that was about 3000 words total.\n"
        },
        {
            "course_name": "Tolstoy and Dostoevsky",
            "review_date": "May 08, 2013",
            "review_content": "\nAmazing!!!!! I loved this class and the professor!!!! Her enthusiasm and her passion for the subject is obvious!! She walks around the classroom discussing specific passages from the readings and makes weird noises showing her fascination with whatever it is she is talking about. Attendance is taken, so you need to make sure to attend all the lectures. However, the lectures are always interesting...you will never get bored in this class! The workload is pretty heavy, but all the readings are very interesting!\nWorkload:\nA LOT of reading, 2 very short papers (10% each), a midterm (20%), a 3 hour final (40%), discussion board posts & attendance (20%)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 06, 2013",
            "review_content": "\nIf you have been randomly assigned to this Lit Hum section, you are among the luckiest students in your year. Professor Knapp is an incredible instructor, making this class an incredibly rewarding experience. She makes a real effort to make the class as challenging and creative as possible, giving interesting essay assignments like composing a character's Twitter feed or discussing a connection to a painting at the Met. One day, someone mentioned that the class before ours had taken place outside, and the class after ours was going to go outside, so by the \"squeeze theorem,\" we should have our class outside; Professor Knapp definitely did not let us go outside (it's against her rules), but she did use the squeeze theorem to discuss Crime and Punishment for the entire rest of the class. I'm not sure I've ever had a teacher who could connect Calculus to Russian literature, but she did it! Professor Knapp also is a very big deal at Columbia - she's the chair of the entire Slavic Languages Department. She tries hard to bring in her knowledge from this field into the classroom, replacing some texts on the traditional Lit Hum syllabus with additional works by Tolstoy. These alternative works were often much more interesting and thought provoking than the other works that other classes may have read. Professor Knapp's teaching style is very quirky - she screams when someone brings up a good idea, she calls everyone ONLY by their last name (don't ever try to use first names in the class), and she doesn't hesitate to poke fun at the eccentricities of the texts (or sometimes even her students). Her personality really adds a lot to Lit Hum, and makes you actually look forward to this class.\nWorkload:\nA lot of reading, but nothing more than other Lit Hum classes. If you are motivated, it's possible to get it done. If you're like 99% of other Columbia students, though, you can get by with some combination of skimming and Sparknotes. She assigns 3 essays a semester, all of which are well spaced and very doable. She designs her own midterm and final, unlike other professors who use the generic ones from the Lit Hum committee. You'll end up writing a lot more during the exam than your peers, but you won't have to worry about any annoying passage ids (her's are very easy to identify, as she is much more concerned with your ability to analyze rather than just recognize). The exams are definitely challenging, but she always grades very fairly. I'm pretty sure everyone who made an effort to do well on the essays and tests ended up just fine.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 25, 2012",
            "review_content": "\nProfessor Knapp is awesome!!! Ignore the review before this one [editor's note: the review in question is the one written on September 28, 2012]!!! She is very nice, cares alot about her class, and is an extremely fascinating person.\nWhat I really like about her class is that she focuses on making sure the people who put the work into the class gain alot from it instead of focusing on punishing those that don't do the work. Some professors have quizzes in their lit hum section, ask if people have read, and have quote IDs on their midterm/final; not Knapp!!! What she really cares about is engaging the class in good discussion and tries to focus on what interests the students. We are (semi) required to make posts on a courseworks discussion board about a theme of the reading sometime before the class that discusses the work. Her discussions will be based off the responses we make on the discussion board. I really appreciate that she does this, but you can tell when most of the class didn't do the reading or BSed something for the discussion board response. The conversation is either not very engaging or between her and 2 students. That being said, when the discussions do work, they work very well. She will commonly scream something in the middle of class; very entertaining and her energy is highly appreciated. Many times I will come out of class with my mind blown about life, or uncomfortable with the fact that we were able to come to a truth about the text that I completely missed while reading on my own. The latter situation results in the most learning and makes me very grateful for having her.\nI really don't like the essays. Either I'm just bad at writing, or the essay prompts are ridiculous hard to respond to. Yet I attacked each one with a desire to improve, most likely because I felt guilty that Knapp was soo awesome to us. For example, she required us to email our essay ideas to her along with some supporting evidence by Friday at 6pm if we wanted feedback and to email her anyway after the deadline, albiet without feedback. I (being a hardcore procrastinator) submitted it at midnight on saturday (12:01am sunday?) and she replied to my email FIVE MINUTES LATER with a full page of analysis, critque, and constructive feedback. After our first round of essays, she required that we set up writing appointments with her for our second and third essays, where we would sit with her for 20 minutes and discuss our rough draft. These usually ended with her tearing apart my essay in the most polite way possible... \"I really like the ideas you have and the direction you are going with this. You just need to re-do the structure of the essay and improve the overall argument\" Gah, but still really helpful and greatly appreciated.\nI don't know why the previous review complained about her mid terms/final. She makes her own, which is FANTASTIC!!! Everyone else in Lit Hum complained about \"Quote IDs\" where they would have to identify the novel/speaker of a certain passage from memory without any sort of word bank; we had to analyze a passage which generally required knowing which text it was from, but we did not lose all the points for not knowing the exact speakers. The essays on the final/midterm were annoying, but you could get a B/B+ on it for vomiting whatever came to the top of your head onto the page, which was quite fortunate as we already felt bad enough for not doing as well as we wished.\nShe really cares about the content and relfects this by actively adjusting the syllabus to what she thinks will work best. We did not read \"The Medea\" (which everyone said was really good) but instead read \"Iphigeneia at Aulis\" which was not only an easy read, but rather fun to analyze. I ended up writing two of my 3 essays on this book, and felt like I gain muched from analyzing this text in depth.\nTake Knapp. She is quite insane (in a good way), everyone in the class would love to have lunch with her (seriously, she is quite a character), most of the class wants to try harder in the class as a result of her actions, yet you can still get away with not participating in the discussion if you had a hard week and couldn't read the book. She is always willing to help out with any question you have, is very accessible via email/office hours, and she brought cupcakes and drinks (lemonade, green tea, sparkling water) to our last dicussion of the semester!!!! Most importantly, if you make the effort to read the texts, respond well to discussion posts, and work hard on the essays, the discussions will be very engaging and you will learn alot!!!!!!!\nWorkload:\nLit hum workload. Die constantly as you attempt to read all of the books, write 3 essays during the semester and submit each one on courseworks 20 minutes before class, take one midterm and one final. Oh, and she generally requires that you post a response on the courseworks discussion board before each class; this takes between 5-20 minutes depending on how much thought you want to put into it, and is really easy if you have done the reading. I don't really know if she grades this or class participation for that matter; I passed despite slacking off the last month.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 24, 2012",
            "review_content": "\nI had Liza last year second semester. She was incredible.\nLiza is absolutely captivating. You will not fall asleep. She whispers, she screams, she calls everyone by their last name. In this class you will not know your neighbor's first name. Actually that part is a little awkward. \nHer discussion topics are also interesting, and she makes sure that at least some have thought about it before class through discussion posts. It get particularly interesting when you get to the Russian texts which seems to be her area of expertise. \nFinally, her class just felt FAIR. Lit hum is graded so weirdly. You have these stupid passage IDs and an essay you have to string together based on one word on the final? Why...? Liza's exams are long, but they are fair and cover things covered in class.\nIf you are in her section, stay in it. And if you are not immediately impressed, wait. Or google her. \nWorkload:\nSporadic discussion posts, midterm, final (both fair but long--lots of writing), and obviously all the lit hum reading.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 28, 2012",
            "review_content": "\nOk, I really don't know what all the excitement is about Liza Knapp.  I got her for freshman year LitHum and was excited to have received a silver nugget professor.  However, her class was anything but silver.  I would go into class having read all of the assigned reading and excited to talk about the books.  Within 20 minutes of the class starting, she managed to put me asleep with her conversation topics.  We would talk about the smallest, irrelevant scenes in the books for almost an hour.  I almost always fell asleep in class.\nFurthermore, it is not easy to do well in this class.  For every single paper, I would go to her office hours prior to the due date to work out the kinks she suggested, and then when the paper was returned, I would receive B-'s! She pointed out new faults in my paper that she didn't point out in her office hours!\nAnd the cherry on top?  She makes up her own finals and midterms.  For one of the finals, we were sharing a classroom with another LitHum class.  Everyone from the other class was gone with an hour to spare, but every single person from our class was still working.  Her midterms and finals are way longer than the department made ones.  SWITCH OUT OF HER CLASS!\nWorkload:\ntypical LitHum workload - essays, online posts, readings, midterm and final\n"
        },
        {
            "course_name": "Dostoevsky, Tolstoy, and the English Novel",
            "review_date": "January 12, 2012",
            "review_content": "\nLiza Knapp is by far the most talented professor I have had during my three years at Columbia. This class in particular was fantastic: great readings, stimulating assignments and entertaining lectures. At times, Professor Knapp runs around the room, inspired by her own train of thought, making a ridiculous mess of the blackboard at the same time. \nThe take-home final is what truly cemented Professor Knapp's greatness for me - for the first time I did not feel as if I was simply regurgitating answers or attempting to please my professor. Her short essay questions made me think about all of the material we had read in a new way, connecting overarching themes of the Russian and English novels and bringing together the concept of the class in a way I had yet to experience at Columbia. All professors should strive for Professor Knapp's level of expertise and enthusiasm.  \nWorkload:\nLots of reading, but every bit is enjoyable. Papers and exams were a pleasure to write. \n"
        },
        {
            "course_name": "Dostoevsky, Tolstoy, and the English Novel",
            "review_date": "December 18, 2011",
            "review_content": "\nI LOVE LIZA KNAPP.\nHer lecturing style is INSANE. She whispers, shouts, dithers, and occasionally makes crazy, swirling notes on the board. She's also extremely engaging. I always felt like she cared about her students opinions. The Courseworks postings don't merely float about in the ether -- she takes the time to email her students back her insights about what you posted. Also, this woman just flat out knows her stuff. I was stunned by the breadth of knowledge she displayed in class. She also does an excellent job of giving each lecture a general narrative: she never ever falls into just summarizing what happened in the book. Highly recommend the course.\nWorkload:\nNot too bad. The reading load is intense, but ENTIRELY worth it. She also spaces it out pretty well. Courseworks postings, one midterm essay, one relatively short take-home final.\n"
        },
        {
            "course_name": "Tolstoy and Dostoevsky",
            "review_date": "May 09, 2011",
            "review_content": "\nI had to write this review because after four long years at Columbia I can say with confidence that Liza Knapp is hands down and far and away the best professor I encountered.  Very knowledgeable, extremely patient and incredibly insightful, Professor Knapp's course was incredible.  Not only did I read every single required word happily, (War and Peace PLUS Brothers Karamazov PLUS other 100 page or so stories!) but I made it to every single 9am lecture.  She is that good.  \nA peripheral interest in Russian Lit turned into a passionate exploration- I even minored in Slavic after I took this class.  She has also to Lit Hum so she is able to tie all of that stuff to Tolstoy and Dostoevsky!\nWorkload:\nA ton of (VERY enjoyable!!) reading, posts on courseworks, a paper, a mid-term, a final.\n"
        },
        {
            "course_name": "Tolstoy and Dostoevsky",
            "review_date": "May 23, 2010",
            "review_content": "\nLiza Knapp is a really great professor. Not all of her lectures are completely organized or astoundingly interesting, but when she's on, you come out of class knowing so much and feeling very inspired. She's extremely nice, and though a bit intimidating, if you go to speak to her during office hours, she will remember you for the rest of the semester. She's extremely knowledgable, and her classes (with her bursts of emotion, shrieks, and wild blackboard drawings) are all...dare I say, fun? If you're at all interested in the literature or either of the two authors, I would highly, HIGHLY recommend this class.   \nWorkload:\nThe reading was a bit intense (combining a 1000 page novel, 700 hundred page novel, and other shorter-100ish page novels may have been a bit too much). However, in terms of assignments, you only have a few discussion board postings (easy) and two short (one/two page) papers. Midterm and final are fine if you go to class.\n"
        },
        {
            "course_name": "Dostoevsky, Tolstoy, and the English Novel",
            "review_date": "May 23, 2009",
            "review_content": "\nI will start by saying: DO NOT TAKE THIS CLASS.  it was a painful experience.  Professor Knapp is a very nice person but her lectures are very boring and the load of the reading that we had to do every week was just ridicules.  Unless you are a literature loving person, you are not a good fit for this class.  We had to write two 5 page papers, a midterm, and a final.  The midterm and final were very annoying because we had to sit and write bunch of essays and there wasn't enough time.  For example in the final we had to write 5 short essay questions and 3 longer ones which was just insane given the time we had.  In short, I did not enjoy this class at all and I wont recommend it to anyone who wants to fulfill their core requirements.  By the way, I am not saying all these things because I got a bad grade in the class.  I actually managed to get an A- but I worked my butt off for it.   \nWorkload:\nTwo 5-7 page essays, one midterm and one final.  Crazy amount of reading every week.\n"
        },
        {
            "course_name": "Tolstoy and Dostoevsky",
            "review_date": "August 04, 2008",
            "review_content": "\nIt took me a bit of time to get used to Knapp...but it is well worth the wait. At first, she seems a bit disorganized, but then you realize it's just her passion for the literature showing through. Knapp is a kind and articulate professor who is able to synthesize texts wonderfully (though don't expect to stay on schedule!). There's lots of readings in this class, but Knapp understands that and teaches accordingly. Knapp is one of the only professors I've encountered at Columbia who seems to genuinely care about her students and their well-being. T & D is overall an enjoyable, non-stressful, and wonderful class. \nWorkload:\nTwo papers which is very light given the reading load. Reading is a lot but you can do it slower than the syllabus calls for. Just make sure you've read everything by the midterm/final and you'll be fine. And it you don't, just make sure you know a few themes really well!\n"
        },
        {
            "course_name": "Tolstoy and Dostoevsky",
            "review_date": "August 04, 2008",
            "review_content": "\nIt took me a bit of time to get used to Knapp...but it is well worth the wait. At first, she seems a bit disorganized, but then you realize it's just her passion for the literature showing through. Knapp is a kind and articulate professor who is able to synthesize texts wonderfully (though don't expect to stay on schedule!). There's lots of readings in this class, but Knapp understands that and teaches accordingly. Knapp is one of the only professors I've encountered at Columbia who seems to genuinely care about her students and their well-being. T & D is overall an enjoyable, non-stressful, and wonderful class. \nWorkload:\nTwo papers which is very light given the reading load. Reading is a lot but you can do it slower than the syllabus calls for. Just make sure you've read everything by the midterm/final and you'll be fine. And it you don't, just make sure you know a few themes really well!\n"
        },
        {
            "course_name": "Tolstoy and Dostoevsky",
            "review_date": "May 20, 2007",
            "review_content": "\nProf. Knapp is incredible, one of the best teachers I've had in years; she's upbeat, enthusiastic, and really interesting. She's both very intelligent and a great teacher, which as you maay have noticed, don't always come in the same package. I have nothing but positive things to say about Prof. Knapp.\nWorkload:\nObviously, there's a good deal of reading; then there are two very short papers, a midterm and a final. The exams are pretty intense--the final had a ton of essays in a short amount of time. There are also a few Courseworks posting assignments that lead into the papers. Manageable workload, and the class and professor make the work totally worth it.\n"
        },
        {
            "course_name": "Tolstoy and Dostoevsky",
            "review_date": "April 24, 2007",
            "review_content": "\nNice lady, but uninteresting lecturer who constantly makes mistkaes and confuses quotes and characters throughout all the novels you read. Workload is not bad, tests are starightforward and some of the books are great, but the lecture is never worth showing up to, though attendance does count towards some fraction of your grade.\nWorkload:\nReading, 100-200 pages a week, occasional discussion board posting, 2 essays, midterm final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 17, 2007",
            "review_content": "\nVery excited about the class and always looking to approach things from unique perspectives. However, she agrees with everyone no matter how ridiculous and does not stem and sometimes even seems to incourage ridiculous, irrelevent conversation. We spent half and hour dicussing the significance of the ending of the movie Pride and Prejudice. So if you're an asshole that likes to her him/herself talk and then look at the professor and get a smile and a nod you'll love her, if you want to get up and strangle the assholes that ramble on and suck up for 2 hours then she will frustrate you. It may have been that I had a dispropotionate number of pseudo-intellectual syncophants in my class, but by the end of the semester I couldn't stand her high-pitched, obnoxiously loud wail of \"Yes\" whenever someone said something ridiculous and she nevertheless encouraged it. Also, I got the impression she didn't read the texts to recently as her facts were often fuzzy. She's certainly no gold nugget...must be alot of ass-kissers reviewed her.\nWorkload:\nnormal work, 3 papers, midterm, and a interspersed short answers.\n"
        },
        {
            "course_name": "Dostoevsky, Tolstoy, and the English Novel",
            "review_date": "January 09, 2007",
            "review_content": "\nI love this woman.  She keeps you awake and she really gets to know her whole class and she wants you to really learn.  And she loves Russian literature.  Take any class you can with her.\nWorkload:\nMidterm, paper, Final, all VERY nicely graded.  Lots of reading but it's fun.\n"
        },
        {
            "course_name": "Tolstoy and Dostoevsky",
            "review_date": "March 09, 2006",
            "review_content": "\nEvery word out of her mouth is interesting.  She screeches and emphasizes with wild gesticulations and indecipherable chalkboard scribbles.  She's hilarious without trying to be funny.  You'll strive to do your best work and to make intelligent comments, even though she's warm and approachable -- not at all intimidating.  I develped a girl-crush on her during the very first lecture.\nWorkload:\nOpen-text tests.  Papers.  Not bad at all.  You'll enjoy it if you enjoy literature.\n"
        },
        {
            "course_name": "Dostoevsky, Tolstoy, and the British Novel",
            "review_date": "December 23, 2005",
            "review_content": "\nIf you have a chance to take a class with this professor, take it. Liza is simply amazing--I'd read almost all of the books for this class at least once, and some more than once, but I found myself learning new things. She knows all of the texts inside and out, and often got so excited about what she was lecturing that pages would fly out of her dog-eared, post-it-noted, books. She also allows for class discussion: if you have something you want to say, raise your hand and she'll call on you, even if she happens to be in mid-sentence at the time. I couldn't say enough how great she is, just take the class!!\nWorkload:\nmidterm, one paper, final, postings on courseworks, a few other exercises to help you get thinking about the books--all useful and interesting. The midterm and the final were both fair, she'll give you an outline a week or two before hand so you know how to prepare. The paper topic is given at least a month or three weeks ahead of time, so you have plenty of time to work on it.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 23, 2005",
            "review_content": "\nProfessor Knapp is an excellent Lit Hum professor. Consider yourself very lucky to end up in her class. She's kind, brilliant, passionate, and assigns terrific readings in addition to the LitHum syllabus. She stimulates interesting disucssions, is extremely approachable (an important quality in a Lit Hum instructor), cares about her students very much, and teaches effectively. The best instructor I've had so far at Columbia. \nWorkload:\nThe usual Lit Hum readings, 3 relatively short essays, VERY reasonable midterm, and final. Fair grader. \n"
        },
        {
            "course_name": "Literature & Empire: The Reign of the Russian Novel",
            "review_date": "January 07, 2005",
            "review_content": "\nI can't say enough about Professor Knapp. She is caring, insightful, and really one of the best lecturers I've had at Columbia. In a class with very heavy reading, it is necessary to have a teacher who will reward you (intellectually, at least) for all the time you spend-- and Professor Knapp does just that. Each class, she provides organized commentaries on the themes and plot of the novel, and she asks you to do 'scavenger hunts,' which allow you to find some of the novel's themes and plots for yourself.  I liked these, because, for once, I was finding things on my own, without having a teacher simply telling me what is and is not in the novel. She knows Anna Karenina and Tolstoy so unbelievably well. Even if you have read the book before, you will get a thousand times more out of it with her as your guide. Most importantly, she is truly excited about what she is teaching, and you can tell that she loves it -- this will definitely rub off on you.\nWorkload:\nA ton of reading (Eugene Onegin, Hero of Our Time, Fathers and Sons, Dead Souls, Anna Karenina, Brothers Karamazov, Chekhov's Stories). 1 paper (7-10 pages), 1 take-home midterm (7-10 pages), 1 open book final.  She is definitely a fair grader.\n"
        },
        {
            "course_name": "Literature & Empire: The Reign of the Russian Novel",
            "review_date": "December 22, 2004",
            "review_content": "\nTwo things combined to make this class generally wonderful: the incredible reading list of Russian novels and Professor Knapp's often hilarious (& inspiring) enthusiasm & passion for the subject.  Though I was occasionally annoyed by the lack of organization in the lectures and the slightly remedial ungraded exercises (for instance, scavenger hunts), on the whole I found the class very interesting & felt like Prof Knapp really focused on the important aspects of the novels and tied them together thematically.  Her vast knowledge of the subject and her screeching, unpredictable outbursts of excitement also made the class well worth attending.\nWorkload:\nA good deal of reading: The Brothers Karamazov, Anna Karenina, Dead Souls, A Hero of Our Time, Fathers and Sons, Eugene Onegin, and short stories by Chekhov.  Prof is not offended, however, if you're a couple classes behind.  2000 word take-home midterm, 2000 word paper, in class final, all graded very leniently.\n"
        }
    ]
}