{
    "prof_info": [
        {
            "prof_name": "Caitlin Beach",
            "prof_id": 13054,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "March 10, 2015",
            "review_content": "\nThis class (art hum) was incredibly interesting at times. I really enjoyed working on the essays. The amazingness of the course made up for the fact that Caitlin was the most boring and uninspiring teacher I've ever had. She practically discouraged participation with her blandness. We (the few of us who contributed to class discussion) were able to guide the conversations which was good but I often found myself on the verge of sleep.\nOverall great class but terrible professor.\nShe's a sort of fair grader I would say.\nTake her class if you are good at participating, if you dont want that much work, and are ok with being bored to death during class. You might learn something. Thanks to the predetermined art hum curriculum.\nWorkload:\nPuts a lot of weight on participation despite the fact that she might as well have discouraged participation.\nTwo 3ish page papers and one 5 page paper.\nMid term and Final\nLots of readings (most of which you don't need to do)\n\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 30, 2014",
            "review_content": "\nMs. Beach was a very nice teacher; she's not exceptional, but she's good. She raises challenging questions and points out interesting things in the artworks and historical contexts. She really just agrees with most all comments in the discussions, and only rarely will she challenge your point. She's a fair grader, and if you put in the effort, you can do well on the essays. Be sure to be very specific on midterms and finals, but most importantly in this class, PARTICIPATE! Go a little bit above and slightly beyond. Go to office hours, talk in class, have all the requirements when you turn in your papers, do the readings; these all factor into the participation portion of the grade (25%) and she notices. Overall, I would be totally willing to take another Art Humanities class with her again!\nWorkload:\nSlightly heavier than expected, but still manageable. \n-readings every class (often too long, but typically have to skim at least)\n-3 papers (really interesting actually, and she'll read/comment on a draft up to 5 days prior to the due date)\n-a midterm and final\n"
        }
    ]
}