{
    "prof_info": [
        {
            "prof_name": "Sheila Cohen",
            "prof_id": 2198,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "intro to sociology",
            "review_date": "December 13, 2005",
            "review_content": "\nWorst professor I have ever had. She was completely disorganized and unprofessional. Her lectures were lengthy ramblings of whatever liberal, communistic thought that popped into her head at the moment. The book was terrible as well (not even high school equivalent)and the readings were baisically useless. Though i happen to agree with many of her political views, they were fairly inappropriate and irrelevant in this context. Cohen was unable to teach objectively (not to mention engagingly)and I found that the few times i bothered to pay attention i just got pissed off.  I did the BARE MINIMUM amount of work required and got an A- which didn't seem like nearly enough for what i suffered through with this useless class.   \nWorkload:\nhomework assignment, essay, final exam.\n"
        },
        {
            "course_name": "intro to sociology",
            "review_date": "June 13, 2005",
            "review_content": "\nShe was highly disorganized- often forgetting/losing papers, coming to class late, and repeating the same material in class week after week.\nThe grading was inconsistant, and she even admitted writing harsh comments on people's papers because she was in a bad mood while she reviewed them. \nThe mandatory attendance was ridiculous, particularly because no roster was ever created, so we would take time to fill out our names each class. \nShe said she'd consider class participation despite it being a lecture and not knowing our names. The last class we introduced ourselves. \nThis was her first time teaching at Barnard/ Columbia, so perhaps that is why she was disorganized, so hopefully for the benefit of future students her style will change. Otherwise expect a professor whose approach is pretty unprofessional. \n"
        },
        {
            "course_name": "intro to sociology",
            "review_date": "May 09, 2005",
            "review_content": "\nThis class is really terrible. No, wait, correction: this class is really terrible with Prof. Cohen. This woman is a disaster. She breezed in once a week to teach the class (she only taught this class, the rest of the time she teaches at Hunter College), totally disorganzied and spacy. The lectures were PAINFULLY boring. \nShe took attendance, so I opted for no reading and all class. The lectures were textbook anyway. She always raved about her Hunter students, and you could sense an ever so slight attitude of hostility toward the class because we go to Columbia/Barnard, and therefore must be elitist brats. The papers were very stupid, especially the first, which was an autobiography. She told another student that she refuses to give As on principle!!!! Then she freaked out when the TA was giving ppl As, and tried to reduce everyone's grade! It was unreal!!! Then, to top it all off, at the final she asked what we would be writing on (seemingly unaware of the use of blue books), and since she didn't have any, we had to write on unlined Barnard letterhead. It was laughable. Seriously, spare yourself. \nWorkload:\nweekly reading (optional if you go to class), two easy papers, easy final (she gives out sample essays before that were pretty much identical to the real exam)\n"
        },
        {
            "course_name": "intro to sociology",
            "review_date": "December 22, 2004",
            "review_content": "\nOnly take this class with this professor if you have to. Lectures rambled and rambled and rambled, and never strayed from the book - you didn't actually have to go to class because lectures added absolutely nothing. it got to the point where I could only force myself to go to class once every two weeks (and because of the \"mandatory\" attendence, which was, in reality, only checked sporadically, and given my sparse attendance and my grade - in no way actually held against you).\nWorkload:\nridiculously easy. two papers, one 4-6pgs, the second 6-10 pages. no midterm, a final - that i don't even think was read given that the scores were posted online at like 5am on the first possible day that grades could be posted and given the time it took for the prof. cohen and the TA to finish reading the first paper. but whatever. overall, an easy class with a pretty light reading load (well, average in terms of pages, but the book was a quick read).  i doubt anyone could have gotten less than a B, even if they tried to earn less. \n"
        },
        {
            "course_name": "intro to sociology",
            "review_date": "December 22, 2004",
            "review_content": "\nI hated this class. Prof. Cohen taught directly out of the (boring) textbook, and I found myself bored almost into a coma. The good news, knowing things and paying attention in class was not necessary to achieve a good grade. Attending all lectures could help, but overall she was very disorganized and I don't know if she would have noticed any absence anyway. She lost everyone's grades and my paper (though it was eventually found), and wrote rude comments on some of my classmate's essays. Overall, I would skip this class. \nWorkload:\none short paper, one long paper, and a very easy final. \n"
        },
        {
            "course_name": "intro to sociology",
            "review_date": "November 08, 2004",
            "review_content": "\nThis is an easy intro class if you want to fulfill a requirement, but not great on content.  She's a nice lady and tries to bring class discussion into a large lecture, which is tough.  Ernesto the TA is great, but a little hard to understand with his thick accent.  Mandatory attendence is a bummer, but classes are occasionally a bit interesting.\nWorkload:\nTwo short easy papers, essay final in class, easy grading.\n"
        }
    ]
}