{
    "prof_info": [
        {
            "prof_name": "Brett Boretti",
            "prof_id": 5796,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Baseball",
            "review_date": "December 10, 2013",
            "review_content": "\nI only signed up for baseball because I was registering at the last minute and it seemed like a better bet than Cheerleading or an 8:00 a.m. slot of Strength Training. Well, I made a very wise choice. This was an extremely relaxed and easy class, and definitely worth having to go to class on Fridays and having to take the bus up to the field for part of the semester.\nThe class is taught by the actual Columbia baseball coach, so first of all, the guy really knows what he's doing and is very helpful when it comes to trying to improve your technique. He is very affable and relaxed. A few times he was very late to class, which meant that we just got to hang out on the field or in the dugout for a while, which was fine by me. Also, if you take this class during the spring, he'll probably miss a few classes for games and you won't have to come to class those days.\nThe class meets in Dodge until the weather clears up. For my class this did not happen until early March. So no bus nonsense to deal with for quite a while. For the most part, it was not annoying or overly time-consuming to take the bus up to the field and back down, though one time we got trapped at the field in the rain for half an hour for absolutely no reason (like, the driver just inexplicably walked away from the bus around the time it was supposed to leave and didn't come back for thirty minutes. I didn't have my Metrocard with me--lesson learned. If you want to be 100% sure you'll get back from the field on time, take your Metrocard to class so you can take the subway back if need be).  \nThe class mostly consists of grabbing a partner and playing catch. We also batted a couple times and played a game once. If you have visions of actually playing baseball games every class session, you're going to be disappointed. I really didn't care. I was perfectly happy chatting and playing catch all through class.\nWorkload:\nThrowing a ball back and forth and occasionally picking up a bat. Final consisted of showing up to the first inning of a Columbia baseball game.\n"
        }
    ]
}