{
    "prof_info": [
        {
            "prof_name": "Jeanne Poindexter",
            "prof_id": 615,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "August 09, 2007",
            "review_content": "\nPoindexter is the worst professor I've had at Barnard.  Her lectures are awful, and she's never nice to the students (at least she's never at all nice to me).  I agree with the other reviewers that she seems to like to impress the students with her knowledge rather than to teach them.  She's cold and insecure.  Take another instructor if you can.\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "January 16, 2006",
            "review_content": "\nwhat a mess. Poindexter is a very sweet lady and genuinely cares about the subject matter but she is convoluted lecturer and her tests are nearly impossible unless you have come into the class well prepared. If you did well on the AP exam you will be prepared, if you did not take AP, you might want to turn to prayer. Her lectures were circular and she often contradicts herself and I found them barely intelligible. This is not what I would call a straight forward class by any means. Find another professor if you can. \nWorkload:\nmidterm and final-standard fare with a p-dex twist of confusion.\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "October 03, 2005",
            "review_content": "\npoindexter is not as bad as everyone is making her out to be. chances are, the book will be the one you used in high school. and yes, her lectures are slightly circular and she did cellular respiration in the most ridiculous order i can imagine, but she is really okay. she's much better answering specific questions one-on-one, if you go to office hours. honestly, you are kidding yourself if you think you can take this class without doing a hell of a lot of reading. that said, the class wasn't overly difficult. her tests were challenging, but seriously, this is college... exams will rarely be easy. \nWorkload:\nenjoyable reading (if you are at all a bio person-- i don't know why you'd take this class if you weren't, though), two midterms and a final. all somewhat difficult, but nothing to be afraid of if you're prepared. \n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "June 01, 2005",
            "review_content": "\nWhere to begin indeed.  The material was interesting, but I thought lab recitations were much better than the class lectures.  Poindexter has a wierd way of being condescending and talking over your head at the same time.  Ugh.  I hated going to lecture, but it was good for catching up on sleep when I did go. Loved the book, but the, I loved it when I used it in high school too.  Unfortunately, almost all of you won't have a choice about taking this class, but if you have a choice of who to take it from, take it from someone other than Poindexter.\nWorkload:\nThe tests are the worst ever.  I don't mind learning the material, explaining it, and applying it, but her tests just don't make sense.  The stupid multiple true-false is a terrible format. If you took a good AP class in high school, you should be fine, if you can adapt to the crazy format.  I highly recommend studying from previous year's exams (they shouldn't be too hard to get ahold of).\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "May 15, 2005",
            "review_content": "\nPoindexter is a very boring lecturer - she pauses at all the wrong times and speaks/goes through the material she is teaching very quickly. Though the class is organized and we covered most of the syllabus, the material we go over in class is usually a more detailed description of one little piece of the material in the book. Tests are a weird multiple choice type thing - she writes a statement and then gives many choices and you circle the true answers - It's a little tricky at first but I actually liked the format. There are also a few fill in the blank-type questions. This class is not so bad though.\nWorkload:\nRead half a bio text book and spend hours studying for the 3 exams. When studying for the test, I would recommend mostly just reviewing your notes (yes, I recommend taking notes) from the textbook. Also, though I did anyway, we didn't have to memorize the structures of any molecules or the entire Calvin/Krebs/ Electron Transport/ etc. cycles. But knowing them will def. help you. Good luck!\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "April 27, 2005",
            "review_content": "\nProfessor Poindexter obviously knows a lot, but she doesn't seem to have much interest or ability in helping the student learn.  It's too bad when a professor's ego is more important than the students' learning in a course.  If it weren't for the textbook, I don't think any of us  would have learned anything.\nWorkload:\nexams were totally unfair, going to class is a waste of time (or a good chance to nap, since I never get anything out of attending her lectures anyway)\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "April 27, 2005",
            "review_content": "\nWorst lecturer ever.  she sounds like she's trying to impress herself, doesn't impress me.  Wish she seemed to care that her students learned rather than that she showed off.  I'm mean, come on, we're not graduate students (yet).\nWorkload:\nunfair tests, mean grading curve\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "April 20, 2005",
            "review_content": "\nPoindexter doesn't seem to care about the students actually learning anything.  She doesn't explain things well and tries to stuff so much information into a single class, you think your head is going to explode. There might not be much choice in taking this class, but avoid Poindexter if you want to actually learn anything.  Well, you do have to learn something to pass, but only by using the Cambell textbook on your own (I agree it's a good book).  Take anyone else if there is ever any option.  \nWorkload:\nnot so bad, but the tests are totally unreasonable and unfair\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "May 15, 2004",
            "review_content": "\nWhere to even begin. On a positive note- the textbook is awesome- it will become your bible over the course of the semester. Poindexter also is a brilliant woman and has been teaching the course for 40 years; however she doesn't necessarily understand that we're not as brilliant and she is and therefore does not know how to convey the material to intro biology students. Just a warning- unless you need this class to satisfy a major requirement- it's not worth the stress. The material is amazing but her lectures are so over your head and you walk out of class being even more confused than you were before lecture. But don't be lazy about going to TA help sessions because they are wonderful. Overall, interesting material, just the lectures are not so great. \nWorkload:\n2 evil midterms and an impossible final with a decent curve \n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "May 15, 2004",
            "review_content": "\nWhere to even begin. On a positive note- the textbook is awesome- it will become your bible over the course of the semester. Poindexter also is a brilliant woman and has been teaching the course for 40 years; however she doesn't necessarily understand that we're not as brilliant and she is and therefore does not know how to convey the material to intro biology students. Just a warning- unless you need this class to satisfy a major requirement- it's not worth the stress. The material is amazing but her lectures are so over your head and you walk out of class being even more confused than you were before lecture. But don't be lazy about going to TA help sessions because they are wonderful. Overall, interesting material, just the lectures are not so great. \nWorkload:\n2 evil midterms and an impossible final with a decent curve \n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "April 26, 2004",
            "review_content": "\nI did not find her lectures particularly helpful.  The Campbell Biology book (which you may have used in AP bio) is wonderful.  This course is the first step towards pre-med and bio/biochem majors, but I would not recommend the lecture part.  \nWorkload:\n2 midterms, 1 final, a sigficant amount of reading (which you should do very carefully)\n"
        },
        {
            "course_name": "Biological Experimentation Lab",
            "review_date": "May 04, 2003",
            "review_content": "\nDr. Poindexter definitely knows her stuff, and don't expect to get by by doing the minimum. Her labs are intensive and you need to make a concentrated effort to grasp the concepts. She's extremely smart and expects everyone to work their very hardest. Most people don't go to recitation because it's not exactly interesting, but it's crucial to a thorough understanding of the labs. The tests are killer. I did not get one short answer question right on the first midterm and still got a C+. The final's much easier, however.\nWorkload:\n4 lab reports, one very hard midterm, and 1 easy final. She'll discount the midterm if you get 1 letter grade bettter on the final. Lots of calculations during the labs are difficult to remember, but study them thoroughly. They're on the tests!\n"
        },
        {
            "course_name": "Microbiology",
            "review_date": "April 11, 2002",
            "review_content": "\nPoindexter is a brilliant scientist and a wonderful teacher. She knows and loves bacteria, and will convey her enthusiasm to you. The lecture is superb, although she goes VERY fast .... bring a tape recorder or be prepared to get writer's cramp. Exams are tough, but she curves the average to a B. She can be intimidating at first, but don't be scared off.... she is happy to help you out if you're having trouble and her animated lecture style makes class enjoyable. I highly recommend taking the lab as well ... it can be a lot of work during class time, but the class is generally relaxed and interesting, and with the exception of the final project, the reports are short and straightforward. The project is great .... you are free to choose pretty much any feasible investigation, and it's exciting to be able to carry out your own independent research. People put in a lot of work for the lab, but Poindexter recognizes this, giving most everyone a B+ or above. Dr. Poindexter has high expectations for her students, and while her class is no easy A, if you put in the effort you will learn an incredible amount of fascinating material and your hard work will be acknowledged. Don't think that microbiology is a dull field..... by the end of the semester you will be agreeing with Dr. Poindexter's closing statement... \"Microbes are awesome!\"\nWorkload:\nLecture - 3 midterms and a final, Lab - A few short reports and an enjoyable final project.\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "April 22, 2001",
            "review_content": "\nProfessor Poindexter is incredibly organized and fast-paced. Although class is very informative and interesting, because she goes so fast, it is difficult to stay awake. However, if you manage to stay awake, you'll find that she is brilliant and can teach you so much. This class should be taken for learning and not for the grade.\nWorkload:\nHeavy, heavy reading and memorizing!!!\n"
        }
    ]
}