{
    "prof_info": [
        {
            "prof_name": "Priscilla Ferguson",
            "prof_id": 721,
            "total_reviews": 29
        }
    ],
    "reviews": [
        {
            "course_name": "Paris: The Making of a Modern City",
            "review_date": "May 14, 2014",
            "review_content": "\nI don't mean to be harsh by saying this (especially since I actually have a lot of respect for Professor Ferguson's work) but this class simply isn't a sociology course. While the opening lectures promise to walk the line -- Ferguson at first spoke a lot about how we'll be using the \"sociological imagination\" to extract the universal from the particular -- the reality is that the vast majority of the course is spent learning fairly specific information about cultural phenomena of 19th Century Paris.\nDon't get me wrong; I fully recognize the academic utility of a case study, particularly one that would seem to encapsulate so many of the points -- everything from high fashion to sewer systems -- that Ferguson wanted to include in a course. However, since so little class time is spent explaining how this case study actually helps us understand the present day (besides a couple of inane exercises in which we were asked to identify all the physical commonalities between a 19th century department store and present day one) it feels like everything I learned exists in a vacuum. Perhaps this would be less troubling if there was not in fact a wealth of literature on actual contemporary urban sociology that we could have been reading instead.\nNo one can fault this course for being uncreative: we read novels, short stories, and even poems as a means of understanding the social world. However, any sociology major is going to take issue with treating Baudelaire as a sociologist and talking about \"modernity\" as if its a sociological term (in fact, your final paper does not have to be on Paris or the 19th century; it just has to be about modernity). Ferguson, interestingly enough, asked the class day one why the course was labeled a sociology class at all. When no one spoke, she answered her own question (something she often does), \"because it's listed in the sociology department\". Perhaps she was just being facetious, but she never actually clarified her point or provided another explanation for the course's listing. Ironically, I think she may have inadvertently communicated the biggest flaw of her course: it's painfully unclear where it even belongs.\nGrading is fair to easy and most of the readings are interesting in their own right, but lectures are excruciatingly boring. This is largely because Professor Ferguson spends most of the time asking the class extremely basic questions like, \"What does one need to put in a gas lamp to make it work? What's the effect of not having electricity at night? What happens when you have a fever for a really long time and it doesn't go away?\" (Please, please don't read any of those examples as jokes. She actually asked each one of them). However, if you can sit through enough lectures to not take a hit to your attendance grade, the class is probably an easy A.\n\nWorkload:\nAverage weekly reading and two journal entries, one in class midterm, and a choice of a take home final or research paper. Pay attention in class and you won't need the midterm or final.\n"
        },
        {
            "course_name": "Food and the Social Order",
            "review_date": "December 08, 2013",
            "review_content": "\nGuys this class rocks. It was by far one of the most interesting subjects I've looked into thus far. I wasn't super sure about sociology before I took this course, and now? I want to minor in it! Either she read her culpa reviews and revised the course from what it was in 2010, or the old reviewers weren't on point. Either way, it's clear she loves the subject and she wants you to love it too. Yeah, she has readings from her own work, but since she's great at making her points, her readings were incredible help in preparing for the exams. As long as you write down the key words she puts up on the board and relate them to the readings/class discussions, then you will be perfectly fine. She had us analyze a variety of things, from songs to essays, from creative writing to movies like Kung fu Panda, Ratatouille, and Jiro Dreams of Sushi. If you find that she is talking about a certain subject 'a lot', it's because that subject is one of the best examples of whatever key word she wishes to support. \nShe welcomes participation and listens to what you have to say. If you get an answer \"wrong\" (though she doesn't put you down for it EVER) then she will find some way to tie it in to what we're talking about and then move on. She is attentive, smart, and really nice. She talks quietly sometimes though (gets louder later in the semester) so unless you have bat ears don't sit in the back of the class. \nGuys take her class you won't regret it. \nWorkload:\n3-4 readings per week. Some of them are a little tedious and some are quick and light. All are interesting. 1 midterm (make your essays short and to the point guys you won't have enough time to write novels). Choice of 15 page paper or a final (both are self explanatory. I chose the final and it's take-home)\n"
        },
        {
            "course_name": "Food and the Social Order",
            "review_date": "November 04, 2013",
            "review_content": "\nI found this class to be really, really interesting - certainly unlike any class I've taken at Columbia. Professor Ferguson is very well-respected in the field of food sociology which has attracted a few interesting lecturers to the class. This class has really given me a new perspective on the food culture of the city. Make sure to write down the key terms that she puts on the board everyday, they're SUPER helpful when studying for the midterm. She talks really quietly so try to sit close to the front. Overall I am definitely glad that I took the class. Prof. Ferguson is really available to speak to and despite the class being a good sized lecture, she seemed to have learned everyones name by the end of the semester.\nWorkload:\nNot bad at all - about 4 readings per week, some are short and some are annoyingly long. Luckily you don't have to feel the need to read all of them because she goes over them really well in class and highlights the major points. The final research paper can be decently time-consuming but I really liked my topic which made it fun and interesting. Writing about food isn't too daunting.\n"
        },
        {
            "course_name": "Food and the Social Order",
            "review_date": "May 15, 2010",
            "review_content": "\nThis class is awful. She needs to learn how to give a decent lecture. The readings were generally pretty interesting, but she really has no idea how to discuss them, except those taken from her book, which she generally regurgitates during lecture. The class is basically all about French food. All the time. She believes that in order to engage the class she needs to ask super specific questions that will then cause students to share stories no one else wants to hear, instead of just actually discussing the texts we read. Additionally, the TAs were a bunch of stuck up sociology grad students who gave a ridiculous midterm where the class average was a C+. I took this class hoping that it would be a light, fun, sociology class on food and instead a bunch people just kept trying to prove to the class that sociology is really serious and important to life. Honestly, a C+ as a class average in a sociology class is really unheard of. fyi, I got way above the class average, but it's still just unnecessary and ridiculous. The final was much easier since they realized that they were idiots and gave the class a midterm that could only be successfully completed in about 2.5 hours. Worst class ever. Oh and Professor Ferguson doesn't allow computers in her class, which only adds to the chaos of her terrible lecturing. And she smacks her lips really loudly while she is speaking, which really only adds to the nuisance that is this class. \nWorkload:\n1 insane midterm, a decent final and a 12-15 page paper. \n"
        },
        {
            "course_name": "Food and the Social Order",
            "review_date": "May 12, 2010",
            "review_content": "\nThis class should be renamed \"McDonald's, Sushi, Passover and French Food\".  That's all that is really talked about.  Besides comments like \"some say violence is as american as apple pie\" by the professor, the class offers nothing of interest.  The lecture is simply a re-hash of the reading with a lot of stupid questions thrown in by Ferguson-who is in love with her idea of the French (she wrote a book about French food).  Don't buy the books on the reading list, you can get by without them.  But the reading has to be done, because the midterm and final are basically a test about how well you can cite all the authors.  Terrible class full of anecdotes from students and ignorant comments about foreign foods.  \nWorkload:\nA lot of boring reading. Midterm and Final, with a 10-12 page research paper on an approved topic.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 21, 2009",
            "review_content": "\nI can see why other students wouldn't like Ferguson for this class, but overall I was glad that I ended up in her section.  I agree that the class is more of a lecture and less of a seminar.  Participation consists of giving very short answers to somewhat broad questions that Ferguson poses.  However, this isn't necessarily bad.  What I liked about her methods was that they taught me how to read literature rigorously, once I figured out what she was looking for in response to her questions and on papers.  I think her methods are well suited to a class of freshmen who don't really know what they're doing when they read and interpret, so suck it up and accept that she has read these books more thoroughly than you and has had many years to hone her interpretations of them.  I agree that she does have a few favorites in class.  Make a good first impression!  I found her kind of intimidating, but I definitely learned a lot about the books we read and about how to read literature in general.  Though I'm not that interested in sociology, I would consider taking other classes with her to have her as a professor again.  Bear in mind that this is not how most of my Lit Hum class felt.  I think I ended up being one of the 'favorites,' so my experience was probably a bit different from other students'.  Speak up during the first few days of class to make a good impression and understand that she can be harsh when she thinks you're being pretentious, BSing or haven't done the work.  Also, if you haven't participated in a while she will call on you and you won't necessarily know what she's looking for, so take the initiative and participate when you think you have something thoughtful to say.  Your experience with her can be quite rewarding if you establish yourself well in the class.\nWorkload:\nStandard Lit Hum reading list, 3 papers (4-5, 6-7, 8-9), class participation, midterm, standard final\n"
        },
        {
            "course_name": "Food and the Social Order",
            "review_date": "February 04, 2009",
            "review_content": "\nThis subject of this class seems really interesting and then once you get a few lectures into the course, you begin to realize that Ferguson makes it rather boring.  Instead of focusing on things that we would find pertinent, you spend like half of a semester on how India developed a national cuisine.  This left me with one question: Who cares?  I agree with another reviewer of Ferguson in that she is pretty bias: she gives you the grade she thinks you deserve rather than what your work/ amount of effort shows.\nEasy midterm that tests basic concepts; the final is the same thing except longer.  \nParticipation counts which is bizarre since there doesn't really seem anything requires or benefits from a discussion.\nWorkload:\nShe goes over the readings in the class extensively so you don't really have to read them.  A midterm, final, final paper on a topic of your choice and participation counts.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 15, 2008",
            "review_content": "\nShe is certainly approachable and easy to talk to.  However, she is a very prejudiced grader.  You can only do as well as she thinks you can do which is rather unfortunate if you try any harder in her class.  If you are not looking forward to stress or frustration, do not take her class.  However, her lectures, not discussions, are very thorough, so if you take lengthy notes, you do not actually need to to the reading.  But that is not the spirit of the class.  \nWorkload:\n3 papers: the third one rather ridiculous, 1 midterm, 1 final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 28, 2007",
            "review_content": "\nIf you are a sociology major or have an interest, take her. If not, and are looking for a professor who will review the plot and implications besides those in a sociological context, stick with a Classics teacher. She tends to pick favorites too which could help or hurt. Easy workload but difficult grader.\nWorkload:\nEasy: 3 papers, some postings, midterm and final\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "January 17, 2007",
            "review_content": "\nGreat Professor.  Her class has an excellent Q&A; structure, so it's really easy to take notes.  She opens with a list of key words which you should look out during the lecture.  These are the same which you will be asked about in the tests.  The readings she assigns are very interesting and very relevant to Sociology.  Her lecture is so in point that sometimes you don't even need to do the readings, although they really help and most are really interesting/easy to read anyway.  You get to see all the main Sociologists and by the end of the course you will have a very good general idea of what the branch is about.\nWorkload:\nReadings for each class, book report, midterm, and final.\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "January 13, 2007",
            "review_content": "\nThe reading list seems out of sync: the hard stuff (i guess they would be the funadmental readings) are in the beginning. the easier readings are after the midterm. so for the first half of the semester, you may be clueless. But after all the repitition, you start to get it--sort of. the TAs are not out to get you, so at least you'll score reasonably on the tests if you attend class. the readings are all on courseworks, so that cuts down on the cost of books (you only need one book which was a great read--really). Her teaching style seems to strive for discussion, but because our class was so big, only a few people dominated the class while she seemed to be hunting for the right answer. Note: make sure you copy all the terms she writes on the board at the beginning of every class, those are the IDs for the midterm and final. then the TAs add a couple questions (3-4) in which you pick one to turn into an essay. Go to the TA review sessions (prepare a studysheet beforehand so you have questions ready). I think Prof. Ferguson would have liked a smaller class to engage in discussion of the sociological theories and the techniques of the founding fathers. Because the class was so big, it seemed she was just waiting for someone to 'get it'. \nWorkload:\nMidterm, one or two small (1-2 page)assignments, final, and final paper. (she grades only the final paper, the TAs make and grade the final and midterms). \n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "September 06, 2006",
            "review_content": "\nAs a sociology major, I speak with some authority when I say this:  don't take this class.  \nColumbia's sociology department is full of great introductory classes -- this is not one of them.  Sadly, it's the most popular intro sociology class and it's surely driving students away from a great department. \nA quick note: Evaluation of Evidence is the intro class to methodology.  Sociological Imagination is the intro class to theory.\nTo get a good taste of the fascinating subject that is sociology, take evaluation of evidence (josh whitford's class is great) -- it's the class that converted me (and many of my peers) into sociology majors.  I have yet to meet anyone won-over by Sociological Imagination. Or, if you want to see this class taught right, take it in the spring with the masterful Gil Eyal.\nStudents with previous coursework in sociology will enjoy this class, but most students will leave without a clue what sociology actually is -- the readings are interesting, but to the novice, the readings will seem random and pointless.  Priscilla does a really poor job of explaining why/how the readings are sociology and why we should care about the subject. \nWorkload:\nlight-medium.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 20, 2006",
            "review_content": "\nProfessor Ferguson is, as many other reviewers have said, a very nice lady. She was enthusiastic about meeting outside of class, very nice about being lenient about deadlines (which was very helpful for me), and (at least as far as I could tell) graded fairly. That said, I dreaded going to her class. While her efforts to stay on point were admirable, they meant that discussions were severely restricted. The most frustrating thing about the class was her ineptitude at facilitating discussion: she would often ask open-ended questions, and then simply disregard answers until someone gave the one she was looking for. Her teaching methods might, I imagine, work better in a lecture than in a smaller, discussion-based class. Also, the perspective Professor Ferguson offered on the (excellent, well-chosen) readings rarely required a particularly close reading of the text, nor did she step back and examine the implications of the text. The latter problem was particularly surprising to me considering her background in sociology.\nOverall, the class is fine, but not particularly stimulating. If you're really interested in gaining a deeper understanding of the books, find another teacher; otherwise, Professor Ferguson will be flexible, friendly, and available.\nWorkload:\nFairly light -- 3 essays, 3 (short) courseworks postings, an essay-based midterm, and the standard Lit Hum final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2006",
            "review_content": "\nI really like having lit. hum from the point of view of a sociologist. She's a really nice woman and i never wanted to fall asleep during her class. She takes time to explain what she's saying instead of rushing through it.  She was sort of an irradic grader on papers though. Im sure if you're a good writer she'd be a good teacher for you though\nWorkload:\n3 online posts for homework, 3 papers (5pgs, 7pgs, 9pgs)\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "January 16, 2006",
            "review_content": "\nThe readings were interesting, and the professor is nice, but this class just...dragged. She tried to make the 100 plus class a discussion, which failed miserably when nobody ever raised their hand to talk. This class is basically what you want to make of it. The readings are fascinating on their own, but most kids were busy on their laptops or...skipping. The midterm and final are easy, and the paper was graded generously -- just READ your actual book, and you'll be fine. Would recommend for an easy class, but not necessarily an enriching one. And if you never do any of the reading (which is definitely possible), GO TO THE REVIEW SESSIONS. The TAs are actually pretty helpful there.\nWorkload:\nReadings for every class (downloadable), midterm, One 10 pg. paper, one 2 pg. reading response, final\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "January 11, 2006",
            "review_content": "\nI couldn't stay awake. I mean honestly... I. Could. Not. She killed my interest in sociology. Every week, the lecture hall grew emptier as students realized that her lectures were a waste of time. I began to sit toward the back of the lecture hall, and from this vantage point I could clearly that most of the students who actually showed up were logging on to the facebook on their laptops. I certainly don't blame them. She basically summarized the reading in class and spent much more time than necessary discussing the obvious. This class went slowly.\nWorkload:\nYou don't have to do the reading. I didn't read anything after the midterm and only attended two-thirds of the classes, and still managed an A-. Go to the TA sessions right before each test; they will teach you all you need to know during that time. There is a midterm, an eight-page sociological review, and a final. The midterm and final were easy, and the paper was graded fairly.\n"
        },
        {
            "course_name": "Sociology of the Novel",
            "review_date": "December 11, 2005",
            "review_content": "\nWHY? Why did I take this class? Oh yeah...from the course guide, it looked thrilling. Man, was I wrong. Professor Ferguson seemed to ignore the most interesting talking points and instead focused on dull and dry material, rendering our discussions utterly devoid of any intellectual stimulation. I expected brilliant insights and instead got nothing but frustration. I found her disappointing as a professor. A real shame, because I came into this seminar with such high expectations and emerged having felt like I wasted my time.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 25, 2005",
            "review_content": "\nIt seems that if you have Professor Ferguson, you either hate her or her love her. I think I would not be wrong in saying there are a good amount of students that find her inspiring and she is very knowledgeable about the books we read in Lit Hum. She always provides us with background information and puts the texts into their social and historical context. Her style is quite distinct and she does at times ask pointed questions, but she is always interested in knowing what students think about the texts. She has an easy-going personality and a good sense of humor. She is not an easy grader, but if you put enough effort in, it really pays off. Discussion participation is vital.  If you're looking to be challenged, take the class. If literature isn't your thing and you are not going to read or even feign interest in participating, maybe you should consider changing sections.\nWorkload:\n2 postings, 3 papers, open book midterm (essay questions), standard final - usual for Lit Hum - some additional books to general syllabus.\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "January 09, 2005",
            "review_content": "\nPersonal curiosity led me me to take this intro to sociology class because I had never had any experience with the subject before.  While I enjoyed the discussion format of the class, I often felt that the readings were pretty dry.  Even if they were interesting, our class was not directed to inquire about the political and social implications behind the author's work.  A good first  class in the subject and a professor who knows what she is talking about.  The TAs are very helpful as well in that they lead several review sessions throughout the semester.  \nWorkload:\nA fair amount of reading, 6-10 page final paper, midterm and final\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "January 02, 2005",
            "review_content": "\nUnderstanding the key concepts is essential to getting by in this class. You don't have to read the excerpts from Marx or Weber or Durkheim... you just have to understand what they were trying to get across or what terms were most important to know. As a result, going to the class tended to be more useful than doing the readings on your own. \nI did find it impressive that Prof Ferguson wanted (and did) learn our names. She also didn't tolerate those kids who IM throughout class-- don't bring your laptop and expect to play games. Class could sometimes get annoying when the discussion was going nowhere or people were tired. By the end it bordered on tedious since no one cared enough to respond, and you could see her getting irritated. She trails off on the end of every sentence (you're best off sitting in the middle or front of the class if you want to hear her well). All in all, though, I liked her. She's friendly and helpful and really wants you to like the material. I definitely was able to learn some really cool stuff out of that class that I've applied or thought about outside of a strictly academic context.\nWorkload:\nSimple midterm and final, an easy final paper (in essence a book review of whatever you want). Readings that are useful if you want to understand what's going on in class, but usually just garnering a general idea from the TAs or your peers is enough to manage. I agree with the previous reviewer: a good way to ease into college coursewise.\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "December 22, 2004",
            "review_content": "\nAt first I was going to drop this class because I did not understand what was going on. After a while I got used to the style of the class and did not mind going since sometimes the discussions were somewhat interesting. Though the class is rather large, she managed to learn everyones name and would call on you if no one was answering her questions. I would recommend this class if you have a true interest in sociology. Otherwise you can find yourself falling behind in the readings, etc.\nWorkload:\nReadings for every class, some are quite long.1 midterm1 final1 posting1 paper (8-10 pages)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 05, 2004",
            "review_content": "\nBlah! There was not a single class that everyone was awake. She asked open ended questions and expected to get a very specific answer. Lots of blank stares, not because we hadnt read the texts, but because we had no idea what she wanted! Its lit hum, I guess you cant expect a stimulating high school english teacher...\nWorkload:\nIts lit hum... this section isnt as fast as others. 3 papers, 2 postings, easy midterm, and course wide final\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "April 28, 2004",
            "review_content": "\nAlthough I would not recommend this class, I think Prof. Ferguson's teaching style should not be confused with her qualities as a person. I found the presentation of the materials to be a liitle boring, but I took what I thought was valuable from her class and made the most of it. I found her to be very approachable and easy to talk to. A short 20 minute conversation with her during office hours made all the difference for me in terms of my understanding the contents of the class. Take the time to make a connection with her and I think you will find her to be sharper than what meets the eye.\nWorkload:\nMidterm, one 10 page paper, final. Reasonable reading load. A good transition into college class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 18, 2004",
            "review_content": "\nAll in all, uninspiring as a professor. Grading is fair (plenty of B+'s but rarely an A). She can get excited when she lectures, but rarely says anything new or interesting--you can get the same reading the books on your own.\nWorkload:\nThree five-page papers, three Courseworks postings, midterm may be open-book.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 17, 2004",
            "review_content": "\nI just want to say that Prof. Ferguson really isn't that bad. At the beginning, I really didn't like her, but I've become used to her style and it really isn't the coma inducing hell the other reviewers have described. Sure, it's pretty boring and we never get into the books that deeply, unless someone else makes an interesting comment of their own accord which doesn't happen very often. However, she is one of the nicest professors I've had here, especially if you talk to her outside of class, which she loves. She really means well and I think you have to give her the benefit of the doubt. I also want to say that it is not that hard a class if you actually put in some effort and I got an A- first semester and I know other people did too, so it is possible to get above a B. Do not despair if you get her for lit hum b/c this class is really what you make of it and you do still get to read some great books, excluding Thucydides and St. Augustine.\nWorkload:\n3 essays, 3 responses online, midterm (open book), final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 17, 2004",
            "review_content": "\nHORRIBLE HORRIBLE HORRIBLE teacher.  This was the worst class I have taken at Columbia.  Classes were totally boring and everyone was sleeping by the end.  Discussions were random and jumped around a lot.  Switch out of this class at all costs, if not it will be your worst experience at Columbia.\nWorkload:\nNormal workload: 3 papers, midterm (open book), final.  Grading is totally random.  Dont expect anything better than a B, ever.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 17, 2002",
            "review_content": "\nShe was awful. There's really no other way of putting it. The class was horrendously boring; we were all sleeping by the end of the class. She would ask random, open-ended questions that no one would answer because none of us had any idea what she was looking for, and then she would go off on some random, incoherent talk about French food. Completely uninspiring. Stay far away. \nWorkload:\nPretty normal - 3 five page papers, midterm and final. But her grading is completely random, and she rarely comments on why she gave you the grad she did.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 04, 2001",
            "review_content": "\nOk i completely agree with the previous rewiew. This was by far one of the worst experiences that I have ever had at Columbia. Not only was her grading absolutely random, her class discussions terrible, but she was not very open to ideas. A class like this just made me question the validity of Columbia's Core Curriculum!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 22, 2001",
            "review_content": "\nRotten rotten rotten rotten. She never seemed to know, or care, very much what she was talking about. Ferguson talked a lot about French food, but I don't remember really learning a whole lot about that, either. As for the books, ha. She's sort of dull and totally uninspiring. She appeared to admire one of the students (she even slipped once and told the class all about how she couldn't resist his big blue eyes) and encouraged him to talk until the rest of us had died from boredom (if that didn't happen while she was lecturing first).\nWorkload:\nPretty normal, 3 five page papers, but she's not an easy grader and doesn't comment a lot.\n"
        }
    ]
}