{
    "prof_info": [
        {
            "prof_name": "Liang Tong",
            "prof_id": 2626,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "December 10, 2012",
            "review_content": "\nBiochemistry is heavily encouraged and mandatory in some cases for different medical schools, so you'll be taking this class like it or not.  The course is co-taught by Tong and Stockwell.\nTong first: he made biochemistry an unpleasant experience--not because he is an awful person (he is kind of funny) but because he mumbles a lot during class time and expects us to memorize all of his slides (or this is the feeling I got as on his quizzes and midterm he literally changed one word and asked true or false).  We had 800+ slides for the midterm, and there was only 1 \"apply your knowledge\" question--the rest was straight up memorization.  He assigned a ton of textbook reading (the text was interesting) but I did not enjoy Tong's section at all.\nStockwell's half of the course was much better--he was clear, concise, and interesting.  Stockwell incorporated research papers into the course and I found Biochemistry to actually make sense.  Stockwell's quizzes (and in turn, final, I'm sure) incorporate more orgo which I like and his questions are easier to follow.  Stockwell made me enjoy the last 12 lectures, and made me love them as compared to the 1st.\nOverall, yeah, this course is nothing like Mowsh bio, but its definitely not a cake walk.  Good luck.\nWorkload:\n2 tests worth 44% each (1 per prof) and 8 quizzes with the top 6 scores counting for 12% (4 quizzes/prof).\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 19, 2011",
            "review_content": "\nHe is kinda dry, but not too bad, and def not as bad as the reviewer below me would have you believe. You do have to study a bit for the quizzes with an eye to detail, but everything that you need to know is def there. As for AA structure Stockwell doesn't really give it to you... he just never tests you on specifically recalling any of them because his half of the course wasn't focused on that stuff. The course is also curved really well with ~10% of the class getting A+.\nThat being said I was annoyed with Professor Tong on his midterm when he asked for the specific length of a hydrogen bond, but whatever that was only one question. Also as the reviewer below said, the TAs are pretty useless.\nWorkload:\nWeekly quizzes that you might have to study 30 min for at some point.\n1 midterm for his half and 1 midterm (non cumulative final) for Professor Stockwell's half. Both are very straightforward, and getting an A or Aâˆ’ shouldn't be that hard at all. \n\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 13, 2011",
            "review_content": "\nTong's half of biochem was frustrating, to say the least. Maybe this is just me, but I found it difficult to listen to his lectures because he lectured in a monotone and didn't enunciate very clearly (his accent isn't an issue, though). Even with a mic, it was easy to miss things he said. He made nominal gestures of caring, such as asking us whether he was covering things too quickly or slowly, but it was clear that he didn't really care about teaching.\nHe relies entirely on Powerpoint for his lectures. That in itself wasn't an issue; rather, it was his inability to actually teach and explain the material. One would think that the point of lecture is to clarify the reading material, but I often found that it was the other way around. To be honest, I think his lectures were rather superficial, and even superfluous, if one did the readings. (And there's a lot of reading in his section of the class, since he likes to cover a few concepts from each chapter during the lecture and then leave the rest - i.e., the majority - for you to read on your own.)\nThe good news is that he's pretty lenient. We only had to be able to recognize the structures of AAs, not draw them from memory. His quizzes can definitely be tricky, and he may or may not refer to the readings (so it's in your best interest to do them). I think the best way to study for his portion of the class is to take extremely good notes during lecture and religiously study the slides.\nWorkload:\nEach half of biochem has four quizzes and an exam. I thought his midterm was fair, although the questions were somewhat random. \n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "December 16, 2010",
            "review_content": "\nProfessor Tong's half of biochemistry made me want to stab forks in my eyeballs.  Dry doesn't even begin to explain his lectures.  He pretty much views teaching as an hour and a half of uninterupted 'let's talk about me' time.  It is all somehow linked to his research, which you didn't take the course to hear about.  He has an entirely different view of what you need to know compared to stockwell/  Tong makes you memorize the AA structure... Stockwell just gives it to you.  \nThe TA's are useless.  I went to a few review sessions, and I heard more 'I don't knows' to be comfortable using them as a resource.\nWorkload:\nWeekly quiz, but let's be honest, if you're undergrad, you've got a test every week if you're in this course.  You're not going to study for them, and you're going to fail\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "May 01, 2009",
            "review_content": "\nIf you liked orgo and appreciated biology, but thought mowschowitz was unnecessarily tricky, this is your class.  Tong is somewhat dry but makes it very clear what you need to know.  Stockwell is the man, he loves to talk about the beauty of metabolism.  His portion of the class is particularly straightforward and linear, as you go through the details of glycolysis, krebs cycle, etc.  Great for premeds looking for a straightforward and enjoyable senior science class.\nWorkload:\nquizzes every week or two, 2 tests (1 from each teacher)\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "October 18, 2006",
            "review_content": "\nHis jokes are bad, and they're one of the better parts of this class.  Tong doesn't really teach the class--he reads endless amounts of PowerPoint slides without explaining the material on them.  Understanding the material requires lots of additional studying and reading the textbook where needed.  But the trouble with this class doesn't end there--the quizzes and midterm require memorization of a lot of seemingly unimportant information.  Some quiz questions will basically ask you to remember one of the 70-80 PowerPoint slides he gives in a lecture for no other reason than that it was a slide--the material on that slide could be only marginally important to the rest of the lecture.\nThe bottom line: only take this class if you are 1) seriously interested in biochem and willing to teach yourself the material or 2) a pre-med student applying to one of the handful of med schools that require biochem as a prerequisite.  Otherwise, don't even touch this course with a ten-foot pole. \nWorkload:\nPretty much as mentioned in earlier reviews: 8 quizzes, midterm, final (which covers only second half material by Professor Stockwell).  Quizzes are 8 T/F and one drawing--questions can come completely out of left field.  Midterm is 38 multiple-choice and 3 drawings.  Midterm and final count for 44 percent of the course grade each, best 6 quiz scores fill in the remaining 12 percent.\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 04, 2006",
            "review_content": "\nThis course was divided into two halves.  In the first half, Tong covers proteins in biology.  He uses powerpoint presentations which are posted on courseworks before class.  He goes at a reasonable pace and covers some material covered in the intro bio class.  He always tries to include something to make students smile/laugh. In the second half, Stockwell covers small molecules in biology.  This half had a heavy focus on the organic chemistry of small molecules. Students are required to understand reactions, mechanisms, names of \"common\" molecules.    Stockwell uses overhead projections.  \nIf you are interested in Biochemistry, take the class. If you think you MIGHT be interested, think hard before taking the class. Lectures are not as entertaining as you might want them to be.  \nWorkload:\nThere is a total of 8 quizzes (4 per half) and you can drop your lowest 2 scores.  There are 2 exams - the midterm and the final.  You have to study for this class.  Slackers don't do so well. There is a lot of memorization.  The text books definately help, but some people study straight off of lecture notes and do fine.\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "October 18, 2005",
            "review_content": "\nProfessor Tong's half of the course (the structural biology part) is pretty dull. He has a sense of humor and throws in a joke or two, but his lectures consist of going through many, many PowerPoint slides (~60-80, all posted online) which will probably just put you to sleep, especially the ones on protein structure. Lectures tend to touch upon a LOT of material, but don't go into much detail, so you have to do most of the learning on your own. But the material is pretty cool and the textbook is excellent. My advice would be only to attend lecture if that's how you learn best--you certainly won't miss anything material-wise if you skip (not as true for the 2nd half of the course). If you need help with anything, there are office hours and optional recitations, but I don't think either are necessary.\nWorkload:\nLight. 8 quizzes (true/false questions + 1 free response) over the course of the term worth 12% of the grade (lowest 2 dropped). 2 exams worth 44% each (1st exam is all multiple choice, not sure about the 2nd). Questions can be obnoxiously arbitrary and you have to pretty much memorize EVERYTHING on the PowerPoint slide to get them all, but this is really not worth doing.\n"
        }
    ]
}