{
    "prof_info": [
        {
            "prof_name": "Ondrea Ackerman",
            "prof_id": 2933,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 17, 2006",
            "review_content": "\nOndrea is bizarre but awesome. Take her class.\nAlthough she is often moody, erratic and unpredictable, she is very interesting and always willing to help you out. \nShe has this incredible ability to know exactly what is wrong with your paper and she knows how to articulate how to fix those problems.\nHer selection of reading assignments was fantastic. She really emphasizes post-modernism, which is totally cool and makes for awesome and invigorating class discussion. \nBut the reading assignments and the papers are essentially all the work there is to the class - it's not a lot of work, it's a lot of abstract, bizarre thinking.\nI took her class thinking I was an awesome writer and that UW would be a cake walk. Thank god I had Ondrea to shut me down and humble my ass. Some of these papers were ridiculous and because her reading assignments all relate to post-modernism in some way, though they rarely speak to each other, Ondrea's students have a tough time with the lens and the conversation essay. But, her students probably learn how to write more intricately. \nHowever, I'd say she grades pretty leniently.\nDon't be late for her class, and always do the reading (everything we read is fascinating). Go to her office hours, she is always willing to help you out.\nWorkload:\n25 pages or less of reading a week, 5 pg lens essay, 5 pg conversation essay, 8 pg research paper, easy 3 pg retrospective essay. Ondrea did not use the portfolio method when I had her (thank god!)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 04, 2006",
            "review_content": "\nI entered UW in spring 2006 with the expectation of hating it, but in the end I found that I learned a lot.  The course sharpened my analytical skills and ability to integrate outside sources into papers.  Ondrea is a very capable instructor, chooses interesting essays to read, and gives good feedback on papers.  Class discussion was awkward at times, but I genuinely enjoyed it once we all became more comfortable with one another.\nWorkload:\nStandard UW fare.  Address the comments she writes on drafts and there's ample opportunity for a good grade.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 04, 2006",
            "review_content": "\nI entered UW in spring 2006 with the expectation of hating it, but in the end I found that I learned a lot.  The course sharpened my analytical skills and ability to integrate outside sources into papers.  Ondrea is a very capable instructor, chooses interesting essays to read, and gives good feedback on papers.  Class discussion was awkward at times, but I genuinely enjoyed it once we all became more comfortable with one another.\nWorkload:\nStandard UW fare.  Address the comments she writes on drafts and there's ample opportunity for a good grade.\n"
        }
    ]
}