{
    "prof_info": [
        {
            "prof_name": "Hany Guirguis",
            "prof_id": 2755,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "January 07, 2007",
            "review_content": "\nSometimes hard to understand.\nHas extremely small handwriting on the board so it's usually hard to see.\nMandatory attendance (it's part of your grade).\nDoesn't entertain stupid questions, which btw you will have since you're not going to keep up with what he's saying.\nIt seemed better than the other class (Yu Zhang) since I could understand Hany more. Maybe it wasn't.\nGoes over problems in the textbook.\nDon't expect much.\nWorkload:\nA few (3-4) of announced quizes and a few hw's (4?). Long Midterm. Final not cummulative (just Finance). You can do well if you study and go over the problems he went over in class.\n"
        },
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "May 22, 2006",
            "review_content": "\nThe course is divided into two parts:  Accounting and Finance.  We spent too much time on the Accounting part that we didn't cover enough Finance.  But the course is still demanding nevertheless.  I strongly suggest that you get the solutions manual to both textbooks.  They'll help immensely.  But the questions he uses on the exams aren't always similar to the problems found in the texts.  The accounting part of the course is fairly easy and you should do rather well if you do all the problems.  The finance part is more challenging and I suggest going to class for those topics.  Definitely keep up with the work.  His lectures sometimes seem theoretical and lacking in relevance.  Also he spends a large part of the two hour class slowly going over problems in the texts.  And I mean slowly.  Not everyone went to class and you might still get a decent grade if you didn't go either.  Going to recitations can be helpful too, but remember the questions may not be the same on the exams. We only had one Homework assignment, but 5 quizes. Pay attention to information he sends you through e-mail because they'll most likely show up on exams.  Good Luck.\nWorkload:\nHomework - 1 problem set.  5 quizes.  Midterm/Final\n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "December 24, 2005",
            "review_content": "\nOverall not great. Corporate Finance is naturally pretty dry, but this class was brutal. Prof. Guirguis is very smart and qualified. However, the 2:45 Monday night lecture was pretty grueling both for him (who seems to have a day job) and for us. The class was in the hottest room in IAB (temperature wise) so everyone wanted to take a nap. Also, Prof. Guirguis just blazed through Excel spreadsheets showing us how to do different things which were, when done by hand, computational nightmares. There is no homework in the class and only a few quizzes which count for 30% of your grade. There is also no recitation. So you're pretty much given handouts, a textbook, one 2:45 minute lecture a week, and sent out in the cold to learn a lot of the stuff on your own. Also, there is no curve in the class -- you get whatever your number average is. Thus, he only gave out about 20% A-range grades -- quite a bit worse than your average economics class.\nWorkload:\nA quiz every few weeks (30%) Midterm (30%) Finall (40%) Not a lot if you just want to get by, a significant amount of independent work if you want an A.\n"
        }
    ]
}