{
    "prof_info": [
        {
            "prof_name": "Anna Della Valle",
            "prof_id": 1136,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "International Economics",
            "review_date": "December 04, 2005",
            "review_content": "\nExtremely personable face-to-face, but a bit rambling and unclear in the lecture.  The blame partly lies in the size of the class, 200+ students. With a class this big, in Altschul auditorium, it's difficult to keep students engaged.\nThis one time, she spent about 50 minutes on a slide show of the Italian highway system. Somewhat interesting? Germane? Doubtful. The saving grace has to be the recitation sessions, which are composed of about 20 students, and where you can actually ask questions and deal with the quantitative part of the course. \nWorkload:\nThe problem sets you do every week with your groups can take up to 3 hours, or more, to work out. Not because they're difficult, but because they're group projects. Look at the UN.\n"
        },
        {
            "course_name": "International Economics",
            "review_date": "December 21, 2004",
            "review_content": "\nAlthough I initially didn't like Prof. Della Valle, as a person I warmed to her quite a bit. She really makes an effort to be helpful and available to the students. However, a good effort does not make a good professor. She is not very good at teaching. Often her explanations are confusing and unhelpful. I found it generally  easier to learn the material on my own than get confused in class.\nShe does work hard, so hopefully he teaching skills will improve somewhat.\nWorkload:\nRelatively light\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 21, 2002",
            "review_content": "\nProfessor Della Valle is a genuinely nice human being. Her lectures, when they stay strictly on topic, can be quite boring, but she knows this, and tries to stray into interesting, useful material as much as possible. Spontaneous lectures on \"Why this whole Enron thing matters, anyway\" and \"I disagree with the textbook here, because...\" kept me from falling asleep. She doesn't rely on lecture slides, and tries to make it clear what you really need to know for the final. Finally, the best part of this class is that, in a traditionally conservative-only department, Ms. Della Valle is a LIBERAL. Or, that is to say, more liberal than most of her colleagues. Instead of regarding conservative economics as heaven-sent, she examines both sides of most issues, exposing her mom-like ideals and her Italian-Canadian heritage in the process. Overall, not bad for a class designed to turn us all into Republicans.\nWorkload:\nPretty light. Short problem sets once a week (The answers are basically given in recitation, though attendence to recitation is voluntary) One midterm on micro, One final on macro.\n"
        }
    ]
}