{
    "prof_info": [
        {
            "prof_name": "Christel Kesler",
            "prof_id": 12169,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Methods for Social Research",
            "review_date": "January 17, 2017",
            "review_content": "\nVery good professor. She was my most enthusiastic lecturer that I've had so far, and I really enjoyed going to her class (I took Methods for Social Research with her). The writing assignments for the class are reasonable and educational. My only gripe is that I wish we did more work with the readings (i.e: if you're going to assign 3+ hours of reading a week, at least give students a good chance to show that they've read it). I didn't really like the haphazard nature of the pop-quizzes. But other than that --- she really is an excellent lecturer and I'm glad that Columbia has her hired. \n\nWorkload:\n3 papers, one of which uses a coding program. \n"
        },
        {
            "course_name": "Methods for Social Research",
            "review_date": "January 11, 2017",
            "review_content": "\nI am deeply baffled by the claims that Professor Kesler \"doesn't care at all about her students\" and \"assumes that everyone knows her overly excessive complicated vocabulary.\" She is both a passionate sociologist and that rare, rare species among professors, an actual teacher. I loved her and this class.\nProf. Kesler lectures clearly and systematically, listens to and then actually answers questions, and works heartbreakingly hard to help everyone understand the material. If her class was ever boring, it was because she made people feel comfortable asking stupid questions, which she answered with impeccable patience. This was my first sociology class, and I didn't have any trouble keeping up. Also (despite being a quantitative researcher who does data analysis in depth), she explained the statistics concepts we used so that they were accessible to someone who has never taken stats.\nWe learned a little bit of R (statististical software) for data analysis, which I found super empowering. The Empirical Reasoning Center is your friend--go get help, don't spend hours trying to find a programming glitch and getting nowhere!\nI took this class as an Urban Studies senior to inform my thesis and was able to double-use some of the projects for my thesis research. Without that, this would have been a really heavy workload--but the projects are spaced out manageably and should be fun if you're excited about doing social research!\nWorkload:\n\"pop\" quizzes on readings (doable if you skim), and quizzes on sociological concepts with lots of warning\n1 ethnographic paper requiring two observations with a partner\n1 interview paper requiring two interviews\n1 data analysis project using R\n1 final project requiring an original survey or experiment\n"
        },
        {
            "course_name": "Comparative Perspectives on Inequality",
            "review_date": "April 22, 2016",
            "review_content": "\nI found Professor Kesler to be a great lecturer. The class itself was very informative about inequality in the United States. While we didn't get to delve very deeply into all of the subjects, it was a great overview of how the US compares to other countries in terms of socioeconomic, class, race, gender, healthcare, and other forms of inequality. Professor Kesler uses PowerPoint slides in lecture that are very organized and helpful for tests, and she is very open to helping students. She seems to be very kind and to care about the students and their opinions a lot.\nThe class has a pretty solid amount of reading, but it's not necessarily imperative that the reading gets done. There are activities in class that center on the readings, but they usually involve group work or opinion responses and are only graded for completion. I found most of the readings interesting anyways, so I enjoyed doing them. There are two relatively short research-based papers, and Professor Kesler offers a lot of help with them. The midterm is take-home but you have to do it during the class period (submit it online and take it wherever you want with open-notes). It wasn't awful. The grading is done partly by Professor Kesler and partly by the TA, and I found it to be very fair if not somewhat generous.\nOverall, I would definitely recommend this class if you are considering sociology or interested in learning about inequality in the US. It definitely broadened my perspectives and made me interested in sociology. \nWorkload:\nAbout 40 pages of reading a week and reading-centered activities in class\nTwo short research papers\nOne open-notes take-home midterm\nFinal\n"
        },
        {
            "course_name": "Comparative Perspectives on Inequality",
            "review_date": "April 22, 2016",
            "review_content": "\nI found Professor Kesler to be a great lecturer. The class itself was very informative about inequality in the United States. While we didn't get to delve very deeply into all of the subjects, it was a great overview of how the US compares to other countries in terms of socioeconomic, class, race, gender, healthcare, and other forms of inequality. Professor Kesler uses PowerPoint slides in lecture that are very organized and helpful for tests, and she is very open to helping students. She seems to be very kind and to care about the students and their opinions a lot.\nThe class has a pretty solid amount of reading, but it's not necessarily imperative that the reading gets done. There are activities in class that center on the readings, but they usually involve group work or opinion responses and are only graded for completion. I found most of the readings interesting anyways, so I enjoyed doing them. There are two relatively short research-based papers, and Professor Kesler offers a lot of help with them. The midterm is take-home but you have to do it during the class period (submit it online and take it wherever you want with open-notes). It wasn't awful. The grading is done partly by Professor Kesler and partly by the TA, and I found it to be very fair if not somewhat generous.\nOverall, I would definitely recommend this class if you are considering sociology or interested in learning about inequality in the US. It definitely broadened my perspectives and made me interested in sociology. \nWorkload:\nAbout 40 pages of reading a week and reading-centered activities in class\nTwo short research papers\nOne open-notes take-home midterm\nFinal\n"
        },
        {
            "course_name": "Methods for Social Research",
            "review_date": "November 19, 2013",
            "review_content": "\nTook this class as a sociology major requirement. The class is just as titled goes through explaining the various strategies and processes sociologists perform in research and sociological studies. Professor Kesler is very knowledgeable in the subject but assumes that everyone knows her overly excessive complicated vocabulary. She is dry boring lecturer answers questions but somehow you end up more confused about the material. She has lecture slides, online after each lecture, that sort of simplifies all she talks about in class. There was a discussion section where the TAs worked to reinforce the material just for the major project assignments. There are heavy heavy readings for each class that will be quizzed on(quizzes not much of an issue though as range 2 to 10 simple questions max) The difficulty and frustration out of this class mostly came from the 4 major written assignments. Although they seemed straightforward there is sooooo much I mean soooo much work that goes into completing each of the projects(thankfully had option of group collaborations with some of them). But if you work moderately hard at it you can survive the class.\nWorkload:\nHeavy workload.\nOriginal Research Exercises(80% of final grade)\nClass Participation-Show up for attendance(10% of final grade)\nQuizzes(5% of final grade) \n"
        }
    ]
}