{
    "prof_info": [
        {
            "prof_name": "Maria Cueto",
            "prof_id": 12805,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "March 07, 2014",
            "review_content": "\nDuring the very first class at precisely 11:39am, Cueto rushes into the classroom with damp hair, notes and chalk in hand. She looks at her watch as she frantically erases the 9 boards in Math 207. This short Argentinian woman wastes no time in getting down to business as she runs through 1.5 sections of math at break-neck speed. Your questions will be answered; but they better be well thought-out. Everyone once in a while she'll throw in a little bit of humor, but math is just about the only thing that's talked about.\nAfter the first midterm, I dubbed Cueto, Ms. Concept because her first test was shameless in stripping you of any procedural knowledge you might have gleaned from the homework, revealing that you actually don't know how to define that plane between those oh-so-tricky orthogonal lines. The average was a 73. The second midterm had an average of 59. The final's average wasn't divulged. The tests are hard and not for the faint of heart; review ALL lectures, notes, and homework and do the practice midterms and finals with a time constraint and without the solutions. Some test questions will be like the homework, but others will seem familiar, yet scary. Write out as much as you can because pity points exist- and can mean the difference between being above or below the average. For all the trauma, Cueto still had some redeeming qualities when it came to her tests; after I bombed the first midterm, I went to office hours and she offered to go through the entire test and answer any questions that I might have.\nBut the grades! You want to know about the grades? I made a 39 on the final and finished with a final grade, \"B.\"\nSo you couldn't land Hom's Calc III. Don't feel so bad. Cueto is decent, but not great. She's probably better than Nutz, Urban, and Drewitz combined.\nWorkload:\nHomework- 20%\nMidterms- 20% each\nFinal- 40%\nHomework is do-able except for some of the challenge problems she throws in occasionally. Sometimes she'll also include an extra-credit problem.\nTests are hard. Study up, get sleep, memorize the formulas, and focus on the concepts.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 25, 2014",
            "review_content": "\nCueto seems nice enough and she really wants her students to understand concepts and theory. She covers a little bit of material that other Calc 3 classes don't cover (ie. cylindrical and spherical coordinates) and I think that scared off some students the first day.\nHer handwriting can be a little tricky to read at times, but overall is not bad. Sometimes she explains things in a way that is more complicated than necessary, and the textbook seems to be a lot clearer and is a great resource, although she does follow the textbook pretty closely.\nThe homework is straight from the textbook and pretty straightforward. It's out of 10 points with 3 questions graded fully and some credit for completion. She does offer the occasional bonus question on homework for extra credit, which is nice.\nThe midterms can be difficult, but they stick pretty closely to the practice midterms, so if you do those and understand the solutions, you should be fine. Final was pretty challenging.\nWorkload:\nManageable\nWeekly homework (11 total) w/ lowest score dropped and the occasional extra credit opportunity.\n2 midterms that are difficult but pretty close to the practice midterms.\nFinal was difficult.\nOverall her tests definitely seem harder than other Calc 3 teachers from what I've heard.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 11, 2014",
            "review_content": "\nPros:\n- She is generally nice and her English and writing is mostly comprehensible\n- Homework is annoying as expected but it's pretty easy and straightforward\nCons:\n- I spoke with other friends in Calc III and Cueto's tests are by far the hardest\n- She doesn't really give a great description of the information and expects the students to know everything, and when you have questions, she will sometimes answer them condescendingly, as if there is no reason in the world anyone wouldn't get the question right the first time.\n- Tests are usually impossible, final is quite difficult\nWorkload:\nModerate\n12 Problem Sets, Two Midterms and a final\n1st Midterm: Easy\n2nd Midterm: Hard\n3rd Midterm: Harder - Challenging in the worst of ways and with a fair amount of time pressure \n"
        }
    ]
}