{
    "prof_info": [
        {
            "prof_name": "Adam Kosto",
            "prof_id": 699,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "CC",
            "review_date": "July 28, 2015",
            "review_content": "\nhe was a legend bro\nWorkload:\na lot \n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "December 20, 2014",
            "review_content": "\nI came in thinking this class might get a little dry at points, but it was actually pretty interesting the whole way through. Kosto did a great job of interspersing fun anecdotes and mini-activities (like simulating a medieval “ordeal” to determine whether or not someone was a witch in class) to illustrate the topics he was talking about, and his genuine passion for the subject he teaches was infectious and made me smile every time I came to class.\nKosto is the nicest guy and was helpful in office hours whenever I went. He was always open to questions during lecture, and made the class very non-intimidating for people who didn’t know much about the early Middle Ages.\nThe readings for the class were mercifully short, super useful, and (for the most part) pretty interesting. Kosto and our TA, Ethan, also did a great job of guiding us through the entire process of writing our term paper, implemented preliminary proposal deadlines and making themselves available to help with brainstorming topics and ideas in office hours.\nReally good intro history course.\nWorkload:\nGenerally no more than 40-50 pages of reading per week\nTwo very short papers analyzing readings\nOne 10-page term paper (research required)\nMidterm\nFinal\nRequired discussion section\n"
        },
        {
            "course_name": "Laws of War in the Middle Ages",
            "review_date": "May 17, 2010",
            "review_content": "\nKosto is brilliant. Though he may seem abrupt and assumes you have substantial stores of knowledge about the period, he is more than willing to help a lost or dazed student. When I went to him with help on my paper, he was quick to offer numerous primary source recommendations once I told him my area of interest, and sent back my rough draft within 2 days. His love, nay exuberance, for the material is contagious. Though the first half is a tad dry, the classes following the midterm were brimming with French accents and knightly impersonations. He draws on the primary sources frequently during his lectures and will often want to discuss them with the class. ** Make sure to do the readings- or at least the primary sources** If there is one thing he wants you to learn from this class, it is how read a primary source, and read it well. Some of the texts are more interesting than others, but focus on what seems important and what he talks about in lecture. His tests were difficult and you certainly had to know your stuff, but like he said, he is testing what you know and not what you dont know. If you go to class and do the readings you should be fine.\nWorkload:\na lot of readings, 2 papers (5 pages), 2 wiki postings, midterm and final\n\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 22, 2009",
            "review_content": "\nKosto seemed pretty cool the first day. He started class with an \"Anything Goes\" tune which was pretty original so I thought he'd be alright...boy was I WRONG! First off he makes you read three additional long readings aside from the already heavy CC syllabus. Some discussions are interesting, some are pretty boring. He really digs into these texts and makes these connections that aren't really there and in a way that is just irksome. Aside from that, he is a very hard grader on papers. To begin with, the topics are hard and twisted and then he gives you a list of all the grammatical problems that are wrong with your essay (reminder, this guy is a HISTORY teacher). You can spend days on your essay and you still won't get above a B+. I'd say the only positive thing about this class is that participation is like 35% of the grade...but if you wanna get an A for that you better read every text and talk his ear off. The second worst class I've taken at Columbia.\nWorkload:\n120 pages per class, three papers, midterm, final. Absolutely no homework after the first three classes.\n"
        },
        {
            "course_name": "Laws of War in the Middle Ages: Seminar",
            "review_date": "May 14, 2007",
            "review_content": "\nAt first I didn't like Professor Kosto. His teaching/speaking style (if you can call it that in a seminar) is rather abrupt, and he often assumes that you know more than you do about current scholarship - which I suppose is fine for seniors, but as I'm a freshman it made the course difficult. As we began to write term papers, though, Kosto showed his helpful side. He was willing to suggest good source material and read several drafts of papers. The subject for this seminar was a rather nebulous one, so while I can't say I learned much (I learned that the topic was nebulous, for example, and how to do Chicago style citations of journals) I can say that the time I spent on this course was not a waste.\nWorkload:\nMultiple readings each week, one presentation on a modern scholarly work, 20-25 pg term paper.\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "January 08, 2006",
            "review_content": "\nI agree with the previous review in that Kosto teaches this course in a discontinuous style. His thematic approach to the material is unusual. Some students may find this approach welcome and effective.  I found it difficult to reassemble the material chronologically to discern historical trends and causal relationships.  Despite this criticism, I was surprised and pleased at the amount I learned during the semester.  I dislike KostoÂ’s approach yet, I have to admit, his teaching style may be valuable and refreshing to some students.  Kosto has an engaging, enthusiastic lecture style.  His generational specific asides amuse some, but appear gratuitously juvenile to others.  I was as impressed with his scholarship as he is.  He generously shares his passion for primary source documents and manuscript study with his students, and a course with Kosto can be valuable for all who are interested in historical research of any kind.  More than a course on the Middle Ages, this is a boot camp for primary source analysis.  The TAÂ’s (Carlos and Alaine) were mature, focused and task oriented.  I found the discussion sessions to be unusually valuable and was disappointed when they were discontinued mid semester. Carlos and Alaine were a grounding counter-balance to KostoÂ’s thematic lectures.  I did not feel their grading was unfair.  I do agree it was tough.  I learned a lot from both the TAÂ’s and, for me, they saved the semester.\nMany students like Professor Kosto a lot.  He loves his material, is committed to teaching, his lectures are well organized, and students leave his class with a strong set of tools for research and analysis.  He seems to genuinely like young people (beware older GS-ers), and has a disciplined, yet open minded approach to his material. He does have Â“favorites,Â” students who he knows their names and respects and answers their questions. Everyone else will get brushed off fairly rudely.  This does not detract from the value one can glean from the class.  I am glad I took this course despite my discomfort with his thematic approach, and that I just disliked Kosto personally. You may well have a \"Captain, my Captain\" experience with Kosto like some students do. I cannot deny that he is a valuable educator and I learned a lotÂ…that is the whole point. A course with him will serve any prospective history major well. \n\nWorkload:\nReadings: Light. Primary souces and supplementary text. Mid-term, Final. Short analysis exercises. Term paper (10 pages) analyzing primary source of choice. Not heavy workload, but they expect a lot. A's are possible.\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "December 21, 2005",
            "review_content": "\nThe salient facts of my 1061 Early Middle Ages experience are its discontinuity and unfair grading. These are salient because they are bad. The class itself was not. Despite presenting the material in a discontinuous fashion, Kosto was a good lecturer. He is generally excited about the material and has an amiable demeanor (which I think is a clear source of bias, possibly fair, in his favor). As for the TAs, Alain is an equally amiable fellow and did an excellent job in leading discussion (albeit a horrible job of reading papers). However, I think Kosto needs to review his grading policy. He has, or certainly the TAs say he has (to cover their backs for giving low grades), a \"you need to be special to get an A\" policy. It was specifically couched in the terms \"is against grade inflation.\" Now I don't think these are necessarily bad ideas, but, Kosto and his TAs need to work much, much harder if they want to implement them fairly. There were almost no comments on my final paper or mid-term and the ones I received were positive. I got a B. I am very bitter. On this account, I would not reccomend this class to most people. The only people who I would reccomend it to are those who will go to office hours regularly. This at least, might get them to read your paper.\nFinally Kosto's implementation of the grade policy is methodologically incorrect. You don't stop grade inflation by reducing A's and increasing B's. If the course were done objectively, a 1/3 the class would have gotten below C and failing.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 07, 2005",
            "review_content": "\nAmazing. Kosto is brilliant. As someone else put it, Captain Kosto steers the class through some of the most obtruse and influential texts of western civilization. He never lectures, but intervenes if the discussion gets off topic. If you have CC with him, you are going to learn. But Kosto doesn't take any crap. So you better read, participate in class, and work your ass of on papers and exams. Kosto knows the main argument of every book we've read by heart. He is an expert in medieval philosophy, so careful laughing at Augustine...\nWorkload:\nThree papers, midterm, and final. All fairly graded. Fair as in the class average is C. Kosto is a good teacher, which involves being a hard grader.\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "December 24, 2003",
            "review_content": "\nA very solid class. Prof. Kosto is a pretty good lecturer. He has a very good understanding of the overarching social, political, religious and economic developments that occur over this 800 year period and conveys it very nicely in lecture. He weaves together this very rich period of history, full of migrations, identity formation,  the interrelation of the developments in Byzantium, Persia, Islam, and the West in a masterful way. Go to lecture. The readings are OK. I wish the textbook were a little more factually involved but it still gives an excellent feel for the trends and movements of the Early Middle Ages. The primary sources are great too. This is a 1000 level history course -- so be prepared for being pegged on footnoting and bibliography issues. I wish it were less a class on developing critical  analysis skills, but then again it is a 1000 level course and for those who havent acquired such skills a course like this is necessary. The TA sections are OK -- not great. The TAs do tend to grade a little harshly but whatever -- if you dont care too much about maintaining a sparkling 4.0 GPA but do care about learning, take this class. You will gain a deep insight into what happened to the late Roman Empire, the rise of Christianity and the Papacy, the \"barbarian invasions\", impact of Charlemagne upon Europe, the impact of Islam upon Europe, the birth of feudalism and much much more. Take it. Kosto will make it worth your while.\nWorkload:\nNot bad at all. 7-10 pages of text-book reading/week. 20-40 pages of primary source/week (usually on the lower end). one midterm, one final (as opposed to two), one 8-10 page term paper, plus two 2 page writing assignments.\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "December 18, 2003",
            "review_content": "\nProfessor Kosto- great.  Early Middle Ages- boring as hell.  TA's- difficult and unfriendly.  So, despite Kosto being wonderful (which he is, look at all the other reviews!) this class is definitely not worth it.\nWorkload:\nnot much reading, but hard to synthesize everything for the extremely hard midterm and final.  a couple of idiotic assignments and one longer paper\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "December 08, 2003",
            "review_content": "\nI truely found Kosto to know a lot, but he treats his students as if they were freshman in high school.  I realize this is a thousand level course, but teaching students how to write a thesis sentence, read a primary source, and write coherent sentences takes up a large junk of time.  His lectures are EXTREMELY organized.  You'd have to be an idiot to not know what was going on.  He writes everything on the board, as a high school teacher would, in outline form.  He has an excellent sense of humor.  His view of history is to question everything and look at everything in the context of knowing the people in history really didn't know what would happen next.  These points are stressed.  If you only study notes, expect a B- to B+ in his class, if you want better, take notes on the readings, divide the readings up with friends, and kiss butt to your TA.  I did fairly well, but if I had to do it again, I would probably not take this course.  Take a Bulliet.\nWorkload:\nVery doable, TA's grade harshly, know nothing, and the section is beyond boring.  I think this man, liek Brinkley is worried about \"grade inflation\" so rarely does one get an A.  Really, unless you aren't a history major or really feel like having a frustrating semester, dont' take this course.\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "December 07, 2003",
            "review_content": "\nIf you have any interest in history take Kosto's class. The man is brilliant, engaging, and makes the time period (about which I knew nothing and you probably don't either) come to life. His lectures are well organized and make you want to stay awake. At times, he'll turn the fairly large lecture class into a discussion, which is cool. He wants his students to learn how to be historians--there's a lot of emphasis on using primary/secondary sources. This might be the best class I've ever taken at Columbia.\nWorkload:\nFair and worth your while. Reading is relatively light. Two short (2-3 page) papers/assignments and an 8-10 page term paper on a primary source. Midterm and final. Section.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 15, 2003",
            "review_content": "\nProf. Kosto is not only a brilliant person, but he is also an extremely talented teacher.  He makes CC comprehensible, challenging, thought-provoking and absolutely worthwhile.  He implicitly guides class discussion with his interesting questions, thoughtful comments and sardonic wit, making sure that everyone stays involved.  He has been known to play Cole Porter songs and to ask the class to explain their significance in relation to the CC syllabus.  He is always willing to discuss paper topics and to read drafts, and he takes the time to write detailed comments on both style and content.  Above all, Prof. Kosto encourages students to move beyond textual analyses so that they may develop their own opinions of each philosopher's work.  It is rare to find such an all-around great professor.\nWorkload:\nHe makes a few important additions to the syllabus.  Three papers, midterm, final, presentation. Class participation is key.\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "April 21, 2003",
            "review_content": "\nA great professor.  Very engaging in class, weaving in student comments with his own meticulously prepared lectures.  He outlines each class on the board before he begins, which helps you to get a sense of what you should be taking away from each class, since there is a great deal of information--a little too much to process--nonetheless, the themes are well drilled.  A primary goal of Kosto's is to teach the class how to read primary sources, and the skill is a major theme on midterm, final, and term paper.  This is an excellent class to take as intro to college history because of the training given in primary source reading.\n    Very animated and friendly during class and afterwards for questions, but curiously distant (surly, peut-etre?) during office hours.  Prefers email.\nWorkload:\nReading for sections can be a little lengthy and repetitive (since almost all the work is in primary sources, such as monk's rules), and there is a large but not abusive amount.  Difficult midterm and final, 2 or 3 short papers, 8-10 term paper written on a chunk of primary text.\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "January 14, 2003",
            "review_content": "\nA terrific class.  Kosto is a great lecturer: organized, brilliant, engaging, open to questions, and often funny.  His efforts to turn our medium-sized lecture (about 50 students) into a discussion were actually effective (and interesting) because he could lead it so well.  The class is preoccupied with the process of being a historian (the \"questions\" of history, the use of sources) as much as the material of the period itself.  He chose to lecture on specific, important topics, instead of trying to cover the entire period in lecture (a much more effective way to teach the course, I think).  All in all, I can't think of a single class that Professor Kosto could teach that I wouldn't consider taking.  He expects a lot of his students, but it was definitely a positive and worthwhile experience.\nWorkload:\nReasonable.  Two short papers/exercises (about 3 pages each).  8-10 page analysis of a primary source.  Midterm and final.  Grading is not easy, but it is definitely fair.  Except for the relatively easy textbook, nearly all readings are primary sources, and they are usually not long, but important to keep up with.  A mandatory weekly section, which becomes more biweekly and less weekly as the semester progresses.\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "January 10, 2003",
            "review_content": "\nGreat Course, Great Professor.  Its the type of course that takes a large section of history and really gives a great overall sense of what happened -- all the while reading a selection of primary sources, doing yoru own analysis of contemporary secondary sources -- and sitting through engaging and DENSELY PACKED lectures.  \nUtterly and absolutely worthwhile.  Prof. Kosto is an open yet critical professor -- he'll take what you say seriously, but will make sure its plausible.  All that, AND he's a nice guy.  \n\nWorkload:\n1 3 page paper analyzing a contemporary secondary source. 1 1 page historical puzzle.  One 10 page paper.   Moderate reading.  All worthwhile.  No fluff\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "December 17, 2002",
            "review_content": "\nI would just like to concur with all the previously submitted positive reviews of Professor Kosto. \nThis man is interesting and funny and engaging. \nHis class taught me for the first time how to approach history by dealing mainly with primary source material and emphasizing interpretation and possibilities rather than \"facts\" and \"right answers.\" Be careful though - this class won't hold your hand - it's worth it to keep up on the reading! And don't slack on the textbook readings - they become important when you're being tested and have to actually place the lectures and discussions within a chronology of some sort. \nAlso, there is time set aside in many lectures for class discussion which is not so fun if you haven't read!\nWorkload:\nManageable reading. Mandatory weekly sections. \nTwo really short papers due in section and a final research paper. Midterm and final exams.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 13, 2002",
            "review_content": "\nAWESOME professor! in my four years at columbia, professor kosto's class still remains my favorite. how often will you have a class where the professor is the one who has to tell the students to leave when time's up because they're so involved in the discussion? he doesn't lecture the whole class (which is how a core class should be!), but what he does say is golden. don't go for the easy A cuz you won't get it...go to be challenged and to learn! \nWorkload:\n3 five-page papers, midterm, final. standard for a CC class\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 05, 2002",
            "review_content": "\nHORRIBLE GRADER!!!!!!!! ok, if you are still reading then you should take his course. i dont know if he is in fact a horrible grader (though we didnt get our final grades back yet, it is clear that he is at worst a fair grader--you will not get an easy A). You should not take his class if you only want an easy grade, you should take his class if you want to learn cc well. The class is all discussion with some streering by captain kosto. He is very big on tying the whole curriculum together, and you will learn to appreciate the collection of works chosen. He adds a few books here and there, but these additions really focused and enhanced the traditional curriculum. I really enjoyed this class (i stayed awake and i am usually a doodle-or-fall-asleep-fuseas type of kid) and took a lot away from the discussions. overall, i highly recommend this class. [studies show that blingbling is the sound that the diamond makes]\n"
        },
        {
            "course_name": "Introduction to the Early Middle Ages: 250-1250",
            "review_date": "September 09, 2001",
            "review_content": "\nChallenging but fascinating. Kosto is a wonderful lecturer with a great sense of rhythm and structure -- he puts the dots on the map, so to speak, and you can't quite figure out where he's going with it, and then in a flourish he connects them all and suddenly, effortlessly, you see the big picture. This happened within individual lectures and also over the span of the entire course, and he was one of those professors who really deserved applause on the last day of class when he made everything we had learned seem clear, simple, vital. Oddly enough, there were several (about ten) elderly (over 60 years old) auditors in the class who spoke very often. It was annoying.\nWorkload:\nDon't let the 1000-level ranking on this course fool you -- it's a tough class. 10-pg term paper, midterm, final (both graded hard but fairly), and weekly sections.\n"
        }
    ]
}