{
    "prof_info": [
        {
            "prof_name": "Christine Susienka",
            "prof_id": 11412,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Ethics",
            "review_date": "December 06, 2013",
            "review_content": "\nProfessor Vogt is really, really a fantastic teacher for philosophy. We read texts (not long ones, typically easily manageable) that were complex and encompassed huge ideas, but once we discussed them in class, I think more or less everyone had a good understanding of the subject matter. Even more than that, though, we all developed our views on a topic and asked questions or criticized parts of a philosopher's theory, and Professor Vogt really encouraged that. I feel like the class has changed the way that I think, even, in that we were pushed to be very, very precise in the way we thought and spoke about topics. Obviously, in a class that revolves primarily around the meaning and usage of words like \"good\" versus \"the good\" versus \"goodness,\" that kind of thinking is key. Don't ever think that philosophy classes are just easy! Ethics is really accessible in that it deals with ideas that permeate our everyday existence, but it was challenging in the best way in that it helped me grow.\nChristine was my TA, and her recitations were great and really illuminating. Same goes for her comments on assignments. She's really sweet and makes an effort to get involved with students to answer questions and to clarify points. She was also happy to meet one-on-one to talk about how to approach a paper topic.\nI really recommend this class to anyone, not just philosophy majors. I find it hard to imagine that anyone would be wholly uninterested in thinking about morality, and Professor Vogt really knows how to teach it.\nWorkload:\nSix outlines (one page single-spaced each)\nTwo papers (one that's four pages double-spaced and another final paper that's six pages double-spaced)\nReadings for every class\n"
        },
        {
            "course_name": "Ethics",
            "review_date": "April 09, 2012",
            "review_content": "\nThe class was awesome. Professor Vogt is a great lecturer and passionate about her subject matter. We barely got through her daily class outlines, but she posted them and I appreciated her desire for dialogue instead of straight up lecture. And 10 outlines instead of a final? Sign me up! Christine, my T.A., was really sweet and always happy to help out. The recitations were helpful for understanding the class material (although it's not such dense material to begin with).\nWorkload:\n10 one page outlines, midterm, papers\n"
        }
    ]
}