{
    "prof_info": [
        {
            "prof_name": "Henri Roesch",
            "prof_id": 13605,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Modern Analysis I",
            "review_date": "January 04, 2021",
            "review_content": "\nHenri is not an experienced teacher. He understands math well, but he has a long way to go before he can explain math well. I was expecting someone to actually explain the math in detail than a speed writer who just copies Rudin on the blackboard.\nAnyway, he's not an annoying professor, but very me·di·o·cre.\n\nWorkload:\nNormal workload\n"
        },
        {
            "course_name": "Intro to Modern Analysis I",
            "review_date": "December 24, 2020",
            "review_content": "\nRoesch is a pretty polarizing guy. Like he definitely did a great job of adapting to the online setting so I'll definitely give him credit where credit is due. He was a pretty good educator. I mean, nothing spectacular but he gets the content through to you. Unfortunately, all but like one of his graders this semester were kind of rude so that didn't help. Additionally, he's an incredibly harsh grader. Bordering on unfairly harsh grading. I enjoyed analysis and the workload was not bad at all. Just wish he wasn't such a harsh grader.\nTLDR; average all around, harsh grading\nWorkload:\n~1 pset a week (sometimes there wasn't an assigned PSET)\n2 midterms (roughly equal in difficulty, though most people found the second midterm to be harder)\n1 final exam (a little bit harder than the midterms and the mean score was about a 75)\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 13, 2018",
            "review_content": "\nRough. Roesch, while a nice guy, spends the entire class going through proofs of concepts, making simple topics really convoluted and hard to follow. HW is nearly impossible to complete without help. He doesn't let you write anything in your notes during office hours (!!!!!!!). Midterm 1 was really hard. He gave us a practice test for the 2nd since so many people complained, but does changing ways 2/3 through an extremely frustrating class make a difference?\nWorkload:\n3-4 hours per week on HW (one WebAssign, one written HW each week) \n\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 04, 2018",
            "review_content": "\nThe class is mostly proofs of basic calculus concepts. Seems pretty unnecessary for a low-level math class. The homework is obnoxiously difficult. Often the TAs in the help room can't even complete his written homework. His tests are similarly difficult. I took calculus in high school, but I was far from prepared for this course. I do not recommend especially if you're not considering a math major.\nWorkload:\nOne written problem set + one online problem set per week. Very difficult. Takes much longer than you'd expect.\n"
        }
    ]
}