{
    "prof_info": [
        {
            "prof_name": "Shany Mor",
            "prof_id": 2281,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 17, 2006",
            "review_content": "\nShany is a fantastic teacher. He will be an asset to any university as a student or hopefully a professor. More than being a good teacher, he cares about his students. He didn't have to make the extra effort but he did. For that, all of us are thankful.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 11, 2005",
            "review_content": "\nShany knows his international politics. Some people don't like him because he is opinionated, sometimes brusque, and cuts people off, but I appreciated his command of our sections. His opinions are usually correct as well. Doesn't repsond to emails sometimes, but talking to him is usually productive.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 07, 2005",
            "review_content": "\nShany is absolutely terrible.  Whoever wrote the good review on him was doubtlessly one of the annoying suck ups that are almost as annoying as Shany.  He is rude, anal, and totally unhelpful.  And his lisp will drive you crazy.\nWorkload:\nHe wants you to do all the readings, but come on, its only 10% of your grade and you dont need to do it for the rest of the class.  Just show up and you can still get an A in the class \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 04, 2005",
            "review_content": "\nWell, I really have to disagree with the stuff being said about Shany. I thoroughly ENJOYED my semester with him as my TA, and I know a lot of other people did too. A few people got on the wrong side of him, which, true, is not pretty. Ok, so he doesn't allow food in class--but for heaven's sake this is a DISCUSSION section, when we DISCUSS the course. You can do without food for 50 minutes. Really. It's only 50 minutes--which, incidentally, is why you should not come late to class. This is basic stuff, and there's no point complaining. Shany was only friendly, helpful and encouraging to me. We met outside of class on several ocassions and he struck me as a really nice guy. \nThat said, it is true that he likes the sound of his own voice and that he encourages excessive talking from some students, often those least qualified to do so. But people, let's be realistic, Shany is NOT some terrible TA, he may have a couple of faults, but if you do the reading, make (valid) class contributions and don't mess him around, you will have a good time. I really recommend him.\nWorkload:\nStandard IR introductory readings--about 4-8 essays per week. In any case this is set by the professor, not the TA, so no point fighting Shany over it.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 12, 2004",
            "review_content": "\nShany is without a doubt one of THE WORST teachers I have ever had. He must be on some sort of power trip, because he really enjoys hearing himself talk. He interrupts students all the time and wouldn't let us discuss what was interesting or confusing, only the material he thought was necessary. He's actually annoying more than anything and is quite possibly the most anal person I have ever met. Don't come late to class. Don't ever let your cell phone go off. NEVER bring food to class. Oh and make sure you sit in the group circle. Last but not least, if you're unfortunate enough to get stuck in his section, be sure to talk a lot. \nIt doesn't matter what you say, honestly, because half the time people were either spewing verbal diarrhea and getting credit for it, or they were being interrupted in the middle of a sentence. I came out of Shany's section more confused and pissed than when I went in. I was planning on maybe majoring in Poli Sci, but after going through the torture of Shany's boring and immensely irritating section, I'm having second thoughts. Save yourselves while you still can!!!\n"
        }
    ]
}