{
    "prof_info": [
        {
            "prof_name": "Karen Kelly",
            "prof_id": 12059,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 21, 2016",
            "review_content": "\nPower point based lectures with the test being derived from them. Very straight forward. No homework. Grade consist of 3 equally waited exams and psych-participation study credits. (FYI: compared to the other intro to psych classes this class was not curved and did not offer extra credit.) Fortunately I did well, but have heard of other students' misfortunes over multiple choice exams and their inherent ambiguity dictating their final grade. Take the class if you are good / comfortable with all multiple choice.\nWorkload:\nNo homework. 3 exams. All MC.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 21, 2016",
            "review_content": "\nThis class was a joke. But then again, it's intro psych so not sure what I expected. Never went to class, read the chapters from the textbook before the midterm. Did well on the tests. Lots of memorization. Overall, an easy class which doesn't require a ton of effort. Great way to a get a non-technical requirement out of the way if you're SEAS.\nWorkload:\n6 credits of participation in psych experiments\n3 two page written assignments that you can finish in an hour each (graded very leniently)\n3 midterms (40 multiple choice + 5 long answers)\n\n"
        },
        {
            "course_name": "The Self ",
            "review_date": "January 12, 2015",
            "review_content": "\nKaren is an awesome professor! She is funny, quirky, and kind. She creates a very relaxed class environment where everyone feels comfortable participating and sharing their ideas. The topics and articles she selects are really thought provoking and interesting. Her class was one of my favorites at Columbia-- the 2 hours seemed to fly by each week and I genuinely looked forward to going to class. There are only 12 spots so I think our class was mostly all senior psych or neuroscience majors who applied far in advance, but if you get the chance definitely take it!  \nWorkload:\nVery light! A couple of pretty short articles each week, 1 presentation, short mid-term paper (3 pages) and longer final paper (8+)\n"
        }
    ]
}