{
    "prof_info": [
        {
            "prof_name": "Alan Fishbone",
            "prof_id": 3034,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 19, 2015",
            "review_content": "\nI had Alan for first semester Lit Hum. \nFirst off: Alan is completely brilliant, and knows all of the Lit Hum readings inside and out--not only in English, but in Latin and Greek as well.  This allows him to convey unique and interesting insights into everything from the Iliad to the Bible. Also, he always spends a part of class explaining useful Greek/Latin words and concepts, which adds a lot to the overall understanding of the course.  That being said, Alan is a misanthropic personality who allows his apathy to spill over into the classroom.  \nWith his knowledge, experience, and love of Greek literature, Alan could easily be one of the best Lit Hum professors at Columbia if he wanted to.  Instead, he chooses to show movies (which is fun, but ultimately a waste of time), discourage students from coming to office hours, rant about the uselessness of the Core, and ask students difficult existential questions before refuting or mocking their answers. When we read the Bible, Alan made a habit of calling out inconsistencies in the stories and doctrine.  This in itself was understandable, but he would also force the one self-identified Christian in the class to explain and defend contradictions that even a theology student might have had trouble understanding. This got to the point where it seemed like he was wasting class time just to try and \"logic\" her out of her religion, an activity that benefitted no one.  \nIf the point of Lit Hum is to turn Panglossian freshmen into cynics who suffer existential crises about the inevitability of death and can reference Euripides at the drop of a hat, then Alan succeeds admirably in his job. He pushes students to think about difficult topics and to question whether their deepest beliefs are blind dogma or legitimate ideologies.  In the process, however, he dismisses students' ideas and creates an environment in which the potential hazards of speaking up greatly outweigh any benefits. \nAt the end of the semester, you WILL leave Alan's class having fully discussed, read, and analyzed the texts and broader thematic elements of the course. You will have a deeper understanding of some of the greatest literature in history and, as cliché as this sounds, yourself.  However, you will probably leave with an underwhelming grade, a new-found fear of voicing your opinions, and a hollow pit in your stomach that reminds you that, as Alan says, \"life it just the painful progression of mortality.\"\nWorkload:\nClass itself is easy and typically takes on the form of discussions about morality and mortality.  Little assignments (less than a page each) here and there. \n Three essays of medium length, a midterm, and the final.  Essays will typically be on vague topics, for which the only instruction is \"rem tene, verba sequentur\" (\"grasp the subject and words will follow\").  These papers are not evaluated in accordance with the laid-back directives. Essays rarely receive good grades, and Alan takes points off for any ideas that he considers broad, general, or simply too pompous.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 14, 2008",
            "review_content": "\nAlan Fishbone is a terrible teacher to get for Lit Hum.  Avoid him at all costs.  He pretends to be the cool hipster who defies the establishment, then grades harder than many senior professors.  As a class that breaks you into college he provides no easy transition.  The difference between when I put effort into the class first semester and when I didn't second semester in my grade was not worth the extra effort I put in first semester.  He is the worst.  Alan is not personable, thinks he is way funnier than he really is, and despite constant remarks about how stupid lit hum is, gives out terrible grades.\nWorkload:\nA two to three 3-4 page papers, and random in class essays for grades.  Midterm is easy and gets graded annoyingly hard, same as the final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 11, 2006",
            "review_content": "\nAlan is a fun guy.  In class, he's very random and entertaining.  (In my opinion.  Other classmates would beg to differ)  If you have no interest in language or etymology, you'll be very annoyed by his constant lessons based in his knowledge of Latin and Greek.  He grades tough, but for the most part, his comments are honest and deserved.  You can get away in seminar without reading the books, but I wouldn't recommend it.  You might be put randomly on the spot.  The worst were the pop in-class essays.  I'm not sure whether these were because he wanted to make sure that we were reading or because he wanted to take up an hour of class.  Alan is not the kind of teacher who spends hours in his office and welcomes you during any hour.  Except for one scheduled review of a paper conducted for the entire class, I've yet to get the impression that he wants to have anything to do with Lit Hum when he's not in Lit Hum.  But it's Lit Hum--that's acceptable.  Overall, a good guy, good seminar leader, and easy going.  The only thing to worry about are the papers because he doesn't give many A's.\nWorkload:\nAround four 3-4 page papers.  The last had the option of a non-traditional topic.  \n"
        }
    ]
}