{
    "prof_info": [
        {
            "prof_name": "Benjamin Miller",
            "prof_id": 2834,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 22, 2006",
            "review_content": "\nThe class itself was usually very enjoyable. He always came extremely prepared, and even though we (the students) very often steered off course, he learned to account for even this in his lesson plans. He is also very witty and makes great transitions from off topic rambling back to the discussion. Sometimes he had trouble making the assignments clear, but he always attempted to clarify what he was saying, whether through one on one talks in class or through e-mail, or even through giving a new assignment. I think somebody else mentioned that his goals are often a bit too lofty for the class, and I would probably tend to agree. However, he really is an intelligent and very sweet guy who genuinely cared about helping us to improve our writing and was always willing to meet with us individually about our writing and offer advice.\nI would have to agree, however, that he is a pretty harsh grader. As a published writer and a (prospective) English major, I definitely did not do as well as I think I should have and would have liked to. I also know that I received one of the highest grades in the class... but that didn't really alleviate the shock of the grade itself. \nI was also in one of the pilot portfolio classes which probably affected the class a LOT-- I think that a lot of the shock of the grade came from the fact that because it was a portfolio class (meaning we were not graded on each individual essay, but rather a portfolio put together at the end of the course), I had no idea what grade to expect really, and therefore was very caught off guard at the end of the semester. \nWorkload:\nShorter writing assignments every night (anywhere from 200-500 words), 3 essays (each of which includes an exploratory draft, formal draft, and final essay), 3 letters of transmittal (reflections basically) for each essay, 1 additional essay with no drafts, peer reading / editing / responding for the first 3 essays\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 06, 2006",
            "review_content": "\nHe is a nice person, but really hard to please. If you love writing, take it with him, but if you don't, get another instructor 'cause you might be able to get better grades with less effort.\nWorkload:\nA LOT\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 12, 2006",
            "review_content": "\nThis guy is awfully harsh and not, in my opinion, even very competent (which he should be if he's going to be a tough grader). Writing is SO subjective a discipline, and I frankly don't think it can be taught. I for one learnt sweet NOTHING with this TA. The class itself was honestly the biggest waste of time I've gone through at Columbia. \nI think Ben grades harshly for the sake of it. It may also just come down to incompetence. I don't which it is. \nI know friends who had a really good UW class. They do exist. But this is not it. Get out if you can.\n \nWorkload:\nA lot, and for very little reward. The same as any other UW class - so the class's value comes down to the teacher... Not worth it. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 12, 2006",
            "review_content": "\nBen does give out higher than a B+...So don't let that discourage you.\nHe really is brilliant writer. Even his editorial comments on essays are fun to read. I think he's very passionate about writing and his teaching exudes this feeling. \nThe only problem with his class, if you even want to call it a problem, was that he was overly ambitious with what he wanted us to learn. His lesson plan fell apart towards the end of the semester with the CCP paper, an exercise in futility if there ever was one.\nHe is the best UW instructor by far. Fun, helpful, wildly intelligent. You don't want to take the class, but you have to. Take it with Ben.\nWorkload:\nIt's University Writing..Expect many essays and reading assignments\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 18, 2006",
            "review_content": "\nBen is a grad student at Columbia and he is a really nice guy but he takes his job as University Writing teacher a little too seriously and ends up being impossible. He is an extremely hard grader, i think the highest overall grade in my class was a B+. There were essays where the average class grade was a C and for a required first year writing class that was ridiculous. He expects you to turn out amazing, extremely advanced papers, even if you think you are a good writer beware! He is very difficult to please. Also the fact that he gives you these low grades in such a nice way makes you unsure of how to question them. I would avoid this class if possible but if it is absolutely not possible, get to know him, he's a nice guy and go to his office hours as much as possible for advice. You might also want to go to the Writing Center for help.\nOne good thing is that he allows you to rewrite essays at the end of the semester and he boosts the grades then. I strongly suggest doing these rewrites if you got a low grade. At the end of my semester, he actually apologised to my class for grading us too harshly and saying that he expected too much from a first year writing class (understatement of the year).\nWorkload:\nregular UWriting, 4 drafts, 4 first submissions and four final essays. Also a group presentation and lots of reading and responses. Optional rewrites at the end of the semester.\n"
        }
    ]
}