{
    "prof_info": [
        {
            "prof_name": "Lisbeth Brandt",
            "prof_id": 2810,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "June 14, 2012",
            "review_content": "\nOk, this is going to be one of those awkward reviews you often see around here. Why awkward? Well, you'll soon find out. I took Japan Civ. because of my personal interest while it did not fullfil any of my core requirements (I completed these before). I am mentioning this fact in order to illustrate that I do not have any possible bias regarding the class. \nThe class material was really interesting while professor Brandt often focused on cultural aspects of Japan side by side its general history. We were assigned with interesting literature books, individual accounts, and even with a movie. I found the lectures particularly effective and interesting and soon found out that attending these lectures is a must (especially since there are many students who refused to share their class notes). \nSo what went wrong with this class? Well, here comes the awkward part. After two years at Columbia this is the first time that I disliked a class because of my TA. During the last two years I worked with TAs in various (sometimes similar) classes, such as China Civ and Roman Empire. Our class TA, Andre, absolutely and undoubtedly made this class less enjoyable. He forced people to talk in recitations, constantly mentioning  that some of us have already used our one-time-chance not to post weekly responses. Andre even gave us his own recitation syllabus emphasizing that we were not allowed to miss more than two classes without doctor notes (!!!). \nThe worst part came when we had to do our final papers. The final paper is the part where the TA has the greatest influence since he is checking and grading it. I handed in my paper 2 weeks in advance, and Andre agreed to edit it. However, this relatively unimportant paper soon became a nightmare. When I came to talk with him about his thoughts regarding the paper I did not receive ANY comments about the content of the paper but only about grammatical/style matters. Of course, my English is far from perfect and I have much to improve. Nevertheless, receiving 0% comments on my paper's topic or content was quite upsetting. consequently, I found out that this class was a bonus 2 in 1 class- Japan Civ. + University Writing.\nAndre then insisted that we use Chicago-Style Foot Notes, which is obviously ok, but also sent us around 5 emails reminding us of that. He then commented on my paper, emphasizing grammatical matters, telling me that my secondary sources are NOT secondary sources (all of them by the way were from the library, Google Scholar, Google Books, etc.)- all making this paper a living hell in times of finals. I ended up receiving a B. Unfortunately, this is the FIRST time I encountered such a TA and such an approach. Instead of improving my knowledge in the class material, I found myself receiving embarrassing comments solely about my grammer. Perhaps Andre should change his profession to grammar/writing teacher. \nNow, my final course grade was an (A-) so please believe me when I say that my intentions are good. Both the material of this course and the great professor (who was always friendly and approachable) were definitely worthwhile. For both of these crucial elements I would give an A. The TA, who is obviously the person who is supposed to supplement the missing material or discuss the existing one, receives a C for this past semester. \nFinally, we can reach a conclusion . As you can see from the top grades, this course receives a B. Unfortunately, it's a B for the wrong reasons. Consequently, my personal take would be the following- take this course but avoid this TA. Secondly, take this course because it is extremely interesting and Professor Brandt is one of the best professors I've had during my last two years at Columbia. Avoid this TA if you had already taken University Writing and if you truly wish to study more about Japan during recitations. \n\n\nWorkload:\nFair midterm \nWeekly postings + recitations \n8-10 final paper\nFair final \n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "May 26, 2012",
            "review_content": "\nOk, this is going to be one of those awkward reviews you often see around here. Why awkward? Well, you'll soon find out. I took Japan Civ. only because of my personal interest while it did not fullfil any of my core requirements (I completed these before). I am mentioning this fact in order to illustrate that I do not have any possible bias regarding the class. \nThe class material was really interesting while professor Brandt often focused on cultural aspects of Japan side by side its general history. We were assigned with interesting literature books, individual accounts, and even with a movie. I found the lectures particularly effective and interesting and soon found out that attending these lectures is a must (especially since there are many students who refused to share their class notes). \nSo what went wrong with this class? Well, here comes the awkward part. After two years at Columbia this is the first time that I disliked a class because of my TA. During the last two years I worked with TAs in various (sometimes similar) classes, such as China Civ. Our class TA, Andre, absolutely and undoubtedly made this class less enjoyable. He forced people to talk in recitations, constantly mentioning  that some of us have already used our one-time-chance not to post weekly responses. Andrea even gave us his own recitation syllabus emphasizing that we were not allowed to miss more than two classes with no doctor notes (!!!). \nThe worst part came when we had to do our final papers. The final paper is the part where the TA has the greatest influence since he is checking and grading it. I handed in my paper 2 weeks in advance, and Andre agreed to edit it. However, this relatively unimportant paper soon became a nightmare. When I came to talk with him about his thoughts regarding the paper I did not receive ANY comments about the content of the paper but only about grammatical matters. Of course, my English is far from perfect and I have much to improve. Nevertheless, receiving 0% comments on my paper's topic or content was quite upsetting. consequently, I found out that this class was a bonus 2 in 1 class- Japan Civ. + University Writing.\nAndre then insisted that we use Chicago-Style Foot Notes, which is obviously ok, but also sent us around 5 emails reminding us of that. He then commented on my paper, emphasizing grammatical matters, telling me that my secondary sources are NOT secondary sources (all of them by the way were from the library, Google Scholar, Google Books, etc.)- all making this paper a living hell in times of finals. I ended up receiving a B. Unfortunately, this is the FIRST time I encountered such a TA and such an approach. Instead of improving my knowledge in the class material, I found myself receiving embarrassing comments solely about my grammer. Perhaps Andre should change his profession to grammar/writing teacher. \nNow, my final course grade was an (A-) so please believe me when I say that my intentions are good. Both the material of this course and the great professor (who was always friendly and approachable) were definitely worthwhile. For both of these crucial elements I would give an A. The TA, who is obviously the person who is supposed to supplement the missing material or discuss the existing one, receives a C for this past semester. \nFinally, we can reach a conclusion . As you can see from the top grades, this course receives a B. Unfortunately, it's a B for the wrong reasons. Consequently, my personal take would be the following- take this course but avoid this TA. Secondly, take this course because it is extremely interesting and Professor Brandt is one of the best professors I've had during my last two years at Columbia. Avoid this TA if you had already taken University Writing and if you truly wish to study more about Japan during recitations. \n \nWorkload:\nWeekly postings \n1 Final paper \n1 Midterm - fair\n1 Final - fair \n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "December 25, 2010",
            "review_content": "\nThis was by far the most boring class I have ever taken. Her lectures were totally unorganized and hard to follow. She presents you with a term list before every class but then doesn't really follow it in her lecture. Unless you are giving her your undivided attention, which is hard, considering it is a class about Japanese civilization, you will most often be lost in lecture. \nShe isn't very nice either. I had 3 finals on the same day, and so I emailed her to change her final. She said that she will not offer it at another time and that I should try to change my other finals. She said that if I were unable to change any of my other classes, it is my fault because I should have looked at the proposed exam schedule when registering for classes (ARE YOU KIDDING ME??) \nOverall, it wasn't that difficult of a class. It was kind of annoying to do discussion posts every week on the readings that I didn't do. But, not putting that much time into the class, it wasn't too hard to get a good grade. \n\nWorkload:\n1 midterm, 1 final, 1 10pg research paper, weekly discussion posts on the readings\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: Japan",
            "review_date": "January 12, 2006",
            "review_content": "\nOverall, this is a very easy class, and professor brandt does make it very interesting. You are expected to come to class having read the textbook, and brandt will then expand on the relatively limited amount of information covered in the book. She clearly spends a lot of time preparing for these, and brings a lot of extra material (i.e. books, and videos) to class. However, when it comes to the tests and papers, your attending the lectures does not really make a difference. Most of the ids are in the textbook, and the essay questions are so broad, that one can answer them based on the textbook alone. So, all in all, brandt isn't a bad professor, and this is a good GPA booster. Unfortunately, most students realize the futility of attending the lectures around midterm time, which leaves prof. brandt with half a class to lecture to.\nWorkload:\nmidterm, final, research quiz, and participation in TA sessions\n"
        }
    ]
}