{
    "prof_info": [
        {
            "prof_name": "Molly Superfine",
            "prof_id": 13346,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to the History of Photography",
            "review_date": "January 19, 2017",
            "review_content": "\nI first registered for History of Photography as a Pass/D/Fail course uncertain of what the workload or expectations would be. I was pleasantly surprised to find Prof. Alberro's lectures on History of Photography accessible and easy to understand. Readings were well-integrated into class discussions during the first half of the semester and the workload was manageable (nothing a bit of studying could not overcome).\nI was fortunate enough to have an excellent TA, which I found made a significant difference in aiding my comprehension of lecture. Molly worked hard to synthesize readings and explain them in a clear and accessible way to students. She took time to read over our work line by line and to offer extensive comments (in legible script), which facilitated studying for projects and exams later in the semester.\nI find many students are hesitant to take courses from graduate students, given perceived \"lack of experience\" and \"unfamiliarity\" with the material. However, I found Molly's explanations to be on-point and her knowledge of the material extensive. As a grad student and teaching fellow, only a few years older than her students, I think she was able to connect with students and clearly explain complex concept more readily than someone far older and ostensibly \"versed\" in the material.\nI appreciate the efforts she made to get to know students individually and to explain her grading of the midterm exam and assignments. Papers and emails were promptly returned, and student questions/concerns were consistently addressed.\nThough I took this course as an elective, I would definitely recommend to students interested in art history as a not too demanding and stress-free course. Alberro cares about his students and adjusts his workload/expectations to reflect the fact that, as Columbia students, we often take more courses than we can handle.\nWorkload:\nOne visual analysis and one research paper\nBrief midterm exam in one hour - 3 short essay questions\nShort final exam - 4 short essays followed by 1 extended analysis\nNot overwhelming for a Columbia Course. Quite manageable.\n"
        }
    ]
}