{
    "prof_info": [
        {
            "prof_name": "Ragnheidur Haraldsdottir",
            "prof_id": 3079,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "January 17, 2007",
            "review_content": "\nThis course was terrible. I was accepting to leave the class with some sort of general knowledge of statistics but found that I left only with higher blood pressure. I must agree with the previous review in that the professor often spoke so quietly that I could not understand 50% (just to throw a \"statistic\" in here) of what she said. seemed inexperienced and defensive. When asked a question she would do one of two things:\n1) try to explain, become frustrated and tell the student to go to her office hours (something I STILL don't understand since she didn't have set office hours), or\n2) say \"hmmm\" several times and avoid the question altogether bye translating things into Icelandic.\nWe rarely did examples because we rarely finished the material she had hoped to cover in class. Consequently, I taught myself out of the book.\nThis review is harsh, but as honest as I could possibly be. I did not do horribly in the class but feel that it was a waste of time. And now I have higher blood pressure. : (\nWorkload:\nHomework due once a week. She'll give you ten problems and you'll be content until you realize that each problem has 3 or 4 sub-questions. 2 quizzes, midterm, final, and an optional extra credit assignment (although she made it an \"optional extra credit assignment\" because we ran out of time to do a real project.)\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 18, 2006",
            "review_content": "\nTerrible...apathetic teacher, mumbles, refuses to explain things in class (\"come to my office hours\"). \nWorkload:\nHomework is hard but doable...too bad we never went over it. The book is patronizing.\n"
        }
    ]
}