{
    "prof_info": [
        {
            "prof_name": "Elizabeth Bauer",
            "prof_id": 4024,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Molecular & Cellular Neuroscience",
            "review_date": "December 08, 2016",
            "review_content": "\nPROF Bauer is an awesome professor! Interesting lectures and reasonable courseload. There's 2 exams that are half multiple choice and half short answer, 2 problem sets that are based on articles and the lectures, present an article with a group, and attend an outside lecture. She is a reasonable grader and will give partial credit for short answer questions. Overall, it's been a good class. 10/10 would take again.\nWorkload:\n2 midterms\n2 problem sets\n1 page paper on outside lecture\n1 article presentation\n1 final\n"
        },
        {
            "course_name": "Molecular & Cellular Neuroscience",
            "review_date": "January 09, 2012",
            "review_content": "\nOkay, maybe that old review was true when it was written, but it certainly isn't anymore. Professor Bauer taught a very clear and interesting class. Her slides were easy to follow, and she was always more than happy to clarify any points. We definitely spent more than one occasion hashing out a particular point more than was necessary for the exam, but I found this enriching, not tedious. I really enjoyed that we read articles and discussed them fairly regularly, and I think we got some valuable insights into the field (discussions about ethics, evaluating how good/thorough a paper was, etc). She was approachable and helpful, and she admitted when she didn't know the answer and was more than happy to get back to you. Overall, a manageable and interesting class. \nWorkload:\nthree exams, two problem sets, and class participation (presenting, attending an outside lecture, coming to class/asking questions). very doable.\n"
        },
        {
            "course_name": "Molecular & Cellular Neuroscience",
            "review_date": "May 10, 2010",
            "review_content": "\nShe does not teach. She reads 99% of her powerpoint slides with terrible explanation skills and expect for students to LEARN and UNDERSTAND the material. I find this class laughable because of the teacher. I love the subject. I find it to be fascinating. However, I find myself teaching every last lecture to myself. It is nice that she compensates her terrible teaching with detailed powerpoints. I just took the final and I can easily say that if I had a couple more weeks to learn and understand the material myself, I might have had a chance. Unfortunately, since I have 2 other major science finals after this class, I wasn't able to devote my life learning this on my own during finals week. There was about 150+ pages of lecture notes (4 slides on a page) with excruciating detail on nearly every page. The best part is, by the end, it no longer is studying for an exam. Rather, I found myself in a marathon trying to memorize everything my eyes laid on. Her lectures are notes she took from the textbook, which is... in enough detail to burn holes in your eyes. It also means, you don't need to really read the textbook. To be honest, avoid this class unless you are a neuroscience major, in which case, just know that you will have to teach yourself everything about the brain. \nProf. Bauer is incapable of producing complete sentences on her own. She basically ends her sentences/ her answers to students' questions with whatever is on the current powerpoint slide. \nWorkload:\n2 problem sets for the entire semester. \n2 midterms\n1 final\nThe entire course is in your hands.\n"
        }
    ]
}