{
    "prof_info": [
        {
            "prof_name": "Tony Heinz",
            "prof_id": 3592,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Thermal & Statistical Physics",
            "review_date": "January 08, 2011",
            "review_content": "\nTony Heinz is a good professor.  He teaches the material in a very straightforward manner.  The lectures are straight from the text (which I don't think that anyone really read) as are the problem sets.  He is clear and answers even the most imbecilic questions kindly and with patience.  He is an incredibly nice guy, especially for a physics professor.  The only downsides to the class were that the textbook (Schroeder) is really at a pretty low level, the problem sets are sometimes painfully tedious, and that Prof. Heinz does tend to lecture in a dry monotone (although he will occasionally get excited about some example or application).  Overall, it was a good class with a good professor, and I would recommend it to math/physics students as well as engineers looking for technical electives.\nOne note: the bulletin claims that quantum mechanics is a prerequisite, but it we didn't use anything beyond the idea that energy is quantized other than writing down the specific energy levels of a particle in a box in class. You really don't need quantum, which was a disappointment.     \nWorkload:\nA problem set due each week with 6-8 questions, a really easy midterm, an impossibly hard final (completely out of the blue and unlike any of the practice finals).\n\n"
        },
        {
            "course_name": "Thermal & Statistical Physics",
            "review_date": "December 16, 2009",
            "review_content": "\nProf. Heinz is fantastic. He is sweet, cares about his students, is a clear lecturer, good at explaining and getting through difficult material, gives fair exams. He also has a nice, down-to-earth perspective on the physics to offer which is a good one to be exposed to. (For example, he appreciates being able to give order of magnitude estimates for quantities off-the-cuff.) The textbook for Thermal and Statistical Physics, Schroeder, is also very readable. Chances are, if you are going to take this course, you are a physics major and therefore have to, but if for some reason you are unsure, I definitely recommend it. It made me want to study Stat. Mech at a more advanced level.\nWorkload:\nAbout to be expected for a mid-to-upper-level physics course. Some tedious calculations, but it builds character, and that's the nature of the field.\n"
        },
        {
            "course_name": "Thermal & Statistical Physics",
            "review_date": "December 23, 2008",
            "review_content": "\nI cannot believe that have been no reviews of Tony Heinz.  This man is absolutely amazing.  His dictation is clear and understandable, his answers to questions are always on mark (in the case of a slightly off-topic question, he connects it with the material).  The biggest difference between him and other physics professors I've had here is that he emphasizes numbers a lot more.  Every other professors just asked us to solve for some quantity in terms of physical constants, but Heinz repeatedly stresses the important constant, which gives you a very good physical intuition for the numbers you are working with.  He holds his own recitations and review sessions, which is a lot more than what a lot of professors do already.\nAlso, the textbook we used was great.  (Thermal Physics, Schroeder.)  It was clear and concise, and very suitable for our level.\nWorkload:\nWeekly problem sets that are very easy.  1 midterm, easy, allowed 1 formula sheet.  1 final, hard, allowed 2 formula sheets.\n"
        }
    ]
}