{
    "prof_info": [
        {
            "prof_name": "Meredith Fluke",
            "prof_id": 2540,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 03, 2014",
            "review_content": "\nMeredith is great. A lot of us came in here having either no prior experience with art history or having taken AP Art History and having ingested its various memes, but Meredith was up to teaching and challenging both groups. In other words, if you have an interest in art history like me, a lot of what you're going to be reading and learning is a few themes and plotlines over and over again: the introduction of illusionistic space into Renaissance painting. Its dissolution with the Impressionists. Rembrandt employed chiaroscuro to, uh, some end, and so did Caravaggio. Meredith isn't so iconoclastic or frivolous as to dismiss these facts, which are, in the end, facts (for the most part). But she's able to teach in a way that incorporates the way a painting -feels-, the way you react to a painting, to what the painter is doing and why that mattered. Her class can often feel like a lot of Q&A; (the question usually something like, \"What do you guys notice about the painting?\") but also usually had the wonderful feeling of something being revealed, slowly, before it all comes together. It felt like art history should feel, in other words.\nIf I had a qualm about the class it was the readings, which were sometimes long and sometimes not, sometimes interesting and sometimes less so, but more than anything seemed irrelevant. I read them voraciously my first few weeks and for the most part enjoyed them, but then realized that the stuff just didn't matter. She barely referenced them in class and never in a manner that would affect your grade (i.e., on a test) had you not read them. I just stopped midway through the semester and my experience with the class wasn't really altered in any significant way. This might read like a positive for those of you less inclined to digging into 30 pages about symbolism in Rembrandt, but sometimes you sorta want this stuff to matter, right? No harm, though. Fluke rocks.\nWorkload:\nReadings for every class which are nooooot really mandatory at all grade-wise, except that you have to do a writeup on two of them, 2 ~5-page papers, midterm, final. Also: participate!! Just say whatever, man. It's part of your grade and can be a fun time. The midterm and final hew to what's expected and are not bad. For one of the papers I literally woke up at noon, rushed the paper, sent it in at 2 (!!!!), and received an A. Which was also the grade I received in the class as a whole. She's pretty friendly with that stuff.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 03, 2014",
            "review_content": "\nMeredith is a decent professor. She's taught art hum a handful of times and she definitely knows her stuff. But her teaching of this course differs in two primary ways from the high majority of other art hum professors. Firstly, she stresses staring at a piece or two of art and analyzing it to its core. And I would say this is a good exercise for a beginners art class but IT'S ALL WE EVER DID. We NEVER mentioned the words renaissance, impressionist, expressionist, dottism, or anything of the sort. We never discussed art in the context of history. We never did anything but descriptive analysis and compare/contrast. And secondly comes Meredith's grading. As she made very clear to my class, she was not handing out many grades of an 'A'. She told us that on our first paper she gave half the class a grade of a 'C' and followed that statement with something along the lines of \"if you didn't think you could get a 'C' in art hum well clearly you were wrong.\" On our midterm as well she only gave 4 students out of 22 or so a grade of an 'A' (something that is just not very common in a Columbia Core class). Again, Meredith is a professor who is clearly smart and knowledgeable but at the end of the day if you have the ability to take art hum with a different professor I would suggest you do so.\n(For full disclosure for those who are curious, I received an 'A-')\nWorkload:\n2-3 short essays, 2 reading responses, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 13, 2013",
            "review_content": "\nMeredith is a decent art hum professor. I don't think she deserves a gold nugget, but she is definitely not a bad choice for art hum. She is a fairly engaging lecturer and does well at facilitating class discussions.  \nHowever, my criticism of her consists mainly of her grading methods and expectations of her students.  She is a very critical grader when it comes to papers and exams.  When it comes to her exams, quantity is valued over quality.  The more you wrote, the better your grade. Though this is supposed to be a survey of western art history, she seems to expect her students to be able to analyze art at a pretty high level and remember every detail stated in class.  \nFairly standard art hum class.\nWorkload:\nDaily readings (skimming is fine), 3 papers, Midterm, Final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 05, 2013",
            "review_content": "\nGreat teacher, responds to every student's comments and guides the conversation into really in-depth discussions of the artwork. Engaging and interesting to listen to. Interesting assignments that allow creativity and make you think. At times we would talk a piece to death, but there is value in doing that too. The midterm and final are pretty straightforward. \nAlso we took two field trips, one to the Cloisters and one to the Met. She held multiple times so it was easy to find one that fit our schedule, and even then it was not mandatory. \nMeredith made my arthum experience extremely worthwhile. \nWorkload:\nThree 5 page papers, readings for every class (can get away not reading thoroughly), midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 01, 2006",
            "review_content": "\nMeredith was a terrific art hum instructor. She was always energetic, approachable, and funny, despite the class being early, while at the same time always being in control of the class and really knowing her stuff. I came away from her class actually liking art history and having learned a lot from her. She's really cool and down to earth, and the atmosphere was really relaxed and unintimidating. The work load wasn't bad at all, and she made the class trips worth our time. If you get Meredith, you'll be glad you did.\nWorkload:\nnot bad...3 short papers with a lot of flexibility of topic; a midterm; a final; no weekly assignments...each person does 1 short presentation which was no big deal.\n"
        },
        {
            "course_name": "Medieval Architecture",
            "review_date": "November 13, 2005",
            "review_content": "\nMeredith has been my best TA yet!!! She really helped me to understand Medieval Architecture and to gain an appreciation for analyzing art/texts in general.  This was also my first architecture class...but she really took the time and effort to get everyone up to speed.  I really looked forward to her discussion sessions which helped me to get through the readings.  She also was very helpful when it came to papers and exams and helped everyone get a great general and in depth understanding of the material at hand. She also is a great person to talk to about art history outside of the classroom because she has a deep understanding of Medieval art as well as experience in the art world.  I am an art history major but I strongly recommend her to people with any level of art history knowledge.\n"
        },
        {
            "course_name": "Medieval Architecture",
            "review_date": "May 15, 2005",
            "review_content": "\nMeredith is the most wonderful TA I have ever had. She ran clear discussion sections, answered questions, and maintained a genuine interest in her students. Not only did she offer to meet with students whenever they needed help with the course material, but she also encouraged students to contact her about career advice--such as summer internship interviews. She has worked at many museums--including the Met--and seems to know everyone. She is incredibly friendly, but don't let that fool you. She knows everything about Medieval art and history. Meeting and talking with Meredith have made me seriously consider getting an advanced degree in Medieval Art. She is an incredible and knowledgable Teaching Fellow. I recommend taking anything with which she is involved--I guarantee a rewarding experience.\nWorkload:\nWeekly readings, not terribly long. In-class midterm with two slide comparisons and an essay (choice of topics given in advance). Take home final. All fairly graded. \n"
        }
    ]
}