{
    "prof_info": [
        {
            "prof_name": "Arne Soulier",
            "prof_id": 1841,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "PHYS 2699: Physics Lab",
            "review_date": "May 17, 2004",
            "review_content": "\nThe other review of Arne is pretty accurate, if not a bit biased because of caring a lot about grades. Arne is a nice enough guy in the lab, willing to show you what to do. He also makes some good explanations sometimes too. The idea of grading this class on a curve is pretty stupid (the other person probably would have been happier too if it wasn't graded like that) because you can have two lab reports of the same quality get different grades if that week's competition was stronger. It also makes the grading seem arbitrary. Unfortunately, Arne doesn't really help the situation by not summarizing what you did well and what you didn't on the lab. He simply puts a percentage and a few check marks. Come on, it's got to be teaching 101 that you need some explanation to why a grade was earned. The labs are a lot of work and you won't learn anything, except how to make some graphs in Excel. I think it's one of the worst required engineering school classes. The lab time itself isn't too bad and except for a couple of times never took more than two hours to finish. \nWorkload:\n10 labs. Each takes a couple of hours in the lab and at least 3, and up to 6 hours to write the report. Completely unrewarding considering the time required.\n"
        },
        {
            "course_name": "Introduction to Experimental Physics",
            "review_date": "December 07, 2003",
            "review_content": "\nSwitch out of the section if you have him. Arne is not a mean person; he just makes the lab class ridiculously difficult. He curves around B/B+ for every lab report with most students falling around the middle. (Don't dismiss this just because I talk about grades--read on.) For most of you that means however hard you try you will find yourself getting scores between 4.8 and 5.2 (over 10.0) every single time. You may work harder, but so will everyone else. By the end of the semester the curve becomes insanely competitive.\nNow, I don't think that students should only care about grades, but I personally (and I would venture to guess that most people will agree) don't think it makes sense to curve physics lab like Arne does. First of all, although he thinks he never makes mistakes (he said it himself), evaluation of lab reports isn't numerical and objective. Does it make sense to curve essays? And unless it's something major, he doesn't really tell you what is wrong with your work. You can be doing flawless reports and still getting 4.8's and not knowing why (because the other reports are spectacular).  More importantly, there is absolutely NO point making an INTRODUCTORY lab class so insanely competitive. Every lab report took me 5/6 hours of stressful work, and every time I got a 5.0 back (all checks, no mistakes), not because it wasn't good, but because everyone else's was just as good. Words cannot describe the extreme frustration and pain this class brought upon me.\nI would MUCH rather take a harder class (even get a worse grade) than suffering through this shyt. At least that could be interesting and I would actually learn something. The physics lab material is boring as hell, and Arne makes things worse by insisting on meticulous error analyses. Whatever you might get out of this class (very little in my case) would not be worth the extreme torture it entails. Get out.\nWorkload:\nUnnecessarily heavy, because of Arne's curve.\n"
        }
    ]
}