{
    "prof_info": [
        {
            "prof_name": "Christopher Conlon",
            "prof_id": 10761,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "May 16, 2013",
            "review_content": "\nBottom line: This is not a good class, in any way, shape or form, but that doesn't mean don't take it.\nAllow me to explain.\nProf. Conlon can generally be expected to act in the manner that causes him the least amount of work. This has the following implications: all the lectures are little more than slides from the book, though Conlon does try to spice things up with real-life examples occasionally. The lectures are therefore fully interchangeable with just reading from the book (often, you'll understand it even better from the book. On the upside, it's an excellent book).\nMore importantly, Problem Sets and the midterm ONLY COUNT IF THEY ARE HIGHER THAN THE FINAL. In other words, if you do nothing all semester, you can still get an A by doing well on the final. This is further supplemented by the fact that the Problem Sets are mostly self-contained: they mostly test your ability to use the computer program STATA, which the tests don't test, so you can (as I did) do rather well on the tests without doing the Problem Sets (or going to lecture for that matter). \nThis is particularly good because the PSs can be atrocious: they test your knowledge of STATA, which isn't taught in the class but rather in section, which means that the TAs leading the sections have to juggle between reviewing material, helping with HW, and teaching STATA commands, all in 50 minutes. Something has to give, so usually you're left with figuring out a lot of STATA on your own. The PSs are often long (with sub-questions that can get to r/s/t and some questions that have you copying things mechanically from tables printed out by STATA). I found myself finishing the problem sets during class and even then not managing. \nConlon himself is not very approachable, and can be rude, which surprises some students. However, the exams are pretty straightforward (though the final had some odd and vague questions), so it's not that hard a class overall. \nLastly, there's a \"Piazza\" tool that is actually quite helpful: it's a method for asking questions and getting quick responses that all classmates can see. This is where Conlon's minimal-work ethic actually is an advantage, since Piazza can be extremely useful for the PSs and when sudying for tests. \nAll in all: if you are the kind of person who can study well on your own from the book, isn't afraid of a 70% final or somesuch, and doesn't mind professors who are very distant from their class: this might be a good class for you (especially if you already know STATA or can learn it easily on your own). \nOtherwise, avoid like the plague. You will likely have a rather bad experience. \nWorkload:\n20% Problem sets (unless the final is higher, see above), 30% midterm (same), 50% final. Problem sets long and extremely annoying, but not hard per se if you know how to handle them. Midterm and final pretty straightforward if you know the material (mostly theory, not computation, which is good).\nIf you elect not to do the problem sets or go to lecture (what I did), it's pretty much a free course all semester until finals, and when that comes up you just have to make sure you have a firm grasp of the theory to get a reasonable grade. \n"
        }
    ]
}