{
    "prof_info": [
        {
            "prof_name": "Kaori Hatsumi",
            "prof_id": 11143,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "The Rise of Civilization",
            "review_date": "May 07, 2011",
            "review_content": "\nIf you are in CC, chances are you'll end up taking Rise of Civ to fill your Global Core requirement.  Why?  Because it's easy.  Why else?  Because on paper, it sounds like it would be in an interesting course.  Unfortunately, only the former is true.  It is very easy to get an A in this class, so by all means, you should take it (especially if your GPA needs a little bump).  However, D'Altroy is not a very interesting lecturer.  Some time around the end of January, I stopped going to class entirely, with the exception of the midterm and the class before it.  He doesn't exactly make it essential that you go to class, either.  All of his lecture notes are posted online (hint: there are way too many of them.  Dude doesn't know how to write an efficient outline.  But hey, all the more help to slackers like myself?).  All of his powerpoints are posted online.  Don't print these.  He saves them at the highest quality possible, so they take forever to print.  And there's literally more slides than there are minutes in of lecture.  Most of the time, if you do actually go to class, the people around you will be doing one of three things: eating lunch, talking to their friends around them, or dicking around on the internet.\nAll that said, DO go to your recitation section.  And if you have the option, take the section with Kaori Hatsumi.  She's adorable, and doesn't have great command over the English language, but she's an easy grader, and she, too, will post all of her notes from discussion section online.  They're usually a boiled down version of whatever D'Altroy was talking about in class, and are often more useful than his lengthy outlines.\nWorkload:\nridiculous amounts of reading that are mildly helpful.  10% for recitation attendance+3 short papers, 30% for the midterm, 60% for the final\n"
        }
    ]
}