{
    "prof_info": [
        {
            "prof_name": "Nadia Latif",
            "prof_id": 3305,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 22, 2008",
            "review_content": "\nThe reviewers below must have been really incompetent. Nadia is extremely sweet, knowledgeable and willing to meet with anyone outside of class. The class itself is poorly organized and pretty random, but she takes the information and organizes it into a relatively cohesive class. She was nice to the students who actually took the time to speak with her after class, or to meet with her just once. She is not a difficult grader (see: midterm) and if you have problems with your grade you can go and speak with her about them. The midterm is not something that you need a FORTY page review sheet for -- it's something that you need to cram for the night before and do well on. She did not make any major mistakes that I took note of (what the Declaration of Independence has to do with the midterm or the topic at hand I don't know) but she had an extremely extensive knowledge of current streams of thought, and Islamic history. She also gave us the opportunity go get extra credit via really easy little quizzes (and if one \"missed\" class they were still able to take them) and just by sending her emails. She is one of the best TAs I've had at Columbia, and I am not really sure who wrote the reviews below but they obviously had an agenda. \nWorkload:\nReading for each section that you don't really have to do, easy midterm, easy final paper. Attendance/participation counts, but if you have an excuse she gives you full credit anyway.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "February 12, 2008",
            "review_content": "\nI signed up for Intro to Islamic Civ with Saliba having heard, as many do, that it is the easiest Major Cultures List A course.  The readings were easy enough to cram into a few days of power-studying before the final, and there was minimal work during the semester.\nEnter Nadia.  Nadia Latif made my life a nightmare for several months.  My friends and I made a 40-page review sheet and studied it for several days leading up to the midterm.  The average across all sections was a B+; the average in our class was a 60.  The one friend who wasn't in the section got a 92 - we all got between 65 and 70.  Nadia also refused to adjust her grading after the results came out, as she had given out three or four A's to the students who had participated most in section.  It took Saliba intervening to make a separate curve for us before the situation was rectified.\nAlong with her GPA-crushing grading policy, Nadia was poorly educated in the material.  She routinely made mistakes that the class had to correct for her - it is hard to estimate how many of these mistakes slipped into the section notes (one relatively catchable example:  Declaration of Independence signed in 1766).  Choose any other TA, or you will be subject to intense grading pressure with less knowledge of the material than you would have under any other TA.\nWorkload:\nlow\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 06, 2007",
            "review_content": "\nI'm not sure if Nadia will TA again, but if she does, GET OUT. First half of the semester,I liked her-- she seemed nice enough; she was helpful, informative, and understanding about how much reading Saliba assigned; and she was all in all a typical decent TA. Then came the midterm. Islamic Civilizations is a List A intro Major Cultures course, and all the sudden  I felt like I was expected to be a MEALAC PHd candidate. Despite the fair and lenient grading of every other TA (the typical grades were A-/B+), she decided to grade us incredibly harshly, with an average 10 to 15 points lower than the class average. A couple of her class favorites got As, and everyone else was screwed out of the grade they would have received from any other TA. The class when we got our exams back was a nightmare. A third to a half of our TA section complained to Professor Saliba. I'm told a curve will fix the problem, but still, save yourself the stress and get out now. You can learn from this class without it wreaking havoc on your GPA. Nadia isn't as nice and helpful as she first appears.\nWorkload:\na lot of reading, midterm 40%, final 40%, participation 20%. TA controls entire grade (they grade your midterm, final and participation)\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "November 13, 2007",
            "review_content": "\nNadia constantly complains about the lack of class time, yet she spent the first two out of ten or so recitation sections defining the difference between religion and culture, while the other TAs were going over the lecture material. When she did cover the material in lecture, she barely scrapes the surface of the material. There is absolutely NO doubt in my mind that her recitation was absolutely useless.\nThe worst part about Nadia is her grading of the midterms. My friends (in other sections) and I studied for twelve hours the day before the midterm exam, and together created a 36 page study guide with every single detail of the class in it. After the exam I was convinced that I had gotten an A, and at the worst a B. Nadia gave me a 58/100. A 58! The people who I studied with in the other sections all recieved As. Nadia not only punished people for not writing almost verbatim what she had on her answer key (for essay questions) but deducted FULL points for slight miswordings and insignificant geographical mistakes. \nIf you want to fail this class, and have your life ruined by a TA, please sign up for Nadia's class.\nWorkload:\nirrelavent. no matter what you do, you will fail.\n"
        }
    ]
}