{
    "prof_info": [
        {
            "prof_name": "Matthew  Morrocco",
            "prof_id": 12906,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Photo I",
            "review_date": "May 13, 2014",
            "review_content": "\nLaura was an absolutely wonderful professor. Coming in to the class I was constantly taking crap photos of buildings and nondescript flora, and exiting it I found myself focusing on subjects that actually mattered to me, as well as composing my shots better. \nThis is definitely a content based class; although there was extensive training in darkroom procedures, and early critiques noted printing and development issues, by the middle of the semester most of the non-darkroom time was devoted to content. \nThe critique process itself was initially a bit intimidating, and also frustrating because of the use of words like anonymous and specificity when talking about unsuccessful and successful photos. By the end their meaning was clear, but boy for a while it seemed like Klingon.\nBoth Matthew and Laura were very supportive and helpful in discovering how to take meaningful photos over the course of the class, and despite a relative lack of broader class discussion during critiques, the atmosphere was relaxed and non-judgemental. Photos weren't declared good or bad, but successful or unsuccessful, and critiques were always very specific in what was missing so that students could learn from past missteps. \nIf you are looking for a class that teaches you only about the technical and formal aspects of photography while letting you take as many photographs of fire hydrants as your heart desires, then this class is not for you. Laura and Matthew's goal was to push us to take photos of subjects that mattered to us and would express something to other viewers, not just to get our apertures and shutter speeds right. Absolutely worth all the time spent on it (and money! boy film, paper and cameras are expensive!)\nN.b. Matthew is crazy funny, try to get him as your TA in other classes in the department as well.\n\nWorkload:\nWOW A lot. By the end of the semester we were supposed to have 24 rolls of film developed, corresponding contact sheets and around 50 prints from the (5 or 6? I forget) critiques over the course of the class. Every other week half the class would submit 8 photos for critique, which allowed for plenty of time to prepare. But expect to be in the darkroom for at least 3 hours extra each week - the time in the darkroom during class is usually not enough to prepare everything. \nAttendance was also obviously very important.\n"
        }
    ]
}