{
    "prof_info": [
        {
            "prof_name": "Michael Wilson",
            "prof_id": 11225,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Disabilities and Exclusion in Schooling",
            "review_date": "May 09, 2015",
            "review_content": "\nAll Teachers College Columbia pre-service students are required to take the C&T; 4000 Disabilities course. \nI found this to be VERY interesting course, and it's definitely a class that every future educator should take. A typical class consists of a close reading analysis, group presentation, and debate & discussion. I found Dr. Wilson to be very analytical, impartial, and grounded in reality in our class debates. He won't hesitate to question your claims, so be prepared to defend your argument if he confronts you. I also very much like that Dr. Wilson has given us a realistic portrayal of the teaching world. He made it clear that it will be demanding, perhaps even miserable, especially in the first year of teaching. The material covered in this class will definitely make any would-be teacher question his/her/x's initial motives for going into the teaching profession.\nDespite this, the class had a laid-back feel to it, the professor kept the class grounded and facilitated debates well, and all of my brilliant classmates contributed their own unique perspectives to the class which made for a truly thought-provoking, intellectually pivotal experience.\nWorkload:\nReading load is heavy. Classwork will almost exclusively deal with assigned readings. Try to read them all as closely as you can and be ready to engage in discussion. \nOne class discussion facilitation (20%)\nOne \"multimodal\" critical reflection [no minimum/maximum pages] (20%)\nOne media artifact analysis paper [1 page only] (20%)\nOne midterm quiz on the legal foundations of education (10%)\nOne final paper [no minimum/maximum pages] (30%)\n\n"
        },
        {
            "course_name": "Disabilities and Exclusion in Schooling",
            "review_date": "December 04, 2011",
            "review_content": "\nProfessor Wilson was a really cool and easy-going teacher. He's very much an analytical, philosophical, research-type thinker, so often times he had trouble verbalizing what he really meant and was vague. He's very much about discussion based teaching. There was a lot of reading, but I learned a lot! I literally knew everyone's name in my class (about 20 ppl) by the end of the semester, because it's very collaborative. We were always working in groups with different people. I made friends in this class, definitely. He fosters that environment, but it not forceful in his own opinions or agenda. Even though the class is about special education and the history and implications of it, we talk about so much more and how what affects spec ed, also affects many more areas of the field of ed. It's a pretty progressive and liberal class. My advice for dealing with him would be, clarify, clarify, clarify, when it comes to assignments and instructions -- you need to stop him and ask him what he really wants out of an assignment. He's only been teaching at Columbia for about 2 years, so he's still new to that. We were all able to laugh and have fun as a class. I recommend him. \nWorkload:\nlots of weekly reading, a quick \"mid-term\" quiz, a large group project, two reaction papers and take-home final\n"
        }
    ]
}