{
    "prof_info": [
        {
            "prof_name": "Dehlia Hannah",
            "prof_id": 10095,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 20, 2010",
            "review_content": "\nI could not have asked for a better CC instructor! Professor Hannah puts an incredible amount of time and effort into the best possible arrangement of the syllabus texts, allowing us to weave them into a fluid and fascinating narrative. Her choices for optional texts provided a framework for each semester and somehow we managed both to delve into the intricacies of each text and to cement each text within the dialogue of Western philosophy. Reading can be significant but is important to complete because she weights class participation heavily rather than exams: first semester our final exam was worth 10% of our final grade, second semester it was worth only 5%, and no midterms. The focus is instead on how well you are reading and personally engaging with the texts. Papers are taken seriously, and doing the work to prepare for class is rewarded; she encourages her students to develop their own take on the text or to give the text an importance in terms of their own interests - for our final paper second semester, the 10 pages went by much more quickly because we had picked our own topics and related some of the year's texts to something we were interested in. She encourages a great classroom dynamic and as a scholar of philosophy herself, she is able to provide an insight into the texts of which I think many other CC professors are not capable. Hannah will challenge you, but you will come away with a great philosophical foundation. Highly recommended!\nWorkload:\nFirst semester: average CC reading, 1 page response papers for each class, 2 five-page papers and a not-too-difficult final exam; Second semester: slightly heavier reading but no response papers, 2 five-page papers and a final 10-page paper on topic of your choice, and short final exam\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 05, 2010",
            "review_content": "\nDelia Hannah navigates through the intimidating CC curriculum with ease.  It often seems as if she has been teaching the class for years.  She has done a particularly good job in engaging my class's unique interests in order to custom tailor essay topics.  She provides observant and articulate responses even for the smallest of response papers. Professor Hannah genuinely cares and wants to get to know all of her students.  She even rewards us with screenings of excellent films during the class that our papers are due.  Although she takes a full class to screen these films, they always compliment our readings in original, provocative, and unexpected ways.  Quite simply, Professor Hannah is an excellent professor.  She is going to make an excellent PhD and professor when she graduates in the spring.\nWorkload:\nDaily response papers can be tough, but they shave down the amount of pages on your essays.  Spring semester she didn't assign daily responses.\n"
        }
    ]
}