{
    "prof_info": [
        {
            "prof_name": "David Smiley",
            "prof_id": 3271,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "The Built Environment",
            "review_date": "February 19, 2013",
            "review_content": "\nProfessor Smiley is my thesis advisor as an urban studies major. Although I had not taken any courses with him prior to our thesis seminar/meetings, he has proven his insight and thoughtfulness. \nSeveral times a week, Smiley sends me a personal email with ideas/articles that relate to my thesis topic, and I am not alone in this He cares deeply about each of his students' work and feels invested in our projects.\nThe Built Environment is the ideal thesis course for urban studies majors. Linn's sociology section is too heavily weighted in interviews/social research. Smiley makes the thesis experience comfortable and enlightening.\nWorkload:\nOccasional reading. Class does not meet every week. Word-count deadlines for thesis leading up to April 17 due date.\n"
        },
        {
            "course_name": "Making the Metropolis",
            "review_date": "May 16, 2012",
            "review_content": "\nProfessor Smiley's class is pretty interesting -- I was a non-major taking the class for fun, and his lectures sort of inspired me to further pursue Urban Studies as a major. I think this was more due to interesting content than his lecturing in general, but I digress.\nSome lectures are really great (I love the City Beautiful movement section) and some of them are really boring and hard to follow (the last few lectures on theory became tumblr time for most people). Smiley doesn't do such a great job of putting the architectural projects into context. I didn't know the background on most of the projects and had to look it up after class (which made the take-home exams extra tricky). However, he speaks very beautifully -- he has a way of phrasing ideas that's just nice to listen to, and thought-provoking.\nIn general, the class is alright. Would recommend to a friend. But not life-changing by any means.\nWorkload:\nWeekly readings + notes (LONG readings, but they're pretty interesting)\n3 Take Home Exams (Take a while, but not too hard, and secretly kind of fun to do)\n1 Final (You get the questions ahead of time, so you can plan your essays out -- not too bad?)\n"
        },
        {
            "course_name": "Making the Metropolis",
            "review_date": "November 18, 2009",
            "review_content": "\nI find Professor Smiley to be a really friendly guy.  Sometimes I find myself getting a little sleepy in class, but I think that is mostly reflective of the fact that the class room is always dark (so that slides are visible).  All the lectures are a series of slides, some of which show really fascinating perspectives of architecture. \nHeavy focus on Le Corbusier and Garden City/City Beautiful stuff.  I was sad that Robert Moses and Jane Jacobs only got like 10 minutes of lecture time during the whole semester.  \nProfessor Smiley will always pause to take questions in class, but I found that people didn't ask questions very often.  I guess my only major complaint about this class is that context is almost never provided.  We looked only at the projects themselves and rarely at the what was happening in the social/political worlds at this time that influenced those projects.  \n\nWorkload:\n3 take home tests (1800 word minimum), 1 final, weekly discussion section. everything is graded by the TA's.\n"
        }
    ]
}