{
    "prof_info": [
        {
            "prof_name": "Elizabeth Kassab",
            "prof_id": 1142,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Issues in Global Feminism",
            "review_date": "July 08, 2004",
            "review_content": "\nThis course was listed simultaneously under IrWaG and MEALAC. Suzanne, as we all affectionately called her (by her middle name), was an awesome professor. This was a seminar class and I had great discussions in it, made friends with her and other classmates and in the end got to write a paper about my own life as a feminist narrative! She has a dry sense of humor at times but is very intelligent, accommodating as well as sensitive. Maybe she is not as amazing a lecturer, which is why I see dislike from the folks who took Topics with her, but for a smaller class like a seminar, she is amazing to interact with. She also respects students for their knowledge and where they're coming from.\nWorkload:\nPretty heavy. A lot of reading each week with critical summaries every week, plus a major research paper at the end. I didn't quite agree with having to do appraisals each week, though by the end she let it slide for a few of the sessions. If you are serious about feminism, open minded and equal, you'll get on her good side and she'll be liberal with work. Definitely take a class with her.\n"
        },
        {
            "course_name": "Topics in Asian Civilization: Middle East & India ",
            "review_date": "April 23, 2003",
            "review_content": "\nMy friends and I are flabbergasted over the reviews for this professor. After walking away from this class, I knew NOTHING about the Middle East, and I frankly don't think that she did either. The only good thing about Kassab is that you don't have to do the reading because if you do, you will fall asleep in class since the only thing she's going to do is regurgitate what the authors say. And even if you do decide to do the reading, it's very, very little. It's a great way to get four points. I was very upset about this class because I feel like she wasted the opportunity to teach over a hundred students about the Middle East- an area of the world which is of interest to students across the country. And this class would have been the perfect venue to open students up to new ideas with primary sources.\nWorkload:\nEASY:) \n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "January 27, 2003",
            "review_content": "\nA wonderful professor. Very organized, concise, empathetic, and caring. I really enjoyed the course and found it to be incredibly relevant and informative, even though I took it initially just to fulfill the major culture's requirement. The combination of the two women profs. is dynamic and keeps you listening and involved. Bad part was a  TA who gave out a slew of failing grades; yes, failing--I kid you not---on term papers that were quite competent.  Also, he gave really low grades--compared to the other TA's--on the midterms.  Totally frustrating to have other TAs handing out  easy A's, while those my lone,sorry section were getting their GPAs kicked for no particular reason.  Soured my experience in an otherwise fine choice for the MC requirement.\nWorkload:\nA lot of reading.You do have to do it, but you can skim it. Exams are not hard if you have the normal TAs. Hopefully, profs will correct the problems that occurred this year with the one TA.\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "January 26, 2003",
            "review_content": "\nI'm not sure how I would feel about taking a class with just Prof. Kassab teaching, but her teaching team with Prof. Bakhle makes for a decent experience (although it always seemed that Kassab looked a bit resentful of the way Bakhle always took over neutral tasks like announcements about the class). Unlike Bakhle's sweeping narratives about South Asian history and culture, Kassab gave very concise, focused lectures, often hinging them on conflicting viewpoints presented in two or three articles on the same topic, which proved useful in the \"Discuss! Have an opinion! Now!\" recitiations. However, her precision was also sometimes frustrating since not having a background in Middle Eastern history I often felt completely without context for these discussions. But, the point is, she basically went over the readings in class and presented several valid ways to think about them, which were useful of course to spit back on papers and the exam essays. And, she even showed a video in lecture once. Can you do better?\nWorkload:\nHer portion of the readings was significantly lighter than Prof. Bakhle's, though still substantial . . . think 1/2 lit hum, though more interesting. The one mid-length paper (7 pages), easy midterm, and slightly harder but still very manageable final were shared with Prof. Bakhle's South Asian material, and study guides were provided for the two ID-style exams, which made studying a process of memorization. Fairly easy way to fulfill major cultures req. and the subject material becomes everyday more relevant as national leaders demonstrate just how little they understand the culture of these areas.\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "December 29, 2002",
            "review_content": "\nNice but her style is a bit dry. The class itself was very interesting as it was split between her and Janaki Bakhle. \nWorkload:\nLoads of reading, one 6-7 page paper, one midterm and a final. Heavy but not overly so. \n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "November 18, 2002",
            "review_content": "\nProfessor Kassab is a passionate teacher with a good sense of the material she lectures on, and how it is relevant to the present day. I found her lectures to be really enjoyable, as they were often fused with a profound sensitivity and empathy (without much political bias) that is often hard to find. The course can be a bit confusing (it's taught topically not chronologically, spending half the time in each region). Some people are really engaged by the material; others are bored stiff. Ultimately your satisfaction of the course will be dependant on your interest in the reading and course material, no matter how much good Professor Kassab can do, or how much the TAs may throw you off.\nWorkload:\nPretty easy. Readings are moderate. Incredibly easy midterm, followed by a final, and a 7 page paper. An additional hour per week is required for a discussion section lead by TAs. This course satisfies the Major Cultures A List requirement.\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "June 14, 2002",
            "review_content": "\nKassab (who teaches the Mid. E. half of the class) herself isn't so bad, but this class is. It's incredibly boring and general. You will learn nothing. And you'll have to go to a section too (avoid George Fiske!!!). I think it would be hard not to do well in this class, but it's not worth the pain. (NB - I think Kassab may just be visiting for a semester or something.)\nWorkload:\nTwo 4-5 pg papers. Final exam w/IDs and two predictable essays. All graded leniently by TAs.\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "May 23, 2002",
            "review_content": "\nThis class is hell. a lot of people take it because it's an easy way to fulfill a requirement (major cultures at CC and SEAS and cultures in comparison at BC) but it's so boring. kassab seems to think all her students are idiots and finds it necessary to define words like, \"monotheism,\" \"reformation\" and ask if we know what happened in 1492. but you get an A. \nWorkload:\n2 papers (easy!) some reading and a final\n"
        }
    ]
}