{
    "prof_info": [
        {
            "prof_name": "Katherine Balkoski",
            "prof_id": 12834,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 10, 2017",
            "review_content": "\nGreat professor. She is very helpful when you write your essays. She takes drafts and will give you a lot of notes and suggestions. She also teaches the material well, focusing on specific scenes and what they reveal about the culture, values, and context of the author(s) of the texts and what the scenes reveal about views on a range of subjects. She goes exactly by the standard syllabus in terms of books we read: nothing more or less. She also has a take-home midterm that's very doable. \nWorkload:\nAbout the same amount of reading per night as most other Lit Hum periods. Take home midterm.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 22, 2016",
            "review_content": "\nKat's the absolute BEST! She's really chill, funny, and she's just an overall pleasure to be around. She has a fantastic attitude toward her job in ensuring that our conversations were dynamic, productive, and applicable- not esoteric, too philosophical, or difficult to relate to- as can be the case when discussing some of the works that established the way we currently think and learn. She also loves group collaboration, so many times instead of just having one long extensive conversation about a book, we would break up into smaller groups; and each group concentrated on a particular theme or event- later presenting to the entire class. Kat's also a pretty generous grader; she has a simple set of expectations, but if you don't take her incredibly helpful comments seriously to actually improve your writing- you can easily end up with the same mediocre grade on each paper. Kat also seems a bit disenfranchised with the whole \"core mentality.\" She doesn't really buy into the whole idea of everyone having the exact same final, which made her expectations for the exam slightly unclear. Regardless, after spending so much class time with her, you get to understand what she expects and all is well. Also, Kat's just an incredibly pleasant person- and likes to make sure everyone has a part in the discussion- so even when people spew absolute nonsense, she never rejects or shuts people down (which probably doesn't do those people any favors). Either way, if you're lucky enough to get Kat- enjoy! You'll have an incredibly positive experience. And, as Kat loves to say... Cheers! \nWorkload:\nStandard LitHum Reading (2-3 hours/week). \nThree essays. \n1 take home final (three essays- its easier than it sounds). \n1 final (same as everyone else). \n\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "January 23, 2014",
            "review_content": "\nGreat teacher! Very chill, homework is a ton, but that is normal for all French classes. She wants you to do well, so she grades with partial credit and extra credit opportunities. \nDownside: You won't learn much French, so even though you do well on everything she gives you (40% of the grade) the rest is department wide, and it will be hella impossible, so the final and especially the oral review and one of the tests in the semester where a grade downer...\nWorkload:\nnormal; very adequate and appropriately assigned!\n"
        }
    ]
}