{
    "prof_info": [
        {
            "prof_name": "Alexander Landfair",
            "prof_id": 9558,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 08, 2011",
            "review_content": "\nYeah, he's a hard grader. But he really teaches you how to write. Alex's mindset of breaking every paragraph down into a mini essay has been my main writing technique ever since I left his class. He actively engages the class in discussions about the readings and really makes you think. You have to do a lot of work, a lot of writing, and get mediocre grades, but I loved this class for what it taught me.\nPlus, shouldn't you want your writing class to be a little difficult? This is, after all, the class that is setting you up for the academic writing in the rest of your college career. \nWorkload:\nA lot of reading, 3 papers\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 31, 2011",
            "review_content": "\nOne of the worst teachers in terms of grading... he claims he wants you to edit your essay certain ways and then he takes off points for following his exact instructions. His class discussions are not too bad but he basically copies other teachers class notes and uses them to lead his class discussions.  One of the most stressful people to deal with if you're looking to do well and you end up in a very intelligent class because he really really believes in a very rough grade distribution.  Although some UW teachers care more about the ideas they discuss in lecture and then grade fairly leniently on the papers, Alexander Landfair is certainly not one of them.\nWorkload:\n- 4 essays but really 8 because he always wants the final draft to be drastically different from the first\n- reading passages and filling out a worksheet about them for every class\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 12, 2011",
            "review_content": "\nAlex is a great teacher for university writing. He focuse more on the structure of your essay and the presentation of your argument than on grammar. Thanks to him, UW was much more than a writing course, we actually had some \"fun\" classes too. The topics we talked about in class were really interesting, and the class size was just right for intimate discussions. In general, the class experience with Alex was one of my favorite last semester.\nThe only possible downside for him is his somewhat harsh grading. But he gives you plenty of feedback (including a meeting with him after the first draft) and a lot of guidance when you talk to him or email him more often about your ideas and arrangement of arguments. Following his feedback can certainly get you a decent grade. \nHe might seem moer challenging than other UW teachers but i really felt my writing really improved over the course of the semester.\nWorkload:\n4 big essays. Reading worksheets for every class at the beginning of the semester, which were kind of time consuming.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 22, 2010",
            "review_content": "\nOh, Alexander. Thanks for one of the most befuddling semesters of my college career. What were you looking for in your grading? Why would you say one thing in a one-on-one review session and then completely contradict yourself the next time you looked at my paper? Why was your advice to completely obtuse and confusing? Why were you a complete asshole?\nLandfair is a decently nice guy, and even funny in class. However, he was incredibly intense about grading and couldn't seem to make up his mind about what his expectations were. Also, he is a poetry student and it shows-his \"advice\" is really this nebulous cloud of how things \"feel\" that doesn't actually help you when it comes time to revise anything.\nWorkload:\nStandard UW essay sequence, but be prepared to work your ass off to stay ahead of him changing his mind.\n"
        }
    ]
}