{
    "prof_info": [
        {
            "prof_name": "Shahid Naeem",
            "prof_id": 3100,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Bio",
            "review_date": "September 29, 2015",
            "review_content": "\nHe is a very engaging lecturer, but the way he teaches this class is terrible.\nThe lectures have very, very little to do with the chapters we are reading. If he does go over something it is fast and at the most cursory level. There is massive amounts of reading and he gives you review sheets that supposedly cover the breadth of the test. \nYou honestly might not even do all the work because the majority of the test is on his philosophical musings on the nature of the universe. Taking notes in his class is a nightmare. For instance, he will mention fermions in passing once, with no emphasis. The textbook does not even reference them once. You will have a detailed question on the exam about fermions that has nothing to do with what he actually taught or what you might be able to read in the book. All of the vocabulary, all of the work of studying processes and the items he puts on the review sheets (ie. actual biology) are not really on the test. (Honestly maybe at best 20%).\nIf I had to do this over again, I would have dropped this class before the shopping period was up. I was thinking about going into Environmental Biology, but I don't want to take any more classes with this professor (who I believe also teaches the companion class.)\nUnless you are 100% absolutely going into the major, don't consider it.\nWorkload:\nTons of reading, but no \"homework.\" You are expected to come into the class with a real mastery of biology and chemistry despite what the course description says. If you do not come with this kind of pre-requisite knowledge (I was somewhere a little below mastery) and it will be a struggle.\n"
        },
        {
            "course_name": "Environmental Biology",
            "review_date": "January 29, 2014",
            "review_content": "\nHe definitely has a lot of personality and passion for the subject, and it seemed like he was always leaving right after class to go speak in some other country about saving the world. He's a very high profile professor.\nI didn't enjoy the half of the class he taught. Although the things we went over in class were interesting, the bulk of his course is in the readings you have to do on your own. It's fine to make students do that, especially in a science class, but the tests only seemed to assess our knowledge of the most trivial things in the textbook. For instance, one time the entire first page of a test was a blank list of all the animal phyla in existence and the categories they belonged to, and you had to fill it all in. I don't mind doing hard memorization work for things like that, but I got fed up when I realized there was no reason at all for him to make us remember this stuff. I found myself frantically memorizing a billion different latin names, most of which had perhaps just one or two insignificant species (according to the textbook). \nIf you've taken general chemistry here, you can expect the same kind of anonymous, sporadically entertaining teaching style from the chem lecturers. \nOverall, my experience with this class made me lose interest completely in the e3b department. \nWorkload:\nYour entire grade is based on four exams, each worth the same amount. There's no homework, but each of the exams covers a massive amount of material (even for a bio class) and requires about 150+ pages of reading in the text. Then there's also the hours and hours you're expected to spend drilling vocab. Professor Naeem compared it to learning Spanish (and I agreed).\n"
        },
        {
            "course_name": "Environmental Biology",
            "review_date": "November 18, 2010",
            "review_content": "\nProfessor Naeem is a very engaging lecturer. His colorful slides, quirky sense of humor, and approach to the subject matter make it hard to be bored in class, especially if you are genuinely interested in a subject matter (most students are). Naeem is clearly very knowledgeable, and often goes on tangents to talk about things he finds interesting. This would be annoying, except that he usually ties it back nicely to the lecture. \nThe only problem with this class isn't the professor, but the workload. Although the material is mostly mentioned in class, students will still have to read and memorize chapters upon chapters of terms and concepts that may seem random and too complex for independent study. \nTake this class if you're willing to put in 100%, don't if you're expecting an easy A or to fulfill your science requirement.\nWorkload:\n4 tests. Lowest grade dropped.\n"
        },
        {
            "course_name": "Environmental Biology 1",
            "review_date": "December 29, 2008",
            "review_content": "\nNaeem is an E3B rockstar. This class, for the first half which he taught, was an amazing class. His lectures are fast-paced, colorful whirlwind of his favorite facts and anecdotes, working to cover all the information which a \"good biologist should know.\" This unfortunately means a LOT of memorization, but it's cool stuff - if you're into biology, his style of instruction will be perfect for you. \nRead the assigned textbook material and TAKE NOTES before every lecture! DO NOT skip a chapter! And pay attention in every one of his lectures! Particularly remember to study anything he draws a lot of attention to or says that a \"good biologist should know.\"  Draw massive asterisks next to that information so you remember to come back and memorize all those tables and charts. Seriously - memorize those tables and charts. It will all be on the exam.\nAll of it.\nWorkload:\nMassive amounts of memorization. Empty your brain so you can fill it with plant and animal phyla and different types of tissues, hormones, and immune system components. Empty it now.\nRead, read, read - he'll assign about 3 or 4 chapters on a good week. And you need to know them. \nNo graded assignments except the exams. \n"
        },
        {
            "course_name": "Environmental Biology I",
            "review_date": "December 29, 2006",
            "review_content": "\nNaeem is a very engaging lecturer, with much personal experience to share.  He taught only half of the course, and his tests were more general than the second professor's.  Overall a good course, if you manage to stay on top of the material.  Slideshows are online.\nWorkload:\n3 tests, 1 final\n"
        }
    ]
}