{
    "prof_info": [
        {
            "prof_name": "Francois Gerard",
            "prof_id": 12812,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Public Economics",
            "review_date": "May 18, 2015",
            "review_content": "\nUp there as one of the worst professors I've had at Columbia. He didn't make an effort to make class interesting or worth attending, and he certainly didn't make an effort to seem like he cared about his students. He was rather rude or callous at times to my own and my peers' concern about homework or exams. I took this class against the recommend of a friend, and I would not recommend it to others.\nAt the same time, the material isn't horribly difficult to understand. This class probably ranks as an average to above average difficulty class in terms of economics electives depending on the person. Again, prof = bad.\nWorkload:\nA problem set about every two weeks, so not awful. Grading for psets was on a weird scale I remember. Exams were medium difficulty and based off homework more or less.\n"
        },
        {
            "course_name": "Public Economics",
            "review_date": "January 08, 2014",
            "review_content": "\nAvoid this course. Save yourself. I sacrificed myself to help you. \nWorst \"professor\" I've had at Columbia, and there are quite a few bad ones out there. No one showed to class because he is entirely a bore, uses the slides from the book to \"teach\", and is half asleep for every lecture.\nThe TA was helpful at times, but a lot of times he would respond to your question with \"I can't tell you that. That would be cheating.\" Meanwhile, you're just like wait...what? This is a homework assignment...I'm at your TA office hours...there's 10 other people sitting right here who don't get it either...Wait. What?\nAs far as the material, the course is pretty much like Microeconomics but with governmental topics like taxes, redistribution, health care, etc.\n\nWorkload:\nNot that bad. Problem sets roughly once every two weeks. \n"
        }
    ]
}