{
    "prof_info": [
        {
            "prof_name": "Carole Slade",
            "prof_id": 752,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 28, 2012",
            "review_content": "\nThis woman has helped me grow as a thinker, as a student, and as a person. She fosters discussion, she contributes her own thoughts on the subject, and she always tries to make sures that students are not only understanding the subject matter but are enjoying it. She is a quirky instructor and often amusing to watch, but she is just as amused by us. I especially respect and appreciate when she admits her own limitations in a subject; for example, not fully understanding a scientific concept and asking if any students are familiar and could explain better than she. She does this because we have our own limitations and it gives balance to the class. She does not penalize; she just asks for better behavior. This is not an easy class to teach because the material can be very dense and the students can often lose interest, but Carole maintains our focus and engages us and challenges us every step of the way. She manages it with such grace and I know that I am not alone in my great respect for her as a teacher and as a mentor.\nWe were never assigned anything extra. She would add or remove items from the syllabus as needed, which could be frustrating for one's own personal schedule planning, but overall made the course much more manageable and effective. Essays were standard and exams were appropriately balanced. \nWorkload:\nStandard reading for each class; often full texts were expected to be completed but she was not too strict about it and class discussion bounces around the book a fair amount so you can catch on easily. 2-3 essays, 2 midterms, and a non-cumulative final. Fair grader.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 20, 2012",
            "review_content": "\nI'm only one month into Prof. Slade's CC class it has officially become the worst class I've ever taken at Columbia. Yes, she's worse than FoSci. I genuinely can't fathom how she gets by as a professor (!!) at Columbia if all she does is asking the most obvious and irrelevant questions, reiterating the authors' points as they appear in the book, confusing herself in the middle of her sentences and directing class discussion to a point of pure frustration and fatigue that people who actually read the books don't bother to speak (she talks way too slowly, with way too many pauses and \"um... ah...\"s to deliver her information before people know what she's gonna say). Her strict adherence to the definition of terms only reveals her inadequate understanding of the more general concepts. Seriously, I don't need someone to tell me that Hume is an empiricist. I learn so much more from just reading the Stanford Encyclopedia of Philosophy than the class I'm paying thousands of dollars for. She's perhaps nice, but the one time I actually talked to her and pointed out a possible mistake in her email (she wrote equity instead of equality) she got all defensive and accusatory. So here goes niceness. She and her class are the polar opposites of my first-semester CC class which was engaging, illuminating and inspired me to read extensively outside of the syllabus. \nIn short, AVOID Prof. Slade. She is not at all knowledgeable about the CC syllabus. I haven't read her own scholarly works. Perhaps they are insightful. Perhaps her Lit Hum class would be better. I simply don't understand why she's appointed to teach CC. I hope the rest of my Columbia experience doesn't get worse than this. \nWorkload:\nIrregular postings, 2 midterms, 1 final, 2 papers on the most self-explanatory/uninteresting topics \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 19, 2011",
            "review_content": "\nI racked my brain trying to think of a  nice thing to say about her and came up with, she's usually on time to class. In short, she has the unmatched skill to suck suck out the life in all of her students in the span of 2 hours. She makes the moderately interesting Lithum syllabus an insurmountable burden. She is unengaging and not very receptive of student's comments or ideas which disagree with hers. I'm not sure which Slade the reviewers before me encountered but maybe something happened between the semesters because the woman I had was not at all sweet, nor did she ever seem to be on my side (or anyone else for that matter) grade and material comprehension wise. I got a not so perfect grade on her first paper and discussed what improvements I could have made in her office hours. I then made sure for her second paper, I made every improvement she suggested (some of which were very obvious mistakes) and discussed my ideas with her before beginning it. I even changes a great deal of my thesis arguments to fit the ideas she suggested, went to the writing center and was told my paper was excellent, EXCELLENT, only to receive the same EXACT mediocre grade as on the first paper. In short AVOID HER. She's not here for you...\nWorkload:\n2 papers, 2 in class midterms (what do you think you are, a science class?), and 1 final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 22, 2010",
            "review_content": "\nProf. Slade is interesting, sweet, and a caring woman. She is one of those teachers who is \"on your side\" in terms of grades and is not out to try to make you fail. She is encouraging and very useful during office hours. She is very intelligent and adds resources outside of the normal lit hum texts to relate them back to the readings. I've enjoyed my first semester of lit hum w/ her thus far and I am looking forward to the next one.\nWorkload:\n2 tests, 2 papers, 1 final\nlight workload\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 20, 2010",
            "review_content": "\nProfessor Slade is a very nice woman who grades fairly easily. She'll answer a question if no one answers. Also, if you go to her office hours and ask for help, she's always more than willing to do so. \nShe knows a lot of history and has a lot of knowledge, but sometimes it's inevitable that people are going to fall asleep, given that it is an hour and fifty minutes. \nShe grades harder on take home essays than midterms, so midterms are the chance to boost your grade. The final is also pretty easy after taking two different midterms of similar structure, so she prepares you pretty well. \nWorkload:\nNormal Lit Hum courseload. Two essays (each 100), two midterms (each 100), participation (200) and final (200)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 12, 2010",
            "review_content": "\nCarol Slade is a gentle and sweet woman with a pleasant character and easy going attitude. But more than that, she's an amazing professor and resource. Some might say that she's an easy grader, but in reality she's just fair. She gave my class two exams instead of a midterm, which boosted all of our grades, and often hands out pop quizzes on which everyone gets an A, regardless of how well they really knew the material. While at times class can be slow, she's always amusing and fun, if for no reason than because she uses antiquated slang to try to fit in with the kids and always has cool sunglasses.\nI definitely recommend taking her for a class that's easy to look forward to, to participate in, and to enjoy.\nWorkload:\neasy\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 01, 2010",
            "review_content": "\nProfessor Slade is a very nice woman.  She knows a lot about the different books but has trouble getting class discussion.  Usually when she asks a question if no one responds she simply keeps talking.  On random occasions she calls on people if you happen to be making eye contact but for the most part she just continues talking herself.\nTwo midterms, two papers, participation and the final are each worth 25%.  She is a fair grader, not too hard and not too easy.  Just listen to discussion and that is basically what the tests are on (same format as the final).  Overall, she is a nice woman and a fair grader, just a little boring.\nWorkload:\nReadings for each class like all literature humanities classes, is a lot of reading but she is very understanding when you havent done the reading\ntwo midterms which are not too bad, just about what class discussion is on\nSometimes she has posting online (one or two each semester), and she assigns you small sections on the reading and you present\nOverall good teacher\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 07, 2006",
            "review_content": "\nCarole Slade is a very nice woman, but she doesn't know how to hold a class-wide discussion and usually ends up mumbling and laughing to herself in a sadly endearing way. She does know a lot, and she hands out dittos to add background info to the books. Unfortunately, it seems like she doesn't trust her students with big questions. She tends to ask simple questions that no one wants to answer because they're just too easy. Even people who try to participate are not appreciated by her. She is rarely ever satisfied with an answer, usually giving a weird moaning \"Uhhhhh.. well, no, not exaaactly..\" in reply to someone's opinion. I feel bad because she tries REALLY HARD, but I guess I'd have to say she is just not a good teacher. A very nice person, though, and a fair grader. The paper topics are usually pretty specific, and she provides the pages on which you can find what you need to write your paper. I found myself writing my papers in less than 4 hours on the days they were due and getting As. As long as you understand the texts and understand what she wants you to do (which is almost always clearly stated on the assignment sheets she gives you), you'll do fine. \nWorkload:\n3 Papers, midterm, and final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 16, 2001",
            "review_content": "\nI strongly disagree with the comments made in the other review. Prof. Slade is a kind, though often disheveled and spaced out woman. She is VERY familiar with material she is teaching, places all texts in historical context, and explains why each book is significant. I believe my lithum section had at at most two quizzes throughout the whole semester. As Prof Slade explained on day one, if it is clear that no one has done the reading, we will be quizzed.\nWorkload:\nstandard lithum reading, 2 or 3 papers, and one \"creative project\" to pad your grade (i wrote about don quixote from his horse's point of view). She's an easy grader and will give extensions when necessary.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 12, 2001",
            "review_content": "\nDear god, I had a horrible experience with this woman. Essentially (in case you don't want to read the remainder of the paragraph) she can be summarized as such: DO NOT take lit hum with her. First of all, she manages to make genuinely interesting material absolutely stultifying by droning on forever about the most inane, most obvious aspects of all those ancient greek texts. And when she finally gets to some more obscure, more interesting topic, she ends up making mistakes, screwing up her points, and second guessing herself. (\"wait... actually... nevermind, I don't think Actaeon was Pentheus's cousin... wait.. was he? ... well, I don't think it matters...\") Furthermore, each attempt she makes to initiate class discussion dies on impact because every kid in the class (except, occasionally, the obnoxious girl who makes stupid comments unnecessarily) finds the answers to her questions too damn obvious/irrelevant to bother voicing. And as such, classes consist mostly of Professor Slade speaking slowly (in her extremely grating, self-amused voice) about wholly useless, uninteresting things. Second of all, Slade seems (in a rather paranoid, accusatory way) convinced that her students will totally neglect to do the work assigned unless she tries to catch them off-guard, and so she gives obscure quizzes at the beginning of class once a week - quizzes designed (as she says) to separate those who have not done the reading from those who have. Instead, they end up penalizing just about everyone equally, considering the obscure subject matter they cover. In any case, good luck trying to convince this woman that the fact that you read a book does not mean that you did not function as an informational vacuum cleaner while doing so. And good luck keeping your eyes open and your sanity intact for two hours at a time. For God's sake, lit hum is long enough, but this woman's lectures will have you fishing for the Sisyphan references in the Odyssey and feeding your caffeine addictions for a hundred and ten minutes straight.\nWorkload:\nStandard lit hum required readings. 2 papers. Weekly quizzes (which require actually studying the assigned books, not just reading them, because they're somewhat tough). Midterm and Final (I walked out of the midterm expecting an A & ended up with a C+; who knows).\n"
        },
        {
            "course_name": "V3407 Mysticism",
            "review_date": "December 31, 1999",
            "review_content": "\nProf Slade is very boring. She seems unsure of what she is going to say next. Often times she pulls her hair over her ears because she is nervous. She will plug her book on Christian Saints nearly 5 times during class. While the subject matter is interesting, the teacher is not. She grades fairly easily and there is little work involved.\nWorkload:\n1 8-12 pg paper at the end, midterm, final. grades easily.\n"
        }
    ]
}