{
    "prof_info": [
        {
            "prof_name": "Reem Faraj",
            "prof_id": 5577,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Second Year Arabic 1 ",
            "review_date": "May 09, 2013",
            "review_content": "\nHere is a small fact: Arabic is horrifically tough.  No, I don't mean, \"Ugh we have 800 pages of reading but if you just skim the summaries we can get done in four hours\" tough, but \"Oh my god I have taken this language for 15 months straight and just now learned the word for 'bad'\" tough.  Your friends taking Spanish and Italian will get to study abroad using what they learned in class, and you will go to Jordan and speak MSA (because Columbia stubbornly refuses to allow dialect classes) and look weird.  Do you know what the jussive case is?  Do you want to know?  This language is not for the faint of heart.  \nAll this being said, you're going to want Reem to be with you through the tough times.  She is demanding in terms of wanting students to understand what a lifelong commitment learning Arabic is, but empathetic in that she understands that the textbook will sometimes suck, that you will cry if you end up having to conjugate the dual form on the fly, and that you've probably got four other classes to deal with in addition to this 5-credit monstrosity.  This does not mean that she's going to give you an A+ for showing up for every class, but she's been flexible with letting us turn in second drafts of writing assignments, turn in homework for new grammatical concepts after we go over it in class, etc.  Arabic grammar \"rules\" have so many exceptions that they're hardly rules at all, and Reem understands this and is perfectly happy to go over concepts multiple times, sometimes even admitting that she has trouble as a native speaker remembering all the nuances (I'm looking at you, numbers, counted nouns, and case endings).  You cannot get through this class skipping work, but she understands the workload.  My advice?  Do all your homework (probably about 10 hours' worth) on the weekend and save the week for re-writes and reviewing.  Will this amount of homework suck?  Yes.  Are you taking Arabic?  Get used to it.  \nMy one gripe with this class is the lack of speaking, but honestly every introductory or intermediate Arabic class I've been in has been very grammar and vocab heavy, which leaves very little time to speak, so this is not a criticism of Reem's teaching style but more the nature of the beast.  There's a huge base of information you need before you can even begin to properly form sentences that go beyond \"I ran\", \"She ate\", \"They went to Jordan\", and I'm hopeful that higher level classes will have more speaking.  \nPerhaps my feelings toward Arabic come off as rather snarky, and this attitude is pretty prevalent among learners wherever I've been (http://arabicproblems.tumblr.com/), whether abroad or at other universities.  At the end of the day, though, Arabic and Reem teach you how to learn something completely different than anything you've experienced before, and I think that's a handy skill to have throughout life.  You've got to be diligent, it helps to have someone who understands that things are tough but doesn't give you an excuse to give up or slack off, and I can honestly say that my past two classes with Reem have been the best Arabic instruction I've ever received.   \n\nWorkload:\nAbout 10 hours of homework a week (essays, worksheets, reading, listening) in addition to just straight studying new concepts.  4 tests per semester, 1 final with writing/listening/reading/grammar.  \n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "December 05, 2012",
            "review_content": "\nI could not disagree more with the post before mine. Her class was very, very good. The syllabus is departmental, so it's very well thought out and everyone in other classes are doing the same things at the same time. However, she makes sure not to move on unless everyone understands everything. Her priority is for students to learn and really know the language, so grades definitely fall behind that. She will edit and mark every assignment handed in, even if the purpose wasn't vocabulary or grammar, she'll check for it and follow up with you about it. At one point near the end of the semester before the exam, she even took a huge chunk of a class time to go over all of the mistakes made on a writing assignment, even though they were things we \"should\" already know or were sort of the foundations of the language that we missed or forgot about, something I've been denied doing in other Arabic classes I've taken. Reem genuinely cares about her students, has always made herself available to me and my classmates, and makes it clear when she is free. For example, she definitely won't check her email on Saturdays and Sunday, so don't count on that, but she'll always be free otherwise. She's very personable, is great at explaining the many difficult grammar rules, and if a student doesn't understand something, she will come up with a new way to explain it. I recommend taking Arabic with her.\nWorkload:\nThere's a pretty big workload, about two hours of work a night, but between quizzes and daily homework, you end up getting so much regular practice in that when exam time rolls around, it's not so overwhelming.\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "May 18, 2009",
            "review_content": "\nDon't even think about taking this instructor if you want to learn Arabic.  Inconsistent, permits regular use of dialect including her own. Dialect is really wonderful when learning how to understand this magnificent, beautiful language, but the standard for all other Arabic professors, and the Department, is MSA (modern standard arabic).  She favors certain students (regardless of how hard anyone works) and lets some do homework in class, and ignores others altogether.  Don't expect her to be too available for you.  You'll find yourself relying solely on the book, a tutor, other Arabic speaking-- or learning-- friends, the grace of the heavens or some other spiritual source, or all of the above.  When it comes to Arabic, you will need all the things she is not.   One good thing - if she likes you, she'll let you do anything you want.  \nWorkload:\nDepartmental syllabus.  However, she adds a sizeable amount of vocabulary and  will tell you that it is on the quizzes (5 or 6 a semester) and the final -- and it is NOT.  Stick to the book, and memorize every vocabulary word in it.  Oral presentation is relatively easy - if you like having your classmates grade you...she includes THEIR grade in to your grade.  Translation: make friends in class early. \n"
        }
    ]
}