{
    "prof_info": [
        {
            "prof_name": "Suman Mallipattana",
            "prof_id": 5389,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "January 14, 2010",
            "review_content": "\nExcellent professor! She is very sweet and genuinely interested in each student's welfare; the small number of students in the class allows her to really get to know you personally and your strengths and weaknesses as a student, which she accommodates in class. She has a background in French so her familiarity with linguistic intricacies and grammar makes her explanations, typically, clear. When they aren't, feel free to ask her to re-explain - she'll try until you understand.\nThe class is structured around concise introductions of that day's grammar and vocabulary followed by a significant number of practice exercises which typically mean, if you focus in class, you will learn most of the material pretty thoroughly without having to put in a lot of outside work. When you aren't doing grammar exercises, you will most likely be having a very tangential conversation about some element of Indian culture or piece of history or watching YouTube clips of famous Bollywood songs.\nWorkload:\n1-2 grammar exercises per day are the staple of the homework. Occasionally there will be response sheets with a few questions related to a story read in class or grammar worksheets.\nThere is one midterm covering basic vocabulary and grammar which she will prepare you for and list before the exam and a final comprising three parts: reading out loud plus an oral conversation, a dictation (she will read something out loud and you will write it down - focus here is on spelling, but Hindi is phonetic so it's intuitive), and a conventional paper exam.\nThe pacing and workload of this class are reasonable and simply paying attention in class can get you most of the way to a firm understanding of the language.\n"
        },
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "December 20, 2009",
            "review_content": "\nSuman ji is incredibly nice and brightened my morning each day.  She tries to make Hindi fun with songs from Bollywood movies and food, and I have to say she succeeds in that regard.  She wasn't the best at explaining the intricacies of grammar, but she was absolutely a capable teacher and she's really good at making sure everyone in the class is catching on to things.  She makes it very easy to review for quizzes, which covered vocabulary, grammar, translation, etc.  I don't know about the rest of the options out there, but I say Suman is a good pick.\nWorkload:\nDaily homework exercises (completion grade), quizzes every two weeks or so, midterm and final.\n"
        }
    ]
}