{
    "prof_info": [
        {
            "prof_name": "Anne Boyman",
            "prof_id": 827,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced French Phonetics",
            "review_date": "December 24, 2012",
            "review_content": "\nI LOVE ANNE. You absolutely should take her class. Not just this class either. You should take all of her classes.\nWhat's really great about this class in particular though is that it will perfect your french pronunciation. Does this sound hard? Even impossible? It's not. And Anne is just the professor to do it. She creates sort of a \"safe space\" environment unintentionally. That is to say that yes she will correct your pronunciation in front of the whole class (OMG 9 WHOLE PEOPLE), but that happens to everyone. EVERYONE. So it's fine. It's in no way humiliating, and it helps the other students hear mistakes (which is sort of the first step towards perfect pronunciation.) Really this class is like first grade phonetics. But you're in college. So I think you can handle it, whoever you are. \nAnd now a short list of things that are great about Anne:\n--She's the sweetest teacher ever\n--She switches between English and French, so if something isn't clear to you in French, she'll explain it in English\n--She speaks SUPER clearly, exaggerating sounds so that you start to get a really good sense of what words you've always been mispronouncing without knowing it actually sound like\n--She just an all-around baller\nWorkload:\nVery light. Anne thinks it's a lot of work. No.....\nSome short transcription (i.e.: when you write out the sounds phonetically in IPA) worksheets, a midterm (easy), and final (easy). I think if you are doing well on the worksheets you'll be fine for the final/midterm. And either way, Anne will make sure you're prepared.\n"
        },
        {
            "course_name": "Advanced French Phonetics",
            "review_date": "February 07, 2011",
            "review_content": "\nThis class was insanely easy.  That's not to say I didn't learn a ton. I came into this class thinking my accent was pretty good, but Professor Boyman taught me the ins and outs of proper pronunciation and transcription.  This class can be fun at times (talking about nasals and learning funny words from the extremely silly textbook) and utterly boring at other times (les dialogues).  If you take this class, it's an easy A and you will improve your pronunciation dramatically.  Be aware, however, that Professor Boyman will rip your pronunciation apart.  She doesn't mean to be rude or anything; she just wants to help.  \nWorkload:\nWeekly exercises at the language lab (I didn't go once and I got an A), occasional transcription exercises, a midterm (pay attention to \"mode croissant,\" \"l'accent tonique,\" and the other concepts introduced in class--it's not just transcription), and a final, which is pretty much just transcription. \n"
        },
        {
            "course_name": "French Women Writers since 1945",
            "review_date": "January 25, 2009",
            "review_content": "\nThe title of this course is deceptive.  You don't learn about French women writers.  You learn about four women who fit one very specific movement within 20th century Marxist France.  Granted, fascinating and influential writers, but jeez.  This is all about hearing Boyman namedrop.  She lectures constantly even though discussion is really a better format for this course; she expects you to be familiar with Robbe-Grillet and Sartre without assigning them in the course.  No one wants more reading, but more assignments really would have been better for overall course cohesion.  Classes were endless.  Sometimes they would turn into a one-on-one conversation between the prof and her favorite student; that's a sign you need to be doing something different in your teaching method.  Her corrections of your French are appreciated and not as harsh as other reviewers seem to think.  The final paper was thrown at us with little direction, and since all we learned was that Sarraute and Lacan exist--not how to read them side by side, these are some reading strategies, these are some criticisms, just they exist and this is wonderful, right? (Boyman always ends her sentences with a question, either \"yeah?\" or \"right?\" as though she thinks she's inviting you to disagree with her... ha!)--I floundered.  I think some students adored her, but I'd find a different class next time.\nWorkload:\na fair bit of reading in French which can be difficult without a dictionary.  midterm, final paper, one in-class presentation unless you're a brown-nosing mouse in which case your oral is a private conversation with her.  tough grading unless she likes you.\n"
        },
        {
            "course_name": "Advanced French Phonetics",
            "review_date": "June 14, 2007",
            "review_content": "\nThis is the most practical and useful French class I've taken at Columbia.  Grammar classes are a must if you want to be fluent, but this class improves your French accent and pronunciation ten times over.  The class is all  phonetic exercises and drills, but it's not a lot of work.  Professor Boyman assigns one sheet of 15-20 sentences for you to transcribe into phonetic symbols (which she'll teach you and spend the whole semester drilling into you), and then you spend the whole class discussing and practicing pronunciation.  I really recommend this class.  Be warned that Professor Boyman is very blunt and she will pick your accent apart, but it's all to help you perfect it.  She will pick on EVERYONE--not just you, and the class is small so you'll be chummy with everyone.  Take her comments in stride, and you'll learn a lot from her.\nWorkload:\nPhonetic exercises for every class.  A midterm and a final.  \n"
        },
        {
            "course_name": "Advanced Oral French",
            "review_date": "June 14, 2007",
            "review_content": "\nEasy and helpful.  The class is basically a conversation class.  You watch movies and discuss them.  Boyman proposes gossip and you discuss it.  You discuss life, politics, love, poetry, literature, whatever you want in French--it's the students' choice, for the most part.  It's all very informal and helpful.  Boyman is really relaxed, but she does really dissect your accent to help you improve it.  By the third week into the semester, she'll know everyone's weaknesses and will call you on yours.  BUT, don't get scared off.  The class is small (10-15 people) and she only targets your weaknesses to help.  Don't be insulted if she picks on you, because she will pick on everyone indiscriminately.  Your grammar won't improve, but your comfort level in speaking French will.  The class is a breeze, but it's not an easy A.  If you really, really try, though, you'll do fine.  \nWorkload:\nPractically no work.  It's all oral evaluation on a daily basis.  Boyman grades you on how much you progress and pick up on her tips.  The midterm is a 15-minute conversation with her and the final is a 20-minute conversation, as well.  There is also a 30-minute presentation in between.  The point is to get you talking.  \n"
        },
        {
            "course_name": "Advanced Oral French",
            "review_date": "May 06, 2007",
            "review_content": "\nAnne is amazing. If you do not like her, then you do not know how to speak French. If she tells you that your pronunciation is bad - then it is bad. She is just saving you from future ridicule at the hands of the French. If you speak French like a cow, you should take a lower-level language class. If you do not think that you speak French like a cow, then show up on the first day of class and Anne will tell you whether you speak French like a cow or not.  She will kindly ask you to wait a few semesters if this is the case. This class is really fun and is a pleasure to attend. If it feels too easy, do not worry. Your French really will improve.\nWorkload:\nOne major oral presentation (lasting 75 minutes, but this can be extended to 150 minutes over two classes if your topic is interesting enough). After that, it is generally a breeze, but you must participate in class and be vocal. Make sure to attend all sessions.\n"
        },
        {
            "course_name": "Advanced French Phonetics",
            "review_date": "December 17, 2006",
            "review_content": "\nShe's laid-back yet serious about improving your pronunciation and overall French.  Her attitude may be a bit obnoxious at times, but overall she is very agreeable.  She really connects with her students and knows how to help us learn most efficiently.  Amazing professor.  \nWorkload:\nReally light.\n"
        },
        {
            "course_name": "Rapid Reading & Translation",
            "review_date": "March 11, 2006",
            "review_content": "\nBest French class I've ever had.  Anne encourages discussion and disagreement, even with herself.  The workload was more than fair, and the classwork was exactly on the level of difficulty of the midterm & final.\nWorkload:\nReading assignments that aren't really necessary, midterm & final.\n"
        },
        {
            "course_name": "Advanced Oral French",
            "review_date": "September 06, 2005",
            "review_content": "\nShe is very precise in correcting you, but it pays off.  Later, when I thought the class was maybe too easy because every day was simply an enjoyable conversation, but then I realized in a phone conversation with a fracophone friend later just how much I had improved over the semester.   She focused on our interests, talked on a wide range of subjects and gave frequent and helpful feedback each class. \nWorkload:\nOne or two in-class presentations and a reading with her for your final.  Very light outside of class, but high participation expectations in class. \n"
        },
        {
            "course_name": "Advanced Oral French",
            "review_date": "May 27, 2005",
            "review_content": "\nJust the best. If you're serious about wanting to become fluent, you will welcome her corrections of your pronunciation. Her comments were never derisive, always constructive. When she disagrees with you, don't misinterpret her direct tone as sterness; not only does she just want to see you improve but she's often playing with the whole strict French teacher stereotype. That is, you're in on the joke with Boyman. She's funny, encouraging and enjoys deconstructing cinematic norms during class free days. Three point class, seriously, take this. \nWorkload:\nJust show up. The lack of prepared work will allow shy speakers to open up without worrying about doing/understanding homework/readings, and will have you thinking more spontaneously in French. One class-long presentation on anything so long as it is academic. Oral \"midterm\" and \"final\" that were really just progress reports which made me long for high school days where every teacher took the time to personally inform students of their strengths and weaknesses before their grades are submitted. \n"
        },
        {
            "course_name": "Advanced French Phonetics",
            "review_date": "December 24, 2004",
            "review_content": "\nThis is a great class to take to improve your pronunciation. Although at first it feels like we focus way too much on transcription, it's actually very helpful. The course load is light but you should definitely keep up and make sure you know the rules. It's an easy b but not as easy of an A as you'd expect. Boymann is really excited about teaching you how to pronounce your nasals, which is pretty cool because otherwise you'd be bored to tears. She's very understanding of people's problems and criticizes in a way that's helpful without making you feel stupid. \nWorkload:\nsome transcription exercises and language lab practices, shouldn't take more than two or three hours a week, a midterm and a final with just transcriptions\n"
        },
        {
            "course_name": "Intermediate II",
            "review_date": "December 29, 2003",
            "review_content": "\nThis is the best french teacher I've had this side of the atlantic. She is heaven compared to the anal grad students they have teaching across the street. She truly wants you to learn French, and will not get bogged down in the infinite details and exceptions, but would rather have you become proficient in the everyday lanuage. I concur, soo sweet. \nALSO Barnard Intermediate II is only twice a week, as opposed to 4 times a week at columbia. Check this out!!!\nWorkload:\nhomework that she doesn't collect, a couple of softball papers, easy tests\n"
        },
        {
            "course_name": "Advanced Oral French",
            "review_date": "January 24, 2003",
            "review_content": "\nShe is a sweetheart. Anyone who has any complaints about this course doesn't know how to speak French. If she criticizes you, you deserve it. When it comes to languages, you need the commentary she provides about your ability. \n"
        },
        {
            "course_name": "Advanced Oral French",
            "review_date": "January 20, 2003",
            "review_content": "\nThe class was easy and did not require any work.  The class was not the problem.  The professor was rude, condescending and obnoxious.  Because of her I never took French again.  If you think it was my abiltiy that influenced my opinion, that is not correct, I recieved an A.  \nWorkload:\ntalk alot and kiss her you know what\n"
        },
        {
            "course_name": "Intermediate II",
            "review_date": "December 15, 2001",
            "review_content": "\nSooooooo sweet. Participate in class and she'll love you forever. The class isn't fascinating, but hey, it's intermediate grammar. I really liked her.\nWorkload:\nLovely -- homework that never gets collected; 2 essays; a couple of unit quizzes, and a final. No problem at all.\n"
        }
    ]
}