{
    "prof_info": [
        {
            "prof_name": "Hendrik Hamer",
            "prof_id": 2147,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 02, 2007",
            "review_content": "\nErik was a great professor! He's very friendly and approachable. He was always very well prepared for class. Since he is a classics professor, he would bring in copies of The Iliad, The Odyssey, etc. in Greek and translate if a particular passage was unclear. Despite it being his first time teaching Lit Hum, he knew a lot about the books and taught as if he'd been doing it for years. When he encountered a question he couldn't answer, he was quick to admit it and promise that he would find the answer. Erik tried to find merit in most suggestions or interpretations, but if something was really far off he would say so gently before offering his own take. He has a sense of humor, too. His frequent jokes helped keep the class awake and participating, since it was a 9:00 class. All in all, a wonderful professor! I wish he taught something else besides classics courses so that I could take him again.\nWorkload:\nThree essays of increasing length (first was 3-4 pg, second 4-5 pg, third 7-8 pg), a midterm (set up like the final), and the final that everyone has\n"
        },
        {
            "course_name": "Elementary Latin I",
            "review_date": "August 28, 2005",
            "review_content": "\nYou can not do better than Erik.  He's on your side.  He's smart, he's funny, he's forgiving, he's a fantastic teacher.  You will not find a better instructor for this material.  He will teach you, but he is not a hard ass.  If you miss class, you'll fall behind, but he makes class as enjoyable as possible.  He is, in every way, the best instructor for this material.\nWorkload:\nmedium...but prepare hard for tests--they are complete and extensive...he's fond of putting irregular verbs and forms on tests\n"
        },
        {
            "course_name": "Elementary Latin I",
            "review_date": "January 06, 2005",
            "review_content": "\nErik is the best Latin teacher I could imagine having.  Class, though excruciatingly long (it was from 6-8 pm), was never too horrible to get through because he kept it light with jokes and had everyone participate (which was certainly conducive to staying awake).  The material was challenging and the pace was quick, but I'm sure it was comparable to all of the other Elementary Latin classes.  I thought the grading was fair (though I don't think I could have survived without the extra credit, which was a great cushion to my grade), and while the workload was heavy, it was manageable for a 4 point class.  I would absolutely suggest taking Latin (or any class, for that matter) with Erik, because he's a great instructor, is always available for help, and honestly seems to care about his students.\nWorkload:\nweekly quiz, weekly homework (3 of those dropped); 2 midterms; final\n"
        },
        {
            "course_name": "Elementary Greek II",
            "review_date": "August 05, 2004",
            "review_content": "\nErik is not only an exceptional intellect, but also a marvelous teacher.  He handles the difficulties of Ancient Greek without sacrificing clarity or time; the class finished all the course work in a timely fashion and with a very complete understanding of the language.  He is not an easy teacher, but he is remarkably fair and rewards students greatly for their efforts as well as their performances.\nWorkload:\nquite a bit, but managable (and you won't find a beginning classics class with less)\n"
        }
    ]
}