{
    "prof_info": [
        {
            "prof_name": "Marc Miller",
            "prof_id": 1831,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Yiddish I",
            "review_date": "March 31, 2004",
            "review_content": "\nOn the first day of class, Marc declared, \"I'm not your Jewish grandmother.  If you like that kind of class, switch now.\" His class is about grammer, plain and simple, and it's easy to keep up if you pay attention.  His frequent absences don't matter because you've plowed through all the neccessary material so quickly.  Four credit class that meets once a week? Yes, please.  He's got sharp Canadian humor and is available outside of class when you need him--what more can you ask from a professor?\nWorkload:\nroutine homework and a take-home final that's so easy you'll keep double-checking it to make sure you're not being tricked somehow.  \n"
        },
        {
            "course_name": "Elementary Yiddish I",
            "review_date": "January 11, 2004",
            "review_content": "\nThis is a fantastic class.  Marc is extremely knowledgeable, but very engaging and fun to talk to.  The class is pretty low pressure, and he's very willing to slow things down or see you outside of class if you need it.  This class is good as an intro to yiddish, and it's equally good to take for one semester as a fun elective.  You don't need any previous acquaintance with yiddish or hebrew, and a lot of the grammar is similar to english and french or spanish.  You shouldn't have any trouble keeping up with the class and doing well, regardless of prior experience.  Even though it's easy, you learn a lot of fun anecdotes about yiddish influence on english, as well as some interesting cultural facts.  It's really a great class, and Marc is an excellent teacher.\nWorkload:\nLight.  About half an hour of homework once a week, and you get a 100 for doing it.  No midterm.  Take home, open book final.\n"
        },
        {
            "course_name": "Intro Yiddish 1",
            "review_date": "December 04, 2003",
            "review_content": "\nHe's actually a decent teacher when we have class, which brings us to the major strike against him. I actually lost track of how many classes were cancelled. I think he was legitimate most of the time, but that can only excuse so many absenses.\nWorkload:\nTranslation exercises every once in a while. Take home final that's fairly easy.\n"
        }
    ]
}