{
    "prof_info": [
        {
            "prof_name": "Shao-Ying Hua",
            "prof_id": 2141,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "January 07, 2006",
            "review_content": "\nProfessor Hua was a very good teacher -- as some of the other reviews point out, probably the best thing about having her as a teacher is that she is totally dedicated to her students. She is willing to meet with you almost anytime for however long you want to make sure you understand the concepts and are writing the reports well, etc. She is very knowledgeable about neurobiology and she is always helpful if we had trouble doing any of the experiments. She is always willing to listen to student feedback and really wants her students to enjoy the class and to learn a lot. She is also just an extremely nice woman. Although her accent can be difficult at first, by the end of the first class, you will understand her perfectly. I would definitely recommend this class and professor.\nWorkload:\nMy only complaint about this class was the workload -- we were assigned more work than is typical for a 3-credit class (basically one fairly long lab report just about every week). Towards the end of the semester, Prof. Hua realized she was assigning a bit too much work, so she cut it down, which shows how responsive she is to her students. There were a total of 8 or so lab reports, easy dissection and equipment tests (everyone pretty much gets 100%) and then a final paper/presentation. A decent amount of work, but you'll learn a lot.\n"
        },
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "November 02, 2005",
            "review_content": "\nProf Hua is the most available and dedicated teacher I've ever had. You can stop by at any time (just call or email beforehand). The class material is extremely tough and dense, but take advantage of the fact that Prof Hua is willing to spend the extra time going through each point until you fully understand all of the material. She understands that there is a lot of material to absorb, but her dediation to her students amazes me. She has review sessions before each exam. In addition, she posts powerpoint presentation slides and class notes on courseworks for every class. Her lectures are very engaging and she makes an extreme effort to help her students. \nWorkload:\nTwo midterms and one final. Keep up with the work. Thoroughly understand the material and ask her questions at her office. \n"
        },
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "January 23, 2005",
            "review_content": "\nProf. Hua is one of the most dedicated professors I have had.  She set up several review sessions in addition to regular office hours.  She was also always available when I requested to meet with her at other times.  The material is challenging and does require paying close attention in class and doing the reading in the textbook, but its doable.  Her accent was a little intimidating to me at first, but I got used to it very quickly and it was not a problem.\nWorkload:\nTwo midterms and one semi-cummulative final (the only questions that she asked on the final from the old material were ones that appeared on the midterms)\n"
        },
        {
            "course_name": "Lab in Neurobiology",
            "review_date": "December 30, 2004",
            "review_content": "\nProfessor Hua is truly one of the most dedicated and sensitive professors in the university. She puts in loads of extra hours and is almost always available if you need extra help. She gives out lecture notes for every class and is receptive to student suggestions for improving her class. The material can be challenging, but she'll never make you feel uncomfortable to ask for help. She is also very good about returning lab reports and posting exam grades promptly. Her only setback is her strong Chinese accent, which did not bother me at all.\nWorkload:\nLecture: 2 midterms and a final\nLab: Weekly lab reports, equiptment exam, student designed lab with final presentation\n"
        },
        {
            "course_name": "Molecular & Cellular Neuroscience",
            "review_date": "December 29, 2004",
            "review_content": "\nI think Professor Hua is great! She cares a great deal about her students and gets to know each one's name and interests. Lectures were great, I didn't have any trouble understanding her accent. At the beginning of each lecture, she'd hand out annotated notes on the material we'd be covering that day and sometimes interesting articles about the stuff we'd be learning about. Since I had an older edition of the textbook, she'd photocopy sections and diagrams that my edition doesn't have, which was incredibly thoughtful. Sometimes we'd have demonstrations during class, which was always fun. Professor Hua is so adorable and she would make everyone laugh, although not always intentionally, by coming up with funny scenarios in which to demonstrate a neurobiological concept. \nTests were very straightforward, sometimes a little tricky, but she gives practice problems which are similar, even in their trickiness, so doing those is a great idea. \nProfessor Hua also took the time to tell me about any lectures or talks that I might find interesting because she knew that I was interested in neurophysics. \nI'm not a bio major, so I don't really know how this class compares to other bio classes but I enjoyed it a lot and would recommend it.\nWorkload:\n2 midterms and a final\n"
        },
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Hua is a gem, especially amongst the Bio professors at Barnard. On the first day of class, she told us that we were her first priority, and research came second - how many other professors in the science departments have told students this (and actually meant it)? I can tell you my answer: zero! Yes, this class is challenging and the readings get progressively more difficult to decipher, but as long as you study hard, you will be fine. Each exam requires a greater amount of memorization, but is excellent preparation for graduate/professional school. Professor Hua can sometimes be difficult to understand, but I feel that most people blow this out of proportion. If you don't understand something, she will bend over backwards to explain it in as many ways as it takes for you to obtain a firm grasp of the topic. She will meet with you anytime, provided you email her in advance or talk to her about it in class, and she also holds lengthy review sessions to answer questions before the exams. Furthermore, after the first exam, she gives a \"comment card\" to students so that she can learn from the things that they found helpful or difficult to understand in order to improve teaching for this class and future classes. Student input is extremely important to her, and she takes it very seriously and works on any problem areas with the class (such as difficult to understand exam questions or topics). I highly recommend this class, both because the content is interesting and very useful and because Professor Hua is extremely intelligent and well-versed on the topic and devotes herself tirelessly to her students. You don't find too many professors like her in science departments, so take advantage of the opportunity!\nWorkload:\nTwo midterms and a final exam. Reasonable in difficulty as long as you thoroughly review the material. \n"
        },
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "December 24, 2004",
            "review_content": "\nProfessor Hua is very nice, but not the greatest instructor. I'm not sure how good the Columbia class is in comparison, but this class requires a lot of independent studying to grasp the material. Don't expect to get very much out of lecture. Although not the best thing to say, it's probably better to miss lectures, study the material thoroughly on your own and then go to her for office hours to ask questions about what you don't understand. The main use I got out of lectures was knowing what we were going to be tested on rather than an understanding of the material. Her tests are somewhat hard to understand too, because of wording issues. Not the best class in the world, but not the worst. Definitely a fairly thorough introduction into the concepts of neurobiology. \nWorkload:\ntwo midterms and a final, which tests you on problem areas of the first two midterms and the last third of the class. You definitely have to keep up with the readings, from a textbook that doesn't explain things very well. Put in a lot of time for the readings and go to office hours or schedule time with her for everything you don't understand and you'll be golden\n"
        },
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "December 22, 2004",
            "review_content": "\nProfessor Hua is a great professor. She clearly loves what she teaches and she puts in a low of extra time to help students as much as possible. Her accent can make understanding lectures difficult in the beginning, but you soon adjust to it. She is also very aware that her accent can cause difficulties as is more than happy to repeat things. Hua is a very nice professor who cares about her students. The material is really interesting and Hua provides great lecture notes and explains the material well, which can often be challenging. Hua says she does not curve, but the final grades are curved a little.  If you like this subject, I definitely reccommend taking this class.\nWorkload:\n2 midterms, final, optional practice problems\n"
        },
        {
            "course_name": "Research Seminar",
            "review_date": "July 19, 2004",
            "review_content": "\nThis seminar was absolutely useless. That is not to say that Prof. Hua was deficient in any way, rather, the whole concept of consulting with someone wholly unfamiliar and uncoordinated with your research about how to present your work (which most probably wont be finished the second week of the semester when you are supposed to have your introduction prepared.)  Regardless, Prof. Hua was easy to get in touch with out side of class although I did not find her limited comments helpful in anyway. There is definitely a little bit of a language barrier, so if you are bothered by that or are apt to doze off in lecture I recommend you avoiding a Hua-course.\n"
        },
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "May 22, 2004",
            "review_content": "\nI think there's a reason for the lack of reviews on Dr. Hua.  She is an incredibly nice person but not necessarily the greatest professor.  If you are a neuroscience major at Barnard, you cannot avoid taking Neurobiology and it looks like Dr. Hua's going to be teaching it for a while.  \nThe good news?  She is incredibly warm, friendly and understanding and if you go to her office hours she is willing to teach and explain the material over and over again.  She is very patient, never patronizing, and truly cares about the success of her students.  She is much more skilled in explaining concepts on a one to one basis as opposed to lecturing in class.  \nThe bad news?  She is not the greatest or most organized lecturer.  She additionally has an accent that may take time getting used to and understanding.  However, I overall found the material to be fascinating.  It can be overwhelming and intimidating but its Neurobiology!  What did you expect? \nRecommendations?  Spend a little bit of time with the material each day and go to Dr. Hua's office hours or make an appointment with her the moment you realize you don't understand a concept.  Go see her even if you think you DO understand a concept.  Knowledge in the class tends to build so missing what seems like a small idea may be disastrous in the long run.  Dr. Hua uses PowerPoint slides during lecture and has handouts of her notes in outline form.  I never found these to be too useful and rewrote these using supplementary information from any notes I took in class and from the textbook (which is quite horrible and I would recommend checking out the Kandel Neuro book for clarification on certain concepts).  I also found reviewing for exams in a group to be very helpful.  \nAnd because I don't feel like writing a separate review, here's a little something about the lab in Neurobiology, also taught by Dr. Hua - fantastic!  It's really really long and takes up an entire afternoon once a week but the length of the class actually made it more relaxed and she doesn't mind if you take small breaks here and there.  It was one of the most fascinating lab courses I've ever taken.  Microdissections, electrodes, crayfish!  What could be better?  The manual can definitely be improved and there are mostly full lab write ups (which take a long time) but I really enjoyed the class.       \nWorkload:\nLecture: three exams and a final?  Two exams and a final?  I forget.  Overall, a lot of work to study for them but they are fairly reasonable exams.  Ask questions during the exam if anything is unclear because sometimes her English usage is questionable.  The workload is therefore fairly self paced in terms of studying; there is reading but no problem sets.  \nLab: FULL lab write ups (intro, materials, methods, etc) every week which are a lot of work but not so horrible and actually make you understand the experiment more.   \n"
        }
    ]
}