{
    "prof_info": [
        {
            "prof_name": "Anubav Vasudevan",
            "prof_id": 3083,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 27, 2010",
            "review_content": "\nNice, smart teacher.\nAlthough he is seriously intelligent, he isn't pretentious or on a constant ego trip. Friendly guy who clearly loves philosophy. The class usually begins with Anubav bringing up a question he finds interesting and relevant to the reading, and then the omnipresent philosophy majors have at it. Then slowly the less well-versed students trickle into the discussion as Anubav defines determinism, free will, etc. on the board. While this structure might seem kind of... flabby and formless, Anubav has a pretty good rein on the discussion and he can deconstruct your and the authors' arguments quickly and accurately - i.e., we're constantly asked to explain and justify our views, and if we do go off-topic, then we at least cover into interesting topics relevant to philosophy, if not the text (e.g. we learned Zeno's Paradox). \nBreak it down:\n- Fair grader, you could even say lenient. \n- Paper topics are thought provoking. He really wants you to synthesize your own arguments in response to the authors - this can be frustrating, especially as other classes are making more literary and historical papers, but useful and more interesting in the long run. \n- He doesn't flip out if the class hasn't done the reading. Pretty refreshing and it makes the teacher-student relationship much less adversarial that it could be.\n- Tangents. Oh, the tangents. We spent an hour and fifteen minutes discussing whether or not it was reasonable that medical schools expelled students with DUI's. Fun discussion. Relevant to Hobbes? Not really.\nWorkload:\nModerate. Depends on how much of the reading you're willing to commit to. Two papers, midterm and a non-cumulative final. No ID's!\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "December 19, 2006",
            "review_content": "\nHe, along with another grad student, was the TA for Symbolic Logic. He was the less-comatose of the two. It seemed that he knew his shit, and although he wasn't masterful at explaining many concepts, and he was loud and articulate enough to facilitate an understanding of the material. More importantly, he was able to explain important ideas at a particularly rudimentary level that was appropriate for a large portion of the audience - in fact he was better at it in many respects than the TA or the professor (not Varzi). All in all, he wasn't an incredible TA, but he's at least sufficient. \nWorkload:\nI believe it's set by the instructor. \n"
        }
    ]
}