{
    "prof_info": [
        {
            "prof_name": "Jennifer Pardo",
            "prof_id": 2857,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 14, 2010",
            "review_content": "\nThis class was great. Professor Pardo is straightforward and presents information in a clear, comprehensive way. For example, she draws charts and diagrams - something that I rarely saw in high school and greatly appreciated. So if you're a \"visual learner\", you'll benefit from her teaching. She seems very organized and knowledgeable. \nIt is important to go to lecture and keep up with the readings. Do this, and you'll do very, very well in this class.\nAlso, Professor Pardo is really fun! I would definitely take another class with her. She even made me want to become a psych major - or at least take more psych courses.\nWorkload:\n3 exams on (roughly) 17 textbook chapters.\nNot bad at all\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 24, 2009",
            "review_content": "\nI thought prof Pardo was fantastic. I greatly enjoyed the class. She's funny and not at all dry, unlike some of the other reviews have claimed. She's got a great, sarcastic sense of humor and livens up even the more boring parts of the course. She gave a great intro to psych. I know Stokes is super wanted or whatever, but I'd TOTALLY recommend Pardo for intro. She's great. The workload is not terrible and the class is a really great option for freshmen. There are three non-cum exams and if you do all the readings and attend lecture will be a breeze. Ignore prior reviews-- TAKE THIS CLASS!!                                                \n \n \nWorkload:\nWeekly readings, really not bad and helpful to keep up with. Three non-cumulative exams, very fair and doable if you do the readings. \n"
        },
        {
            "course_name": "Perception Lab",
            "review_date": "December 10, 2009",
            "review_content": "\nI had Professor Pardo for Perception psychology lab, and she was great.  She substituted for the lecture one day and she was such a good lecturer, really clear and understandable.  I wish I had taken the lecture with her as the professor. \nThe lab booklet was GREAT, especially the appendix that gives the formatting.  Also, Professor Pardo explained our assignments really clearly and gave a lot of guidance.\nSometimes I felt her tone was kind of patronizing, and I wondered if she would have talked like that if there were men in the class.  But still, even when sometimes it was a little too slow/easy, it was a welcome relief after the nightmare that was Professor Remez's lecture.\nWorkload:\nPart of a lab report each week, towards the end of the semester you have to write about the class experiment.\n"
        },
        {
            "course_name": "Cognitive Psychology and Perception",
            "review_date": "September 30, 2006",
            "review_content": "\nPardo is very boring, but straight-forward and she really does try her best to be a good professor. I studied both the textbook and her lecture notes for Cognitive last semester, and did well in the course. Yes her tests are challenging compared to other psychology classes, but if you know the material, you can get an A. \nPerception, on the other hand, is a little bit ridiculous. I'm currently enrolled in this course - the midterm is coming up in a few days, and in the first month of school she had us read 8 chapters (it's literally almost half the book), with 4 additional readings on top of it. The textbook, in my opinion, is as boring and as difficult to comprehend as her lectures are so far.\nMy overall recommendation: stay away from Pardo if you have the option. If you have to take her course though, just study hard and you'll be okay.\n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "June 11, 2006",
            "review_content": "\nShe's a really straight forward professor.\nThe exams are just hard, but you can't change that. \nPeople should stop complaining about her because she is really a great professor. She won't spoon feed you exam answers, and unless you're  a baby, you won't complain.\nShe's young, approaches things with a fresh mind. The lectures are funny at times and nicely organized. \nThe best thing is her attitude. She is very approachable, frank.\nOverall, a sophisticalted professor.\nNow it's your choice to like that or not. \nThere were sooooo many kids in the class. I think that everyone who got a decent grade--that is 88% didn't write a review. So don't judge her, especially when the few low grades wrote reviews. \nWorkload:\nJust the text. The exams are straightforward. Yes, hard--like EVERY psych exam in the dept. \nPray for yourself\n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "May 28, 2006",
            "review_content": "\nEven as a nonmajor taking the class for the science req, I really liked the class.  The reading was not that dense & all from the textbook.  The lectures were pretty good.  Pardo tried to make them as interesting & funny as possible with varying degrees of effectiveness all semester.  Also, looking back, you really don't ahve to take notes or go to class because all the notes you need are typed out on the slides which she posts after each class.  What you do need to do is READ THE TEXTBOOK.  I cannot stress this enough.  I totally agree with the previous reviewer that the exams are impossible.  She will ask you about the most obscure thing from the textbook.  So make sure you have read it before the tests.  They are as hard as a noncumulative test can be.  The multiple choice is AP style, the type of trick questions that we all thought we had abandoned.  The matching column is the matching column from hell because the relationships are extremely obscure AND there are an average of 6 words that are left unused.  The short answers were generally straightforward.  There are also a few extra credit questions which have a 1/2 point deduction if they are wrong.  Hardly anyone finished early during the midterms.  However, Pardo was pissed that the final was on the last day of exam period so she wrote an extremely fair exam which many people finished in about an hour.  Pardo gives a hard class but if you don't slack off with the reading, you will do well.  She also will give an A+.  \nWorkload:\ntextbook reading (necessary to do well on exams)\n3 noncumulative exams\n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "April 11, 2006",
            "review_content": "\nThis woman is sweet, fair, meticulous, and knowledgable. She even curved the grades for our exams. Still, her exams are horrible. She's new at Barnard and so she probably feels the need to prove that she's a good, tough professor. This causes her to create wordy exams that merely confuse the students. Everyone always needed more time by the end of the exam. No one really left very early. Perhaps everyone was going \"huh?\" as they tried to get through the exam. \nThe worst part, for me, was the matching part of the exams. She'd have words and you'd have to match them with something on the right column, but the categories on the right column were always obscure, no matter how much I studied. Her exams were reallllly annoying.\nHer lectures kept me entertained, but I often saw others drifting away in their minds, chatting on AIM on their laptops or doodling. \nSure, she's organized and fair and tries to help you, but she doesn't realize how RIDICULOUS her exams are.\nStay away from this professor if you'd like a clear exam that you can study for, get a good grade on because you've studied for it, and feel good at the end of it all. What I mean is, no matter how much I study it seems that her exams are always wordy and confusing. She is indirect in her exams as a way to have students get mediocre grade and, thus, earn herself a reputation as a \"tough\" professor or exam-creater. She actually said it at the beginning, that her exams are really really really hard ... she prides herself in that.\nBut now that you know all this, perhaps you'll do way better than most of us are doing right now .... the median grade or mean is usually in the 70s, if not the low 70s. We'll see how that final exam goes.\nWorkload:\n- 3 non-cumulative exams\n- a paper (if you're not in the lab)\n- weekly lab reports and an independent research project (if you're in the lab sections)\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "March 01, 2006",
            "review_content": "\nI personally didn't like the class or the subject matter. simply taking it for a requirment. Her teaching is bit boring, but fair. If you attend each lecture and do the readings which aren't copious you'll be fine. overall, if you are taking it for req, and not out of interest, STAY AWAY FROM PARDO, she is a boring lecturer.\nWorkload:\nheavy reading in a boring psych textbook. 3 non-cumalative tests... no midterm or final + 10 hours of psych credit req \n"
        }
    ]
}