{
    "prof_info": [
        {
            "prof_name": "Lance Kam",
            "prof_id": 2306,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Quantitative Physiology I",
            "review_date": "March 03, 2015",
            "review_content": "\nKam was a pretty bad lecturer, and going to lecture was pretty optional most of the time, everything is in the notes he posts.\nThe problem sets sometimes are kinda hard, but TA's help a lot.\nThe tests were very time intensive and time was the big factor. When given enough time everybody did pretty well, like the final. Pretty sure Kam downcurved the class so yeah,beware\n\nWorkload:\n5 Psets (drop 1) midterm + final\n"
        },
        {
            "course_name": "Quantitative Physiology I",
            "review_date": "December 30, 2005",
            "review_content": "\nKam seems like a nice guy though his teaching style leaves much to be desired. His online lecture notes are great but lectures at times feel like a waste, especially at 9am. Kam doesnt do a very good job of distilling the material and most lectures just degenerate into him writing equation after equation on the board. He gave 5 problem sets during the whole semester which were spaced out pretty well and he is quite flexible with deadlines but when one is set he is very hard on those who hand things in late. Problem sets are quite hard to figure out on your own but he and the TAs are always very accessible. The midterm and final are open book but you will still be faced with time constraints and understanding the material will be key no matter what. Overall, Kam is a decent teacher though he can be a boring lecturer at times. Be selective with the classes you go to, not all of them are worth waking up early for (especially ones where he is going over problem sets or a midterm)\nWorkload:\n5 problem sets count for 50% of final grade, open book/notes midterm counts for 20%, open book/notes final counts for 30%\n"
        },
        {
            "course_name": "Quantitative Physiology I",
            "review_date": "May 22, 2005",
            "review_content": "\nLance Kam is awesome.\nGive him a chance to warm up, and he'll tell you about watching Yu-gi-oh with his nephews.\nWorkload:\nnot too bad at all. Tests are open everything.\n"
        },
        {
            "course_name": "Quantitative Physiology I",
            "review_date": "December 27, 2004",
            "review_content": "\nI agree with the previous review.  Professor Kam started off shaky, but I felt that as the semester progressed, he started to gain confidence and became better.  Also, this class has very difficult material in it, and it's a hard thing to teach, especially if it's your first year teaching.  I thought the organization was pretty good but the lack of examples made the material harder to follow.  The workload itself wasn't that bad, and the midterm and final were open notes, open book.  He was always available, and the TA office hours helped a lot, especially before homeworks were due.  He'll probably be better next year when he has more confidence in himself.\nWorkload:\n5 homeworks, 1 midterm and 1 final.  Midterm and final were open notes/book.  Homeworks were long, but not too difficult when working together with others and going to office hours.\n"
        },
        {
            "course_name": "Quantitative Physiology I",
            "review_date": "December 23, 2004",
            "review_content": "\nThis year was Prof. Kam's first time teaching this class... and to be honest, it was BAD.  The lectures are disorganized, his handwriting is awful, and he's not a good lecturer. Of course, it doesn't help that the class is at 9am.  There were many times when we got emails after class where he corrected mistakes that he had made in the lecture.    However, there are notes online (although these aren't usually too comprehensible), and the homework usually isn't THAT awful- although it helps a lot if you or a friend goes to office hours.  The tests are all open-book open-note, which helps a lot, since you don't learn too much in class.  \nAnyhow, I have to give Prof. Kam some credit- he's a nice guy and it's his first time teaching.  His teaching definitely improved over the semester, and maybe next year it won't be as bad. \nWorkload:\n4-5 homeworks: 50% of grade.\n1 midterm: 20%, and final 30%, both open book.  (the mean for the midterm was in the 50s, and the mean for the final was 49... the curve is everyone's friend in this class)\n"
        }
    ]
}