{
    "prof_info": [
        {
            "prof_name": "Vanessa Guida",
            "prof_id": 3383,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 20, 2009",
            "review_content": "\nShe's too honest if you ask me, but that's what makes her really great. She's kinda of klutzy and young, but it makes the class so very entertaining. It's particularly boring, all the useless writing vocabulary. Granted, it's the UWP office that forces the vocabulary, not her. Overall, Vanessa really helps you harness one's skill of writing, firmly. Peer review, is encouraged.\nShe doesn't like libertarians very much, so don't expect her to be ubberly fond of you endlessly quoting Murry N. Rothbard (who she had never heard of prior to me)\nShe meets frequently, at your request, takes us on field trips to Butler, offers extensions and hosts breakfast parties!\nWorkload:\nUsual ya-yada.\nFour essays, plus the optional revision assignment. This is RARE in UW.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 04, 2009",
            "review_content": "\nA great professor who honestly cares about your progress, your opinions, and your enjoyment of her class. Very apologetic about the sometimes silly UW syllabus and terminology, eager to make things as simple and clear as possible and to give students as much choice as possible in course readings. Takes her grading seriously and is very thorough in doing so but that said, is very reasonable and always willing to give extra help or offer an extension if you talk to her. Almost too nice and approachable - sometimes I had to stop myself from telling her too much because talking to her can be like talking to a friend/therapist. Genuinely concerned about her students and so long as you show up, make an effort to participate, and listen to her comments on your drafts, you'll ace the class.\nWorkload:\nWeekly course readings and CW postings of ~200-400 words that count towards your participation; the 4 standard UW papers with drafts. Nothing too intense.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 13, 2008",
            "review_content": "\nfirst thing's first: Vanessa was a great UW teacher. She definitely made UW more interesting than at least what the name implies. She's very understanding and helpful, and is eager to guide you along and truly does care about the class and everyone's progress. Her willingness to help one on one during extra time is definitely a plus as a teacher. WARNING: her grading is truly honest. This is of course essentially very good cause you do learn what your writing is actually like, but unless you put in the time and effort, your grade will not survive very well. If you stay with all the exercises and such though, it won't be that bad. Overall: Great teacher for UW!!\nWorkload:\n\"short\" exercises with readings (250 - 300 words ish). Drafts (not graded). 4 papers, like all UW\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 03, 2008",
            "review_content": "\nI strongly agree with the review below. I looked forward to going to class and enjoyed it.  But if you feel confidant after getting back a draft you still need to put work into it!  Minimal critique from her on a draft won't necessarily mean a great grade!  She is also willing to listen to her students and tweak her teaching methods based on class needs.  She is someone who you will genuinely believe cares how you are doing and how her students like the class.\nOVERALL: if you can take class with Vanessa- do!\nWorkload:\nNormal Uni Writing requirements, and she is conscious of how silly the structure of a core class can be and will sympathize, even if she can't change it!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 23, 2008",
            "review_content": "\nVanessa was great in class - very enthusiastic, very excited about the subject and the projects and the articles and the discussion and life, really, but in terms of work outside your class, you HAVE to be independent.  Don't count on her to say everything that needs to be said about a paper - ask about everything you can think of, really take advantage of the office hours, be as thorough as you can be.  She's not so picky with the drafts but very picky with final papers, so don't yourself get screwed over.  Be proactive and you'll be fine.\nWorkload:\nFour papers, one rewrite.  A good bit of the grade comes from participation.  Plenty of homework, but oddly enough, none of it counts towards a grade - it's just part of participation.  You'll usually get a couple of drafts pre-paper, and once again, that's participation.  Also, one group presentation, but that's not too bad.\n"
        }
    ]
}