{
    "prof_info": [
        {
            "prof_name": "Thomas Woo",
            "prof_id": 9541,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Topic: Next Generation Networks",
            "review_date": "April 12, 2016",
            "review_content": "\nI had such high hopes for this class. Both professors are current directors at Bell Labs, so you'd think they would be extremely knowledgeable about cloud computing and be able to teach a lot about how what's going on in real-world networking today.\nBut on the first day of class each professor started by saying that teaching is only their hobby --- and boy does it show. Each of them were terrible in their own way. Sabnani seemed like he actually cared and wanted to help students, he just didn't know how to do that in an effective manner. His attempts at stimulating class participation consisted of asking \"How many of you have heard of _____?\" type questions. But on the rare occasion when students cared enough to ask questions, he would genuinely try to answer them. Thomas Woo, on the other hand, gave the impression that he did not care about students at all. Anytime a student would ask a question, he seemed incapable of understanding why they would even need to ask a question, and treated people like an idiot for needed to ask something. And he completely shut down answers that he disagreed with. \nHomeworks and tests were a disaster as well. There was terrible communication between both the professors and the TA for the class. This resulted in questions that had nothing to do with any of the material covered in lectures. The problems themselves also defy naming conventions and standards used in every other computer science class, making understanding what the questions are even asking difficult. For example, in a question about calculating RSA, the professors switched around the names of the variables to the opposite of how every intro crypto lecture in CS teaches them. \nThe midterm and final were a throwback to middle school-style tests. They consisted of various fill-in-the-blank and true/false questions but in a way that did zero to test for understanding of concepts in favor of pure memorization. The emphasis given to memorizing what different acronyms stand for instead of what they actually mean or what significance they play was astounding. Why does it matter if I can name what the T in REST stands for if I can explain what REST as a whole means and how it's used?\nWorkload:\nLight workload. 4 homeworks, and one semester-long project (either programming project, research paper, or analysis of a real-world system). If you choose the research paper, it's very easy. Not sure about the other two choices.\nMidterm and final are impossible unless you're good at memorizing every single detail on every slide, but everyone does poorly, so it's fine.\n"
        }
    ]
}