{
    "prof_info": [
        {
            "prof_name": "Daniel Dipaolo",
            "prof_id": 10949,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "September 02, 2013",
            "review_content": "\nI completely agree with the other reviewers. The class is basically all about how much you appreciate music. Participation didn't matter, but I think everyone talked at some point, because Prof. DiPaolo really has the ability to make the class atmosphere comfortable. I remember a couple people would doze off in the back row, but he never picked on them. \nSuper funny, quirky, intelligent. I wish I could take some other classes that he teaches.\nMore than recommend his class.  \nWorkload:\nThree 2-3 papers. Super light midterm and final. Our final was on the last day of class (FTW!!!!) \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "July 29, 2013",
            "review_content": "\nHands down one of my favorite professors. He is quirky, funny, and extremely flexible with the work he hands out. I heard from some other Music Hum students that their teachers were a pain in the ass, requiring complex analysis and identification of musical terms. Dipaolo wasn't anything like that. In fact, I felt that he was too easy sometimes. \nIncredible passion for music, and extremely knowledgeable. Learned a lot, and would retake the class in a heart beat. \nWorkload:\n2-3 three page essays. These are basically like observation notes. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 29, 2012",
            "review_content": "\nThis class was the most hysterical class ever!  I was in a class made up of mostly musicians, but even compared to the other classes made of up musicians that I talked to, our workload was super, super light.  Prof. Dipaolo definitely had interesting insights, and I feel like I did learn from the class somewhat.  However, much of the class consisted of simply listening to music, or else, trying to get the speakers to work, or else, complaining about how the speakers never worked.  In discussion, we had a few people who already knew everything, and a few who hated the people who already knew everything, which always made for free entertainment.  And Prof. Dipaolo always had some amusing thing to show or play us (an electronic version of Rite of Spring, for example), so overall this was my most enjoyable class.  Prof. Dipaolo is the nicest guy ever, and I cannot imagine that anyone didn't get an A.\nWorkload:\nThree 2-3 page papers, no midterm and an IN CLASS final.  An occasional quiz.  Light, light, light.\n"
        }
    ]
}