{
    "prof_info": [
        {
            "prof_name": "Nira Reiss",
            "prof_id": 2996,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Language, Culture, and Gender",
            "review_date": "December 21, 2006",
            "review_content": "\nAs a women's studies major, I took this summer class for a requirement, but am so glad I did so.  The subject matter is amazing: the differences in the speech acts of men and women.  The textbook, and the suppplementary readings Professor Reiss gave were interesting...two of them even dealt with the the speech acts of Hillary Clinton, and the Supreme Court nomination hearing of Clarence Thomas with respect to Anita Hill's responses.  \nMainly, we just read a lot, and talked a lot in class. But, who doesn't love movies in class!  They helped us visualize and hear specific examples of such speech acts.  And, I have to say it really in one of the few \"gender\" studies classes that takes into account transgendered people.  \nAs for Professor Reiss, I must say she was suffering from a bad cough most of the six weeks, which could have affected her teaching style.  Also, she was very willing to help with the concepts outside of class; something most summer teachers aren't perhaps contracted to do.  \nLike any Columbia class, if you have what you deem a mediocre teacher, take from it what you can.  The final paper in this class where you examine a piece of literature or a movie of your choice is such an opportunity.   Mostly anthro and women's studies majors take this class, but I still recommend the subject matter for anyone who has time during the summer to take it.\nWorkload:\nReadings, oral presentation summarizing one of the readings, no midterm, no final, just the final paper of 10-12 pages on a piece of media\n"
        },
        {
            "course_name": "Language, Culture, and Gender",
            "review_date": "August 24, 2006",
            "review_content": "\nWorst teacher of my Columbia career.  Fascinating topic, but Prof. has the uncanny ability to make every class feel like a root canal.  It is quite fascinating that a linguistics teacher is completely unintelligible or able to understand statements from any of the students.  She interrupts to correct before she even knows what the student is going to say, and always assuming the student said completely\nnot what she is correcting them for.  She makes strange\nrules, sometimes unannounced.  Her social retardation and inability to really explain anything is mindblowing.\nWorkload:\nsometimes nothing, sometimes a lot.  never clear what was wanted in the assignments.wanshe\n"
        }
    ]
}