{
    "prof_info": [
        {
            "prof_name": "Leonard Fine",
            "prof_id": 338,
            "total_reviews": 53
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry I",
            "review_date": "March 28, 2007",
            "review_content": "\nThe thing about sciences at Columbia is that you just can't depend on the professor to teach you. These guys are brilliant research scientists, not lecturers. In this course you have to hit the book hard. But the more you practice and study, the better you will do on his tests. People who say that the questions are completely random have obviously not put in the time to deserve a good grade. I am by no means a science genius but I studied the book and the lecture notes and did fine.\nWorkload:\nTypical: 3 midterms and a final. lowest grade dropped. Quizzes in recitations\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 11, 2007",
            "review_content": "\nProfessor Leonard likes to talk about history a lot.  Being an old research professor can you really blame him for relating the history he lived through with chemistry that much? \nThat being said, Fine does a great job at creating informative and concise powerpoint presentations.  What Fine does not do a good job at is keeping his lectures engaging.  He drowns you to sleep with his monotonous voice and you are ultimately unable to absorb much chemistry. \nThe average student then does not learn much because they are asleep whenever he says anything important.  Several questions on his tests (1-3/20) are directly from lectures and demonstrations.  The others questions are derived almost exactly from the homework questions he gives out.  Average test grades are like 13/20, and he curves a 13/20 to a B or B+! \nIf you learn how to do the homework questions and get a gist of the in class demonstrations you would be satisfied with your grade.  The curve is phenomenal.\nWorkload:\nFour optional problem sets (DO THEM!), weekly recitation quizzes, fair\n"
        },
        {
            "course_name": "Chemistry I",
            "review_date": "January 09, 2007",
            "review_content": "\nI feel like the people who wrote unhappy bitter reviews about Fine and about the irrelevancy of his teaching just don't care about learning, or don't care about chemisty. They only cared abou getting a quick and painless A. If you aren't a fan of science, you won't like this class. However, if you are a chem major or you have a genuine interest in the sciences and how things work, I really think you'll like it, aprticularly if you like learning for learning's sake. Fine does talk about some random stuff during his lectures that doesn't show up on tests, and he does throw in random questions that don't seem relevant to what you are studying. But I found that when he started going on about effects of radiation on the body or history of nuclear warfare or einstein's life, thats when I perked up and paid attention. He's the first professor I have found who spends his time teaching students what all this stuff is actually used for, and why its important. Don't think I got some wonderful grade in this class either... I was fine throughout the whole class and somehow bombed the exam and wound up extremely disappointed, but I'm telling you, if you are genuinely interested in chemistry and science, you'll like this class. \nWorkload:\nI'm pissed I didn't study better for the exam... argh darnit. The class has a great curve and extra credit so it should've been easy.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 03, 2007",
            "review_content": "\nProfessor Fine is a man who clearly understands the material; however, he is completely incapable of explaining it in his lectures.  The lectures are pointless and confusing at times because he is always two steps ahead and then backtracks.  I found his tests to be more of an example of what he knows and taking joy in showing the students just how smart he is.  For those of us who are pre-med and really want to understand the material, he just doesn't care.  He is the perfect professor to weed out the weak, but he tortures those who want to learn in the process.  Overall, one of the worst professors I have ever taken at any institution.  Brilliant man incapable of teaching or reaching out to his students. \nWorkload:\nHW should have been graded and problems were not always given in timely manner.  His practice tests had the answers on them, not helpful to test yourself.  Better off skipping lecture and teaching yourself.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 31, 2006",
            "review_content": "\nPerhaps Fine should be replaced by a monkey, or that homeless guy that sells stolen posters from the subway outside of Pinnacle...they would at least entertain the students while they were not learning anything in class. I made some recommendations in the midterm evaluation, but they, along with the recommendations of my classmates seemed to be ignored, and even mocked by Fine, who reminds me of a turtle.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 28, 2006",
            "review_content": "\nEasy-going professor, uploads all his lectures onto Courseworks within the week.  He tends to ramble about historical events, famous chemists and current events, which are interesting if you don't mind not learning.  Overall attendance is not necessary, although he does at least one demo per class - some of them are really cool and worth the trip.  Kind of a pointless course unless required for your major. Take a fun science course if it's just for the Core.\nWorkload:\nHomework problems are assigned but for practice only (not collected).  About 8-9 chapters of the textbook were covered during first semester. 3 Exams (one for every 2-3 chapters), One midterm, one final - ALL Multiple-choice and less than 25 questions (Final = 56 questions).\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "March 23, 2006",
            "review_content": "\nHorrible professor! Horrible class! Granted, most 1st semester chemistry classes suck but he is particularly bad. He enjoys teaching random material in his lectures which are boring. He seems to want to screw you over - the exams are not book based they're based on hislectures. Which is what I read on culpa about him before taking the class. I figured - not so bad. However, his questions are deliberate trick questions. The stuff he pulls from his lectures is not what any normal person would focus on. The extra credit project was a real savior and my TA was great but AVOID Fine! \nWorkload:\n3 midterms, optional extra credit recitation quizzes (same in every intro chem class)\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 09, 2006",
            "review_content": "\nProf. Fine's lectures are boring.  Almost every lecture is supplemented by an experiment, which often re-appear on the tests in some form.  Many of his power-point lectures contain tangental information to what the book considers important for that section.  Overall, nice guy but boring lecture.  \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 02, 2006",
            "review_content": "\nSo, a lot of people are critical of Leonard Fine.  I would be too if I did not have a background in chemistry before college.  The fact is, if you know chemistry in high school, his curve will become your best friend.  You can beat the average and easily get an A.  He gives 40% A's!  So the curve is AMAZING.  You do not get this kind of cushioning with the other chem professors.  If you do not know chem, stay away.\nWorkload:\n3 exams (1 dropped), weekly quizes (make sure to get an easy TA), and Final.  \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 02, 2006",
            "review_content": "\nI am writing this review to try to debunk some of the unfairly horrible reviews of Professor Fine.  As a premed student who had no choice but to take Fine's Gen Chem section due to scheduling reasons, I was very worried about taking this class due to all the negative reviews.  One thing people often complain about is how Fine is a poor lecturer.  While it is true that he is rather boring (but this is probably true of a lot of chem classes), his lectures are not nearly as nonsensical and off-topic as others make it seem.  He does teach some topics that aren't in the syllabus but they do not require much studying and for those of us who have any real interest in science, they are pretty interesting subjects.  Another thing people often criticize are Prof. Fine's exams.  Overall, the exams are very fair even though there are some poorly written questions.  However, each exam has several extra credit questions so the exam grades turn out pretty well (plus there is a curve).  Basically, I ended this class with an A+ not having done too much work and I learned a great deal of chemistry.  So if you are like me and forced to take Fine's class, it is not the end of the world.  Fine is a kind person and I can't understand why people rate him so terribly.\nWorkload:\nThere are three midterms that are fair.  Weekly quizzes in recitation.  One final exam that is also fair.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 24, 2005",
            "review_content": "\nThis class is definitely doable. I read all of the horrible reviews at the beginning of the year and was really scared to take this class, but it's really not so bad. Fine is a really nice man and really goes out of his way to make lectures interesting. Believe me - by the end of the semester you'll be so grateful that he does demos - they really wake you up! And they're interesting to watch. His tests are also not too bad. He doesn't put a lot of math-related stuff on the test, and he posts old tests online (I found those really helpful). He usually puts on a couple of questions from old tests and maybe 1 or 2 from lecture notes or the textbook. Overall, its not too bad. But then there are a couple of random questions that he always sticks in that you either guess correctly or incorrectly on. However, if you have good guessing skills, and a good TA, you should do fine. If you study, you shouldn't get below a B in this class. \nWorkload:\nHomework that you do on your own time schedule (and that is kind of irrelevant anyway), 8 recitation quizzes (drop lowest 3), 2 midterms and a final, and a 10pt extracredit writeup. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 19, 2005",
            "review_content": "\nI found this class to be intensely frustrating in that the lectures often covered tangential material that could not be found anywhere in the textbook but which we were supposed to know for the exams. His tests often feature arbitrary questions and you could learn the material better if you taught yourself from the book than if you attended the lectures. \nWorkload:\nassigned (but not collected) questions for each chapter, one extra credit assignment, three midterms, weekly quizzes (in recitation), a cumulative final (not too bad if you study from the old midterms)\nall in all, the work isn't too heavy if you pace yourself throughout the semester (instead of trying to do it all the night before an exam) and are self-motivated enough to teach yourself\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "November 19, 2005",
            "review_content": "\nOverall, this course is not terrible. Fine does an excellent job in explaining the basics of chemical theory and while he may tend to digress from actual chemistry, his random facts of nobel prize winners, etc. gives you time to either go over the notes, think about your other work, or most likely catch a few minutes of in-class sleep. Still, Fine knows his material and is especially clear on certain topics such as quantum theory and hybridization. I know many people who don't attend his lectures, simply based on the fact that they believe they can do equally fine by reading the textbook... this is true; however, his lectures do give hints as to what may be on the upcoming exam, especially at the end when he does demonstrations. The class itself is primarily a theory based class for chemistry - atomic theory, basic chemical calculations, quantum theory, orbitals, structure, etc. If you read the book, do the homework, do the extra problems for practice, and luck out with a good TA (if not, I suggest Kathleen Kristian), you'll be more than prepared.  \nWorkload:\n8 quizzes (drop lowest 3), 3 midterm/exams, final, Homework not collected, but useful for exams and especially quizzes. exams are all multiple choice, some bonus/extra credit. A good 3-4 hours a week if you are organized and on top of things. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "April 18, 2005",
            "review_content": "\nProfessor Fine was a great teacher. I personally thought his lectures were very interesting although it was annoying how he kept talking about how great Columbia is. Just pay attention in lecture and do all the work and youÂ’ll do well in the class. \nAfter bombing the first midterm I realized I missed a lot of questions which were related to the lectures and got my act together. If you take notes in class and read the lecture slides youÂ’ll be fine. Copy down every single thing he writes on the board no matter how trivial it seems. There were definitely some tricky questions on his exams but most of them were easy, youÂ’ll find yourself finishing the test 30mins early and going back to the hard ones to check for mistakes. I ended up with a final average of 97 so donÂ’t believe the others who say the tests are hard. All I did differently on the following exams was to concentrate more on my class notes and lecture slides. It also doesnÂ’t hurt to redo assigned problems the night before. People who sleep in class do poorly on the test because they miss the easy lecture related questions which is why there are so many bitter reviews. \nIn response to the reviewers who complained about his Â“extraÂ” material such as IR radiation, people taking Chemistry Lab first term needed to understand that for the spectroscopy experiment so he was doing us a favor. The Chemistry Lab TAÂ’s expect you to learn everything on your own. I am also glad I had Fine because I was well prepared for Physics II Lab while others had no idea what was going on for the photoelectric and radiation labs.\nIf you have a curiosity for science then take Professor Fine. He will do a lot of fun experiments and teach you interesting facts which you will not learn anywhere else. For those of you that donÂ’t give a damn just take Turro. YouÂ’ll get extremely boring lectures (which you will probably cut) and easy tests. I have sat in on one of his lectures and believe me that was a painful experience. \nWorkload:\n3 Midterms, 10 quizzes (drop 3), Final, ungraded hw assignments (do them to prepare for quizzes). Drop the lowest midterm, quiz avg, or half the final.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "February 02, 2005",
            "review_content": "\nNot a good teacher, although is a very nice guy. Very hard tests. No real need to go to the class, but must study hard for test.\nWorkload:\nNo actual HW although there is a quiz about every week with 2 worst dropped. \n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "February 02, 2005",
            "review_content": "\nNot a good teacher, although is a very nice guy. Very hard tests. No real need to go to the class, but must study hard for test.\nWorkload:\nNo actual HW although there is a quiz about every week with 2 worst dropped. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 04, 2005",
            "review_content": "\nIn short, if you must take general chemistry, do NOT if at all possible opt for Professor Fine's class. This is all you really need to know, but for some details:\n1) The lectures are absolutely useless. Fine spends most of class substituting infantile Powerpoint slides for actual teaching. The only things that are ever somewhat worth looking at on those slides are the occasional definition of some experiment or some term that might not be explicitly mentioned in the textbook. \nMany of the slides - and therefore the content of the lectures - consist of cartoons lacking comprehensible explanations or pictures of famous chemists who graduated from Columbia. Obviously, neither of those is in any way helpful to understanding anything relevant to the class. Sometimes pictures are worth a thousand words, but when you stare at a large drawing of a microwave oven with no context and no functional description, that picture is worth absolutely nothing. The lab demonstrations are sometimes interesting but also aren't very helpful.\n2) The textbook and (not required, but helpful) homework is all right. I find the textbook to be decent enough so that Fine's \"lectures\" become irrelevant. The homework and the recitation sections are FAR more educational than class is; if you're interested in chemistry, thoroughly read the book and then ask your TA to clarify or expand on whatever is in there. \n3) The tests are, well, laughable. Not because they're easy, not because they're hard, but because they are nonsensical. Half-or-so of each test is doable, but then there are the obligatory questions with way-too-long introductions that are totally irrelevant to the question. There are also the horribly irritating ones about what color things are when they react with other things. In addition, these questions are always wonderful to see on an exam:\nAnswers:\na) thing 1, thing 1\nb) thing 1, thing 2\nc) thing 2, thing 1\nd) thing 2, thing 2\nBah. But that's life, I suppose.\nThe bottom line is that this class with this professor is simply not good. You're at Columbia; you deserve better. Do yourself a favor and pick a different section.\nOh, and for the record: the one class we had with Professor Turro was unfathomably more intelligible than any of Fine's lectures. So it's not the class; it's Fine. \nWorkload:\nHomework: If you do it all, there's a lot. But it's not graded, and I recommend spending the 75 minutes of allotted class time doing homework instead.\nTests: 8 quizzes (3 dropped), 3 midterms, and a final. Quizzes are easy, midterms range from annoying to nonsensical, and the final ranges from stuff you've seen before to stuff you really don't care about. \n"
        },
        {
            "course_name": "General Chemistry Lectures I",
            "review_date": "January 02, 2005",
            "review_content": "\nFine = Boring. He will make you fall asleep in chemistry no matter how much you thought you liked it. Personally, I'm a Biochem major and he makes me want to major in philosophy. The problem is you have to go to the lectures because a lot of the material on his test is straight from the lecture. This class you could get by with just recitation, but you really need to do the assigned bookwork and extra problems as well as the practice tests. So this class is a lot of work, not a lot of learning. Plusses? You always get a practice test and bonus questions. Other than that I don't like his approach very much.\nWorkload:\nProblem sets for every chapter (sort of optional), weekly quizzes, 3 tests, one final\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 30, 2004",
            "review_content": "\nIt seems to me that a lot of these reviews are written by bitter students.  I personally found the lectures interesting - Fine is always using demonstrations and experiments to help reinforce the concepts.  I agree that the his lecture slides can be a bit disorganized, but what I like is that this class challenges you.  If you keep up with the material and understand how to do his \"More Problems\", you will do fine on the exams.  You don't need perfect scores on them to get an A in the class.  The class average on the exams was around 70% which after the curve was about a B.  All in all, the curve makes up for the difficulty level of this course.  You also have plenty of opportunities to pick up bonus points during the semester.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 29, 2004",
            "review_content": "\nIn my opinion, a useless man, but you'll realize that pretty quickly. Tests have no relation to the chapters, or the practice tests, or the lectures, which leaves you to fumble onwards on your own. I went to most of the classes  and recitations (where my TA tried to teach everything that Fine didn't - try to get a good TA for recitation and you're in better shape), did some of the homework, and got a B. You can probably due well in his class if you figure out exactly what he wants you to know, but given that Fine probably doesn't even know that you'll probably better off taking someone else. Truly, an embarassment to the department, to Columbia, and to the whole tenure system in general.\nWorkload:\nThree midterms, quizzes in recitation, and a final that counts for two midterms. You can drop three of the eight recitation quizzes, one of the six grades (3 midterms + 1 quiz average + double-counted final). Optional homework.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 29, 2004",
            "review_content": "\nThough I feel guilty writing a bad review for Fine since he is a nice man and clearly tries hard, I have to do it. I have to warn you about how bad this class is. I stupidly disregarded other negative CULPA reviews and thought that the reviewers were just people who got bad grades and had bad attitudes.  I got an A+ (normally a brag, but this is an anonymous review, so give me a break.) but I hated every minute of this class, and I am pissed I had to go through it. Don't make my mistake! Listen to these people! In my review I will try to outline what makes FIne's class so horrible. I will also give tips on how you can succeed in his class in spite of how horrible it is.\nChemistry should be a completely straight-forward science class: text book, lectures that explain the text book, and tests and quizzes on the text book. While this would normally constitue 100% of  any Columbia science class, it constitutes only about 80% of Fine's class. The other 20% is stuff Fine just decides to talk about in lecture-- stupid bullshit that nobody cares about, e.g. lightbulbs, sunscreen, air pollution. Fine usually goes through this extra stuff very quickly in his lectures, only explaining it superficially. Don't try to teach it to yourself later on. His power point slides are useless. USELESS. Believe me. But you can't ignore the extra shit either, because he always asks questions about it on exams. He also made us spend time using this shitty software to try to understand Infra Red light and molecule vibrations.  It was a boring, a complete waste of time, but again, there were questions about the software on the exams. You will probably prefer to study chemistry with someone who doesn't subject you to that kind of bullshit. Chemistry is hard enough as is. \nThe other criticisms of Fine already listed in other reviews are completely accurate. His lectures are disorganized. No one seemed to mention that Fine is soft-spoken and never turns up the microphone. His demos are usually fun to watch, but hard to follow (and again, he WILL ask you questions about them on the midterm, so you have to take detailed notes on the demos and memorize these details for the exams. If you don't get the demos, go see him in office hours, or you're fucked.)\nThe good thing about Fine: he does care about teaching. He will always hold review sessions before the finals. Go to those review sessions. It will really help you anticipate what he will test you on. He will also upload past exams on courseworks. Sometimes they are helpful, sometimes they are misleading. Still, you have to do them to cover your ass.\nSo, if you want to do well in this class, basically you have to be responsible for knowing and understanding anything and everything that Fine mentions. It's a real ballbuster. The reviewer who said that he had to teach himself a lot of the material through Google got it exactly right. I did the same thing. When you have to actually go outside the class materials to learn what Fine is supposedly teaching you, you know you picked the wrong Chem section.\nWorkload:\nWeekly homework takes about 3 hours to do well, but it is not graded. Weekly quizzes in recitation. Three exams, one final. All exams are curved. Many a wasted hour trying to figure out what the hell Fine was talking about in lecture.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 29, 2004",
            "review_content": "\nLectures are a little out there but necessary as he likes to put in-lecture experiments on the test. His reviews before each midterm and the final are very beneficial.  Lectures are actually pretty interesting if you are into history of chemistry and more conceptual information. Do the practice tests he posts, look over the slides, and make SURE to actually READ the chapters.  Good curve.  Make sure to do well on the recitation quizzes as they count as much as a midterm when averaged together.\nWorkload:\nThree midterms, one extra credit assignment, recitation quizzes and a final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 23, 2004",
            "review_content": "\nThere's no point in going to lectures.  I went to 3 all semester and at each one, top attendance had to be 30 students out of a lecture of 150.   Fine just can't teach, and there's no way around it.  Read the textbook...outline it.  His lectures consist of power points that don't really teach the material very well.  He likes to drill the things that are really obvious and gloss over harder parts of the material.  In all honesty though, if you can't switch out of the class, don't worry.  Everybody does poorly on the tests so the curve helps a lot.  If you can avoid him, take Turro or McDermott...you might be slightly more engaged.\nWorkload:\nProblem Sets to do at your discretion...it's good to do them before the weekly quizzes.  Weekly quizzes, 5/8 counted.  3 midterms- not too bad with the curve.  Final...definitely easier than the midterms\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 22, 2004",
            "review_content": "\nWhat can be said about Leonard Fine that hasn't already been said?  For the most part, he seems to frustrate his students with his lectures and demonstrations which are often vague, confusing, and random.  The class just doesn't seem to follow a set path and sometimes it's hard to even know what it is that you're studying.  In fairness, Fine has some redeeming qualities though.  Of my first year teachers, he seemed to make the most effort into teaching.  He clearly cares about what he's doing, and he's a nice guy, and can sometimes be interesting.  But as a lecturer, he falls short.\nWorkload:\nThree midterms and a final, all multiple choice.  He repeats a number of questions from the midterms on the final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 21, 2004",
            "review_content": "\nReally boring class. Fine actually knows how to teach, though, and he does his absolute best to make it interesting. He just can't. He really tries, though - there are a lot of demos, some pretty cool. Every lecture he mentions another Columbia graduate who won the Nobel Prize in chemistry after studying in the very same room he's now teaching in.  You have to learn a ton of information. If you read along in the book you'll be OK - if you don't read or do any of the (optional) homework, you'll be about average. Hope you get a good TA who will re-teach everything every week. That is the only thing that will help you, since you'll fall asleep in lecture. It is really hard to make chemistry interesting, as demonstrated well by Fine.  \nWorkload:\nOptional homework. quizzes every week in recitation (there are 8, drop lowest 3). 3 midterms, final - at the end you drop the lowest out of 6 things - quiz total, midterms, and final (counts for 2). \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 20, 2004",
            "review_content": "\nProfessor Leonard Fine, where can we start?\nProfessor Fine started the year with an introduction to what we would learn in chemistry and even though CULPA told me he was boring (or that's what I remember CULPA telling me)  I thought the opposite from that first lecture. I said \"Hey, this can't be so bad.\" The second lecture he taught a little bit and had a cool exploding experiment and it seemed ok. The third and fourth lectures, the last two I ever attended, he taught nothing and I fell asleep on that uncozy piece of wood they call a \"desk\". To be correct, Prof. Fine taught stuff yes, but what that stuff is has nothing, and I cannot stress the meaning of NOTHING, to do with the respective chapters in the book. Let's just say that stuff was never mentioned again.\nA lecture is 75 minutes long and could be a very productive and enlightening lecture. 75 minutes are wasted instead if you decide to attend these lectures. I learned more studying on my own while watching TV for five hours than attending all four of those lectures - I was stuck on the same page in the book for those five hours.\nNow, TA sessions do make up for what Fine decided not to teach aka the stuff you actually need to know. You only have 50 minutes a session and meet only once a week. 150 minutes of lectures a week is all crammed into 50 minutes a week of TA sessions thus you will never learn every single thing, and no knowledge will be indepth. Depending on your TA, quizzes may or may not be hard. My TA asked us to know everything and thus 95% of the kids in my class do not have anything close to the 100% quiz average all of the kids with the easier TAs have. This is Fine's fault for not teaching anything.\nThe only homework you do is have quizzes on each chapter in each TA session (quizzes can take 10 to 15 minutes) thus resulting in only 40 minutes of learning time. There are 3 midterms and each works its own way. The first midterm was actually straightforward and I did pretty well in it. The second I didn't study for much and did poorly but 1/2 the questions were trick questions or just not related to anything we learned at all. The third midterm I spent at least 15 hours studying for - all that studying did not pay off because Fine basically said, when giving us that exam, \"You know all that studying you kids have been doing? Throw it all out the window because this test has nothing to do with the material.\" The midterms have NOTHING to do with the practice midterms although that is the ideal way to study. Fine tries to make you study extra stuff on the side and even tries to get you to use his computer program on IR frequencies. Fine asks you to know so much and 95% of what you have to know is self-taught. And the book sucks so self-teaching can be detrimental to your mental health. In fact, I was using Google for pretty much every aspect of chemistry that the book could not explain in even remotely understandable terms.\nIn conclusion, if you want to learn chemistry do not take this class b/c you will be ripping your hair out in frustration and anger and feel things like \"why do I even care to study? I won't do any better anyway\". If you want to do well in chemistry, do not take this class because you won't unless you are the nerdiest of all nerds (no offense to the nerds). My roommate came out of McDermott's final today 1 1/2 hr after it started at 9am - he also told me it started 30minutes late. He hasn't gotten less than 100% on any quiz and he had the freedom to not go to one midterm b/c he knew he'd do well on the final so as to drop his zero. If you can, try to get into McDermott's class or even Turro's who I hear has as easy a class. If you aren't going to learn anything anyway, you might as well do well in the class. Fine is not your answer and some day he will be replaced by someone who knows what the hell it means to be able to teach and to be fair when assigning chapters to study for midterms/finals.\nWorkload:\n3 Midterms each 20%, 8 Quizzes (drop 3 lowest automatically), and a Final (40%) of grade...you can drop either a midterm or half the Final grade. These are much harder than you'd like due to Fine liking to add extra material to your study time when neither he nor your TA even talked about that stuff.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 18, 2004",
            "review_content": "\nAlthough there are mixed reviews of this guy, I personally liked him. I went to every lecture because he made them so interesting with great demonstrations and interesting facts. He is very interesting to talk to and almost always available. Don't expect him to hold your hand and walk you through how to do problems in the lectures, he teaches beyond the text book, which is why you're at Columbia, so grow up and don't whin if you have to read the book and figure some stuff out on your own, besides, there is always recitation and office hours to help you.\nWorkload:\nLight, homework is never turned in, so its optional, quizes every week in recitation, three midterms and a final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 08, 2004",
            "review_content": "\nLen is very very boring and you will do just fine not going to the lectures.  He spends more time going over the nobel prize winners that studied at CU than actually teaching Chem.  Anything worthwhile in the lectures he goes over too fast for you to understand. He seems like a very intelligent man and he is very very nice but because of this course i am dropping pre-med for now.  The practice exams have nothing to do with the actual exams.  And from what i hear the other teachers are 10 times easier but Fine writes the Final so at least youll have a good idea what that will be like.  Basically if you want to learn anything then stick to your textbook.  One good point is that he will always try to give you the highest grade possible- for example we had a 25 question test where 5 of the questions didn't count but if you got all 5 questions right then he gave you the higher percentage grade.  \nWorkload:\n8 Quizzes in section (drop 3), 3 midterms (Drop 1)-ridiculously hard, Extra-Credit Paper, Final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 02, 2004",
            "review_content": "\nWARNING this is the worst professor you will ever encounter. Not only do his lectures go off on tangents but his test have nothing to do with his practice test. If you want to do well in this class, just hope that your a good guesser on test. If you are stuck with this guy i warn you to find A WAY to SWITCH classes because the other chemistry professors such as turro give very easy exams. However, what makes professor Fine a complete jerk is the fact that he will talk about dumb things in lecture that do not pertain to chemistry... and he is not funny... simply an old man who you want to kill! Therefore, if you are a pre-med student and your looking for good grades on your science courses, I will guarantee you that if you take another professor your llfe willl be much better. THIS IS THE IDEAL PROFESSOR FROM HELL!\nWorkload:\nweekly quizzes-not to bad, 3 exams which are ridiculously hard, and a final\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "November 17, 2004",
            "review_content": "\nI tried to stay awake in his lectures, but it simply doesn't work. He simply does not teach chemistry. He DOES teach something, but it definetely has nothing to do with what he's supposed to teach.\nThe textbook and the TAs are your saviours, though.\nWorkload:\nNo assignments, just quizzes in recitations. Three midterms, one dropped + final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "April 27, 2004",
            "review_content": "\nEhh....If your trying to learn something from this class, stop. Its impossible, the lectures go in circles and circles. They are also very boring. But all in all, Fine is a nice guy who is always trying to teach something (he fails). If you know chemistry, this class is easy. If you don't, it can be torture.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "April 12, 2004",
            "review_content": "\nAfter the first lecture, with his cool little movie about Havemeyer and little demos with fire, I thought Prof. Fine would be an awesome professor, but by the second lecture, I realized I was wrong. First, his lectures make no sense and I really wonder if he is still teaching because the Chemistry department pities him. Also, he would ramble on and on about the fricking nobel prize, politics or whatever else was on his mind for 20 minutes in lecture.  That will not help me on the MCAT, so please Prof Fine, do your job and teach Chemistry. And finally, he is arrogant and he does not respect his students and really does not care about them at all. \nThe exams were torture because he would ask questions about random things he said in lecture, he would throw material on the exam we were not required to know and his questions were poorly phrased, with plenty of run on sentences and more ramblings. Expect questions like \"well if I throw some sugar and salt in the air and they land in a bowl, tell me the percent weight of Cl-?\"  I was actually able to get an A but I didn't see that grade because Fine a) calculated everyone's grades wrong and b) he normalized our means with the means of Prof. Turro and Ann McDerment, who gave their classes exams that were insanely easy and straightforward. \nUnfortunately, being a post bacc I had to take this class, but just to give everyone a head's up, Columbia's teaching of Gen Chem is horrible and the faculty is very inept. I learned more when I took GChem at UChicago because I actually had to learn how to use the Schrodienger Equation, my profs didn't ramble about bullshit, it was all problem based, and we had exams that were not multiple choice. My final words of wisdom, go to lecture even though sitting through one is a bitch and a half, outline the chapters and do every single problem you can get your hands on. Otherwise, take this lecture with Turro or McDerment and stay away from Fine!\nWorkload:\n3 exams, one paper, 8 quizzes and one final, not bad but the class is mostly independent study. I had to not only outline the chapters of the textbook but had to make sense of his stupid powerpoint slides. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "February 12, 2004",
            "review_content": "\nIÂ’ve seen a lot of raves and a lot of rants so I just want to set some things straight.  Overall I think Professor Fine is a great professor.  Although, I agree with some of the negative comments posted.  Yes, he does talk about stuff that is not on the exam (e.g. history of 309 Havemeyer) but it makes the class interesting.  Yes, he is political to some degree.  But all of his Â“off topicÂ” stuff throughout the semester doesnÂ’t even add up to half a lecture.  He covers the material very well.  His powerpoints are a little bit disorganized, but he tries to give them out before lecture so you can take notes on them Â– unlike many other Profs.  When he works out problems, he works them out on the blackboard Â– which I think is much better than trying to follow equations through powerpoint slides.\nHe is very approachable during office hours and holds his own review sessions before the exam.  Go to those review sessions - he basically goes over everything you need to know.  Sometimes, he even gives away exam questions!   If you show up to lecture, you will be rewarded.  There are several questions on each exam that you will know just by being in lecture or seeing the demos.\nThe extra problem sets that he posts are ball busters, but he will help you solve them -  if you ask.  The TA's will also help you solve them - if you ask.  Yes, they are hard, but they really test your understanding of the material.  The exam questions are nowhere near as hard.\nThe class was fun and informative.  Professor Fine is definitely not condescending and aloof.  He responds to the mid-term survey that you fill out, he goes over it in class and addresses the suggestions and comments that students make.  He wants to get to know his students but you need to take the initiative too Â– he has over 300 students between the 2 sections.  He invited students to sign up to have dinner with him at faculty house.  I believe ~ 30 students signed up and he took them to dinner in groups of  10.  How many \"aloof and unapproachable\" Profs at Columbia do that?\n\nWorkload:\n3 mid-terms (19% if you do the 4% assignment, 20% each if you don't do the 4% assignment) and a final (counts as 2 exams) - drop one midterm or half of the final.  4% optional assignment (its an easy way to pick up points Â– if you hate the book selection, you can propose your own writeup for 4%)  bonus points for filling out surveys.  5 out of 10 recitation quizes count for 20% (one exam), the workload is not bad - like what someone else said:  30% of the class got A's and 50% got B's - that's not bad for G-Chem \n"
        },
        {
            "course_name": "Chem 1401",
            "review_date": "January 18, 2004",
            "review_content": "\nSteer clear of Prof. Fine at all costs.  I had to take the class because it was the only thing that would possibly fit into my schedule...this was the biggest mistake i ever made.  Unless you know all of the material beforehand, you will have no chance.  Taking this class, means that you are doomed to learn from the godawful textbook.  Sure, the first class is exciting he shows all those movie clips about the history of Havemeyer...and you like me will sit in your seat and think...this guy can't be so bad.  If you want to be bored out of your mind with irrelevant powerpoint lectures and demonstrations that fly far from anything you will ever see on one of his tests...take this class.  Otherwise, take someone, anyone else.\nWorkload:\n3 midterms, 1 final--all ball busters\nproblem sets for each chapter for no grade\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 08, 2004",
            "review_content": "\nthis course is exactly an independent study class.\nWorkload:\nnone. grading is fair though. 30% of the class got A's and 50% got B's.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 17, 2003",
            "review_content": "\nYea, he's boring, welcome to chemistry.  He's a nice guy and is interested in chemistry he may go off on tangents but he's not bad.  He teaches via powerpoint presentations.  He doesn't know everybody by the end of the semester probably because he has so many students.  The first and third midterms are pretty easy but the second one is usually the hardest.  The final was easier than I expected.  A lot of questions from the midterms were repeated on the final so go over them.  Read the textbook to understand the concepts.  He asks a good amoun t of concept questions so make sure you understand what you're doing.  Overall, this class doesn't take that much work when there is no midterm that week.\nWorkload:\nBest 5 of 8 quizzes from the recitation count for 20% of your grade which usually helps your average.  Each of the 3 midterms is 19% and the final counts as 2 midterms for 38%.  Out of these 5 midterms (3+final) the lowest is dropped so if you do well on the midterms the final will only be worth 19%.  The reason they are 19 and not 20% is because he saves 4% for a chem-related report.  This doesn't count for so much and he gives extra credit for online evaluations which can balance it out.  Homework is posted online but totally optional.  I would only go over them before a midterm/final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 16, 2003",
            "review_content": "\nHe's a brilliant man, and an interesting and entertaining lecturer, but a lot of the stuff he talks about has nothing to do with the material that will be on the exams.  He is also very political - \"Entire wars are being fought over hydrocarbons!\"\nWorkload:\nReasonable.  Weekly readings and problem sets that are not collected.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "November 17, 2003",
            "review_content": "\nFine's an alright professor. His power points can be disorganized and off topic at times but for the most part he covers the material well. He doesn't really answer questions which is annoying but ask the TAs, they're great. The pace of the class is, I feel, entirely too slow but that does make the exams much easier. \nWorkload:\nMinimal. Problem sets that are not required but help in studying for recitation quizzes. Tests were relatively simple. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "November 14, 2003",
            "review_content": "\nLeonard Fine pretty much destroyed my first semester of college.  All I learned through his lectures was who won the Nobel Prize in Chemistry in 1937 and why it should have gone to some other guy.  His lectures are completely off topic and pretty much force you to turn to the book.  After this class you will become a master in the art of independent stuying.  The thing is though, you can read every line in the book do every practice problem possilbe  and still get fucked on the test because Fine likes to be creative and put hard weirdass questions nobody has ever seen.  This section is by far the hardest in relation to the other chem section, so try to avoid by all means.  The only people that do well in this class are those who have a very strong background in chemistry.\nWorkload:\n3 exams, 1 final\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "June 09, 2003",
            "review_content": "\nHe's very knowledgeable, but also quite condescending.  I met with him a few times over the semester and did not find him to be very genuine in manner.  I did well, but his 3 professor system of teaching the course is the biggest cop-out by a professor I've ever seen in my academic career.  Also, his TAs basically run the class.  Being a post-bacc with a B.S. from the University of Miami and an M.A. from Tulane University and the University of Pittsburgh, I had the opportunity to learn from some highly respected professors at highly respected research instituitons.  So I figured Columbia would be above and beyond these schools in terms of academics and professor ability.  I am very disappointed to say that I was wrong in that assumption.  And that the assumption caused me to waste thousands of Manhattan rent dollars that could have been put to much better use at many other schools.  Columbia has the name, but not much substance to back it up, at least not in Professor Fine's Gen. Chem II.\nWorkload:\nModreview_content  review_content the text religiously, but don't expect the format of the exams to reflect the homework questions.\n"
        },
        {
            "course_name": "G.Chem I & II",
            "review_date": "May 26, 2003",
            "review_content": "\nDr. Fine will never win an award for most invigorating lecturer.  He does like talking about history and applications of chemistry to current events.  He will put one or two lecture demo questions on the exams to reward those who go to lecture.  \nYou just need to suck it up, bite the bullet, and do the work.   I did and I came out just fine.   \nWorkload:\nThree exams, one final, 5 out of 7 quizzes (recitation), ChemWrite essay.  \n"
        },
        {
            "course_name": "GCHEM",
            "review_date": "April 21, 2003",
            "review_content": "\nI am laughing hysterically reading these reviews. I had Prof. Fine in 1981 and he was not yet \"an old man.\" Also he stuck to chemistry back then. He wrote fantastic letters of recommendation. But the class was a nightmare with his condescending attitude, a certain arrogance and a lack of regard for the students' learning. I guess some things are timeless.\n"
        },
        {
            "course_name": "C1403-1404",
            "review_date": "March 25, 2003",
            "review_content": "\nSCIENCE REQUIREMENT?  This is an excellent course in general chemistry and science in general.  I'm writing this because I think that if you're looking for a really valuable supplement to your education with the science requirement, this could be a good choice.  You learn a lot across the board of science in a colorful and interesting way.  One of the goals of the course is to learn the basic language of chemistry and how to think critically about science in current events, an observation that seems to have escaped these other few reviewers of this class, and which obviously upset them.  (The review comment here that implied Prof. Fine was pushing a former president totally misrepresents the importance of learning how to discriminate about what politicians and journalists say about science - whether it is true or not, or feasible, etc.)  There are examples of how the science developed (past is prologue) as well as current topical considerations, such as pollution and the environment.\nSince the class sessions can contain about 600 students a year, the few complaints below really are vastly outnumbered by the students who have not complained.\nBoth Professors Fine and Valentini are very experienced, and workload and teaching is so well organized.  The professors are approachable and TAs and general assistance are good for help with problems also.  The way the course is set up, you accumulate points towards your final grade from the monthly exams, essay, Recitation quizzes and then final, so it is possible to get a good grade if you do well on most of the course and can afford to mess up once without great penalty.\nThe studies can be challenging, but if you start determined to keep up with the course, studying regularly, you will learn a lot about the world and exercise your mind/gain some good thinking skills along the way.  But if you're not up to working at it, you won't be able to do things at the last minute, so don't put yourself through the strain.  In this class you really have to stop and think about what is going on.  Profs. Fine and Valentini are outstanding lecturers and teachers - they work hard to provide color and interest to chemistry.  I think this situation is well worth taking advantage of, and  worth the effort.  \n(Good for everyone, and a plus, I would think, for someone planning to work in decision-making fields like an economist or administrator.)\nWorkload:\nStudy is lecture based, and is roughly equivalent to one text chapter per week; No graded homework, but homework problems are assigned or recommended for study and exam prep.  Additional one hour Recitation session with TA each week, including 7 or 8 short graded quizzes prepared by TA; one draft and then final 800-word essay based on reading selected from choice of about 8 current readable books about science; 3 monthly 75 minute exams outside of class schedule, fairly tough multiple choice, and one final.  \n"
        },
        {
            "course_name": "C1403-1404",
            "review_date": "March 19, 2003",
            "review_content": "\nfine is a fine old man, people might like him except his dry humor in his group emails. his lectures are okay but he never understands what question we really asking, he go speedy passing those hard questions and slow down repetitively for those moronic issues everyone've known. his monotone is dis-helping you catch what is the important part of the lecture, nobody sleeps in the lecture coz most of those are sleeping in their rooms instead, those went to the lecture are hardcore dudes and don't compete with them, calm down and swear never ever get trapped in chemistry building again after this classes!\nWorkload:\na lot homework, 4 big exams, \n"
        },
        {
            "course_name": "GCHEM",
            "review_date": "January 21, 2003",
            "review_content": "\nCome on people, there are far too many complaints about poor Professor Fine on CULPA.  No, his lectures are not wildly interesting, but he does have one major thing going for him: he is interested in his students.  I really don't know where the complaints on that score are coming from.  Starting on the first day of class, he makes it clear that he wants to help and makes himself extremely accessible.  And he's actually friendly.  That's more than I can say for most Columbia professors.  Also, his exams are really not that hard!  Yes, make sure you have notes on the demonstrations - that is the one catch.  However, if he continues to teach this course with the incompetent, condescending, and generally awful David Adams, I suggest running the hell in the other direction.  Do anything you can to stay out of this course if Adams continues to teach part of it.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 16, 2003",
            "review_content": "\nFine taught this course along with Rich Friesner and David Adams. Of the three, he was by far the most helpful, personable, and entertaining. At times he failed to overcome the difficulties presented by the huge sections and the horrible Havemeyer lecture room, but that may not really be a fair criticism. Some students disliked his frequent digressions into non-tested material, but I think it kept the lectures from becoming too dry.\nWorkload:\nProblems in the text were assigned but not checked. There were also several extra problem set handouts for review, also not checked.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 01, 2002",
            "review_content": "\nProfessor Fine was my least favorite of the three professors that taught the first semester of GChem. The lectures were very boring and filled with unimportant information; he focuses more on who made the discovery than on the discoveries themselves. He loves to test on his demonstrations and even some of the extraneous information, such as who won what nobel prize, so if u miss all the classes and neglect to get the notes from someone, you will certainly see a question or two that you have no idea about. While his lectures are awful, if you can't get around taking this course then you can make it bearable if you find what parts are important for you. The teachers after him aren't quite so bad.\nWorkload:\nHis worksheets of additional problems are quite different from the questions at the end of the book, so make sure you do them because they'll give you a better chance on the test.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 06, 2002",
            "review_content": "\nI would not wish what I just experienced in General Chem on my mortal enemy. The lectures were at times interesting, but we were prevented from any sort of enjoyment or sense of wonder by the exams, which in no way encouraged any love of the material or of the science of chemistry in general. WHAT IS THE DAMN POINT OF GIVING EXAMS WHERE THE ONLY GOAL IS TO MAKE THE STUDENT FEEL AS THOUGH HE/SHE IS AN IDIOT? I asked myself that question every time I left the exam hall. It is a real shame that professor Fine is permitted to continue his bullying year in and year out-perhaps students are merely happy to escape his class, and leave the burning building without ever looking back. I wish that someone would finally LISTEN to what people say about him. He may be a nice guy outside of class, but it is clear to me that he does not teach to be able to interact with motivated young people. He looks to scare them. What is the point? Why do we pay all this money to be treated in such a way? If he is so intent on giving difficult tests, let him teach uppper level classes, where the students are accustomed to such rough treatment. Why should he be the one to welcome students to the department? Is it really a good idea to introduce pre-med, pre-engineering, and other students to such an important body of material with a punch in the stomach delivered by a grinning Leonard Fine? It is my earnest hope that Prof. Fine will change his ways next year. I know that I am deluding myself. Therefore it is my hope that the department will wisen up and use other teachers next year. I can think of a few individuals who would do a better job, and care more about their students. Saddam Hussein comes to mind...\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "January 10, 2002",
            "review_content": "\nProfessor Fine is a harmless old man. He makes jokes and likes to praise anything and everything associated with Columbia. He knows chemistry, but his teaching is not as stellar. For the majority of the time, he rambles on and on about submarines, dye, space ships, and anything else that seems to have nothing to do with learning chemistry. He goes thru his slides so fast that trying to takes notes is really hard. and if you do go to lecture (which not many do) make sure you take notes on his demonstrations and the way that they work.... He loves to test on them. in general, not bad but can be very boring at times.\nWorkload:\n5 out of 7 quizzes in recitation, 3 exams, chemwrite, and Final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 20, 2001",
            "review_content": "\nUnfortunately, almost all engineers, chem majors, and pre-med's need to take this horrible course. Everyone hates the way the 3, yes 3, professors teach. The textbook is unacceptable, and riddled with mistakes (I've heard accounts of people trying to burn them after the final). If you took AP Chem in high school, do your best to get into another introductory class, even if it is more work.\nWorkload:\nHomework availale on website. HW Quizzes in recitation, worst 2 get dropped. 3 Tests + 1 Final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 06, 2001",
            "review_content": "\nThink he's a cool professor after the first lecture uh? NO!! What you learn is the history of chemistry and who Ronald Reagan is! After the first midterm, you would have the impulse to rip his b**** off and kick his a**! I don't really know why he's a professor because he never teaches anything! What you do is read the chapters by yourself, but you will never understand the book because it's like written in German! I didn't even know why I wasted money buying that sh*t! Chemwrite is bullsh*t! You never have to buy the book, just bs on your paper! The best thing to do after taking his exams is to go to gym and scream out his name! (don't forget to add the f word in front of it though...!) I am sure you will be able to do a hundred pounds more! I am sorry for the freshmen in SEAS (including myself)...\nWorkload:\nWorkload? NONE (besides the fricking chemwrite)... just gotta study for the fricking finals that will rape u anally!\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 03, 2001",
            "review_content": "\nWelcome to Chemical HISTORY. Here you will learn the biography of various chemists most of whom have discovered something or have worked at Columbia University. As for the subject of chemistry, you'll be learning NOTHING! Got insomnia? this class is a sure remedy. Just bring your pillow and sit back and enjoy the lecture.\nWorkload:\n3 exams, 1 final, 1 paper. And A LOT of independent studying!\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "December 31, 1999",
            "review_content": "\nA nice little old man. Understands chemistry very well. The only problem is teaching it. His lectures are boring (if you go to them) and he tries to praise Columbia every chance he gets. His textbook probably ranks in the top 10 worst texts in America. If you have to take this class then good luck.\nWorkload:\n1 easy Chemwrite, 3 tests (tough but theres a curve), and a final.\n"
        }
    ]
}