{
    "prof_info": [
        {
            "prof_name": "Johannes Somary",
            "prof_id": 9696,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 24, 2010",
            "review_content": "\nI would recommend him very highly. He's over 75, and his knowledge of music is incredible. Admittedly the quizzes were graded harshly for some people - but they didn't affect the final grade at all. You could go to a concert he was conducting instead of writing concert reports. It was also great that he brought in several people to play for us during our class times. He was always trying to help, and was very accessible. Cared a lot about us, and always made an effort to try and get to know us outside of class. I would definitely try and take another class with him. \nWorkload:\n2 concert reports (or concerts conducted by him), 1 listening assignment, final (with 25% take-home, 75% in-class known listening, unknown listening, and IDs) - seemed relatively easier than other Music Hum sections\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 29, 2010",
            "review_content": "\nAt first, I was a little wary of Professor Somary.  He was assigned to our class during the third week or so of the semester.  The music department offered little detail as to why the previous professor was no longer teaching.  The first quiz was graded pretty harshly.  A lot of people got C's and D's so many of us were kind of freaked out. Then as the semester went on, I grew to appreciate Somary and adjusted to the expectations of the quizzes.  Somary is an expert in the field and apparently a well-known composer.  His teaching went a little over my head sometimes because I have absolutely no background in music.  That said, I did learn a lot.  He is also very available outside of class for questions and extra help.  He truly cares about the students and is patient with people like me with no previous knowledge.  In the end I feel lukcy to have had Prof. Somary.  You are getting the most out of the core if you take Music Hum with him. He also is picky about writing... so your writing will definitely improve. \nWorkload:\nseveral quizzes throughout the semester instead of a midterm (some are listening), 2 concert reports, 1 listening assignment, take home final.  it seems like a lot, but very manageable. \n"
        }
    ]
}