{
    "prof_info": [
        {
            "prof_name": "Mignon Moore",
            "prof_id": 966,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Sociology of African American Life",
            "review_date": "April 13, 2015",
            "review_content": "\nProfessor Moore's class is absolutely excellent. The syllabus provides for a very broad range of discussion on Black life in America from a variety of angles including race and gender, race and politics, race and motherhood, race and cultural capital and many others. While it is a lecture course, Professor Moore really encourages discussion and often wants us to voice our opinions on what we are learning. She also encourages us to relate our own lives and experiences to the content regardless of racial identification. It is an eye-opening and thought provoking class that I would definitely recommend to anyone from a freshman, which I was when taking this course, to sociology majors, which the majority of my classmates were. \nAs far as Professor Moore's personality, she is a beautiful individual! Very kind and personable. She is always telling us stories about her life and even relates it to the material. She's great!\nWorkload:\nOne midterm in the form of short answers\nOne 5-7 page paper relating your own life to the content discussed in one unit\nOne final exam \n"
        },
        {
            "course_name": "The Changing American Family",
            "review_date": "October 02, 2003",
            "review_content": "\nHeed the warnings!  This was the WORST class I have ever taken.  Mignon is inflexible and humorless; her lectures are dry; and her class is generally insufferable.  Columbia students deserve better.\nWorkload:\na big pain.  take home midterm (15 pages, due a week after she hands it out), paper, lame in-class final.\n"
        },
        {
            "course_name": "Changing American Family",
            "review_date": "September 05, 2003",
            "review_content": "\nThe reviewers below who called this class a mockery and waste of time, and complained about the class' focus on the \"downtrodden African-American family\", actually made me WANT to take this course - as a sociolgoy major, of course I wanted to study the downtrodden African-American family in white elitist society.  I found the material generally interesting and worthwhile, though sometimes repetitive, and Moore teaches directly from the books, with lots of charts and graphs about family change trends.  Some subjects she covered were more interesting/worthwhile than others.  Not the best class I've ever taken, but not as bad as the other reviews would have you believe.\nWorkload:\nTake-home midterm and major paper, and two in-class quizzes.\n"
        },
        {
            "course_name": "V3264 The Changing American Family",
            "review_date": "June 02, 2002",
            "review_content": "\nThis class is PITIFUL. The previous reviewer who calls this class a mockery of academia is right on target. It's a mere recital of statistics with virtually no sociological theory argued, and with a constant undertow of the \"downtrodden black family in the white-elitist American society\" sentiment being advanced. Moreover, the three TA's couldn't be any more useless if they were in a coma. I just graduated 'magna' as a Sociology major, so trust me.......you will feel ripped off of tuition money (as I did) if you enroll in this.\nWorkload:\nWho cares? You shouldn't even consider this class!\n"
        },
        {
            "course_name": "V3264 The Changing American Family",
            "review_date": "May 07, 2002",
            "review_content": "\nThis was, by far, the WORST class I have ever taken at Columbia. It was a complete and utter mockery of academia. Sessions consisted almost entirely of self-absorbed students babbling about their own family problems. Professor Moore made hardly any attempt to guide the discussion, letting it meander where it may. On top of it, her lectures were insipid and boring. I've learned more about American families from watching reruns of \"Full House\" than I did from this class. Shameful, utterly shameful.\n"
        },
        {
            "course_name": "V3264 The Changing American Family",
            "review_date": "January 31, 2002",
            "review_content": "\nProf. Moore is great. She's interesting, funny, and has a great command of the subject matter. When we got behind because of 9/11 and some difficult readings, she adjusted the syllabus and extended the deadline for a paper--basically, she doesn't operate under the illusion that hers is the only class you're taking. The class is straightforward, and her lectures are organized and interesting. Discussion got off-topic sometimes, and she's let it go for awhile, so the class was generally pretty engaging.\nWorkload:\nTotally managable. Midterm, paper, in-class final.\n"
        }
    ]
}