{
    "prof_info": [
        {
            "prof_name": "Jon Steinsson",
            "prof_id": 4471,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 17, 2014",
            "review_content": "\nSteinsson is a great professor. He is pretty interactive and he makes the class a good blend of math, models and macro history. He lectures off slides but makes ample use of the board too. The class is more quantitative than the other Macro classes, which I think is a good thing. I would definitely recommend him over the other professors who teach the course. He also advised the government of Iceland during the financial crisis, so that's pretty cool.\nHomeworks were highly variable in length - anywhere from 1 to 7 hours per problem set. Steinsson also assigns a lot of reading, but I never did any of it and did fine on the tests. \nFor the exams, it's important to know the lecture slides in and out. He covers the important stuff from the readings on his slides, so they should be enough to get you through most of the history and reading related questions on his tests. Note that the final had a history question not covered in the slides, so you might want to be safe and do the readings - they are pretty interesting if you have time for them.\nThe class does cover a lot of material. Start studying early for the finals, else you'll realize that you have nearly 2000 slides to study the day before the exam.\nAlso, Linan, one of our TAs was awesome with his humorous recitation notes and emails.\nWorkload:\n6 problem sets (1 dropped)\n1 midterm (super easy - a quarter of the class got nearly 100%)\n1 final (super hard in retaliation for the easy midterm)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "July 29, 2013",
            "review_content": "\nProfessor Steinsson is about as good as it gets when it comes to a macro teacher.  I have heard from other students that, at least for economics students, macro can be a bit of a nebulous course at the whim of whoever teachers it.  Professor Steinsson, on the other hand, makes his expectations extremely clear and provides a breadth of intellectually satisfying readings to quench any academic cravings.  He encourages class participation (within reason), which is a refreshing change for economics professors.  Finally, when it comes to examinations and grading, he is utterly reasonable, which is all everyone wants.  \nHonestly, I have yet to find such a composed and worthwhile professor within the department, and I have made sure to take the staple professors of Principles and Micro.\nWorkload:\nStandard to Light.  Bi-weekly problem sets which take a bit of thought and effort, a midterm, and a final.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 10, 2012",
            "review_content": "\nReviewing Spring 2012, since I know he's in the process of revising the class. This semester, especially the first half, he really tried to go heavy on the calculus and models. After the midterm he took a survey and decided to ease back up for the second half. \nSteinsson is a good lecturer. He's organized and dynamic and structures the lectures well. He posts the slides a day later, so you can (and must) review them while solving problem sets & studying for exams. They are the key to the class.\nProblem sets usually involved solving a problem with the models we'd been shown. It would typically be similar to, but different from, what was covered in lecture. The problem sets were occasionally quite difficult and time consuming. However after solving them you really understood the model much better, so overall I think they were worth it.\nUnfortunately the exams were pretty shitty. They're relatively few questions, and it's impossible to guess what will be on them. I think he usually does a few history/reading questions, and solving a model. However you can't really tell what the balance will be. The single most important thing when studying is going over all the lecture slides. \nAlso, Nakamura is his wife ;)\nWorkload:\nSome reading, averaging around one textbook chapter and 2 short articles per week. Not too essential if you pay close attention to the history stuff in class.\n(20%) 6 problem sets, drop 1. They varied enormously in terms of time commitment. The first few were pretty heavy, with one of them taking 25+ hours. The later ones were much easier, with one taking less than 3 hours.\nMidterm exam was relatively easy if you attended class and paid attention to the lecture slides.\nFinal was pretty brutal, with some random things. Again reviewing all the lectures slides would help, along with going over the models. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "November 13, 2011",
            "review_content": "\n       I would recommend this class. It is challenging, but worth it in the end if you know how to approach it from the start. Jon Steinsson is a nice guy and I really liked how he incorporated real-life examples (through the extra readings) into his lectures. It made going to class very engaging and interesting. The thing I wish that I would have known before taking this class is not to sweat doing all of the readings. They are typically very interesting and information regarding one of them will be on the midterm & final. However, he will explain in class everything that he wants to you know about the readings. As long as you memorize the lecture slides (which he posts) that were about the readings before taking the exam, you will not be surprised. \n       That being said, reading the whole assignment from the textbook before class is a must. It is a very good book and is a good way to get a foundation of the material before going to lecture. Steinsson goes through topics very quickly sometimes and if you don't read the textbook beforehand you will have a hard time keeping up during lecture. All in all, it is a really doable class and a great experience. \nWorkload:\n25% Psets (6, with 1 dropped), 25% Midterm, 50% Final \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "November 12, 2010",
            "review_content": "\nIntermediate Macro with Steinsson is probably one of my favorite classes. Unlike the other Intermediate Macro classes, there was a lot of outside reading and it was always interesting and relevant. The textbook is very helpful and at the end of the class, you feel like you learned a lot. Not just about economic growth, but also about macroeconomic and microeconomic theory, game theory, what the current research on these topics is, etc. DEFINITELY DEFINITELY recommend this class. \nWorkload:\nGrade was 25% problem sets (6 of them, lowest one dropped), 25% midterm, 50% final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 18, 2010",
            "review_content": "\nid definitely recommend this class. it was both interesting and challenging,but not in an overwhelming way. there was quite a bit of reading but it was interesting and relevant stuff. and by reading i mean not only from the textbook, but articles and excerpts from papers and books. theres not too much math involved either(one of the TAs told me another macro class he had been exposed to was much more quantitative) if youre an econ major its a good call overall.  steinsson is kind of an awkward guy, but is nevertheless a good teacher and nice person. he tried make it more discussion oriented, which worked on occasions,  there are recitations once a week which id recommend going to. office hours with the TAs were also helpful. \ni guess my one complaint would be his posting practice midterms and finals without solutions. sort of annoying. \noverall recommended.\nWorkload:\npretty standard. HW 25%, Midterm 25%, Final 50%. there were 6 homeworks. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 16, 2010",
            "review_content": "\nTook Intermediate Macro in Spring '10.  Lectures were clear, on topic, and ran on time.  They were also interesting.  He tried hard to get the class involved.\nHe lectured from powerpoint slides that were posted on courseworks a day or two after the lecture.  Because we got the slides after the lecture it's always a toss up how much to write down versus how much to listen.  Overall the lectures were useful, and the slides were more reinforcement.  The lectures were NOT just simply reading the slides.\nThe reading list on the syllabus was VERY long, but most of it was additional background readings.  The required readings were pretty small, almost all from the two required texts.\nMidterm was harder than the final.  Grading seemed pretty fare.\nWorkload:\nGrade was 25% problem sets (6 of them, lowest one dropped), 25% midterm, 50% final.  Had at least 9 days for each problem set, and we were allowed to work in small groups.\nOverall workload wasn't bad at all.\n"
        }
    ]
}