{
    "prof_info": [
        {
            "prof_name": "Andrew Lipman",
            "prof_id": 13302,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "American Civilization to the Civil War",
            "review_date": "October 31, 2019",
            "review_content": "\nAPUSH ain't got nothing on this course. \nThe fact that we barely made it through the Revolution by the midterm is honestly my favorite part about this course. Lipman spends a long time (for a survey course) digging through American history - not just colonial history, not just US history - but actual American history. He'll change the way you see so much of American history, and gives so much context to what APUSH leaves out. Even if you're not that interested in US history, you'll really get a lot out of this course. \nLipman is a really engaging lecturer. He goes fast, and missing lecture means a lot of catch up, but he's funny and explains everything really well. The readings don't directly relate to lecture - they tend to cover a specific part of the time period in more detail. Discussion section is honestly pretty boring, but the readings are interesting. \nWorkload:\nQuite a lot of reading every week, but its never too difficult. 6 \"Q&Qs;\" - 2 page response papers based on reading. Helpful for drafting the essays. 3 4 page essays based on the readings. In class midterm and final. \n"
        },
        {
            "course_name": "American Civ to Civil War",
            "review_date": "January 22, 2019",
            "review_content": "\nAndrew Lipman was a wonderful professor -- he gives a very good lecture and is very clear on his expectations for his class. The topics of the lecture were always listed on the board, as well as the key terms he expected students to know. \nHe truly wants his students to succeed, and structures the evaluations in that way. The Q+Qs, which make up 20% of the grade, are based off a check system, and as long as you have read the piece and do some basic analysis, you will do well. The mideterm and the final are also based on the key terms he lists throughout the lecture -- the terms are used as proofs in essays. \nAt times, he can be very humurous in his lectures though at other times more serious, but he is able to differentiate which material deserves which treatment. For a large lecture, he is able to work in participation from the class, though it is not required in the syllabus -- this makes for more meaningful contributions to discussion. Furthermore, he always makes sure to ask for questions as he wraps up parts of the lecture. \nI would definitely reccomend taking this lecture!\nWorkload:\nWeekly readings for discussion section which were very manageable, Q+Q (which are essentially short reading response, you do six on any readings you choose, with half before the mideterm and half after) 20%, 3 papers - the first one was 10%, the last two 20%, a midterm (10%), final (20%)\n"
        },
        {
            "course_name": "American Civilization to the Civil War",
            "review_date": "December 07, 2017",
            "review_content": "\nThis course was very manageable with an interesting and cohesive overview of early American history. I appreciated that Professor Lipman drew on a range of historical texts to challenge dominate narratives of early American history and incorporate a range of voices into the historical narrative.  \nWorkload:\nThe work included three 4-6 page papers and an in class final. The work was very manageable and grading was fair. \n"
        },
        {
            "course_name": "Force and Power in Early America",
            "review_date": "December 08, 2016",
            "review_content": "\nAndrew Lipman is a super dope professor who really knows a ton about early American history! This course was a really great intro to a history seminar and I'm so glad I eased into the department with this course. The class size is about 14 people and the discussions (and texts) are fairly intersectional!\nWorkload:\nThree 5-7 page papers, one of these papers you turn into a 15-20 page paper for your final, pretty heavy reading (about 100-150 pages a week) but it's all interesting!\n"
        },
        {
            "course_name": "American Civilization to the Civil War",
            "review_date": "December 08, 2016",
            "review_content": "\nI had Professor Lipman for American Civilization to the Civil War. He is great. Class style is lecture and discussion based. I always felt comfortable asking questions or reviewing concepts.\nWorkload:\n4 or 5 2-3 page papers, midterm and final\nvery doable and on books we read and went over in great length \n"
        }
    ]
}