{
    "prof_info": [
        {
            "prof_name": "Meenakshi Rao",
            "prof_id": 2950,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Into Organic Chemistry Lab I BC3328",
            "review_date": "April 27, 2016",
            "review_content": "\nTruthfully, the labs themselves were not very hard because they were more qualitative, unlike the General Chemistry labs, which were more quantitative. That being said, everything else was definitely difficult in the sense that it had to all be a certain way, and somehow that certain way changed with every lab report. I started off with A's on my lab reports, but as the semester progressed, I ended up getting lower and lower grades, even though I worked harder towards the end. Honestly,this lab made my life miserable and required almost as much work as you would give an organic chemistry lecture. This lab was the reason I chose not to purse a chemistry major, and at this point I just want this entire Barnard Chemistry experience to be over. \nWorkload:\nLab report due every week and sometimes every other week. \nVery long pre labs. \nPreparing yourself mentally to go to recitation \nLab Final \n"
        },
        {
            "course_name": "Into Organic Chemistry Lab I BC3328",
            "review_date": "April 27, 2016",
            "review_content": "\nTruthfully, the labs themselves were not very hard because they were more qualitative, unlike the General Chemistry labs, which were more quantitative. That being said, everything else was definitely difficult in the sense that it had to all be a certain way, and somehow that certain way changed with every lab report. I started off with A's on my lab reports, but as the semester progressed, I ended up getting lower and lower grades, even though I worked harder towards the end. Honestly,this lab made my life miserable and required almost as much work as you would give an organic chemistry lecture. This lab was the reason I chose not to purse a chemistry major, and at this point I just want this entire Barnard Chemistry experience to be over. \nWorkload:\nLab report due every week and sometimes every other week. \nVery long pre labs. \nPreparing yourself mentally to go to recitation \nLab Final \n"
        },
        {
            "course_name": "Modern Techniques of Organic Chemistry Lec and Lab",
            "review_date": "December 11, 2013",
            "review_content": "\nDr. Rao is a really nice person and she obviously cares about her students; she took all of us to her house in Long Island and cooked us delicious food and it was a fun day!  However, this class is so poorly organized that I found it hard to respect her as an instructor.  The grading standards were so arbitrary, I spent most of the class never knowing what type of grade I was going to get.  She has favorites, so get on her good side, if you're not...you're in for some trouble.  I had high expectations for Dr. Rao and this class, but this class definitely did not live up to them.  \nBe prepared for some hellish grading and a lot of craziness.  This class was just...well, crazy.  \nWorkload:\nA long lab report usually every two weeks, quizzes each lab period that were stupid and hard, and pre-lab assignments every other week that were also stupid and hard.\n"
        },
        {
            "course_name": "Modern Techniques of Organic Chemistry Lec and Lab",
            "review_date": "July 03, 2013",
            "review_content": "\nSo, I wrote that review about orgo lab (the one below) and I stand by it. However, after spending more time with Rao, I would like to revise one thing: Dr. Rao sucks. She is childish, passive aggressive, moody, and stubborn in the worst way. I still think she has the potential to be nice, especially if you are one of her favorites (nice in an arbitrarily-gives-you-points-back kind of way), and that she can organize a lab well. She doesn't play nice with other members of the department and is too insular, which in any academic setting seems like a mistake.\nOrgo lab is still super easy, especially since most people deal with the lab instructors instead of her. \nModtech is miserable; it was the first time I was ever unbearably unhappy just standing around in a lab, from the moment I entered it. The work itself is fine. \nWorkload:\nalways go to her and see what she wants you to do differently whenever you get points off on something. Kiss her ass so violently and thoroughly you find yourself giving her an enema. \n"
        },
        {
            "course_name": "Into Organic Chemistry Lab I BC3328",
            "review_date": "April 22, 2012",
            "review_content": "\nWow. There are some seriously bitter premed chicks writing these reviews. \nDr. Rao isn't cuddly but she is funny, nice enough, and straightforward, and even better if you get used to her (I actually like her). Also, your experience in the lab depends largely on your lab instructors. I had Dr. Holtz and Dr. Lee, who are both wonderful, and I know and like Dr. Allen as well (you deeefinitely have to adjust to him before appreciating him). \nThe lab videos were a little frustrating because they were much longer than they needed to be. The actual lab itself was fairly different than BC2001 lab, especially the focus of the grading; Orgo lab was not very quantitative and fairly qualitative, so good observations are necessary for a good grade, even if they are consistently \"the solution was clear and colorless\" or \"the reaction mixture was colorless and clear\" or \"the solution lacked color and seemed clear\" (oftentimes, the solutions were clear and colorless), but pedantry is not necessarily rewarded. \nI understand complaints about the grading. It is usually unclear (and colorless) where you get points off, but there did seem to be a negative correlation between number of mistakes I made and the grade I was given. \nThe amount of time I spent working for this lab feels inordinate and it probably was. I didn't really keep track of the hours it took me to do each report, but, if I had to guess, I would say 5-6 hours, a few times much more. I went to office hours once; the labs themselves were not very difficult to understand. The prelabs would take 1-3 hours, and generally a shorter amount of time as the semester went on. Hardest part of the lab is the time commitment in addition to the time for Orgo Lecture. \nThe final this year was very easy, but I haven't gotten the grade back yet, sooooooo.....I can't comment on the harshness of the grading.\nOverall: THIS LAB IS FINE. DR. RAO IS FINE. EVERYONE CALM DOWN.\nWorkload:\ntime sink, but totally doable, especially if you hate the stress of having a vibrant social life, having to figure out what to do with free time, deciding which clubz 2 hit up on duh weekends with ur girlfriends, et cetera. \n"
        },
        {
            "course_name": "Orgo Lab",
            "review_date": "February 21, 2012",
            "review_content": "\nThis woman is truly the worst professor that I have ever encountered. I got A's and B+'s during the lab, but her attitude is horrible, no thanks to Professor Rao. She refuses to answer the simplest questions and will often go on rants about how she has many students and cannot answer that question for every student. This takes longer than answering the question would have. She does not even feign politeness or kindness and seems to be on a power trip off of controlling grades. You would think that at least she is a good lecturer, but no. She is not good at using the computer/projector in the room and often makes mistakes that she later corrects. I don't understand how she has been able to stay at Barnard for so long. Do not take this class with her - take it at columbia. \nWorkload:\n1 lab and 1 report each week -- study for the final!\n"
        },
        {
            "course_name": "Intro Organic Chemistry Lab I BC3328",
            "review_date": "May 09, 2011",
            "review_content": "\nYou should absolutely take the introductory Chemistry sequence at Barnard because the Barnard Chemistry Department is delightful.  So many office hours, and such approachable, engaged faculty.\nNow that you've entered the Barnard Chemistry sequence, the greatest piece of advice I can offer you is to ignore your lab report grades.  Think of each returned grade as the results from a lottery.  Be happy when you get an A- because you won a completely random lottery, but it's irrational to get upset at the other random grades they throw your way.\nDO NOT think of your grades as any reflection on your ability as a chemist.\nThat said, read through the grader's comments because, if you got a concept wrong, the comments can be helpful, and if there was something the grader disliked about formatting you can change that.\nHave a good attitude in lab.  It gets very tiring after about 4 pm, but performing experiments is such a great opportunity to interact differently with the material you learn on paper.  You do some really cool experiments, actually.  Think about what's actually happening in front of you.\nAlso don't watch the videos; that's a compete waste of time.  Just click through them to familiarize yourself with basic setups.\nWorkload:\n4.5-6 hours in lab each week, plus a few hours each week doing lab reports. Lab reports = 75% of grade.  Final = 25% of grade.  Beware: the final is graded VERY HARSHLY.\n"
        },
        {
            "course_name": "Into Organic Chemistry Lab I BC3328",
            "review_date": "May 17, 2009",
            "review_content": "\nWhen we all signed up for the Organic Chemistry Package, we knew we were looking at a semester of grueling work and nonstop stress. But we signed up for it and we were all prepared to face it. However, Organic Lab is more unreasonable and ridiculous than difficult. Outside of the sometimes 6 hours you will spent inside the lab, you would need to spend at least 10 hours doing your lab report to try and get that A. And be it that we're all pre-med's and overly achieving women, we all want that A. We've learned a lot obviously, and we've all worked so hard, but our grade will not show for it. \nOverall, I had an A- average in my Laboratory reports. However, I ended up with a B. The Final was 25%, and I must've almost failed in order to drop two grades down. Which I refuse to believe and have yet to hear from Rao. We studied for the final, and we worked hard all semester. But sometimes, when you get your lab report back, you would have no idea why you got a certain grade and who would you go to to ask? No one will want to talk to you about grades in this department. No one will tell you what you should do to improve on your next report. All you can do then is work harder and hope that things will get better. It doesn't. The work is not hard, but the grading is harsh. Meena Rao will not want to talk about grades and she will ignore you if you go ask her about your grades. She does want you to learn and we all do, but we'll all end up with a dent in our transcript. \nThe lab work takes away from the wonderful Organic Lecture that is concurrent. The lab final was on the friday of the tuesday of our lecture exam. They wanted us to hand in our labs before the one week due date, knowingly that we had a Lecture Exam that tuesday.\nI feel nothing but bitterness coming away from that class. If possible, I would recommend that future students not spend so much time on the Lab and concentrate more on the Lecture. The grading from the Lab is very arbitrary. It will not show your aptitude. Mind you, Rao is a wonderful woman. Quite funny and personable. But don't ask about grades. She'll ignore you. \nWorkload:\n3 to 6 hours weekly lab, 2 to 3 hours prelab, 7 to 10 hours lab report, semester of stress \n"
        },
        {
            "course_name": "Modern Techniques of Organic Chemistry Lec and Lab",
            "review_date": "January 13, 2009",
            "review_content": "\nRao initially comes off as a very scary woman-- I was petrified of her originally. As you get further in, she does grow on you (and vice versa). She's very intense, but like the rest of the chemistry department at Barnard, she does care about you actually learning the material. She's a good teacher, and very helpful during her office hours. An important tip-- the final exam DOES MATTER. Study for it! I got solid A's on all of my lab reports (even an A+ here and there), but must've screwed up the final, because I wound up getting an A- overall.\nWorkload:\nsimple lab writeups for every experiment (usually weekly, 75%), one final exam (25%)\n"
        },
        {
            "course_name": "Into Organic Chemistry Lab I BC3328",
            "review_date": "December 10, 2008",
            "review_content": "\nI had the strangest experience in this class.  I started out getting A's and A-'s and then I had one \"run-in\" (this is a stretch, I asked her if I could photocopy a worksheet she said she emailed, but didn't) with her and all of a sudden my grades began to go down incrementally (A- --> B+ --> B --> B-).  Honestly, I don't even know how to get on her good side, but if you want to try, I think being passive in every situation and not asking her any questions, is a start.  \nI guess my only advice is to make friends with the other lab instructors, who are infinitely more approachable than Rao.  Good luck.  \nWorkload:\nTurn in 1 lab a week and 1 manageable/easier final\n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "May 17, 2008",
            "review_content": "\nProfessor Rao has favorites, just as the other lab teachers do.  If you aren't one of her favorites, then you're just going to get lower grades than everyone else.  I used to do my lab write ups ina  group and we'd all have more or less the same answers, yet I always ended up with lower grades...explain that to me.  Basically, as hard as you try, if you're not one of her favorites, you're not going to get a good grade.  Her lab videos take way too long and you have to get past understanding her accent to actually understand them.  Lab lectures were kinda helpful but not the best either.  \nWorkload:\nweekly lab writeups, weekly pre-lab, written final, weekly lab videos\n"
        },
        {
            "course_name": "Orgo Lab",
            "review_date": "September 12, 2007",
            "review_content": "\nThis woman is, in my opinion, truly awful.  She is mean to everyone and is not very willing to help.  One other review says to get on her good side, but I honestly don't think she has one.  The labs were hard, but I always got good percent errors, never broke anything, and always came on time.  Even after tons of work writing up the reports and having really good results in the lab, I got B-'s at best.  The grading seems very subjective and since the chem lab dept seems to hate its students, the grades rarely turn out well.  Try to avoid taking this lab!  Take it at Columbia.  \nWorkload:\nA 5 hour lab once a week and a lab report that takes 10+ hours to complete on your own plus another 3-4 hours in the help room trying to understand what is going on.  \n"
        },
        {
            "course_name": "Orgo Lab",
            "review_date": "August 19, 2007",
            "review_content": "\nRao is sort of crazy. She can be really mean and a fellow professor of hers (my advisor who is in another department) said he heard her described as a \"real piece of work\" - and that's just what she is. She's nice to those she likes, but if you are late or forget things or break things she can get pretty nasty fast. GET ON HER GOOD SIDE.\nOur lab reports were detailed and labs went over time quite often.  Try to work as fast as possible without committing errors. Don't be the last to get in line for the RotoVap!  Reports are nothing toooo complicated, but feel free to go to office hours where they will almost tell you the answer. They compliment the lecture class well.\nWe also have to watch long videos before each lab period showing the lab we are about to do. These helped take off \"demonstration\" time from the actual lab period, but sometimes the videos could last over an hour to watch online. She expects everyone to have seen them and not need too much instruction in the procedure. Take really detailed notes from the videos - they help a lot when you have to do the actual lab.\nWorkload:\nWeekly lab reports - take about a full half day or more if you include \"prelab\" writeup time. A written final exam - STUDY THE NOTEBOOK and YOUR RESULTS! The lab \"helpers\" are really nice - ask them if you have problems.\n"
        },
        {
            "course_name": "Intro to Organic Chemistry lab",
            "review_date": "May 22, 2007",
            "review_content": "\nShe was truly mean and unhelpful.  Can crush any love for chemistry out of you.  I found that I liked orgo in lecture and hated it in lab. I think it is due to each istructor's attitude towards students.  She honestly made lab unbearable.  Oh and there is absolutely no standard in grading. I asked her a question about it, and she honestly said that the grading depended on the instructor! the audacity!\nWorkload:\nlong lab, weekly reports that are not graded on any scale, final\n"
        },
        {
            "course_name": "Into Organic Chemistry Lab I BC3328",
            "review_date": "May 10, 2007",
            "review_content": "\nRao is both scary and hilarious. She is not very sympathetic to students, but the lab is still run well and lots of help is available from other instructors who do not make you nervous enough to spill your reagents. \nWorkload:\nweekly lab write up + questions. fairly easy final exam.\n"
        },
        {
            "course_name": "Chemistry I Lab",
            "review_date": "May 22, 2006",
            "review_content": "\nProfessor Rao was on ok instructer. She did not seem very tolerant of her students though and often gave obnoxious answers to questions or would refuse to answer questions at all, saying \"I already told you the answer to that\" or something to that effect. Her lab demonstrations droned on and could have been shortened and even the recitation could have been made more concise. Also, often, she would not explain the why or how part of the experiment. Anyways, she is bareable but if you have a choice, don't take Orgo lab with Rao (though I heard some of the other instructers were not much better. Dr. Holtz is the best though). Work load consisted of weekly lab reports, graded pretty fairly though points were sometimes taken off for no apparent reason. Supposedly there were grading standards, but these were not explained to us. Also, I heard that Rao said you are allowed to question the grading of one lab only, all other inquiries will be ignored. That's the kind of negative attitude I am trying to get accross.\nWorkload:\nWeekly lab reports and a final (it focused a lot on the procedure of the labs - as opposed to the lab questions, which we were led to believe would be the focus of the exam so beware).\n"
        }
    ]
}