{
    "prof_info": [
        {
            "prof_name": "Nancy Woloch",
            "prof_id": 1665,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Education in American History",
            "review_date": "March 11, 2010",
            "review_content": "\nI could not disagree more with the negative reviews. I enjoyed Professor Woloch's seminar and thought she did a good job leading discussion. On a few occasions, she did ask some students (who had clearly not done the reading) to clarify their comments, but not in such a way that she seemed to be trying to embarrass or intimidate them. Most students in the seminar seemed genuinely comfortable contributing to the discussion and she asked us to prepare a set of written notes for each class, which were considered as part of the participation grade. Overall, I thought Professor Woloch was very kind, exceedingly fair, and seemed genuinely interested in the thoughts and experiences of the class. Be reasonably well-prepared, don't confuse the 1930's with the 1890's, and you'll be fine. \nWorkload:\nReasonable--written comments, two short papers, and a final paper. In-class participation is 50% of the grade.\n"
        },
        {
            "course_name": "Education in American History",
            "review_date": "February 01, 2010",
            "review_content": "\nProfessor Woloch is insane.\nAs a senior, this is the worst class I have ever taken at this school and will probably be my biggest regret of college. As a student actually interested in education history, this class was a complete waste of time. I learned absolutely nothing. The class is like any other seminar: readings, in class discussion, and a few papers. Too bad Prof. Woloch has no idea how to lead a discussion: she interrupts students with her incoherent comments and her maniacal cackle. She was also always generally confused and didn't seem to understand anything that anyone was saying. \n\nWorkload:\nThe papers/reading are manageable but she plays favorites which definitely influences your grades--- only take this class if you are cute, stupid, and a boy and you will definitely get an A!\nFor everyone else--STAY AWAY! Nancy needs to retire ASAP....or go to a mental institution. YOUR CHOICE BARNARD. \n"
        },
        {
            "course_name": "Education in American History",
            "review_date": "January 01, 2010",
            "review_content": "\nUnlike some of the other reviewers, I really enjoyed this class.  I found the subject material interesting, and all the reading was well-chosen and relevant.  I also liked how Professor Woloch led the discussions--she demanded coherent, relevant responses from her students.  Often, this meant that she would ask a student to clarify what he/she had just said, sometimes several times.  While this may have seemed annoying, I actually found it very helpful--I can't stand students trying to BS their way with convoluted, irrelevant responses.  She would also make sure that students specified exactly what they were talking about in terms of historical periods.  Some students seemed noticeably confused by this, which I found surprising.  (After all, it is a HISTORY class.)  \nShe graded the papers very reasonably, and the topics we were given were flexible enough that we could write about what was most interesting to us.\nWorkload:\nNot bad for a seminar.  Weekly readings that are necessary for discussion, along with writing weekly comments to turn in at the next class.  Two shorter papers, one longer (10-12 pages) one.  Nothing unreasonable, and graded fairly.\n"
        },
        {
            "course_name": "Education in American History",
            "review_date": "December 12, 2008",
            "review_content": "\nDO NOT TAKE THIS COURSE!\nThings that are awful about it:\nShe does not know how to lead a discussion. She gives no hint that she even knows what she is talking about. She will cut students off mid-sentence to interject her inane comments. And whenever a student will try to really analyze the text, she would make them repeat themselves BECAUSE SHE COULD NOT UNDERSTAND THEM! Anything more profound than someone just talking about their own high school would be shut down. By the end of the semester the smart students with interesting things to say simply stopped talking because they recognized that they were too smart for their professor. She also has the oddest and most uncomfortable way of speaking. She cackles mid-sentence...honestly.\nHer grading is arbitrary. She grades entirely on grammar because she does not understand the content. Others have said that she is an easy A. But it really depends on how much she likes you. An A is possible, but I found some of the most intelligent students were getting B/B+ for no real reason. \nShe picks favorites. And normally they are the guys in the class, or the less intelligent girls (because they speak at her level).\nThe one good part of the course was the readings. Therefore, if you are interested in the subject just look at the syllabus and do the readings on your own time. They are fascinating and it is not as though you will gain anything more from going to class.\nNancy Woloch puts shame to the institution of Barnard College. \n"
        },
        {
            "course_name": "Education in American History",
            "review_date": "January 23, 2008",
            "review_content": "\nI had never felt uncomfortable in a discussion-based class until this one.  Professor Woloch was an odd lady who I found extremely irritating and unhelpful.  She may be an easy grader, but I couldn't get past the fact that she seemed to have no passion or basis for interest in the subject matter.  Overall, not so much.\nWorkload:\n2 5 pagers, 1 10-12 pager, a reasonable amount of reading. Not worth the grating, miserable 2 hours each week.\n"
        },
        {
            "course_name": "Education in American History",
            "review_date": "December 17, 2006",
            "review_content": "\nBeware, do not assume that this is an actual history class because in my opinion it is, in fact, not. Professor Woloch seems to have no interest and little understanding in the historical context of the things that she discusses -- she is only interested in the idealistic educational reformers that she discusses in class. She picks favorites, so don't do anything stupid on the first day of class. Most of the discussion time was spent on her rants or ravings of her favorite figures. You don't have to know anything about history or education to take this class. Just bring in your past school experiences and she'll love you for it. The grades she gives on papers depend heavily on grammar, and she doesn't seem to care about historical accuracy as long as you bring in strong personal opinions which makes it rather easy if you can bring yourself to do that. She also seems to think that seminars are only supposed to last an hour and a half, so she let us out 15 minutes early -- another perk.\nWorkload:\nWeekly reading which is not unreasonable for a seminar especially since you don't have to read it to master any sort of understanding of the material. You're supposed to bring in 3 comments every week, which she will never collect. 3 papers overall -- the first two are 5 pages and on class readings, and the final paper (12-15 pages) is a comparison of 3 books that you can choose on your own.\n"
        },
        {
            "course_name": "Education in American History",
            "review_date": "December 20, 2004",
            "review_content": "\nHonestly, I could not disagree more with the previous reviews. I thought the class was fantastic and interesting, and I am not even majoring in education! True, it was obvious when people did not do the reading but usually the discussions were always multi-faceted and intelligent, with many people bringing in personal experiences to complement the reading (which happens to be great, by the way!). Professor Woloch is very pleasant and seems to love every single student, though she isn't afraid to shut people down when they weren't making much sense or rambling with their comments. The class may not be for everyone, but you certainly don't need to be an education major to get a lot out of it (there were plenty of english and history majors).  Take the class and enjoy it while it's still offered. You'll learn a lot!!!!!\nWorkload:\n5 pg paper on Horace Mann that is very fair, and allows you to bring in personal experiences. 12-15 pg. paper on any topic in educational history so you'r e free to pursue your interests here. It is graded on the easier side (which doesn't in any way discredit Professor Woloch's ability as a teacher. Take the class!!!\n"
        },
        {
            "course_name": "Education in American History",
            "review_date": "January 22, 2004",
            "review_content": "\nYou just have to decide do I want to take a really easy class that is boring beyond belief and wast a few thousand in tuiton or should I take something a little more interesting and stimulating.\nIf you want a blowoff class take this.\nWorkload:\n2 short papers 1 long  - VERY EASY.\n"
        },
        {
            "course_name": "Education in American History",
            "review_date": "January 12, 2004",
            "review_content": "\nProf Woloch is a terribly sweet woman.  She is very kind and loves to have students come talk to her.  However, I often found seminar discussions to be lacking direction and stimulation.  This class is pretty easy.  There is not that much reading for a seminar, and much of it is quite enjoyable.  If you speak up in class, Prof Woloch will like you even more.\nWorkload:\nTwo short (5 page) papers on assigned topics, and one longer (10-12 pages) paper comparing three books of your choice.  Prof. Woloch isn't a difficult grader, just be sure to stay on topic.\n"
        },
        {
            "course_name": "Education in American History",
            "review_date": "June 02, 2003",
            "review_content": "\nI don't know whether to say the class was good or bad. The good is that she is an easy grader, you do not have to do the weekly reading unlike other seminars because she does not call on people and if you decide to speak the topics are so general you can bullshit your way through it.  She took way more people then the usual 15 so the class was crowded (I think about 22 students) so it was easy to dissapear. The paper assignments are short and VERY easy.  I think it was two five pagers and one 10 pager at the end  - all on topics from weekly readings. She also let class out way early almost every week. \nThe bad. The class was BORING! and I am an education/history major. It was difficult to stay awake most weeks and many people did not. I feel like the class was a waste of time and it probably needs to be revamped but hey it was an easy A. If you are looking for an easy seminar I don't think there is one easier.\n"
        }
    ]
}