{
    "prof_info": [
        {
            "prof_name": "Dale Shuger",
            "prof_id": 6353,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Hispanic Cultures I",
            "review_date": "May 09, 2011",
            "review_content": "\nI signed up to take this class with Jannette Amaral, who was there the first day but was replaced by Dale. I should have switched sections. Dale was uninspiring, unpleasant, and the class was underwhelming. She would basically spew random facts from the assigned historical background, lead an awkward discussion about the selected literature/images, and hand back graded assignments at the end. The grading was harsh and her comments were completely unhelpful. For a Spanish class, she needs to lighten up, especially when it comes to judging content. She was very nit-picky and inflexible, and also chose clear favorites. Her Spanish was sometimes difficult to understand. She would make very awkward comments in class, sometimes revealing random personal things no one cared to hear. \nOverall, I wouldn't recommend the course, and definitely not her section. The syllabus and the accompanying website are a train wreck that the department needs to sort out. This class dabbles between language, history, literature, and art with no clear focus or thematic takeaways. Too bad this is the first half of a required sequence for the concentration/major. \nWorkload:\n7 compositions, the first 3 with re-writes in which the final grade is averaged (these were all graded harshly); participation and leading a class presentation/discussion, which basically everyone gets full credit for (not exactly fair, given the disparity of presentation/discussion quality); 3 exams that test your knowledge of insignificant details and how much Dale likes you (these tests are VERY HARSHLY graded and count for 50% of the grade, so mess one up and it's game over)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 08, 2009",
            "review_content": "\nThis was the first time that Dale taught this class, and I thought she did a good job.  At times she was a bit person, revealing things I didn't really need to know about her.  But overall I learned a lot.  Workload was pretty light: reading for each class, one \"background presentation,\" 2 papers, and the Core exams.  I thought her grading was fair, and she is very approachable.   She is more than willing to make the class come alive, and she does want her students to learn and do well.  Not the best Lit Hum teacher, but a solid class.\nWorkload:\nNo busy work.  1 5-minute background presentation, 2 papers, midterm, and final.\n"
        }
    ]
}