{
    "prof_info": [
        {
            "prof_name": "David Wills",
            "prof_id": 12337,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Critical Approaches to the Study of Race and Ethnicity",
            "review_date": "June 18, 2012",
            "review_content": "\nThis class will forever go down as one of the best classes I've ever taken. David is an outstanding person - hilarious, articulate, and adorable. You will wish class came more often. The readings are dense, and there are many, but learn to skim and absorb and you'll fare well. You'll show up to class expecting the conversation to go one way, and then ending up somewhere completely different. David has a keen interest in (often archaic (German)) philosophy, so expect that to play a major role. One moment, you'll be discussing \"projecting myths onto bodies\" in very abstract terms, and the next, you'll realize how relevant that is to the latest episode of Teen Mom! I kid you not, we spent part of a class discussing that program.\nThis is the kind of class that will (hopefully!) have reunions in the future. David gives you a lot of room to design your own essay topics and projects - probably in part because he's a young teacher, but also because he's genuinely interested in seeing what you can come up with. This can be daunting, especially in considering all the material you've covered, but don't sweat it. He really just wants to hear you speak about something you're interested in, and who better to ask the right questions than you?\nI left this class with an entirely new understanding of race, ethnicity, privilege, prejudice, myth, and intersectionality. I feel I can engage in these kinds of discussions with a strong foundation (I can use the words \"discourse\" and \"normative\" and really mean them!) in the subjects, but more importantly, I can listen and be open. Because if the class taught me anything, it's the these concepts are ever-shifting, and always-crucial. In short: everyone should be required to take this class. You WILL learn something, you will in all likelihood love it, and you will want to pursue the subject more.\nWorkload:\nThere are quite a lot of readings (not always crucial but very helpful anyways), a weekly 1-2pg paper (you can literally write about anything), a 5-7pg midterm and a 7-9pg final. As previously stated, the topics of the final and midterm are really designed by you.\n"
        }
    ]
}