{
    "prof_info": [
        {
            "prof_name": "Richard Kopelman",
            "prof_id": 854,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Managing Human Behavior in the Organization",
            "review_date": "May 10, 2012",
            "review_content": "\nThe course is using the material that was not updated for three decades. It is a shame for Columbia University that considers being one of the most updated schools to offer a course that is back from the past. In addition, professor teaches the same course with the SAME notes and material in Baruch College. Baruch education is not doubtful, but cost significantly less than Columbia Courses. Why should I pay 4K for the class when the same course in Baruch costs 800?! This is ridiculous and very upsetting. Total waste of money. I will never take any courses from the business certificate in Columbia again and will not ever recommend them too. In fact, I will write everywhere I can about how Baruch college professor teaches absolutely same 1980s theories in Columbia for the price of Columbia courses. This is a rip-off!\nThe instructor failed as a professor. As a paradox all of the theories he was teaching in class were very useful to implement in the course itself and show how they work in real life.. However, it seems that instructor does not believe in them, because his teaching skills are far from great management skills. The class is not organized. All of the key terms barely appear on lectures, do not exist in a book, but put in a very sophisticated way in the exam. Two weeks of studying for the exam was a waste of time, because only few terms were useful for it. Everything else was twisted and unclear. Reading assignments are not coordinated with lectures at all. The course is far from being on a level of private school education. It does not have any interesting and unique information that is present in other true Columbia courses.\nI had a recording device for every lecture. And even with that many of the terms were mentioned briefly and unclear. However, on the exam they were presented as part of the most important things in the course.\n\nWorkload:\nAcceptable. Coordination of readings with lectures would make it much better.\n"
        },
        {
            "course_name": "Managing Human Behavior in the Organization",
            "review_date": "April 29, 2011",
            "review_content": "\nProfessor Kopelman did invest in the creation of this wonderful class and the material used... in the 1980's...\nIt is really unfortunate and even shameful that a professor has been using the same notes for his course for over three decades; and its even worse since it's Columbia U. Personally, I believe Kopelman is a good professor but is just unable to let go of the course structure and outdated info due to a case of OCD... But the impact is obvious to the class, which has to deal with outdated theories and old technology to project them (videos from the 70's and 80's as well as a projector/slides from the late 80's). I would love to get my $4,000 back... and invest it in something useful!\nWorkload:\nWorkload is minimal. Start the 50 pager early to ease your final period.\n"
        },
        {
            "course_name": "Managing Human Behavior in the Organization",
            "review_date": "January 02, 2007",
            "review_content": "\nUnfortunately, this class is mandatory for many students in the IEOR major and Kopelman is the only prof who teaches it.  Unlike many of the reviewers here, I did not enjoy this class, solely due to the professor, as I enjoyed the material.  Kopelman showed extreme favoritism towards certain students, and was very rude & impatient towards students that fit his preconceived stereotypes.  To make matters worse, this reflected conpicuously in the grades.  From the beginning of the course, he subtly insinuated that these types of students were lazy, and he wished it weren't mandatory for them to take the course.  An example - he had stated how important feedback was in his lecture, yet 10 minutes later when I asked him \"for feedback on my essay\", he simply said, \"Take better notes.\"\nLet's be clear - I received extremely high scores in the portions of the course that were only right/wrong answers and no room for doubt(eg: multiple choice, certain types of shorts essays)...yet my colleagues and I received horrible scores on the portions up to the discretion of the (biased) grader.\n Coincidence?  You decide.\n\nWorkload:\nnot too bad, though you might want to start he final project ahead of time.\n"
        },
        {
            "course_name": "Managing Human Behavior in the Organization",
            "review_date": "January 10, 2006",
            "review_content": "\nTo use a phrase that is a little overplayed on CULPA, this is one of the best classes I've taken at Columbia.  Prof. \nKopelman makes the two-and-a-half hours go by very quickly, showing a lot of entertaining British videos and getting the class involved in some fun and pretty informative exercises.  He practices what he preaches: the grading is scientific and fair.  The 50-page term paper isn't as bad as it sounds, because you do it with a group of four or five classmates, but it'll be easier if you get a fairly early start.  There's not a great deal of other work for the class, just reading (never more than a few dozen pages) and some written homeworks early in the semester.\nOn word on the exams: they can get kind specific (some would say nitpicky), so take advantage of the fact that he lets you bring in a cheat sheet.  That won't do you much good if you don't go to class though.  You MIGHT be able to do well if you skip all the reading and go to all the classes, but you WILL do poorly if you miss more than a class or two.  My advice is to go to all the classes, and if you don't want to do all the reading, focus your attention on the readings and cases in the coursepack rather than the textbook.  If you do that (and take really good notes), you'll be fine.\nYou will learn an unbelievable amount, especially if you're interested in business or, even more broadly, human behavior.  I've found myself applying course concepts on an almost daily basis, and it's easy to see parallels between what you're learning and the real world.  This is a great, great class.\nWorkload:\nThree homeworks, with the option to do a fourth.  He'll count your best two for 10 percent.  The midterm is 20 percent.  The final is 30 percent and only covers post-\nmidterm material.  The 50-page group paper is 30 percent also, and there's also a 3-4 page paper you write with your group that counts for 10 percent.  There's a light reading load (a few dozen pages per week).\n"
        },
        {
            "course_name": "Managing Human Behavior in the Organization",
            "review_date": "December 22, 2005",
            "review_content": "\nA wonderful professor.  Professor Kopelman teaches some of the most useful and interesting concepts on organizational behavior (working effectively in groups, being a good manager, measuring performance, etc ...).  These concepts sound abstract and stupid, and they can be if taught poorly (such as in Gateway with \"Jack\"), but this man knows his stuff and the learning is non-stop.  This class, in many ways, is a portrayal of what Gateway should be.  By far, one of the best classes at Columbia.  If you can get into this class, it will change your life.\nWorkload:\n4 HW assignments (2 highest grades count), 1 midterm (30%), 1 non-cumulative final (30%), 50-page group case study analysis (30%), short group paper (10%).\n"
        },
        {
            "course_name": "Managing Human Behavior in the Organization",
            "review_date": "March 21, 2005",
            "review_content": "\nThis Professor would be proud to know that he teaches one of the only useful classes at Columbia. Great, great stuff. Lectures are long, but immensly interactive and entertaining. Ever wonder what John Kleese did before he became famous? Well, he made management videos, and Professor Kopelman is a big fan. Incredibly informative reading list and well structured. Should be taken by anyone looking to exercise the non liberal arts portion of your brain.\nWorkload:\nWeekly readings, midterm and final (two pages of notes allowed). One big ass group project and several little ass projects. I recommend that you make sure that your group members all know how to spell.\n"
        },
        {
            "course_name": "Managing Human Behavior in the Organization",
            "review_date": "November 09, 2004",
            "review_content": "\nThis is an interesting class, but you need to take extremely good notes if you want to do well.  Even random obscure references from class can appear on the midterm.  You get a 2-sided cheat sheet, but I recommend putting a lot of time into it (he'll give you a list of terms).\nWorkload:\n2-3 HWs, Brief Paper, Group Project\n"
        },
        {
            "course_name": "Managing Human Behavior in the Organization",
            "review_date": "December 21, 2001",
            "review_content": "\nGreat Class!!! But the catch is that if you want to do well, you have to go to the lectures or get notes from someone who takes great notes. The 2 1/2 hour class goes by really quickly. He knows how hard it is to keep up for such a long time so often he shows movies that are pretty funny and in-class demonstrations. Highly recommended even if you're not majoring in Engineering Management Systems. If you like psychology, you'll like this class.\nWorkload:\nMidterm and Final (you're allowed to use a cheat sheet), 2 homework assignments, 1 consulting case study, 1 50-page term project (really not as bad as you think)\n"
        }
    ]
}