{
    "prof_info": [
        {
            "prof_name": "Josef Lazar",
            "prof_id": 3090,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 16, 2007",
            "review_content": "\nPepa is a biologist. He knows very little about the topics presented in Frontiers of Science. But that doesn't stop him! He keeps the class overtime to speak in an extremely boring monotone. Luckily the class is silent; you'll have no problem listening to him talk about the thousands of slides he presents while your stomach growls (the class is at 6 to 8). Like the other classes, Pepa makes you email him questions from Frontiers questions. Probably unlike other sections, however, Pepa categorizes questions into four different types. This system allows him to assign a maximum of points per assignment as determined by category; a category A question can only get 6 out of 10 points.\nThis class was so bad it was surreal. He calmly attempts to discuss what a planet is while you are crying inside and remembering your reading of Dickens' Hard Times. Your grade is based on a shitload of points, actually around a thousand possible points. Like other classes, Pepa allows extra credit to assume 5 percent of your grade. Unlike other classes, five of the suggested projects from other classes are needed to get these points. He will remind you with a smile and wave of his man-ponytail, that grading is arbitrary, fuzzy, nothing can be known. But we will talk about it in great detail. for two fucking hours. Kind of like frontiers of science.\nBy the way, Pepa is not this man's real name. He asks you to call him by it, it sounds like Papa. He says, \"my name is Josef Lazar but I would like you to call me Pepa. Like Salt-\nn-pepa\" (Silence from the class).\nWorkload:\ndiscussion question posted by midnight of the lecture day, every week. vaguely worded problem set every week. five extra credit projects if you want, he may give you 5 points. it'll help, except your grade is out of a THOUSAND points. midterm, final, which are completely different from the content of his class. because who reallly could test you on this??? SWITCH OUT, CLAIM YOU HAVE PRE-MED , ATHLETIC DEPARTMENT CONFLICTS, ANYTHING! IF YOU CAN'T GET OUT OF HIS SECTION, I RECOMMEND APPLYING TO POSTPONE FRONTIERS TILL SOPH YEAR, EVEN IF YOU HATE SCIENCE AND IT MEANS TAKING THREE OTHER MATH/SCI CLASSES THIS SEMESTER!\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 22, 2006",
            "review_content": "\nPepa was a very very poor teacher.  He often would look at slides presented in Frontiers lecture and declare them too difficult to explain.  He was unresponsive to students and often giggled when students expressed frustration with the class.  He did not explain how to do ANY of the work, and was not capable of communicating well with the class.  In many classes when he ran out of Frontiers material to cover he diverged into topics that were not helpful to Frontiers at all (he told us they were not) instead of simply letting us leave class early.  When students complained about class and asked for small changes, he refused to change anything with consent from higher-ups at staff meetings--and then told us he didn't think the changes we wanted were worth even asking about.  RUN AWAY FROM PEPA.  Frontiers discussion section was absolute hell.\nWorkload:\nWeekly assignments that he chooses (he prefers math-based questions when the departmental tests are all concept-based), a departmental midterm and final that he does not prepare you for\n"
        }
    ]
}