{
    "prof_info": [
        {
            "prof_name": "Robert McCaughey",
            "prof_id": 728,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "The Beautiful Sea",
            "review_date": "December 08, 2016",
            "review_content": "\nRobert McCaughey seems like a very interesting professor, but unfortunately that does not come through in his class. For every major text that we speed through, you have to write an essay and a critique in which he obsesses over your essay title. I found all of our texts really interesting (a word that he insists you do not use) and the essays that were written was thought-provoking and a perfect set-up to an engaging class discussions. But to my disappointment, he would stifle discussion when we got to class. I am sure that he would be a great history professor, but in my experience as a seminar professor, he is very dry. My class was full of passionate, avid readers but every class was very quiet after the first few classes.\nWorkload:\nWriting an essay on every major text, which is about every other week, although they are only 10 points. Additionally critiquing someone in your class's essay, which is worth 5 points.\n"
        },
        {
            "course_name": "Early American Maritime Culture",
            "review_date": "November 11, 2012",
            "review_content": "\nThese reviews are incredibly untruthful. My class is full of American Studies majors who had read the fabulous reviews here and were EXTREMELY DISAPPOINTED. The \"Captain,\" while a nice guy, is a dull lecturer and is unclear when communicating important vs. superfluous information. The exams are based on information that is not covered in class nor on the readings, and they take many days to prepare for. He grades fairly, but be warned that you will have panic attacks every time he hands out a study guide.\nWorkload:\nFair, but unorganized.\n2 mid-terms, 1 final, and 3 group presentations. \nRidiculous amounts of information covered on exams, but he grades them on a curve. \n"
        },
        {
            "course_name": "The Beautiful Sea",
            "review_date": "December 14, 2010",
            "review_content": "\nThis class is an overload. In total I think we wrote 11-12 papers this semester. Half of which are 3-4 pages and on the content of a section of the book we're covering. The other half are 2 pages long and are critiques of the aforementioned papers. We went through books like the Odyssey in three 1 hr 15 min classes. The material you cover is very superficial and I found myself not even caring about the quality of my essays since he grades all papers pretty much 87%-93%. \nWorkload:\nRead about 100-120 pages of a book for each class. Write a 3-4 page paper and a 2 page critique once every 2 weekish. But no final.\n"
        },
        {
            "course_name": "The Beautiful Sea",
            "review_date": "December 18, 2008",
            "review_content": "\nThis year we read The Odyssey, The Tempest, The Interesting Narrative of Olaudah Equiano, Sailing Alone Across the World, Diving into the Wreck, At the Fish Houses, The Country of Pointed Firs, and Moby Dick.  Professor McCaughey is jovial and can crack surprisingly good jokes.  His grading is generous; I doubt that anyone in my class is getting lower than a B this semester.  Most classes are spent by looking at the papers that people in the class wrote and then gradually leading into a class discussion about something.  There's a strong focus on the mechanics of writing.  Don't use the word \"however\" in your papers...ever.  Professor McCaughey lets his students get creative with writing; it's acceptable to write a paper in poem form as long as you don't do it all the time.  Overall, I would recommend this class. \nWorkload:\n6 papers (3-4 pages), 6 peer critiques (1 page), 1 self-critique (1 page).  NO FINAL!!! :)\n"
        },
        {
            "course_name": "The Beautiful Sea",
            "review_date": "January 23, 2007",
            "review_content": "\nwhile professor McCaughey really knows what he's talking about history-wise, this seminar is not worth it. Take his maritime history class sometime. \nWorkload:\nseveral papers and too many books written by New england males who try and prove themselves on the ocean. \n"
        },
        {
            "course_name": "Early American Maritime Culture",
            "review_date": "December 11, 2006",
            "review_content": "\nMcCaughey is the best -- intelligent, funny, and very dedicated to making the seminar a success.  Not only did he arrange for Barnard to pay for us to go yachting on the Hudson, but he really made an effort to explain grading and have individual projects rather than all group projects.  Be polite [don't fool around on your computer all class long], participate in seminar discussion, and in turn he will be good to you.  I seriously wish this man was my dad/grandfather!\nWorkload:\n3 individual websites, 3 group websites, 1 book review\n"
        },
        {
            "course_name": "Maritime History: 1950 to present",
            "review_date": "August 09, 2006",
            "review_content": "\nVery entertaining!  Students and McCaughey are not shy to share stories, laugh, and have a good time :)  Relaxed environment but you must be willing to work in groups.  Two of the three projects are group websites where every member gets the same grade... I was fine because my group was good but I can't even imagine if my group members were slackers!  He assigns the groups the first day of class so it's kind of hit or miss. \nWorkload:\n3 websites (two with your group, one individual).  Be sure to complete the website on time otherwise your grade goes down.\n"
        },
        {
            "course_name": "American Civilization Since the Civil War",
            "review_date": "February 22, 2006",
            "review_content": "\nA great professor (and one who puts his lecture notes on courseworks) and a fantastic lecturer, Professor McCaughey makes a survey history course a fun (and often funny) and engaging class. I would take him again for sure (even if he does talk about boats a lot).\nWorkload:\nReasonable. Don't have to really read the books, just get the main points. Memorize the lecture notes for the IDs though because his were by far the trickiest. But he made up for it by not being a harsh grader.\n"
        },
        {
            "course_name": "American Civilization to the Civil War",
            "review_date": "January 18, 2006",
            "review_content": "\nWhile this period in history is interesting Professor McCaughey chose to discuss what was interesting to him when he strayed from the main historical events (i.e. various forms of sailboats, the character of various presidents' wives, the evolution of Columbia University, etc.) His lectures were fairly interesting, but the workload for this class was ridiculous when you take into consideration that it is an introductory course. He posted all of his lecture notes online so if you missed class you could get them. The syllabus had no deadlines for the massive amount of reading; it just stipulated that a certain amount should be completed by each test. The tests were difficult with identifications, that the McCaughey himself said were intended to \"trick the student\", a section where a quote was given from a primary document and you were asked to identify who wrote, its title, and its date, as well as essays. The required discussion sections with TA's were somewhat trivial and didn't further my knowledge in the class. My TA made you post questions and responses each week we had section for the various supplemental novels we were required to read. If you want the workload of an upper level history course then take McCaughey. Overall his likeable and interesting personality doesnÂ’t outweigh the demand of the class.\nWorkload:\nToo much for an introductory class. The class is split into three sections and the required books and documents for EACH section are as follows: one main text book used throughout the entire course, 2-3 biographies/historical books on the particular period, an average of 10 primary documents found online for each section (i.e. Declaration of Independence, The U.S. Constitution, excerpts from Uncle TomÂ’s Cabin, etc). You can get by without reading the entire main book, but reading the lecture notes, supplemental books, and primary documents are recommended. \n"
        },
        {
            "course_name": "American Civilization to the Civil War",
            "review_date": "January 07, 2006",
            "review_content": "\nYou technically don't need to attend his lectures because he posts his outlines and powerpoints online, but his sense of humor and enthusiasm make lectures worth attending anyway. People rarely ask questions in his lectures, but when they do he's willing to answer and thoroughly knowledgeable. Discussion sections are run by TAs, but he leads one as well, so if you get a chance sign up for his because he leads fabulous sections as well. \nWorkload:\n2 Midterms, 1 paper (length depends on your TA), and a final (the final isn't cumulative). The reading is the expected workload for a history course, but you can avoid the \"supplementary readings\" (which are actually 6 novels) by skimming or using jstor.org\n"
        },
        {
            "course_name": "American Civilization to the Civil War",
            "review_date": "December 15, 2005",
            "review_content": "\nI enjoyed Professor McCaughey's class.  He certainly knows what he's talking about; I came away from just about every lecture having learned something new.  His lectures sometimes wandered a bit, but not so much as to be an annoyance.  His tests do sometimes ask for minor details, but if you read the books and the online documents he posts the tests should be no problem.  I would highly recommend this class to anyone interested in taking an introductory history course.\nWorkload:\nNot bad--a fair amount of reading, 2 midterms, a paper and a final.  One word of warning: this class also has a 1-hour bi-weekly discussion section in which you talk about one of the six books in the assigned reading.  This discussion section does not show up on any of the course descriptions so be prepared to reserve an hour outside of the normal lecture time if you want to take this class.\n"
        },
        {
            "course_name": "American Civilization to the Civil War",
            "review_date": "November 09, 2005",
            "review_content": "\nMcCauphey is a good lecturer with lots of knowledge of the course material.  He enjoys being the smartest person in the room and also flaunts it.  His tests (2 tests and a cummulative final) consist of ID's, document IDs and a long essay.  He gives a choice for the essays but does not grade them the same.  IF you answer the \"easier\" of the two, he will assume you're taking the easy way out.  He is a picky grader and expects lots of time to be spent on preparing for his class.  He assigns two books per \"period\" (3 periods in a semester which line up with the 3 tests) but not all books are relevent.  Some will appear on the tests, others you will just read because he presents them as \"very important.\"  Loves to pick small, trifling events/people for test ID's.  \nWorkload:\n2 tests, 1 paper, final.\n"
        },
        {
            "course_name": "Maritime History Since the Civil War",
            "review_date": "August 07, 2005",
            "review_content": "\nProf. McCaughey has a very loose lecture style, which can be disconcerting for people who like a systematic approach to the material.  Class time in this seminar consists largely of presentations by individuals, watches (to get in the maritime spirit, the class is divided into three watches, groups that work together on projects for the duration of the semester), or guests.  Each watch makes three presentations and each person in the class makes an individual presentation.  Prof. McCaughey likes to make use of technology, so it's strongly recommended that the presentations be in website format.  This can be daunting, but it doesn't require anything you can't do with Microsoft FrontPage.  Typically, a watch or individual makes a presentation at the beginning of class, and we spend most of the rest of the class critiquing it.\nProf. McCaughey occassionally prepared talks on various aspects of maritime history and terminology.  The class wasn't very strong on the \"history\" part of its title.  A general grasp of American history helps but isn't a prerequisite.  \nParticipation is critical if you want a good grade in the class.  That means raising your hand frequently, and Prof. McCaughey will call on you if you don't.  Say something maybe once every ten minutes.  Take initiative in your watch as well, because the watch leaders (first mates) will report back to Prof. McCaughey on who is being helpful.  Go early in the individual presentations, and make all of your presentations strong.  Prof. McCaughey likes presentations to have \"an argument.\" They don't have to be absolutely groundbreaking, but give them a lot of depth and don't make a book report.  If you participate well, do well in your watch, and make good presentations, you'll get a good grade.  Make sure to do the quizzes that Prof. \nMcCaughey posts on CourseWorks right when he puts them up.  They don't affect your grade, but he doesn't like it when you don't do them.  Also, post your book/\nmovie reviews in a timely fashion, and put a modicum of thought into them.\nOne last point: the only grade you get in this class is the one that shows up on your transcript.  It can be worrisome when, as of the last day of class, you have no idea what your grade is going to be.  Prof. McCaughey is fairly generous though, so if you do what I've told you, you'll likely get an A.\nWorkload:\nFour presentations, very preferably in website format.  Three are done with your watch and one is by yourself.  Topics are things like the navy's next generation of ships or the history and development of container ships.  You must also post two written reviews of maritime books and/or movies.  There is occassional reading for class and just-for-fun quizzes on CourseWorks.  Not bad at all, especially for a four-\npoint seminar.\n"
        },
        {
            "course_name": "Early American Maritime Culture",
            "review_date": "December 31, 2004",
            "review_content": "\nAMAZING! Everyone should take this class. Professor McCaughey is terrific and the subject material is fascinating. The workload is spread out in a feast or famine type format, but you get to choose (within reason) when things are do, so it is incredibly manageable. This class, more than any other, takes advantage of technological mediums for nontraditional presentations of information. It is also lots of fun. The class is divided into three watches with three first mates, lots of teamwork and interesting readings and projects. It even made Moby Dick enjoyable!  However, it should not be taken by lit majors, as they will be frustrated by the lack of analysis of the works./\nWorkload:\nModerate,  a few  projects with the watch which are only a couple hours each and three presentations which take some work but are interesting and open-ended.\n"
        },
        {
            "course_name": "A Social History of Columbia University",
            "review_date": "December 22, 2004",
            "review_content": "\nI only have really good things to say about this class. Prof. McCaughey is an extremely engaging professor. He is well versed, well prepared, and quite funny. While the info can at times be a little dry - which in my opinion it was with Columbia's early history, by the end of the semester, you don't want to put down McCaughey's book, Stand Columbia. This is a class for people just a little curious about the place they're going to be spending 4 years, people wanting to fulfil a history requirement as painlessly as possible, as well as hardcore history majors (and there were quite a few in the class). Just a warning, there wasn't quite enough about Barnard to satisfy me - although that is my opinion as a Barnard student who wanted to hear more about the school she goes to. But at the same time, Barnard did get more attention than other affilite institutions, so i suppose I'll just have to take what I can get.  :)\nWorkload:\nnot at all heavy. you don't have to do the readings if you go to class and take good notes. Yea, the short answer portion of the test require you to list precise facts, but you know before hand. thats said, i completely bombed the short answers on the first two, and i pulled off Bs. Two presentations, easy to do, fair to the point of ridiculously lenient graded. \n"
        },
        {
            "course_name": "A Social History of Columbia University",
            "review_date": "November 16, 2004",
            "review_content": "\nHe is an outstanding lecturer. True, you read his book, but he fills in all of the gaps. Even if you don't like Columbia, his stories and dynamic teaching style will be a draw for anyone.\nWorkload:\nThree 1-hour midterms (25% each), 2 websites (10% each) class participation (5%).  He likes the websites, so do them as early as you can. The midterms can be hard. Moderate Reading\n"
        },
        {
            "course_name": "Early American Maritime Culture",
            "review_date": "December 01, 2003",
            "review_content": "\nI really enjoyed this class. It was one of the best courses I've taken at Columbia. On the first day you realize that this class is not a normal Columbia seminar. The class is broken up into two watches, and each student is given a rank--depending on his or her maritime knowledge and experience. Prof. McCaughey becomes the Captain. Unlike the authoritarian captains of our past Bob is extremely friendly offering a great sense of humor, his extensive knowledge, and the best Socratic management style(more listening than talking) I've seen at this school.  Early on work is done within watches. As the class deals with learning unfamiliar material--such as sailing equipment, methods and how to navigate before GPS, the team structure is very helpful. After watch projects everyone begins to make websites on topics that touch on what is learned in class. This process is pretty easy, I never had made a website before(I'm not very good with computers at all) but I managed to learn how to quickly, and am coming out of a history course with a powerful new skill. After the first site everyone is given the option of working solo, in pairs or teams to make the next two. Overall this class was great, I learned a lot of new material, in a refreshing new way. Classes are fun, and much more casual than any other course I've taken. Work is not very bad, you really have the option of putting as much time as you want into the course. I highly recommend taking this course\nWorkload:\nThree websites, read two books: Two Years Before the Mast, and Moby Dick\n"
        },
        {
            "course_name": "A Social History of Columbia University",
            "review_date": "March 10, 2003",
            "review_content": "\nProfessor McCaughey is an extremely prepared, engaging and charismatic lecturer.  Obviously well versed in this topic (his book on CU's history will be coming out in Fall 2004), he inserts anecdotes and witty coments throughout his lectures.  I've only taken one exam, but it was pretty killer and pretty unfair because of the specificity of the questions.  How much does one really learn by memorizing lists upon lists of dates?  His readings are pretty much recaps of his lectures and his near obsession with using the internet as an educational resource translates into a requirement of two website projects.  You are free to do it on any topic that you like within a certain time period and they are actually pretty interesting and more fun to do than writing a paper.  He also puts up lecture notes online, which I've heard are useful, but I've never looked them over myself.  Overall a pretty good class, besides the exams but that's where P/D/F-ing comes in.     \nWorkload:\nReadings that are fairly interesting and easy reads, two web projects, and two exams.  He also expects students to be active on the web discussion board on CourseWorks.\n"
        },
        {
            "course_name": "A Social History of Columbia University",
            "review_date": "May 05, 2002",
            "review_content": "\nThis class begins with the founding of King's College in 1754 and ends with the Columbia we know and (usually) love today. (Don't worry, Barnard students, there's plenty of discussion about BC.) Some of the material is quite interesting, but it's still a history course, complete with tons of reading (much of it written in flowery, archaic English) and timelines. Fortunately, Professor McCaughey is an enthusiastic, eloquent, and entertaining lecturer who makes some of the dull material more engaging. He also gives you the freedom to explore the Columbia-related topics that interest you most, which was what made the course worthwhile for me. All in all, this is a good class -- just don't expect to hear about the most fascinating aspects of our school's history (the revolts of '68, etc.) all the time. \nWorkload:\nUmmm ... weird. The tests are extremely difficult and essentially unfair -- they ask for tiny specific details that you might have read about once in the five billion pages assigned to you. Fortunately, there is an enormous curve, (my 77 was a B+) but why not just make the questions more general, so our original scores don't suck? You also have to complete a couple of web projects on topics of your choice, which are a lot of fun, and it's interesting to read everybody else's work as well.\n"
        },
        {
            "course_name": "Survey of American Civilization since the Civil War",
            "review_date": "November 07, 2001",
            "review_content": "\nProf. McCaughey is an excellent teacher. He grades his papers rather easily and his tests are not too hard. He is very knowledgeable of the material and has a class website and CUBoard that will answer any question a student may have. He also provides an outline of his lectures on his website so you don't have to go to class. But I would highly recommend attending if you have an intrest in History b/c his lectures are excellent.\nWorkload:\n3 short papers on novels of the time period the class is covering at the time (each time you get a choice of about 20 titles to choose from); two tests (not cummulative), and a final, which is cummulative\n"
        }
    ]
}