{
    "prof_info": [
        {
            "prof_name": "David Sidorsky",
            "prof_id": 856,
            "total_reviews": 33
        }
    ],
    "reviews": [
        {
            "course_name": "Social and Political Philosophy",
            "review_date": "January 06, 2013",
            "review_content": "\nOne weekend afternoon, Professor Sidorsky sits two feet away from me at Tom's counter.  He has to know that I'm a student of his, right?  No one else is at the counter.  People say he's afflicted with terrible eyesight but I did raise my hand once or twice in class.  Even if he doesn't remember anything else about me, I'm still wearing the same stupid jacket that I always wear in the third row.  \nHe orders the exact same thing I'm eating.\nWhat the hell is he getting at? Is he getting at something?\nWe sit together in silence.  I keep glancing over, hoping to make eye contact.  He smiles at the waiter but never looks in my direction.\nCan I tap him on the shoulder?  I'm afraid he'll break.  Sidorsky takes 30 minutes to hobble across College Walk.  They say he used to be a famously liberal scholar but I worry that he doesn't want to talk to a lowly non-philosophy undergrad on his time off. And don't old people want to wait before being spoken to?  I don't know.  I don't know.  One time I told him that he was miscategorizing anarchism and he didn't end the conversation but didn't really respond to me either.  I take out my cellphone and pretend to look busy.  I don't want to go through that again.  He wrote a funny comment on my midterm and called one response \"interesting.\"  It was my favorite course of the semester so far and it could only go down from there.\nWorkload:\nThere are six topics covered over the semester (authority, rights, equality, liberty, justice, democracy). All you have to do is purchase one $30 coursebook.  The lectures and readings complement each other nicely. Sidorsky takes attendance, although no one knows if this means anything.  Each class topic has 2-5 readings, none of which were book-length.  Relatively easy...I kept up with the readings for the first half of the class and did all of the second semester readings during reading week (not recommended).\nNo other homework, only an in-class midterm and final.  Even the philosophy majors were knocked on their asses by the tests.  Half of the class didn't finish within time limits, and the questions are interesting but difficult to study for (asking for your opinion on a subject instead of a summary). \nI got a B+ on both tests even though I have little prior knowledge of philosophy.  Grades ranged from B- to A.  Sidorsky isn't as harsh with grades as you'd think an older professor would be, and he bumped everyone up by a couple points as well.\n"
        },
        {
            "course_name": "Social and Political Philosophy",
            "review_date": "September 04, 2012",
            "review_content": "\nIt wasn't until I began studying for the midterm exam that I realized how much I liked this class. That sounds like a really strange backwards compliment, but hear me out. Yes, Sidorsky is very old, yes, he can barely see, and yes he tends to move through the material rather slowly. As a result, some people gchat throughout class, some fall asleep, and some just don't bother showing up. But despite his slow pace, or perhaps because of it, Sidorsky presents concepts clearly and extremely organized. It's clear that he has been teaching this forever, and it pays off. Reviewing my notes, I realized how much I had learned, and I loved how organized and clear my notes were- a direct result of Sidorsky's lecturing style.\nIf you are interested in political philosophy, I would recommend this class to you. But if you prefer fast-paced, discussion-based classes, you probably won't love this prof. \nWorkload:\nSidorsky let the class choose between either a midterm/final or a paper. My class chose the tests. \n"
        },
        {
            "course_name": "Varieties of Liberalism",
            "review_date": "January 12, 2011",
            "review_content": "\nEven though the class goes by pretty slowly since he talks pretty slowly, his lectures are surprisingly very organized and, with the exception of a three-session-long rambling digression into US foreign policy in the 70s, every lecture was very interesting.  However, Sidorsky is pretty old; he couldn't see people's hands raised for questions, so after a month or two most of us gave up trying to ask questions entirely. \nAlso, there is pretty much no interaction with him at all aside from his lecture. Though he kept repeating  to himself almost every week that he should involve us in a discussion more often, he never did anything but lecture the whole time.  To me, this was a virtue of the class.  Instead of hearing my peers who have been in three philosophy classes, I got to just sit and listen to someone who has been studying philosophy for 60 years.\nGrades were based only on the midterm and final, which, contrary to his claims of them \"probably being easier than than they should be\", were actually disproportionately difficult, though not unreasonably so.\nWorkload:\nVERY short, dense weekly readings (2-20 pages)\nChallenging Midterm\nLong, difficult Final\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "May 04, 2009",
            "review_content": "\nHe sure is a sweet old guy, and it is clear that he knows a lot, but this class is almost painful at times, depending on the day and depending on your mood. Sure, it's easy, and, sure, the readings are interesting, but it's almost impossible to not go to sleep some days; he goes off on tangents constantly and covers very little in each class (which can be a nice change from classes with thousands of pages of reading). Sometimes, I like this class, when what we're discussing is especially interesting or when students contribute their comments; other times, I find it to be a waste of time.\nWorkload:\nvery little reading, midterm and final worth 50% each, attendance taken every class, but I'm not sure it counts for anything \n"
        },
        {
            "course_name": "20th Century Philosophy",
            "review_date": "January 07, 2009",
            "review_content": "\nTaking a class with David Sidorsky is absolutely worthwhile. He is one of my favorite professors at Columbia and definitely one of the most interesting and knowledgeable. Yes, I admit, he may be very old, loves going on tangents, and sometimes strays from the syllabus. Some students might be bothered by this lack of structure in his teaching style, I think it is one of the best things about him! He has so many stories and experiences, and does not hesitate to spend large amounts of class time enlightening us with some real world philosophical anecdotes. I seriously looked forward to his classes and just sitting back and relaxing.  In addition, he reviews material a pretty slow pace, and usually covers important points multiple points...it is nearly impossible not to get the main points if you just go to lecture alone and do not read anything at all. There are required readings, but they are hardly necessary for earning an A. Seriously...if you are interested in philosophy at all, take his classes!\nWorkload:\nVery very light. Midterm, final, and perhaps a short reactionary paper or two that literally counts for nothing. Beware, however, that his tests require a LOT of writing. \n"
        },
        {
            "course_name": "20th Century Philosophy",
            "review_date": "April 19, 2008",
            "review_content": "\nSidorsky is the cutest old man ever! :) Just take your laptop and write down everything he says and memorize it. There is no need whatsoever to do the readings in order to have an A in the class. (In fact, the readings might confuse you and you'll do worse.) Also, on the first day he says that you have to have taken a philosophy class in the past or else this will be too hard. I almost switched out because he seemed really serious about it. Rubbish! No need to worry! \nWorkload:\nIt can literally be nothing if you want it to be up to the midterm and final when you study your notes. Oh yeah and we had to do a 2-page reflection on something. But it didn't count for a grade. I think some people turned it in a month late. \n"
        },
        {
            "course_name": "Social and Political Philosophy",
            "review_date": "April 09, 2008",
            "review_content": "\nI loved this class, especially because I took it alongside CC. I would frequently use the information on the philosophers in this class that overlapped and sound extremely insightful in CC discussion. I did absolutely no work in the class. I just came to class, listened, and took notes. At the same time, the midterm and finals were absolutely beastly. I couldn't finish either one on time and I wrote more on them than I've ever written in my life. I also don't think it was an easy A at all. I really did buckle down to study for the tests, and I couldn't manage to get any higher than a B+. The thing is, I really don't think going over the readings would have helped at all.\nWorkload:\nNot much reading and not necessary at all. Really long, arduous midterm and final. An ungraded paper. By no means an easy A.\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "February 01, 2006",
            "review_content": "\nDavid Sidorsky is a very nice man, and an extremely educated.  He also teaches class at the absolutely slowest pace imagineable.  You think I'm joking.  We had reading assignments of ONE PARAGRAPH sometimes.  I'm not joking.  A typical reading assignment would be two pages out of the only textbook required for the class.  In a way I applaud him for not overreaching the scope of a semester long college course (although that would be a bit of an understatement), because I do feel like most teachers try to cram in way too much reading and no one absorbs anything.  However, it was simple too slow.  We covered the major moral philosophies, but I feel like I could've learned about as much from 2-3 hours of reading on Wikipedia.  Sidorsky was nice and sometimes told some great stories, but I only heard them when I could stay away.  Students' heads were dropping like flies.  I'd be whipsering to my friend for a minute trying to pass the time and then I'd realize that he'd nodded off.  The class is pretty easy.  He doesn't like to give below a B, and he gives plenty of A's and A-'s.  But, you aren't going to learn that much, and it's really, really slow.  If you think it's worth it to sacrifice your education to make a good grade and hear the occasionally interesting ramblings of a very very knowledgeable man, then take it.  However, if I could time travel back to myself and advice myself on course selection, I would steer myself away from this one.\nWorkload:\nAlmost no reading, no papers.  Midterm and final, both essay based with general, easy questions.\n"
        },
        {
            "course_name": "20th Century Philosophy",
            "review_date": "January 21, 2006",
            "review_content": "\nWhile it is true that Professor Sidorsky is clearly brilliant and knows his stuff, it seemed to me that he is past the age that he should be teaching.  He often repeated entire lectures and was very scattered in his presentation.  The course content was interesting but the presentation was pretty bad.  Professor Sidorsky is a very nice, old, smart, super-educated professor.  If you're looking for an engaging professor, look else where.  If you're looking to be exposed to brilliance past its prime and wish to get an A without too much work, then take Sidorsky.   \nWorkload:\nReadings for every class that are by no means necessary for success in the class.  Midterm and Final. \n"
        },
        {
            "course_name": "20th Century Philosophy",
            "review_date": "January 06, 2005",
            "review_content": "\nProfessor Sidorsky knows his stuff.  At first he seems a bit scattered, but you then learn that his lectures are actually organized, coherent, and he is actually quite brilliant.  The lectures can be quite dry at times, but  never unbearable.  If you listen and take good notes, the time goes by much faster.  And, by taking good notes, you will be guaranteed to find the midterm and final very easy.  It is very possible to get an A in the class by attending lecture and never doing a single reading...not that there is much reading in the first place.  Overall, Professor Sidorsky is very interesting and very kind.  His class is great for philosophy majors, those who are interested in philosophy, or for those who simply want an easy class that they can learn some valuable information in.\nWorkload:\nCourse pack that is probably $30 and contains all the readings you will need.  You could get by without doing any reading, or at least get away with saving it all until the very last minute considering the readings are all short.  Midterm and Final that are long long long.  You will probably find that you don't even have enough time to finish them in the allotted time.  However, Professor Sidorsky is an extremely leniant grader.  He admits that himself, quite frequently.\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "January 03, 2005",
            "review_content": "\nSeriously, just dont take it.  Its  boring and the guy needs a break.  Sure, he's a \"sweet man\" with lots of experience but is that what you're paying for?  Also, its not always an easy class: it depends on your TA  and your willingness to repeat the profs. personal opinions from class (which differ significantly from the book).  Not worth it.\nWorkload:\nlight.  Reading is dense but average. \n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "December 22, 2004",
            "review_content": "\nIn my opinion, this guy REALLY should not be teaching anymore. I assume that at some point a few decades ago he was competent, but it's time for him to be put out to pasture. The ONLY reason to take him is for an easy 'A' - I couldn't imagine an easier class (the questions on the tests are unconventional, and the tests are waaaay to long, but if you have half a brain cell you should be able to bullsh*t your way through). I suppose another reason to take him would be if you enjoy listening to anecdotes and stories and if you want to impress your friends and family by knowing random historical trivia.\nNot only does he not cover much material, he screws up the material he does cover (I've never accused another prof. of doing this, so don't think I'm some thinks-he-knows-it-all undergrad. This guy holds the unique position of being the ONLY professor I do not respect intellectually. He seems to have just lost whatever intellectual ability he had - and I don't doubt that he used to have plenty). \nOh, his stories may seem spontaneous but, having taken 20th Century Philosphy with him I can tell you that he tells the same damned stories in both classes (How can you trust the review of an idiot who didn't learn from his mistake and took two of this guy's classes? I admit that was really dumb. I needed an easy class on my schedule this semester and it doesn't get any easier than Sidorsky. Also, 20th Century was marginally better. If I had it to do over again, I may have still taken 20th Century, actually). \nWorkload:\nAbsolute joke. It does not get any easier. Seriously.\nThe ONLY people who may have trouble with this class are those who cannot write fast enough to get through his tests (either those who have to think an answer through before they start writing or those physically incapable of moving their pens quickly enough). Acttually, another class of people who may have trouble are those who are stymied by unconventional questions. \nIf you can bullsh*t on the fly and have a strong and limber wrist, you've hit the \"easy A\" jackpot. \n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "May 20, 2004",
            "review_content": "\nWARNING: The reviews below largely ignore the fact that Sidorsky is probably not a good teacher for someone who has a serious interest in philosophy.  In Moral Philosophy we covered a grand total of 7 papers (in the form of interpreted excerpts from the textbook), which were each boiled down to about 4 or so very basic points.  Furthermore, the only meta-ethical paradigm covered was naturalism (how do you teach an moral philosophy class without even mentioning consequentialism?).  Sidorsky barely touched on problems with the Authors' systems -- if you like to read philosophy critically, it will be largely impossible for you to stay focused on the lectures for more than 20 minutes.  Moral Philosophy V3701, as far as the lectures are concerned, was largely a philosophy-qua-literature class in which memorization of the absolute basics of the authorsÂ’ ideas was the primary focus instead of using the ideas as a vehicle for coming to a deeper understanding of morality.  The upside is I guess that youÂ’ll be able to say a few sentences about the historical context of these authors and their most basic points if their names ever come up at the dinner table.   Oddly, however, the excessively long exams ask you to evaluate the authorsÂ’ ideas over and over and over again until you canÂ’t feel your fingers gripping your pen.  Overall, itÂ’s a cinch to get a B, but pretty tough to get an A as its difficult to know what heÂ’s looking for.  In conclusion: this class is not for philosophy majors.   I repeat: this class is not for philosophy majors.  Did I mention that itÂ’s not for philosophy majors?  Annoyed?  Just wanted to point out that itÂ’s not for people who canÂ’t stand repetition (and not really learning much for your tuition).  \nWorkload:\nExtremely light:  7 readings, average ~10 pages each.  Reading was unnecessary as they were boiled down to 4 or so basic points over a series of 6 or so classes.  If you get someone to sign in for you and let you xerox notes, attendance is not necessary either.  Dreadful midterm and final that, while easy, were way too long and posed the same questions multiple times.  \n"
        },
        {
            "course_name": "20th Century Philosophy",
            "review_date": "April 04, 2004",
            "review_content": "\nSidorsky's lectures are a pleasure to hear. He is old, and sometimes he speaks slowly, but he has a profound understanding of the texts and is good at explaining them using his own examples. Furthermore, he has an encyclopedic knowledge of literature, and he weaves references to art, culture, and science into his lectures, thereby connecting the class material to other disciplines. Besides being informative, it is fun to watch his intellectual acrobatics: in one class he quoted the beginning of the Canterbury Tales in Middle Enlgish, a passage from Isaiah in biblical Hebrew, and listed a dozen Roman emperors in chronological order with their corresponding prime numbers (hmm, this sounds a bit crazy, but there was a point to it all). I gather from CULPA that Sidorsky has a reputation for repeating himself, but don't worry, this is not unselfconscious repetion. He goes over important points from the previous lecture at the beginning of most classes--something I found quite helpful. So take a class with Sidorsky while you still can. He truly loves learning, and it makes his class an experience you will be glad to have had.\nWorkload:\nNot much reading. An ungraded 2 page response paper. Midterm and final. If you go to class the tests are pretty easy.\n"
        },
        {
            "course_name": "Social and Political Philosophy",
            "review_date": "January 11, 2004",
            "review_content": "\nAll the reviews you've heard about Sidorsky ring true.  He is old, can't see worth a damn and tends to repeat himself to the point where you want to shoot yourself-- that is if you are even awake to hear what the lectures.  With that said, it's probably a blessing he's so repetitive.  Given that you attend class, you are to sure to retain some of the main points he expounds upon.  He covers six concepts in total and said concepts will be ingrained in your head for good.  An easy A if you have the willpower to attend most of the lectures (see, you don't even have to attend all).  I do like him quite a bit as a professor.  He knows his material and if you read his articles, you'll find that he's extremely intelligent and articulate.  He also makes subtle jokes that are quite hilarious-- once again, you must be awake to hear and take note of said jokes.  \nWorkload:\nMidterm and Final.  Listen to him and rewrite them on the exams.  You'll do fine.\n"
        },
        {
            "course_name": "20th Century Philosophy",
            "review_date": "November 15, 2003",
            "review_content": "\nThe class seemed like it could be interesting and while the subject wasn't too bad, the workload was miserable. You cannot miss a class, nor can you skip any of the tons of reading and worst of all, hes a terribly difficult grader.\nWorkload:\nHARD\n"
        },
        {
            "course_name": "20th Century Philosophy",
            "review_date": "August 23, 2003",
            "review_content": "\nI agree with almost everything that has been said already here: The man is brilliant, he has an exceptional memory, he will repeat himself, his eyesight is terrible (I'm sure he's legally blind) and he is very very boring.\nThe eyesight didn't seem like it would be a problem until you see how he writes on the blackboard.  If you're like me, and generally lose track of things once in a while and need to refer to the board to get caught up you're in trouble.  Almost all of it is unintelligible.  It is chicken scratch.\nHis memory can be great because he can talk about anything, and his memory can be terrible, because he can talk about anything.  After spending 30 mins on a subject completely off topic he will return to almost exactly where he left off in the discussion.  I personally found it rather hard to follow though I am sure some people would be fine with it.\nThere was a lot of quite difficult reading in the class, and because of lectures being rather boring and the chicken scratch on the board, it was essential.  \nI personally regret taking this course though I can understand how others would disagree.\nWorkload:\nDense, though not terribly long, weekly readings.  Mid-term and final.\n"
        },
        {
            "course_name": "Operating Systems I",
            "review_date": "May 22, 2003",
            "review_content": "\nFirst and last impression of Sidorsky: the man is exceptionally brilliant and very well read. It is not often that your professor has the ability to lecture and provide the insight that can only be provided given that they were present during the time frame of what they were teaching. His lectures got repetitive as he took a long time to get through material bc he was constantly reviewing and rehashing. His eyesight is less than stellar as he will ask for questions and miss the raised hand that is in the front row. He definately knows his material well and delivers it well. as the last reviewer stated, show up to class, some part of the grade is attendance and exams are entirely lecture note based.\nWorkload:\n1 midterm, 1 final. lenient grader, everyone basically makes a B or higher.\n"
        },
        {
            "course_name": "20th Century Philosophy",
            "review_date": "May 07, 2003",
            "review_content": "\nThis guy is a living legend.  Columbia should interview him to get his oral history of the whole place.  He's a great professor who knows everything about everything, period.  His lectures are well-organized and easy to understand.  His weakness is a tendency to repeat himself, sometimes repeating whole lectures to drive home a point.  He always answers questions in a lengthy format.  He's aware of this tendency and makes fun of himself but still does it.  I still recommend him, just be patient.\nWorkload:\nWeekly readings, midterm, and final.  Readings were on the short side.\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "April 26, 2003",
            "review_content": "\nwell, you already know...Sidorsky is OLD...he has a watch that talks to him so that he can tell time; he writes chicken scratch on the board that he randomly points to during class, and he REPEATS, REPEATS, REPEATS to the point where sometimes you feel like shooting yourseld. Nonetheless, at the end of the class, you come away with a REAL understanding of what these philosophers said...something I can't say about CC. Take the class if the subject mattter interets you; feel free to skip a few classes (But not too many) and you'll be fine.\nWorkload:\n2 one pages response papers (not graded, absolute cake) midterm, final (i think the class voted on this, but it's pretty much what sidorsky promotes unless someone comes up with another method). Midterm and final are EXTREMELY time-pressured, but grading's not too bad.\n"
        },
        {
            "course_name": "20th Century Philosophy",
            "review_date": "March 05, 2003",
            "review_content": "\nAbandon all hope!\nI have never been more uninspired by a professor in my three years at Columbia.  Yes, Sidorsky is a walking encyclopedia... but like an encyclopedia, he should be but on the shelf and rarely used.  Class lectures are not only repetitious... you may actually find that they go backwards.  There's nothing quite like the feeling when you're in the 5th week of a class, and you're rehearing material from the 3rd week... and then the 2nd.  \nMoreover, the readings are useless and have little to do with anything Sidorsky says in class, which is the crux of all graded material.\nThe tangents get out of control -- so much so, that the class should be titled \"20th Century Philosophy  -or- Oh, I Digress\"\nAs it is not a required Philosophy course for majors, I advise you to avoid it at all cost.  Pursue Kitcher, Vogt, Varzi, or Collins for your electives... at the very least, you'll get a cohesive introduction to the material.\nWorkload:\nMidterm and Final -- completely based on lectures, so DO NOT miss class (good luck with that)!\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "December 24, 2002",
            "review_content": "\nIf thereÂ’s a moral to this course, itÂ’s probably post-final regret for having taken this course in the first place. \nMany people take this course because they think itÂ’s an easy grade. Some of these self-congratulatory pseudo-philosophers sit religiously in the front row to desperately attempt to probe SidorskyÂ’s infinite wisdom about moral philosophy with equally self-congratulatory questions. I also met a couple people who wanted to learn something more about moral philosophy besides Aristotle, Kant, and Hume from CC. Nevertheless, itÂ’s an easy grade if (1) you attend class on a daily basis (2) manage to pay attention to each nuance of his circumlocutive lectures (3) repeat everything he says in class and regurgitate it on the midterm and final. However, if youÂ’re looking to understand post-Kantian moral philosophy, take a rain check.\nIf you manage to satisfy the first three criteria, keep in mind, he also has an annoying predilection for handing out class attendance sheets, writing extremely long midterms and finals, as well as pulling out nine students from taking the midterm because of lack of class attendance. His course is seriously lacking substance, depth, and coherence, but makes up for it by being a nice guy. After all, you have to give him credit for pushing seventy and still teaching.\n\nWorkload:\nOne extremely long midterm and one extremely long final, in addition to two short 1-2 page (nongraded) papers before the midterm. Plus, if youÂ’re one of those people who likes to sit in the first 2 rows, you can do the extra 6-10 page paper to bump up your grade or score some extra brownie points with him. He might even remember your name.\n\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "September 23, 2002",
            "review_content": "\nYes, he looks and acts like an old, kindly grandfather. However, like your grandfather, he repeats things to death, as you finally understand what it was like to suffer through torture during one of the great wars. In those rare instances when someone actually asks a meaningful question, he unfailingly misunderstands his/her point, instead turning his answer back into that same, boring drivel he's been saying for the past hour. He may be considered an easy grader, but how can anyone do well when s/he doesn't care at all about the class? If able, you deserve an A for just having the stamina to sit through all his classes. Bring a taperecorder and play it back 5-6 times. Repeat every few weeks.\nWorkload:\n2 ungraded 1-page papers, midterm, final\n"
        },
        {
            "course_name": "20th Century Philosophy",
            "review_date": "July 29, 2002",
            "review_content": "\nThere's hardly any reading for the class, so Prof. Sidorsky tries to back up the material by making allusions to history, literature and music (he even sang in class once). While he's a walking encyclodpedia, he can be pretty repetetive and sometimes his allusions work better than others. As a result, if you're not feeling his reference of the day, you're going to pass out from boredom as you hear him mention it for the twentieth time. Worse, if you don't understand what he's saying, it's hard to steer him away from his theme. Still, some of his tricks work really well, even if he doesn't go into much depth (which none of his lectures really do). My main difficulty with the class was staying attentive, as his old man's voice and repetition makes it pretty easy to space out. This ordinarily wouldn't be that much of a problem, but because the class is so lecture oriented, it's important to pick up on whatever he says. \nWorkload:\nreally light. maybe 5-10 pages of wordy writing a class. midterm and a final. take (good) notes because when you look back on the twenty pages you read, you'll be glad to have whatever extra material you can. \n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "May 14, 2002",
            "review_content": "\nProfessor Sidorsky is awesome. He is an old-time Columbia professor who teaches class the way a philosophy class should be taught. He is a fantastic lecturer. He repeats himself A LOT, but this is his pedagogical style. He is extremely effective at communicating the material, though it is easy to drift in class. Particularly when he talks about 20th C. philosophy, he has fascinating anecdotes (mostly because he was friends with these philosophers personally). For a taste of what college philosophy should be like, take this class!\nWorkload:\n2 ungraded papers, midterm, final. Generous grading\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "March 04, 2002",
            "review_content": "\nI am taking this class in this semester (spring 2002), so I can't say anything about the final, etc., but I can say a lot about his teaching style. He sucks. He rehashes the same things over and over again until you want to shoot yourself. We move so slowly that it is unncecessary to stay after you've signed the attendance sheet, so long as you know someone in the class who will give you the dates of the assignments. I learned far more about each of the subjects from two CC classes than he addresses in the entire course. Worst of all, there are like three people in the class who raise inane questions that he misinterprets and debates with himself for 20 minutes at a time. The only plus is that it is total cake.\nWorkload:\nNone to speak of. 3 pages (yes, only three!) of reading per class from this really simple textbook, two ungraded one page papers, a midterm, and some sort of final (you vote).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 30, 2002",
            "review_content": "\nFamous quote to a student: \"Do you realize how stupid you sound?\" You must go to class, and you will want to because you will love the way he teaches. He may seem disorganized to some but he is actually extraordinarily eloquent and knowledgeable. He will drill certain points about the books into your brain. You will leave the class remembering these points. He gives a lecture class more than a discussion. Who wants a class discussion anyway? I'd rather listen to his sage insight than that of the obnoxious girl down the hall. How many CC professors can say they've read Plato's Republic 60-70 times? Remember, little sophomore student, always choose a professor over a graduate students - the older the better - the more knowledgeable.\nWorkload:\nSidorsky is the greatest!. Fair grader. The best! Midterm, final. No papers unless you choose a paper instead of a midterm.\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "January 29, 2002",
            "review_content": "\nSidorksy is one of my favorite professors in the department. His course is excellent, and after taking it, I still remember the key philosophers and concepts. Basically, he is interested in providing a structure for understanding moral philosiphical thought by studying in depth 4 key philosophers. He is a brilliant and sweet man, and his course is excellent. I highly recommend it.\nWorkload:\nVery light.\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "January 29, 2002",
            "review_content": "\nSidorsky is a kind old man who cannot see very well so attendance isn't necessary unless he knows who you are and may randomly call out your name in class. But he does pass a sign in sheet, and he might threaten to compare signatures to see if your friends sign you in, but he won't. He tells funny stories about the legacy of Columbia. He knows his philosophy very well, but he sticks with his own opinions. When he makes fun of people in class it is hilarious. He is softspoken and a good lecturer although he repeats stuff alot, which is good, because it instills the fact into your brain. Go to class, buy the little book. Don't read it, listen to the man, and you will do fine for exams. \nWorkload:\nThere is one small reader, which you don't really have to read. There is a midterm and final. he is a very easy grader. If you don't get an A you don't deserve to go to Columbia\n"
        },
        {
            "course_name": "Moral Philosophy",
            "review_date": "January 19, 2002",
            "review_content": "\nHis philosophy is that if you're not able to to argue with him in the middle of the street after the course then he's not doing a good job. He really really really goes over the concepts - rather than trying to get through a long reading list. Some found his style repetitive and complained that we didn't read a lot, I didn't mind all - he places the readings in the context of a \"paradigm\" and draws in all these anecdotes and arguments that he could talk about the first paragraph from politics for the whole semester and make it fascinating. Plus, you'll actually remember some of the stuff , and for the exams there's really no cramming needed, just understanding the main ideas. I really recommend this class - as an intro. Or later course... but you might find other philosophy professors hurried and shallow after taking it.\nWorkload:\nVery light. 2 ungraded short papers, 2 exams. He says it himself that he's an easy grader.\n"
        },
        {
            "course_name": "Social and Political Philosophy",
            "review_date": "January 17, 2002",
            "review_content": "\nProf. Sidorsky did a fantastic job with this class. Despite the trend of many professors, Sidorsky didn't just reproduce the readings, with his lectures, he complemented the text with his own analysis and examples. Sidorsky is approachable, funny, and willing to answer questions. This has been my favorite class at Columbia and I'm a physics major.\nWorkload:\nWeekly readings, midterm, final. Sidorsky is extremely reasonable with his grades. Attendance is recommended.\n"
        },
        {
            "course_name": "Social and Political Philosophy",
            "review_date": "January 17, 2002",
            "review_content": "\nProf. Sidorsky did a fantastic job with this class. Despite the trend of many professors, Sidorsky didn't just reproduce the readings, with his lectures, he complemented the text with his own analysis and examples. Sidorsky is approachable, funny, and willing to answer questions. This has been my favorite class at Columbia and I'm a physics major.\nWorkload:\nWeekly readings, midterm, final. Sidorsky is extremely reasonable with his grades. Attendance is recommended.\n"
        },
        {
            "course_name": "Social and Political Philosophy",
            "review_date": "December 23, 2001",
            "review_content": "\nI loved the class. I sat in on it just to check it out the first day and loved it. Sidorsky is a very sweet men, he is what I imagined college professors being. \nWorkload:\nNot too much at all, very interesting reading that the prof goes over very well. He chews it up over and over again. He is supposed to be an easy grader, but this is his hardest class. I heard other classes are easier.\n"
        }
    ]
}