{
    "prof_info": [
        {
            "prof_name": "Marco Castaldi",
            "prof_id": 4126,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Principles of Thermodynamics",
            "review_date": "December 09, 2011",
            "review_content": "\nAs a chem e, you have to take Castaldi's thermo course, no negotiating. But its better to be warned going in: he is not a good teacher. His lectures are jumbled and he rarely states his own assumptions going into example problems. He does not post answers to homeworks or past exams so it can be difficult to see where exactly you went wrong in the \"assumptions\" you made in solving the problems. \nOn top of this the professor is often absent from class for at least 4 classes and often times doesn't even answer emails about homework or exam questions. You can ask the TA's but if its about a previous exam, don't bet on it. On three separate exams the TAs were unable to help students on certain questions simple because Castaldi's wording makes no sense. Study hard.\nWorkload:\nweekly homeworks (pretty easy), 3 bs exams.\n"
        },
        {
            "course_name": "Principles of Thermodynamics",
            "review_date": "February 10, 2010",
            "review_content": "\nIf you can, avoid this class. Prof. Castaldi can be entertaining at times, but entertaining doesn't always translate into a worthwhile class. The lectures come directly out of the textbook, making going to class pretty useless. But his tests are absolutely terrible. Or more precisely, the grading is ridiculous. Don't get me wrong, it's possible to do well in this class, but doing well means making \"assumption\" after \"assumption\" and hoping that you can interpret the vague questions that he presents. Some people benefit from this, but overall, most students don't. Also, the homework assignments have essentially nothing to do with the tests. He basically throws 5-7, sometimes insanely difficult, problems, and really doesn't address any of the questions at any point throughout the class.\nI understand why some students enjoy castaldi. He's a nice guy, but his teaching methods and tests just don't work. \nWorkload:\nWeekly homework...even on exam weeks (seriously?). Three exams and a final, all worth the same amount. \n"
        }
    ]
}