{
    "prof_info": [
        {
            "prof_name": "John Hawley",
            "prof_id": 191,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "Hinduism",
            "review_date": "May 27, 2015",
            "review_content": "\nI was super excited about this class. I had purchased all the books and started the reading (based on an old syllabus) over the winter break. Professor Hawley has written and edited some wonderful books on Hinduism. He is a very enthusiastic teacher with a broad knowledge of the subject and an impressively deep knowledge of those areas he specializes in. My guess is he is a wonderful teacher for graduate students and smaller seminar courses where students can ask questions that help keep him on track, however I would NOT RECOMMEND his Hinduism 2000-level lecture where he plays the stereotypical absent minded professor. This can seem endearing and amusing until you realize that every lecture will be a struggle to understand what it is he is trying to get across. Each class starts somewhat on topic however quickly descends into a labyrinth of anecdotes, side stories and tangents that make it difficult to understand what parts are important – even with the aid of the outline he provides for every class it is a challenge. If you take this class use the TAs – the ones we had were knowledgeable and very eager to help students understand. I would have been in trouble without them.\nI recommend using a laptop for notes and transcribing each lecture – this will be indispensable come exam time for searching for terms. Prior to mid-term and final exams you will be provided with a list of about 50 terms that were mentioned throughout the course. Many of these will be obvious. Some will baffle you. Some of these baffling terms will have been mentioned – in passing – in lecture but nowhere in the readings or handouts so they may not have stood out. In the study group of four people I worked with throughout the semester, all of us good students, we came across terms like this (“raga” for example) that not one of us had included in our notes – they simply had not seemed significant in lecture – we lost hours of valuable study time at final exams searching for these before we gave up and contacted the TAs. Other terms will not have been mentioned in lecture or merely be a symbol or term in a handout text or poem that received short or no mention at all. You would have read it once with no inkling of the hours you would spend later trying to find it and explain why it (for example “the black bee”) is so vital to Hinduism. Unfortunately the Professor is unwilling to provide these lists at the onset of the term so you cannot make note of the seemingly insignificant term when you encounter it. It makes exam preparation less of a review and more of a scavenger hunt through reams of readings, books, handouts and notes.\nDo not mistake this for an introductory course. While I’m sure it hardly scratches the surface of a vast religion/culture/way of life, the syllabus does not focus on key concepts that introduce and enliven your interest. Rather, in his passion for the subject, Professor Hawley feels that you must go into each item and its myriad aspects in detail – and you will be tested on that detail. He goes in for the hard sell of why you too should share his passion – promotion over attraction. The result is that what interest I had was utterly overwhelmed by the sheer amount I was being force-fed. I say this as I contrast it to 3000 and 4000-level courses (dealing with equally complex topics) that presented a far less convoluted structure and more digestible portions.\nYou will be far better prepared to take this course if you are Hindu or have significant prior exposure to Hinduism. I’d estimate that Hindu students made up about 40% of the class and others should keep in mind that they are graded in comparison to their peers who come to this course with a more advanced knowledge base. In addition Professor Hawley ranks east and west – finding the west in large part inferior. One example was in discussing funeral rituals and death, where he clearly felt that westerners did not have a good relationship with death. \nLastly, while the course covers a wide range of issues touching on Hindu culture and India he refuses to directly address the question of caste, which obviously has a significant impact on the socio-economic past and present of India. It is unfortunate that he should completely ignore such an incredible teaching opportunity given the current climate in America where the discussion of what privilege is has become so vital. We are Columbia students; we cannot become good leaders by skirting around touchy issues. Adding insult to this, he did consider the western writer and thinker Henry David Thoreau worthy of lecture and reading time.\nThings you will need to survive/do well in this course:\n•\ttranscribe the lectures\n•\ta solid study group\n•\tuse the teaching assistants\n•\tpreferably have a prior knowledge of Hinduism\nFull transparency: I received an A in this course\nWorkload:\n100-200 pages of reading a week.\nTwo five page essays. (interesting topics)\nMidterm and final exams.\nThe midterm was fair. (Although some TA’s prepped their groups while others did not.)\nThe final was tougher than any 2000, 3000 or 4000 level final I had taken: 4 short IDs, 2 full essays and two short essays (based on more IDs). One of the full essays could be prepared the other was totally unprepared and a doozie. Professor Hawley uses image IDs as well in the exams. These can range from a random freeze frame from a documentary seen in class to images on handouts, the museum visit or slides from class.\n\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "April 12, 2015",
            "review_content": "\nOverall it's an interesting class. At times there's more of a focus on Indian cultural rather than the religion itself.  There is a lot of assigned reading - 100-200 pages a week and you should probably do them because the lecture will not prepare you for the exams or papers. Grading really depends on the TA's, they weren't very lenient this year. \nKeep in mind that a lot of students taking the class come from Hindu backgrounds and this can discourage you at times but if you do the readings you'll be fine for papers. For the Midterm you're given a list of 60 terms and you're told you'll have to talk about 5 of them on the exam for the first part. The second part will be a random essay topic. Final is similar. \nIf you're just trying to fulfill global core don't take this class. \nWorkload:\n2 Trips - Temple Visit, The Met \n2 Papers - TA's grade pretty harsh (20%)\nWeekly Discussion Section (10%)\n1 Midterm -20%\n1 Final - 30%\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "April 29, 2012",
            "review_content": "\nBe sure you REALLY want to take this class before assuming you're going to like it.\nI have to be honest, I cannot believe the reviews I'm seeing of this professor. I understand that he's a nice guy, and I got a feeling in lectures that for some bizarre reason people liked him because of his \"delightful\" attitude, but this is easily one of the worst professors I had at Columbia. I do not understand why he is on the Columbia faculty or why people actually appreciate his teaching methods -- the content of the course may be fine, but his delivery is so poor that I was able to learn it all better on my own with the readings (which were enormous, numerous, and NECESSARY to pass the course).\nTo easily describe what a mess this course is, I can just say that the questions he invents for discussion sections were so vague and had so little material to support their discussion that frequently the TA wouldn't even know how to approach them, let alone stimulate any real dialog on the topic. Hawley talks, and it's a coin toss whether what he's saying will actually make sense as he constantly interrupts himself and fails to clarify what his point is.\nIf you are a Religious Studies major, the class would be worth taking strictly for the readings. If someone told me that Hawley contributed strongly to their knowledge of the subject through his lectures, I would think they were deluded. He hands out \"Lecture Outlines\" that are actually just a random assortment of Hindu/Sanskrit terms that give you no information about where the class is going to go, and he will talk about ANYTHING he wants to, pretty much ALWAYS running out of time before finishing his discussion on the actual subject of the lecture.\nThe only lecture I learned from was given by one of his TAs. I don't know HOW one would organize a class on Hinduism to be clearer and less overwhelming (the sheer number of totally disparate terms and topics discussed outmatches any classes I've ever taken in my life), but this is not it. I know it's a big topic, but it's TOO big for trying to fit ALL OF IT into one class, which I think is what Hawley wants to do.\nYou will leave this class having learned an enormous amount of thinly connected information that will never be useful to you again unless you go to India and continue studying this religion. There is just so much useless information covered by this course in no discernible order -- the only part I liked was when I was reading about how the core concepts of the religion worked. After the midterm it is a random assortment of stories and history lessons that you really would need to care about outside of this course to learn anything from.\nI suspect people won't appreciate this review if they loved him, but I don't know -- I know multiple students that also couldn't understand a word this guy said and ended up regretting not dropping the course sooner.\nWorkload:\n50 to 200 pages of reading a week (in about 3 to 7 different sources per week), 2 papers, 2 field trips, discussion section every other week (with specific questions), 1 midterm, 1 final.\nIf things go similarly to this semester, the midterm will be heavily curved (a 75 went up to a B+) -- this is because the exams are actually very hard to study for, and he throws about 100 possible terms at you. Do not trust his lectures to get you through the course, only the readings will.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "May 23, 2011",
            "review_content": "\nOkay - for all the hype, I don't feel Hawley measured up.\nThe reading was FANTASTIC, albeit very very very time consuming. However, I do feel I learned a lot from the reading.\nHawley's lectures were rambling and not very structured. He'd hand you an outline for the day, but he wouldn't really follow it. The trips to the Met and the temples were okay - but the same. He didn't allot enough time to see everything.\nOkay class - lots of reading - but you'll get something out of it if you do the reading.\nWarning: Be warned that the type of people that take Hinduism are a bit odd sometimes. People will bring in their feelings and treat this class like a conversion information session, and it can bog down the lectures at times.\nWorkload:\ntwo papers, Met trip, Temple trip, final, midterm\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "April 30, 2011",
            "review_content": "\nHawley is a very enthusiastic professor who is emotionally invested in his material, which makes him a truly engaging and inspiring teacher.  Sometimes he was very vague when describing things and especially when answering questions, but I can't imagine anyone who understands as much as he does about Hinduism and not get tongue-tied as he attempts to explain the countless facets all at once!  As for improvements in the course, I would recommend that Hawley try to organize his lectures a bit more.  They weren't disorganized, per se, but often he attempted to cover much too much material for one class, meaning that we had the tempting allure of information listed at the end of the handout that sometimes never got covered!  This said, this only ever occurred because Hawley refused to cut anything short or do anything injustice.  All things considered, I would much rather have a professor cover fewer things in depth than more things in passing.  Despite Hawley's prolixity, though, the class always ends on time.  I took this course because at first I was looking for a Global Core requirement, but when I saw this course I knew that my choice to take it had nothing to with the fact that it was on any list.  At first I was trying to choose between this and another religion class I signed up for, but both were so great that I couldn't drop either!  I ended up taking way too many classes, but since they were all things I wanted to learn about, it was an amazing semester!  My choice to take Hinduism was definitely a major part of this!  I value the way that Professor Hawley is so invested in his material.  Also, I greatly enjoyed the readings.  My section leader was also fantastic (GET PATTON!!!).  I would recommend the course for two main reasons: superficially, it fulfills the Core requirement in an amazingly fun way, but much more importantly it is a deeply enriching and informative class led by a great lecturer.  It is a course that will inspire you to continue learning about Hinduism, Hindus, and India for the rest of your life! \nWorkload:\nThere's a decent amount of reading which I couldn't totally finish by any means, but I don't think it will impact my grade.  It's fascinating stuff though--I'm definitely reading all the books over the summer!  There are also occasional sections (GET PATTON!) and two essays of five pages on very interesting topics.  I didn't feel that the TA's graded as harshly as previous reviewers say.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "April 14, 2011",
            "review_content": "\nProfessor Hawley is one of my favorite professors. Taking this class would be neither a mistake, nor a waste of your time. Though some of the readings are dense, they are all extremely interesting and and give unique perspectives on the religion. Professor Hawley is also a very humble teacher. He makes you read some of his work, but not because he is full of himself like some other professors. The readings are also not really necessary, but they definitely help to understand the subject more and are often referenced in class and sections. The topic of Hinduism is also inherently interesting, albeit very complex. Not everything about Hinduism is understandable from an outsider's point of view, but Professor Hawley at least attempts to make it understandable. Two thumbs up. My favorite class this year.\nWorkload:\nA couple of class field trips, Two papers, Midterm, Final. Also discussion sections, but there only a total of five or something like that, not every week. \n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "January 20, 2011",
            "review_content": "\nThis man truly deserves a golden nugget. If you love to learn and experience the supernatural feeling that knowledge can impose on one, then you must take this class. Hawley's love and passion for his field transcends and makes his class one of the best experiences of my life at Columbia. I knew virtually nothing about Hinduism when I first enrolled into the class, and I now come out of it with a grand understanding of this beautiful way of life. Yes, I am an atheist and I will probably never believe that there is a God (or Gods in the case of Hinduism); however, Hawley's class is much more than a religion class: through the understanding that you gain of Hinduism in his class, you gain an immense appreciation for knowledge and the classics. I mind went to a different dimension when, as he compared the beginning to the Hebrew Bible to text of Hinduism, he recited the lines in Hebrew, the original language. This man is a genius, and no one can deny this. His class goes by extremely quickly and Hawley makes you want to attend; you'll never want to miss it and dread the day that you're forced to do so (yes, because force of another kind if the only thing that will keep you away from what this man has to say). These studies in Hinduism complement the core curriculum greatly as they are founded in the studies of ancient texts. Take this course so that you may become the Renaissance Man or Woman that Columbia University or Barnard College want you to become. Take this course so that you can walk away with an understanding of the one of the most beautiful demonstrations of human capability and creation in the world. Words will never describe what an amazing character Hawley is, or how gifted this man is, or the experience that I undertook as a student in his class, in the face of his knowledge. All I can say is, take this class.     \nHe is an amazing asset to Columbia University and I hope that he knows that because it would truly be a great loss if Columbia lost him to any of its competing institutions. We love you and need you, John Hawley. We appreciate your knowledge and contributions to our community. \nWorkload:\nThe workload is extremely manageable. You'll have a midterm and a final, a couple of 5-page papers, and a lot of reading. You'll love the course so much that the reading will be extremely enjoyable. An A is definitely achievable, but only if you have proper time management. Know that you'll have to dedicate at least two hours a day to keep up with the work at a more than reasonable pace. Most people who do not do well are the ones who do not have a clear understanding that homework at Columbia is about 6-10 hours a day and that leaving everything a day or two before class is the wrong way to go about things. \n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "January 22, 2009",
            "review_content": "\nI loved Prof Hawley's Hinduism class.  Hawley himself was a vibrant and exciting lecturer who very clearly knew very well what he was talking about and could answer just about any question.  Yes, he goes off on tangents, but they're always relevant, interesting, and fun.  The course material was well-structured and well-taught; there were no surprises in terms of essay topics or anything on the exams.  This class secured my choice of a religion major.  \nWorkload:\n2 essays with a given, interesting but challenging topic.  Easy-to-medium midterm and final.  Medium reading which isn't strictly necessary all the time but makes the class much more worth it and will absolutely bring your grade up. \n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "December 29, 2008",
            "review_content": "\nIn the spirit of full disclosure, I should start by saying I grew up in a Hindu household, so I definitely came to the class with more background than a lot of other people. That being said, I really enjoyed the class. It was a nice, refreshing break in the day. \nOther reviewers are right to note that Professor Hawley's lectures are discursive, but in his defense, I think that actually enhances the class because:\na) it means he provides interesting anecdotes while teaching, which actually help the material stick in your memory;\nb) it makes the class a little easier to swallow because you don't have to be 100% alert 100% of the time;\nc) he does get to the point eventually;\nd) the very nature of Hinduism -- which is a multifaceted religion with a lot of different strands -- makes it almost impossible to learn in the strict lecture-and-notes format that other reviewers seem to prefer.\nSo yes, he goes off topic and seems to wander off into tangents, but his organic style actually makes the class all the more valuable. He's a renowned scholar, a wonderful professor, and an interesting character.\nWorkload:\n2 papers (surprisingly difficult) and a straightforward midterm/final with IDs given in advance\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "December 18, 2008",
            "review_content": "\nPretty good course overall. Introduction to Hinduism from one of the most knowledable people about the subject. His lectures were always very vague and hard to understand, but he did a good job of combining concepts in the reading, and clarifying them in class. Hawley was not a great professor, but a really nice person, who acknowledged his own short comings as a lecturer. If you are interested in learning about this class, take it, but don't take it if you are looking for an easy A.\nWorkload:\nDecent, Lots of reading which is really optional. 2 essays which are graded harshly by TA's, midterm which is not too bad, and Final which is much harder. All work in the class is graded by TA's, who tend to grade pretty harsh.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "March 28, 2007",
            "review_content": "\nA somewhat interesting class.  We got much more in depth than I had expected.  Hinduism is a fascinating topic that you could easily spend years studying without full understanding.  Hawley is passionate about the subject, but his lectures sometimes become scatterred.  He is quite charming, but often digresses and strays on tangents.  Some of the assigned readings are more interesting than others.  Hawley is a hard grader on the three short essays, but the exams weren't too bad.  At least he gives you a midterm/final study guide.  the discussion sections can be a good suppliment to the class deending on the TA.\nWorkload:\nmedium, but he grades essays a bit harshly.\n3 short essays, in class midterm and final.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "January 27, 2007",
            "review_content": "\nOK, first the pros: Hawley's a madhu. His enthusiasm, good cheer, intelligence, and innate respect for and appreciation of his students are apparent from the minute he steps into the classroom, when he flashes his trademark ear-to-ear grin at all and sundry and then proceeds to begin the day's lesson with yet another amusing anecdote about his numerous Indian adventures. \nNow the cons: anecdotes do not for cerebral satisfaction make, nor does his rambling, discursive, \"where is he going with that\" style of conversation - as opposed to delivering a clear, lucid, well-structured lecture - encourage prolonged attention on the part of those who have to sit through a 75 minute monologue, especially in those ridiculously uncomfortable chairs in his classroom.\nTake Hawley's Hinduism class only if you don't already have a certain background in Indian culture, history or religion, otherwise consider one of his his upper-level seminars or graduate courses, or just be prepared for mind-numbing boredom twice a week - I'm guessing Hawley's one of those who tends to shine in smaller, informal group settings, where his personality and style of communication will set a positive, upbeat note for the rest of the class. \nWorkload:\nAbsolutely manageable. Midterm, final, two short papers (3-4 pp, 5-6). Weekly reading assignments.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "January 11, 2007",
            "review_content": "\nA wonderful, broad survey with well-selected focus points that employ Hawley's deep knowledge (Krishna, i.e.). Hawley obviously loves his job and loves what he teaches. A fantastic experience.\nWorkload:\naverage. two papers, midterm and final. discussion sections with the TA were a pain.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "January 11, 2007",
            "review_content": "\nA wonderful, broad survey with well-selected focus points that employ Hawley's deep knowledge (Krishna, i.e.). Hawley obviously loves his job and loves what he teaches. A fantastic experience.\nWorkload:\naverage. two papers, midterm and final. discussion sections with the TA were a pain.\n"
        },
        {
            "course_name": "Krishna",
            "review_date": "December 21, 2005",
            "review_content": "\nProf. Hawley is a gem.  He introduced me to this difficult subject and completely sparked my interest, having known next to nothing about Hindu religion upon entering.  He is generous, invested in the class, and interested in meeting students where they are - which I think is the most important thing one could ask of a professor.  I'm definitely taking another class with him.\n\nWorkload:\nWeekly postings, heavy reading, 20 pg term paper, presentation - but it's all worth it and the class environment is warm and welcoming.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "December 20, 2005",
            "review_content": "\nMost of the above comments are valid.  Nice guy, easily accessable, not a great lecturer but still interesting.  Definitely has a hard time staying on topic, but his tangents are often entertaining.  In general, however, Prof. Hawley is a good teacher; it's an incredibly difficult subject to cover in a one semester class, and he makes a good effort at it.  I would rate him favorably overall, and would recommend him to other students.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "December 18, 2005",
            "review_content": "\nProfessor Hawley is one of the most energetic, engaged, and interesting professors I have had since getting to college. I adore his teaching - the grading sucks. What would be an A-, B+ paper in another class is definitely B- or even C+ material in his. No grade inflation here, kiddies. Still, it's worth it to actually learn a ton about a fascinating subject. \nWorkload:\ndifficult midterm, doable final, tons of reading, two 4 page papers \n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "December 09, 2005",
            "review_content": "\nYes, Hawley is charming and is light. But are you ready to read around 15 books in the semester, especially Hindu concepts that you barely understand. And by the way Hawley doesn't explain anything in class you are left on your own.  The TA's James and Travis are strict graders that want grad school kind of writing. Getting an A or even a decent grade on this course I think is impossibe especially when its a cumulative final and Hawley could choose to put anything down from the entire course.\nGood luck, you are going to need it.\nWorkload:\nA decent amount of reading for every class, 75-100 pages. Two papers graded harshly by the TA's and a midterm and a cumulative final. \n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "November 14, 2005",
            "review_content": "\ni really enjoyed taking this class. although it is true he does go off topic during lectures and is very proud of his language skills, he is very joyful, energetic, and interesting. he is extremely knowledgeable and i find the subject matter fascinating. i don't think any of the reading was excessive or a waste of time. \ni recommend this class--i find professor hawley very charming and engaging and enjoyed the subject matter immensely.\nWorkload:\nmanageable reading. two short papers--challenging topics, though. midterm and final. no homework.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "May 08, 2005",
            "review_content": "\nI am in love with professor Hawley. He's sweet, charming, brilliant, and a great lecturer. The class is very interesting, even for those not majoring in religion... I definitely reccomend it!\nWorkload:\nThe reading list is very reasonable and for the most part interesting. Two papers (about 6 pages each) with a choice of topics. Very reasonable final w. picture identifications, short answer questions, and an essay.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "December 20, 2004",
            "review_content": "\nThis class could have been really interesting but Hawley is a terrible lecturer.  The material is cool, and the readings and films aren't bad.  Hawley gives out detailed outlines every class, but then he talks for an hour and fifteen minutes about absolutely nothing.  Even on the days when you finally seem to have taken notes you will look back at them when final time comes and they will be totally nonsensical.  Also, he is very boring- the best lecture all semester was given by a guest (Rachel McDermott).  He also assigns a shitload of reading.  Most importantly, even though the class is supposed to be introductory, he talks about ideas without giving any type of background, even if its not in the reading.\nWorkload:\n2 papers, your grade will depend on how muh you show that you did assigned readings and also if he grades it or if the TA does (he's tougher).  Final, you wont have any notes and you and your classmates will all scramble around, trying the ids he told you to study (there are over 120 to prepare, 5 of which are on the test).  have fun.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "April 12, 2003",
            "review_content": "\nI whole-heartedly disagree with the claims that Hawley wastes class time, comes to class unprepared, or has any arrogance or pretension about his knowledge. Those reviews have been bugging me ever since I took the class Freshmena year and I would like the columbia world to know that Hawley's class was perhaps the best and most informative class I've taken yet. He has such an enthusiasm for India and sometimes he can't help but boil over with it. Anyone who disagrees has some manner of stick shoved up their a&$. If you pay attention and do the readings, this class is SUPREMELY rewarding. \nWorkload:\nlight-medium\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "April 24, 2002",
            "review_content": "\nProf Hawley, like so many other posters mentioned already, comes to class unprepared, spends way too much time answering pointless questions that have almost nothing to do with Hinduism, and shamelessly promotes his knowledge of Indian languages. However, there's no doubt that he's a really smart guy, and in some roundabout way I learned quite a bit about Hinduism from his lectures (this from someone who grew up a Hindu in India), especially the bhakti tradition. It's obvious the guy loves teaching and loves Hinduism - the enthusiasm comes across. If you are willing to do the reading to counter the free-flow structure of class, you might learn quite a bit and enjoy yourself at the same time. Bottom line: I recommend the class.\nWorkload:\nPretty easy. Two short essays (4pp each), midterm and final\n"
        },
        {
            "course_name": "Introduction to Asian Religions",
            "review_date": "November 09, 2001",
            "review_content": "\nI think you have to assume that many of the people who write these reviews are discouraged students airing their discontent about a bad grade or a bad relationship with the professor. This is particularly true in regards to Prof. Hawley, whose knowledge of Hindu lore and many of the relevant languages is never anything but amazing. Hawley is engaging , funny, and a little eccentric, making his lectures always interesting. His honest devotion (in a scholarly way, not necessarily religious) to the concepts he is teaching makes every lecture exciting. Don't listen to those other jackasses -- Hawley could probably give an entire lecture on his experiences in India, his knowledge of Sanskrit, etc, and it would be great.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "December 31, 1999",
            "review_content": "\nIt's pretty impressive to meet a white man who can speak Hindi. Of course, it would be even more impressive if he didn't announce it the first day of class and take every later opportunity to remind you. He's just proud of his learning. Very proud. Some find the resulting lectures too pompous and self-congratulatory to tolerate. Note: Napping in class incurs the risk of having things thrown at you by the indignant professor.\nWorkload:\n4 short papers; Midterm and Final.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "December 31, 1999",
            "review_content": "\nIt's pretty impressive to meet a white man who can speak Hindi. Of course, it would be even more impressive if he didn't announce it the first day of class and take every later opportunity to remind you. He's just proud of his learning. Very proud. Some find the resulting lectures too pompous and self-congratulatory to tolerate. Note: Napping in class incurs the risk of having things thrown at you by the indignant professor.\nWorkload:\n4 short papers; Midterm and Final.\n"
        },
        {
            "course_name": "Introduction to Asian Religions",
            "review_date": "December 31, 1999",
            "review_content": "\nIt is a testament to Hawley's ability to teach that he managed to make thoroughly enjoyable and interesting a lecture class frequently interupted by the most idiotic questions I've ever heard from a class consisting mostly of people who were unable to pick out the blue man with the flute and aura around him as Krishna. A testament to his patience as well. Hawley is clearly excited by the material, even the stuff he is not so familiar with, enough to make each lecture worth attending. These characteristics, even more than his considerable knowledge of all things Hindu, would make it worthwhile to take virtually any class from him.\nWorkload:\nMidterm, final, 2 short essays.\n"
        }
    ]
}