{
    "prof_info": [
        {
            "prof_name": "Samuel Spinner",
            "prof_id": 2645,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 25, 2011",
            "review_content": "\nSam made Lit Hum worthwhile for me. He is incredible knowledgable and provocative. You may not always agree with what he has to say, but he is usually just trying to spark an insightful conversation. I highly recommend this class. Sam was the only teacher my freshman year that actually cared about me and took the time to get to know me outside of the classroom. He also loves talking about television shows, and he is Canadian - it cant get much better than that.\nWorkload:\nPretty fair. Obviously lots of reading just like with any Lit Hum class. a few written responses that arent really graded. 2 6-8 page papers a semester. A very fair midterm and the final. He is a fair grader, but he grades you to your ability on our own scale.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2011",
            "review_content": "\nSam is awesome. Honestly the only person that could make me laugh, stay awake and learn at 9 o' clock in the morning twice a week. He's entertaining and allows you to form your own ideas about the readings while making sure you stay on track. He's not a terribly hard grader and he really cares about teaching and wants you to like lit hum. I enjoyed taking his class and I genuinely feel like I learned a ton. I would recommend his class 110%.\nWorkload:\nTwo papers, a midterm and a final. Graded fairly.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 14, 2010",
            "review_content": "\nSam Spinner is awesome.  His approach to lit hum is pretty much exactly what I wanted to get out of the class--he gives you the background, and then lets you form your own opinions about the literature, helping to shape your ideas and guide you toward deep thoughts, instead of just teaching you his opinion on various works.  He manages to convince nearly everyone read most of the material, and encourages you to actually become a better critical thinker through the assignments he gives.  I feel genuinely smarter after taking his class.\nWorkload:\nTwo papers a semester, plus short (1-2 page) assignments on every text.  One five minute presentation on one book.  Also, you read what's on the lit hum book list.  He doesn't make very many changes to the list, although he added two works on to the end of spring semester.\n"
        },
        {
            "course_name": "Elementary German II",
            "review_date": "November 09, 2005",
            "review_content": "\nSam is the definition of laid back, and yet  you'll still learn German!  He runs a fun, low-stress class, with a good deal of amusing class interaction and discussion. I'd definitely recommend him for Elementary German.\n"
        }
    ]
}