{
    "prof_info": [
        {
            "prof_name": "Sanjay Reddy",
            "prof_id": 964,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Development Economics",
            "review_date": "December 11, 2008",
            "review_content": "\nProfessor Reddy is a wonderful professor and a wonderful man. First, you can tell he REALLY cares about his students and is genuinely interested in hearing their points of view. Even in a large lecture class, he encourages class participation, and truly listens to every student's comments. I felt completely comfortable commenting on sometimes very complex economic theories, which is a truly rare thing for a Columbia or Barnard econ class.\nI found the material to be absolutely fascinating. When people say Development Economics, it can mean a lot of different things. Professor Reddy understands this, and in facts structures his class around the idea that development economics has been interpreted in many different ways throughout the 20th century until today. Each week focuses on a different theory or aspect of economic development - from the Solow growth model to the role of gender, health, and education in economic development. In many ways, this is a history of economic development class. I left feeling I knew a good amount about many different thoughts and theories in the field, rather than harping on one. \nHe is not a data-driven economists, but a theoretical economist. There are no problem sets or equations to memorize. He occasionally used formulas or equations when relevant, but it was absolutely NOT necessary to follow them if you don't like that kind of thing. Being taught by a theoretical economist, who emphasizes the all economists have are THEORIES and not canonical doctrines and laws, was incredibly refreshing. Every economics major should absolutely take this class, and I also recommend it to anyone else with an interest in development work and poverty. \nWorkload:\nNot terrible. There is a lot of reading, but it is usually really interesting. If you find it boring, which I sometimes did, you can just skim it or skip it all together. There is a midterm and a final, which are all essays and IDs. He gives you possible questions before, and chooses a few of them to put on the test. Make friends and split the questions up - it is much easier that way, especially for the IDs. If you hate tests, you can write a paper instead.\nMake friends with the TA, Jere. He does all the grading. He can be harsh - the midterm was graded surprisingly harshly - but is more than willing to go over the exam with you, as long as you are willing to listen and try to learn the material, not just fight for a higher grade. Your final grade matters much more anyway. I got a B on the midterm and an A in the class, so clearly there was some curving going on. \n"
        },
        {
            "course_name": "Inequality and Poverty",
            "review_date": "January 15, 2008",
            "review_content": "\nI have mixed feelings about this class, because at times I enjoyed the theories being discussed and at others I wanted to smash my head in boredom.  Reddy is a sweet man, but is definitely not concise.  When he speaks in lectures it's like he's reading from a wordy dissertation he wrote, and its hard to follow him at times.  There are no books to purchase for this class--all the readings were available online.  However, the amount of reading he assigns each week is completely unmanageable.  He touches upon some readings more than others, but he ignores some completely.  You can probably get by without doing most of the reading at all.  I got an A- in the class and I stopped reading anything after the midterm.  That said, there were plenty of people in the class that were truly interested in the material, and the questions they raised made the class more interesting.  Reddy tries to accommodate the students interests (he brought in a guest lecturer because we were more interested in topics on NYC) and he also grades extremely generously and will weigh the final more if you do poorly on the midterm.  Take this class if you're really interested in inequality or poverty, or if you want a fairly easy A in an economics elective.\nWorkload:\nMidterm & Final, each the same format--term IDs (based on lectures and you have a choice of terms) and choice of essays (requiring only that you create an argument, citing any readings you want) OR a research paper on any topic you want relating to inequality and poverty (i didn't write the paper so i dont know how it was graded)\n"
        },
        {
            "course_name": "Inequality and Poverty",
            "review_date": "October 24, 2007",
            "review_content": "\nI LOVED this class and Professor Reddy is BY FAR one of the best professors I have ever encountered at Columbia. He is SO SWEET and you can tell that he really cares about his students. Professor Reddy is an extremely good lecturer and very eloquent. The good thing about this class is that it puts economics in to many different contexts like sociology and anthropology so you don't just have to be an econ major to enjoy this class. I HIGHLY recommend this class to ANYONE, whether they are interested in economics or not. Professor Reddy is amazing.\nWorkload:\na lot of reading but other than that just a final and midterm that can be substituted with a paper. the reading is really interesting anyway so its not that big of a deal and is definitely completely manageable.\n"
        },
        {
            "course_name": "Development Economics",
            "review_date": "January 27, 2004",
            "review_content": "\nAn excellent class. Well-structured and a superb lecturer. Very eloquent and easy to follow and covers most of the readings. Very approchable and is just brilliant!\nWorkload:\nmoderate\n"
        },
        {
            "course_name": "Development Economics",
            "review_date": "January 05, 2004",
            "review_content": "\nSanjay Reddy is such a sweet man; I took this course without any prereqs and I had very little interest in econ itself (I was more drawn to the development aspects of it). So I decided to take the risk and do a 25 page paper on women and dev and that was probably yhe best decision I ever made. It's really not that bad..I would say ditch the midterm/final and do something else that may strike your as well as his interest.\nWorkload:\nIts pretty intensive but if you do an independent project, you can go within your own pace.\n"
        },
        {
            "course_name": "Development Economics",
            "review_date": "August 08, 2003",
            "review_content": "\nclass drags by so incredibly slowly with him. BUT he is so incredibly nice and personable. he's ALSO nice with the grades. if you show improvement over time, he'll give you the benefit of the doubt and curve it. in addition, he curves the tests anyways. so it's doublely nice. the only prob is the telephone thickeness of his combined readings... there;s few books to buy. but it's alot of dense material. he's always up for suggestions on ways to grade you... if you want to avoid a final... he has mentioned that previous students did extensive interviews and etc for papers.. or you could do a regular paper\nWorkload:\none midterm & final, (can do paper instead of final, about 15 pages)\n"
        },
        {
            "course_name": "Inequality and Poverty",
            "review_date": "July 14, 2003",
            "review_content": "\nThe class is likely to receive mixed reviews, because I myself have mixed feelings about it. The class itself digresses vastly from other econ classes, since we do not analyze as many graphs, equations, etc. There is tons of reading that can be regarded as highly theoretical as well. You need very little from the intermediate macro and micro classes to follow this class. You just simply have to read. It is true that Professor Reddy's voice is very monotous, but his lectures are excellent and they are a perfect summary of all the readings. He definitely shows consideration for his students, deliberately asking questions or opinions to reach out to his large class. However, the class is still very impersonal. \nWorkload:\nTwo booklet fulls of reading. Optional paper that can be taken instead of the midterm, and final.\n"
        },
        {
            "course_name": "Inequality and Poverty",
            "review_date": "March 27, 2002",
            "review_content": "\nThe absolute BEST class I've taken at Columbia. Professor Reddy is, without a doubt, an unbelievably articulate and fascinating lecturer and an absolutely brilliant man. His lecturers couldn't be further from \"boring\" or \"monotonous.\" His genuine passion for the topic at hand come across loud and clear and the time spent in class absolutely flies by. The topics he selected for exploration were truly interesting and timely and were drawn from a variety of disciplines including philosophy, sociology, and of course, economics. Anyone who bothered to put a little effort into attending class and listening to his lectures came away with a very strong foundation in looking at the question of inequality and poverty in this country and abroad. Both lectures and assesments definitely are biased toward the qualitative, rather than quantitative, side. So this is an ideal class for those of us who want to go beyond endless graphs and confusing superscripts. He is very responsive to suggestions and made a real effort to alter the course so as to accomodate student feedback.\nWorkload:\nNot bad at all. There is fairly substantial reading packet but only one midterm and a final. Both midterm and final consist of several term definitions and one or two essays (questions distributed before the test). A very reasonable grader.\n"
        },
        {
            "course_name": "Development Economics",
            "review_date": "February 18, 2002",
            "review_content": "\nI completely disagree with the earlier review. This professor is truly brilliant and superbly articulate. He respects students' intelligence --- for a change -- and offers a genuinely interdisciplinary view of the subject, going well beyond the issues considered in most economics classes, without sacrificing economic expertise. I highly recommend him. And by the way, why are almost all of the reviews on this list so totally negative?\n"
        },
        {
            "course_name": "Development Economics",
            "review_date": "January 30, 2002",
            "review_content": "\nThis class was just awful. The professor is horrible! He is boring, his voice is monotonous, he speaks way too fast so you cannot write down the important stuff, and has the most annoying smirk on his face the whole class. I must admit he did make an effort to improve his lectures, but I don't think anything will help him. Unless you are really interested in the topic of development economics, stick with other econ classes and professors.\n"
        }
    ]
}