{
    "prof_info": [
        {
            "prof_name": "Chang Ha",
            "prof_id": 2881,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "May 10, 2006",
            "review_content": "\nI read the previous review and I have to say that some of it is unfounded.  Personally, I am a big fan of Chang although I do realize he has his faults.  It is true that class often runs past when it should end- the day we took the second quiz it ran over by a lot but usually it only runs over about 5-10 minutes.  When I signed up for his course, it was the only section that fit with my schedule and I was afraid that I would not be able to understand him as is the problem with many foreign math professors. As for his English, it's true he does have an accent.  However, his English is very good and it is easy to understand him.  I think he is actually very considerate to his students.  He is very approachable and wants to help you understand the material.   He holds office hours and you can make appointments to go over things with him if you cannot go then.  He regularly checks his email and responds in a timely fashion.  He even gave his cellphone number to a student to call him for help.  He gives a mock midterm and a mock final to help you study and everything is open book/note.  He changed the way he grades to make your total grade add up to 105% and said he would drop your lowest 5%.  He also said your lowest homework would be dropped.  Chang is extremely funny and makes a point of getting to know all of his students by name.  His awkwardness and inappropriate/unPC comments and contact with students is charming and refreshing at times.  He even came in voluntarily for one or two extra sessions to help us review. I took a stat course in high school and learned the material from a whole new perspective with Chang.  He wasn't so clear about the last project we did but i don't think it counted for that much anyway.  At times his teaching can be a little confusing or you don't know where he is going with something but the majority of the time it all comes together in the end.  Overall, I would definately recommend this course to someone who wants to geta science requirement or a stat requirement for a major out of the way and wants a relatively painless and funny experience.\nWorkload:\nA weekly problem set consisting of problems from the textbook (he drops the lowest score), 2 easy quizzes, a midterm, a final and a project.  Very reasonable and not hard.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "April 11, 2006",
            "review_content": "\nI hate writing really negative reviews, but I have to say that Chang Ha is a very bad teacher whom should be avoided at almost any cost.  His English his poor, so poor in fact that no one can understand the questions on the tests.  We recently had a quiz, and he left out an important part of the question, and this went uncorrected until about halfway through the quiz-taking time when someone spoke up.  He keeps us after class almost without fail, despite the frequent complaints of the students.  He handed out the aforementioned quiz, designed to be completed in 30 minutes, with less than 15 minutes left in class.  For those people who needed to get somewhere after class, it was just tough luck.  He is very inconsiderate of his students, although I do not believe it is intentional.  He has a good sense of humor and seems to be trying pretty hard, but I'm afraid that at this juncture trying hard isn't even close to good enough.  The only good thing about the class is it is incredibly easy for anyone with even passable math skills who reads from the book.\nWorkload:\nWeekly problem set, usually takes 1-2 hours, not difficult.  Two quizes worth very little, a really easy open book and open note midterm (everything is open note/book) and final.  Also, there is this lame project that we are assigned that is worth like 10% of the grade.  Who knows how that will turn out.\n"
        }
    ]
}