{
    "prof_info": [
        {
            "prof_name": "Mary Gordon",
            "prof_id": 1060,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Middle Fictions",
            "review_date": "November 15, 2016",
            "review_content": "\nMary Gordon is one of the best professors I've had at Barnard. Middle Fictions was completely inspiring and I enjoyed every minute of the class. Her lectures are very interesting, and the reading list is incredible. No she is not a perfect human, and she did make some comments that were not as well taken as others. However, that being said, this class totally broadened my understanding of literature and I looked forward to doing the work every week. \nWorkload:\nModerate--the novels are short, as is the point of the class. However not doing the reading is less okay in this class than it is in others. Two papers and two quizzes, fine if you've done all of the reading. \n"
        },
        {
            "course_name": "Middle Fictions",
            "review_date": "May 04, 2016",
            "review_content": "\nMary Gordon is an egomaniac. She speaks well, with specificity and keen observation, but so clearly delights in the sound of her own voice that the effect of it is rather ruined. She picks favorites and cold calls them in class by first name. \"Georgia -- why don't you play with this?\" She'll ask of some student who has clearly been to office hours, if not over for dinner.\nHer taste in literature is as depressing as it is totally dreary. I think she might've ruined literature for me, actually, just a little bit -- or at least in the middle of the semester it felt that books, like life, were for enduring and not for enjoying. But that'll happen when you read novella after novella about women with no hope for their futures. \nIn class she said that girls should not dress to be desired when they go out partying, and that if they do so they should at least not be surprised when they are assaulted or catcalled, prompting one student to storm out of the room. (It seems her brand of feminism is as outdated as her taste in books; society has recognized lengthy/flowery description as dull just as it has recognized slut-shaming as wrong.)\n She used the n-word in class trying to make a convoluted point about cat-calling, and apologized for it the next week, before sharing an unrelated anecdote about her \"good friend\" Claudia Rankine. Congratulations, Mary! You know a black woman! This is a specific gripe, but it's part of a broader issue: she pretends to engage the class in debates, but doesn't care about listening as much as she cares about being right. She'd rather refute her students than speak to them. \n\nWorkload:\nmedium\n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "September 30, 2014",
            "review_content": "\nWhy Professor Mary Gordon does not have a gold nugget next to her name, I do not understand. I took this class my first year, and so far, no other English class here at Barnard/Columbia has lived up to it. Professor Gordon's lectures were intriguing and thought-provoking. I did not stop moving my pen to take notes, because everything she said was so pertinent and interesting! I still think about her lectures all the time. \nAs a freshman taking this class, I was at first quite intimidated. However, I did not need to be. While the literature was definitely a challenge, Professor Gordon helped to make the works accessible to us. She understood that we would have difficulty with the literature and told us not to worry. When I arrived in class and listened to her lectures, the work magically seemed to make sense - I don't know how she did it! \nThis is certainly a class that I will never forget, and I urge you to take this class or any class with Professor Gordon. \nWorkload:\nAbout a novel every three classes, difficult reading, but she understands that and does not expect you to come in having completely understood the work. An easy midterm IF you come to class (and why would you want to miss her incredible lectures anyway?). Three 1-2 page difficulty journals, where she literally expects you to rant about how hard the books are! A 6-8 page paper (you don't really need to have read the books in their entireties if you attended class). A take home final (basically a 4-6 page essay) with a choice of 1 out of 2 prompts. \n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "January 09, 2012",
            "review_content": "\nAfter reading Prof. Gordon's glowing culpa reviews I was excited to take her literature class, and she certainly did not disappoint. Gordon's deep appreciation for and belief in great literature is evident in her lectures (she cried when reading a passage from Virginia Woolf. real tears. whoa.) Aside from her great love of books (she's an author after all), she is very knowledgeable on the authors whose works we read, and she introduced each book we studied with a brief explanation of the author's life, philosophy, style, and other important works- which helped but the books into a broader context. As a teacher, she really cares about her students- taking the time to learn people's names and eagerly encourage their comments, as well as responding thoughtfully to them. While I didn't love all of the books we read, her lectures were substantive and eloquent (often bordering on poetic!)- definitely a great choice if you're looking for an enjoyable and minimally- taxing lit course.\nWorkload:\nA midterm (10 straightforward ids and a short essay), and 2 papers (each a response to 1 of 2 choices of topic)\n"
        },
        {
            "course_name": "Middle Fictions",
            "review_date": "March 02, 2010",
            "review_content": "\nSimply one of the most wonderful courses I have had the pleasure to take at Barnard. Prof. Gordon reads like a writer--her thoughtfulness and attention to detail are unparalleled. Her enthusiasm and love of the material made even the harder works accessible (\"Hour of the Star\" was particularly challenging but Mary's lecture on it was great). Likewise, I had never appreciated Flaubert until taking a class with Mary Gordon. My notebook ended up being full of both the in-class lecture notes as well as Mary's trademark wisdom and wit. In short, a fabulous class on a genre that is rarely studied. Don't miss out on it, seriously.\nWorkload:\nSubstantial reading load but absolutely manageable. Skipping classes is a terrible idea since you study one work per class. Leave time to write elegant, persuasive essay (she's a writer, you won't get away with some lame summary). \n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "February 15, 2010",
            "review_content": "\nMary Gordon is wonderful, and The Modern Novel really highlighted some of her abilities. There's a reason Barnard is so thrilled to have her here, and we should all consider ourselves extremely lucky to take class with her. Like the previous reviewer, I did not always understand why we read certain novels, but the gift of the Modern Novel was that Prof. Gordon really knows what she's doing. If I started off unsure about a certain book, I was hooked by the last lecture. Mary Gordon isn't there to have us read fun books--she's there to teach us about what makes great writing great. Her classes aren't like other lit classes, where you focus on the basics and/or theory; the Modern Novel was about the unique stylistic ways authors have of making works their own, wonderful texts. Mary Gordon KNOWS good writing, and her gift is her ability to share that understanding with us. Her students learn about writing, even in these lecture classes, and it was a true joy to read some of the novels she selected. I have some new favorite novels--and authors--because I took The Modern Novel, as well as a newfound appreciation for literature. And that's saying something, because I'm an English major.\nWorkload:\nUsually about a novel a week. The midterm is easy if you've done the reading and come to class. At the end of the semester we had to write one-page difficulty journals for The Waves and Ulysses, and combine these into a paper. \n"
        },
        {
            "course_name": "Modern Novel (Barnard)",
            "review_date": "November 28, 2009",
            "review_content": "\nI signed up for this class to fulfill my Barnard English requirement after transferring. Professor Gordon had just returned from a stint at Stanford and when she said that she found Barnard and Columbia students so much more interesting and interested than their Stanford peers, I rolled my eyes. I didn't care for the girls (and one boy and a LOT of old people), the reading list (two Woolf novels, Joyce, James's What Masie Knew), or the lackluster discussion. However, halfway into the semester I had completely changed my mind. I loved some of the other books we read (Conrad's The Secret Agent, Ford's The Good Soldier, Forster's Howards End), the midterm was easy, and I found Gordon's lectures surprisingly engaging. She loves what she teaches, she has fantastic anecdotes and is incredibly encouraging. \n\nWorkload:\nYou read 1/3 of a novel per class, which Gordon discusses, occasionally asking the class direct questions. The midterm included 10 ID question and a choice of essay questions. An 8-10 page paper was due between the midterm and the final, and for the three final books (Woolf's The Waves, Ulysses, and Bowen's The Death of the Heart) you write a 1-page \"difficulty journal\" for each class. The final will summarize what you have learned through these journals in essay form. \n"
        },
        {
            "course_name": "Middle Fictions",
            "review_date": "January 25, 2009",
            "review_content": "\nI loved this class.  Mary Gordon is simply fantastic, and it was really refreshing not to read the same old stuff.  Some people had problems with the reading list, and I didn't love it--Willa Cather and Mary McCarthy, ugh--but I read a lot of things I hadn't previously read.  I wish the discussion hadn't been so stilted--Mary tends to call on people randomly, and you talk to her instead of to each other--but this was a great, straightforward English class.  If you want theory, this is not the class for you.  I felt like she responds to you as a writer and not as a critic.\nWorkload:\nAbout 60 pages of reading per class, and she'll call on you the day you don't do it.  One-page film response, two papers.\n"
        },
        {
            "course_name": "Middle Fictions",
            "review_date": "January 21, 2009",
            "review_content": "\nWhile I wouldn't say that this class was a complete waste of time, I was definitely disappointed after hearing such wonderful things about Professor Gordon. She is a really nice person and tries to be helpful at office hours, but the books we had to read were really not that great, and the topics she gave us for essays were absolutely horrible, as someone else mentioned. It was truly painful to have to sit there and ruin a perfectly good book (one of the few decent ones we read) by limiting its analysis to themes of FOOD... *food*, for god's sake... She's plays favorites, and the grader can be really harsh, so if you don't kiss up to Mary... well, just kiss up. Really. Or don't take the class, I guess.\nWorkload:\nlots of reading, and about 3 papers on terrible topics.\n"
        },
        {
            "course_name": "Middle Fictions",
            "review_date": "January 01, 2009",
            "review_content": "\nI think a lot of people liked this course more than I did.  I found Gordon offputting (writing a page of beautiful prose is a hard job than rebuilding the World Trade Center?  Really?  *Really*?), the reading list lackluster, and the essay topics vague.  She says smart things, but nothing you couldn't get from doing some reading on your own (granted, I won't be doing that reading because I don't like most of the authors she chose); clearly cares about the works she discusses (once weeping over a scene she read to us); and once you dig your teeth into a chosen text and choose a thesis for your essays, they're interesting, but you really have to work for it, because Gordon won't provide you with direction.\nWorkload:\nAn unbelievable amount of reading -- two novels a week -- a midterm, two essays, and a take-home final.\n"
        },
        {
            "course_name": "Middle Fictions",
            "review_date": "December 30, 2008",
            "review_content": "\nNo literary theory, no interminable novels, a well known writer as a professor - sounds lovely, right? Just enjoying reading and writing some papers about great short fiction. If that's what you are hoping for, look elsewhere. \nProf. Gordon may be a wonderful story writing teacher, but don't waste your time with her as a literature professor. Behind the sometimes amusing personal stories about the authors whose texts we read, Prof. Gordon is merely a name-dropper. Her lectures merely skim the surface of most of the texts. The assignments she creates are reductive and useless. For starters, paper topics are assigned and the topics are boring and painful to explicate. \"Compare the treatment of sex and money in these two works\" and \"talk about the use food and drink in these works\" were two of the choices given for the for paper topics throughout the semester.  What makes all of this worse is that the works we read are amazing and are not taught in other courses (Duras, Handke, Lispector, Trevor). In general, this class was more trouble than it was worth. \nWorkload:\nAbout a book a class (short works), in-class midterm (10 IDs, 1 essay about how one of the quotations from the IDs represents the larger work), paper (8-10 pages) (horrible topic), take home final exam (5-7 pages) (another horrible topic)\n"
        },
        {
            "course_name": "Middle Fictions",
            "review_date": "December 30, 2008",
            "review_content": "\nNo literary theory, no interminable novels, a well known writer as a professor - sounds lovely, right? Just enjoying reading and writing some papers about great short fiction. If that's what you are hoping for, look elsewhere. \nProf. Gordon may be a wonderful story writing teacher, but don't waste your time with her as a literature professor. Behind the sometimes amusing personal stories about the authors whose texts we read, Prof. Gordon is merely a name-dropper. Her lectures merely skim the surface of most of the texts. The assignments she creates are reductive and useless. For starters, paper topics are assigned and the topics are boring and painful to explicate. \"Compare the treatment of sex and money in these two works\" and \"talk about the use food and drink in these works\" were two of the choices given for the for paper topics throughout the semester.  What makes all of this worse is that the works we read are amazing and are not taught in other courses (Duras, Handke, Lispector, Trevor). In general, this class was more trouble than it was worth. \nWorkload:\nAbout a book a class (short works), in-class midterm (10 IDs, 1 essay about how one of the quotations from the IDs represents the larger work), paper (8-10 pages) (horrible topic), take home final exam (5-7 pages) (another horrible topic)\n"
        },
        {
            "course_name": "Middle Fictions",
            "review_date": "December 30, 2008",
            "review_content": "\nNo literary theory, no interminable novels, a well known writer as a professor - sounds lovely, right? Just enjoying reading and writing some papers about great short fiction. If that's what you are hoping for, look elsewhere. \nProf. Gordon may be a wonderful story writing teacher, but don't waste your time with her as a literature professor. Behind the sometimes amusing personal stories about the authors whose texts we read, Prof. Gordon is merely a name-dropper. Her lectures merely skim the surface of most of the texts. The assignments she creates are reductive and useless. For starters, paper topics are assigned and the topics are boring and painful to explicate. \"Compare the treatment of sex and money in these two works\" and \"talk about the use food and drink in these works\" were two of the choices given for the for paper topics throughout the semester.  What makes all of this worse is that the works we read are amazing and are not taught in other courses (Duras, Handke, Lispector, Trevor). In general, this class was more trouble than it was worth. \nWorkload:\nAbout a book a class (short works), in-class midterm (10 IDs, 1 essay about how one of the quotations from the IDs represents the larger work), paper (8-10 pages) (horrible topic), take home final exam (5-7 pages) (another horrible topic)\n"
        },
        {
            "course_name": "Story Writing",
            "review_date": "May 16, 2006",
            "review_content": "\nI have to disagree with previous reviewers and say they sound like brainwashed kiss-ups anyway.  Professor Gordon is not that great.  First of all, I found her ideas about writing to be narrow and old-fashioned.  All the model authors she had us read were earlier 20th century Christian white ladies (she has a strange \"mission\" to have people read these forgotton white ladies who have been scratched off reading lists in favor of South American writers and other such \"diversity\").  She doesn't care if this writing doesn't actually represent or reflect everyone's experience.  She also has a narrow concept of what makes good writing and is obsessed with paragraphs of boring visual description...she doesn't understand why such fiction has become so unpopular!  Lastly, I found her personality to be prickly and unfriendly.  She's definately not understanding.  There is a group of very similar people who think she's \"brilliant\" and take her class every semester, but if you have any of your own diverging opinions, stay away.  I think some people were alienated from participating in the class and she doesn't care.  She is arrogant as previous reviewers have noted. \nWorkload:\n2 stories to be presented for the class/semester.  I would suggest bringing them to her office hours in advance, since she has strong opinions and will tell you the story you should work on and how regardless of any of your own preferences.  \n"
        },
        {
            "course_name": "Story Writing",
            "review_date": "March 23, 2005",
            "review_content": "\nShe more than deserves her reputation. She is a great mentor, a great professor, and a great writer with a discerning eye. She is honest and good at teaching writing, which is often not the case for many published authors. \nDefinitely, absolutely take a class with her if you can.\nWorkload:\nMore than reasonable\n"
        },
        {
            "course_name": "Story Writing",
            "review_date": "January 17, 2005",
            "review_content": "\nI absolutely adore and worship this woman. Brilliant, brilliant, brilliant. The class is a bit intimidating, as each week 2 students submit a story to be critiqued by the class the next week, but Professor Gordon is hilarious and wonderful. Only take this class if you are a serious writer, but if you are you will learn a ton and come out a better writer.\nWorkload:\nTwo stories submitted throughout the semester, an author imitation and analysis, and author parody and analysis, and a final portfolio of 40 pages\n"
        },
        {
            "course_name": "Women and Modernism and the Modernist Woman",
            "review_date": "July 19, 2004",
            "review_content": "\nI want to hug Prof. Gordon.  She is a caring, articulate and intelligent radical woman.  She was a fair grader who always provided detailed, insightful comments that referenced each paper's specific strengths and weaknesses. She was lenient about due dates and unconcerned about people handing in papers late.  Readings were on the whole interesting (both the books and critical essays) and boring pieces could be skimmed or skipped altogether as assignments were pretty open ended.  Most of class was devoted to discussion and everyone was expected to participate. When she did lecture she was succinct, organized and offered interesting but not mind-boggling commentary.  I still enjoyed the course immensely which didn't altogether have to do with prof. Gordon; the class was full of smart, nice students who had great commentary.  I definitely give W&M; the thumbs up.\nWorkload:\nmultiple short 1 page response papers, two 6-8 page papers,  a final exam, and an in-class presentation.\n"
        },
        {
            "course_name": "Middle Fictions",
            "review_date": "September 04, 2003",
            "review_content": "\nProfessor Gordon is wonderful -- I only wish I had a fraction of her passion or her knowledge about literature! (Considering she seems to have read every book ever written....) Her lectures are always engaging, as she more than encourages a simple analysis of a work of literature, but she tries to bring in bits about the way the work was actually written (the writing style, etc.), as opposed to a simple thematic or character analysis, and draws your attention to things you never would've picked up about the book on your own. She lectures as though she were writing it all down -- vivid, descriptive, almost poetic prose, that's really just a joy to listen to. And she really gets in to each one of the authors/works -- once she was reading a passage aloud in class and she put down the book right in the middle; the TA had to finish reading for her because she had literally burst into tears over the impending outcome of the story! Yeah, I guess one small negative aspect about the class was her choice of work -- all great authors, but every single story at the very least bordered on depressing; I don't think we read a single work in that class where at least one of the main characters didn't die! It's too bad, though, that Prof. Gordon is on sabbatical for 2003-2004.\nWorkload:\nNot bad. About 50 or so pages of reading per class. Midterm (easy), 8-10 page comparative essay (Which she makes appear undaunting -- She arranged for an extra class session so that everyone would learn how to do close readings and analysis of texts. Though she stressed she would grade on the quality of writing as well as the content, if you bring your rough draft to her office hours, she'll practically write your introduction for you so you know exactly what she wants.) But as the previous reviewer said, the open-book/open-notes final exam was agony -- I'd prepared a good 10 pages just of OUTLINES (without.incorporating quotes); I could've easily spent six hours (or more) just writing everything I wanted to say -- as it was, it took me well into the next period, and I missed a half hour of my subsequent exam!\n"
        },
        {
            "course_name": "Middle Fictions",
            "review_date": "May 16, 2003",
            "review_content": "\nSince there aren't any (or there are very few) classes on shorter works of fiction, I found this one to be refreshing.  Gordon herself is engaging and at times pretty comical.  However, she does have a bit of an ego.  She expects people to read and encourages class discussion.\nWorkload:\nSince the works are short (ranging from short stories to novellas), the reading wasn't heavy at all.  Easy midterm (obvious IDs and an easy essay) but more difficult term paper--she expects good writing.  The final was torturous--she gave us the topics in advance so we \"wouldn't have to worry about it\"--however, since we were allowed to basically write the entire essays out beforehand, it ended up being a take-home that you had to copy over into blue books.  People ended up writing extensive papers (we're talking LONG, typed 10-pagers) and copying them into bluebooks for up to 5 hours (can you imagine writing for that long?)...talk about physical pain.  Bad judgment call on Gordon's part--should have just made it a take home!\n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "May 13, 2002",
            "review_content": "\nYeah, her lectures were interesting. She was amusing on occasion. I definitely don't deny that she is intelligent and nice and all of that. My main problem was her constant name dropping of authors i had never heard of but was supposed to be familiar with, and then me missing the subsequent connection having to do with whatever obscure author that may have been. I think the books are fantastic, but i really would have liked a more useful midterm, paper, and final. I may be odd, but i usually enjoy having to think when i write a paper or an essay on a test, and if there's no thinking or effort involved, it's desperately boring. i took the final today, and it was the most boring hour and forty five minutes i have ever spent in my life. i don't care that it was perhaps the most \"here's an A. no, take it!\" final i've ever taken; it was completely purposeless and stupid. I think instead of thinking that the professor is so great, people might want to pay attention to the fact that the authors are so great, but then again maybe a great professor is one who seamlessly makes it seem like virginia woolf's genius is her own, even thought woolf was completely nuts. \nWorkload:\ni hated the easiness of it all. sometimes i don't know what the point was. paper, i wrote it one day and got an A, midterm, easier than pie, final, given to you on a silver platter. \n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "April 30, 2002",
            "review_content": "\nAbsolutely amazing. I usually think it's kind of cheesy when students say \"Oh, this professor was so inspiring,\" but I have to say that it is the truth about Prof. Gordon. I adored this class. Lectures were never boring: always interesting, dynamic, enjoyable, and she has a great sense of humor. Prof. She is also very kind and approachable. Gordon made me appreciate literature and reading in a way that no one or no class has ever before. I often find myself sitting there in awe of what she is saying. I would take a class with her again in an instant--no matter what the topic was. We're reading sections of Ulysses, and I will probably actually follow her advice and go read it in its entirety on my own sometime--she has had that sort of effect on me. So my advice to you is: go take a class with Prof. Gordon!\nWorkload:\nQuite manageable--just don't get behind in the reading. We read a lot, but we are assigned manageable chunks of each novel for each class, so it's not that bad. Easy midterm, 8-10 page paper, final (we are given the questions ahead of time, we choose one, can bring any or all notes/preparation with us). \n"
        }
    ]
}