{
    "prof_info": [
        {
            "prof_name": "Luca Carloni",
            "prof_id": 4212,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Computer Architecture",
            "review_date": "December 31, 2011",
            "review_content": "\nProfessor Carloni is a very nice, approachable and friendly person BUT, he sucks at teaching. Computer architecture is a basic course and he failed to teach it effectively. Most horrible thing is, it's too hard to understand his weird accent. At the beginning of the course, I thought that it's my problem that I don't understand his lecture clearly but eventually I came across many students who struggled to decode what he says in the class. I will give him an A+ for his friendly and welcoming behavior but unfortunately he fails to be a good teacher. \nThe good news is, if you work hard then you can manage to get good grade. The TAs were awesome during my time. If you have Marcin as a TA, then make the best use of him. He is good at explaining the concepts. Another bad part of this course is, Carloni starts talking about advanced topics during the second half of the course and he terribly fails to explain the intricacies of his lecture slides. He also assigns a lot of research papers for reading but eventually he doesn't give any questions in the exam from those topics. So, it's not a big deal.\nIf you work a bit hard, then you can manage to get a good grade and will have a good idea about basic computer architecture. However, you will feel that the you could do much better if you had a good professor! \nWorkload:\n5 homeworks, one project, one mid term and one final. Homeworks are not so time consuming and level of difficulty is intermediate. \n"
        },
        {
            "course_name": "Computer Architecture",
            "review_date": "June 05, 2009",
            "review_content": "\nThis is an excellent basic architecture course where you become familiar with all the architectural aspects of modern computers, which any CS student should be familiar with.\nBy taking this course you will gain some understanding of what the difference is between newer and older processes, why various cache organizations have various advantages, why memory performance is so ever important and you'll get a hint of issues and challenges related to SMP.\nBesides just learning the material and getting familiar with terminology you will get an idea of how to evaluate performance of different architectures.\nThe instructor is very dedicated and approachable and does his best to keep you involved when going through the some 50 slides for each lecture. The number of slides sounds like a lot but reducing the number would mean to compromise with the material learned.\nProf. Carloni does a great job making the subject interesting, up-to-date and he is not over-prepared in the sense that he thinks up the solutions to the questions he asks in class, which gives you time to follow his thoughts.\nThe homeworks are fine, but a little concentrated on the calculational aspect of things and some slightly more \"getting to know things\" homeworks would be appreciated.\nWorkload:\nThe workload is not all that bad for a Columbia CS course. Don't get me wrong, it's a core course which will take a lot out of you, but for the amount learned it's pretty decent. Watch out though, the final project can be quite demanding and I think the instructor should drop the last homework to allow more concentration on the project.\nThere is also a fair amount of reading related to this class. I took the class together with OS, which was kind of a pain, but as Prof. Carloni told me before taking the class \"you can do it if you're a good student\".\n"
        }
    ]
}