{
    "prof_info": [
        {
            "prof_name": "Alberto Mancinelli",
            "prof_id": 876,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Science",
            "review_date": "May 21, 2004",
            "review_content": "\nMancinelli is a character, no doubt about it.  His heavy Italian accent takes some getting used to, but some of his exclamations (such as threatening to whip students with a \"nine-tailed cat\") are amusing.  The real problem is he teaches from slides and only deviates to start ranting.  I care deeply about environmental devastation and found some of the material very enlightening, but must admit his presentation leaves a lot to be desired.  \nWorkload:\n2 regular exams (only the one with the higher grade is counted) and a final based on class slides, a textbook, and a compendium of statistics (ye gads!).  Questions on the exams range from the insanely easy to the unbelievably difficult.  Not easy by any means, but an 'A' is possible if you read, read, read.\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "March 15, 2004",
            "review_content": "\nactually, i did do all the reading a day or two before the test, did the practice tests the day *of* the test, and i got myself an A. i'd have to say that's an easy A by any means. and yes, i do have a photographic memory. other than that, he's incredibly boring, and i fell asleep every class just about. i spent the entire time writing random thoughts in my notebook and watched the other people draw the little graphs and diagrams he put on the overhead. i did learn some stuff about the environment that was useful, and i got to look at a lot of pictures of cartoon animals. you gotta love that.  \nWorkload:\npractically  none. \n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "August 27, 2003",
            "review_content": "\n(This review may be boring, but itÂ’s true) \nThings that we already know from other reviews: ItÂ’s true.  HeÂ’s a spirited Italian guy that teaches from slides and yells about American over-consumption.  ThereÂ’s a lot of statistical data about environmental issues presented, and you need to know almost all of it.  Some find it interesting (myself included) and others find it boring.  The tests are nitpicky, but they are the only things you have to do in the course.  Attendance, although helpful, is not necessary\nThings we should know but may not know yet from other reviews: Although a good grade is possible with a bit of work, itÂ’s not an easy A.  Mancinelli says that he absolutely does NOT grade on a curve, which means As are hard to come by unless you ace the exams.  The Â“light reading that can really all be done the day before the testÂ” that very scholarly reviewers recommend wonÂ’t get you a decent grade unless you have a photographic memory; is probably one of the main reasons that most of the students in the section that I took received horrible grades on the first test. \n In any case, I highly recommend the course for anyone truly interested in the environment.  Mancinelli is eccentric but also effective at teaching his material.\nGrade GrubberÂ’s HowTo: (This holds true only if the course format hasnÂ’t changed from his past course)\nThere is one textbook, one supplemental text (called the ESIS), and a study guide for the course.  Check the ESIS out of the Env. Sci. library (reserves) and photocopy it immediately Â– do not underestimate the ESIS!  Get the ESIS back to the library within an hour or they may be fine you.  After you flip through the ESIS, get the study guide and highlight all of the correct answers to the practice tests (do not take the tests, just highlight the correct answers Â– be careful!) and memorize them.  Do the same with the practice tests that he will give to you.  There are 3 multiple choice exams (two smaller exams with 80 questions each, and a 120 question final) only 1 of the 80 question exams count; take them both anyway as the first exam will quickly familiarize you with the general exam format.  Use the two smaller exams, along with the ESIS, book, and study guide practice tests to study for the final exam.  If you see conflicting data from the textbook and ESIS, use the ESIS data.  Do all of this *without slacking off* too much, and you will do very well in the course.\nWorkload:\nLight: 3 exams (be prepared for them!)\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "July 04, 2003",
            "review_content": "\nHard to follow in lectures but the class still managed to generate an interest in environmental sustainability within me. I honestly have changed my daily habits now that I understand the effects one person can have on the fragile environment.\nWorkload:\nRead the book and you'll get an A in the class. Midterm/final multiple choice questions taken DIRECTLY (let me repeat: DIRECTLY) from the textbook. No papers or section\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "August 30, 2002",
            "review_content": "\nI have to say that I absolutely adored this class. It was wonderful. Of course, I didnt always feel this way. My mistake was actually attending the first four classes. First of all, his accent makes him impossible to understand (Im Italian and I caught maybe one word out of five). Second, his often insane rants about environmental issues really detracted from his teaching. From what I understood of them, he blames America for just about every environmental problem ON THE WHOLE PLANET! Yeah, the US isnt so great, but there were times we thought he might attack someone in the front row. Finally, he teaches from slides. That means nap time, especially when the class is taught in 501 Schermerhorn. But then I stopped going to class. I showed up for the midterm and the final, did all the readings the night before each, and got an A. It was beautiful. A word to the wise: if you are crazy, or if you have a loud roommate and need the extra sleep and decide to show up, turn off your cell phone. One day he will carry through with his threat to crush ringing phones under his feet.\nWorkload:\nOne of two tests (take both, he will only use the higher grade) and a final. All multiple choice, very nitpicky, but not hard at all. One textbook, a little dry but better than many out there.\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "January 20, 2002",
            "review_content": "\n\nWorkload:\nLight reading that can really all be  done the day before the test. No  homework.\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "January 02, 2002",
            "review_content": "\nI thought this class would be an easy one to fulfill the Core science requirement. The material itself isn't so bad...it can actually be interesting because it's related directly to current events. It's Mancinelli that makes the class unbearable. His wild rants and ravings in his thick accent makes these supposedly \"activist\" spcheels incomprehensible on so many levels. I decided I was wasting my time and I never went to class after the first week. I passed just fine...I suppose those who have a passion for old Italians yelling and a textbook full of statistics to be memorized (for example: the test will ask what ratio of humans will be both poor and malnourished in 2050 in comparison to first world populations in 2000...you get my rant...i care, but not enough to memorize percent signs and numbers), can get really good grades.\nWorkload:\n3 tests that are multiple choice and ridicuously nitpicky\n"
        }
    ]
}