{
    "prof_info": [
        {
            "prof_name": "Carmen Jimenez",
            "prof_id": 12621,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Laboratory in Screenwriting",
            "review_date": "April 11, 2013",
            "review_content": "\nCarmen is a gem of a professor. I rarely use that word, and I can think of no better term to describe her. She is witty, she is caring, she is involved. She knows how to direct a class and keep people engaged. This is my second screenwriting class at Columbia, and it is by far my favorite. While the people in the class were fantastic, I believe that you would be hard-pressed to find a bad group in a screenwriting class-- it just doesn't attract that personality. Nonetheless, the skill levels were extremely varied, with maybe 10/12 students taking the class because it is a major requirement and about half having never taken any writing class whatsoever. As such, Carmen has to teach to not only the more experienced writers who wanted to advance their skills but to the beginners who did not know how to function within a screenplay. While I am writing this review with another three weeks left in class, the leaps and bounds by which each student has grown is nonetheless evident. \nShe begins each class with a screening, and we spend roughly the first hour watching a short film (or a few, depending on the length), then discussing the successes and flaws of each film, as well as its narrative structure. Many films are by Columbia students (MFA and former undergrads alike). Once, she brought in her friend-- a screenwriter and director-- to show us his movie and answer questions.\nIn the second half of each class, we discuss each other's screenplays. We were divided into groups of six, and while we were supposed to do six people each week, not everyone has handed scripts in on time, so it's been more like four a week. For the shorter scripts, we read them aloud and then critiqued them. For the 8-12 pagers, we jumped right into critiques. \nAgain, Carmen is fantastic at guiding the discussion. Some students focused too intently on the visual aspects or marketability of the scripts; some discussions veered into arguments about a minor, irrelevant detail; some comments were strictly a matter of opinion. Carmen was able to guide each of these to help the writer and to teach the class. When a comment focused on the editing and final cutting of a piece, she was able to bring it back to the writing while still justifying the opinion. When an argument was essentially irrelevant to the script, she would let it play out for a little but then reel the conversation back to the main points. When a student gave his or her opinion, and when this opinion was either too vague, too harsh or not felt by the other students, Carmen would justify the opinion and then offer the writer an opposing view (\"Yes, this is one way to look at it, but also...\"). When a comment was too vague, she pushed students to narrow down their thoughts and explain what was bothering them about a script. \nI would highly recommend this class to anyone as long as Carmen is teaching at Columbia. For students too intimidated by Marie Regan or not experienced enough for Guy Gallo, I would push them to this course. It has been an amazing experience, and I wish I could take it again. \nNOTE: You must have taken Script Analysis first. Priority given to film majors, specifically seniors and juniors. Many sophomores and non-majors were turned away (though one sophomore major was in our class, I believe).\nWorkload:\nThere are readings every week. For the first time in my life, I actually wanted to do the readings and enjoyed them. Rarely are they long (roughly 5-10 pages a week total) but they are the most informative, most important readings I've ever done. You will be able to succeed in the class without them, but as a screenwriter and movie maker, you will want to read them.\nWe have a number of scripts due: one 1-2 page script, one 3-5 page script, two 8-12 page scripts, one rewrite of an 8-12 pager. You will have enough time to do these, you will have advanced warning of your due dates. It's screenwriting, you're not doing an essay. Many people went over the limit, it's not the end of the world.\nThere is a writer's notebook and a line breakdown due. Writer's notebook is essentially presenting your storyboard with materials (photos, songs, etc.) that keep you inspired on your piece. Line breakdown is a summary of a script (we did \"Thelma and Louise\") using one sentence to describe each scene and noting the act turns, midpoint and dramatic question.\nWorkload is extremely manageable and very fun. \n"
        }
    ]
}