{
    "prof_info": [
        {
            "prof_name": "Kairos Llobrera",
            "prof_id": 2410,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 16, 2005",
            "review_content": "\nKairo Llobrera sucks.  I've heard worse stories, so I'll give him credit for not being the worst that you can get, but he's pretty bad.  The guy is obsessed with race and is definitely further to the Left than even your average Columbia student.  He asks too much of the students on his rough draft comments, though I guess he's trying to be helpful.  He's not hostile, and pretty approachable, so I'll give him that, but I wouldn't classify him as a particularly engendering instructor.\nWorkload:\nNormal UW workload.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 16, 2005",
            "review_content": "\nI found Kairos to be somewhat of an embarassment to the University Writing program. He didn't know how to spell \"approve\" when writing on the board. Although he put up a front of equally weighing both sides of every argument, he was a) actually very biased (pro-Edward Said's arguments) and b) actually told me to change the argument in one of my papers because it might offend people. For the record, several of the students in my class personally confronted me to say that my paper was not, in fact, offensive. The discussions were often painful, in the sense that only three to five people actually ever participated. Only myself and one other person seemed to actually have a real interest in the subject matter, in writing, and in participation, but this was not reflected in our grades. Kairos also commented on one of my papers that my carelessness was offensive, referring to the fact that I had omitted page numbers and failed to alphabetize the authors in my works cited list, proceeding to downgrade me fairly harshly because of what he saw as poor presentation. Kairos' conformity to the system is upsetting and stifling, and I would not recommend his class if you desire any kind of originality or creative freedom. \nWorkload:\nVery average, which is why it was easy for a lot of the class to check out early on. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 12, 2005",
            "review_content": "\nWell, most of us don't walk into UW with the feeling that we're going to get much out of it.  I went in with that feeling, and I still feel like I didn't get too much.  Kairos followed the curriculum (which is boring as hell) to a T and was sort of boring and dry.  That said, you probably will do better than you think.  You have to incorporate all of his comments and I suggest meeting with him a second time- he tells you what you want and if you do it, your grade will reflect.  I had B range papers on my first two papers, and A ranges on the second two and I ended up with an A-.  I'm not complaining with that...\nWorkload:\nTypical UW workload.  Instead of the 5% counting towards participation it goes to some close reading.  4 papers bunch of short writing exercises and reading.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 19, 2005",
            "review_content": "\nOk so most people in the class didn't really adore Kairos, but I  liked him.  He is laid back and a nice guy.  He was really willing to help students formulate ideas and work on papers in paper conferences.  As far as grading....I didn't think he graded unfairly at all....the lowest grade I got on a paper was a B+.  I think some found the class painful because few of our class discussions were really ground breaking...but that has a lot to do with the type of people in the class (there weren't many talkers in the class....and more often then not there was little debate in the discussions because everyone agreed with each other).   Okay sometimes the hw assignments were a little annoying, but that has more to do with the structure of the class, than the prof.  Overall I would say that Kairos is a good guy and a fairly good teacher to have for University Writing.  \nWorkload:\nshort writing assignments and reading due in each class + 4 papers---basic UW workload\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 10, 2005",
            "review_content": "\nFrom the first day of class, I knew that something was wrong with this guy. He played us Aretha Franklin's Respect as a way to lure us into thinking that he was cool. Sadly, everyone in the class could tell right away that we had gotten stuck with a bad UW teacher. \nKairos' class was never interesting. He speaks very slowly and isn't very articulate, which was frustrating. But worst of all, he seemed to grade all our papers on whether or not he agreed with our thesis. If he disagreed, you wouldn't get anything higher than a B. If he agreed, you'd only get by with a B+ or A-. \nWorkload:\nSame UW workload. Bad grading.\n"
        }
    ]
}