{
    "prof_info": [
        {
            "prof_name": "Jill Muller",
            "prof_id": 1513,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 30, 2008",
            "review_content": "\nThis was the best class I had in years, and it is entirely due to Professor Muller. My words cannot express enough praise. She did a terrific job in getting us interested in the texts, her lectures were incredibly insightful, and she brought the entire class together as one in discussing the texts. I will forever remember Lit Hum with Professor Muller. She is irreplaceable.\n"
        },
        {
            "course_name": "Irish Drama: Wilde, Shaw, Yeats, Synge",
            "review_date": "April 21, 2008",
            "review_content": "\nAlthough Prof. Muller may not have published two hundred books, although she may not be among Columbia's famed and elite literati, she is one of the most amazing professors I have ever had.  She is not only one of the most helpful professors when it comes to undergraduate writing, she is incredibly approachable and will do anything to ensure that she treats every student in a respectful, intelligent way--something NOT necessarily common in English seminars.  She is incredibly nice, incredibly knowledgeable, and incredibly willing to make the seminar what the students want: a fun and intelligent discussion of the plays at hand.  She is truly one of Columbia's hidden gems, working daily not only to guarantee a top-notch English Seminar experience, but also to teach in a relaxed, engaging, and not at all pretentious manner.  This is truly one of the most rewarding and fun classes and professors you could experience in the Columbia English department.  \nWorkload:\nCompletely manageable: one play and one critical article every week, two in-class presentations, a midterm essay (6-8 pages), and a pretty typical seminar paper (10-12 pages) that all receive individual, in-class discussion and workshopping.    \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 02, 2007",
            "review_content": "\nProfessor Muller is one of the finest instructors at Columbia; if you have to take Lit Hum, take it with her and no one else.  She is witty, gracious, firm, generous, knowledgeable, personable, and cares deeply about her role as a teacher.  She made these texts come alive for me in ways I wouldn't have thought possible, and I cannot wait for the Spring Semester.  One of Columbia's finest, bar none.\nA note on the workload, as long as you've actually done the readings, all the work is relatively easy.  She's a tough but very fair grader, so just do you homework and the grade will come.\nWorkload:\ntwo papers during the semester (6-8 pages), midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 02, 2007",
            "review_content": "\nProfessor Muller is one of the finest instructors at Columbia; if you have to take Lit Hum, take it with her and no one else.  She is witty, gracious, firm, generous, knowledgeable, personable, and cares deeply about her role as a teacher.  She made these texts come alive for me in ways I wouldn't have thought possible, and I cannot wait for the Spring Semester.  One of Columbia's finest, bar none.\nA note on the workload, as long as you've actually done the readings, all the work is relatively easy.  She's a tough but very fair grader, so just do you homework and the grade will come.\nWorkload:\ntwo papers during the semester (6-8 pages), midterm, final\n"
        },
        {
            "course_name": "Lit Hum/General Studies",
            "review_date": "December 16, 2006",
            "review_content": "\nThis class has changed my life!  No kidding.  I cannot imagine these readings without Professor Muller's incredible teaching.  She loves her job, loves the texts, and loves participating and watching students engage with the material.  For me:  taught by Prof. Muller, Lit Hum has become the art of exploring the human being through literature.  I am planning to read next semester's texts over winter break.  What does that tell you? \nTake her class.  Any class she offers.  Climb over seventeen of your best friends to do it, without apologizing.  If I wasn't so moved by her teaching, I would try to keep her a secret.  But it's just not right to do that to the world.  Get on board.    \nWorkload:\nReading for Lit Hum is intense.  Look at the Core website and start reading the Homer epics before the semester starts.  Prof. Muller is encouraging and fair in her grading, and accessible.  See her before (and during) your paper writing process.  She will not let you down!  2 papers; mid-term and final.   \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 17, 2006",
            "review_content": "\nI agree with the previous reviewer.  Professor Muller was absolutely a delight to have.  She always came to class well-prepared, and she taught the class in a way that I found very effective.  She usually introduces a work by giving a little bit of background information, but then the rest of the time is structured around a discussion, which she is able to manage well so that it is always interesting and informative, often including her own tidbits here and there.  When I first saw the Lit Hum syllabus, I doubted the ability to really analyze so many texts in so short of a time frame.  With Professor Muller, however, I always felt as if I walked away from class learning something meaningful.  She also is very friendly to the students, and encourages them to announce when they have an event such as a concert or a play.  She also looks for (optional) outside of class activities that supplement the reading.  As a freshman coming to Columbia and not knowing anyone, I especially appreciated the little things she did to foster friendship among the students as well as her teaching.  Overall, Jill Muller is one of the best Lit Hum teachers I think you can get.\nWorkload:\nShe didn't require any annoying assignments or pop quizes to prove you read the works.  Instead she handed out a few pages of quotes and reccomended that you jot down the page number and speaker when you find it.  Far from being tedious, these were actually very helpful on the midterms and finals.  She's very understanding and she knows, for example, that during midterms and other high-stress periods people may be behind in reading.  However, despite what may be called leniency, almost all the students were consistently prepared.  I think this was a combination of personal respect for her and also a desire to participate in the interesting discussions she led.\n"
        },
        {
            "course_name": "Studies in the Novel: Dickens",
            "review_date": "April 08, 2006",
            "review_content": "\nI found Prof. Muller's summer Dickens course a much-needed respite from monotonous lectures and arbitrary grading standards.  She clearly explained her grading criteria, her expectations, and best of all, drew the entire class into detailed discussions of the assigned reading.\nSpeaking of which, for each lecture we were responsible for writing a 1-2page \"journal entry.\"  This usually boiled down to a position on some interesting element of the reading, which would then be shared with the class.  I found this an excellent method of stimulating discussion with my classmates.  Many people, myself included, used one of their journal entries as the basis for the final paper.\nI highly recommend Prof. Muller as stimulating, thought-provoking, knowledgeable, and very accessible instructor.\n\nWorkload:\nThree fun books to read, a 1-2pg journal entry per class, an 8-10pg paper, and a final exam.  Very fair grading (A's are possible, but not guaranteed).\n"
        },
        {
            "course_name": "The Novel, Dickens   summer 2005",
            "review_date": "March 28, 2006",
            "review_content": "\nI am a senior, graduating in May of 2006. Although I have numerous regrets from my time at Columbia, not taking another class with Professor Muller probably tops the list. \nProfessor Muller is a truly rare teacher, able to actually evoke interest in every student in the class room, while still teaching an interesting and informative class.\nAssignments were both interesting and relevant, and nearly every lecture was accompanied by handouts associated with that weeks reading. Attending lecture actually increased my understanding of the class readings, as well as providing an overall enjoyable experience.\nReviews regarding Lit Hum definitely extend to Dickens! Regardless of your interest in Victorian literature (and you canÂ’t get much less interested than I was before the summer of 2005), this class comes HIGHLY recommended. \n\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 24, 2006",
            "review_content": "\nWhat a privilege it has been having Professor Muller as my Lit Hum instructor. Coming to Columbia with virtually no background in the so-called Great Books, Professor Muller immediately put my mind at ease, constantly going out of her way Â– both in and out of the classroom Â– to make sure her students left well-versed in the western canon.\nProfessor Muller always came to class prepared with an extensive outline. She would introduce each text with background information that made the oftentimes-extensive reading a breeze. Her lessons were seemingly cumulative in the sense that she always found ways to connect one text with the next, as her students left each class with an expanding repertoire of classics, eventually able to place the works in the context of contemporary western society. Following her introductory lectures, she would let the class loose in a seminar, though always grounding the discussion back to the relevant text, so not to let tangentÂ’s run wild, as can often be in the case in many of my other core classes. I found that because so many of the students in MullerÂ’s class became so comfortable discussing the material in class after only a couple of weeks, many became friendly outside of the classroom Â– a rare feat at a university oftentimes lacking community.\nStudents learn on the first day what to expect throughout the duration of the course, and Professor Muller makes sure that all are well prepared for all future assignments long in advance. Her daily ID passages not only simplify readings, but they also serve as incredible study guides heading into the departmental final, which, mind you, turned into a somewhat enjoyable brain exercise once I realized how so much seemed so familiar, and while the exam itself was new in content, Professor Muller covered literally everything at some point in the course, so nothing seemed out of the ordinary.\nPerhaps most importantly, Professor Muller genuinely cares about the success and well being of her students, probably more than any other instructor IÂ’ve had at Columbia. She always encourages her students to visit during office hours, and adds countless hours just prior to paper deadlines so she can review drafts and critique student progress. Her comments challenge her students to think beyond the text and, at least for me, led to some damn good papers.\nIf you happened to land Jill Muller as your Lit Hum instructor, consider yourself extremely fortunate. If not, do everything you can to switch into her section.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 14, 2006",
            "review_content": "\nI could go on about Professor Muller's erudition, but what I like best about her class is how much she loves teaching it. I am by no means a needy student, but I have to say it is a joy taking a class with someone willing to work for my education. She shares knowledge freely where other professors are greedy. She encourages questions, and is readily available to answer them. She is kind where other professors are impatient. I have learned so much from Professor Muller this year. \nShe lectures only to introduce each text, providing historical context and primary themes, after which the class is run mostly like a seminar.  While this format is risky at the introductory level, Muller skillfully manages all discussion, and is always the most active participant among us. Students who blather aimlessly are gracefully reigned in, and students who are on the right track with an idea are always effectively encouraged. As a result, a real sense of community and civil debate has developed in our section over the course of the year. \nMuller's dedication to office hours is also astonishing. She will actually read an entire paper the day before it is due, thoroughly critique it, and then treat it as brand new the next day when you hand it in. Her margin comments are endless, and they really inspire me to think carefully about my writing, and also about the way that I read. \nMuller is the best. I think she was born to teach. \n\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 01, 2004",
            "review_content": "\nWHAT A GODSEND! Having had Jill Muller for only the second half of LitHum, I can truly say she rescued me from Core Curriculum apathy.  Lit Hum went from my least favorite class to one of my favorites. She treats students with dignity and classes are open discussions with just enough structure to prevent wild tangents and rants. Approachable, brilliant, fair grader who goes well out of her way to have extra office hours where you can discuss just about anything. If you get Jill Muller as an instructor, consider it your lucky year.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 19, 2003",
            "review_content": "\nProfessor Muller is wonderful,  thank your lucky stars if you have her. She is not only is one of the nicest people here, but she really gave everyone in my class personal attention, which is not something you can say for a lot of professors. Go and talk to her; she really helped me organize my papers and improve my writing. She is also very responsive to emails and will make extra time to meet you if her office hours don't work for you. She hands out id passages for each reading which definitely helps to keep track of the readings and also (this is very important!) help for preparing for the exam. I'm a SEAS student and yet I can honestly say that I really enjoyed this class a lot. As the other person said before, she really cares!\nWorkload:\n2 papers (i think), midterm, final; very fair grading\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 25, 2003",
            "review_content": "\nI am a rising senior, but seeing Jill Muller's name back on the class directory made me remember how amazing her class was! Our whole class begged her not to leave Columbia, so take advantage of her return if you can. Lit Hum still ranks as one of my favorite classes at Columbia. Most importantly, Jill made the books I assumed to be old and boring (Illiad etc.) so fascinating that i found myself wanting to read Dantes and Aristophones outside of class. Always good discussions while still being organized, and she gets everyone involved.   \nWorkload:\nusual, fair grader\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 02, 2003",
            "review_content": "\nJill Muller is amazing!  As far as understanding, caring and thoughful teachers go, Muller is easily in the top 1%.  I never got a solid \"A\" in her class, but I learned far more than I thought possible.  She was easy to meet with, and she helped me improve my writing over the year so that, by the time I left lit hum, I felt far more confident about my writing skills thanks to Jill's help.  She also fostered a great class atmosphere.  I am still extremely good friends with some of the people in our lit hum class thanks to our class field trips.\nOn a sidenote: I had a concert where I sang and Professor Muller came! I really needed support, and it was so nice to have someone other than my parents there in the crowd.  She really does care!  \nWorkload:\nTwo papers a semester; a midterm and a final.  Very fair grading.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 28, 2003",
            "review_content": "\nProfessor Muller's LitHum class was one of the greatest classes I have had at Columbia. She is very organized and every class session has a handout with ID passages that helped focus on the reading and study for the midterm and final. Most importantly, Professor Muller is an awesome person, and made our LitHum class really informal and friendly. Try and switch into her section!!!!  \nWorkload:\n2 paper, Midterm and Final. Not too bad at all, compared to other sections. Grading is fair.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 12, 2003",
            "review_content": "\nProf. Muller is by far one of the best professors I have had and though this has been said before, in this case it most truly applies that Prof'. Muller's class validates the Columbia core experience.  Prof. Muller provides important background and intelligent framework to guide class discussion. \nShe organizes discussion from handouts of important passages from each of the books, which makes studying for the final much easier.  While in general passages have the potential for monotony, under Prof. Muller's guidance they help to strike the perfect balance between close reading and recognition of all important themes as well as being a successful departure for relevant class discussion. Especially in a course like lit hum, where a teacher has no control over the specifics of the curriculum, she seems to have a vast knowledge and a personal connection with each of the texts. She grades most fairly offering important criticism that improves her students' writing more so than any L& R class ever could. \nSeize the opportunity to take any class she teaches!!\nWorkload:\nMidterm, final, 2 papers (5-7 pages)\n"
        }
    ]
}