{
    "prof_info": [
        {
            "prof_name": "Haruo Shirane",
            "prof_id": 281,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Visual Culture - The Tale of Genji",
            "review_date": "January 17, 2005",
            "review_content": "\nProfessor Shirane co-taught this class with Melissa McCormick from the Art History Department. He is a very sweet man and a brilliant scholar--most of the books in English on the Tale of Genji are by him!--The class itself was a little disorganised and lacked focus, but I don't think it was necessarily Prof. Shirane's fault. He freindly if you go to his office hours and is very helpful if you have questions about paper and assingments. I wish I'd taken a class where only he was teaching.\nWorkload:\nA presentation, two (very) short papers, and a final paper.\n"
        },
        {
            "course_name": "Lit. & Cult. Theory East & West",
            "review_date": "August 02, 2002",
            "review_content": "\nJust to supplement the last review: Prof Shirane's specialization is premodern Japanese literature (poetry in particular, I believe). Therefore he is not the best person to take that class with if you want to study (Western) theory, not at all because of his lack of knowledge and more because of his general lack of interest in that subject. You may find Prof Shirane as apathetic about, say, Derrida, as you are, and that one token lecture (or perhaps not even a whole lecture) on Deconstruction may seem as much an obligation for him as for you. (If you are an EALAC major, you don't have a choice unless you have the foresight to ***CONSULT CULPA*** and take it with David Wang.) To be fair, though, Prof Shirane is very nice and approachable, very dedicated to his students, not to mention brilliant in his own regard--I am sure you will learn a lot from him. But if you serious about theory, do the logical thing: walk over to Philosophy and check out the English department offerings.\n"
        },
        {
            "course_name": "Literary and Cultural Theory: East and West",
            "review_date": "December 31, 1999",
            "review_content": "\nThe syllabus is overly comprehensive, allowing only a day of discussion for difficult topics such as deconstructionism, freudian theory, post-colonialism, etc. The readings for each topic are not necessarily the most relevant, but always very difficult, requiring at least 3 hours of prep for each session. Prof. Shirane not only takes attendance every class like an elementary school teacher, he calls on students at random, so the reading is necessary. Unfortunately, his lectures and questions are nothing more than a synopsis of the reading, neither offering nor stimulating independent thought. And beware: if you reverse the situation and ask him a question he gets flustered and brushes the question off for later. Class discussion, the one glimmer of hope that sparks up every once in awhile, is quickly squelched since he's too busy rushing through his summaries.\n"
        }
    ]
}