{
    "prof_info": [
        {
            "prof_name": "Gaurav Misra",
            "prof_id": 1622,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "tennis",
            "review_date": "May 09, 2014",
            "review_content": "\nIf you have the opportunity, you should absolutely take Gaurav's Tennis class. We met 11-1 on Fridays, an odd time, but Gaurav was not strict about absences or tardiness so long as we were improving and coming to class consistently. This was a big class, around 15 people across 3-4 courts, with â…” of the group well practiced, and â…“ absolute beginners. I was a member of the latter, and initially felt overwhelmed by the learning curve as I lunged across the court in fruitless swings that either sent balls careening into the next court or missed entirely.\nAfter around 11 lessons, however, (Gaurav managed to provide individual instruction to everyone in the time we had each meeting) I was passably decent. Starting at 0 to reach such heights was exhilarating, and Gaurav's encouragement contributed to my love for the sport and my interest in continuing to play. \nIf you can manage to wake up consistently before 11 on Fridays and ever wondered what playing life size ping pong is like, you should definitely take Tennis with Gaurav. This was the best 1 credit class I took my whole 4 years besides Ear Training with Peter Susser.\n\nWorkload:\nCome to the majority of classes for 2 hours every week, wear shoes that won't tarnish the courts, and participate. Not complicated.\n"
        },
        {
            "course_name": "Int/Adv Tennis",
            "review_date": "December 30, 2009",
            "review_content": "\nThe class meets once a week on Fridays from 11am-1pm at Baker Field and is one of the most amazing, if not the best, physed class offered at Columbia. You get to meet people who play with different styles and spins, making doubles absolutely fun. As for Gaurav, he is really dedicated to improving his students' tennis skills by practicing useful drills with us like drop shots, which are good change-ups during a rally, and is willing to go out of his way in helping us with our game. He is also very understanding with absences and lateness/leaving early, but rewarded those who never missed class with a T-shirt in the end. \nWorkload:\nTennis, tennis, tennis!!! What more can you ask for?\n"
        },
        {
            "course_name": "Tennis Intermediate/Advanced",
            "review_date": "May 10, 2006",
            "review_content": "\nGaurav is the best.  He's really easy going about coming late, and doesn't really count your absences.  This class definately was enjoyable eventhough it's from 11-1 on fridays.  The only annoying thing is that there were too many people in the class, so we spent a good amount of time doing drills instead of just playing.\n"
        },
        {
            "course_name": "Int/Adv Tennis",
            "review_date": "December 20, 2003",
            "review_content": "\nSuper nice guy!  He was an Indian national player and played in a number of Grand Slam events on the Pro level.  Though a fairly big class (around 12 people) he will try his best to work on each individual's game.  He's also the director of the Baker Field Tennis facility and so he can get you games with people of similar ability during the off-season.\nWorkload:\nFriday 2 hour class at BAKER FIELD!\n"
        },
        {
            "course_name": "Int/Adv Tennis",
            "review_date": "May 14, 2003",
            "review_content": "\nGaurav is the nicest guy.  He's very lenient with coming late and leaving early because he knows Friday classes-even gyms- are annoying.  I did improve somewhat, although not as much as I wanted too.  I have honestly never looked forward to a class as I did to this class.  It has instilled in me a greater love for tennis than I had before the semestor.  I definitely suggest taking this class!\nWorkload:\nNone\n"
        }
    ]
}