{
    "prof_info": [
        {
            "prof_name": "Gloria Marina",
            "prof_id": 2548,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Flamenco and Classical Spanish Dance",
            "review_date": "January 21, 2010",
            "review_content": "\nIf you are prepared to work your butt off, take twice the amount of classes, have studied dance previously and to give it everything you have, and still be given a grade you certainly don't deserve, take this class. There is a lot of talk about Julliard and although it is made clear that nothing is expected of you because you will never be a dancer, you are certainly graded as such. Having given more than expected, the result of this class was incredibly disappointing to say the least. There is lot of preferential treatment given to some students in the class, sometimes inappropriate comments are made and it is a complete waste of time. The syllabus is very unclear and half of the time is spent not dancing but talking. This is not a flamenco class but a traditional Spanish dance syllabus. If you are into social dances, take this class for fun if you don't care about your grades. Asking for feedback about improvements is a waste of time. \nWorkload:\nNot much is expected of you so pass fail the course.\n"
        },
        {
            "course_name": "Flamenco and Classical Spanish Dance",
            "review_date": "December 20, 2006",
            "review_content": "\nSenora is definitely a cute lady and she's an excellent dancer with amazing credentials (she taught at Julliard and in Argentina). She's got great stories of her life experiences and she's obviously in love with Spanish dance. Barnard totally did her wrong by putting her class in the Riverside Church this semester--she deserves better than that! I am not a good dancer, but I learned a lot and enjoyed her class. The castanets are so cool and she does a great job of teaching us how to play them. She expects the students to show respect, come to class prepared, and arrive on time, but these are fair expectations. It was an honor to be in her class. Next semester (Spring 2007) may be her last at Columbia (she's thinking of retiring), so definitely try to take her class before she leaves if you are sincerely interested in Spanish dance. I will miss her!\nWorkload:\ntwo hours per week of class; need to buy skirt, shoes, and castanets\n"
        },
        {
            "course_name": "Flamenco II",
            "review_date": "May 17, 2005",
            "review_content": "\nSenora is the cutest little old lady that loves to smile. But when she means business, she means business. Like any dance teacher she wants you to try your hardest, the more you try and put effort into it, the more she will see that. She is very friendly. she sometimes seems to go off and talk about Flamenco, and you learn more about the dance that way. The only thing I would say that was not so great was the way she teachs a dance all at once and then goes back to polish the steps, as opposed to teaching you the steps one at a time.\nWorkload:\nJust show up to class prepared. \n"
        }
    ]
}