{
    "prof_info": [
        {
            "prof_name": "Daphna Shohamy",
            "prof_id": 3422,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "June 03, 2015",
            "review_content": "\nHaving Prof. Shohamy as my Mind, Brain, and Behavior professor was a good experience. She is a good lecturer and she clearly knows her subject material. To succeed in her class, go to every lecture and take good notes on what she says. Her powerpoints are often sparse, so be sure to listen to her vocal explanations. As Prof. Shohamy says, you don't actually need to read the textbook to succeed in her class. If you take good notes, then everything she says is all you'll need for the exams. If you don't understand a concept or a particular graph in her slides, then you can always find it in the book chapters. Overall, a non-stressful class. She usually finishes her lectures 10-15 minutes early too, so that's also nice. There are plenty of extra credit opportunities, so take advantage of them! I find that her guest lecturers (often TA's or other researchers) are often more confusing than she is, but still manageable.\n\nWorkload:\nLight workload. No homeworks, but there are weekly (very short and quick) self-quizzes that you can complete for extra credit. 2 midterms + 1 final (cumulative)\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "March 04, 2015",
            "review_content": "\nI didn't find the negative comments about Dr Shohamy below substantiated in the slightest. My perspective is that of an engineer and premed taking this class. I took MBB to fulfill the premed psych requirement while learning about the biological aspect of psych (i.e., none of the dodgy handwavy psychology of Science of Psych). I don't understand the people who say she's awful and goes too fast. I would say my experience has been on the whole positive.\nProfessor Shohamy is quite a good lecturer (again coming from a hard sciences+engineering background). She seems genuinely passionate about the subject and lectures clearly and compellingly, often using interesting videos, graphics, and recent culture (i.e., memes and viral phenomena) to make her points. The material is very interesting, though I don't understand why she doesn't just call the class Intro Cognitive Neuroscience. We learn about the brain and techniques in psychological experimentation to understand how it works, starting from the structure of a neuron. My one complaint is that the amount of material presented is low; the information density of the course is such that one could get 100% of the material attending half the lectures and doing no outside studying or reading.\nOne think that did take me aback was the sheer number of random questions asked in class. The number of times someone began a question or comment with \"Once my mom...\" or \"I have this aunt who...\", etc. (followed by a completely unrelated anecdote or crackpot theory) was staggering. The class almost becomes the clearinghouse for every random curiosity about psychology and neuroscience that any liberal arts major who otherwise would never interact with a real scientist could have. Mostly being facetious but I suspect a large subpopulation of the class are only there to fulfill the science requirement.\nWorkload:\nNo homework, two easy (curved) exams, plus a final. They're just regurgitating information and she gives you the essays beforehand; I honestly cannot understand why this class is curved. I scored over 90 on both exams with minimal studying. If you've had Mowsh, this class is a breeze.\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "January 12, 2011",
            "review_content": "\nThe review below is 100% spot on. Professor Shohamy often seemed to get tripped up on her own slides which was very strange. The final being scheduled for the last day of class was ridiculous. In my eyes, the only reason for this is to extend vacation time. I signed up for the class knowing full well that finals week was the week before Christmas and taking it before that designated time was unreal. As the previous poster said, it was a ridiculous amount of material that we should have had another week to study for. It seems odd that Columbia has a designated finals week that professors don't have to follow. Lastly, if you take this class you will quickly realize the review sessions are a big waste of time. Go to the first one, and you'll realize your time will be better spent studying on your own.\nWorkload:\n2 midterms and a final\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 22, 2010",
            "review_content": "\nIt is without a doubt that Prof. Shohamy is a nice woman; however, this does not make up for the fact that she cannot teach. This is quite possibly the worst class I have ever taken. Not only are the lectures boring and impossible to keep up with since she speeds through them, but also, it is impossible to get proper help from the TA s before exams. They are too concerned with their own lives and when we asked them a question about something from the review sheets, they would either respond with a \"i cannot give you an answer to this because it may appear on the exam\" or they would shuffle through the textbook to find an answer. This class has made me bitter about psychology as a whole and has killed my desire to even deal with any other psychology class. please, do not take this class it's just not worth your time and effort. During this semester, our exam was given on the last day of classes, meaning we had to try to study about 25 chapters of material within the span on 4 days, it just was not fair. You're better off filling your science requirement with a professor and TA s that actually care about your experience with the class material.\n\nWorkload:\n2 midterms and 1 final exam.\n"
        },
        {
            "course_name": "Cognitive Neuroscience and the Media",
            "review_date": "September 04, 2010",
            "review_content": "\nThis class was the most interesting as well as one of the most non-stressful classes I've taken at Columbia. Shohamy obviously has a passion for the subject, and keeps the discussion extremely interesting. She is also very flexible when it comes to assignments and deadlines, and she brings you COFFEE and often pastries to class each week. \nAll you need to do is participate, and it's easy to do since the discussion often becomes a general one on the purpose/ethics of science and media. \nYou'll never look at a science-related news story the same way again!\n\nWorkload:\nReading each week. Short and generally quite interesting.\nTwo short, extremely easy write-ups of class discussion, due at the end of the semester. \nOne approx. 10 page paper. \nOne presentation. \n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 31, 2009",
            "review_content": "\nTerrible, terrible class.  Professor Shohamy is a nice woman, but the class is absolutely terrible.  She lectures for 1 1/2 hours on some random thing, then expects us to memorize every single and vague detail from the textbook for the tests.  In addition, the TAs are not helpful at all and grade harshly.  The review sessions were pointless and I left early almost every session.  I don't even think most of the TAs knew their material, since they almost always referred to the textbook.  I think a huge majority of the class fell asleep during her lectures, which were boring and did not help us understand much at all.  DO NOT TAKE THIS CLASS\nWorkload:\nNot much - two midterms, a final and optional weekly quizzes, but I wish there were more interesting assignments\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 20, 2009",
            "review_content": "\nClass was among the worst I've taken. I consider myself really science-minded, but the class rarely worked from first principles. Instead, the course jumped around in a seemingly disorganized fashion and I was always left puzzled as to how to really integrate everything in a meaningful way.\nMoreover, the TA's... could hardly be called useful or friendly. A recent review session, for example, consisted of a couple of TA's sitting rather comfortably, slouched or curled up in chairs, simply either dismissing or searching through glossaries for answers. With regard to a question read from a review sheet, \"Sorry -- that's too similar to material that will be on the final so we can't review it\" -- well, yeah! That's why we have the review sheets! And, ostensibly anyways, asking review questions and getting some modicum of help from TA's should be the object of a review session!\nBut I digress. Here's the deal: I don't really recommend this class for anyone. Too detailed for students that aren't really science-minded and few guiding principles for learning the material for students who are science-minded. That said, this is Shohamy's first semester, and I do suspect this course only has the potential to improve with time. \nWorkload:\n2 exams, semi-cumulative final, weekly quizzes, reading, and a little extra credit for participating in experiments\n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "December 19, 2009",
            "review_content": "\nShohamy gets up every class, goes through a pretty simplistic series of slides that condense the material well, and then goes on her merry way to do research, leaving the TAs to pick up the mess for the exams. I found this course extremely easy, almost ludicrously so, if only because the course material basically constitutes a combination of AP Biology and AP Psychology. Other students, however, found the course very difficult, especially if they expected a breezy class to fulfill the science requirement. Overall, this class was not enriching and not particularly interesting, but it got the job done. At least cognitive psychology isn't a total joke.\nWorkload:\n2 midterms and a final. The first midterm was deceptively easy, as it only covered 3 chapters. After that, simply paying attention in class didn't cut it, as the exams were HORRIBLY written and asked questions about minutiae in the text. There's so much extra credit though, I wouldn't worry about it. \n"
        },
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "November 19, 2009",
            "review_content": "\nI first signed up for this class due to two reasons: (1) for my science core requirement and (2) the concept of \"psychology\" intrigued me. However, within the first few lectures my fantasy was totally shattered into pieces. There is no doubt that Professor Shohamy is an intelligent and nice woman. Nonetheless, her lectures are not interesting at all and often just talks about the examples/experiments of such. She does not go in-depth about the whole chapter. She mentioned that she lectures about what SHE thinks is important, but somehow the midterms and final include a lot of the \"unimportant\" stuff never mentioned during the lectures. Also, she talks way too fast.\nIf you want to get a good grade, read and literally memorize the textbook verbatim. The materials resemble a freshman bio class, and if you don't know them you will suffer the consequences. The tests are graded by TAs, and they are VERY harsh on grading. \nPersonally, I think you should avoid this class. The professor is, as I've said earlier, intelligent and nice, but it seems as if she does not really care about the class. All she does is just stroll in at 2:40 with her little macbook, give a lecture for an hour or so and then just leave. My advice: just do not take it. It is not worth your time and effort, unless you are seriously thinking of going into neuroscience. \nWorkload:\nThe first midterm is 20% of your grade, the second midterm is 30%, and then the final is 50%. Also, there are about 12 \"Self-Tests\" you can do each week. These \"self-tests\" are 2 short answer questions posted on courseworks, and if you get both questions right you get +1 point towards your final grade. You can get up to +7 points by doing this. Also, you can earn up to 3 points by doing 3 \"experiments\" which I didn't even bother. Other than that, no actual homework\n"
        },
        {
            "course_name": "Methods & Issues in Cognitive Neuroscience",
            "review_date": "April 07, 2008",
            "review_content": "\nThe focus of this seminar was primarily on the influence of reward learning and different types of memory systems on decision making.  Professor Shohamy is extremely knowledgeable and provides a comfortable atmosphere conducive to enjoyable and enriching discussion.  There was sufficient structure to allow us to cover the material, yet there too was enough freedom to permit interesting, yet relevant discourse.  The balance between Professor Shohamy's input and that of the students seemed well balanced, as she provided introductions to the topics and any further additional comments/insights as seemed fitting.  \nProfessor Shohamy is an approachable, supportive, and inspiring teacher, who has greatly influenced my own research interests.  I wholeheartedly recommend taking a course with her!\nWorkload:\nStudents are allowed to choose projects to their liking. Written work: 2 critical reviews of papers read in class and 1 final (10-12 pg) paper.  Also, each student had to lead one class session of their choice (ppt of two papers previously chosen by Professor Shohamy.)  As usual in a seminar, contribution to the class discussion counted for a portion (I believe about 20%) of final grade. \n"
        }
    ]
}