{
    "prof_info": [
        {
            "prof_name": "Y. Yao",
            "prof_id": 5523,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Materials/Processes in Manufacturing",
            "review_date": "June 07, 2014",
            "review_content": "\nAs has been said in previous reviews, Prof Yao really knows his subject well and loves it. He is very willing to get involved in whatever questions you have, occassionally a little too involved. I had high expectations for the lectures that quickly vanished, as more skill was required to stay alert during the last dozen lectures than to complete the final exam. The most interesting part of the class was the project, where you get to apply the abstract lecture notes to real hardware. If you can, try to connect each lecture with real world application and hardware you see on a daily basis, otherwise you can quickly get lost in the plethora of terms and graphs. While the material throughout the entire course is worthwhile to learn, good luck staying awake in lectures. On the other hand, the books on reserve cover almost all the material in a clear but not-so-concise way. One tip: many questions on the final are recycled from previous practice exams.\nWorkload:\n5 homeworks that take can take a few hours each, 1 midterm, 1 final, 1 month long project. The prof sometimes goes over examples that relate to the homework and are not found in the lecture slides, so be sure to grab a copy of whatever equations or examples happened in class if you didn't go.\n"
        },
        {
            "course_name": "Manufacturing Processes",
            "review_date": "July 01, 2011",
            "review_content": "\nLarry Yao is very excited about his subject. He clearly relishes manufacturing processes and enjoys explaining it to his students. In no way does that imply that class is interesting, however. There are no notes to take because everything is projected overhead and the notes are xeroxed for you. Things get a bit monotonous around the 45-minute mark most days. He seems to notice but not object to the fact that his lectures put many students to sleep. He often shows movies in class (ranging from campy but plausible to shockingly bad) and the homework is optional (and not useful at all). The book is completely superfluous. The tests and quizzes are multiple choice and are all recycled from previous years' exams, with a few short-answer questions at the end. These short answer questions have only a single correct answer - demonstrating your mastery of the material is rewarded with no points unless you write the exact, verbatim words that the TA's are looking for. There is a cool field trip and a pair of essays. The essays are literally graded on the frequency with which you include the words \"Section XXX.YYY of the engineering ethics code says ZZZ\" where section XXX.YYY pertains roughly to ZZZ. Coherence of argument and intelligibility are irrelevant. If you study all the practice tests and quizzes he gives you and memorize every slide of the notes, you will have met nearly every question on the final. By midterms, more than half the class was never showing up. The TA's take roll after the halftime break with a yearbook-style sheet of students' photos. Oddly, after memorizing all the old test questions, you will be able to sound medium-knowledgable about most common manufacturing processes. In my class there was a bloc of loudly-whispering cheaters on all the tests and quizzes. Everyone present, TA's included, was quite aware of this, but no one stopped them. Before the final exam Yao gave a speech about the importance of academic integrity which seemed to surpress them somewhat. \nWorkload:\n3 short quizzes, 1 midterm, 1 final, no homework, 2 essays\n"
        },
        {
            "course_name": "Manufacturing Processes",
            "review_date": "May 31, 2011",
            "review_content": "\nVery boring, 3 hour long power point lectures. On a good day, I would stay awake during the entire lecture. On a very good day, I would even be able to focus for an hour. Virtually no work for the class other than keeping up with the lectures (t read the book) and I still found myself clueless on a large portion of the exam. \nWorkload:\n3 10-minute quizzes (drops 1), a midterm (1 hour) and a final (2 hours). Weekly homework assignments which he does not collect and no one in the class even looks at\n"
        }
    ]
}