{
    "prof_info": [
        {
            "prof_name": "Jason Petrulis",
            "prof_id": 2363,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "History of the City of New York",
            "review_date": "May 08, 2006",
            "review_content": "\nJason is an oustanding TA who comes to section incredibly well-prepared and is great at faciliating discussion. Particularly willing to help with drafts, questions and anything throughout the class. Goes out of his way to help with essays, tests and in explaining grades as he provides constant handouts on all these issues. Others have said he is somewhat of a harsh grader but I never found him to be and he is an incredibly nice, knowledgable and helpful person who tells you exactly what he wants and expects from you. If available a great TA to take a class with.\nWorkload:\nBi-weekly section, an easy 4 page paper, midterm and final which aren't hard but which have IDs that are a royal pain to look up because they are scattered all over really long books which don't necessarily have adequate indices. And yes this course has a lot of reading even for a history class.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 15, 2006",
            "review_content": "\nI wasn't as enamored with Jason as previous rewiewers but he is a good guy.  There can be awkward silence during his discussion sections, but he generally does a good job of going over relevant material. He was also nice enough to give us an extra page of wiggle room on the paper.\nI found his grading on the midterm & paper to be a little harsh (but not as harsh as the horror stories I heard from friends who had different TAs).  However, the final grade I got was extremely generous. \nIf you have the chance to sign up for his section, especially in this class, since he has TA-ed it many times, I would say take it.\nWorkload:\n8 walking tours (if you do one that is not on the list, he must approve it & you must do a write-up for him)\n1 midterm\n1 4-5 page paper\n1 final\n"
        },
        {
            "course_name": "American Beginnings",
            "review_date": "April 30, 2005",
            "review_content": "\nI really loved Jason!  He was such a great TA, I hope I somehow get to have him again.  Sections were practically never boring, and he always starts out with lighthearted trivia which is great.  He seems very invested in the class, knows practically everything you could ask him about, and makes great connections between all the things we learned.   He replies to you extremely promptly, was very accessible, and went out of his way to help you.  There is only one paper in this class, but he really wanted to help us with it.  I wish Jason all the best in becoming a professor because he will be awesome, especially  if he teaches seminars like our recitation.\nWorkload:\nOne book per week that we discussed in recitation, midterm, final, and one 8-10 page paper.\n"
        },
        {
            "course_name": "America since 1973",
            "review_date": "January 04, 2005",
            "review_content": "\nHe was one of the best TAs I've ever had.  Trivia questions to begin sections, great discussion moderation, and great guest lecturer.  He was a pretty tough grader, as he used to work as a copy editor, but he really taught me how to write GOOD history papers with sharp theses and strong arguments and writing.  I would not trade an easy A with another TA for the A- I got with him while working my butt off.  He was extremely accessible out of class, always willing to read drafts and to help with anything and everything.  The skills I learned in reading books analytically and writing history papers has helped me so much in history classes I've taken since.  He's a great TA and will be a great professor once he gets his PhD.\n"
        },
        {
            "course_name": "World War II in History and Memory",
            "review_date": "December 31, 2004",
            "review_content": "\nJason was a great TA. He facilitated good discussion, as well as having a fun trivia session at the beginning of each meeting. Available outside of class and vey helpful in terms of papers and exam studying.\n"
        }
    ]
}