{
    "prof_info": [
        {
            "prof_name": "Raymond Smith",
            "prof_id": 1069,
            "total_reviews": 48
        }
    ],
    "reviews": [
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 22, 2016",
            "review_content": "\nTook this class as an american politics elective. Really glad I did. In all honesty I was not all that interested in the topic, but rather it was the 3 take-home exam/essay format that sparked my interest. That said, I actually ended up enjoying the course (and not only because of the light, light workload), and do feel that I did gain a good amount of insight into the role that race and ethnicity play in american politics. Professor Smith is definitely old school, and opts for projecting his printed out slides rather than using the computer. Kind of quirky, but it works. Lectures really were not necessary at all since everything that was needed for the papers were in the books, but do beware that he begins taking attendance after the second take-home. Additionally, Professor Smith started each lecture with current-eventish type things that sometimes went on for half the class. Paper topics were kinda weird, and based on the discussion sections I was in I feel that the general consensus was that what was being asked for/how to craft your paper and answer the questions was a bit unclear. That being said, even though I did not feel all that confident in any of the papers I wrote, I received A's on the first two, and an A as my final grade (don't know about the third as those were due on the last day of class and were not returned). The readings for the course were not bad at all (nothing was super academic or tough to read), and of what I read (which was probably about 80%) I only read after the exams were handed out since I didn't see the point in reading anything prior to knowing what I was looking for. That said, do not leave both the readings and paper to the night before. You definitely need at least 2 days (I took 2-3). In addition to the 3 take-home exams we had to do a short issue brief (500-700 words) and a couple of posts to the discussion board. I had never dealt with issue briefs before, so I honestly had no idea what I was doing for the first draft. However, the first draft was graded only for completion, and we received feedback from our classmates and also had access to previous briefs done for the course prior to handing in the final draft. In conclusion, I'd definitely recommend this class. Professor Smith is very laid back and approachable, and it is clear that he is very interested in the topic. The lectures can be a bit dry at times, but you can definitely zone out or do other work during class time.\nWorkload:\n\"Weekly\" readings, 3 take-home exams in the form of 5-6 page essays (handed out over a week in advance of the due date), 1 issue brief (500-700 words, 2 drafts), 2 posts to the discussion board + responses to classmates' posts. Very light, easy A.\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "April 21, 2015",
            "review_content": "\nI took this class despite the mediocre reviews on CULPA and I was so pleasantly surprised! \nThe class gets off to a slow start and feels like a very broad intro level course, but it is interesting and gives a basic understanding of race in America. Professor Smith is a funny and engaging lecturer. He doesn't use slides, but rather a document projector so get ready to take good notes. That being said, it's okay to miss a few classes as long as you do the readings. Keep in mind that you don't always have to agree with the course material he assigns and that you're meant to engage with it. The paper topics are engaging and creative. Professor Smith makes an effort to get to know the students in the big lecture class as best he can and is super friendly. He also includes current events in the class and leaves them up for discussion. I think his sense of humor can be hard to catch and seem pretty harsh, but if you get used to it you can see he's a really caring softy. \nWorkload:\nThree short papers with really fun topics that let you do your own thing. A few online forum prompts. An issue brief (draft and final), which is basically a short research paper with some pictures and additional links. \n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "September 26, 2014",
            "review_content": "\nProfessor Smith takes a statistical approach to race and American politics, a move I'm now guessing he does to promote his somewhat conservative views about race. These views seemed to be conveniently hidden beneath a very easy going demeanor. For example, I had mentioned in class that I read the book, American Apartheid, which is a groundbreaking text chronicling the history of de-jure and de-facto racial segregation in the United States. To this he responded, \"Guys, apartheid is something that happened in South Africa many years ago that doesn't exist anymore. So please, don't mention it in class.\" This particular comment in response to one of the most important books in the field of race and American politics was a little disturbing. \nOn another occasion, he randomly threw out this statistic by some social scientist stating that if you were to take into account all of the suffering and injustice blacks endured in America, it would amount to paying each of them $30,000. My first reaction was, \"How can you quantify oppression?\" I mentioned that no amount of money could ever replace the lives, culture, and quality of life lost through American slavery, Jim Crow, the Black Codes, neighborhood covenants, redlining, or the current drug war. To this he simply replied, \"Yea well, it's a cruel world, what are you going to do.\" \nDon't get me wrong, professor Smith was very cordial throughout the course, but his views on race frightened me more than once. Some of his comments led me to believe that he didn't really feel sympathy for black Americans because Africans were complicit in the Atlantic Slave Trade. But to this I responded, \"Then how can you feel sorry for Holocaust victims, or Americans who died in the Civil War, or basically any white person who kills another white person?\" To this he just went silent for about ten seconds before replying, \"Anyone want to comment on that?\" \nI understand that race and American politics is a tricky subject, but this is no excuse for a professor in the field to attempt to impose his conservative views on unknowing undergraduates. Fortunately, I wasn't one of the \"unknowing\" students in class. Before I took professor Smith's course, I had read several groundbreaking texts in the field, including: The Souls of Black Folk, American Apartheid, The Wages of Whites, The Truly Disadvantaged, Dark Ghetto, and The New Jim Crow. Mr. Smith seemed to be unfamiliar with at least half of these texts, which scared me once again since he had a PhD in the field. \nUltimately, I think Mr. Smith has good intentions, but his sheer ignorance of American racial history leads him to misinform his students through a statistical approach to the field.\nWorkload:\nFour Essays\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "November 11, 2012",
            "review_content": "\nI took Professor Smith's Race & Ethnicity in American Politics over the summer and found the class to be somewhat informative at best. Mr. Smith has a very pleasant demeanor, however, something seemed to be bothering him throughout the course that he didn't really want to tell us, and I think this was reflected in our grades. I remember him giving us a short spiel on why we shouldn't go into academia. This made me feel he was being pressured by his superiors to do certain things he didn't want to do. The most unusual aspect of the course was that I seemed to get the same grade on everything, even when I knew I put much more time and effort into some assignments than others. This grade as a B+. I don't know if Professor Smith was pressured to do this, but either way, I hope things get better for him. \nWorkload:\nFour Essays\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "August 14, 2012",
            "review_content": "\nOverall, I enjoyed the class. Prof. Smith is not your typical blazer-wearing, grandiose polisci professor, and I think that is part of his charm. He wears a north face and jeans to every lecture, and sticks pieces of paper under the projector thing that are often too small to read or clearly from the 1980's. So, not the most organized person on campus.\nBut he was great to listen to. I looked forward to his classes. I maybe took a grand total of three pages of notes all semester because I wasn't sure what to write down, but if you sit attentively in class and listen, that's generally all you'll need.\nThere are three papers, he gives a week for each. Graded by the TA (pray you don't get the one I had.) There is quite a bit of reading that you don't really need to do, just skim through when you write the papers.....this tactic may have been why I hated my TA though so maybe don't listen to my advice on that one. (If you choose to go my route, the books are in the IAB library so you don't need to buy them.)\nIn all, this class will not radically change your life, but it's not boring and it's not a lot of useless work, so I would say it's a good elective to take. (You don't even really have to go to class, although I would say it's the best part.)\nWorkload:\n3 papers, and a weird posting to a columbia wikipedia-esque website that he gets really excited about but doesn't take long to do or count for much of your grade (it's actually pretty cool to do and very low-stress.) No midterm, no final. A few books to read but I didn't even buy them.\n"
        },
        {
            "course_name": "American Politics Seminar: Majority Rule and Minority Rights",
            "review_date": "May 11, 2010",
            "review_content": "\nProfessor Smith is funny and has a lot of anecdotes to make people laugh in class. The subjects are interesting too. Still, I don't recommend this class. He's distant and not very helpful when it comes to the final paper. You already have to have the idea for the final paper at the very beginning of the semester, before you even realize what the class is about. Then he makes you do all these strange assignments with your 'question' and 'thesis' and how to incorporate the question into the thesis without giving the answer away. It's unnecessary.  He's a hard grader on top of that, so it's not as though you get an easy A out of it. \nWorkload:\nYou have to write 1-2 pages for every class, so you have to do the reading you're assigned. \n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 19, 2008",
            "review_content": "\nI really don't understand why Professor Smith gets such negative reviews. He's one of the nicest, most down to earth professors in the whole department, and he's done some really interesting research on minority collective action that translates well with the material covered. I always enjoyed the in-class group projects as a means of reinforcing material in practical settings. These courses exposed me to the Eyes on the Prize PBS series and - finally - Robert Dahl's classics, oftentimes referenced in other courses in the department though rarely read. If you're looking for an easy large lecture filler, I wouldn't suggest the Race and Ethnicity course. You really should have an interest in the material. If you go in thinking its all common sense, you probably won't leave learning anything new. It's really a nice window into how issues are advanced and elections are won. Furthermore, Smith is easily approachable and always quickly responds to emails (within 24 hours, usually sooner).\nWorkload:\nRace and Ethnicity: a fair amount of reading, but doable. Four 5-page essays with the top three counted. No exams when I took the course.\nMajority Rule and Minority Rights: weekly readings and response paper. Two short presentations / discussion facilitation based on readings. 25-30 page term paper and 10 minute presentation.\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "January 15, 2008",
            "review_content": "\nThis course is easy to sit through, what will get you is the fact that your grade is based solely on papers. The paper topics are difficult to tackle, so do the reading on time. Also, be sure to UNDERSTAND the question, because if you dont, it'll cost you your grade.\n\nWorkload:\na couple of papers, medium amt of reading\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "January 09, 2008",
            "review_content": "\nI took this class because it counted twice: political science, and major cultures.  However, I still wonder whether it was worth it.  The material is not difficult, but the class is boring.  The work feels like unnecessary and insignificant busy work.  The data Prof Smith uses is out-dated, and the way he covers part of the projected information makes me feel as though I am back in elementary school and incapable of paying attention to the teacher.  It was very hard to be motivated in such a dry class, and despite the title and subject matter, the class is neither interesting nor engaging.  \nWorkload:\n3 midterm papers in which you must utilize some of the readings, otherwise the readings are unnecessary.\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "January 19, 2007",
            "review_content": "\nReading the last 2 reviews, I feel vindicated. Really, I thought I was the only one suffering through that class. It was the thorn in my back the entire semester because it all seemed so arbitrary. The highlight of the class was when he dimmed the lights to play us videos of violent race riots. \nThat said, I know its an Urban Studies requirement (the only reason why I took it, and justification of why switching my major from Poli Sci to URBS was a godsend choice), I still don't know how he can garner that many students to come semester after semester. Do they not read CULPA? Is his class another of those Poli Sci fixed requirements? WHY? \nWorkload:\nReadings that jump from book to book with no apparent logic, the 3 horrific papers, the horrific TAs... The girl who sold me my books over dogears told me it was a breezy class when she took it, apparently, something went very wrong in Fall 2006.\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "January 17, 2007",
            "review_content": "\nI think this class was a total waste of time.  If you have taken American Government and/or any other class dealing with race/ethnicity you already know everything you'll learn here.  You didn't have to do any of the reading because it wasn't tested except your ability to look things up in the books for your take home essay tests.  The 3 take home tests/essays were all on bad questions and graded a little bit harder than they should have been.  There were also a few sections in class that seemed like exercises you would have done in high school. The final was pointless, you needed very few facts if any you just had to have an understanding of the vocabulary/issues covered in class.  \nWorkload:\nthe reading was unnecessary, 3 5-page take home essay exams, and a 1 hour final\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "December 17, 2006",
            "review_content": "\nyou'd have to be an IDIOT to take this class.  this class is honestly a waste of your time and money.  the class is easy but since all of his students in years past have gotten b+'s in above the poly sci dept. is coming down on him so his grading is much harder than it should be.  this is a joke class and a joke class w/o the easy A is pointless.  don't take it....seriously...you...if you take this class you WILL regret it.\nthat is all\nWorkload:\nit doesn't matter...don't take it....ok?...don't\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "December 04, 2006",
            "review_content": "\nThis class is awful. Basically, all of the material involves putting common sense into fancy terms. Most of what you'll \"learn\" in this class is pretty useless. Example: \"Postethnicity\" denotes a society in which we do not judge other people by their race, but instead use \"color blind\" methods of classifying others. Uhhh....okay, and soon we'll have world peace, too! Very useful. \nEach of the three take-home exams that you'll write is a joke. Still, the TAs grade them pretty harshly, and you'll be expected to regurgitate a lot of inane facts for the final exam (which, admittedly, is very short--only about an hour). I wouldn't recommend going to the TAs for any extra help--mostly, they're just as clueless about the validity of the coursework as you'll be.\nThe amount of reading is negligible (and it's all pretty boring and/or useless, so you don't even have to bother with it), and lectures pretty much involve Prof Smith reiterating titillating things like about the controversiality of affirmative action. Enlightening concept, there.\nSTAY AWAY.\nWorkload:\n3 five-page take home exams, 3 useless discussion sections, one in-class final\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "September 05, 2006",
            "review_content": "\nHe is a terrible professor. \nThe class is huge and the only thing that he does is reiterate what the textbooks say. \nso either go to lecture or read the books but you do not need to do both. I don't recommend taking this course. The topic, and the books are great, but the professor is not. \nWorkload:\nThree take home exams. The T.A.s look for grammar rather than content so it can be hard to do well \n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "January 15, 2006",
            "review_content": "\nI enjoyed Professor Smith's course and found him to be engaging and thought-provoking.  He is a good lecturer and very accessible.  The material is also interesting and Smith uses interesting graphs, charts, and media to illustrate his points.  I highly recommend his class.\nWorkload:\nEasy .... Very easy.  Three papers, graded somewhat hard.  People in our class were given an exemption on taking their final exam so long as they attended three discussion sections.  However, Professor Smith has said he will not do that again.\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 30, 2005",
            "review_content": "\nso everyone reviews Professor Smith as boring, immature, unanalytical, and as a teacher, at best, for junior high-- BELIEVE THEM. I took this class as a requirement, and was miserable all the way through. There is no analytical analysis- just boring power-points that state facts and never truly reveal anything about our political environment.... and whats worse is that the T.A.s grade really unfairly and harshly-- just to prove something... I got an A- in the class- so Im not being harsh out of bitterness- I just wish someone had told me all this.\nWorkload:\n3 five-pg \"take home exams\" and a final.\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 22, 2005",
            "review_content": "\nI really liked Professor Smith's class even after taking his into to American Politics . His lectures are clear and interesting and he is very helpful outside the classroom.\nThe only bad thing that I can say about this class is the grading that was done by TAs. I have no idea what kind of criteria they had but sometimes my comments on the paper would say : \"As I specified in the margin...\" and there would be not a single mark in the whole paper, so it is just the matter of luck: if you get a good TA you can get a good grade.\nWorkload:\n3 take-home exams: grades are based on your luck with a TAFinalOverall managable\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 16, 2005",
            "review_content": "\nRay is the man! He's funny. He's really nice. And he puts the notes on the projector, every class. This class is easy. That being said, I could have taken the final in high school. I did not learn a single thing this semester that was not common sense. Give it a try. \nWorkload:\n3 take-home exams, TAs get more fair as the semester progresses. Easy final. \n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 14, 2005",
            "review_content": "\nI totally agree with the other reviewer.  The title of the class sounds amazing, but, unfortunately, the class isn't.  I took this class after taking Introduction to American Government so I felt much more prepared than the other students.  Indeed, nearly 1/3 of the material covered matches the material in his Intro class.  So, if you're going to take the class, just take his introductory class and it'll be a breeze.  \nHowever, even though the class itself is a breeze, be forewarned about the grading from TAs.  The TAs arbitrarily hand out grades on papers with no constructive criticism at all.  For example, you'll get a comment that says, \"This essay is superb.  Amazing work.\" and get a B+.  Uhhh...ok. What was wrong with it? \nGrading aside, the class is still not interesting because everyone finds a lot of the material to be common sense.  All you really do in the class is learn fancy terms to put on the knowledge you already know.  But I guess that's just Political Science.  \nSo yeah, the class is pretty mediocre and, if you take it during the spring, you'll much rather want to lay out in the sun than go to his boring class. \nHowever, he's nice and is always willing to meet with you to discuss paper topics.  He's very responsive.  I have no idea what the other reviewers are talking about.  \nWorkload:\n3 five-page papers and an in-class final.  \n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 13, 2005",
            "review_content": "\nOne of the most awful classes I've taken at Columbia. The material itself is interesting but Smith absolutely kills the class. Although the class was easy (the final consisted of one essay that you had to complete in an hour and 15 minutes) I still had to do the bitchwork to get by. I won't deny that this is an easy way to fulfill your poli sci requirement but Smith's lethargic teaching style (a lot of the times he's show up and make us watch a video for half the lecture) will make even the slacker indignant.\nWorkload:\nthre 5-page takehome essays \n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 06, 2005",
            "review_content": "\nGreat class if you know nothing about race relations...if you do, steer clear.  It will teach you little that you don't already know, not to mention he might as well call it \"African Americans (and a few Latinos) in American Politics.\"  No real discussion of any other groups.  As I said, if you haven't really studied race relations in any depth before, this class will likely be eye opening.  Otherwise, I barely went to class and did absolutely none of the reading and still averaged an A-/B+\nWorkload:\nthree take home exams and one in class final\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "April 18, 2005",
            "review_content": "\nsave yourself. hes boring. plus, even if he wasn't, nothing gets graded till the last few weeks of the semester (if your taking it a barnard- since the course doesnt have a TA). Hes a really harsh grader, which sucks since your entire grade is based off of essays. He grades essays extremely nitpicky, especially for an intro class. I have taken upper level poli sci courses and gotten A's from professors of much higher intelligence, but yet somehow I got a B in Raymonds. i would say stay away.\nWorkload:\nnot bad workload- essay midterm and essay final. plus an argumentative paper. but beware hes a really harsh grader on the essays- he just looks for points to take off for no apparent reason. \n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "April 18, 2005",
            "review_content": "\nAverage at best. As someone interested in politics, I was really excited to take this class. However, I agree with some of the other reviewers insofar that it feels like a high school civics class and that Smith can be rather boring. He spends a lot of time on the structure of government, which is really mundane and rudimentary, but he does mention some theories that can be pretty interesting (if you can stay awake). I generally liked the readings, which were never overwhelming, and sometimes it's nice when he brings in relevant topics. I found the paper to be graded rather subjectively because he is very ambiguous on what he wants. However, the essay tests aren't that hard to study for (just read over notes), and he is a nice guy. And he certainly knows what he's talking about, but he doesn't bring in his superior knowledge enough to make this a must-take class. If you don't mind boring lectures and are looking for a relatively easy politics class, or have never taken American history in your life, this is for you. If you want genius and don't mind temperament, wait until Pious teaches Dynamics.\nWorkload:\nNot bad. Some reading, a 5-7 pg paper on a debate topic (graded rather subjectively), a 2-essay midterm, a non-cumulative 2-essay final. \n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "April 13, 2005",
            "review_content": "\nThe title of the class makes it sound amazing.  It's not.  By the end of the semester I compromised and go to this class once a week.  If you have taken poly sci, it's probably easy.  This is my first poly sci class and although it's not exactly easy, it's completely boring and seems like common knowledge.  A weird combination.  Raymond is not a bad guy, he's just really painfully boring.  Don't take this class unless you have to.\nWorkload:\nThree take-home exam-essays, one final.  I only do the reading when exams are handed out.  Not light, but not too serious either.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "March 19, 2005",
            "review_content": "\nThis class is meant for international students visiting the United States for the first time. The material covered in this class is material that all students should know before being admitted into Columbia University- I was embaressed to be in this class- we covered topics such as \"what are the three branches of government\" and \"what is the difference between the House of Representatives and the Sentate\". However, if you want an easy A without having to go to class, this class is for you. \n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 03, 2005",
            "review_content": "\nThis class was good and bad.  It was bad because, basically, it was a repeat of my 8th grade civics course, with more advanced concepts introduced.  That being said, if you remember nothing from your civics class, or never took one, this is a good, simple introduction.  Also, the workload is light--readings that are hit or miss in terms of being interesting, and are fairly unnecessary if you can bullsh-t well, and two papers.\nWorkload:\nTwo papers (one pre-midterm, one post-), midterm, final.  Weekly readings.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 02, 2005",
            "review_content": "\nProf. Smith knows his stuff, and the most enjoyable parts of the class for me was when he'd just go into trivia mode and go through mini-biographies of various lesser-known political figures (like possible Democratic and Republican presidential nominees from the '04 election), usually inserting a quip or two into each description.  The class is run in a sort of high schoolish manner and is accompanied by a similarly somewhat dumbed-down textbook, but that was fine with me; my government class in high school was a joke so I really needed some basic training in American politics.  The class also seems to be filled with athletes, so I don't know if that was a coincidence or if the class is known to be a little on the easier side.  In any case, it's easy to get away with just skimming the readings and breezing over the course in general, but you can also learn things if you try.  The discussion sections are kind of silly/useless but Prof. Smith definitely attempts to make them worthwhile (with debates and stuff like that) even if he doesn't entirely succeed.  My TA, John Sivolella, was a nice guy who was basically going through the motions without giving anybody a hard time which, again, was fine with me.  Also, the books Prof. Smith chooses are seminal American poli sci works (Neustadt, Mayhew) so it's good to be forced to read those at some point if you're a poli sci major.\nWorkload:\nnothing terrible: two pretty easy (and easily-graded) midterm and final exams, two short papers taking the pro or con side of a debate, and occasional page-\nlong response papers \n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 29, 2004",
            "review_content": "\nThis class was a fairly easy intro to political science and yes, I found that my background in politics and the U.S. government in general helped to make it both easy and boring, but Professor Smith taught the material in a very different way from my high school teachers.  The information isn't just piled on; it was about linking the information together to form a complete picture of the government and the country.  While Professor Smith's presentation of individual facts and concepts may have been sleep-inducing, I woke up when he discussed the way it all fit together.  The best part of the class, though, was when he talked about current events.  He definately attempt to make things interesting and less monotonous, as we had several in-class group projects that included discussing our midterm responses and organizing a grassroots campaign, among other things.  Our particular class did not have T.A.'s but there were optional discussion sections that were basically talking politics over lunch.  It definately wasn't difficult to do well, and overall I'd take it again.  \nWorkload:\nMidterm and final comprised of a few short to-the-point essays, option of either 5 short papers or one long literature review, light weekly reading\n"
        },
        {
            "course_name": "Colloqium: Content of American Politics ",
            "review_date": "December 29, 2004",
            "review_content": "\nI did not enjoy this class and found Prof Smith to be uninspiring.  He was inept at articulating research criticisms and methods along the way and so was not very helpful in the research process.  Some of the readings were interesting but he did not have a very good method of leading discussions \nWorkload:\none long research paper and weekly responses to readings\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 28, 2004",
            "review_content": "\nSmith's lectures are fun... once in a while. He is a friendly teacher though he speaks fast. But most of the time you will be fine just dropping down a few lines that sound important. His lecture notes are interesting while sometimes they are a bit disorganized. He is, for sure, a very new teacher, so this class will get better! One cool thing, by the way, is that he responds to students' emails very promptly. \nWorkload:\n(Almost) weekly response \"outlines\" that usually take less than half an hour to work on, two 5-page debate papers with 3-5 \"distinctive\" arguments, mid-term (2 essays chosen out of 5), final (same length as the mid-term, 2 essays chosen out of 4).\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 25, 2004",
            "review_content": "\nProfessor Smith is AWESOME.  He made this class so enjoyable and entertaining.  He is a funny guy, easy to follow, and definitely knows the material.  The discussion sections were a drag and completely unnecessary, but the lectures all seemed to fly by rather quickly and the points in class were very indicative of what one would find on the midterm or final.  \nAs TAs grade everything, be picky and choose wisely.  A bad TA can screw you over. Raymond is always super responsive to emails though and always willing to help with a paper or meet during office hours.  Awesome guy.  Great teacher.  Make sure to take this class with him!\nWorkload:\nTwo argumentative papers that are pretty tricky until you get the right angle.  TAs grade pretty harshly, but whatever.  Midterm consists of two short essays on two very broad topics: make sure to do all of the readings and stay awake in class and you'll score an A.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 22, 2004",
            "review_content": "\nI loved the class and the professor - he was always easy to follow, his notes are great and he is extremely funny.\nI gained a lot, maybe because I am an international student but I think all of us enjoyed the class.\nThe worst part of the class were the discussion sections - even thought the TAs tried hard to make those 50 annoying minutes better it still sucked.\nWorkload:\nEasy midterm and final that consisted of 2 essays each.\nWeekly assignments for the discussion section and 2 debate papers that were a wreck + they were graded too harsh.\nTAs were in charge of grading - so respect your TA and come to discussion sections :-))))\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 21, 2004",
            "review_content": "\nAP Govt. was harder.  smith is funny and makes very basic lectures much more interesting/entertaining.\nWorkload:\na couple response papers, weekly discussion section, 2 5 page papers, midterm, final (not cumulative)\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "November 17, 2004",
            "review_content": "\nThe class... was kind of...boring.  He is a nice guy and I'm sure he means well, but he talks super fast.  He usually goes right into the lecture without you even realizing it.  Be sure to be up on the reading, and you'll definitely do well.  Not a harsh grader, no T.A's.  \nWorkload:\nEasy readings, about 40 pages a week (maybe a little more) -- will review in class.  You'll be assigned to a debate group, the paper is 4-5 pages. \n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "November 07, 2004",
            "review_content": "\nWelcome back to 8th grade civics/ 12th grade government. There should really be a way to test out of this class. They're not joking when they say intro (i.e - reviewing the articles of confederation and various articles of the constitution for the first 3 weeks of class). Prof Smith tries to be engaging and seems to enjoy the material, as boring as it may be. Lectures are kind of random, as he'll spend 3/4 of a class giving examples of polling questions/surveys that he finds comical. if you go to class, there's no need to do the reading or waste your money on the 5 required texts. Or, if you skim the reading a day or two before the midterm, there's absolutely no need to go to class and still get an A.\nWorkload:\nweekly one-page outlines in discussion section, two 5-7 page papers, midterm and in-class final that are both easy essay tests\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "November 07, 2004",
            "review_content": "\nWelcome back to 8th grade civics/ 12th grade government. There should really be a way to test out of this class. They're not joking when they say intro (i.e - reviewing the articles of confederation and various articles of the constitution for the first 3 weeks of class). Prof Smith tries to be engaging and seems to enjoy the material, as boring as it may be. Lectures are kind of random, as he'll spend 3/4 of a class giving examples of polling questions/surveys that he finds comical. if you go to class, there's no need to do the reading or waste your money on the 5 required texts. Or, if you skim the reading a day or two before the midterm, there's absolutely no need to go to class and still get an A.\nWorkload:\nweekly one-page outlines in discussion section, two 5-7 page papers, midterm and in-class final that are both easy essay tests\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 16, 2004",
            "review_content": "\nI have to say that overall I enjoyed the class. I have not taken a poli sci class before, and even for me the concepts sometimes seemed a bit redundant, but on the whole the content of the class is very good. A word of caution applies: again, I'm not very experienced in the ways of poli sci grading, but I would urge students to at least skim the required books, since the exams pretty clearly ask you to combine material from lectures and readings for your answers. Many people seemed to be shocked to learn that they actually needed to do the readings, and often paid with their grades when they didn't. \nWorkload:\nWell, there's the reading (at your own discretion) of 7 books. Also, one take-home midterm, another in-class midterm, a 5-7 page strategy memo/literature critique paper, and a final that was made optional because of the strike. \n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 11, 2004",
            "review_content": "\nEasy grader, lots of A's, makes the readings very understandable and simple in lecture.  BUT, dense readings that are very dull, can be engaging at times but often repetitive in lectures.  As far as Poli Sci goes, no instructor will give you a lighter reading load\nWorkload:\nOne take home midterm, two in class midterms, a short (5-7 page) paper, and a final (ours was made optional because of the TA strike)\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "June 15, 2003",
            "review_content": "\nNot a bad bet for Intro to American Politics. His lectures were pretty easy to get through, and the workload was extremely reasonable. Prof. Smith seemed very knowledgeable and allowed plenty of time for questions. Unfortunately, this question/answer time usually  turned into \"try to impress the teacher and annoy the entire class\" time. But I have to give Prof. Smith credit for curtailing the ramblings of self-important students. \nWorkload:\nVery light reading, a weekly assignment graded Pass/Fail, take home Midterm and Final, each consisting of two 3-page essays. All very easy, but I have a feeling this class might get harder since it was his first time to teach it at Columbia. \n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 19, 2003",
            "review_content": "\nThis was one of my favorite classes at Columbia. I developed a great sense of appreciation for the work of minorities to achieve equality. The class was pretty laid-back, and Prof. Smith was a really nice guy. It wasnt difficult to do pretty wel either, and the 5 texts that were assigned were useful but not essential in terms of getting a good grade. I'd definitely recommend this class.\nWorkload:\nreadings, 5-6 short papers, midterm, final (which was a second midterm essentially)\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "March 06, 2003",
            "review_content": "\nThis has to be one of the easiest classes I've ever taken.  It's all stuff American children know growing up or at least from a high school civics class.  Some of the readings are interesting, but for the most part they're not necessary.  Most people go to class because he takes attendence periodically, but just about everyone reads the spec or does the crossword puzzle.  \nWorkload:\nvery easy.  light reading and weekly 1 page summaries.  take home short essays for the midterm and final.  In class, the easiest multiple choice tests you've had since elementary school.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "February 04, 2003",
            "review_content": "\nSubpar lecturer, always off on pointless tangents.  The only reason to go is because of periodic attendance.  Discussion sections are all you need to know what he talked about.\nWorkload:\nEASY.  2 3page papers each for the midterm and final, and multiple choice in class\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 24, 2003",
            "review_content": "\nProfessor Smith is very knowledgeable and enthusiastic about politics, and his lectures were well organized.  He sometimes lets students ask pretty tangential questions, but it's not that bad because the course is simple anyway.  It's basically a high school civics course, nothing too complicated.  Do the extra readings even though most of them won't be tested because they're really intersting and short, too.  There's a weekly discussion section that's not too useful, but not too boring either, because it's small so you get to discuss more in-\ndepth stuff.\nWorkload:\nweekly paragraph assignment for the discussion section (it'll take you 20 min max), a midterm and a final.  the tests are easy easy easy.  do the reading and you'll be fine.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 13, 2003",
            "review_content": "\nIf you have any background in American Politics, don't take this class. However, if you come from another country, or attended a NY public scool, like me, this class provides a comprehensive understanding of U.S. politics. Prof. Smith has a great voice and his lectures are well organized although they do for the most part reiterate the reading. I had absolutly no knowledge of American Politics previous to this class and was able to get an A So it's not very challanging but I did learn a lot!\nWorkload:\nAbout 1-2 hours of reading (unneccesary if you attend lectures). Weekly discussion sections with a one page assignment due-based either on the readings or an online assignment.\nA 2/3 take home and 1/3 in class midterm and final graded by the T.A.'s very fairly if not leniently.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 14, 2002",
            "review_content": "\nThis class was idiotic. Smith would begin each class with a discussion of current events which seemed like a good idea at first, but just boiled down to people trying to show how much they know about a given topic during lecture. The books assigned were largely pointless and lectures only covered the most basic material. The plus side is that you can either choose the readings or the lecture. If you want a nice relaxing break in your day where you really don't have to take notes, take this class.\nWorkload:\n50 pages of reading each week (don't have to do it), 30 minute in class midterm and final. 2 take home 6 page essay tests. 1 page discussion section assignments each week.\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "December 14, 2002",
            "review_content": "\nIt meets at 9 a.m. and is thus chock full of atheletes. Most ppl didn't come to class and didn't seem to care about the course material. Overall, Smith oversimplifies a lot of complex things and overlaps with most of Intro to Amer Pols, but the material and readings are really interesting, especially case studies of the Civil-Rights Mvmnt and the Rodney King riots. Smith is a really clear speaker and uses clear Powerpoint outlines; his biggest fault, as noted by a previous reviewer, is his ridiculous political correctness, as though he felt bad for being a white American male (with the last name Smith, for God's sake!). He actually apologized on the last day in case anyone was offended that he did not talk enough about their own ethnic group.\nWorkload:\n3 exams--the first was take home, the other 2 in class. All graded fairly by some great TAs whose intelligence was underused because of the lack of weekly discussion sections on material that many poli-sci majors would have loved to discuss.\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "November 02, 2002",
            "review_content": "\nThis class is an embarassment to the department. Smith assigns six good-sized books, and then addresses none of them. Rather, he spends most of his time recapping everything in w1201 and every time he does get around to talking about race and ethnicity, it's so muddled in unnecessary political correctness that he never actually says anything interesting. Then again, what are we to expect when the guy, in my opinion, threw his syllabus together at the last minute....\nWorkload:\n2 short essays, and an in-class essay test.\n"
        },
        {
            "course_name": "Race and Ethnicity in American Politics",
            "review_date": "May 04, 2002",
            "review_content": "\nComing to this class at 9am twice a week would have been a painful experience. Luckily, the class was SO easy that, with a basic background in american politics, I didn't find the need to attend regularly. The lectures are easy to follow, but totally superficial and only cover the most obvious aspects of the topic. I found the reading interesting, but frusteratingly unncessary. This subject has much potential, unfortunately is it not realized in this course.\nWorkload:\nExtremely light. Six 100-200ish page books (didn't have to read them). One 4-page essay, an in-class midterm, and an in-class (hour and fifteen min) final. \n"
        }
    ]
}