{
    "prof_info": [
        {
            "prof_name": "Emmanuel Schertzer",
            "prof_id": 5505,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "March 15, 2010",
            "review_content": "\nIf you were enrolled in Professor Schertzer's Calculus I section in the fall of 2009, there are a few things you should know:\nProfessor Schertzer resigned at the end of the semester after a relatively short run at Columbia.\nSchertzer created conditions that would make grading final exams easy and painless for himself, because it takes little time to grade exams which are predominantly incorrect. This saved him a lot of time in the few days he had to post grades. He also very effectively lowered student expectations so grade disputes would be minimal.\nHe created a final exam that included material not covered in class. One optimization problem accounted for 11 out of the total 80 points on the exam. This section (4.7) was expressly omitted from the syllabus during the semester.\nSchertzer effectively cut final exam time to 1/2 of the allotted time by showing up 30 minutes late and cutting over an hour off the end of the exam time. This in a time universities have strictly enforced policies allowing students with learning disabilities EXTRA time to complete examinations - beyond the university-wide three-hour allotment.\nIf you were in this section of calculus, you should know you have rights. You can dispute your grade officially by emailing the undergraduate mathematics department chair, Patrick Gallagher, at pxg@cpw.math.columbia.edu and demanding a regrade. You must do this soon because there is a statute of limitations for a grade dispute. If you get no response, talk to the Ombuds office and your advisor. The university has conducted section-wide regrades in the past.\nRegistration for one of the many calculus sections at CU should not be the academic equivalent of playing russian roulette with your GPA. There should be some standardisation between sections. Let professor Gallagher know the math department will be held accountable for hiring unprofessional instructors and allowing them to wiggle out of fair grading and exam administration policies at the expense of student grades.\nFinally, many students, undergrads and post-bacs alike, have adapted to the code of silence that surrounds ivy league education. Express displeasure with your experience and your grades if you feel they've been recorded unfairly. Silently concealing your disappointment with an exam or your grade will serve noone's best interest and will only give you a greater challenge in raising your GPA later in your education. You should share this information with your colleagues. You should expect more from Columbia University.\nWorkload:\nA standard course taken in uncontrolled conditions.\n"
        }
    ]
}