{
    "prof_info": [
        {
            "prof_name": "Carimer Ortiz-Cuevas",
            "prof_id": 1300,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "intermediate spanish",
            "review_date": "May 03, 2005",
            "review_content": "\nIf you are taking a Spanish class because you are actually interested in learning the language, this is the class for you.  Carimer is friendly, encouraging and you can tell she enjoys teaching Spanish. \nDuring the first meeting, she said late homework wasn't accepted under any circumstance, and much to my surprise, she wasn't bluffing. (Papers can be turned in on the day before the deadline though, that worked out for me.)\nUnlike my previous instructors, she takes the class very seriously and is not an easy grader: minimum effort  and a sob story will not get you an \"A\" on this class.  People looking for an easy way to fulfill the requirement  will be better off in another section.\nEven though the workload is heavish, I found it particularly helpful that all major assignments were given weeks in advance.\n\nWorkload:\nhomework, 6 quizzes, 4 compositions, midterm, oral exam, final exam\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "April 10, 2005",
            "review_content": "\nCarimar, like the other reviews indicate, is disorganized, unjustifiably stubborn, and completely unhelpful. She frequently comes to class at least 10 minutes late, and it is very difficult to get her to comprehensively discuss questions of grading. Perhaps she thinks this is an excellent teaching technique, but it does nothing but hinder the learning process.  Her use of the 50 minute class time is the worst I have ever seen at Columbia, most of it is wasted with ineffectual excercises from the book, which is known to be a horrible source.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "March 22, 2005",
            "review_content": "\nOther reviews say that Carimer has an encouraging classroom demeanor and I agree with that. While it is true, that is the entire extent of her positive attributes. As a student you will find that Carimer is largely disinterested and vacant.  She is entirely unavailable outside of class -- she has no office hours, as she claims to have no actual office space -- which is just outrageous. An extension of this behavior is just how unaccommodating you'll find her to be if you have to submit work to her outside of her tyrannical deadlines. She won't accept anything late for ANY reason. She even goes the extra mile to make it extremely difficult if you try to submit work to her early if you have to miss class for some reason. In addition to this, she is an incredibly harsh grader, in my opinion totally out of step with the rest of the Spanish department. And her tests are ruthless because of the time constraints she puts on them. The class is only 50 minutes long, but on test days she usually comes in 5 minutes late because she waits until the last minute to print up the tests. Then she proceeds to talk for 5 more minutes about your next homework or paper or some other waste of time, after which she'll finally start the test that you really need the entire class to take. She will also not give any extra time at the end of class for testing. Almost no one finished her midterm and as a result, nearly half the class dropped out afterwards. If the timeslot for the final wasn't mandated by the department, I'm sure she would tried to give that in 50 minutes too. \nHer grading is completely intransparent as well, as I wound up with an entire grade below what I thought I was going to get, based on my testscores and homework scores. And, big surprise, when I tried to confront her about it, she was completely unavailable. Do yourself a favor and find someone else to take Spanish from. \nWorkload:\nstandard homework. reading of the colonel. 3 papers. a quiz every chapter. a class-halfing midterm, a brutal oral exam and the Donkey punching final .\n"
        },
        {
            "course_name": "Spanish for Spanish-Speaking Students",
            "review_date": "January 27, 2004",
            "review_content": "\nThis class is disorganized to begin with, as everyone is at a different level.  On top of this, the textbook, \"La lengua que heredemos,\" is completely unhelpful and at times even confusing, and the confusion is compounded by Ms. Cuevas' waste of class time on busywork and presentations instead of actual teaching.  The class is conducted like a review more than a presentation of new material, which makes retention especially difficult.  Also, Ms. Cuevas is inflexible, and frustratingly unhelpful,  Her grading system seems almost totally arbitrary.  I would highly recommend Advanced Spanish Grammar and Composition instead of this course.\nWorkload:\nseveral short essays, 2 presentations, periodic quizzes, midterm and final\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 25, 2003",
            "review_content": "\nNow this is the class you want to be in.  If you're a little nervous in a language class and worried about that gringo accent of yours, relax!  Carimer is encouraging and fun as well as entertaining.  She seeks to understand what sentences you are trying to construct, while hopelessly butchering, and doesn't make you feel selfconscious while you do it.  I have the highest praise for her and her class...and I dread language courses.\nWorkload:\nnothing out of the ordinary.  neither an overload or overly-easy.  \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "November 25, 2002",
            "review_content": "\nwonderfully laid back and fun, carimer is a really bright woman and a rockin teacher. she doesn't take anyone's intelligence for granted, which so easily happens when no one can really speak communicatively (which is basically the case in low-level language courses). watch out for her no late papers policy-- she actually DOESN'T accept anything late & you'll get a zero-- surprising for her otherwise chill persona. \nWorkload:\naverage/heavyish: sometimes some exercises for homework, workbook ex.s, 3 essays (longish), reading of Lorca play\n"
        }
    ]
}