{
    "prof_info": [
        {
            "prof_name": "David Harrington",
            "prof_id": 3268,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "October 10, 2007",
            "review_content": "\nDavid Harrington is an amazing professor. He really wants you to learn how to write. He is really chill and down to earth, and his high standards really end up being effective. Don't worry about the grade -- Professor Harrington really cares about how you progress in your writing. He is impressed by people who work hard, because he works hard too. And his grading is pretty clear -- he lets you know beforehand exactly what he is looking for.\nIf you want help with your writing, talk to him! Or, go to the Writing Center in Philosophy Hall.\nI guarantee that by the end of the semester, you will be happy that you got to learn from this incredible writer. And if you get the chance, talk to him. He's actually a very cool character.\nWorkload:\nStandard Uwriting workload -- 4 essays, but many drafts so that you can perfect your work over time. Oh, and he lets you resubmit any paper you didn't do well on and regrades it. Awesome!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 06, 2007",
            "review_content": "\nProfessor Harrington may be a grad student, but he's a great teacher.  He's young and kind of looks like he was a stoner back in high school, but aside from occaisional moments of spacey-ness he's pretty alert and on-the-ball.  He's a good teacher and gives a TON of clearly typed out materials and due dates explaining his assignments.  Everything is also uber organized on courseworks.  He's pretty clear about what he wants and doesn't want, while providing you with plenty of creative license.  He likes that sort of thing, so if you got it, flaunt it.\nHis feedback is detailed and really perceptive and he's extremely available during office hours.  I went to his office hours actually believing he could help me, which is more optimism than I usually have for fixing my writing issues.  He will help you become a better writer if you don't resist him and he allows plenty of revisions so that you've got ample opportunity to get that A or A- if you're willing to work at it.  Don't expect As the first time around, though.  He's a surprisingly harsh grader, given how laid back he seems.  \nWorkload:\nThe typical UWriting course load (Lens, Conversation Progression, Retrospective, etc), along with a bunch of extra reading responses that tapered off towards the end. of class.\n"
        }
    ]
}