{
    "prof_info": [
        {
            "prof_name": "Alexander Rocca",
            "prof_id": 12592,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Literature Humanities",
            "review_date": "January 03, 2017",
            "review_content": "\nExcellent teacher. Easy grader.\nWorkload:\n2 2000 word essays, 35% of  grade\n1 midterm, 15% of grade\n1 final, 20%\n6 400-word reading responses, graded for completion, 10%\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "January 03, 2017",
            "review_content": "\nBy far the best teacher I've had this semester. Funny and gives helpful feedback. He's a fairly easy grader, and probably curves: I got only B+'s on essays but he gave me an A. \nWorkload:\n2 2000-word essays\n1 midterm\n1 final\n~6 400-word reading responses, graded for completion only\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 06, 2013",
            "review_content": "\nHe is intelligent and a good teacher, but the class is so boring! And since I am not the greatest writer and admitted it to begin with through one of the early assignments, he didn't really like me. He is kind of a quirky guy. That being said, he is really smart, which I would appreciate more if he wasn't so cocky. His comments on papers can be helpful, but once you follow his advice from the comments, he finds new ways to correct you. Try not to take UW with him, but, if you have no choice, go to the writing center frequently.\nWorkload:\nThe usual four essays count for the entire grade. There are also a lot of readings that I was unable to bs and ended up reading. He's a hard grader, and likes to give out extra assignments such as peer reviews and reading responses that don't factor into the grade but he claims that the amount of effort you put into the extra assignments affects your essay grades.\n"
        }
    ]
}