{
    "prof_info": [
        {
            "prof_name": "Stephen Massamilla",
            "prof_id": 8696,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Modernist British Fiction",
            "review_date": "May 21, 2012",
            "review_content": "\nProfessor Mass is a nice guy and his lectures are interesting, but his classes are a crap shoot.  Each week, our seminar ran an hour over, and he talked nearly the entire time.  He asked for response papers on most of the books.  The essay questions for the two papers ran two pages single spaced.  This is just his way; he complicates the course to make it much harder than it has to be.  He grades response papers, as an example, \"B/B-\" and says that grade really means \"A- or maybe even an A in some cases.\"  Response papers are said to be \"optional...if you want to be sure to get an A,\" but Prof. Mass grades by check marks and half check marks It's not clear how professor Mass grades, but if you're looking for the easy A or a certain opportunity to earn an A, avoid his classes because you'll be guessing till the end.\nWorkload:\nA classic novel, as \"Heart of Darkness,\" \"Ulysses,\" and \"Women in Love,\" every two weeks.\n"
        },
        {
            "course_name": "20th Century American and British Poetry",
            "review_date": "January 06, 2012",
            "review_content": "\nThis is an email I sent to Professor Massamilla after the class was over: \n\"I just wanted to say thank you again for the class. I enjoyed it very much, and truly appreciated how much effort and thought you put into the sessions. I also was grateful for the extensive comments you put on our papers. You obviously care about the material, and you gave both the students and the poems themselves the attention and respect they deserve.\"\n\nWorkload:\nTwo 1 p. responses, two 4-5 p. papers\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "March 30, 2010",
            "review_content": "\nProf. Massimilla is a nice guy, but I felt completely lost at sea the entire semester.  This might be partially because Massimilla tends to give his own wacky interpretations to the poems mixed in with more traditions ones, and doesn't usually say when he is departing from the norm.  This means that you are never quite sure if you are crazy or prof. Mass. In my opinion, it was usually him-- he can be quite unorthodox in his close readings, i think.   All of this can be quite disorientating to a student new to modern poetry as I was.  Also, the classroom was WAY to small, and every class a few people had to sit on the floors\nWorkload:\nManageable.  Reading assignment for every class, the occasional responses due at recitations, and two larger paper (i believe around 8 pages).  Perhaps most difficult was finding the essay topics, as I never felt I had a handle on anything.\n"
        }
    ]
}