{
    "prof_info": [
        {
            "prof_name": "Hakwan Lau",
            "prof_id": 3464,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Attention and Perception",
            "review_date": "December 11, 2013",
            "review_content": "\nI went into this class open minded and excited to learn something about the material. The material itself if very interesting stuff, especially if you are possibly interested in this sort of detailed brain-imaging, research field of psychology. One problem I had with Hakwan's lectures was I could not understand what he was talking about, due to his lack of transitions and pauses between ideas. He would fly around subjects without any sort of warning as to what he was talking about to the class. He provides notes for all of his lectures which was huge because I ended up having to teach myself the things that he talked about.\nAnother major con of this course was the forma of the quizzes and tests. The material on them was interesting and not that hard to understand, however the manner in which you are tested on the material is highly unfair. Backwards questions and many vague multiple choice options that all seemed right filled the pages. The quizzes were only 8-10 questions long and most of the class usually missed 3-4 due to some trick that was put in there.\nSome positives about the course: you get used to the quizzes. I read the papers for them just before class and they are open note. The lecture notes are detailed and helpful so if you cant tell what he is talking about, these are a great tool. Mock exams are posted before exams and some of the questions from the exams come straight from the mock exams. He only takes 4 of the quiz grades into calculating your final grade; 2 from the first half of the semester and 2 from the second half.\n\nWorkload:\nOpen-note reading quizzes every Monday: 20%\n2 midterms: 20% and 30% respectively\nIn class cumulative final: 30%\n"
        },
        {
            "course_name": "Attention and Perception",
            "review_date": "December 05, 2013",
            "review_content": "\nHakwan is on his way to another University, but I figured I would leave a review anyway. \nThis class had plenty of pros and cons. In the spirt of actually conveying useful information, I will do my best to do justice to both.  For full disclosure, I am currently averaging and hoping to retain a B+.\nGeneral:\nNo text book.\nEvery week there is a quiz on an assigned scientific paper. \nThere are optional papers that are not necessary but immensely helpful. \n3 exams\nA few guest lectures. \nDecent lecture notes are uploaded just before class so you can follow along. \nPositive:\nAs many people have pointed out, Hakwan is obviously brilliant. It is especially clear when the lecture focuses on topics that he is personally involved in.\nThere is no text book. You only read relevant scientific papers. \nThe 10 quizzes are split in to two \"grades\". Only the top 2 from the first half and the top 2 from the second half are counted. \nThere is a review session for every exam and mock exam questions are provided.\nTravis was a super helpful TA. He helped review quizzes, explained complex ideas clearly, and was easy to get in touch with for help. (I find the previous review to be completely unfair. Especially because it was left after 2 weeks of class.)\nExams were scaled. A bit.\nGood/Bad:\nGuest lectures. The guests were excellent researchers doing interesting things. However, their lectures are technical, do not come with notes, and are included on the exam. Very interesting, but also hard to retain and study from. \nThere isn't actually all that much lecturing by Hakwan. Half of Mondays are consumed by qreview_content. review_content sessions happen during class time. Throw in two guest lectures and the final being on the last day of class, and the total number of hour lectured by Hakwan himself, are pretty low. You may find this good or bad.  \nNegative:\nThe exams are hard. Probably the hardest exams I have ever taken. He will tell you this upfront. Even with the study guide and mock exams, they are still really hard. \nThe papers are pretty complex. Most of them at least. The class will certainly teach you how to read and critique scientific papers, but mostly by way of sheer volume mixed with trial and error.\nHakwan is a brilliant researcher. He is a mediocre lecturer. (and would probably admit it if you asked him) He gets the job done. The lecture notes help. \nIn summary, I would say that this class is structured a bit more like a scaled up seminar than a regular undergrad class. It is hard, but manageable. The resources are there if you exploit them.  If you are looking for an easy A, look elsewhere.  If you are interested in, or think you might be interested in, learning about attention and perception from a world class researcher with a good TA to pick up the slack, it's a good class. \n\nWorkload:\n1 Quiz Per Week.  4 out of 10 are Counted. Open notes 20%\n3 Exams. 20% 30% and 30%\nReading: \n1 Mandatory Paper Per week\n2-4 Optional Papers Per week\n"
        },
        {
            "course_name": "Attention and Perception",
            "review_date": "September 17, 2013",
            "review_content": "\nThe lecture is refreshing. It includes update information from research and experimenters' first hand experience. The best aspect is the professor often integrates philosophy into psychology, looking into the principle instead of surface of any question.\nMy only complaint is: \nThe actual lecture portion on Mondays is too short, whereas the Quiz takes unnecessarily too long out of it.\n1) 10 questions multiple choice questions, in real world, would not be given more than 7 minutes, e.g., MCAT, LSAT;\n2) The most the male TA talks too much for too long, and 80% was useless information Travis seems to really love listening to himself talk, but nobody else does. Please keep our pain as short as possible and by a mirror. Travis takes 45 minutes out of 85 minutes lecture every Monday, to practice his Socratic method, or something, but it is pretty obvious half of the time he just made up some BS and he does not even believe his own explanation. What a waste of time!\nPlease, if there were a balance of quality and quantity: may the use of time on Monday lectures be more efficiently allocated. \nWorkload:\nWeekly quizze (10-15 multiple-choice questions), 3 in-class midterm and final, \n(i.e., you will find yourself taking some sort of written exam more than 50% of the time, in term the entire semester).\n"
        },
        {
            "course_name": "Attention and Perception",
            "review_date": "January 22, 2009",
            "review_content": "\nI agree with the fist reviewer.  He seems like he might be good in a seminar, but he was the worst lecture professor that I have ever had.  He told us flat out on the first day that we need not come to class.  The lectures were posted online.  That is what was tested.  The concepts were simple.  The questions and grading process were not.  I think the mean on the first test was something like a C+ (due entirely to question wording and subjective grading), and he did not curve the class like he said he would.\nHe's a new prof, and hopefully he'll get better.  He seems extremely intelligent, but I would stay far, far away from any lecture he's teaching.\nWorkload:\n3 midterms (1 is dropped), and a final, all weighted the same.  There is optional reading (of primary source papers) that does not relate to the tests, and absolutely no homework.  Class is not required.  Study for a few hours the night before the test, and hope to God that you will answer EXACTLY what was expected.\n"
        },
        {
            "course_name": "Attention and Perception",
            "review_date": "January 05, 2009",
            "review_content": "\nAt the start, I do not recommend Attention and Perception with Hakwan Lau. \nYes, the man is intelligent, evidenced by his history as a Rhodes Scholar, among other accomplishments. However, the class is very unorganized, confusing even the most dedicated students. Although he uses powerpoints, the words on the slides are so few that they are rendered useless. Instead, he tells you to review his notes, which he hands out before every class. I laud Lau here because he wants you to actually pay attention to what he is saying, since you have the notes and need not spend your time taking them. Problematically, as this is the ONLY material there is for the course (optional readings do not appear on exams), you will find yourself struggling when studying. The notes are incoherent, disorganized, and contain for too much information of which his overly specific exams (a combination of short answer, true false, and essay questions, all open ended) demand precise regurgitation. In the beginning, the class was overjoyed at hearing we'd have no reading and would only need to review his notes, but after taking his arbitrary exams based on his ambiguous notes, the ENTIRE CLASS soon felt the effects. Plus, the TAs were all harsh graders. Although I believe he curved the final exam, I have heard many say that he hasn't. I never saw my exam so I really do not know.\nDO NOT TAKE THIS CLASS \nWorkload:\nNone -- just study his obscenely confusing class notes; three midterms (one you can drop) and one final (cumulative) -- It looks easy, but ask anyone who took this class and they will unanimously say otherwise.\n"
        },
        {
            "course_name": "Philosophical and Empirical Issues in Consciousness",
            "review_date": "December 14, 2008",
            "review_content": "\nI'm deeply suspicious of the scathing review of Dr. Lau. He is indeed a very highly regarded researcher and a Rhode Scholar. He is also young and enthusiastic. Making an appointment to discuss class material was never a problem; his door was always open.\nPhilosophical and Empirical Issues of Consciousness was a great class. Coursework was very light. Grades were generous and based to a large degree on effort. If you made the effort, you got a good grade.  Because this class was a joint effort between Columbia's Psychology Dept and NYU's Philosophy Dept, we were given the option of either doing a 20 page term paper (for the philosophy students) or 4 short lit reviews of papers we discussed in class (for the psyc students). There were no exams.\nClasses were really interesting (the class was taught in conjunction with Ned Block at NYU) and didn't require too much preparation (although the reading was heavy). Not too surprising considering it's a four credit graduate level class.\nUnfortunately this may have been a one time seminar, but if you have the opportunity I would highly recommend taking Prof. Lau's other classes.\n\nWorkload:\nVery light, although there was a lot of background reading.\n"
        },
        {
            "course_name": "Consciousness and Attention",
            "review_date": "December 09, 2008",
            "review_content": "\nProfessor Lau is an excellent teacher. He maintains a nice tempo in the class by encouraging students to analyse papers alternating with him teaching the essentials. He takes great interest in student learning. For student presentations, he was readily helpful and forthcoming in pointing out the right direction. He himself is intimately familiar with the literature in the field as also in a wider area of research. This was very helpful in his teaching the students about the current and historic research. He also explained statistical methods used which was extremely helpful. He took the effort to make students comfortable in the presentation but at the same time, encouraging a high level of work. Overall, I very much enjoyed his class and learned an immense amount.I also appreciated his advice about presenting material and learned about communicating scientific ideas in the class. Highly recommended!\nWorkload:\n1 paper each week to be prepared for debate; one class presentation; its fun.\n"
        },
        {
            "course_name": "Attention and Perception",
            "review_date": "May 29, 2008",
            "review_content": "\nDo not take this course. Are your paying attention: do not take this course. Hakwan is a young professor who is apparently a talented researcher. He has good intentions but the class is worthless. We weren't given a text book and the exams were graded way too subjectively for a psych course. The TA actually wrote much or most of many of the quizzes (which were horrible).\nHakwan likes to say things that he doesn't deliver. Like that he will curve the final (he didn't). And his notes, the only material you have to review, are akin to a stream-of-\nconsciousness rambling about all things related to attention and perception.\nAnother point: this class is painfully boring. Literally most of the class (close to half) stoped coming for most lectures. I had thought that Attention and Perception sounded like a fascinating subject--if it is, it didn't come across in class. Everyone I talked to said the class was the more boring or one of the most boring that they had even taken at Columbia.\nStay clear.\n"
        }
    ]
}