{
    "prof_info": [
        {
            "prof_name": "Joseph Slaughter",
            "prof_id": 758,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Narrative & Human Rights",
            "review_date": "January 24, 2015",
            "review_content": "\nProfessor Slaughter is one of the best professors I've had at Columbia. While this class was taught as a lecture, Slaughter always encourages his students to ask questions, to challenge his interpretation and to participate in dialogue. He knows that some of the material he covers is difficult to grasp, and always makes sure students are following before he moves on to the next topic. \nIf you are taking notes by hand, you'll come out of each class with cramps in your fingers from writing so much: everything he has to say is relevant and fascinating. The readings he assigns are equally great. Each class is centered around 1 or 2 legal texts along with a literary or creative work (novel, graphic novel, film, comic strip etc etc), with occasionally some responses to submit on line (approx every 2 weeks). There is definitely a lot of reading, but Slaughter knows you might not be able to get to all the secondary texts. \nProfessor Slaughter's course helped me in all my classes, and has really challenged the way I understand literature, story-telling and human rights. TAKE THIS CLASS. \n\nWorkload:\nTwo 4-5 page papers and one 7-8 page paper. Each paper asks you to compare at least one of the literary texts with a legal or academic text about human rights. \nThere are also biweekly online posts, but those can be short. \n"
        },
        {
            "course_name": "Narrative & Human Rights",
            "review_date": "January 12, 2011",
            "review_content": "\nThis was easily the best class I've taken at Columbia. Professor Slaughter is absolutely brilliant, and he chose varied and interesting readings, tying together everything from international law to documentaries to novels, plays and literary theory. His lectures are mindblowing: be ready to take comprehensive notes, because he manages to draw from tons of material every class. He also managed to somehow make his large lecture class feel like a small discussion.\nThe best part about the class, though, was that Professor Slaughter introduced as many questions as he answered, and he was legitimately interested in his student's creative interpretations. He gave us enough material to draw from, but left it open for discussion.\nWorkload:\nLots of readings, but you can be selective if you want. Three take-home exams (strict four-to-five page limit, had to include one piece of literature and one technical piece per essay). Be concise, and draw new conclusions: Professor Slaughter is not interested in hearing his lectures regurgitated verbatim. Extra TA sessions were provided for undergrads: go! And don't stress too much about the grades. I got a better grade in the class than I had on any of the papers, simply because the profs knew I had a handle on the material.\n"
        },
        {
            "course_name": "the African Novel",
            "review_date": "May 04, 2007",
            "review_content": "\nJoey is one of the best professors I have ever had a Columbia. He facilitates discussions without lecturing or letting chatty students run the class, adds interesting and useful insight into the readings, and really presses students to think about the issues that come up in class with more than a superficial understanding. Amazing. Plus, his book selections were phenomenal -- you really get a broader understanding about the transitions and formation of modern African literature.\nWorkload:\n2 8 page papers, 2 provocations presented in class, a book a week. Do-able and fairly graded. \n"
        },
        {
            "course_name": "Parody, Plagiarism, Postcolonialism",
            "review_date": "July 01, 2006",
            "review_content": "\nJoey's a bit...prickly, on the surface, but after a few classes he definitely opened and made our class one of the most unusual and fascinating courses I had as an English major. \nGiven the continued \"trendiness\" of postcolonial studies Joey does a good job of finding new and unique ways of exploring a field that's really vast. By focusing on texts that have been accused of plagiarizing more well-known \"Western\" texts, the class managed to both find ways to discuss more general issues of postcolonial writing and to enter into some problems and issues of copyright, authorship, cultural history, etc. Joey never forced the class to find definite answers but instead allowed for a lot of leeway and open-ended discussion. Given the often-\npolarizing political questions that can accompany discussions of postcolonial societies, I was impressed by his consistent ability to allow for different viewpoints but keep the discussions engaging and relevant. He's got a very unusual take on the issues raised by the texts and always pushed our class to really explore what the authors were doing, implying, or creating. It was the best class I had all semester - certainly the one that I learned the most in. \nWorkload:\nA novel every two weeks, critical essays, one presentation, one short response paper, and a final term paper. Very manageable. Grading was fair - certainly more generous that I had at first anticipated. \n"
        },
        {
            "course_name": "Narrative & Human Rights",
            "review_date": "January 09, 2006",
            "review_content": "\nI absolutely loved this class!  The books that you read can be fairly depressing, but in most cases they are books you would never have found on your own.  The novels are diverse and thought-provoking and the theoretical pieces fit together nicely with the novels.  I highly recommend this class to anyone interested in human rights because it brought up many issues that are important, but often overlooked in other types of human rights classes.  When I took this class it was offered as a seminar, but I believe in the future it will be a lecture.  In some ways this is unfortunate because our discussion was generally wonderful, but at the same time I always wanted to hear more of what Joey had to say.  TAKE THIS CLASS!!\n\nWorkload:\nVery reasonable.  A novel every other week - caution, the novels can be very emotionally trying - then two theoretical essays the other weeks.  Theoretical works can be trickier, but by the end of the class I felt I had an excellent grasp of the material.  Two papers 6-8 pages, two short responses during the course of the class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 23, 2003",
            "review_content": "\nwhile nothing is fed to you...you are made to think and come away with interesting questions on the readings.\njoey's comments on your papers (while they might upset you) are incrediably intelligent.  joey is lay back and really easy going, which makes class amazing.\n\nWorkload:\n4 papers, midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 18, 2003",
            "review_content": "\nAfter reading the previous review of Prof. \nSlaughter's LitHum class,  I went straight to my dean to switch out.  Lucky for me, I was unable to do so.  Prof. Slaughter deserves a lot more credit than many give him- yeah, he's not the Columbia diehard who's going to convince you that these books are the greatest thing ever written- but he'll challenge you to make that decision for yourself.  This class is totally what you make of it- if you're interested, he'll engage you and challenge you.  If you want to sleep through class, you can do that, too.  \nWorkload:\n4 short papers, midterm, final\n"
        },
        {
            "course_name": "West African Novel, Comparative Postcolonialisms",
            "review_date": "February 01, 2003",
            "review_content": "\nProfessor Slaughter is one of the most engaging teachers I have had at Columbia in my four years here.  His relatioship to the material is terrifyingly erudite, and his lectures are always packed with information, criticism, and, most importantly, suggestions on how to responsibly process new information acquired outside of the classroom.  An excellent seminar leader, also.\nWorkload:\nHeavy.\n"
        },
        {
            "course_name": "Third World Bildungsroman",
            "review_date": "December 29, 2002",
            "review_content": "\nExcellent class and professor.  Slaughter is super smart and takes an interesting and comparative look at postcolonial fiction.  Novels are read alongside theory (both Western and non-Western) and his in-class lectures, while nontraditional, reveal new and complex ways of looking at the texts.  I never wanted to skip a class since I knew I'd get more out of the readings after hearing his lectures.  And he's a really nice and funny guy, always open to suggestions and comments and discussion topics.\nWorkload:\n4 nongraded responses (\"instigations\") on class bulletin board; two 8-10 page essays.\n"
        },
        {
            "course_name": "Postcolonial African Literature",
            "review_date": "January 15, 2002",
            "review_content": "\nThis class was definitely a challenging experience; I really had to earn my A-, a rarity in a department where an A- seems to be the consolation prize. I went into the class knowing very little about postcolonial theory and even less about African literature, so jumping into a class where grad students casually threw out the names of theorists I had never heard of like they were close personal friends was pretty terrifying. Prof. Slaughter is extremely accessible in office hours, however, and when I went to see him about feeling that I was in over my head, he seemed legitimately interested in hearing my suggestions for improving the class dynamic for the frightened undergrads. Prof. Slaughter did try to give historical background for each work we read (and to curb the in-class enthusiasm of the grad students), but it was still a hard row to hoe if you didn't already have a good handle on the subject. Overall, I would say that the fit between postcolonial theory and African literature was an awkward one; two such huge and daunting subjects really each deserve their own class. I did learn some stuff, but I was left feeling like we had only just scratched the surface. I did like that Prof. Slaughter made use of the multi-media technology in the classroom!\nWorkload:\nThree two-page responses to the reading (said to be ungraded); insane midterm combining both long paper *and* substantial in-class essays; much more reasonable final (see, I told you he listens to student feedback!) consisting only of a longer take-home paper topic.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 13, 2001",
            "review_content": "\nRun... run far, FAR away. This man couldn't care LESS about Lit Hum. If you're actually interested in exploring the texts in a meaningful way, don't stay in this section. Sure, he's not the hardest grader in the world and he's an INCREDIBLY nice guy (one of the nicest professors you'll ever meet), but you literally will not learn a thing for 2 semesters. His expertise is post-colonial literature (which he will repeat several times). Sure, sucks for him that he has to teach Lit Hum, but it sucks more for YOU! Leave now!\nWorkload:\n5 obnoxious \"responses\" (read: academic papers), Midterm, Final.\n"
        }
    ]
}