{
    "prof_info": [
        {
            "prof_name": "Ann McDermott",
            "prof_id": 1834,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry I",
            "review_date": "March 13, 2011",
            "review_content": "\nI honestly didn't really learn much from her. She lectured from a powerpoint every class, and though I could feel her enthusiasm and passion for the topics, I just couldn't engage myself. I found it hard to follow her because sometimes she would go off on a tangent, or talk about something really complicated and I would find myself even more lost than before.\nThere are iClicker questions in class that are designed to reinforce the material and participation in graded. However, I don't think I really benefited from them at all.\n\nWorkload:\n3 midterms, 1 final (and weekly quizzes in recitation)\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 05, 2011",
            "review_content": "\nEspecially towards the second half of the semester, McDermott sometimes rushed through lectures and rambled about proteins and biological chemistry (while doing a cursory job discussing various other topics that we would need to know for her final). Her tangents about real-world applications of the course material would have been more interesting for her audience had her discussions been more in-depth. Nonetheless, it's evident McDermott's quite dedicated to her students as she frequently asks us for critiques and suggestions on how to make her lectures more effective (with extra credit given as an incentive).\nIn addition, as a renowned researcher and National Academy of Science member, McDermott is extremely passionate about her subject and her brilliance in chemistry allows her to be an effective professor and excellent lecturer at times. It is recommended that you go to lectures (especially during the second half of the semester) if you want an A in her class. She covers a number of topics such as IR spectroscopy and NMR to a much greater depth than the textbook does. Since her own research happens to focus on spectroscopy and NMR, her passion for the subject matter made these lectures quite engaging. \nShe can be very helpful during office hours and offers many, many opportunities for extra credit (you can get up to 10 points). If you get McDermott's section, keep it! Despite the shortcomings of the class, you end up learning a lot of chemistry.  If you do the textbook readings/problems and carefully study the material in McDermott's slides that she posts on Courseworks (it doesn't always overlap with the textbook material, but is an excellent predictor of what she will put on tests), an A is very doable in this class.  \n\nWorkload:\n3 midterms (25 questions per midterm with 4 points per question = 100 points per midterm ), 1 final (200 points). 7 recitation quizzes with lowest two dropped add to 100 points, equivalent to a midterm. Your lowest midterm or midterm equivalent (100 points) is dropped. If your final is your lowest, it counts for only 100 points. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 25, 2010",
            "review_content": "\nMost of the kids in the class are either SEAS or pre-med students fulfilling their requirements. The grade is based on 6 sections-- 3 midterms, a final (which counts for 2 sections), and the weekly quizzes. The lowest of the 6, based on z-scores, is dropped. \nMy one biggest complaint is that McDermott seems to dwell on some subjects much more than others, while she tests us mostly on the material form the book. Class participation isn't necessary, although she does use those annoying i-clickers to see participation levels (which only count for extra credit anyways).\nThe TAs are all really helpful, though you should be fine without their help.\nWorkload:\n3 midterms (25 questions each), weekly quiz in recitation, and a final; homework assignments are given as a guide but are not collected\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 25, 2010",
            "review_content": "\nProf. McDermott tries to make the class as interesting as possible, and always takes feedback on how to improve lectures. However, there seems to be an inherent disconnect between her and the students. The lectures are pretty useless, but I was forced to make the effort of going to class to get the dumb i-clicker bonuses (which amounted to 5 points at the end of the semester out of 500, arguably not worth the effort of going to class every single day). \nIf you don't know the grading system, it is a combination of weekly recitation quizzes (1/6), 3 midterms (3/6), and the final (2/6), where your lowest equivalent is dropped. \nThe exams were multiple choice which may seem like a breeze, but really it is not if you consider that a few careless mistakes will put you pretty close to the average grade. Also, don't blow off the quizzes. That may seem like the easiest 1/6 to drop, but the quizzes are always predictable whereas some questions on the exams are tricky and/or test you on knowledge of an exception to the rules. \nConclusion: don't take this class too lightly, as I did, or you will end up with a sub-par grade. It is pretty straightforward but still requires work. \nWorkload:\noptional HWs which I didn't think was directly helpful to the exam questions. Also, unlike what previous reviewers said, there were no repeat questions on practice exams vs. the real one. Except that the Final itself had repeat questions from the midterms. \n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "April 13, 2006",
            "review_content": "\nJohn is BRILLIANT!!! He is very helpful and supportive. \nAnn is really nice, however she isn't that knowledgeable of the material and couldn't answer many of the questions asked in her review sessions if they weren't from the material that she was assigned to review. (ie if she was leading a review session about chapter 10, and someone asked a question about a concept in 9, she usually could not answer it). \nSo I suggest you go to John's review sessions and just pick up Ann's review session handouts. ;)\nWorkload:\nNA\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 19, 2005",
            "review_content": "\nA really good class to take if you have had some background in chemsitry and can learn from the book on your own.  The lectures are not very helpful and most people don't bother going to class after the first few ( I went to almost all and it really did not vastly improve my understanding...but a one or two things that come up on exams are only heard in class...and the TAs base the quizes on the lecture material).  The class is wonderful because the exams are relatively easy and you are able to drop one exam equivalent at the end of the term.  Most of the exam questions come from homework and practice exams that she posts on courseworks.  The prof is really nice, speaks clearly, and often stops to take questions.  She relies on e-mail to commuicate with her students, as so few attend class.  I would definately recommend the class.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 17, 2005",
            "review_content": "\nProfessor McDermott  is a very nice person. I think she really loves  chemistry and loves sharing it with her students. Her lectures are all on powerpoint and so some people think that they do not need to go to all the lectures.  Her class was somewhat boring but i never thought it was hard.  Overall I liked her class, i herd she was the better choice of the 3 professors for the first semester\nWorkload:\nThe homework is not graded but the quizzes are always based on the homewoe\\rk, so do the homework. Midterms and Final are not bad. Everything is based off of the questions in the book, some are repetative so you have no reason to fail this class\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 03, 2005",
            "review_content": "\nIf your going to take Chem 1403, take it with McDermott.  It is obvious she cares and she is very approachable. There is no reason to go to class, however as she doesn't teach you what you need to know. Yes, her lectures are related to the topics, but your time will be better spent digesting the text. Trust me, I went to every lecture because I was afraid I would miss something if I didn't.  Her lectures were useless.  Learn the textbook, learn how to do the homework problems, learn how to do the problems from the practice exams she posts and you can get an A.  I did, and I had a useless TA for recitation. But don't waste your time in class!\nWorkload:\nWeekly HW (not handed in). Weekly quizes in non-exam weeks. 3 Midterms plus 1 final. Lowest grade (1 of 3 midterms, 1/2 final or all quizes) is dropped.\n\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 24, 2004",
            "review_content": "\nProfessor McDermott truely cares about her students.  She's relatively organized in that courseworks is used and usually up to date.  Exam grading did take a LONG time, considering they were multiple choice.  Her lectures don't always focus on what you'll be tested on, but if you go and pay attention, you'll have a leg up for the final where she draws from lectures for her questions.  The other midterms are virtually (at least 95%) directly from the sample exams/old exams that she publishes.  It's possible to do no reading, not go to class, but know the sample questions inside and out and get virtually perfect scores on the exams.\n10 bonus points are available during the term.  Most are easy to earn and you'd be stupid if you didn't take advantage of them.  Text book is reasonable and while her lectures help clarrify the text book, towards the last third of the term the lectures seem to come directly from the text.\nAll in all, I would highly recommend this prof.  I'd make the extra effort to go to class and get to know her.  It will help you, I promise.\nShe understands this is a first semester collegiate course for many in the class and does everything she can to help those who put a viewable effort in.  She offeres homework sessions for those who want extra help or just want to work thru problems with others.  She goes beyond what other profs who teach this course do to help.\nBut, be warned......  If you don't want to learn the material, it's fairly easy to slide by without learning it.  That will only be detrimental if you move on to Chem II and/or Orgo, so do the work and learn it.\nWorkload:\nWeekly HW (not handed in).  Weekly quizes (5 our 8 count towards grade).  3 Midterms plus 1 final.  Lowest grade (1 of 3 midterms, 1/2 final or quizes) is dropped.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 27, 2004",
            "review_content": "\nAnn McDermott is an able, caring teacher who tries hard to impart knowledge and makes time for students.  A terrific dinner for students was held as well as a museum lunch (she attended both).  The trick to doing well in her class is (a) knowing that 80% of the exam questions come from the text HW and doing problems over and over, (b) make sure you're in a TA section where you can kick butt (switch if you must), (c) BONUS POINTS.  You've got to go to class because bonus point assignments are given out (some involve spending time outside of class on NMR - make the time!).    They add up.  \nWorkload:\nWeekly TA quizzes.  3 midterms.  1 final exam.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "April 12, 2004",
            "review_content": "\nTake this class if you want to have a class which you wont attend after the first one. Seriously, after going to one or two, you will realize that there is no logical reason to attend thic class. First of all, it is extremely boring, not only the professor, but also the stuff she teaches. Secondly, she goes from slides and posts all the slides to courseworks, so youll know what you are missing before the exams. And laslty, she posts practice exams, which are identical to the actual exams, only the numbers in the questions are changed (if there is no number to be changed in that question, youll see the exact question.) By the way all exams including the final are multiple choice (Man this class is really a joke). So if you want an easy A without even going to class and without spending time on the material, take this one. If you want to learn chemistry, you should go somewhere else.\nWorkload:\nWeekly optional problem sets (which consists of 35 questions from the book and which youll never do), weekly quiz in recitations (which are extremely straightforward and easy), three midterms and a final (all multiple choice, really easy except for the last question)\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 18, 2004",
            "review_content": "\nDoes all lessons with projector. Basically high school chemistry all over again. Easy if you remember it, more difficult if you don't. Professor McDermott is very interested in chemistry, though, so she teaches with a lot of enthusiasm. Encourages questions. First few lessons are history of chem. Later gets into how chem relates to today's world.\nGives some extra credit, which includes filling out a course evaluation online and writing questions for her to use on the exams. If she uses them, you get credit.\nHomework is optional, but exams are easier if you do it. There's A LOT of homework.\nWorkload:\nHomework set - about 35 questions per chapter, but only 9(?) chapters are taught. Weekly quiz in recitation, except during exam weeks. 3 midterms, 1 final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 07, 2004",
            "review_content": "\nI spent most of the class wondering why I physically could not stay awake.  McDermott seems to honestly try to put together an interesting lecture; she speaks clearly, attempts to incorporate applicable facts, addresses questions quickly, and seems to offer sufficient outside help (although I never took advantage of this).  However, all of her lectures tend to blend together into one long slideshow of meaningless pictures and equations with no real information or explanation.  The class also jumps around from chapter to chapter which makes just reading the book difficult as well.  The 20 question m/c exams are pretty straightforward and come from the practice tests.  One standard deviation was usually the equivalence of 1-3 questions, so your final grade really depends on how many of the practice tests you read through and how good you are with m/c.\nWorkload:\nWeekly quizzes (many dropped), 3 midterms (one dropped), 1 final\n"
        },
        {
            "course_name": "G-Chem I",
            "review_date": "December 31, 2003",
            "review_content": "\nAnn is a great professor! As you can tell I loved this class and I didn't even get a grade I like. If you don't have a good background in chemistry (no AP course or it was all over your head) this class is for you. Ann keeps the work at a moderate pace and tries to make sure everyone understands the material before moving on.  This means if you already have a good grasp of chem and really want to get a strong science major approach with the concepts -take TURRO.  A few students complained for harder material and many students were able to pass the exams without attending class.  Ann posts her lectures on-line and does follow the text material (no surprises). (Shows you how nice she is.) Ann truly cares about the students understanding the material; is always available and approachable; keeps good TAs; and is straightforward with the work. This felt like a chem class for non-science majors. A great thing for those who don't have a strong science background. Her grading is very fair and even lienient.\nWorkload:\nweekly quizzes (best 5); weekly hw from the textbook (unchecked); 3 midterms (best 2 out of 3) and a final (it was very straightforward). Just do the homework and study the review papers and you'll be ok.\n"
        },
        {
            "course_name": "G-Chem (first semester)",
            "review_date": "December 04, 2003",
            "review_content": "\nAnn is a very good chemistry professor.  Her lectures are well-organized, she makes sure that the students understand the material, and she means it when she says that 80% of the test material will be from homework.  She consistently advertises her office hours and help sessions as well.  If you see her name next to a chemistry section you wish to take, sign up because it will be a good experience\nWorkload:\nweekly problem sets, quizzes (in recitation), monthly exams, final (moderate difficulty)\n"
        }
    ]
}