{
    "prof_info": [
        {
            "prof_name": "Mirella Servodidio",
            "prof_id": 1417,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Archetypal Figures in Contemporary Women's Fiction",
            "review_date": "May 09, 2004",
            "review_content": "\nProfessor Servodidio is an incredibly interesting and brilliant woman. We read some of her published essays about the books we were reading, and they were all great. That said, the class can get somewhat boring--this might be more of an indication of a small discussion class that's sometimes reluctant to discuss rather than of her shortcomings. Either way, I was glad when it was over. The class periods seemed very long.\nWorkload:\nHeavy--lots of novels, short stories, poetry and a thick reading manuel. Three papers and a final.\n"
        },
        {
            "course_name": "Literature and Culture from the Enlightenment to the Generation of '98",
            "review_date": "May 20, 2003",
            "review_content": "\nServodidio, undoubtedly an engenue of her time in certain nooks of the literary world, is clearly in my opinion past her prime. First of all, she refuses to listen to interpretations of literature that challenge her own, and blatantly refuses to call on students who tend to offer such criticism. Secondly, she holds students to their own personal standard of grading, which is optimal in an ideal world but sadly unfair in our current academic system. Thirdly, she seems to hold a grudge when it comes to Columbia College females. A Barnard student and Barnard professor herself, she politely looked the other way when some CC females raised their hands and insisted on calling on all 5 males in every single meeting of the class. I do not recommend this class if you are in any way an innovative, creative or argumentative student.\nWorkload:\nFair amount of reading, two explication papers, long midterm, final.\n"
        },
        {
            "course_name": "Literature and Culture from the Enlightenment to the Generation of '98",
            "review_date": "May 20, 2003",
            "review_content": "\nServodidio, undoubtedly an engenue of her time in certain nooks of the literary world, is clearly in my opinion past her prime. First of all, she refuses to listen to interpretations of literature that challenge her own, and blatantly refuses to call on students who tend to offer such criticism. Secondly, she holds students to their own personal standard of grading, which is optimal in an ideal world but sadly unfair in our current academic system. Thirdly, she seems to hold a grudge when it comes to Columbia College females. A Barnard student and Barnard professor herself, she politely looked the other way when some CC females raised their hands and insisted on calling on all 5 males in every single meeting of the class. I do not recommend this class if you are in any way an innovative, creative or argumentative student.\nWorkload:\nFair amount of reading, two explication papers, long midterm, final.\n"
        }
    ]
}