{
    "prof_info": [
        {
            "prof_name": "Michelle Levine",
            "prof_id": 11014,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Cognitive Psychology Lab",
            "review_date": "April 23, 2013",
            "review_content": "\nShe is the worst \"professor\" I've ever encountered at Barnard. She should be fired. When I graduate in a few years, I intend upon writing a letter outlining the various reasons why she's a bad instructor and how she ruins the lab experience. She's the kind of professor that makes me not want to donate to this school, ever.\nShe is not clear. She does not explain anything well, and expects her students to magically figure out what she was TRYING to say.\nNot only that, she is crazy, mean, and unfair. The only way you're going to do well in this class is if you are a gifted academic, a senior, a psych major, or a total suck up - with emphasis on the latter.\nAn example: this semester, she randomly broke out in a yelling fit because she felt not enough people were participating during the mental rotation lab. She literally made a girl cry. Keep in mind that this lab class is full of people who don't know psychology well (no less understand the complexities of MENTAL ROTATION) and are just trying to fill the requirement. Most don't have anything insightful to say, and if they did, they wouldn't know when or how to say it because she is so unbelievably unclear.\nOh and by the way, she'll try and dock points off of your grade in any way she can. If she doesn't like you (she picks and chooses random people to not like), you're screwed.\nThe bottom line is you should stay far away from her if you can. If you can't, suck up to her.\nWorkload:\npapers every week. labs every week.\n"
        },
        {
            "course_name": "Perception Lab",
            "review_date": "December 21, 2012",
            "review_content": "\nWow, these reviews are incredibly cruel and unfair. I want to preface this by saying that I am neither a psychology major nor adept at any form of science. I took this class merely to fulfill the science requirement. I was pleasantly surprised by how well this class went. \n I thought professor Levine was very clear in her lectures, almost too clear sometimes. She always took time to explain concept and answer questions. Unlike another professor who substituted for her a few times. She also clearly made an effort to make the material seem interesting by bringing in a flutist, discussing her own research, and having us participate in fun activities in class. \nYes, we were required to know more information than was discussed in class: this seems like a standard practice, the previous psych courses I took had the same format. \nThe exams were challenging as they should be in a college setting. What compensated for this though was the generous curve. Grades in the 74 range, the class median, were curved to an A-. \nAs for the lab, yes, it was long and drawn out, in my mind as all labs should be. But the experiments involving the mberry pill and the final experiment which we designed ourselves were quite interesting. For all the labs, instructions were clearly laid out. There were no surprises. \nI think Levine is a pretty good professor. \nWorkload:\nLecture: three exams\nLab: weekly assignments, final lab report \n"
        },
        {
            "course_name": "Perception",
            "review_date": "December 17, 2012",
            "review_content": "\nAfter having two semesters with this professor, my advice to you is to stay far far away. The alternative in the psychology major (neuroscience) is not only easier, but taught by a far better professor. It becomes clear in class that Professor Levine does not really have a clear handle on what she is teaching. Her tests do not reflect what she teaches at all. Overall, a really unclear class with no clear objectives. Additionally, she does not make it seem like she enjoys teaching whatsoever.\nWorkload:\n3 midterms\n"
        },
        {
            "course_name": "Perception Lab",
            "review_date": "December 15, 2012",
            "review_content": "\nShe is a really bad professor and is very partial to students that she likes. Her class and lab are very boring and she takes off points for the stupidest reasons. I think she spends at least 30 minutes each lab with her TA to talk about how every word should be equally spaced and every page number and should be in the same font. This class is mind-numbing. I don't think she realizes that she's teaching a class full for college students and not elementary school. And please she needs to stop with stories about her dog.\nWorkload:\nWorkload isn't hard just really monotonous and she takes off points for almost everything. \n"
        },
        {
            "course_name": "Perception",
            "review_date": "November 02, 2012",
            "review_content": "\nProfessor Levine is a terrible professor. She refuses to answer questions, often promising to answer them later and never getting to them. She does not cover a lot of what she puts on the exams. It's not uncommon to hear her say \"We won't go over this in class, but be sure to review it for the exam\" -- this is not for one or two concepts, but could include as many as 10 outside articles that she will never address. Her exams are a crapshoot, it's impossible to figure out what will be on them. She gives you a \"fair game sheet\" but then most of it is \"study entire chapter\" which is not very helpful at all. In lab she is rude and likes to take points off for little things. For instance, she will take points off if your page numbers on your lab report are in the wrong font, never mind that the content of the report is great. It is very hard to connect with her, and as the last post mentioned, she is not at all engaging. She comes in to class ready to \"get it over with\" and doesn't really care about the success of her students. I'm confused as to why she is a professor -- she must really hate her job and students in general. Being in her class is painful, and I can't wait till it's over.\nWorkload:\nthree midterm exams, each weighted the same. nothing else.\n"
        },
        {
            "course_name": "Cognitive Psychology Lab",
            "review_date": "April 29, 2012",
            "review_content": "\nJust wanted to warn you off this woman, because no one warned me.  Actually, no, I asked a friend about her, and my friend said she's cool--apparently that's only if she really likes you.  Maybe she is actually a perfectly decent person but my friends' and my experience with her this semester was not good at all.  I don't want to say anything too identifying, but she badly handled a situation with a friend of mine who made an honest mistake on an assignment--to take a lot of points off is one thing, but to also use needlessly harsh language with her?  Apart from that, she also just isn't good at engaging her students, and the assignments are bizarre (\"write a discussion section of a lab report pretending that you did this experiment when really you totally didn't lol\").  I did well on all the assignments--that isn't my problem.  Just take this lab with caution.\nWorkload:\nnegligible--not the point!\n"
        }
    ]
}