{
    "prof_info": [
        {
            "prof_name": "Elizabeth Miller",
            "prof_id": 2861,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Readings in Cell Biology",
            "review_date": "August 01, 2013",
            "review_content": "\nLiz Miller's Readings in Cell Biology course was one of the best classes I took at Columbia. It is a seminar style course, which means you can have truly in-depth class discussions about a paper (not the cursory glances at the figures that you'll see in big lectures) and everyone has ample time to ask questions. Since the readings follow a single lab through a set of papers, you get into the intricacies of each experiment, why they might have chosen one method over another, and how to ask the follow-up questions to lead into the next paper. The course is based on approaching scientific literature through the C.R.E.A.T.E. (Consider, Read, Elucidate hypotheses, Analyze, Think of the next Experiment) method. Generally, our homework was to draw diagrams of each experiment, come up with our own titles for figures, write the conclusions for some articles, and propose the next step. We also talked about writing grants and the grant review process, and we evaluated classmates proposed experiments (anonymously) as if we were reviewers. Liz is always happy to meet with students, so definitely reach out if you have questions about the course. She has been a great mentor!\nShort and sweet: This class taught me far more about being a scientist than most others. It prepared me to analyze articles critically in grad school, and I'm convinced the discussions and coursework helped me write and receive a major grant for my PhD. \nWorkload:\nWe were asked to read a paper or section of a paper each week and to look up any unfamiliar methods or terms before the next class. We diagramed every experiment and designed our own follow-up experiments. The time required do to this each week varies, but is absolutely manageable and can be reduced if you pay close attention in class and participate. It's about understanding concepts rather than memorizing a lot of terms. Our final was an NIH-style grant proposal.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "January 09, 2010",
            "review_content": "\nI was very frustrated with this class this semester, mostly due to Dr. Bulinski's poor teaching style. In addition to not specifying page numbers (seriously, \"parts of chapter 16\" is not a real reading assignment), she was an incredibly disorganized lecturer. Her slides containing experiments were not labeled (apparently, she hates labeling graphs), and her explanations were very spotty. Often, she would remember something she had forgot to mention and skip back several slides to make a point. Her disorganization made the lectures hard to follow. At one point, she suggested that while studying for a midterm, we should try to figure out why a certain slide is in the presentation. To be quite honest, I often couldn't figure out her organizational logic, even though I understood the information presented. I never followed her \"three slide rule\" (i.e., you have to know something if it shows up on at least three slides). The good thing was that she did post the slides after the lectures. The bad? Unless you took meticulous notes (and it was hard to do when she's such a disorganized lecturer), it was still difficult to understand many of the slides.\nDr. Miller was a much, much better lecturer. All her slides were labeled and the lectures easy to follow. They mostly came straight out of the book (another bonus: she assigns specific page numbers!), so even if you missed something during her mileaminutelecturing, you could easily look it up in the book. \nHowever, Dr. Miller's portion of the class was more problem-based. She assigned homework problems that were straight out of the problem book, and her exams were more of the same. In this regard, I'd say Miller is \"harder.\" Bulinski's exams depended more on memorization. She asked a lot of true/false/explain and compare/contrast questions. In addition, she liked asking open-ended questions about possible experiments to verify some finding or another, and as long as you put something reasonable, you got partial credit. (I'd say her actual exams are close to her practice exams.) On the other hand, Miller asked a lot of very involved questions that were more in Mowshowitz's style. They required actual application. \nWorkload:\nI was in the same class as the 1/3/10 reviewer, but I took the class as an undergrad, so the workload was a little different. The major difference was that the three \"discussion\" papers for undergrads were one-paragraph assignments on possible future experiments, and they were only worth 10% of the final grade. Also, we could drop any one of the four exams, including the non-cumulative final (which was essentially a fourth midterm). On exams, we got a choice of which questions to answer (usually 8/10). \nFinally, expect the reading to be heavy, since most chapters are 70+ pages. Only Dr. Miller assigns practice problems for homework. \n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "January 03, 2010",
            "review_content": "\nBefore I delve in, two notes on the class:\n-It is ridiculous to even attempt teaching Cell Biology in just one semester, so when I say that the material was flown through in class, it is not meant to reflect poorly on the professors - it is necessary in order to cover the syllabus in half the time needed.\n-Yes, I said professors. The first half of the course is taught by Professor Bulinski (Jeanette Chloe Bulinski; not sure why there are two listings for her, so I tagged both), and the second half is taught by Professor Miller. (On the occasion of Professor Milled having a child the time I took the class, the split was 2/3-1/3, so where the syllabus divides in a typical experience may differ.) There are differences in their styles, which will be detailed shortly.\nAs said earlier, Professor Bulinski teaches the earlier part of the course, which in my case consisted of the cytoskeleton, the cell cycle, and the development of cancer. I always felt that being stuck with teaching the cytoskeleton for an extended period of time means that you drew the short end of the stick, and the lectures on it strengthened my belief. In any case, Professor Bulinski teaches in the dual Powerpoint-Blackboard method; each slide has a diagram, or some experiment results, or a few bullet points while she explains it in rapid detail, and from time to time she will pick up the chalk and sketch out an important and relevant experiment on the blackboard. The slides will get posted on Courseworks, but those alone will be useless - you need to listen to lecture to make any sense of it; besides, if it's on the blackboard, it's not gonna be on Courseworks, and it's almost guaranteed to be on the exam. During the lecture, she speaks very quickly and sometimes it is hard to make out what she is saying, which does not help when what she says is far more important than what is on the screen (especially when her laptop was guaranteed to crash at least once per lecture). She usually drops in a few jokes each lecture, but often they are corny, and even when they weren't, they were wasted on a class full of humorless pre-meds; I think she got a bit peeved that barely anyone laughed by the end of her section of the course. Speaking of peeves, one of mine was her textbook readings: she would only list the chapters (100 page long mammoths) to read for each lecture rather than the relevant sections, saying that we were adults and could figure out the 15-20 pages that were relevant; for the record, we couldn't. Towards the end, she didn't bother even telling us what to look at in the textbooks. I never went to her office hours, which may have been to my detriment; I suspect she would have been a lot clearer when she wasn't on a 85 minute timer (her classes typically ran over by 10 minutes to squeeze in everything).\nProfessor Miller ended up teaching the organelle systems of the cell and the stuff that comes with it, such as vesicle transport. She uses both Powerpoint and Blackboard as well, though she tends to only include more diagram and fewer text slides. She also speaks very quickly in order to try and get through the material in time, but for some reason or another, I make out what she was saying more clearly. For some reason, it felt that the lectures were going a little more slowly and in depth; it felt like we were getting a bit more of the big picture and could tie one slide to the one five down the road in the Powerpoint rather than being crammed with a new cell cycle cyclin every thirty seconds. Either that or the fact that I could make out more of what she was saying or that her subjects were just easier, but in either case, I understood more from her part of the course than I did from Professor Bulinski's. It also helped that she would list the relevant pages in the textbook at the end of each lecture to read for the next class. Strangely enough, it was not unusual for her to end before her 75 minutes were up.\nThree times over the course of the semester, there will be a paper discussion. The TA will email you a paper a few days before, you come in having read it, and part of the class the TA gives a Powerpoint explaining the paper and part of the class you write down further experiments you would conduct. Sometimes the Powerpoint takes up the entire class, so start thinking - and writing - while it is still going. The sum of the three paper discussion grades counts as a non-droppable exam, and there is always a question on the paper on the exam that follows it.\nAs has been noted in other reviews, the exams are tough, as they tend to be experiment-based. Often, the format is that the experiment is explained and the results are given; you would match the results with the experimental conditions; explain those results; explain what would happen if one of the conditions changed; set up an experiment to test something further. They are big on setting up your own experiment to test something further. Typically you are allowed to skip at least one question, so at least you get to pick your poison. The format is the same regardless of the professor, they give you an hour forty to take the exam, and you need it. However, you will probably not take it, as you have a class right after it and those extra 25 minutes are during it. This was especially frustrating during the final: the registrar had given us 9:00-12:00 and the exam was going to be only two hours. Now, the logical thing to have done was to make it 10:00-12:00, but instead it was 10:30-12:30. Another professor showed up to set up for the next exam in the room while we were taking the test. Also, people had finals back-to-back and had to leave early. I have no idea why they did it that way. Also, maybe it was just the schedule this year, but the exam cutoffs for material were absurd; we would always end up doing the first lecture on the next unit right before the exam...and it would be on the exam. It was like they forgot to sync the syllabus with the exams.\nNow that I have blathered on too long, here is the skinny: you are going to need to show up to class. Every one of them. They will speak very fast since there is too much material to teach in one semester, but try to take down as many notes as possible (I am one of those people who take maybe a line and a half for other courses, and even I had to take down a full page of cramped writing at a minimum). If they put it up on the chalkboard, copy it down word-for-word, diagram-for-diagram because it will be on the exam. If you fall behind you will not be able to catch up - I was sick for the last quarter of the semester, and I missed half the lectures in that span, and when I took the exam for it, I did not know the answer to a single question. In summary, it was not a bad class - some parts of it were genuinely interesting, especially in the second half - but I wish they had the time to actually explain what the frack was going on and tie it together rather than bulldoze through the material.\nWorkload:\n4 exams including the final, all covering a quarter of the course; lowest of the non-final exams is dropped. 3 paper discussions to be submitted at the end of the discussion class; sum of the grades counts as a non-droppable exam. Showing up and paying attention to the lectures is necessary if you want to pass. Textbook reading assignments are vague in the first half, useful but not vital in the second half.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "December 20, 2008",
            "review_content": "\nThere are 2 instructors for this class:\nProf. Chloe Bulinski:\n- funny professor, engaging, but not very clear or organized. Material is interesting, but poorly structured, so you might want to make sure to organize the information from class and from the book more clearly.\n- talks mostly about cytoskeleton and cell division/cancer\nProf. Elizabeth Miller\n- also funny; engaging, clear and organized, but not too much detail.\nBoth professors go through the material quite fast, so make sure to keep up with the pace of the class or you'll fall behind quickly.\nAlso, both professors write exams with an emphasis on critical thinking, not on memorization or reproducing the textbook. Questions are something like: \"Here is this experiment, and its results. Explain what the results mean, and what that would suggest about how stuff works in that particular part of the cell.\" This basically requires you to be able to judge the results and infer information from them, and then explain what that means, based on what you already know about how different molecules work and the information you learned in class or from the textbook.\nFinally, there's no mandatory attendance, but obviously it helps to go to class, because it makes learning the material much easier and faster.\nWorkload:\n4 exams, equally weighted, non-cumulative, one gets dropped (including final). 3 paper discussions, with small paragraph assignment.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "July 18, 2007",
            "review_content": "\nDr. Miller is one of the best professors i have had at columbia. Not only are her lectures very interesting and well-thought out, her australian accent will entertain for hours and hours.\nHer half of the cell bio course was much more manageable than Chloe's section on the cytoskeleton. I performed much better on her exams.\nWorkload:\nTotal course:4 Exams, drop onemust read some papers and write a paragraph after lengthy discussion in class.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "May 08, 2006",
            "review_content": "\nLiz Miller is one of the best professors I've had at Columbia, particularly in the science departments. She is easy to follow, very straightforward, and obviously interested in what she's doing. For a first-time teacher, she is remarkable. I actually looked forward to attending her class every day. \nFortunately, she didn't waste our time rehashing material from Intro Bio; rather, she picked up where that course left off, allowing a more in-depth study of many of biology's more salient points. \nShe picked interesting experiments to include in her lectures, and while her explanations of them were sometimes a bit cursory in lecture, she was more than accomodating with office hours and explained them very clearly then. I suspect that this will not even be a problem in future years. \nThe pace of her teaching was perfect, neither painfully slow (think Blaer) or so fast that it's hard to follow. Things were explained thoroughly in class the first time through, and the text readings acted as supplement rather than primary resource (the book, however, is excellent--\nanother rarity in Columbia science courses). \nShe also incorporated her own research, in protein folding in yeasts, in an appropriate manner: she didn't shove it down our throat, but rather referenced it in passing to help contextualize material covered in the course. She really does love yeasts! \nUnfortunately, the second half of this course was an utter disappointment. Chloe Bulinski's lectures were long, confusing, and peppered with lame jokes and bad analogies. Quite frankly, the textbook taught me more than she did. I wish Dr. Miller had taught the entire couse. \nWorkload:\nShe teaches the first half of the course only. Two midterms are hers of four total; one of the four can be dropped. Her tests are very fair. Moderate amount of reading. Three short papers for grad students (none for undergrads). More than reasonable workload for a science class. \n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "March 08, 2006",
            "review_content": "\nThis was Dr. Miller's first time teaching, and she did a phenomenal job.  Her lectures were well-designed and flowed perfectly, the class was relaxed, and I was never even remotely bored.  She clearly has a very broad knowledge of cell biology and was able to field questions with ease.  And her accent is an added bonus.\nThe best part about the first half of this course is that Dr. Miller will answer all of those lingering questions from intro biology: \"What is this magical protein called clathrin that forms vesicles?  What are the excruciating details of mitochondrial and nuclear transport?  What does a proteasome actually do?\"  And she does it clearly and concisely, with fascinating experimental examples, many involving the yeast that she clearly loves so much (her research is on yeast).  \nDr. Miller assumes that you know everything that Dr. Mowshowitz taught you in Intro Bio, which does a lot for the course.  This means, first and foremost, that she only gives you new information.  And when she is done giving you that new information, it's over.  There is no dragging things out, there is no mindless repetition of facts that everyone already knows.  She tells you what you need to know, explains how it was discovered, answers questions, and then sends you on your way.\nBeing a first-time teacher, however, there is still some room for improvement.  Sometimes her explanations of different experiments are a bit too fast-paced and hard to keep up with.  But a lot of this is complex stuff, and she doesn't require you to memorize minute details.  Also, her homework and test questions are inconsistent in difficulty level (though I still think that the first exam, which everyone...mostly grad students... complained about, was a better test than the second, far more straightforward exam) and are not always precisely worded.  But these are minor issues that can easily be resolved with some more practice and some more time.\nIn short, Liz Miller is a great addition to the Biology Department at Columbia, and I really hope she eventually begins teaching full courses on her own.  \nI really believe that if Dr. Mowshowitz ever decides to retire, Dr. Miller would be the perfect person to take over the Columbia Intro Bio legacy. \nWorkload:\nWeekly reading in the Molecular Biology of the Cell (probably the best textbook ever).  Problem sets on your own time, but they're much shorter than Mowshowitz'.  2 midterms with Dr. Miller, and then the second half of the course is taught by Dr. Bulinski.  \n"
        }
    ]
}