{
    "prof_info": [
        {
            "prof_name": "Alan Brott",
            "prof_id": 3597,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Accounting for International & Public Affairs",
            "review_date": "December 22, 2013",
            "review_content": "\nThe other reviewers are still right on the money. This man is the Cheshire Cat of accounting. Everything he teaches you will be with an ear-to-ear grin. Usually it's funny, every once in a while it's slightly unsettling. But he's a great teacher who spent his career working in one of the top accounting firms in town.\nThe class is designed to familiarize you with basic financial statements from for-profit companies. This includes the Statement of Cash Flows, the Balance Sheet, and the Income Statement. It will not teach you strategies for internal accounting. However it will teach you what a basic accounting course would in a semester within the first three weeks. After that, it gets interesting and technical, covering things like mergers and acquisitions, accounting for inventory, warranties, etc.\nThe last day is spent translating the for-profit stuff into the not-for-profit world. Hes up front about not being as much an expert in the field, but still useful. Might feel more theoretical to people strictly interested in the public and nonprofit sectors.\nWorkload:\nThe first two problems sets are rough and time consuming. The following eight aren't so bad. But you need to do more than that if you want to do well on the three-hour midterm and final. Don't let yourself think you'll do well just because you understand the concepts when Brott explains them. Do practice problems and go to recitations.\n"
        },
        {
            "course_name": "Accounting for International & Public Affairs",
            "review_date": "January 20, 2011",
            "review_content": "\nWhile what the above reviewer said is true--but the tests don't match the actual assignments.  The average on the midterm ranged from a 58-65 depending on the section.  Use the more complex examples in the notes to study for the exams, not the homework or extra problems or even the RQs.  \nThat said, he is entertaining, but in a sneaky kind of way.  Don't let his funny anecdotes fool you into thinking this is an easy course--he also said in the beginning of class \"there will be no surprises\"--but there were.\nWorkload:\nIt sneaks up on you.  To really do well you need to go over the notes, the RQs, the assignment and truly get the complicated note examples.\n"
        },
        {
            "course_name": "Accounting for International & Public Affairs",
            "review_date": "September 21, 2010",
            "review_content": "\nI'm taking his accounting class at SIPA, and this guy is great. He was born to teach.  I never thought I'd enjoy accounting, but halfway through the first lecture I found myself wondering if I should become a CPA.  Brott is engaging, enthusiastic, funny, informative....  He's very receptive to questions.  Everything that comes out of his mouth is instructive; we've learned a huge amount in just the first few weeks.  He uses the board AND lecture very effectively to get information across.  Accounting actually seems easy to me, though I've had exposure to it in other contexts where it seemed like a confusing jumble.  To summarize: Take Alan Brott's class, if you have the opportunity.\nWorkload:\nDecent and painless; it's accounting, not string theory.\n"
        }
    ]
}