{
    "prof_info": [
        {
            "prof_name": "Jian Yang",
            "prof_id": 1859,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "January 15, 2009",
            "review_content": "\nI am a Neuroscience major, and enormous lover of all things neuroscience - I read each and every article about the neuroscience world I come across, I have worked in numerous labs on campus and off, I am on the board of the Columbia Neuroscience Society, I thoroughly enjoyed Professor Mowshowitz' biology class and succeeded in it despite it being difficult.... However, this class, Neurobiology taught by Professor Yang, honestly made me question my desire to enter the world of neuroscience. It started with his too-great emphasis on the aspects of neuroscience that are based in physics - without the understanding that not everyone in the class has taken physics yet. The first exam was full of questions that ought to have been on a higher level physics exam, not a neurobiology exam, especially because physics is not a prerequisite for the course. Arguments against this were answered with \"Well, you are allowed to drop one exam, so it is fine\" rather than attempts to clear up the subject matter. As the course went on, the exams were to continue to test us on small insignificant details (eg. the size of a gap junction channel rather than its purpose/function). Professor Yang also did not stay in communication with his TAs, so they were also unable to really help us, as hard as they might try. \nDuring class, Professor Yang repeatedly mixed up information, said one thing while writing another on the board, or simply just did not explain himself well. Before the exams, when students would ask him, for example, which of the formulas he had provided us with would be important for the exam, his only reply was \"Well, if you had paid attention in class you would know\" (he sent this response out several times as an email to the entire class, which I found quite  inappropriate). What was worse was that in class he had at various points said one thing was important and another was not, then reversed that, and then ultimately on the exam, it was necessary to know both the things he said were important and those he said weren't, and those he had never discussed and which weren't in the text book either! I have done all the reading, I attend every class, and yet Professor Yang still manages to confuse more than instruct. Moreover, he sends out questions prior to the exams, questions that are supposed to help us study for the exams, but these questions are simply taken from previous years, when the professor taught different material, and Professor Yang does not think it necessary to remove questions that are on topics we have not discussed, leading to even greater amounts of confusion and wasted time. \nI had really been looking forward to this course, but found in it only disappointment and confusion. In class I sit with two other people, and end up having to explain to them what the professor MEANT to say with his last statement. I am not writing such a harsh critique because I did poorly in the class, in fact I received an A in the class (thankfully we were able to drop the physics exam). I am writing this critique because it was only thanks to my background knowledge that I was able to have an idea what Professor Yang MEANT to say, and I spend the entire class doing a simultaneous translation from what was just said into something that actually makes sense/is relevant.\n\nWhat does Professor Yang need to do to be better? He needs to be clearer, have his information correct before coming to class (once he spent fifteen minutes trying to figure out whether or not he was right about something a student had just questioned him on), he needs not to test on random numerical facts but on the things that are actually important, he needs to not assume everyone in the class is an advanced physicist. Overall, this class could have been really interesting, but instead Professor Yang just made it painful. \n\nWorkload:\n3 midterms on course material (one can be dropped) and a mandatory final on 2 of 3 journal articles given about two weeks in advance. \nWeekly articles are also assigned for recitation section discussions.\n"
        },
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "February 16, 2004",
            "review_content": "\nI enjoyed this class because the material was interesting, but it took me half the semester to figure out how to study for the exams and read the papers. As a professor, Jian assumes that you know more than you probably do, in particular basic circuit physics and experimental procedures. He does, however, speak rather slowly (because english is his second language) and writes on the board which both allow you to take good notes in class. While he does require us to memorize endless details, they all come straight from the class notes or papers. The exams are going to focus not on how something works, but instead on how it would work if you did X to it, and how this increases our understanding of the system as a whole. Neurobio is a field still in progress so the focus of the class is very experiment oriented.  You need to know why we believe so and so. The first test is almost all physics and most of the class drops it. After that it gets better. If you decide to take this class, I recommend the following for tests:\n1. Write down everything he says in class including anything he says you do not need to know and memorize ALL of it. (do not focus on the book)\n2. Study in groups, because you will inevitably miss something.\n3. Make flash cards for numbers, statistics and chemicals\n4. Understand the \"story\" of each process (biochemical pathway, different parts involved) using the book to fill in the gaps.\n5. Make a list of experimental procedures described in class and in the papers and how each works. Toxins, Markers, and there effects on larger processes. He will ask you to \"design\" experiments on exams.\n6. If he describes a specific experiment, know it well.\nFor reading papers: \n1. There are helpful resources in the Bio library on the 6th floor of Fairchild. \n2. Focus on understanding the diagrams, these are what usually appear on exams, in particular the techniques used to produce the image and what we learn from it.\n3. If you have the time, especially for the final, go through the paper with a set of flashcards. For each step in the researchers thought process make a question and write down the answer. You will need to know how they reasoned the design of the experiment and their conclusions.\n4. For the really detailed papers, use your best judgement on what is important. For example, we did a paper on the crystalized structure of rhodopsin. While we did not need to know every amino acid, we did need to know the ones that caused kinks in the chain, and what sequences allow the effects described in class.  Also, we did a paper on the structure of a potassium channel, the point of the paper was how ion selection was achieved, and a key part to this involved the dimensions of the channel. These precise dimensions for the channel in angstroms were on our exam. Figure out what the paper is getting at and memorize those statistics.\nWorkload:\nSee above and judge for yourself. I put more work into this class than any other and I didn't take any joke classes.\n3 midterms one of which you can drop and a final.\nVery procedurally heavy scientific articles discussed in a weekly seminar + 2 or more chapters a week in the textbook.\n"
        },
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "December 15, 2003",
            "review_content": "\n Although Professor Yang knows the material and runs a pretty good lab, he has no clue as to how conduct the class, give exams and communicate with students.  With his heavy-accented English, he gives lectures that are so boring that students fall asleep toward the end.  He also tries to make all the material as hard as possible, even in the easiest topics.  Yang  constantly introduces the most minute and unnecessary details that only obstruct the concepts.\nMoreover, on his tests, he asks the most minute and unnecessary details.  For example, he would ask you about the Angtrom width of the channel in the lower middle part.  Or to recite an amino acid that was a part of some protein that functioned in one of the pathways that was described in 12-page research paper.  (And those questions, of course, would be worth about 10 points).\nYang does not know how to communicate with his students either.    I hated this class, although I must admit that the material we learned was very interesting.  \nWorkload:\nReadings, occasional homeworks and paper reading.  Not too bad.  Beware of his exams though.  Oh yeah, and the average is a B--\n"
        }
    ]
}