{
    "prof_info": [
        {
            "prof_name": "Lien-Hang T. Nguyen",
            "prof_id": 13386,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "The Vietnam War",
            "review_date": "May 03, 2017",
            "review_content": "\nThe most terrible course I had at Columbia. My review is not the reflect of a bad grade or personal feeling, although I felt miserable for the whole semester. However, it is not difficult to distinguish between my frustration and the reality of this course because I have faced many difficult courses and did perfectly well with them. \nProfessor Nguyen gave this course for the first time at Columbia this Spring 2017 and it is hard to believe the committee at the Department of History gave her a free pass and validated her project. She often looked like she had no idea how to make this work.\nThe syllabus was revised not less than five times, a reflection of her inability to keep up with the schedule: lack of direction, a \"fun attitude\" in complete discrepancy with the topic, and a poor management of her slides.\nShe seemed not to have mastered how to explain her topic - she first went for a chronological order and then changed for a thematic one. Far too often, she made fun of her lack of knowledge, constantly postponing her answers to the students questions for later. \nThe class was a mess overall, some students being completely disconnected from the beginning while some others obviously considered it as a breeze because they had a strong background in History. \nOne TA was very easy to work with, trying to do his best to support his student, giving some fair grades. The other one was very nice and qualified but his expectations were completely irrational with the beginners, and he was a harsh grader.\nA countless number of anomalies in this course. \nThe workload was strange. The readings were interesting, but sometimes needlessly long. The discussions also varied depending on how much everyone had to say, and the TA would speak extensively far beyond the topics of the day, never giving any tips or guidelines for the exams, although he was available to answer questions by email or appointment.\nProfessor Nguyen has authored a book on the Vietnam War and assigned its to the class. but her topic was very concentrate and she seems to miss the big picture (particularly in matter of international relationships). With her level of demand through syllabus and assignments, it was the combination for the perfect storm.\n\nWorkload:\nVery heavy and poorly exploited in the course and in the discussions\n"
        }
    ]
}