{
    "prof_info": [
        {
            "prof_name": "William Hood",
            "prof_id": 3964,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Early Italian Art",
            "review_date": "January 11, 2010",
            "review_content": "\nI had not taken an art history course at college before and this was quite different from what I was expecting. Professor Hood did not expect us to memorize copious amounts of details, facts, and dates, and, as someone else said, regurgitate them on the exam. Instead, he forced us to look at the paintings and see the meaning and historical context behind them. Yes, his insistence that we not take notes was a bit irritating at times and yes, some of his lectures (particularly towards the beginning) seemed a bit worthless, but altogether, it was a worthwhile course. I do wish we had spent more time looking at the paintings and the symbolism within them, but nonetheless, much of the vitriol in other reviews is unwarranted. If you want to take a class that takes a different approach to art history, then I would recommend it. \nAlso, Professor Hood has an excellent Southern drawl and reminds me charmingly of Leslie Jordan.\nWorkload:\nEasy A. Attend lecture, section, do the reading (not all of it is necessary...Baxandall, I never opened), memorize the maybe 40 paintings and dates he expects you to know, look over the powerpoint once or twice...bam. A.\n"
        },
        {
            "course_name": "Intro to Literature and Methods of Art History",
            "review_date": "January 11, 2010",
            "review_content": "\nSpring '10 is Professor Hood's last semester at Columbia so take advantage of his brilliance/expertise and register for his class.  You will learn a lot. He was previously the art history department chairperson at Oberlin College and has been at Columbia for just a few semesters.  I was in the major's seminar Fall '09, and I think there may end up to be two diverse and adamant sentiments about Professor Hood:  you either abhor or love  him.  \nI thought he was great. He is tremendously funny, really smart, and knows a lot about all aspects of art.  He is very opinionated as well.  If you are the type of student that enjoys sitting in a lecture hall taking notes and memorizing for midterms and finals so that you can just reiterate what Professor Hood said during some previous class, then he is not the professor for you.  However, if you are the type of student who seriously reads your weekly assignment to provide yourself a foundation to state your opinion during class and be able to support your argument, then Professor Hood is for you. However, I think there are a lot of students that might feel uncomfortable with that type of discussion because it could feel like he is \"picking\" on you. \nWorkload:\nA short essay for a midterm that you work on at home plus an in-class essay that where you can select your question from a list of many.  The final was a brief essay, 6 pages long.  Each week there were approximately three short reading assignments plus class participation.  It was very manageable. \n"
        },
        {
            "course_name": "Early Italian Art",
            "review_date": "January 06, 2010",
            "review_content": "\nI completely disagree with the other review of this course. I loved the class and the professor. Hood is in no way insulting, he just has a sense of humor. The exams were not impossible (or scary), they just required thinking -- instead of the usual regurgitation of facts.\nIn a usual art history class the professor says \"Look at painting A, notice how painter B has painted X and note that its a symbol of Y\" You spend a weekend with your flashcards memorizing Painting A, Painter B, detail X and symbol Y. Come the midterm/final you see Painting A and immediately begin regurgitating the memorized facts. \nOn Hood's midterm you see a new painting -- and instead of scribbling factoids and ignoring the painting you have to actually LOOK AT IT. The idea is that when you look at it you begin to recognize style/composition/color/subject matter/etc that is familiar, and connect the new painting to some of the major pieces presented in lectures. \nIf you are conscious during lectures you should have NO PROBLEM discussing them intelligently. \nAnd what the other reviewer fails to mention is that Hood and the TAs are not focused on accuracy (guessing who painted it, when and where) -- they just want you to be able to talk about what you see.\nI am an art history major and a senior and this is the first professor I have had who did not want his lectures rewritten for him on his exams. Instead of memorizing you actually learn -- and professor Hood makes it easy. Seriously -- just show up (you have to, he takes attendance), listen and look at the images on the power points. All the pieces will come together. \nI really enjoyed most of the lectures. Sure there was the occasional snooze-inducing tangent, but for the most part I looked forward to it. If I could I would adopt professor Hood as a bonus grandfather. He is adorable, funny and makes 15th century religious seem relevant and interesting. \nWorkload:\nMidterm, Final, short (3-5 pages) paper (you have to turn in a draft and then a final version), light reading that you have to at least skim for discussion section and for essay questions on midterm/final (you get the topics before the tests).\n"
        },
        {
            "course_name": "Intro to Literature and Methods of Art History",
            "review_date": "January 01, 2010",
            "review_content": "\nProfessor Hood is not concerned with making either assignments or themes clear to his students. In fact, he appears to be kind of opposed to explanation and clarification, maybe because he considers a seminar a place without fixed lessons, or maybe because he secretly hates us all, I don't know. Sometimes he's cuddly and flashes his Santa Clause smile, but he turns mean, fast. He takes his students' failure to respond or understand satisfactorily as a personal affront and will get, like, intensely and surprisingly severe with you. But despite that, the concepts themselves that we discuss in class are hella interesting and complicated, and I never regretted attending class. Basically, if you don't need to have your hand held, and you don't take criticism personally even when it feels damn personal, and you don't stress about doing an assignment \"wrong\" -- and I will give him this, that although he never explained a damn paper topic to us, he appreciated different takes on whatever his original intent was -- Hood's seminars are actually just fine. But I can't speak for his lectures. \nWorkload:\nTwo-part midterm (one take-home paper, one in-class paper), and a final paper, seven to ten pages. Reading and response questions each week, cupcakes at the end of the semester.\n"
        },
        {
            "course_name": "Early Italian Art",
            "review_date": "December 16, 2009",
            "review_content": "\nI have been considering what to write in this view, and I thought the best thing to do was to simply copy and paste what I wrote in my course evalutation:\nUsually when it comes to end of year assessments, I look back on my class with rose-colored glasses, even those I did not particularly enjoy or appreciate.  In this case, I'm simply too fed up to write the detailed, biting assessment I promised myself I'd write out of a sense of justice and karma.  All I can say is that it takes talent to make something like Italian Art unenjoyable or even painful, but by God did Prof. Hood did it.  I cannot even console myself with the thought that I had learned something, as the entire time I was worrying about the impossible midterm and having to sit through lectures punctuated by insults and the insistence that any information learned from the class would promptly get a failing grade.  Hello?  Could somebody explain to Prof Hood how education works?  I don't know what he thought he was trying to accomplish.  I've had challenging teachers before who have striven to give their students true insight into their field, and for whom I have the utmost respect.  Prof. Hood does not fall into this category, despite what I'm sure he flatters himself into thinking.  I can't even look at a work of early Italian art without my stomach churning. I have never had a professor so bent on making life so difficult for his/her students.  And though this assessment is neither constructive nor well-thought out (quite like the class itself, actually), at least I can say that I've written from the heart and have had my peace.\nI know everybody didn't feel quite as strongly as I did, but I don't know anyone who actually liked it.  \nWorkload:\na midterm and a final, plus one small (4 page) paper.  Mandatory weekly discussion section.  And they took attendance both in the lecture and the discussion section.\n"
        }
    ]
}