{
    "prof_info": [
        {
            "prof_name": "Orlando Bentancor",
            "prof_id": 6328,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Colonial Encounters in the Hispanic New World",
            "review_date": "April 14, 2015",
            "review_content": "\nReally challenging material at times, but he always explained it in depth during class. I'd suggest not taking the course if you have absolutely no interest in latin american / colonial studies because that's all this class  is. If you're looking to take any other course with Orlando I say to do it, he's super chill about like any assignment and is very flexible with the syllabus. \nIf you do end up in his class, just be honest when he asks for questions. He seems to genuinely enjoy clarifying any of the readings. \nWorkload:\n60-100 pages of reading weekly, two 5~ pg papers, and a presentation \nSuper generous grader (but you have to demonstrate some sort of effort)  \n"
        },
        {
            "course_name": "Rock and Literature in the Southern Cone",
            "review_date": "December 10, 2012",
            "review_content": "\nWow, Orlando is the man.  He is patient, funny, a generous grader and incredibly smart.  The books we read are challenging, but not too challenging.  Orlando is receptive to student criticism and concerns (he moved around the syllabus to accommodate the class) and includes books that are fun to read and relevant to the point he is trying to make.  Orlando knows so much about so many things--I'd love to kick it with him outside of class.\nWorkload:\nThree 3 page papers (with 2 versions each), take home midterm and final (where orlando says he expects you to only put in 1 class time's worth of work and max out at 2 pages), and probably 30-40 pages of reading/class.\n"
        },
        {
            "course_name": " Hispanic Cultures I: Islamic Spain through the Colonial Period",
            "review_date": "April 11, 2011",
            "review_content": "\nProfessor Bentancor is the best professor I've had at Columbia. I came into the class with a lot of anxiety about speaking in Spanish in the classroom, and he helped me to almost completely overcome that, purely by way of his encouraging and stimulating teaching style. If a thought or an insight occurs to you, he listens very carefully to what you say and actually appreciates the point you are trying to make. If you get stuck in the middle of a thought, or have trouble conveying it in another language (as I often do), he rescues you by taking whatever you've said and offering new ideas and questions related to it. There's no risk or discomfort in saying anything, even in a small classroom setting. \nFurthermore, even though the class is that of a historical survey, Bentancor gives the material an enormous amount of depth by injecting it with philosophical and theoretical questions and considerations. I was able to exercise my mind in a completely different, very interesting way. If at all possible, take this (or any) class with Bentancor. He's FANTASTIC. \nWorkload:\nVery doable. Weekly readings, which he elucidates through class discussion. About 6 short papers (~300 words), 3 exams (very very easy) and an oral (leading a class discussion). \n"
        },
        {
            "course_name": " Hispanic Cultures I: Islamic Spain through the Colonial Period",
            "review_date": "January 02, 2011",
            "review_content": "\nOrlando Bentancor is a phenomenal professor. Our class went until 7pm on Tuesdays and Thursdays, but I always looked forward to going. Every single class was filled with interesting and challenging material. I honestly felt I learned something new every time. I often wondered from reading the homework assignments what else there was to discuss about it, but each class, Orlando incorporated more philosophy, history, and cultural perspectives that made me want to be there, pay attention, and learn as much as possible from him. He has a laid back demeanor, which makes him very approachable and easy to work with. He is always interested in hearing what students have to say. It is unique to find a professor who so genuinely values students' ideas and is looking to learn from their thoughts as well. This class was wonderful, and he made the material incredibly interesting and stimulating\nI am so glad to see Orlando has a gold nugget; it is much deserved.\nWorkload:\n3 tests (all non-cumulative) and 7 essays that are 1-2 pages (with 3 or 4 re-writes). \n"
        },
        {
            "course_name": "Global Lit--First-Year Seminar",
            "review_date": "December 28, 2010",
            "review_content": "\nI have had Orlando as my professor for two courses now and I must say he is the best professor I have had at Barnard/Columbia. This is a professor who truly cares about his students and wants everyone to do well. He makes sure that everyone understands the material, is very open to students asking questions, understanding about deadlines, and always available to meet during office hours. You will have to talk in this class but honestly it's fine. I often dread taking classes that meet late in the afternoon but having such an amazing professor makes it difficult to ever dread going to class. This man is beyond intelligent, when you least expect it he ties the material from the readings to other fields in a way that just makes everything make sense. As the previous reviewer said, Orlando is a true intellectual but what makes him different from other Columbia professors is that he never makes you feel like he is bragging about his knowledge, he shares it in a very modest way and he values the input of every student. There are not enough words to describe what a great professor he is. Definitely favorite professor thus far!!!\nWorkload:\nManageable, the readings can sometimes be difficult but he makes it all make sense in class\n"
        },
        {
            "course_name": " Hispanic Cultures I: Islamic Spain through the Colonial Period",
            "review_date": "December 26, 2010",
            "review_content": "\nOrlando is definitely one of the best professors I have had at Columbia. In class, he always made sure that everyone had the chance to speak, answered all questions, and responded to any proposed ideas. However, he also offered his own (really interesting) insights as well. Orlando really brings to life topics that might otherwise seem dry and antiquated. He also really available outside of class via email or office hours, so although his grading can be tough, if you ask for help with compositions and other work, you will be able to do really well. Finally, even though we had serious intellectual discussions, class was always light-hearted and...believe it or not...fun!\nWorkload:\n7 2 page compositions on any topic from the reading, 3 tests based on the historical readings which are also basic (all you have to do is memorize terms, dates, and analyze a reading passage)\n"
        },
        {
            "course_name": " Hispanic Cultures I: Islamic Spain through the Colonial Period",
            "review_date": "December 14, 2010",
            "review_content": "\nSomeone gold star this man immediately. Powers that be, get on it! Everything already said is true and then some.  Just a really really cool guy.  An intellectual free of the typical professor pretense or arrogance.  Cannot recommend enough.  You're basically getting a philosophy, history and spanish class all in one.  If you don't like Orlando, then you may need to look at your life, cause you're probably a bad person and a commie, basically. \nWorkload:\nVery manageable.  Shouldn't be a problem.  \n"
        },
        {
            "course_name": " Hispanic Cultures I: Islamic Spain through the Colonial Period",
            "review_date": "September 04, 2010",
            "review_content": "\nSuch an amazing amazing amazing professor. He is such a good professor, he can explain things to your in many different ways so that you can understand things from any point of view that'll help you get the point. He is also so helpful with essays. Not only did i learn spanish, i learnt history, latin, cultural matters, etc. \nHighly recommend him. He's awesome.\nWorkload:\nManageable, especially when you have him to help you.\n"
        },
        {
            "course_name": "Hispanic Cultures I",
            "review_date": "November 20, 2009",
            "review_content": "\nOrlando is a great professor. He's engaging, charismatic and laid-back.  Though the course material can be pretty boring at times, his enthusiasm gets the entire class through the hour and fifteen minutes.  Sometimes he tends to ramble and there isn't much class discussion, but neither I nor most of my class minds it at all.  The workload is pretty light and it's clear that he wants everyone to do well.  He is very clear about what material will be on the tests and even gave the class a practice exam before the first exam.  He grades our compositions very fairly and I don't doubt that most people in my class will end up with B+'s or higher.  I highly suggest taking Hispanic Cultures I with him.\nWorkload:\n3 exams, a 1-2 page composition every two weeks or so, and nightly readings\n"
        },
        {
            "course_name": "Spanish 3300",
            "review_date": "October 01, 2009",
            "review_content": "\nTeaches Spanish 3300: Advanced Language Through Content: Latin American Short Fiction (At Barnard)\nIncredibly engaging, personable, and brilliant. Engages in a level of literary analysis which is rare in Lit Hum or other english literature classes and unheard of in foreign language classes. Does not hesitiate to incorporate philisophy, literary theory or existential reflection into the lecture. His love of literature and the discussion thereof is infectious. Highly recommended.\nWorkload:\nOne short story per week\nOccasional 3 page analysis essays\nVery manageable spanish grammar exercises and quizzes\n"
        }
    ]
}