{
    "prof_info": [
        {
            "prof_name": "Lejla Kucukalic",
            "prof_id": 3450,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 22, 2010",
            "review_content": "\n\nLejla Kucukalic is seriously one of the most amazing professors I'll probably ever have.  She used to be an olympic swimmer for the Yugoslav Republic until the Balkan Wars started.  Then, she was under siege and in hiding in Sarajevo for a year, before being smuggled out of Bosnia by journalists and finishing a PhD in science fiction in the US.  Now she teaches science fiction here, and she also teaches lit hum.  She's funny and entertaining, insightful, powerful, commanding, tall (6 1, i think?), good looking, and basically every good adjective you could think of for a professor.  Her venerable womanliness even gives Moody-Adams, that profound and veritable student of the world, a run for her money.  \nShe also cares a lot about her kids--she once pulled me aside to ask why my comments in class weren't as interesting and insightful as they were before.  She'll take the time to meet with you, to take the class out to some bomb-ass plays, and she'll ask great questions.  Also, she sometimes talks about war and about how similar the Iliad, Odyssey, Histories, and Thucydides are to the war she experienced, which can be a very humbling and shaking experience.\nLEJLA. IS. DA. BOMB. TAKE. HER. CLASS. WHAT. AN. AMAZING. WOMAN. \ndeepest respect for her. for real\n\n\nWorkload:\nNot too bad--a few essays, leading a class discussion, good class participation, iin-depth readings (pretty demanding of her class about what we read and how we answer her questions). but suuuuuuuuuuuuuuuuuuuuuuch a great class.\n\n"
        },
        {
            "course_name": "New Literary Histories",
            "review_date": "September 10, 2009",
            "review_content": "\n\nI took Professor's Kucukalic's class, 'New Literary Histories', and it was one of the best decisions I've made in my college career.  She incorporated epistemology, history, and literature into the approach we took to the texts and provided fascinating supplementary material (from artwork to scientific case studies) which enabled the student to get the most they could out of each book.  Kucukalic was also able to bring archaic ideas or novels from a different era into a contemporary context, often drawing from her own life experience; ergo, complex ideas and texts were made more accessible.  She is consistent, well prepared, and brings humor to the classroom, making it all the more enjoyable.  One finishes the semester not just with better analytical skills, as a reader, but with a richer outlook on many matters that extend beyond the classroom.  I began the course as a History major and left wanting to switch to English Literature.\n\n\nWorkload:\nHeavy but doable.  It's enjoyable, which makes it easier, as one is reading novels rather than textbooks. \n\n"
        },
        {
            "course_name": "Science Fiction",
            "review_date": "December 26, 2008",
            "review_content": "\n\nI generally dislike lecture classes. No matter how interesting the professor or the subject, I just can't sit passively and listen to someone talk for an hour and fifteen minutes twice a week without wishing that someone would shoot me or the professor. Even though there were 100+ people registered, the course description for Science Fiction sounded interesting, so I thought I would give the class a try. I'm glad I did. Professor Kucukalic is a great teacher. She makes a concerted effort to get everyone involved with the material both in class and through online discussion. She made full use of the smart classroom by including online material, images, video, as well as traditional powerpoint slides. It was a survey of SF, so we never delved into any one movement or author too deeply, but Professor Kucukalic never skimmed over anything either. Occasionally the in-class discussion would roam a little far afield, but generally she kept it within reason. The syllabus was clear and well thought out and there was a wide range of course material to satisfy a variety of tastes. I didn't love every story or book that we read, but every single one was relevant and interesting. There was a fair amount of reading, but it was structured in such a way that we always had time. Outside of class, Professor Kucukalic was extremely friendly and approachable. She was always willing to accommodate student's schedules in order to give them the help they needed. She is a fair grader, but she can be tough. She doesn't tolerate anything late, but if you get a friendly TA there's always wiggle room. Whether you're a SF buff or not (I wasn't), I highly recommend this class.\n\n\nWorkload:\nA moderate amount. 7 Novels, one of which you choose, and 4 of which were in the vicinity of 250 pages. Snowcrash and Dune were the longest things we read. 19-20 short stories (15-20 pages each). Short (3-5 sentence) discussion post before every class, take home midterm, book review style paper (5-7 pages), and a final paper (4-6 pages) on a topic of your choosing.\n\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 21, 2008",
            "review_content": "\n\nI had Prof. Kucukalic for her first semester teaching, and while the class was tolerable, it wasn't great. She conducts classes well, and manages to stay focused on the text instead of letting students ramble about personal experiences. However, I sometimes got the feeling that she was missing the larger point, especially when she would spend a lot of  time discussing minor characters and not touch upon major themes or questions raised by the material until the very end of class, and even then, she might cover them inadequately. Her paper topics are  standard Lit-hum fare without originality (e.g. role of women, what makes a good man, etc...), and her grading is (for the most part) fair. On a personal level, she's really nice and will arrange to meet you if office hours don't work.\nOverall: Not worth transferring into, but then again, not worth transferring out of. \n\n\nWorkload:\nDidn't add any readings for our class, dropped one of the papers and made the last paper worth twice the first in grading. Also requires that each student present on one book and (help) lead the class discussion.\n\n"
        }
    ]
}