{
    "prof_info": [
        {
            "prof_name": "Kathryn Sullivan",
            "prof_id": 1071,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Ballet II",
            "review_date": "June 02, 2014",
            "review_content": "\nI had a great time in Kathy's class, and I plan on taking it again.\nKathy was great at giving individual corrections.  I found the atmosphere to be a little more tense/serious than Mary's class.  This level 2 class felt slightly more challenging than Mary's, but I truly feel like I improved.\nShe always starts exactly on time, so it's best if you get there a few minutes early.  It sounds like she's gotten better at ending on time though because we never finished late.  She's always happy to stay after class with you and give you corrections.\nShe dyed her hair pink this semester, if that says anything.  I think it takes a certain level of chill for a professor to do that.\nWorkload:\nBallet journal: We turned this in halfway through and at the end, write 3 sentences after each class and you're set.\nVocab quiz at the end of the semester: All the vocabulary on the quiz is listed on her syllabus on courseworks. She goes over all of the vocab in a class before the quiz. Take 15 minutes to study the words that you don't remember, and you'll get a 100%.\nAbsences: 2 absences with no makeup required, no more than 3 absences made up in another class.\nPerformances: We were required to attend one of two performances that she listed on courseworks. You write a few sentences about it in your journal.\n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "April 08, 2013",
            "review_content": "\nRun! Whatever you do, do not take this course. For starters Kathy does the same combinations for both Ballet II and Ballet III. Second, she has some social issues that make it rather difficult to enjoy ballet. Third, she takes her class very seriously and speaks to her students as if they are in kindergarten, telling them to \"put their fun hats on!\" If you are serious about ballet, avoid her. If you want to enjoy ballet, avoid her. If you want to have a fun dance class, avoid her. \nWorkload:\nBallet journal, quizzes (yes graded quizzes which she will fail you if you don't put exactly what she wants). Easy A if you can stand her. \n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "January 22, 2013",
            "review_content": "\nI personally can't understand the negative reviews this wonderful professor has gotten. I have grown exponentially over the past semester in her class; my (awful) turnout has improved, i've learned so much helpful and important ballet vocabulary and my feet finally have caught up with the petit allegros I used to stumble through. I typically have a harder time picking up sequences, but she always repeats the instructions at least a second time so I feel more confident when the exercise begins. Her classes are always well structured and patterned so midway through the semester you know what to expect. She's very sweet and responds when reached out to! A lovely class\nWorkload:\nKeep a ballet journal for every week (only a few lines or so, nothing major)\nAnd a vocab quiz at the end of the semester which I actually had to study for because my knowledge of ballet terminology was shaky when I first started, but I found it really helpful as a dancer and i'm glad she made us learn the vocabulary\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "May 19, 2004",
            "review_content": "\nI think you *can* get a lot out of this course if you decide to, but there are a few things you should know about Kat.  Her combinations are good for your technique and often fun and challenging, but I know students who don't think they benefitted much from studying with her because she's kind of quirky. She's a little socially awkward, calls attention to you if you're thirty seconds late to class (even though this class always runs five minutes over), and has a tendency to interrupt you at the barre to give you corrections, messing up the combination for you. That said, if you get along with her, she gives a good class. You'll walk out of the studio dripping with sweat, but your petit allegro will improve.\nWorkload:\nThe usual. She always tries to get  through grand allegro and reverence.\n"
        },
        {
            "course_name": "Ballet II",
            "review_date": "April 07, 2004",
            "review_content": "\nAfter taking ballet for many years, I took Kathryn for Ballet II expecting an enjoyable and light class. Instead, I found that she is intolerant to other methods of training and an uninspiring professor. She likes to choose one person to pick on for the duration of a class or a few classes and is completely not helpful. \n"
        },
        {
            "course_name": "Ballet",
            "review_date": "November 23, 2003",
            "review_content": "\nIf you have had any sort of profession ballet training, run away.  She teaches her students like they're in preschool, and is completely stressful.  I think she comes to class after having five too many espresso shots and confuses being professional for being weird and sometimes rude (and obnoxious).  She might be okay if you've never studied dance seriously, but she is one of my least favorite professors...sometimes I think her instruction was downright wrong.  Since when in classical ballet are you ever supposed to \"shorten\" your legs?  The actual dancing isn't so bad unless you like variety.  You better be very very tolerant and patient to take this class...This seems like a mixed review, but to summerize, I'd never take her class again. \nWorkload:\nDepends on the dancer, but very do-able.  \n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "June 12, 2003",
            "review_content": "\nDespite her odd social tendancies and lack of patience, I liked Kathryn.  She is a bit quirky, but once you get to know her she can be friendly and helpful.  Her class was a little on the easy side.  Her barre exercises were generally a good preparation for center.  Center exercises on the other hand were slightly boring and repetitive.  Be prepared to do the same adagio every day which she sometimes spices up with some lyrical moves.  Petite allegro was mediocre, but the advanced dancers tended to add beats for a greater challenge.  The biggest issue with this class was the lack of grand allegro combinations.  Her \"big jumps\" were usually a few sautes across the floor with maybe one leap per semester.  She does, however, allow students to take class en pointe and dedicates an extra 15 minutes once a week to a pointe section.  Sometimes she can be very snippy if you mess up her barre preparations, fiddle with your shoes, or dare take a sip of water during class.  She will not hesitate to put you down in front of the class for your poor behavior, but she is never too harsh when it comes to your ballet ability.  She's quite encouraging, but she tends to play favorites.  What ballet teacher doesn't?\nWorkload:\nOne terminology quiz and two student-choreographed exerices to be exicuted in class.\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "October 16, 2002",
            "review_content": "\nProf. Sullivan seems to think that we all got into this good school by grace of God. She speaks to everyone like they are 5 years old, and puts everyone down, including the accompanist. She is definitely socially akward, hence the stuttering. She definitely plays favorites and can pick on one person for the whole class for one thing and ignore that everyone else is making the same mistake. God forbid you mess up her preparation she will tell you to move down a level. Good luck.\nWorkload:\nnone\n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "May 04, 2002",
            "review_content": "\nKathryn is an excellent dance instructor. Her barre routine is challenging, but it truly helps you develop your technique. Her center combinations are fun and invigorating. She is positive and energetic, and her comments are quite useful for improving your ballet technique. I recommend her to anybody who wants to excel.\nWorkload:\nHer classes are physically exhausting, but you'll be so much better by the end of the semester. Damn.\n"
        }
    ]
}