{
    "prof_info": [
        {
            "prof_name": "Juliet Nusbaum",
            "prof_id": 2909,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": " Elementary Italian I",
            "review_date": "April 06, 2007",
            "review_content": "\ngreat instructor. she was so nice and was always willing to meet away from class. she is also so sweet there is no way to dislike her. also for beginning italian, it is easier/may be not as easy to trasfer, because she does not have a thick italian accent, but is an american teaching italian. Although when in her class you may think that she is amazing, i have heard that when i was in italian elementary 2, that the other teacher was easier on papers and easier in general. she was easy in elementary 1 but much harder in elementary 2. everyones grades suffered\nWorkload:\nnot that bad. most of the work can be done on the weekends and weekly quizzes and lab work. less than other classes.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 16, 2006",
            "review_content": "\nJuliet was a very good language teacher. Nice, friendly, but very to the point.  She was extremely helpful inside and outside the classroom and very understanding if you ever had any problems with getting the work done.  Although the workload was neverending, the assignments could be saved up until the end of the week for those who tend to leave things till the last minute, so it was managable.  I definitely recommend her.\nWorkload:\nBasically a chapter a week: workbook section due monday, lab section due tuesday, quiz every tuesday.  Short compositions (start around 75 words and get up to 200) due about once a month.  Easy midterm and final.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 03, 2006",
            "review_content": "\nJuliet is an amazing teacher and so much fun to take an Italian class with! After my first semester of Elementary Italian (taken with another/not-so-good teacher), I switched into Juliet's class hoping that my experience would be better. I couldn't have asked for a better second semester of Elementary Italian. Although she is a little picky about grading and grammer, it is well worth it. My speaking and writing skills have improved dramatically because of Juliet. Her enthusiasm for Italian is wonderful and I never dreaded going to class. The time flies and she always has classes planned out very well. She is easily approachable and if you are unable to meet during her office hours, she will always find time to meet with you outside of class. Juliet never makes you feel stupid or slow (which you may feel a lot of the time when starting a language) and although she does speak a little fast, she is always willing to go over the material until you understand it completely. I have developed a new love for Italian because of Juliet and if you are willing to put some effort into it, Juliet's class is a great way to get a start with the language. I loved it!!\nWorkload:\nweekly quizzes, short midterm, oral presentation, long final\n"
        }
    ]
}