{
    "prof_info": [
        {
            "prof_name": "Andrew Sarris",
            "prof_id": 301,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "American Film: 1960-1990",
            "review_date": "May 12, 2010",
            "review_content": "\nThe class itself has the same structure each week...\n1.) Watch a movie\n2.) Break (50% of the class leaves... the not so smart ones)\n3.) Attendance sheet gets passed around\n4.) (50% of those who remained in class through break leave... the smarter ones)\n5.) Sarris takes 45 minutes to read a 2 paragraph article, and he uses a magnifying glass to read them. I swear.\nSarris, as other reviewers have succinctly (and accurately, of course) put it, is older than sex. His \"teaching\" is extremely limited, and is confined to reading reviews (by him, and others) and limited discussion by a few people who want to impress a guy who can't hear a single thing they say.\nAnyway, I think the film list stays pretty consistent from year to year, and there are a ton of great ones on the syllabus. Aside from \"classics\" like Psycho, The Graduate, and The Godfather, there are some off-beat movies as well. Some that I liked (Petulia, Bunny Lake is Missing) and some (or, I guess, one) I didn't (Nashville) were more fun to watch than the classics sometimes because of their relatively anonymous actors and obscurity. Gotta love the Grateful Dead in Petulia, man!\nThe grading is based on attendance and 2 papers (midterm+final), and your grade will be completely based on your TA and your relationship w/ him/her. My TA was a ridiculous stickler when grading (at least compared to the others), so I was rightfully dissapointed when I was receiving full grades lower than friends whos papers were not nearly as thorough or well-written as mine... OH WELL. As for the attendance part, there is required recitation, and as I said, there's the attendance list that goes around too.\n\nWorkload:\n1 Midterm Essay (5-7 pgs) (30%)   .... 1 Final Essay (10-12 pgs) (40%)  .... Class Participation/Attendance (via recitation) (30%)\n\n"
        },
        {
            "course_name": "Auteur Study: Howard Hawks",
            "review_date": "January 05, 2009",
            "review_content": "\nSome people might find Sarris cute, funny, and silly, but if you are actually trying to learn about a famous director like in Auteur Study, Sarris is extremely frustrating. Now 80 years old, Sarris is a legend amount film academics for inventing Auteur theory, but can't teach for shit. He came into the class, maybe talked for five minutes about some trivia, and then after the screening, asked people what they did and did not like about the class. The only insight came from the readings and putting the pieces of the film together myself. Sure it will be nice to say \"I took a class from Andrew Sarris\" some day at some fancy film dinner, but I wish I could have gotten more out of the class.\nWorkload:\nweekly readings for discussion section, two papers (7-10 and 10-12) graded surprisingly harshly by the T.A.\n"
        },
        {
            "course_name": "International Film History 1960-90",
            "review_date": "March 04, 2008",
            "review_content": "\nAndrew Sarris is about 200 years old. sometimes he closes his eyes mid-sentence and we wonder if he just passed. he is an intelligent, accomplished film reviewer, but it may be time for him to hang the towel on being a professor.  hes actually pretty funny sometimes, but definately visibly disabled by his age. classes consist of one movie viewing, a break where most sudents would leave, and then he would read some of his own reviews and others' reviews of the film to the class. some of the movies are pretty good, but some are really boring. the midterm paper and final papers arent too bad, and the grading is generous. \nWorkload:\none midterm, one final. easy grading.\n"
        },
        {
            "course_name": "American Film History 1930-1960",
            "review_date": "May 10, 2007",
            "review_content": "\nSarris is 78 and looks it. he doesn't really have anything to do with the course other than film selection and comments before and after screenings. However, i really like him. He seems like a genuinely nice guy. he's very unpretentious and has a nice sense of humor. The course is run by the TAs, but Sarris sets a nice laid back tone.\nWorkload:\n2 papers 5 pages each. That's it. Seriously.\n"
        },
        {
            "course_name": "Writing Film Criticism",
            "review_date": "April 28, 2007",
            "review_content": "\nThis guy is absolutely hysterical. He is a living legend as a film critic and also as a prof. Sarris told us flat out that he did not want to teach the class, but was forced to. He did have a few nuggets of information but we just watched movies and wrote reviews.\nWorkload:\n3-4page paper ever week\n"
        },
        {
            "course_name": "Film Noir",
            "review_date": "December 30, 2004",
            "review_content": "\nAt the first meeting of discussion section for this class, students were asked why they were taking the course.  An overwhelming majority said \"because Sarris is teaching it.\"  He's a great guy, really funny, and his knowledge is extensive.  It's fantastic to take a class with such a renowned film critic, but he is getting along in years, and if you're looking for an in depth analysis of each film and the genre as a whole, you won't find it here.  Also, although Sarris encourages participation, he is a bit hard of hearing, so it's often difficult to get your point across, and if he doesn't agree with you, he can be a bit stubborn.  However, I would still recommend this class to anyone who wants to get a general idea of what film noir is about from a professor who always makes class fun.\nWorkload:\nmidterm paper: 5-7, final paper: 7-10; be forewarned, Sarris often gets the least competent of the TAs.\n"
        },
        {
            "course_name": "International Film History 1960-90",
            "review_date": "June 17, 2004",
            "review_content": "\nThe reviewer who referred to Sarris as a \"dotty old man\" is on the right track, but Sarris is actually a \"dotty old man\" who knows film and knows what he's talking about.  Though the class should actually be called European Film History instead of \"international\", the types of screenings were varied and well-chosen.  Sarris is a unique teacher in the film department because his expertise is critical, rather than historical or practical.  He looks at films differently from the other professors in the department and I was glad to have a professor who didn't gush over a film for it's beauty but would announce to the class why/why not he liked a film.  Yes, he rambles, and yes, he's hard to hear and sometimes incoherent, but you have to respect him and his opinions and he's sometimes very funny.  He encourages class discussion, asking our own reactions to the films screened.\nAt the end of the semester I was unsure whether I had actually learned anything: I don't think Sarris changes the way his students look at film/react to film/make films.  Instead he voices opinions and acts as a sounding board for his students opinions.  There is no reading for the class (not necessarily a plus, as reading would have provided me with some direction and feeling of accomplisment).  Discussions were laid-back and sometimes included screenings at the TA's discretion of material from outside Europe.\nOverall, the main flaw from the class is it's lack of direction.  The TA basically said \"go write a paper about film.\"  There was no rhyme or reason to any of the films screened and no overall messages or themes Sarris tried to impart.  But I'm willing to overlook all that and take more Sarris classes because he is a legend, has been around forever, and the few nuggets you get from him are brilliant.\nWorkload:\nTwo 5-8 page papers \"on film.\" NO readings.\n"
        },
        {
            "course_name": "International Film History (1930-60), International Film History (1960-90), Auteur Study-- Billy Wilder, Writing Film Criticism",
            "review_date": "March 05, 2004",
            "review_content": "\nI agree with the previous reviewers insofar as the fact that Sarris isn't your typical professor. . . Thank GOD.  He's self-effacing, but he also eschews feigned modesty.  I don't know why people have qualms about Sarris' style.  Chances are, they were influenced by his mode of thought before they even set foot into room 511.  Don't expect Sarris to serve up his instruction like well-prepared feasts.  You may have to forage through his digressive anecdotes for the golden nuggets of wisdom.  The truth is, he's not \"dotty\" in the slightest.  No matter how much his tales meander, they always wind up delivering a surprisingly cogent point-- that is, if you bear with him and listen.  And, if you read any of his reviews in the Observer, you already know that this style of speaking probably derives from his much-loved bel lettre writing style.  If you're expecting to be instructed, you'd do better to learn from Sarris as an example.\nProf. Sarris always tries to get a feel for what the young people today are like-- he gives class a somewhat homey feel, which I find most welcome.  At the same time, he's not afraid to discuss the grittier aspects of film.  In fact, Sarris brings up sensuality and sex in nearly every class-- only he doesn't coat the topics in slippery theoretics.\nHis writing film criticism class is wicked good.  It's very small, and he tells you what he thinks of your review right then and there.  Unlike some film profs here, he's very direct in his suggestions, as well as his praises.\nWorkload:\nYou get out of it what you put in.  If wishes and buts were clusters of nuts, we'd all have a bowl of granola.\n"
        },
        {
            "course_name": "American Film: 1960-1990",
            "review_date": "May 31, 2003",
            "review_content": "\nThis class was exactly what I wanted. The movies were (for the most part) classics, the assignments were few, and Sarris was hilarious (in an old man sort of way). You don't learn too much but do get to see film classics (Chinatown, Godfather, Kramer v. Kramer, etc). Sarris is very old and a bit nuts. The 2 TAs in the class did all of the grading, led discussion sections, and even put on and took off Sarris's microphone; yet during the last class he looked at them and asked if they were the TAs for the course and if they could write down their names and phone numbers for him. Classic. He will scream and act like a crazy old man...and it's fun to watch.\nWorkload:\n2 papers. 5-7 pages and 7-10 pages. That's it.\n"
        },
        {
            "course_name": "International Film History 1960-90",
            "review_date": "May 20, 2003",
            "review_content": "\nAlthough I DO think Prof. Sarris is a living legend, I am inclined to agree with what others have said.  He doesn't really teach so much, just basically asks us: \"How many people liked the film? Why/why not?\"   Also, practically all of the films are French, despite the fact that this is supposed to be an \"International\" film history class. However, I did find professor Sarris to be very insightful (at times) and was awed by his vast knowledge of Cinema. Also, in terms of the T.A., I had an AWESOME T.A., who totally made up for the lack of world cinema in the actual class.  He would teach us and show us films from practically every genre, including Hong Kong Cinema, Latin American cinema etc.  AND he even allowed us to write on any of the films we saw in his T.A.  session, if we didn't like the ones we saw in class.  Overall, I'd give this class an A, because the T.A. was awesome and because it's worth it to take Sarris' class just to say in 30 years that you studied under him.  \nWorkload:\nPretty easy: one Midterm paper 5-7 pps. and one final paper 8-10 pps.  \n"
        },
        {
            "course_name": "International Film 1930-1960",
            "review_date": "December 31, 1999",
            "review_content": "\nSarris is well-known in his field of film criticism, making his classes popular among the film crowd. Unfortunately, he doesn't really teach. He shows films that he really enjoys, so the syllabus varies, depending on what he wants to watch. It is a fun class to take for the great films, one watches Hitchcock, Rosselini, Bergman, Mizoguchi. If you can take it pass/fail, please do. The grade depends entirely on two papers and your TA's impression of you during the mandatory weekly discussion section. Sarris is entertaining to listen to, as he likes to tell anecdotes, and often uses the extra time after the film to review with his audience the recent films he's seen. He likes objections from the audience, and especially likes to try to tear them apart.\nWorkload:\nHe assigns no work, so the workload of the class depends on the TA, who may or may not assign readings and other homework.\n"
        },
        {
            "course_name": "International Film 1930-60",
            "review_date": "December 31, 1999",
            "review_content": "\nSarris is a supposed legend here at Columbia. Yeah, riiiiiight. He's more like your long-lost dotty grandpa who every now and then coughs up an insight about a film along with his lung. The films are *half-British* anyway, so don't expect a real worldly perspective. If I wanted to see three weeks of Hitchcock, I'd have taken that odd-looking Hitchcock class a few semesters back. The grade is totally based on the TA's opinion of your writing and commentary in section, which is unfortunate because Sarris almost never arms you with anything constructive to discuss and write about. A low point in the film department.\nWorkload:\nNO readings, midterm and final papers\n"
        }
    ]
}