{
    "prof_info": [
        {
            "prof_name": "Robert Brink",
            "prof_id": 9593,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "March 23, 2011",
            "review_content": "\nBrink is a brilliant writer whose comments are kind of insightful and beyond critical.  Ignore what he tells you in terms of your argument's content, but listen to his opinions of writing style and technique.  Cocky or not, he's got mad literary skills.  And he sticks to the mantra he'll tell you on the first day of classes- \"A perfect paper earns a B, while a revolutionary paper earns an A.\"\nHe's always extending deadlines, so honestly- work to your own schedule. Don't fall too behind, but if you follow his instructions he'll be satisfied.  He likes risk in your claims.  He also likes telling you you're being too risky and it makes no sense.  He has this terrible habit of making up his own literary devices and continuously applies them to all of his responses to your work.  It's good that for when in a writing class he creates literary terms, but he never defines them.  He'll kind of just introduce them and get confused later on when he finds it \"surprising nobody in the class really did such and such in their essays.\"\nFollow his instructions, employ the techniques he gives and use the arguments he so obviously emphasizes and you'll get a B.  Over-dramatize it neatly, and you might get an A.  His grading will seem unfair, because when he comments on your work he nitpicks at small problems and then tells you they're repeated throughout your essay and are problematic (duh).  Single mistakes like missing a signpost in a transitional sentence or making too general of a claim will let him justify your argument as not credible and A-unworthy.  He'll correct you on MLA format that doesn't exist; he makes up his own format of in-paper citations and will criticize your title pages.  Titles pages don't even belong in MLA, but bear with him because he will make you a better writer.  Even if it drives you to the Brink of insanity.\nWorkload:\nP1, P2, P3 and P4, graded \"Brink\" style.  Very little reading, and his small assignments are usually easy and only graded by whether or not you hand them on time.  He extends deadlines frequently.\nLearn fast that the class 100% works on his schedule.  He means well.  I think.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 18, 2011",
            "review_content": "\nA brilliant graduate film student.  He's a master with words, and is skilled in maneuvering and handling the class in any situation.  The fourth essay (retrospective), he allowed us to complete in class, and basically assigned everyone an A.\nHe scared me a tad on the first day when he explained, \"A perfect paper, one that is absolutely flawless, that earns a B in my class. In order to earn an A, it must have the power to start a revolution, bring me to tears, and/or change the world.\"  I found out that was a bit of an exaggeration as a number of students ended up earning A's on various assignments.\nHe is a bit late on deadlines and often pushed them back. He treats us like adults and expects us to act accordingly.\nFair grader, and a generally caring teacher with a good sense of humor.\nWorkload:\nWeekly readings and/or drafts on papers due.\n"
        }
    ]
}