{
    "prof_info": [
        {
            "prof_name": "Rebecca Gould",
            "prof_id": 9678,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 12, 2010",
            "review_content": "\nWhile Prof. Gould brings an interesting perspective to the first semester Lit Hum curriculum (she's a specialist in Middle Eastern languages and cultures and did a lot of undergrad work in Russian lit), she falls short in organizing discussions and conducting the class in a way that really enhances your understanding of the material. I feel as if anything I got out of the class was a result of my encounters with the texts, not the discussions. I was lucky for knowing how to close-read texts when I came into the class, because the way she made it sound a lot of students in the class didn't and from what I saw, she didn't do a very good job of teaching them how. The paper prompts were frustrating to most students - I would recommend running a thesis or outline by her before you delve into anything. If you just want to get through lit hum, hers would be a solid class, but if you're a little more serious about the material, avoid her section.\nWorkload:\nStandard stuff - apparently she's considering just assigning one large, in-depth paper for second semester instead of the regular two?\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2010",
            "review_content": "\nShe's no doubt an intelligent person.. however she shows up to class late every time, seemingly unprepared and very frazzled. She doesn't drive discussion nor does she explain the themes well. She will try to push certain texts on students.. mainly Histories, which was her favorite. She also doesn't answer her emails promptly and tells students that if they are shy and don't participate in the discussions (dominated by 2-3 students, usually), their participation points may suffer when considering overall grading.. If faced with a choice.. don't take her unless you want nothing out of the course other than an ok grade.\nWorkload:\nStandard Lit Hum. 2 essays, midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2010",
            "review_content": "\nWhile I couldn't agree more about what the previous reviewer said, it is always helpful to have as much information as possible. Rebecca really has a passion for literature, and although her academic interest is in literature not as well covered by the LitHum syllabus (she is in the MELAC dept) she definitely is knowledgeable. That said, she completely left class discussion up to us, only standing up and (shouting, really) saying something when it was some small point on translation or additional information. I walked out without feeling like I had gained anything every single class. It's a shame, because she is so passionate, you're inspired/impressed/encouraged. However, she really cannot relay her knowledge to the class and never really connected. \nWorkload:\nnext to nothing. 2 papers, midterm and final. which was obviously nice\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 23, 2009",
            "review_content": "\nUgh, what a waste of my fall semester of Literature Humanities. Rebecca has such a tremendous... desire (?) to do something great, but simply doesn't have the presence to be in a classroom of Columbia-caliber students. It's a shame, for there's no doubt that she's an intelligent, competent woman- but not suited to teaching first-years. She fails to explain her expectations for the course, can't accurately answer questions about the texts in question, and is inarticulate in class discussions. Although it was nice on occasion to have some leeway to lead discussions ourselves, we needed more definitive direction at times, and it was simply not forthcoming.\nWorkload:\nStandard Lit Hum\n"
        }
    ]
}