{
    "prof_info": [
        {
            "prof_name": "Betsy Sparrow",
            "prof_id": 3299,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Intro to Social Psychology",
            "review_date": "March 11, 2014",
            "review_content": "\nShe is the worst Professor I have experienced in my college life. She mumbles all the time which make students irritated. Her explanation with the terms and experiment design is very vague and unclear which makes students hard to fully grasp the material. She even often gets wrong while explaining some experiment design and explains it again. I know humans are predisposed to mistakes, but it is very annoying when it comes to hearing mumbling lecture and note taking. Although she is very caring and kind, I don't think she has good teaching skills.Opinions might differ, but this is what I and my friends felt.\nWorkload:\nNot too much. Just review the lecture slides and do some supplementary reading which are selected.\n"
        },
        {
            "course_name": "Social Cognition Seminar",
            "review_date": "January 02, 2013",
            "review_content": "\nProfessor Sparrow is  carefree and down to earth. Her seminar Is fantastic. She's so understanding and really cares about her students! She even goes overboard to offer letters of recommendations for her students. Lenient grader that just wants you to enjoy the material. Feel lucky if you get in her seminar! She rocks! \nI feel like I could go on forever on how great she is. \nI wish every professor was like her. I truly hope to take more of her courses in the future.\nWorkload:\n1 10 page paper, couple of weekly readings. No homework and asks that we not bother taking notes in class.\n"
        },
        {
            "course_name": "Introduction to Social Cognition",
            "review_date": "May 16, 2011",
            "review_content": "\nThe course material is fascinating. Regardless of your field, the stuff you learn in this class will stick with you. Sparrow is a decent lecturer, but only because what she's talking about is compelling. The grading system is just plain silly (but fairly easy, if you actually study). This is the first class I've ever taking where I wished the professor actually tried to push more by having actual assignments/tests that weren't all dumb multiple choice. \nWorkload:\n3 Midterms consisting of 33 multiple choice questions each (you drop the lowest grade), 1 short answer final where she gives you the questions in advance, thereby making the final laughably easy and an exercise in pointlessness.\n"
        },
        {
            "course_name": "Intro to Social Cognition",
            "review_date": "May 02, 2011",
            "review_content": "\nThis review is not going to be about prof. Sparrow's character and sense of humor - both of which are as pleasant as unrelated they are to the actual material. Social cognition as a subject is perhaps the most fascinating of all academic topics I ever dealt with, but this is largely cancelled out by boring lecturing style of prof. Sparrow and an unacceptably large class (150 students). Turning an interesting material into a boring routine is an academic crime and should not be rewarded by silver leaf.\nThat said, 2-3 days of studying should get you a good grade on any of the 4 exams. \nWorkload:\n3 midterms (2 best count towards final grade) plus cumulative essay-style final (40%). As mentioned above, two to three days of studying just before any of those will most likely get you an A.\n"
        },
        {
            "course_name": "Introduction to Social Cognition",
            "review_date": "May 20, 2010",
            "review_content": "\nProf. Sparrow is not the most gifted lecturer.  She often mumbles, making it very difficult to understand what she is saying, and her occasional cursing and mainstream political comments are distracting and offensive.  She also panders to the students, in a very transparent effort for approval.  Her midterms do not adequately test your knowledge of the material; rather, they indicate how well you can choose the correct answer from the somewhat tricky multiple-choice questions.  In lieu of a textbook, she assigns approximately four articles per week.  These are mostly research articles from psychology journals and are quite difficult to get through, but completely unnecessary for success in the course.  They may, indeed, deepen understanding of the course material, but as previously mentioned, the midterms do not exactly test that knowledge.  If you want to see what you did wrong on any of the exams, you have to schedule an appointment to see her or one of the TAs, as no in-class opportunities are provided to review your performance.  \nThat said, the topic is truly fascinating and, although much of it is common sense because of its everyday relevance, you will learn about the mechanisms and theories behind why human beings behave the way we do.  You will also become aware of the myriad studies which have been conducted in this exciting field of psychology.  Prof. Sparrow's lecture slides are well put together and thorough and, really, the only things you need to study for exams.  Barring any drastic changes to the course, what you need to do for an A is attend lectures and study the slides, focusing on the main subtopics she introduces at the beginning of each class.  \nWorkload:\n3 all multiple-choice midterms (33 questions each; lowest grade of 3 is dropped; remaining 2 worth 30% each; each M-C question is worth too much -- 3 pts.); final made up of 4 essay questions provided in advance (worth 40%)\n"
        },
        {
            "course_name": "Intro to Social Cognition",
            "review_date": "May 13, 2009",
            "review_content": "\nTake her class! Honestly one of the best professors, if not actually THE best professor, I've ever had. Down-to-earth, really wants every student to do really well in the course (she actually told me during office hours that I should just skim the readings rather than read them all in full when I went to ask her how I could turn my 85's on exams into 95's), very accessible, chooses interesting topics for lectures, is refreshingly unpretentious and clearly loves what she teaches. She puts a lot of care and work into her class and always tries to be kind, fair, and helpful to students. She is fantastic (and I can be very critical of professors, trust me). She's also very understanding if you are sick or have a family emergency and need to take an exam late or come to office hours for help because of it.\nWorkload:\nReading: scientific papers that can often be skimmed if you're good at skimming, and she decided not to use a textbook for the course next time she teaches it, so you won't have to deal with the horrible textbook we had to read for the first half of the class. Three exams, nice curve, but her lectures do contain a LOT of slides and a lot of material, and I think a lot of the questions on her exams were difficult. You really do have to study and do at least some of the reading to do well on the exams, and I don't think you can do at all well in this course if you don't go to the lectures and just try to teach yourself from the slides the way lots of my friends did for Frontiers of Science. \n"
        },
        {
            "course_name": "Intro to Social Cognition",
            "review_date": "April 27, 2009",
            "review_content": "\nProf. Sparrow is young, friendly and really intelligent. So easy to talk to! The material is fascinating and covers a selection of interesting phenomena that will have you wondering and thinking back to the course in everyday situations. She's funny and gives good examples.\nThe reading is not heavy and only some of what's on the list is required. Our test was hard once, but she was very reasonable about grading it so that things were fine in the end. In fact, the best thing about her teaching style is that she really wants you to understand the main issues and get the point and is not a sticlkler for details.\n \n"
        },
        {
            "course_name": "Introduction to Social Cognition",
            "review_date": "February 14, 2009",
            "review_content": "\nProfessor Sparrow is definitely an amazing person. Her lectures were engaging and she did a great job clarifying the materials. The only thing that I had problem with was her tests with vague questions. (You will find some questions uninterpretable, and sometimes fairly indifferent answer choices) But the good side was that she curved them.\nWorkload:\nOptional readings. 3 Tests focused primarily on the lecture slides.\n"
        },
        {
            "course_name": "Introduction to Social Cognition",
            "review_date": "January 12, 2009",
            "review_content": "\nAbsolutely terrible...and I got an A in the class so I am not bitter due to bad grades. I am bitter because a topic that is common sense to most people was made into a semester-long torture fest as an incompetent professor fumbled through a billion poorly-presented experiments. Most of which I had already learned in prior psychology classes and only through intense scrutiny discovered were indeed actually the same experiments--even though you would think they were from a different area of study with the way she explained it. \nWith every question asked in class by students, she would stall, mumble something and move on, or supply an answer that had nothing to do with the question, or say something incorrect, or just reply that she did not know.\nThe tests were just as randomly constructed as the class. The questions asked seem to stem from nowhere and the answers to choose from on the multiple choice often left one to the game of eeny-meeny-miny-mo. The textbook was useless and compensated for the natural simplicity of the subject matter by making the material as esoteric as psychology will naturally permit. Only after a couple of months did Professor Sparrow finally concede the futility of using the textbook and told us to simply stop completely, relying only on her notes for study.\nSince the textbook was useless, the reading for this class was not much-a few articles a week. The tests were not hard to do well if you had a mix of common sense and knowledge of psychology from prior classes--that is for the questions that were answerable based on material. \nThen, there is her ignorance in other areas. To connect to students and perhaps appear \"cool,\" Sparrow often made random popular political statements... in a Social Cognition class. How they are relevant still boggles my mind--almost as much as the complete dearth of her insights both regarding psychology and the other topics she deigned to comment on. \nYes, she is nice-- but why shouldn't she be. This is not a reason to take her class. The fact that she smiles while being a bad teacher instead of yelling while being a bad teacher is poor comfort.\nOVERALL: STAY AWAY!\nWorkload:\nNo work really besides the effort spent trying to stop yourself from committing suicide.\n"
        },
        {
            "course_name": "Introduction to Social Cognition",
            "review_date": "May 17, 2008",
            "review_content": "\nAwesome professor and extremely sweet person!  Lots of reading but it's very interesting.  I never missed a class and that definitely speaks to how much I enjoyed the course. \nWorkload:\n3-4 exams.  No papers.\n"
        },
        {
            "course_name": "Introduction to Social Cognition",
            "review_date": "May 17, 2008",
            "review_content": "\nAwesome professor and extremely sweet person!  Lots of reading but it's very interesting.  I never missed a class and that definitely speaks to how much I enjoyed the course. \nWorkload:\n3-4 exams.  No papers.\n"
        },
        {
            "course_name": "Social Cognition Seminar",
            "review_date": "November 06, 2007",
            "review_content": "\n   Awesome and nice professor!! She went to Columbia Undergrad and just finished psych grad school after doing some interesting research on Google and memory. So she's really accessible, giving us interesting readings and explaining them clearly but leaving ample room for discussion/debate. I don't know how hard of a grader she is yet, but we're all not worried since she has so far focused our assignments on helping us actually learn the material and generate our own theories/research ideas without so much focus on the grades. She also has been pretty accommodating in general.\n     The subject itself is cool for both psych concentrators and non psych people as it deals with different areas of research on how social interaction and self reflection affect our thinking (with a special emphasis on how we're actually really bad at judging perspectives or states of mind outside our own current one). Betsy is great if you're looking for a chill, easy-to-understand teacher who's up to date on current research. \n    She's also willing to listen to the suggestions we have on what would make a good lecture, so I'm sure her Social Cognition course in the Spring will also be fun.\nWorkload:\nAbout 4-5 primary articles a week with a discussion posting, graded by a check or check-plus. Final research proposal paper due during the last day of class. \n"
        }
    ]
}