{
    "prof_info": [
        {
            "prof_name": "Jian Wang",
            "prof_id": 5502,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "May 11, 2011",
            "review_content": "\n   Yes, he sounds SOMEWHAT like \"Jimmy\" from South Park. Let's get that out of the way. \n   He ALSO is one of the smartest professors I've yet met at Columbia though. He has exceptional facility with numbers -- the entire class was shocked when he solved difficult computations in his head. This trait makes him somewhat intimidating, but ultimately helps immeasurably in his presentation of materials by allowing him to focus on theory rather than just computation. \n   His exams are very fair -- the content of the actual exams closely mirrors the sample exams he distributes ahead of time, and he is extremely lenient with regard to partial credit. Like other posters have said, he occasionally curves. The first midterm he did not curve at all. The second midterm had a strange (half your score +40) formula. The final had an interesting (raw score *.6 + 42) curve as well. \n\n   Homework is often very challenging, but you have the benefit of turning it in immediately prior to the exam at once -- in other words, there is absolutely no penalty for late homework, providing you get it in prior to the exam day. \n    The best thing about him, though, is that he is always extremely helpful and very responsive to emails. Calc II can be rough, especially the work on series, but he was always ready and willing to answer any questions you might have. He ALSO doesn't make you feel like an idiot if you don't understand his initial explanation and ask for clarification. \n    Lectures are good to go to, since many exam questions come directly from the notes. As in at least 50% of them in this class' case. Even so, many people opted not to come to class and -- concordantly -- their grades suffered. Class time is also useful as he encourages students to come to the board and work out in-class exercises. \n     All in all, I would consider him a wonderful professor and -- should the opportunity to take a course with him present itself -- go ahead and take it without fear. \nWorkload:\n- Weekly homework (no penalty for lateness provided it is completed by exam time)\n- 2 midterms (one on Integration techniques, one on Differential Equations)\n- 1 final (80% of which covers Series) \n\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 21, 2010",
            "review_content": "\nNice guy, competent, very quick to grade. Decent in one-on-one.\nHas a lisp, stutter, thick Chinese accent and quiet voice, so don't bother coming to class. \nOr even taking the class, come to think of it.\nSeriously - I could not understand a word he says. He often skips steps too and assumes we understand.\nJust buy the textbook and do some problems.\nHe works very directly from the book, chapter by chapter (by Stewart).\nHe will sometimes curve the exam and sometimes not, depending on how well people do.\nWorkload:\nPredictable, not too difficult\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "May 15, 2010",
            "review_content": "\nProfessor Wang is a really good professor. As a starting note, I'd like to say that he does have a stutter, as mentioned by another poster, but it's really not bad. Understanding what he is saying is really not a problem, and his explanations of things are always very clear. You may be a little surprised at the first class, but you will quickly get used to it and see it's nothing to worry about. He is well prepared for literally every single lecture and is a real beast at math, so he can intelligently answer virtually any question thrown at him (although I never asked a single question during class, I watched others do it- some questions being alarmingly stupid). He grades things incredibly fast, which is an added bonus. I remember that our first midterm grades were posted literally hours after we'd taken it, with the breakdown and whatnot sent as an email as well. Professor Wang handles all of this well and is basically just a really chill guy. Good class. \nWorkload:\nweekly problem sets (not bad at all), two midterms, one final. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "June 25, 2009",
            "review_content": "\n   Professor Wang is awesome. He's a good calculus teacher, a fair grader and is available to his students for at least an hour a week where you can work out homework and class problems on the board, one on one. He's also well organized. The class had a flow to it and he was clear and concise in his teaching. \n   Another nice aspect of the course was that it was small (only 20 or so people) so it wasy easy to ask questions and have a class discussion. He also graded exams immediately--I often found my grade posted that night. \n   I was so scared to take this course having not taken anything math related for six years, but he made the transition easy and I have been able to use this foundation for my science courses in working derivatives and integrals. One tip--go to class often and get to know him because with such a small group of students, it's easy for him to see who's trying and who's not. \nWorkload:\n1 Problem set due per week, 2 midterms and 1 final; problem sets handed in late do not incur penalties.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 02, 2009",
            "review_content": "\nI'll give Jian credit for trying. Every class he was well-prepared and he is extremely talented in math. Really I dislike how fast-paced the class is, but hey, that's just me. The advice I would like to pass on is that if you are not willing to take the time to schedule office hours for more one-on-one time with Jian, you probably should not take this class. He has an accent and he also stutters, so it can get very hard to understand him. Our class started off with 40 students and by the end of the second week, we had merely 10 students. This should indicate the difficulty in understanding what Jian was saying.\nOne-on-one, Jian is actually a very good teacher. He slows down and knows exactly how to help. So if you are ok with simply learning during office hours, then you should be fine.\nWorkload:\n1 problem set a week, 2 midterms, 1 final.\n"
        }
    ]
}