{
    "prof_info": [
        {
            "prof_name": "Geraldine Downey",
            "prof_id": 176,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Children at Risk",
            "review_date": "December 14, 2016",
            "review_content": "\nBest class ever! I loved this class so much.  Favorite course taken at Columbia so far. Professor Downey is so nice and her class is very chill.  If you are a psych major or just interested in the topic I would strongly recommend this class.  We don't only talk about children but important social issues that everyone faces.  She is also not a hard grader and wants everyone to do well. \nWorkload:\nThere are readings every week but you do not need to do them.  There is a midterm paper, an in-class essay, a final paper and presentation.  You can do pretty much ANY topic you want.  There is also one easy homework assignment the first week of the semester.\n"
        },
        {
            "course_name": "Children at Risk",
            "review_date": "December 13, 2016",
            "review_content": "\nThis class is truly amazing! If you have any interest in infants, children, adolescents, young adults or understanding how our society effects developmental outcomes take this class. This is not like your average pscyh class, we’ve talked about such a diverse range in this class. Here are some examples: school shootings, gang violence, pregnant mothers with substance use problems, children in poverty, teenage mothers, sex-ed curriculum in the US, rejection sensitivity. It was amazing how much freedom you have in what you get to research! Professor Downey invites professionals working in related field and becomes a personalized networking session!\n\nWorkload:\nvery light, they might give some work the first day of class but that’s literally the only time we had homework.  One midterm with question given from the beginning of the semester, one individual paper (6-10 pages), one research paper and presentation. Very manageable.\n"
        },
        {
            "course_name": "Children at Risk",
            "review_date": "December 11, 2016",
            "review_content": "\nThis class is truly amazing! If you have any interest in infants, children, adolescents, young adults or understanding how our society effects developmental outcomes take this class. This is not like your average pscyh class, we’ve talked about such a diverse range in this class. Here are some examples: school shootings, gang violence, pregnant mothers with substance use problems, children in poverty, teenage mothers, sex-ed curriculum in the US, rejection sensitivity. It was amazing how much freedom you have in what you get to research! Professor Downey invites professionals working in related field and becomes a personalized networking session!\nWorkload:\nvery light, they might give some work the first day of class but that’s literally the only time we had homework.  One midterm with question given from the beginning of the semester, one individual paper (6-10 pages), one research paper and presentation. Very manageable.\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "January 21, 2003",
            "review_content": "\nProf. Downey teaches interesting material and can keep a class awake for the most part.  Yes, classes can get boring, and off-topic discussions often end up taking up most of the class time.  Regardless, you're still responsible for the material never actually covered during her lectures.  The book is definitley not bad if you're looking to learn about psychological abnormalities, but 10 pages of material could definitely have been narrowed down to 2; there is way too much unnecessary detail that you are still responsible for.  \nWorkload:\n2 midterms with take-home parts, final, optional paper, and a LOT of reading \n"
        },
        {
            "course_name": "Abnormal Behavior",
            "review_date": "May 26, 2002",
            "review_content": "\nDowney's beautiful Irish lilt makes lectures on schizophrenia and alcoholism strangely soothing. Try to stay awake. The class might seem easy - the subject matter is lots of stuff you probably already know. But the tests are harder than they seem. You must go to every class as the tests are mostly based on lecture material not in the book. We had 2 very cute TAs (Phillipe and Ethan) which is always a plus.\n"
        },
        {
            "course_name": "Abnormal Behavior",
            "review_date": "May 10, 2001",
            "review_content": "\nThe lectures are often pretty interesting, but this is due to the topics, not to Prof. Downey's lecturing skills. She knows her material very well in the areas of schizophrenia and alcoholism, so she focuses on these two topics a bit too much, but the course is pretty comprehensive. She has an Irish accent and a speech impediment, which makes it hard to stay focused sometimes, and makes her seem less confident in her lectures than she probably is.\nWorkload:\n3 tests, 2 take-home tests, lots of text book reading, and you read one 400 page book; it's a fair amount of work, but an interesting course\n"
        },
        {
            "course_name": "Abnormal Behavior",
            "review_date": "April 05, 2001",
            "review_content": "\nDo you want to take a class that will teach you nothing and whose lecturer has a stutter? Then abnormal psych is the class for you! Professor Downey, while possibly possessing some intelligence, bestows none of it onto the class, giving the most superficial and shallow look at mental disorders possible. Most of what she teaches, you already know! Yes, the class is easy, but having your eyeballs scratched at for three hours a week is less painful than her lectures. Downey dumbs down the subject matter, gives incoherent and wandering lectures and tends to be unable to answer any question posed to her. And let me reiterate, regarding the lectures: she has a stutter.\nWorkload:\nThree tests, two with take-home 5 page papers. The tests are easy, but there's no curve -- miss too many multiple choice questions and you learned nothing AND got a C.\n"
        },
        {
            "course_name": "Abnormal Behavior",
            "review_date": "April 05, 2001",
            "review_content": "\nDo you want to take a class that will teach you nothing and whose lecturer has a stutter? Then abnormal psych is the class for you! Professor Downey, while possibly possessing some intelligence, bestows none of it onto the class, giving the most superficial and shallow look at mental disorders possible. Most of what she teaches, you already know! Yes, the class is easy, but having your eyeballs scratched at for three hours a week is less painful than her lectures. Downey dumbs down the subject matter, gives incoherent and wandering lectures and tends to be unable to answer any question posed to her. And let me reiterate, regarding the lectures: she has a stutter.\nWorkload:\nThree tests, two with take-home 5 page papers. The tests are easy, but there's no curve -- miss too many multiple choice questions and you learned nothing AND got a C.\n"
        },
        {
            "course_name": "Children at Risk",
            "review_date": "December 31, 1999",
            "review_content": "\nIn Abnormal Psychology she's very interesting, with amusing anecdotes. Her experience with prisoners and various subjects, particularly relationships, make for a very interesting course. You must be there for her lectures, as they are well-covered on the exams. However, as for her Children at Risk lectures, they are boring as hell. Everyone, including the TA, falls asleep. There are just not as many anecdotes, and she goes monotone. This discrepancy may be because the course is newer and she is not as accustomed to the subject material as with the Abnormal material.\nWorkload:\n(Abnormal:) 3 exams, with take-home sections similar to essays/papers, plus lots of reading. Offers an optional extra-credit paper, but unless it's \"excellent\" it won't be given any credit! (NOTE: curve makes the relatively easy tests a pain, because it'll work against you. (Children at Risk:) Individual Project, Group Project, Exam, tons of work, attendance mandatory.\n"
        }
    ]
}