{
    "prof_info": [
        {
            "prof_name": "Fay Ng",
            "prof_id": 10179,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "INTENSIVE ORGANIC CHEM LAB",
            "review_date": "November 27, 2016",
            "review_content": "\nTo begin with, Fay is a great person. She is truly very kind, lovable, and obviously cares a lot about her students. She's always responsive to emails, holds extra office hours if needed and answers every question, no matter how simple or complex. That being said, for the love of God, do not take this class. \nIt is a general rule with STEM labs that you won't be getting much (if anything at all) from the work you do in the course. We all know it, the TAs know it and the professors know it. Fay did not seem to get that memo. Intensive Organic Chem Lab is basically a lot of work with no return whatsoever. Her lectures and the instruction manual covered the basics of the material covered. But for the quizzes, post-labs and lab reports, you had to know how to apply all these concepts that she covered theoretically. Fay is a great lecturer and if you go to office hours it becomes apparent that she can explain everything to you. If you can't go to office hours though, you're kinda fucked. I had to teach myself how to interpret NMR spectra (and even if you think you know how to do that from Orgo Lectures, trust me, you don't) and how to write a \"proper\" chemistry paper. The grading is also insanely nitpicky -- the average on the quizzes and post-labs never got above 12/15, and you could lose points on the most insignificant aspects (defining one peak, out of your 10!, as a multiplet instead of as a doublet of doublets). The worst part? I still need to google \"IR absorption table\" or look up the ChemDraw structure of molecules to be able to figure out their spectra. One would assume that putting in over 10 hours of work on each lab report (and some of the post-labs!!!) would result in some sort of lasting knowledge. One would, however, be mistaken.\nVery rarely is it possible to directly pinpoint the source of all your anxiety and suffering. For me, this was Intensive Organic Chemistry Lab.\nWorkload:\nWeekly quizzes, lab notebook prep for each class, 5 (long) post labs, and 4 lab reports\n"
        },
        {
            "course_name": "Advanced Organic Chemistry Lab",
            "review_date": "May 24, 2015",
            "review_content": "\nPre-requisite: Intro Orgo lab - It is assumed you are familiar with organic chemistry laboratory techniques. This is not meant to replace intro orgo lab but rather supplement it. *If you took Intensive OCHEM Lab, its nice to take this course the next semester*\nCourse: The Course follows the same format as Intensive OCHEM Lab. Read the experiment and prepare your pre-lab notebook before class. In the beginning of class Fay lectures about the experiment to be conducted that day. If its the last day of an experiment, a quiz will be given before going to lab. In Lab you carry out the experiment. These experiments alternate between Short (2-3 class periods) and Long (3-4 class periods). Some days you may finish very quickly. Others you may have to wait a while as the reaction is carried out. You will be assigned a lab partner whom you will work with for the duration of the semester (each has to do an individual lab report). All labs work smoothly for the most part. Lab reports require you to think critically and read source articles in order to explain the results you obtained. This class is great for many reasons including: getting into the habit of reading academic journals, writing in an academic manner about experiments conducted, conducting cool experiments in areas of Chemistry not usually touched upon in Intro OCHEM courses (Molecular Sensors, Chiral Resolution/Asymmetric Synthesis, Metal Organic Frameworks, Material Chemistry/Photovoltaics).\nProfessor Fay Ng: Fay is such a great professor. Her lectures are succinct and help clear up any questions you may have about the experiment. She is very approachable in office hours/ class and makes an effort to get to know her students personally, taking an interest in their activities outside of class. She started this class a while back and you can see the effort put into refining it over the years as the experiments actually work and allow you to develop/strengthen OCHEM lab techniques. By the end of the class, I felt more confident in my ability to work in a  lab environment, my understanding of the subject matters, and my writing abilities. I feel very fortunate to have had her for a full year of lab and can highly recommend any of her classes to my peers. \nWorkload:\n* A slight learning curve for quizzes and Lab reports. While your first few grades may not be too high, you soon learn from your mistakes and notice an improvement in these areas. Also as someone has mentioned below, even if your experiment may not have gone as expected, at the end of the day you are graded on explains your results and not the results themselves.*\n2 Short Labs (each): 1 In class quiz + 1 Short Lab report\n2 Long Labs (each): 1 In class quiz + 1 Take Home Quiz + 1 Long Lab Report\nLast Day: Class Presentation on Chemistry Faculty Member + Pizza\nAs long as you don't wait till the last minute, the course won't feel that stressful.\n"
        },
        {
            "course_name": "Advanced Organic Chemistry Lab",
            "review_date": "June 12, 2013",
            "review_content": "\nFay is super awesome. I learned a lot in her class, and never felt stressed at all. The lab reports were long, but fair, and she set some pretty strict guidelines as to what she wanted, so I feel like as long as you stuck to those, you were great. I read some reviews saying that the quizzes were the most difficult part of the course. That is probably true, because it is really the only part of the class where you are graded on your knowledge of the chemistry involved in each experiment. If you are stuck on just what you are doing in the experiment, you won't excel, you need to truly understand the chemistry involved, and its significance to the world of synthetic or analytic organic chemistry. That being said, I learned a ton of new chemistry and lab technique. The reactions you are doing are pretty new, and involve some pretty expensive reagents/equipment which is also great, and great experience.  Fay is awesome and interested in each of her students, their futures, and their own personal interests. I enjoyed every moment of the class, never was stressed and received an A-. FAY RULES.\nWorkload:\n4 lab reports: 2 short, 2 long. 6 quizzes in class, a short 15 minute presentation on a chem. professors research of your choosing at the end of the semester. \n"
        },
        {
            "course_name": "Advanced Organic Chemistry Lab",
            "review_date": "June 23, 2011",
            "review_content": "\nI have to disagree with the reviewer below by saying that Fay's lab class is actually one of the easiest courses you'll take at Columbia (easier than the REGULAR orgo lab class, from what I've heard).  Because you are not graded on the CONTENT of your lab reports (i.e. your accidental experiments), you won't be punished for getting a poor yield or no product at all.  In fact, a poor yield is very easy to write about so often those lab reports were the easiest to do. \nThe only really challenging part of the class, in my opinion, was the quizzes.  But those don't count for much in the grand scheme of things, so I would definitely recommend this class to any Chem or Biochem major.  It's an easy, nonstressful class where an A is not unattainable. \nWorkload:\nminimal. 4 projects, often going weeks without lab reports.  bimonthly quizzes.\nNO MIDTERM OR FINAL!\n"
        },
        {
            "course_name": "Advanced Organic Chemistry Lab",
            "review_date": "May 12, 2011",
            "review_content": "\nYes, it's an advanced science course, but if you're a biochemistry major who needs to fulfill a lab requirement, this is a great way to do it.  Sure, it's hard; this was the hardest class I've ever taken at Columbia to date, but it was also the most enjoyable.  There are 4 multi-day labs over the course of the semester.  In Spring 2011, they were Catalytic Asymmetric Synthesis, Organic Polymers, Combinatiorial Chemistry and Supramolecular Chemsitry.  None of the topics are covered in any sort of depth in regular organic lectures, so you will be learning something new every class.  That said, the lab reports and quizzes are hard.  The short ones are 6-8 pages and the long ones are 7-10.  They're graded fairly, and there is a curve at the end.  You have to be willing to teach yourself a lot of chemistry from journal articles, since that's really the only way to do the lab reports.  The Journal of Chemical Education will become your best friend.\nFay is probably my favorite teacher here at Columbia.  She explains everything well, and will help you whenever you need it.  She'd talk with us at the start of every class just about how we were doing, and you could tell that she genuinely cared about her students.  \nWorkload:\n2 6-8 page lab reports, 2 7-10 page lab reports, 6 quizzes, 10 pre-labs.  \nAllow 10 hours for each lab report, long or not.  Spend at least an hour studying for the quizzes.  The pre-labs can be done in your sleep.\n"
        }
    ]
}