{
    "prof_info": [
        {
            "prof_name": "Reshmi Mukherjee",
            "prof_id": 1635,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Mechanics",
            "review_date": "January 04, 2017",
            "review_content": "\nThis class was by far one of my favorite classes the past semester. \nI've heard some horrible stories about teachers catapulting information at their students and not caring if their students understand the topic. Prof. Mukherjee is not one of those teachers. \nGranted, her derivations can be unclear, and some homework assignments were difficult, but since there is a physics help room, office hours lead by the TA, AND office hours lead by her, your questions will always be answered. \nOn top of that, her grading system works in your favor. She drops your two lowest grades, and curves the final. And if your final is a better grade than your quizzes/midterms, she'll replace your final grade with your quiz grade. Tldr; you're going to get the best grade possible. \nClass time is typically spent with the first bit being lecture, and the second bit being problems worked on the board, and sometimes amongst groups you're sitting next to. \nAs long as you put in effort and seek out help when you need it, you'll be fine.\nWorkload:\n10 Problem Sets\n5 Quizzes (Lowest 2 Dropped)\n2 Midterms\n1 Final\n*10 labs (depending on if you're taking a lab with this course or not) \n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 21, 2016",
            "review_content": "\nProfessor Mukherjee is the best!! She is brilliant, super devoted to her students, has tons of office hours, and is always willing to give extra help outside of class time. What I admire most about professor Mukherjee is the clarity of her expectations– she will never surprise you on a final with trick questions, and will always tell you the concepts you need to know. \nWorkload:\nThis class doesn't have much of a workload, just a problem set with about 10 problems each week. There are regular quizzes and tests, which are set up as checkpoints for key concepts.\nThere's no way around the fact that this is an easy class, if you're willing to put in any effort.  It's really all about effort with professor Mukherjee– she will make the time for you, so if you want to improve your performance in her class you just need to show up to her problem solving sessions.   She's a very fair grader.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "January 25, 2013",
            "review_content": "\nEven though she isn't a very good teacher... she is such a nice person that I let it all slide. That being said, this course would be alot easier if you come in with alot of preparation in physics and math.... She is friendly and tries to cater to everyone.... \nI recommend her because of her grading style not because of her ability to teach (or should I say Inability to teach) .... \nBasically there are four quizzes, three of which equal a midterm\nThere is one midterm\nThere is homework 10%\nand a final.\nYou can FAIL (literally) everything... and ace the final.... & you will get an A in the class.\nThe catch to this is.... her midterm and quizzes are a breeze compared to her final.... HER FINAL IS HARD! PERIOD. But never fear for their have been individuals before who have overcome it and gotten an A. Like I said the more preparation you come in with the less you will have to worry.... \nAssuming you don't do that great on the final she will determine your grade by the regular percentages of everything in the course breakdown....\n\nWorkload:\nFour quizzes\nOne Midterm\n10 Homework Assignments\nOne Difficult Final\nDoable.... but not a breeze. \n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "January 25, 2012",
            "review_content": "\nProfessor Mukherjee is really laid back and has a calming voice.  Put another way, she doesn't care a ton about this class, and I always wanted to fall asleep during her lectures.  This is to say, my opinion of Dr. Mukherjee completely depended on my mood.\nHer research is really interesting, and she's a really cool person, having worked and NASA and also being a mother and all that.  And she's very nice: she genuinely does not think that people who fail to grasp basic Mechanics are stupid.  But she does not explain things as clearly as Dr. Savin, the lab instructor.\nThe way to learn physics is to work out problems, so it doesn't really matter what your professor is like.  I don't know why physics lectures exist at all.  They are completely worthless.  What you need to know is that this is not a very hard class.  If you learn about five equations, and are really able to use them, you will do well.\nWorkload:\nNot a lot, but she graded the final WAY harder than any problem set, quiz, or the midterm.  The lab is useless busy work, but it doesn't take long to learn what they're looking for in the reports.\n"
        },
        {
            "course_name": "Quantum Physics",
            "review_date": "May 20, 2005",
            "review_content": "\nMukherjee is a good professor who definitely knows her stuff.  But she teaches very fast, so most of her students get lost in the learning process.  Sometimes she makes minor errors in her calculations, but that doesn't really matter.  She is very approachable and is willing to help anyone after class.  Her exams are kind of hard, so make sure you go over the old exams and homeworks.  The textbook, F&T;, is HORRIBLE.  Don't even read it because it's poorly written and organized.  I didn't even bother to study from it but used her notes.  Overall, she is good, but a hard teacher.  Maybe it was just the course that was hard to understand.\nWorkload:\n9 graded problem sets (out of 100), one midterm, and one final.  the homeworks didn't really count into our grades, but the final definitely does.\n"
        },
        {
            "course_name": "Optics, Electricity and Magnetism",
            "review_date": "May 18, 2003",
            "review_content": "\nProfessor Mukherjee is extremely kind and intelligent and cares deeply about her students. If you have any questions or concerns about problem sets, exams, or the class, you can always approach her and she will be more than happy to help clear up any confusion. However, beware, because she does not have a lot of office hours (only two hours per week) so if you can't make it then, you should email her. The lectures were very fast-paced, and I found it difficult to keep up a lot of the time (as did many other students...but hey, its Physics!). If anyone has questions during lecture, she will always stop to answer them. The first semester is not as difficult to understand, but E&M; is insanely hard. The material is mainly derivatives, and the entire lecture time is spent doing derivations of formulas, so even though you get formula sheets on the exams, they won't be much help. In Mechanics, there are two midterms and a final, as well as three quizzes (she drops the lowest grade). The quizzes are not bad and the midterms are also doable, but the final exam is insanely hard. In E&M;, there is only one midterm, and it is all derivations (very difficult, but there is a decent curve), four quizzes, and a final exam that is even more difficult than the first semester. She has a policy whereby she will count the final exam as 80 percent of your grade if you do not do well on the midterms, etc, but don't put all of your hopes in that final because trust me...the final will more than likely lower your grade. There are weekly problem sets which can vary from difficult  to easy (usually there are at least a few difficult problems), but she is sweet enough to solve some of the problems for you in class (usually the most difficult ones!). Also, the labs are easy but you do have to work on them at home; they are a great way to boost your grade because they are 20 percent of the overall grade. Overall, the material is very hard (it's Physics, so I wasn't expecting much clarity there!!), the exams are tough, but in the end, it will all turn out okay. She is a very generous grader and your overall grade will turn out well. She always gives you the benefit of the doubt and your grade will turn out to be fine, so don't worry about it. I recommend this class, because Professor Mukherjee is extremely nice and because even for someone who is not nearly a Physics \"master\" (and even though it is calc based)  I found it to be very doable, and well worth the work. \nWorkload:\nWeekly problem sets that are not too difficult because she solves some on the board in lecture and because she explains them to you at office hours if you need help. Mechanics: 3 quizzes but the lowest grade is dropped, two midterms and an insane final. E&M;: Four quizzes, one midterm, and an impossible final (but don't worry, as long as everyone else finds it difficult, you'll be fine).\n"
        }
    ]
}