{
    "prof_info": [
        {
            "prof_name": "Lien-Hang Nguyen",
            "prof_id": 13521,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "US-East Asia Relations",
            "review_date": "January 06, 2018",
            "review_content": "\nA great class. Definitely got me much more into the subject matter than I had expected. Professor Nguyen is a peppy and engaging lecturer, occasionally throwing in some jokes here and there – she definitely won't set you to sleep.\nThe reality is, though: if you're not interested in the subject matter, this could be very well a dry class. But if you're even partially interested in East Asian history or American FP, then highly recommend. The course material is not limited to China, Japan, and Vietnam as you would expect (though, of course, the course largely focuses on them) – we additionally covered Korea, Indonesia, Laos, and Cambodia throughout the semester, as well as briefly touching on Burmese, Malay, and Singaporean postwar movements. Professor Nguyen has built her (successful) career on researching the Vietnam War, so those lectures are especially interesting.\nIn terms of grading, three components. (1) Midterm and final are equally weighted, non-cumulative, but each contain a LOT of content. About 80 terms to know as well as six essay questions to prepare (the exams themselves were 4 terms and one essay, and all the possible terms/topics are distributed before the class). These take a lot of time to study for, in my opinion. (2) Three papers, the last of which was decided last-minute to be optional. All the papers are primary source analysis and connecting sources to broader themes. (3) Discussion section each week. There's a good amount of reading but certainly manageable and skimmable if you're pressed for time. (4) Ample extra credit opportunities, such as sitting in on Weatherhead Institute lectures or writing up brief reviews.\nFinally, I came into this class knowing very little and was worried that classmates, who may be EELAC majors or may have more knowledge in the area, would have a leg up. The TAs and Professor do a great job of tracking who knows what amount of history, and even penalize bringing in outside sources for exam essays. Other thing though – she doesn't post slides, which contain a very small amount of information anyway – so it's super important for you to show up to lecture.\nWorkload:\n2 equally weighed in-class exams, 3 papers (third optional), discussion section\n"
        }
    ]
}