{
    "prof_info": [
        {
            "prof_name": "Ashok Vora",
            "prof_id": 12517,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Corporate Finance",
            "review_date": "March 10, 2013",
            "review_content": "\nTook it Fall 2012. WORST PROFESSOR in Columbia history ever. Not only incompetent, but the most anal. Threatened to take off points if didn't put in thousand separator commas (i.e. 1,000,000) for the final. THAT anal. I actually filled out the University reviews, which I never do, just to let the administration know how much he sucked. If he hasn't been fired by now, avoid at all cost. Go take a real corporate finance class in the Econ department. \nWorkload:\n5 group projects\n1 midterm - easy but took off random points so your grade ends up being not that great\n1 final - open everything (open book, notes, computer, internet...printer even). asked us to do bunch of questions from projects and asked for backup data printed out...\n\n"
        },
        {
            "course_name": "Corporate Finance",
            "review_date": "December 08, 2012",
            "review_content": "\nThis was by far the WORST CLASS I ever took at Columbia. It also prompted me to write a review on culpa for the very first time in my four years of college.\nThis was a class for the SEAS students and MSORs, and the professor is new. Honestly, I learned nothing from this class. The entire lecture could be summed up to less than half a page for most days. \nExplanations about homework frequently too,k up half the class time. Instead of explaining something in detail in class, the professor just directed us to the chapter and page in the textbook, and posted some presentation slides from elsewhere for us to catch up on. Since he repeatedly told us how he thought our textbook is \"rubbish and not helpful,\" this wasn't very helpful in convincing me that I was learning something. The way he would just reference everything to the book without discussing it also made me doubt why we had class time at all in the first place.\nWe were repeatedly nagged upon, sometimes for minutes on end and abruptly in the middle of lectures, about cell phone use or other actions in class that he thought was \"disrespectful to yourself, me and all of your classmates,\" while the rest of the class was waiting to learn something. The professor was hard to reach as well, and even if we asked questions via email like he instructed, it took a while for him to get back to us. Considering that he doesn't have office hours or has the CA to cover his absence on campus, this was very inefficient. \nHe utterly failed to schedule the second midterm, and so it turned out to be on the last day of class.\nThe professor is especially not open to student opinions about the course, and sticks to his own decisions for regardless of the students. Very stubborn about his methods and grading, and students even had a lunch discussion with an IEOR advisor to complain. Compared to the other economics classes that I have taken, this course by far covered the least course material, especially in class. \nIn sum: If you want to learn something, don't take this professor. If you want to have a professor who is at least reasonable and knowledgable, don't take this professor.\nWorkload:\nFour team projects (should have been five), two midterms and one final. Both team projects and midterms are a waste of time if you took industrial econ or financial econ already. Grading is ridiculously harsh though, as most of the deductions come from \"wrong margins\" and \"no commas in the numbers.\" He unstaples everything, highlights your names in yellow and pink, restaples to give it back to you, a painstaking method that freaked me out. On the quality and content of your reports, though, he has virtually no comments. Final is going to be a business school type exam going over all of the team projects, with laptops. We get internet because he doesn't know how to turn off wifi for the classroom. Wants the whole class, which is about 40 people, to print out all supporting material for whatever we wrote on our blue book in 30 minutes on campus during the exam time. A disaster.\n"
        }
    ]
}