{
    "prof_info": [
        {
            "prof_name": "Rafael Yuste",
            "prof_id": 688,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Neurobiology II: Development & Systems ",
            "review_date": "July 02, 2007",
            "review_content": "\nIn case you're not entirely aware of the intellectual powerhouse that Columbia is, this is the class to take. Rafa's a wonderful, soft-spoken gentleman with an extensive knowledge of the subject. That said, I think he lectured about 3 times. The rest of the class was taught by professors of the likes of Kandel and Jessell, both authors of the class' text book, and the former a Nobel Laureate. \nSo, this class is a great opportunity to meet some very distinguished members of the Columbia faculty, but be warned: a number of them haven't taught for years (or so it seemed), so the lectures tended to border on the mediocre or too technical. But the lecture topics were really fascinating and contemporary, and there was always 15 minutes of Q&A; at the end.\nThe exams are really easy and straightforward--just take thorough notes in class and understand the weekly scientific papers. I did just that, and studied the night before the midterm and final and ended up with an A that I don't think I deserved because I did next to nothing for the class.\nOverall, I think this was a good class, and a breath of fresh air from the rigour of Mowshowitz's bio. It's a good choice for a bio elective.\nOh, one last thing: the TA's can suck. I didn't get much out of recitation, but there were a couple that I'm glad I attended. You're better off dissecting the papers with a friend. \nWorkload:\nWeekly scientific papers discussed at recitation. Midterm (50%) and non-cumulative final (50%). Both easy and only based on stuff done in class--so it's advisable to attend. \nHalf the final is based on the material after the midterm, and the other half on 6-7 papers. \n"
        },
        {
            "course_name": "Neurobiology II: Development & Systems ",
            "review_date": "May 01, 2007",
            "review_content": "\nProfessor Yuste does a good job teaching the course. His lectures were clear and easy to follow. However, he only lectured maybe three or four times throughout the entire semester, so perhaps he should be rated more on his administration than teaching. The rest of the lectures were taught by various faculty members of the Kavli Institute and the graduate neurobiology program, so, overall, there's a pretty wide spread of teaching quality in this class. \nThe administration of the class was a bit botched though. TA-run exam reviews didn't cover most of the material, and background reading was often posted after the corresponding lectures, which pretty much rendered such reading useless. Furthermore, this class covers a huge amount of information, yet provides no review sheet/practice final for the final exam. Grading is pretty lenient; with enough effort, it shouldn't be too hard to get an A (it's a lot easier than cellular neurobio). \nWorkload:\nWeekly mandatory recitations to discuss papers, a midterm and final. \n"
        },
        {
            "course_name": "Neurobiology II: Development & Systems ",
            "review_date": "May 11, 2006",
            "review_content": "\nOur year this class was different than usual-- we had guest lecturers maybe about 2/3 of the time.  Thus, the fact that that i LOVED the class, is not exactly attributable to Yuste.  When Yuste lectures about his own area (circuits), he's really into it and actually makes a pretty complex topic rather comprehensible.  \nIn general, he uses a lot of analogies.  And mispronounces words, but only enough so that it's funny, not confusing.\nThe class in general is so interesting, and not EASY, but definitely easier than the first semester of neuro.\nWorkload:\n3 midterms (not cumulative, drop 1), recitation papers, final on papers\n"
        },
        {
            "course_name": "Neurobiology II: Development & Systems ",
            "review_date": "November 09, 2005",
            "review_content": "\nWhile I'm not a Yuste fan, I think the last review was overly harsh.  His lectures are boring, very much because they are difficult to hear.  He is much too quiet when he speaks, so you'll have to get a close seat.  His lectures on vision are the best part of the course, and he does bring his own knowledge and excitement to these lectures.  It's just too bad he's so difficult to hear! I don't ascribe any active ill-will to Yuste, but it is true that asking for a re-grade is an unpleasant experience.   However, he curves the class around a B+, so the grading is not so bad.  If you have to take this class, it will be better if you read all the figures ahead of time, and try not to space out too much.  It's interesting information if you pay attention to it.\n\n"
        },
        {
            "course_name": "Neurobiology I: Cellular & Molecular",
            "review_date": "April 21, 2005",
            "review_content": "\nCompletely selfish, never helps his students and deliberately makes tests impossible.  For example, when you study vision, he would ask you :  What are the 7 properties of vision?  on the exam.  Always reads from slides, very boring.  If you have to take this class, take it with Darcy Kelley.  They always alternate from year to year.  Don't go to his office hours, he will not be able to help you out, only will give you a hostile look.  In the beginning of the semester there were more than 60 students in the class, by the end of the semester - only 20 attended the class.   \nWorkload:\n4 exams, final included. Can drop the lowest midterm.  By the way, if you were foolish to take this class you have to go to his lectures:  the exams are based on his lectures\n"
        }
    ]
}