{
    "prof_info": [
        {
            "prof_name": "Eugenia Lean",
            "prof_id": 1280,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "History of Modern China II",
            "review_date": "December 26, 2014",
            "review_content": "\nFantastic professor who bothered to learn everybody's name, which is rare in a lecture setting. Lectures were well organised and informative. \nThe first third of the class overlaps with History of Modern China I, but unlike the other class, there is greater focus on reading primary and secondary sources in translation. The required postings can be a bit of drag, but the readings are generally interesting. \nI felt I learnt a lot about Chinese history in this class, though it seems to cut off just as Deng Xiaoping takes power so there's not a lot on post-Cultural Revolution China. \nWould take her other classes in a heartbeat. \nWorkload:\nFair. An essay and regular postings on readings, some of which you could skip. \n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "December 09, 2008",
            "review_content": "\nGreat lecturer. Her lectures are very well-organized, and she tries very hard to get students involved (although few spoke up in my class). Always available to students, very friendly. Made sure to know everyone's name. The subject is also incredibly interesting, and the readings were few and great. It is true that she takes much (most) of her lecture from Spence's book... but she certainly makes it interesting! I would definitely take this class.\nWorkload:\nDiscussion postings; midterm- graded very easily; 10 page paper, also graded easily; final. No discussion section. Totally doable amount of reading.\n\n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "April 19, 2006",
            "review_content": "\nFirst, the good side. The choice of readings is excellent and Prof. Lean has also compiled (for student purchase)a series of articles relevant to the course.\nNow, the bad side. What Prof. Lean calls \"lectures\" are actually 70-minute regurgitations of chapters from Jonathan Spence's THE SEARCH FOR MODERN CHINA (as others have noted). Her recitation of this material without giving Spence credit or even mentioning his name is an academically questionable practice. \nThe \"discussions\" of the three or four required books is cursory, perhaps 20 minutes on a three or four-hundred page book. The result is extremely superficial.\nMore serious is her excessive absences, announced in advance but never justified (except for two weeks of jury duty at the very end of the semester which could have easily been postponed). The net result here is she did not get to the end of the course because she was away 25% of the time.\nI could go on, but I hope that this kind of \"teaching\" is not condoned at Columbia\nWorkload:\nThe workload was heavy but would have been justifiable had she attended assigned classes and engaged the class in meaningful discussion instead of \"lecturing\" at it.\n"
        },
        {
            "course_name": "History of Modern China II",
            "review_date": "August 29, 2004",
            "review_content": "\nDo not take this class with her!\nDo yourself a favor.  You'll cry and seriously consider inflicting harm on yourself.\nWorkload:\nAsk her at your own risk.  Learn to write like her or what she wants to see or fail.\n"
        },
        {
            "course_name": "History of Modern China II",
            "review_date": "May 20, 2004",
            "review_content": "\nLean is not one of the best history professors I've had at Columbia, but she's certainly not the worst.  I took this class because I wanted to learn modern Chinese history and at the end, I did, but probably not to the extent I wanted to learn it.  I agree with one of the reviewers in that Lean does lecture verbatim off Spence's \"Search for Modern China\" textbook.  That's not to say she doesn't know her material, because believe me, she does.  The way she lectures is a bit frustrating; when not talking about gender (her specialization) she sort of fumbles and is repetitive.   This is probably due to the fact that she's a fairly new lecturer; she'll get better with time.  You're almost better off reading that text.  The readings are selective and very well chosen.  There is a lot of it, although you don't HAVE to read it as her exams are lecture-based.  TAs do the grading, but grading is on the rough side.  The exam questions are difficult and abstract and require to really think and form a convincing answer.   Overall, Lean is intelligent, extremely well-read  (not just in Chinese history) and responsive to questions in class.  And even though she doesn't convey that she expects a LOT out of you, she does, as evidenced by her harsh grading standards.\nWorkload:\n8 postings on weekly readings (which is annoying, but forces you to read), mandatory section,  midtern, 8-10 pg paper and final. \n"
        },
        {
            "course_name": "History of Modern China II",
            "review_date": "May 11, 2004",
            "review_content": "\nShe sucks and this is how: she's very smart, she tries to make her lecutre intelligible, her method of teaching is very understandable, reasonable and relatively organized....in other words, she teaches as if the class is a bunch of high school students.  with that said, her exams---OMG WTF!!!!\nher demands are unreasonable.  if you know how to BS and come up with some crap that sounds like you have a pHD, or if you're lucky and you happen to say something she (or the TA) likes, then maybe this class isn't so bad.  otherwise....\nAs for the content of the lecture - 1911-1949 - she regurgitates everything verbatim off jonathan spence's \"search for modern china.\"\nWorkload:\nmidterm, essay, final all graded very precariously \n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "April 18, 2004",
            "review_content": "\n   Prof Lean is usually well-organized: she posts her lecture outline online before each class, and displays it on the projector as well. Her lectures usually reflect the ideas of the main textbook reading, a little of the supplemental texts, and occasional outside sources, with special emphasis on themes she will probably ask about on the midterm and final, and occasional outside material. While not especially unique in her views, she does a good job in conveying the information.\n   What makes the course truly worth taking, however, are the required readings. Lean chooses the course's texts with an intelligent and discriminating eye: the readings are always enlightening, varied, and interesting. The load is heavy, but worth the time. I can say with all honesty that I feel I have a good understanding of Chinese culture because of it.\n   In terrms of the workload... Each of the two papers has questions similar to those posed for discussion sections. Since the prof limits your sources to the required (and discussed, sometimes even during lecture) readings, it is not too difficult. The midterm and finals covered the 'big' themes covered in class, which Lean herself warns, so it's relatively easy to predict what will be asked.\n   I would definitely recommend this class.\nWorkload:\nTwo five-page papers, a midterm and final. Discussion section required.\n"
        },
        {
            "course_name": "Chinese Civ",
            "review_date": "January 28, 2004",
            "review_content": "\nWow, I honestly have no idea what the previous reviewer was talking about.  First of all, she definitely not does have even a shred of an accent.  In fact, I would not be surprised if her first language was English.  It's true that the class is not the most fascinating at Columbia, but I think Lean provides a pretty comprehensive review of a massive amount of history.  She usually mentions most of the supplementary material in class and the text book is simply used to fill in the gaps left by lecture.  This class will not be a huge thrill, but Lean attempts to add some humor into Chinese history.\nWorkload:\nTwo papers, midterm and final.  All are graded relatively on the difficult side compared to other classes.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "January 25, 2004",
            "review_content": "\nTrust me, this class is a joke. The lectures are very unorganized and boring. You will feel like you are in your HS history class so literally you get bored all the time. It is just a waste of time. The reading assignment, honestly, is way too much for an Intro class. (Plus, it never reflects the lectures.) Also you will have trouble understanding her English since her accent is pretty damn heavy.\nWorkload:\nTwo papers, midterm and final. The papers are graded very harshly. The topics are vague. You never know why you get a good/bad grade because either the lecturer or the TA is unable to explain anything. Midterm and final are jokes, which dont test your understanding at all. But oh well, it is such a BS class.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "December 15, 2003",
            "review_content": "\nThis class just isn't great. While it's admittedly difficult to cram 500 years of Chinese history into one semester, the class should have run more smoothly than it did. Her lecturing style (even her pronounciation) was condescending, even for a columbia prof. The paper assignments, midterms and finals were confusingly vague, yet still graded rather harshly. I am an ealac major, and this class frustrated and bored me more than any other. To be fair, it got better as the term went along. \nHowever, its just not worth it. There's a lot more out there, don't waste your time.\nWorkload:\n2 5-pagers (inconsistent grading, unclear requirements), midterm, final. Reading wasn't bad.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "December 11, 2003",
            "review_content": "\nThe reviewers who claimed that Prof. Lean's course is a waste of time are pretentious.  The class provides a clear and organized overview of  Chinese History, and the 5-10 min review she does in the beginning of each class makes the material very understandable and makes studying much easier.  In a class of 100, when she would ask admittedly basic questions merely to make sure that the material from the day before was clear, students would roll their eyes and mutter that the review was unecessary, yet, by not answering her questions they were merely prolonging the wait for new material! Prof. Lean is nice, approachable, funny, and very knowledgable about Chinese History.  The TA discussions were a total waste of time, but I liked the textbook and the lectures.  A teacher should not be condemned because she makes the material easy to grasp; she should be praised.\nWorkload:\nTwo essays that seem easy but are graded relatively hard, a midterm that was entirely fair, and a final.\n"
        },
        {
            "course_name": "Chinese Civ",
            "review_date": "December 04, 2003",
            "review_content": "\nAHH, dont take this class! you will regret it! the grading is totally arbitrary and the subject matter is ridiculous.  you study chinese history from prehistory to modern day in one semester.  so essentialy you learn nothing.  the class is taught like a high school history class but grades like its an upper level ealac class.  Horrible idea for an easy major cultures, horrible idea in general.  stay away!\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "November 20, 2003",
            "review_content": "\nProf. Lean is certainly very knowledgeable about the subject matter of the class and expects a lot from her students. If you are looking for an easy major cultures class that you can breeze through, this isn't it. Weekly discussion sections necessitates that you do at least some of the reading, and papers and exams though not very difficult, are also not easy. \nWorkload:\nlots of reading, some of which is important to do. \nMidterm was fair. Essays are harder than your average major cultures class. \n"
        },
        {
            "course_name": "Gender, Passions, and Social Order in China since the 1500's",
            "review_date": "April 22, 2003",
            "review_content": "\nDespite her young age, Prof. Lean is an incredibly knowledgeable and intelligent professor. She is a very critical thinker and encourages the class to question the texts they read. She is always happy to answer questions about the course material in class and is very accessible in general.  At times her reading assignments may be a little bit excessive, but usually we don't get to all the readings on the assigned dates, meaning you have a bit of extra time to complete the readings. She is a tough professor though, and she expects class participation. \nWorkload:\nModerate. Three papers.\n"
        },
        {
            "course_name": "Passions, Gender and Social Order in post-1500s China",
            "review_date": "January 21, 2003",
            "review_content": "\nprofessor lean is a really good lecturer. though she is at times a little scatter-brained, she is very knowledgable about chinese history and the texts that you will read in the class. the discussions are often good, she insists on a lot of class participation. the time flies in her class and you will learn a lot.\nWorkload:\ntwo 5-page papers, one 10 pager, lots of reading\n"
        },
        {
            "course_name": "Gender, Passions, and Social Order in China since the 1500's",
            "review_date": "December 03, 2002",
            "review_content": "\nThough I'm not as enthusiastic as the previous reviewer, I would have to say that Lean is a pretty good professor. She definitely knows her stuff for this particular class (being that it was her dissertation). She's young and energetic and is definitely willing to help clarify anything you don't understand. However, she tends to unnecessarily use SAT vocabulary in her speech and lectures.\nWorkload:\nThere's TONS of reading, but since everyone does a presentation on each of the analytical pieces, sometimes its ok to get by without reading some of the articles. She's a pretty tough grader on papers and expects good writing. Two papers, one presentation, one final research paper.\n"
        },
        {
            "course_name": "Gender, Passions, and Social Order in China since the 1500's",
            "review_date": "November 19, 2002",
            "review_content": "\nA truly inspiring professor. She knows how to seamlessly intertwine lecture with class discussion. Her lectures are interesting, with a useful outline provided, but she'd definitely not reading out of her notes; she really knows her stuff. All of the students in the class were trying to figure out how to take another class from her. Really - don't graduate unless you have.\nWorkload:\nPretty heavy reading load, though manageable. Two 5-page papers, one presentation, a 10-page paper.\n"
        }
    ]
}