{
    "prof_info": [
        {
            "prof_name": "Yasmine Ramadan",
            "prof_id": 3248,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 25, 2012",
            "review_content": "\nI had Yasmine for the 2010-2011 academic year, and we were the first class to have her. I can honestly say that Yasmine is a double edge-sword, and that is is possible to do well in her class, but it is also possible to do badly.\nFirst off, Yasmine was really sweet. She is a really nice person that does a hard job at trying to cover the material albeit she does not know the texts in a super in-depht way and does not have much experience with western literature. She gave cookies to us, and also held class dinners where she was really nice! However, some people with bigshot LitHum professors with PhDs and the works who were extolled for being amazing professors in fact did poorly on the midterm and final because their professors really try to make the class to focus on random and narrow topics that are rather silly and too much like a debate class in my opinion, and I do believe the broad and comprehensive review of all of the material in Yasmine's class was beneficial for preparing for the final and midterm. I did pretty well on both exams. So, she was an \"average\" professor as the first LitHum reviewer said (rather arrogantly and condescendingly), if by \"average\" you mean covers as much as she can to try to prepare us for the exams and cover as much important and pertinent information as she can. I find this good and preferable to arrogant experienced professors that don't focus on the bigger picture..\nThat being said, Yasmine is a ruthless, biased and cruel paper grader. She would spew out Bs on my papers incessantly, despite all of my efforts on trying to improve my papers from the previous bad grade. However, students around me, who got As on their first papers, continued getting As, despite (as they said) making no effort to improve or having rushed on the papers and completing them last minute. Thus, in my opinion, Yasmine was a biased grader and didn't really grade on improvement, but rather just how you did on your first paper. Compared to some other nicer LitHum professors, who gave As on papers and graded based on actually seeing improvement, Yasmine riddles your essays with unnecessary comments, and gives rather stupid justifications for your poor grade. Obviously, she is suffering from \"grad student power syndrome.\" The papers, unfortunately, account for a large chunk of your grade, more so than the midterm and final. Thus, based on whether she likes you or not, and your first paper, your grade can be an A or a B. A lot of kids, including myself, were upset that we ended up with a B. \nThe papers make up about 60%, the midterm and final 30%, and there is a short presentation on one of the readings every student has to do (5-10 minutes). She never gave us the grades, but I assume she probably she probably gave a ruthless grade on these as well -_-. Participation also counts, and all these percentage values are approximate.\nWorkload:\nLots of reading, sometimes unmanageable, and Yasmine does not try hard enough to condense the readings (she told us to read Don Quixote and Crime and Punishment for spring break, I preferred getting hammered), three papers worth 10-25% of your grade each, a class presentation worth like 5-10%. Midterm and Final, and participation.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 27, 2011",
            "review_content": "\nA very awkward class where the discussion can veer off topic and ends up being one two or three people talking to each other. She starts to call on the quiet people when she asks a question and no one raises their hand because they do  not understand the question. \nThree essays that are graded quite harshly and the essays are really vague in that  the topic is formulate your own question and answer it. \nFor the midterm and final, she prepares you pretty well as she devotes a class to review. However, since her discussion lags in class, the passage analysis and essays are hard to do.\nSeems like she does not curve the class at all so she does a straight calculation on your essays and midterm and final and participation.\nShe has pop quizzes in the beginning that are moderately hard.\nWorkload:\nStandard lit hum class. I definitely chose to switch out after a semester and so did the other classmates i talked to. Class is just to awkward and she does not grade as easily as other lit hum teachers i know to stay in her class. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 13, 2011",
            "review_content": "\nWhat the other person said is completely true. A very average class in terms of analysis of text with a very nice and sweet professor. Yasmine is not extremely familiar with the texts in question, so it is completely possible to come in to class and BS your way through, especially as she doesn't call out people who don't raise their hands to speak. To be completely honest, I sparknoted everything the entire first semester and made an A. The only time I read the books was the week before the midterm and final to get ready for the quote ID sections. Still, a very decent class if you want a good grade with some general, broad discussion of the LitHum texts. Also, she does a phenomenal job preparing everyone for the final - the midterm is awesome and she had an entire class beforehand devoted to review. \nWorkload:\nPretty typical. Reading every night, although skimming/sparknoting works fine, a ten minute free-write at the beginning of every class, three/four essays a semester that are graded fairly. Plus- final and midterm. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 12, 2011",
            "review_content": "\nYasmine's class was average, nothing more, and sometimes a lot less. I switched out after a semester. She picks up on the standard themes in the texts, but doesn't really go any further. She'll accept students who make big claims about themes in the text without really requiring them to back up their claims with solid, textual evidence. In essence, if you talk a lot and spout off bs, you can actually do fairly well in the class. Yasmine doesn't really call out people that don't participate, which resulted (in my case) in a class where the same three or four people talked every class. After a while, it gets pretty repetitive, and (if you're one of the few people talking) pretty exhausting. Also, because she wasn't as familiar with the texts as some professors, students could do fairly average work on papers and receive very good grades for putting in mediocre effort. One of my classmates, for example, copied and pasted quote analysis from Wikipedia for his last paper, and he received the best grade he'd gotten on a paper that semester. If that's the kind of class you're looking for, then Yasmine works just fine.\nTo be fair, she's really nice. She cares about the class (and brings in cookies for students' brithdays!) and is pretty lenient with attendance. She also prepared us very well for the final: the midterm was essentially the final in miniature, so it was a good litmus test for how people would do.\nWorkload:\nStandard. Reading, daily 10-minute writing responses to the reading, and a short presentation on the major themes in a text of your choice.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 11, 2007",
            "review_content": "\nHer discussion section often lags, and I would consider her one of the harder TA graders. She doesn't push students to join in on discussion, and isn't really much of a help to the class. Since Saliba doesn't grade any work, expect to impress her.\nWorkload:\nWeekly readings, short essays midterm, 10-page paper final.\n"
        }
    ]
}