{
    "prof_info": [
        {
            "prof_name": "Madeleine Zelin",
            "prof_id": 59,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "History of Modern China I",
            "review_date": "December 24, 2009",
            "review_content": "\nTook this class as an undergraduate. Classes are straight-up lectures with no questions or comments from students. Zelin speaks quite fast and her Powerpoint slides are of minimal use/relevance. She often spells out Chinese names on the board only to say that we don't need to study/remember them, after we're done furiously scribbling them down. It's hard to tell sometimes what parts of her lecture are important to study or not important, because there is so much info being thrown at you. You are also expected to have a basic understanding of China and the dynastic system before entering the class so if you know nothing about China, you had better brush up before taking this. Unfortunately, the lectures are just not as interesting or dynamic as they could be. \n\nWorkload:\nThe readings can be immensely long, but honestly you don't really need to read them to do well in the class. The hardest part of the class is the research paper. Students are given a choice of what to research, without too much guidance. Once a topic is chosen, you have to make a study guide on wikispaces (a new thing for this year which took the place of the midterm, I believe) which basically consists of an annotated bibliography (expect to read 10-20 long articles or books) and study questions that you have to create. After that, you have to write a 10-15 page paer on your topic, based on the info you learned through making your study guide. The final exam is actually pretty easy, all you have to do to study for it is read Spence's book all the way through and jot down some major events/names.\n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "December 29, 2006",
            "review_content": "\nThis class is intended as a junior/graduate level from the people I saw in class. I took this class as a freshmen and got a good grade so I think I can provide an objective review on the difficulty and accessibility. This was my first history class in college and I am thankful that I didn't chicken out and leave. I learned a lot about the Qing and even about the Ming. When she lectures, she often mentions about each events' influence and their appearance in the PRC. Those comments truly made this class history of \"modern china\" not the Qing. She traced themes and their effects in the 20th century. Although it is quite true that she digresses a bit and focuses on economics a lot, I never felt that she neglected the other aspects of the Qing. The readings were interesting but I had some trouble finishing up all the readings. Some of the journals assigned are like 60 pages each. For discussion sections, there are like three to read so that's like 180 pages. The reading is pretty daunting and so I had to spend time during the weekened catching up on the reading. But the readings provided more insight on things that we couldn't discuss in detail during class. It helped me view the problems of China in terms of themes instead of chronology. The TA led discussion sections were quite weak. The class was pretty quiet during the discussion sections so it kind of forces the professor to lecture a bit.\nNow the paper. As a freshmen, I was pretty daunted by the 15 page paper. In high school, the longest paper I wrote was the 11 page paper on the Virginia governor election and that was an easy paper. The 15 page paper was a real history paper. It required the reading of at least two history books, sourcing, and detailed analysis. The weekend I wrote my paper, I literally didn't move from my room. But the paper itself wasn't impossible. With time and effort I was able to write a good paper and turn it in. \nThe exams are pretty straightforward. Just as any history class, there are IDs and short answers. That is pretty much the midterm and the exam is pretty much off of the lecture notes. The final was IDs and short answers as well. The exams were pretty easy and they were easy to prepare for if you went to class and took your notes effectively. \nAll in all, I thought professor Zelin was a great professor who was knowledgable in her area and was able to connect themes together to provide a picture of China. Her selection of readings was interesting and helpful. I definitely recommend her class. Oh yeh if you are a freshmen, don't be intimidated to take higher level courses. The higher numbers are just numbers. That's all that they are.\nWorkload:\n60-80 pages of reading per class (sometimes 120-150), 2 midterms (ID+short answer), one final exam-wise pretty light, reading-wise pretty heavy\n"
        },
        {
            "course_name": "Economic History of Modern China",
            "review_date": "March 19, 2006",
            "review_content": "\nDonÂ’t be put off by the title: this course does NOT require extensive knowledge of econ.  Its focus is on major issues facing historians of China Â– many of whom are definitely not even economists themselves Â– who are looking for the historical roots of contemporary economic phenomena: issues such as why China didnÂ’t industrialize on its own and what role Â“Asian valuesÂ” play in recent Chinese economic success.\nAdmittedly a fair number of people in the class are econ majors or MBA students, but their background doesnÂ’t give them any unfair advantage, and their perspectives can add a lot to class discussions.  No one should be put off by (completely inaccurate) previous reviews of the professor, either Â– she has an amazingly extensive and in-depth knowledge not only of Chinese history, but of how the issues discussed in class relate to other parts of the world.  She also includes a wide range of articles in the readings, including some whose perspective she doesnÂ’t agree with (though she never makes her own point of view clear until AFTER the class discussion is over).  Even if youÂ’re not familiar with the basic econ terminology when it comes up, donÂ’t be afraid to ask Â– Professor Zelin is perfectly understanding and willing to explain.  And not only is she approachable, despite what other reviewers think, her lecturing style is anything but Â“pompousÂ” Â– on the contrary, her enthusiasm for her subject shines through.  Why anyone would call her arrogant just for sharing her expertise is beyond me.\nWorkload:\nHeavy weekly reading load, two in-class presentations per semester (including Courseworks postings), midterm paper (10-15 pages), final paper (15-20 pages).\n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "December 28, 2004",
            "review_content": "\nProfessor Zelin has a true passion for the subject, is extremely knowledgeable and her exposition is clear and well organized therefore you will not just love the subject because of the way she teaches it but also will not need to do as much reading as requested because the notes taken in class will guide you to understand what is absolutely necessary to be known. She is willing to accept and discuss opinions different from hers and suggest her point of view with the utmost tolerance and kindness. Overall you will love the subject and find yourself eager to take other classes with her\nWorkload:\nReasonable workload of readings, not all of them are necessary to get a good grade but most of them are very interesting and useful for the discussion sessions, 1 midterm take home, one paper, 1 in class final exam\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "April 21, 2004",
            "review_content": "\nI tend to agree with most of the other reviewers. Zelin is pompous, arrogant, and quite self-important. I have no doubt that she would assign exclusively class readings that she had authored if it werenÂ’t so out of line; still, exhausted references to her The MagestrateÂ’s Tael can be expected. Her dry lecturing style can be come a little irksome as well, although it would be hard to say that her discussion sections didnÂ’t sometimes develop into quite disciplined and interesting reflections on Qing history. ItÂ’s funny because I get a sort of misguided maternal vibe from her, as if sheÂ’s trying to care about her students (but they keep making it so DAMN hard). All and all, I would recommend taking another class. I canÂ’t imagine that her Â“SproutsÂ” (her word, not mine) of Chinese Capitalism could be anything but extremely painful. \n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "January 19, 2004",
            "review_content": "\nThis class was really enjoyable.  She may be a bit arrogant, but there is something cool about her confidence, too.  There is a heavy focus on economics, but at least the class has a focus, rather than being a random mix of culture, politics, etc.   I don't know what people are talking about saying this is work overload.  You barely have to do the readings, there is one paper, and one test the whole semester.  \n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "January 15, 2004",
            "review_content": "\nWarning: This class is taught from an economic historian's perspective.  So much time was spent examining tax policies, new fiscal measures for each emperor's reign, beginnings of capitalism etc.  Because of the emphasis on economics, I felt that Prof Zelin ignored the cultural and social aspect important to a course meant to be an overview of China from the fall of the Ming to the 1911 Revolution.  The format of the class was lectures (often dry) interspersed with in class discussions that were basically more lecture from Prof. Zelin.  I also agree with some of the other comments about her standoffishness and her arrogance.  \nWorkload:\nTough.  This was orginally a graduate level course.  Impossible to do all the reading.  Attendance and participation counts.  Big paragraphs on the readings for each discussion.  1 large paper comparing 2 books on the same topic.  Tough final exam consisting of IDs, short Qs, and essays.  Undergrads: the TA grades your final papers.\n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "December 24, 2003",
            "review_content": "\ni hate her. she's unapproachable, digresses a lot, and very boring.  this class should also be renamed as \"ECONOMY of Qing China\".  going into the semester, i really looked forward to this class as one that would be a favorite, but ended up dreading it and really hating the lectures.\nWorkload:\none 15-20 page essay (40%) based on two books of external readings, 6 postings (12%), final (48%).  basically it's do or die.\n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "October 29, 2003",
            "review_content": "\nWORK OVERLOAD.\nRambles on and on and on and then tells you how smart she is and lets you know how stupid you are.  This is less of a history class and more of a economic/history class.  Smiles, but is still unapproachable.\n\nWorkload:\n15-20page paper based on two books, final, 7 mandatory web postings.\n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "January 04, 2003",
            "review_content": "\nWow, she is a power in her field.  Knowledge and well spoken, her lectures are great and the book she uses is also very engaging.  This class, although, listed as an undergraduate is inundated with grad students (3/4's are grad students) so it is intimating at first, but I think she gives the undergrads a break.  If you are really interested in Chinese history (late Ming and Qing dynasty) you should take this course, she is great and will help you in any direction for she seems to know an awful lot.  This is a very engaging class and truly stimulates the mind.  \nWorkload:\n2 papers, 7-10 web postings, 1 final\n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "December 31, 1999",
            "review_content": "\nProf Zelin knows the material and then enjoys reminding the class how much she knows. Perfect for those who love esoteric Sichuan tax policy. Prof Zelin is clearly an old school Chinese prof - she lectures, everyone listens, no questions at threat of irritation.\nWorkload:\n1 paper and final.\n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "December 31, 1999",
            "review_content": "\nFor the most part, I enjoyed this class. The first semester covers essentially the Qing dynasty of China while the second half goes all the way up to the Communist Revolution of 1949. There's a lot of information involved, so you'll definitely have one really overdeveloped hand after all the note-taking in each class. This is a class you should take if you're interested in Chinese history.\n"
        }
    ]
}