{
    "prof_info": [
        {
            "prof_name": "Michael Mauel",
            "prof_id": 44,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Computational Math and Physics",
            "review_date": "May 06, 2011",
            "review_content": "\nThe previous reviews pretty much sum up this class. Though it is probably one of the hardest preprofessional courses, Professor Mauel makes this class awesome! He is one of the most enthusiastic professors I have had and his enthusiasm made this a 9 am class that I didn't miss once (as well as my favorite class so far at Columbia).\nI took this class my spring semester after taking W1004 with Cannon. With this as my only prior programming experience, I found I was more than prepared for adapting to the new language (Mathematica) for this class. If you have no programming experience at all, this might make the beginning somewhat frustrating, as he does move rather quickly through the basics of the language.\nI loved this class; it made my semester. I would definitely recommend it to anyone who has any experience with programing and is interested in physics, comp sci, or math, or to someone without programming experience prepared to learn quickly and put in time on your own (preferably before class starts) learning.\nWorkload:\nAssignments every week or two that are \"recommended\" - take about 30 min to 1.5 hrs\n4 Graded Projects: he lays out pretty clearly an example of what you should do which is pretty easy to just follow. If you are interested, he encourages you to do some investigation of the topics on your own instead. - projects take 4 hrs ++ depending on how much you do / if you get stuck with debugging your code forever\n"
        },
        {
            "course_name": "Physics of Fluids",
            "review_date": "January 02, 2011",
            "review_content": "\nOne of the worst classes I have taken here that could have easily one of the best. I registered for this course with very high expectations. I was planning on studying oceanography and/or atmospheric science for grad school, so I thought the 'Physics of Fluids' would have been the ideal preparation. Moreover, Mauel is renowned to be one of the most enthusiastic lecturers on campus (he really is) so I figured this class has to be a hit. Boy, was I ever wrong. \nMy biggest gripe with this class is that Mauel almost never uses the chalkboard and teaches solely from his scanned notes. He compiles his poorly written notes into a powerpoint and lectures with the aid of a smartboard. Each slide is packed with a ton of information, mostly equations with very little comments, and he crams about 45 of them into a single lecture. For an 1hr 15min lecture this works out to be a minute and a half per slide. Unless you have had a lot of exposure to the subject and/or have an IQ of 250 you will have a difficult time learning at the pace at which this man teaches. As a SEAS student, I have grown accustomed to drinking from the so called fire hydrant. The usual remedy is to simply read ahead of each class but that brings me to my second biggest gripe: the text book.\nMauel uses a textbook by Kundu and Cohen, which is quite frankly the worst textbook I have ever used. It claims to be an introductory text but assumes that you know all the jargons of the subject. The book is as readable as a phonebook and not nearly as organized. Mauel follows the book for the most part but the chapters usually go beyond the scope of what's covered in the lectures. Needless to say, learning from this book is very difficult. The book does cover 'everything', so by the end of the course you'll find that it serves as a decent reference. For learning purposes, I had to borrow a few books from the library which turned out to be a life saver. \nMy final gripe is with Mike Mauel himself. I really like this guy. He is as brilliant, enthusiastic and entertaining as people say he is and he really knows how to spark the class's interest. However, he doesn't seem to put much effort into his lectures anymore. He essentially recycles the same set of lectures every year. Even the stuff on courseworks had dates that were 2 years old. There were many instances were he forgot what a slide was about, fudges the explanation and fingerjabs the smartboard to go the next slide. He also doesn't give out past exam questions to prepare for his exams. He claims it's too much work to come up with new questions. He didn't even go over the midterm with the class.\nIn summary, if you have a good amount of exposure to fluids, a solid physics background and solid math background up to partial differential equations then this class can be manageable. If you are like many people and are without said exposure and background, your learning curve will be very steep and you will have to put in a lot of work to keep up with the class.\nWorkload:\nHe assigns a problem set every two weeks. Questions are usually easy and from the textbook. He occasionally throws in a monster problem that requires hours to get through.\n1 midterm and 1 final. Class average was about 60 for the midterm. The final felt a lot harder. \nHe has two grading schemes: \nPS: 25% M: 25% F: 50%\nPS: 1% M:33% F: 66%\nwhich ever gives you a higher grade\n"
        },
        {
            "course_name": "Introduction to Computational Math and Physics",
            "review_date": "May 19, 2010",
            "review_content": "\nYou should not take this course unless you are REALLY into physics or math. The topics we covered this semester were Kepler's Laws of Motion, Randomness, Data Compression via Fourier Transforms, and Quantum Mechanics. If none of this sounds remotely interesting to you, this course is not for you and will be a 3-hour weekly waste of your time. You also should not take this course if you have had no programming experience. Mauel hardly goes over the basics of Mathematica, and introduces new constructs and functions with only a passing statement. If you really want to know what your code is saying or want to create really cool/intricate projects, you will have to spend some time learning Mathematica code by yourself, which will be a bigger challenge if you haven't taken AP Comp Sci or COMS 1007.\nHaving said that, if you are interested in these topics and understand (fairly) simple programming concepts such as loops, arrays, and modules, this course will be worthwhile. Mauel is a fantastic and very enthusiastic professor. I don't think I've ever had a teacher as enthusiastic about his/her subject as Mauel is. It's also stunning just how knowledgeable he is in such a wide range of topics. He is also incredibly helpful on a one-on-one level, so do yourself a favor and take advantage of this: talk to him after class, email him, and schedule office hour visits. \nHowever, he does tend to move quickly at times, and if you are lost at the beginning of a topic.. you'll be hopelessly lost until the end. And this brings up a major problem of the course: it doesn't really have a purpose. It doesn't go nearly in-depth enough into the topics to give you a full understanding of them, there really isn't any programming he's teaching, and you don't really learn Mathematica. By the end, it's just one large copy+paste festival to get a project complete on time. \nStill, if this course sounds interesting to you, take it for a week or two, see what you think. If you don't like it after three weeks or so, drop it. It won't be worth your time and effort. \nWorkload:\nFairly light. Optional homeworks. The only grades come from the projects that are due once ever 3-4 weeks. \n"
        },
        {
            "course_name": "Introduction to Computational Math and Physics",
            "review_date": "August 28, 2006",
            "review_content": "\nThis class became my favorite of the semester in no small part due to Prof. Mauel. He is an excellent teacher. I had not seen that level of enthusiasm in a teacher before. Sometimes he'll even exclame: \"Isn't that cool?!\" I sincerely hope that I can take another course of his before I graduate.\nI had no real programming experience before this class. I had worked a little with computer algebra systems before, but not extensively. This course gives a broad introduction to the world of computational science. It makes use of Mathematica, which is installed in all the computer labs. The topics vary from year to year, but expect to see some of the following:\n* Orbital dynamics\n* Chaos theory\n* Fractals\n* Digital signal processing, e.g. image/audio compression, filtering\n* Protein folding\n* Quantum mechanics\nEvery week, Mauel gives an assignment that incorporates much of what was discussed in the last class. All the files are available for reference and often all that is necessary to complete the assignment is to copy and paste the code from the class notebook into the homework notebook and modify the code a little. You don't need to be a programmer: just pay attention in class and don't be afraid to ask Mauel for help. He is extremely helpful and understanding. Mathematica has detailed help built-in for every function. Information can be looked up very quickly.\nIn addition to homework assignments, the class has 4 projects to be completed through the term. There is no final exam. The projects are like harder homework assignments. If you satisfy all the basics, he'll give you an A. If you really put in the effort and do something original, he's happy to give you extra credit.\nOf all the pre-professional courses, this one may be the trickiest, but you'll learn a lot of really cool stuff and Prof. Mauel is a fantastic teacher.\nWorkload:\nModerate: 1-3 hours for a homework assignment\nWorkload can increase substantially if you complete original projects.\n"
        },
        {
            "course_name": "Introduction to Computational Math and Physics",
            "review_date": "November 07, 2005",
            "review_content": "\nMauel is amazing.  I took the class having no experience in Mathematica (which is the only program he uses) and was really very afraid after the first couple of classes.  A lot of people drop out, but if you do the work (and Mauel is kind enough to read through all of your code for errors if you're stuggling) you will soon get over the computational barrier and learn a lot about the concepts.  It seems to definitely be one of the harder pre-professional classes but I thoroughly enjoyed it.  Mauel is so energetic in class that it's obvious he really likes this stuff, and he's so willing to help you out.  The TA was also extremely helpful.  Although you do sometimes get caught up on trying to figure out syntax, it really it not difficult programming in the sense that you have all the code from lecture, so it's mostly copy and paste.  Take this class and you will begin to love Mauel and the subject.\nWorkload:\nWeekly assignments in between four projects.  Everything is done outside of class, but Mauel generally goes over the basic concepts that you need just before assigning them.  With any of the work (including the final), either Mauel or the TA would help you out if you only email your program to them.  The projects each involve a topic but you can go anywhere you want with them.\n"
        },
        {
            "course_name": "Introduction to Computational Math and Physics",
            "review_date": "April 28, 2004",
            "review_content": "\nThis course serves its purpose as a pre-professional course: it tells you the truth that Coumbia's applied math curriculum is all about physics. The course covers 4 physics topics: astrophysics, statistical physics, Fourier transformation applied on physics problems and quantum mechanics. If you're a physics guru, this class is certainly for you. Otherwise, you should really consider taking another pre-professional course.\nAnyway, Professor Mauel is the most enthusiastic and friendly teacher I've seen in Columbia. One can easily tell that he's genuinely interested in what he's lecturing: will you jump and exclaim in delight when you talk about Kepler's laws? I won't, you probably will not, but Professor Mauel will.  He's also friendly and he doesn't mind giving you personal, step by step tutorials on how to complete your assignments. You can e-mail him your mathematica programming codes, (Oh, this class is all about mathematica and programming, if you don't know C++/ Java, you'll be in a great disadvantage)  tell him your problem, and he'll tell you his suggested programming codes usually within 24 hours. Also,  he's willing to sit next to you in front of the computer, teaching you how to  solve the problems.  What else can you ask from a professor?\nWorkload:\nWeekly exercise that takes you at most 2 hours a week, and 4 projects. Depending on how devoted you're into the course materials, and also your programming skills, each project can take you 2- 10 hours.\n"
        },
        {
            "course_name": "Introduction to Computational Math and Physics",
            "review_date": "April 26, 2004",
            "review_content": "\nI think this is one of the better (maybe best) pre-professional courses, but it might be slightly more work than others. Professor Mauel is super-enthusiastic about everything which helps in a what could be a painful experience. The course is devoted to doing physics with Mathematica, which enables you to solve problems with difficult math without knowing it. But you have to use a computer...which introduces its own problems. However, whenever you are having trouble, you can e-mail the professor and he will help you. The class was a pretty rewarding experience for me, but I can see how it might frustrate others. The strength of the course is that Professor Mauel encourages students to do their own \"research\" projects, but provides all of the tools necessary so that you can do something unique on your own without being too hard or time consuming.\nWorkload:\nWeekly assignments, which shouldn't take more than an hour or two at the most (if it is taking you that long you should ask for help) and four research projects which Professor Mauel gives ideas to investigate and sets up any computer tools you'll need in class. Depending on your computer skills, slightly below or above average workload.\n"
        },
        {
            "course_name": "Introduction to Computational Math and Physics",
            "review_date": "April 19, 2004",
            "review_content": "\nExcellent introduction to the field of computational science.  Mauel is easy-going, understanding, and overall a great teacher.  He's pretty passionate about the material, so it makes even the most boring topics (and there are a few) interesting.  Just keep up with the work, and you should get an A.\nWorkload:\nEasy, quick, weekly homework assignments that can be done an hour before class.  4 long and involved projects.  They're difficult, but not too bad as long as you start early.\n"
        },
        {
            "course_name": "Introduction to computer programming (Fortran)",
            "review_date": "December 31, 1999",
            "review_content": "\nIf you're an Applied Physics hopeful or another student willing to learn a programming language being phased out by the minute, step right up. Welcome to what will probably be your first class in computer programming. For a senior member of the Applied Physics department, Professor Mauel handles his computer science teaching impressively. Fair and friendly - ask him to talk about his research.\nWorkload:\nNot too difficult, but make sure you do all the assignments. Grading is fair.\n"
        }
    ]
}