{
    "prof_info": [
        {
            "prof_name": "Annabella Pitkin",
            "prof_id": 9462,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "March 20, 2012",
            "review_content": "\nAwesome professor and pretty awesome class. Professor Pitkin is very interested in what her students have to say and is super knowledgable about Chinese civilization. Her slides provide a nice visual addition to the course. You really learn a lot from her class about Confucius and Buddhism. \nThe course is reading heavy but the trick is knowing what to skim. The midterm, essay, and final were all graded very fairly. This is the class to take if you are looking for an introductory East Asian course.\nWorkload:\nLots of reading but she never tests you on the details, midterm and final have review sheets given by her, the final also has review sessions, overall a very doable course\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "January 03, 2011",
            "review_content": "\nProfessor Pitkin is definitely knowledgeable and passionate about Chinese civilization and this course was a satisfactory introduction class but not a life-changing experience. The course chronologically covers over 3,000 years of civilization in 3 months, but no worries: the final is not cumulative. \nThe lectures tend to get boring and the readings cover all that the professor is explaining. In fact, professor Pitkin has so much knowledge or interest in one specific topic (like Buddhism) that she tends to focus on that one thing for over thirty minutes... until it gets pretty irrelevant to the rest of the lecture. But if you get lazy to do all of the reading assignments, you better attend lecture. \nWeekly discussion sections are mandatory and you have to write a two paragraph response on the readings (the questions are posted every week on Courseworks). The primary source and field trip assignment papers seemed pretty daunting, since the professor gave no clear instruction or clues of what she wanted us to do. But the TAs (or at least mine, Myra Sun) was really approachable and helpful during office hours and graded fairly. \n\nWorkload:\n- One primary source paper, one field trip assignment paper (3~5 pages) \n- One midterm, one non-cumulative final: ID questions, short/long essay questions (professor sends the list of terms for ID questions and examples of essay questions) \n- Lots of reading, but comparable to most Global Core or EALAC courses\n- Weekly mandatory discussion section and postings (= participation grade) \n"
        }
    ]
}