{
    "prof_info": [
        {
            "prof_name": "George Murray",
            "prof_id": 3047,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Sociology",
            "review_date": "January 01, 2007",
            "review_content": "\nProfessor Murray makes this the worst class I've ever taken in either high school or my three semesters of college.  Almost no classes started on time (usually ten to twenty minutes late), and we were constantly behind schedule.  There are assigned readings (out of one textbook), which we then \"discuss\" in class.  By \"discuss\", I mean Professor Murray puts up powerpoint slides with several-hundred word quotes from the text, and students debate whether or not sociology should actually be an acadmic field.  Professor Murray is disrespectful in his lack of organization.  He would frequently stand before the class and quickly read over whatever assigned reading we were supposed to review that day, clearly not having done so before hand. \nWorkload:\nShort readings; an embarrasingly simple mid-term and final; two \"research briefs\" - those what these are I don't think anybody knows.  Even if you need an easy class, this one isn't worth it - I would have prefered to have been a part-time student than have wasted my time in this class.  An embarrasment to Barnard and Columbia.\n"
        },
        {
            "course_name": "Introduction to Sociology",
            "review_date": "November 16, 2006",
            "review_content": "\nProfessor Murray is a really young and inexperienced professor. He's really funny and nice (although kind of awkward at times) but he simply cannot lead a productive class discussion!! He also often brings his own politics into the classroom and his mocking of Bush and conservatives is sometimes a little over the top. He is also an incredibly easy professor. The class is turning out to be a big waste of time in my opinion.\nWorkload:\nReadings are 2-5 pages for the most part. Very minimal. Midterm was easy and class participation counts for a lot. Also, two \"reasearch briefs\" are assigned.\n"
        }
    ]
}