{
    "prof_info": [
        {
            "prof_name": "Beau Shaw",
            "prof_id": 9156,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 14, 2015",
            "review_content": "\nThis man changed my life. He is everything you can want in a professor: he cares about the subject matter more than anything else. Sure, Beau's class has a little more work than other CC classes, but this is because he actually wants you to get something out of CC and philosophy in general. He actually wants you to engage with these texts. And, in my opinion, he 100% succeeds. There will not be a dull moment in his class. This man actually gets you to philosophize and WANT to continue philosophizing both inside and outside of class. Now that is something special, especially considering how much work we all have and the fact that most of us would probably rather sleep through CC. \nA lot of people (like the reviewer below) will probably complain about the workload, but honestly its not much because the work is NOT busy work. It is Beau's attempt to get you to philosophize. The weekly response papers are 2/3 pages of whatever the hell you want to talk as long as you relate it back to philosophy and the text.  And, for this reason, he is a generous grader and it is not hard to do well. All you need to do is engage with the ideas at hand and—more importantly—CARE about the ideas at hand. And, trust me, that will not be a problem because 4hrs of Beau's magic a week will make you care. \nBeau Shaw is a freaking legend. This man absolutely deserves his gold star. Columbia needs to wake up and TENURE HIM IMMEDIATELY. He is by far the best professor I have had and I am confident that he is better than most of the professors at Columbia. TAKE HIS CLASS. \nWorkload:\nSee above. Weekly response papers of 2/3 pages. Two 8/12 page papers. Midterm and final are straightforward. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 26, 2015",
            "review_content": "\nThis class validated my decision to come to Columbia.\nIn order to give you an idea of who I am, and the background from which I am approaching this course, let me tell you about my Lit Hum experience. As someone who is not keen on the humanities, the Core has not been my greatest ally.  Lit Hum was a harrowing experience for me, characterized by a terrible professor who refused to teach and somehow found a way to make the greatest works that the West has ever seen more tedious than the most annoying problem set one could fathom. As a result, I read approximately 30% of the Lit Hum syllabus.\nHowever, Beau reversed all that. He somehow inspired me to want to read every word that was assigned. I would find myself compelled to finish each text, just so that I can fully engage with everything that he says and is said. He has a way of inspiring people to speak. Discussion becomes interesting. He does not shy away from confrontation but invites it. If you have something to say, it will be fully considered.\nSome days which I would make sure not to miss: Plato, Maimonides, Bible, Rousseau, Marx, Kierkegaard, and Nietzsche. Pay special attention to Kierkegaard. My world view was very shaken by this discussion.\nA typical day proceeded like this: We would arrive at class and put our response papers (if you chose to do yours that day) on the stack in the front of the room. Then, once the class settled, he would give a 5-30 minute background on the text we are reading (length varies dependent on how much he likes said text). Next he will ask, \"so what did you think?,\" prompting an informal discussion. Finally, we would go through parts of the texts that Beau deems as particularly important or informative until the end of class. Often, this last part of class is not long enough because Beau likes to be thorough in what he talks about, so large portions of the texts are on you to figure out (he has nice, long office hours though). When class ends, you'll find yourself surprised that it's been two hours and wishing there was some more time!\nThere are some things though to be wary of when choosing this class. If you are religious, while Beau tries to be respectful, the Bible and medieval texts may be an unpleasant experience for you because he has a strongly secular bias. He will listen to and fully consider anything you say, and only critique in an intellectual and thoughtful way. Next, if you do not want to put in the work, I would not take this class. While you could probably get away without reading, not reading greatly diminishes the experience. Of course, there will be times during the semester when it becomes difficult to read before class. However, if you plan on not reading consistently, I would not advise taking this class. Otherwise, he taught sections from 2-4 and 4-6 on MW my year. Try to get into this section!\nWorkload:\nBiweekly two hour class. Participation is important. But don't fear! Beau is easy to talk to! 10%\nTwo 8-12 page papers. They're more long than difficult. 17.5% each\nTwo non-cumulative exams (colloquially called midterm and final). 17.5% each\nWeekly 2-3 page response papers. Really help you digest the text. Shouldn't take more than an hour to write, but sometimes, you'll want to write more, because this is one of the ways that you can have a private dialogue with Beau. 20%\n"
        },
        {
            "course_name": "Contemporary Civilizations",
            "review_date": "May 11, 2015",
            "review_content": "\nFor anyone considering taking Beau Shaw, a few words of warning. His class is 'intellectually engaging' in that he attempts to make philosophy interesting. Though you probably won't fall asleep in class and he keeps conversation interesting, the work you do for his is very time-consuming as compared to other CC sections. The papers especially are a struggle because of their much greater length. The midterm and final are straightforward. His grading is very inconsistent and unclear, and he is absolutely unflinching on changing your grade after he decides it. His method of calculating the final grade is also not clear. Overall, Shaw is completely undeserving of the gold nugget he has- I'm almost certain there are professors who can both facilitate good discussion and not give busy work. \nWorkload:\nWeekly response papers (they are supposed to be about 3 pages but I did 500 words and he was generally fine with this, these are mostly busy work). Two long papers, 8-12 pages. Midterm and final are about 8 text questions and an essay- no passage IDs. Shaw also likes to see class participation.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 09, 2015",
            "review_content": "\nBeau is the man. I lack words to describe him as a professor. If you take him, it's a guaranteed 4h of intellectual orgasm a week, plus the countless other hours you'll spend thinking about the stuff he said and was discussed in class. He has inspired me to take more classes in philosophy, to become a better person by thinking about my actions, and perhaps most importantly, to become a better thinker. Want a class that helps you develop power of thought? Take CC with the Beau. This class has probably made the entire Columbia experience worthwhile--he's that great.\nWorkload:\nWork really doesn't matter that much. It requires time, sure, but within the first weeks you'll be so engaged in the class that you'll actually look forward to reading the texts and writing those response papers. Plus by the middle of the first semester you'll be good enough at writing them that you'll be able to do so with very little time. Don't be demotivated because of the workload, it's nothing compared to what you'll gain from this class.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 25, 2015",
            "review_content": "\nThis is the best teacher EVER. CC is the best class ever. He makes every class SO interesting and I understand everything so much better after I go to class. CC flies by because he engages everyone in our class so much.  I love him I would date him if I could because he is so stimulating.  LITERALLY THE BEST CLASS EVER. He's a pretty easy grader too. \nWorkload:\nIt's more work than some CC classes because we have to write a 2-3 page response paper every week. And then two 8-12 page papers. But his midterm and final don't have IDs which is AWESOME!!! Just short answer and an essay. So yeah like i told you before he is AWESOMEEEEEE.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 10, 2014",
            "review_content": "\nNothing but good reviews for this man. If you happen to end up in his section, consider yourself lucky. Though the workload is more intense than other CC sections (he requires a 2-3 page response paper once a week) you actually get a lot from this class.He simplifies the ideas from the works to make it more understandable for you. The class is majority him lecturing, and if you take good notes, the exams will be a breeze to you. He provides a review list before the midterm/final and as long as you were awake during class you don't even have to do the readings/review the books before the exams (but, you DO need to read to get good grades on the response papers- it evens out) \nHe's not the most flexible professor but he's good at what he does. Take his class if you actually want to learn about philosophy, and not just taking it as a dreaded requirement. I'd take any other class offered by him. What sets him apart from most professors is that you can tell he ENJOYS teaching and talking about the material, as he always has a smile on his face. That actually makes more of a difference than people think. \nHe's also a really cool dude if you talk to him. Especially if you like Breaking Bad. \nWorkload:\nHeavy. 2-3 page response papers 1x a week, 2 8-12 page papers, midterm and final exam. Participation isn't much (10%) it's mostly your response papers and the 2 major papers. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 17, 2012",
            "review_content": "\nBeau is hands-down, awesome. He's very understanding and has a clear sense of the whole progression of philosophy, as well as how it should fit into the CC curriculum, especially for people who may not have had any previous exposure to philosophy. \nGoing to class is really chill, and you never feel stressed that you didn't understand a concept or didn't completely read the assignment (though most people probably did simply because the class inspires you to actually understand philosophy and its importance). Comparing this to my other Lit Hum and CC experiences, being in this section and listening to Beau speak about the texts is incredibly illuminating. He's distills all the ideas really well in a completely comprehensible way, and it's easy to tell why what we're discussing is so important. The way he speaks about things is lucid and logical, and most importantly, not overly abstract as some other Columbia professors. Class consists of him talking about the work and explaining the important concepts first, then a discussion that he leads where you can offer your opinions if you want, but he'll never force you to conjure up a stance.\nIt might be easy to be put off by the weekly 3 page summary papers, but it's really not too bad. If you have some semblance of being coherent and offer some sort of insightful response to the readings, you'll be fine. The two major 8-12 page papers can be more of a struggle, but you can choose topics and meet with him in office hours, so in the end, it's completely doable. Midterm and final are...very easy compared to other horror stories I've heard. The texts that he's not so familiar with (the Quran, Darwin, etc) won't be tested. \nThere were two class trips to...interesting films. We'll just leave it at that. Beau also has some great stories and a good sense of humor. Going to class is enjoyable, stress-free, and enlightening. What more could you want out of CC?\nWorkload:\nWeekly 3 page summary responses, 2 8-12 page papers per semester, one midterm, one final, one pop quiz towards the end which probably didn't count for anything. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 17, 2012",
            "review_content": "\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nBest class ever; best teacher ever.\nSeriously. \nWorkload:\n1 response per week; 2 papers 8-12 pages; midterm; final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 16, 2011",
            "review_content": "\nBeau was a brilliant CC teacher. CC is one of the harder core classes to teach as we cover an absurdly large quantity of incredibly dense material in very little time. As a result, many CC sections end up being boring, bland and pointless 2 hour discussions during which the profound and complex ideas of Plato, Hobbes, Kant etc. tend to become reduced, simplified and frequently distorted. This absolutely did not happen in Beau Shaw's class. Beau is smart, well-read and obviously passionate about philosophy. Not only did he present the difficult ideas of CC texts clearly and coherently to us, he also made these ideas feel urgent and relevant, consistently challenging us to question many of the social, political and cultural assumptions we live under everyday.\nIf you want your CC class to be a meaningful, substantive and enlightening experience instead of a 2 hour hodgepodge of confused and incoherent opinions, take Beau's class. Though be warned, the workload will consume your whole year!\nWorkload:\nresponse for every class, two 8-12 pg papers every semester, midterm and final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 25, 2011",
            "review_content": "\nBeau Shaw was a great teacher. I had no idea what was going on in most of the books that we had to read, but he talked about connections and importance in the books in an easy to understand and clear way. He is also pretty funny and easy to listen to. He also made the 2 hour class go by pretty quickly (which was a miracle). Even though CC itself is one of the worst classes in the core and a pain to take for two semesters, Beau was one of the best teachers I could have. \nHowever, the workload we had to do for his class was way beyond any of the other CC classes. You had to come up with 2 or 3 criticisms or questions for EACH class (which was about 1-2 pages), also our 2 papers had to be 8-12 pages! Most classes have no response papers and only 5-7 page papers, so this way beyond irritating.\nThe best thing about being in his class is that you get to submit rough drafts for papers and his comments are extremely helpful. He is also very accessable and before each midterm or final, he would hold a review session for 2 hours. He also gave you a list of broad concepts from which the exam questions would be based off of, which was a lifesaver. Therefore, the work was a pain but he really prepared you for the exams, and he also really helped with your papers. Overall, he was a really good teacher.\nWorkload:\n1-2 page response paper for each class, Two 8-12 page papers, midterm, final (not cumulative)\n"
        }
    ]
}