{
    "prof_info": [
        {
            "prof_name": "Roosevelt Montas",
            "prof_id": 594,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 17, 2016",
            "review_content": "\nI've never felt compelled for write a review for a professor but when I come across someone this inspiring and impactful, I feel that it is the least I can do. I had Roosevelt Montas for my second semester of CC. He is the director of the core curriculum, a master in American studies, and a strong defender of the value of a liberal education. He is extremely personable, kind, knowledgable, passionate and fashionable.  He teaches you engage with the readings in a way that changes the way you think about life, and forces you to constantly self-examine, remain critical, skeptical and open to the new. \nParticipation is incredibly important to him- it constitutes a significant portion of your final grade. He wants to see that you are not only doing the readings but engaging with them, finding holes in them, and putting them into conversation with each other. If you prefer a strong, seminar, discussion-based environment, you should most definitely take his class.\nYou get as much out of this class as you want. While there are so many readings on the syllabus and it is absolutely impossible to discuss them all in depth (as Roosevelt knows and regrets), I strongly recommend that you do as much of the readings as you can- it will be reflected in your grade and it will profoundly impact your life and the conversations you have outside of class. I wish I could have had Roosevelt for the entire year, but I am incredibly grateful of everything I have taken away from his class. \nThis guy deserves a gold nugget. \nWorkload:\nWeekly one page responses, Two papers (4-5 pages, 5-6 pages), one midterm (passage ids and very brief short answer questions), final (passage ids with short analysis, one essay), 3 group presentations over the course of the semester- participation!! He does not grade easily, but the grades you earn on your papers and exams do not necessarily translate into your final grade. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 11, 2012",
            "review_content": "\nProfessor Montas made my year. \nUpon first meeting him, you will likely find yourself drawn to his warm character, extremely personable nature, and impeccably outfitted suits and ties.\nAbove all else, however, it is his passion for the course material, and ability to effectively communicate this passion, that makes him stand out from so many other professors. Montas added a book on Gandhi for our last reading in class and it was evident how much of himself Professor Montas put into his teaching--for Montas, the ideas and critiques of the text that he raises in class are a product of his ruminations. Montas is a thinker, and if you can appreciate the art of questioning and challenging, you will grow from his seminar. He artfully directs the classroom discussion and dynamic in a way that balances students questions with his own input. Should the class want a more participatory atmosphere, Montas will make room for that. On a quieter day when students may be more tired, Montas has much to share.\nAs the director of the Core, Professor Montas is a very busy man. But he makes himself available to students to meet before papers or just to chat casually. At the end of the year he took our entire class out to brunch and it was awesome, a great way to end the year. Cookies and snack breaks in the middle of every class are a huge plus! This encourages a lot of class bonding, relationship building that is beyond the syllabus. Some are critical of the weekly responses, but I found these reflections (max one page!) helped me hone my thoughts and my perspective on the readings. With so many books on the syllabus, it is easy to get lost in all of the pages, but these weekly responses recorded my initial and often very personal reactions to the readings. I'm really happy I have these short responses to take with me into the future. On another note, I strongly recommend staying on top of the reading. There is much to benefit from it. These are the thinkers that have shaped our society, and Montas structures his class in such a way that encourages you to do the readings and not lag behind.\nI should emphasize that Montas TRULY values class participation. Most of his grade is based on that. He wants to hear his students think and grow. If you are someone who benefits from a strong seminar environment, Montas' class is a good fit for you.\nThank you, Professor Montas! You are a wonderful educator.\n\nWorkload:\nMostly: CLASS PARTICIPATION!\nWriting:\nWeekly, ungraded, very short responses (under one page)\nMidterm\nTerm Paper (2)\nFinal\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 12, 2012",
            "review_content": "\nThere hasn't been a new review of Montas in a while, and he deserves one. He jokingly referenced his unflattering CULPA reviews on the first day of class, so he's aware of what's written and evidently disagrees with it.\nMontas is a good but not great CC instructor. He's knowledgeable about the texts and passionate about them, too, and he does a good job of fostering discussion in the class. He's a tough but fair paper grader who's great at picking out holes in poorly argued writing. He loves his students and as far as I know is always happy to meet with them outside of class. He gives us a five-minute break in the middle of every class, which usually winds up being 10 minutes or more, to eat cookies and chat. He's a nice, friendly guy. And of course most of the books are great.\nUnfortunately, he has some dubious professorial quirks he refuses to get rid of. He insists on introducing every text with 15 minutes of biographical information we could have found on Wikipedia. He's wedded to standardized, in-class response of some kind. During the fall, he called on \"odds\" and \"evens\" and prompted them for reaction to the reading, and during the spring he asked us to form groups and present on each reading. \nHe also responds to almost every comment made in class with a minute of his own remarks, which can slow us down--often we would race through books to note important passages after our discussions sidetracked us. \nWorst of all, he gives exams that rely almost exclusively on passage identifications. The fall midterm and final didn't delve too much into obscurity, but the spring midterm killed lots of us. The average was a 67, which is pretty ridiculous for a humanities course's reading comprehension test (which is a ridiculous thing to give in the first place). Everyone would benefit if he had fewer IDs or IDs designed to prompt essays, but he hasn't changed course yet.\nAll that said, he has a grading procedure which means that a 55 on a midterm won't kill you. His grades are 80-90 percent class participation, which makes for a lot of A-'s. If you keep up with the reading and responses, and show up to class, you'll probably get an A-. Could be worse, no? But things could probably be better, too.\nI left the class a little frustrated because, with a few tweaks, CC could have been much better. It could have been gold-nugget-worthy. Alas, it was just pretty good. Maybe that's enough for you.\nWorkload:\nstandard CC reading, weekly responses, tough midterm (all IDs), tough final (mostly IDs), two 4-5-page papers\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 27, 2008",
            "review_content": "\nRoosevelt was great. I switched into his section in the middle of the year, so I can only speak for the second half. He was very well prepared, was able to guide a discussion when people had things to say, and could spark discussion when people were less eager to talk. He doesn't just hand out A's like candy, especially on the papers, which tend to be graded pretty harshly, but guess what, doesn't matter!  \"Class Participation\" was like 90% of the grade, so I think everyone get's good grades in the end if they showed up and made at least some effort to talk intelligently.  A good catch, worth sticking with if you end up in his section. \nWorkload:\nPretty standard for CC\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 21, 2008",
            "review_content": "\nRegrettably, as many of the below reviews state, Professor Montas is a truly horrible instructor. If you find yourself reading this review upon notice that you're in his section for CC or are considering to switch in his class, do not switch into his class and do whatever you can to switch out.\nProfessor Montas does not foster an environment of learning and deep exploration of the themes and ideas of the texts in the CC syllabus, rather, he is extremely disorganized, does not have any set grading scheme, is a harsh and ambigious grader (and so too are his assignments), and lectures for a great part of the class. When he does, it is irrelevant and boring.\nWe could never delve deep--or even skim the surface--of any of the texts in CC. It's winter break and I wish I could say I've forgotten everything I've read about Plato and Aristotle, but truth be told, in his classes, we barely learned anything about them.\nCC is a staple of the Core and the Columbia experience as an undergraduate student. So do yourself a favor - you won't learn anything in this class, it's sure as hell not an easy A or even A-, and it's a complete waste of your time.\nWorkload:\nStandard CC: Harshly graded, ambiguous midterm (all passage IDs) and final (5 passage IDs and 2 essays), weekly graded responses, and 2 ambiguous essay assignments that are also harshly graded. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 14, 2008",
            "review_content": "\nI definitely see why his reviews are pretty polarized. To be honest, they're all correct. He is a really cute little guy and generally pretty friendly and funny, but on weird things he can be a huge stickler-- for example, he will make you stand up and tell the class why you're late if you walk in 1 minute after he does. However, he himself is usually at least 2-3 minutes late to class. He is also a very very hard grader-- he told our class for our first essay that he wasn't going to give us grades because he didn't want to discourage us because he knew they'd be low. However, as others have noted, he doesn't really have a formula for grading. As he says, if you show up to every class, participate, do every response, and give your full effort on every essay and exam, you should get an A-. Don't be fooled though-- he doesn't just dole out the A-'s by any means.\nAs for his teaching style, he really does lecture a ton, which some people find boring but what he says is always very good and interesting. He focuses a ton on historical background and context but usually it's helpful. I just felt that we never really got all that into the books, however. \nInstead of really analyzing, he would sort of just break down or summarize the main point of the author (he might do this 2 or 3 times-- he can be very repetitive. We were explained in great detail what Plato's Theory of Forms is no less than 3 times). I guess this is an advantage over a lot of other classes because a lot of my friends didn't even get this much, but if you read the text, you should really have gotten that yourself. \nWhen he's not lecturing, he also loves to go around the room and collect responses. I understand why he does this-- to hear from other people, since he lectures so much-- but I don't think it's all that effective. Half the time, we'll get to response number 2 or 3 and get so caught up in a discussion that the class will end before we even got to something important, and the other half of the time, he'll go through everybody but so quickly that we never actually went in depth but rather simply touched on a bunch of ideas spit out during response time. I think he needs to work on how to elicit responses from a class without a round of responses, which some people clearly haven't actually thought about and are just saying something because they have to.\nIf you get Montas, I wouldn't drop his class but I wouldn't exactly be ecstatic either. Some people love him to death in my class and others feel the opposite way, so see how you like him the first few classes or so.\nWorkload:\nweekly response (not graded), typical cc reading, 2 essays (4-5 pages), 2 exams\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 31, 2007",
            "review_content": "\nMontas is a boring lecturer who spent two hours of class basically reiterating terms and concepts introduced in the reading. Though at first I thought this was a good way of actually learning convoluted material that needed clarification, by the end of term, his lectures became tedious and unnecessary. Further, it did not stimulate any discussion at all, which I thought was the point of the class. He is admittedly a hard grader on essays, but all essays, reading responses, midterm and final literally count for less than 10% of your final grade. He says 90% is participation, which makes it impossible for you to figure out your grade at all. I made sure to participate in class, though as I said he spends most of class time talking himself, write all the responses, and yet came out with a B. \nWorkload:\nWeekly responses, 3 essays, midterm, final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 13, 2007",
            "review_content": "\nHe is fabulous.\nThere are a lot of incompetent people teaching CC and if you're randomly assigned to Montas, be happy! He is extremely knowledgeable about the texts. His synopses and analyses of all the books really helps give you context about the material.\nIt is true that he does lecture more than most section leaders. However, he does leave an adequate amount of time for discussion. This is better than many section leaders who let students talk too much because they have nothing very serious or important to say themselves. That often just results in conversations lacking serious context or insight. \nIt is true that he is a stickler but it just is his style and it is rather endearing. Also, don't worry if you get low marks on your essays/midterm/final. His final semester grades are always higher than the grades he gives on assignments so don't stress out too much.\nWorkload:\nTwo 4/5 page Essays. Midterm. Final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 20, 2007",
            "review_content": "\nGetting Professor Montas for CC is both a blessing and curse.  He is obviously brilliant, although he tends to treat CC as a lecture.  When he does take responses, it is often him going through half the roster and randomly calling on people.  This can be pretty nerve racking, although it's not that bad.  The class also tends to be pretty uptight and often the same three people tend to talk all the time.  His grading is also absurd, with very few guidelines, although the syllabus says class participation is 80-90% of your grade.  When he gives grades, they tend to be quite low, which is really depressing, even though your final grade doesn't reflect your grades in the class at all.  Know what you are getting into before taking CC with Montas.\nWorkload:\nWeekly responses.  Very difficult midterm (all obscure IDs) and final.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 26, 2007",
            "review_content": "\nPerhaps Professor Montas is a good English or Literature teacher. Not so for philosophy. He spends most of the section talking to us about the text. He does not engage the students in the material directly but rather lectures in what is supposed to be a discussion section. Therefore the questions and issues which would normally arise through thoughtful discussion, are either rendered uninteresting because they are being fed to us and we are numbed by the monotony, or because they simply do not arise. Sometimes it seems he likes to here himself talk.\nBut he does do a good job of summarizing the text. You can tell he read it himself.\nFurthermore, he is highly uptight. He enforces page limitations on essays to the letter, and announces when people are late, sometimes with a cute but unwelcome quip. He also wears a full suit to class. Every day.\nI am writing this review while in class. Unfortunately, that's how unengaged I am in the discussion or class, because I feel as though I am watching TV.\nBottom line: not good at facilitating discussion, not engaging as an instructor of philosophy, good at summarizing, eloquent speaker.\nWorkload:\nAcceptable. Have not received grades yet.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 16, 2007",
            "review_content": "\nRoosevelt Montas is a great teacher for CC.  He does a really good job of balancing discussion with lecturing so that the class feels informed about the texts and discussions basically never go so off topic as to become pointless.  As previous reviewers mentioned, he does establish a great deal of camaraderie in the class and it truly becomes a class not to be dreaded (even though I'm sure most people don't look forward to a lot of the material read in this class).  My one qualm with Montas is his grading style.  He grades on a general sense of how much you contribute to the class and in a way this is good because your final grade often ends up being higher than what you'd expect based on the harshly graded papers and exams.  However, this grading style essentially boils down to Montas giving good grades to the students he likes and it's not clear what standards if any he uses.  Despite the uncertain grading, Montas is still a great teacher who is probably one of the best instructors you can get for CC.\nWorkload:\nThe workload is quite reasonable for CC.  As always, the reading is extensive but Montas assigns short papers with good topics.  We also have a one-page reading response due each week but these were really low stress since they were ungraded and essentially need only record your initial impressions of the texts.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 18, 2006",
            "review_content": "\nRoosevelt's adorable and I pretty much spent the entire year having a giant crush on him. He is enthusiastic and I always appreciated that, even when I was not at all interested in the particular text that he was raving about. Now and then I'd disagree with his analysis of a philosopher's argument, but that only made class more interesting. There were definite lulls, and certain texts that just didn't spark any interest, but he always tried his best to get something out of us. \nIf you are dreading CC, take Roosevelt's class. He's young and fun and he makes the whole experience that much more enjoyable while bringing a respectable and ever-growing amount of insight to each text. Show up, let a few neurons fire, do the responses, write your papers on-time and you'll inevitably do well. \nWorkload:\nLOTS of reading (doesn't often cut down the reading as much as other CC professors do...but you can get by not doing all of it), Two 4-6 page papers (stay simple...don't overcomplicate the question, he didn't like that), 1 response per week, 1 midterm, 1 final \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 07, 2006",
            "review_content": "\nI was not looking forward to CC; not a big talker in class, especially when it comes to \"boring philosophical texts.\" So how refreshing and relieving it was to end up in Roosevelt's CC section!!  The class was totally relaxed, but I learned A TON and actually enjoyed most of the readings.  Class discussions were casual but to-the-point; Roosevelt made sure we knew enough about each of the authors/texts beforehand, which cut down on the verbal diarrhea characteristic of several of my other core classes.  He doesn't pressure anyone into talking, and you learn a lot.  He's concise and really boils down the important points of some abstract/complex texts.  In terms of grading, I considered my papers mediocre and came out with an A in the class (probably b/c I showed up to class on a regular basis and turned in all the reading responses).  In short, if you get assigned RM's section, count yourself lucky, he is an AWESOME CC prof!! \n"
        },
        {
            "course_name": "Emerson, Transcendentalism, Antebellum Politics",
            "review_date": "January 08, 2005",
            "review_content": "\nProf. Montas' passion for Emerson, Thoreau, and Transcendentalism knows no bounds - the reading clearly was his forte and his vast knowledge of the time period made the seminar incredibly informative and well-detailed. I only wish his skills could be applied to a more engaging set of readings. I felt in the minority in the class for not loving every single book that we read, but I took the seminar in order to become *more* interested in Transcendentalist writers. By the end I grew to hate the reading, and while that might be a personal preference, it may also be that Prof. Montas can't transfer his own interest in the readings to students. There were a few other minor issues I had with the class - Prof. Montas is a stickler about tardiness, but didn't give us a break or even let us out on time, and it took three weeks for our grades to be submitted when my other seminar grades were in under five days. He also didn't grade anything the entire semester, which definitely made me nervous about my final grade. Still, the class is worth it...*if* you have a really strong interest in the reading material. I didn't, and I wish I had taken something else instead.\nWorkload:\nA TON of reading each week, much of it dense. Weekly response papers, one presentation (approx. half an hour, which seems long but actually was ok since Prof. Montas liked to interject a lot) and a 10-15 pg final paper.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 10, 2004",
            "review_content": "\nRoosevelt is an adorable peanut and one helluva CC professor.  He has an amazing talent for establishing a level of comfort and camaraderie in class that has made CC (a class that i had been seriously dreading) one of my favorite classes this semester.  Roosevelt is extremely cool and insightful and he does a wonderful job mediating discussions and keeping everyone focused (...except for when he DOESN'T, at which point the class becomes intolerable.  Roosevelt lost his groove for a couple classes--i think as part of a mourning period after the election--but once he got it back, the class was better than ever).  Anyway, he's great.  Take his section if you can.  I had it at 9am and i never once considered transferring at semester. \nWorkload:\nNot too bad.  Ungraded one-page responses to each or the texts, two papers (2\n-3 pgs and 3-5 pgs), midterm (killer) and final.\n"
        },
        {
            "course_name": "Foundations of American Literature I",
            "review_date": "June 21, 2004",
            "review_content": "\nThough I felt Roosevelt to be a kind, good-natured person, I disagree with the other reviews.  I felt that his discussions were limited and that he lacked the ability to really delve into the literature.  His knowledge of history on subjects such as transcedentalism was extensive, but during our discussions on the works themselves, he would agree with everything the students said and provide no specific, definite literary insight for himself.  We never really tapped into the importance of these great American writings as works of literature.  Also, his grading (especially on the midterm) seemed to be a bit arbitrary.  I would not say avoid Roosevelt; however, I would not seek him out either.\nWorkload:\nweekly reading response, 2 papers (one was not graded), choice between final or 8-10 page paper on topic of your choosing\n"
        },
        {
            "course_name": "TA for Foundations of American Lit",
            "review_date": "December 10, 2001",
            "review_content": "\nRoosevelt has been an incredible TA for Delbanco's Foundations of American Lit lecture. Delbanco is great -- funny, interesting, tough, provoking -- but your only real interaction is with the TA's. Roosevelt runs a tough discussion section. You have to do the reading, write the response papers, and really think hard about the material. He grades mostly on class participation, but will kick you on the essays and papers. I learned an amazing amount about American literature, and have really been able to improve my writing and analytical skills. I met with Roosevelt several times over the course of the semester, and he was always incredibly kind, receptive, and helpful. It's a major shame for Columbia's English Department that he is leaving to write his dissertation. I hope that he comes back to CU to teach!\nWorkload:\nShort weekly response papers (1 pg), 1 3-4 pg essay, 1 4-5 pg essay, 1 midterm (easy), 8-10 pg final paper or final (I suggest the paper.)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 09, 2001",
            "review_content": "\nHands down, the best learning experience I have ever encountered. Somehow he peels open a corner of the texts and allows the class to rip them wide open -- and inside he reveals... magic. He turns these texts into windows into ourselves, the whole scope of Western culture, and humanity itself. He is everything an English teacher can and should be. Take his class. Also his wife is really nice.\nWorkload:\nGrades on class participation and a general sense of whether you've contributed to the class as a whole. I don't actually think he uses points at all -- papers come back with comments, not grades, unless you are a jerk and ask for letter grades specifically.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 09, 2001",
            "review_content": "\nHands down, the best learning experience I have ever encountered. Somehow he peels open a corner of the texts and allows the class to rip them wide open -- and inside he reveals... magic. He turns these texts into windows into ourselves, the whole scope of Western culture, and humanity itself. He is everything an English teacher can and should be. Take his class. Also his wife is really nice.\nWorkload:\nGrades on class participation and a general sense of whether you've contributed to the class as a whole. I don't actually think he uses points at all -- papers come back with comments, not grades, unless you are a jerk and ask for letter grades specifically.\n"
        }
    ]
}