{
    "prof_info": [
        {
            "prof_name": "Alexandros Biliris",
            "prof_id": 1442,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Databases",
            "review_date": "August 16, 2016",
            "review_content": "\nI think Biliris is a fairly strong professor and, given that it was a 2.5 hour class, I enjoyed it as much as I possibly could. As with all professors he has his pros and cons.\nBiliris is a ball or energy and a personality in the classroom and undeniably cares about his students. He responds to questions on Piazza fairly quickly, made a point to get to know people in the class. He even joked that we could call him if going through a breakup. \nHe is very energetic and enthusiastic about the material and the examples, and he tends to be good at making things quite simple, so the combination is good. He also continually involves students of the classroom. He will ask for suggestions on how to solve something, ask someone else to point out flaws, etc. This keeps the room fairly engaged for a class that is 2.5 hrs long. \nBiliris welcomes student questions in lectures and will always stop to answer a question before moving on. This both a pro and a con. Sometimes I feel like the class got stuck because we would keep harping on an issue that was either not extremely relevant or simply repetitive. However, the good news is that, if you are willing to raise your hand, you will always walk out of class knowing what is going on. Unfortunately, Biliris sometimes either struggles to understand a student question or misinterprets the question. As such, you have to be persistent with rephrasing till he understands the question, at which point he usually does a solid job of answering.\nThe workload is quite light. There are 4 light homework assisgnments, two projects, a midterm and a final. The first project is significantly more in depth than the second, but the time allocated for the projects reflects that. The midterm is exactly the same in structure as the practice midterm, which makes it easy to study for. No practice final is given, and the material was harder and more technical, so make sure to spend time on Query Optimization when studying for the final. \nHis grading tends to be fairly generous in my view, and I think the level of CS ability in this class is lower than most other CS classes, since it is required for OR undergrads and many masters students seemed to come from weak data structures backgrounds (we spent 30 minutes discussing the complexity of a hash table). Overall, assuming you go to class and pay attention, this is a low workload class apart from projects and exams.\n\nWorkload:\n4 homeworks (very light and quick)\n2 projects (1st has 3 parts, second has one time consuming part. Start early)\n1 midterm\n1 final\n"
        },
        {
            "course_name": "Introduction to Databases",
            "review_date": "September 23, 2013",
            "review_content": "\nPersonal idea, this course should be considered as one of the simplest course for grad level, especially when you are in your last semester and want to spend more time on job hunting, or when you are dealing with other heavy courses like OS... Besides, 4111 now is a core! Should it be core earlier, why bothering get trapped by OS. (Holly #@$@$#!, although I admit one can really improve a lot by taking OS.)\nYeah, prof. has an accent, but you have textbook, read it! After all, databases system are not designed to confusing people. We are not at Kindergarten and need to be instructed with everything. The projects are not that hard. The homework are easy. The midterm and final are OK if you know what you've learnt throughout the semester. You don't really need prior experience with databases. Last but not least, firms do pay attention to the relational databases project you are working on, understand the project and explain well during an interview, it will land you a full-time job or internship. Of course, we have a lot of new generation databases like cassandra, MongoDB, etc. The relational database, however, just like ball pen, simple but remains powerful.\nWorkload:\nnot that much, especially if you compared with other grad level course\n"
        },
        {
            "course_name": "Introduction to Databases",
            "review_date": "September 06, 2013",
            "review_content": "\nThe WORST professor ever. His accent made the lectures hard for us to understand. Besides, when we tried to ask questions most of the time he wouldn't answer that but made fun of us. His class was totally not helpful. You could read the slides by yourself and don't have to waste your time going to his class. You'd better check if your teammate could follow up otherwise it's likely that you will understand nothing in his class. The curve is bad, many people had got C's. \nWorkload:\nFour homework + two projects + midterm + final\nThe curve is very bad.\n"
        },
        {
            "course_name": "Introduction to Databases",
            "review_date": "May 19, 2013",
            "review_content": "\nThis class epitomizes the worst college class where you get a bunch of theoretical knowledge and NO application. We learned about functional dependencies within databases, and now I can show what a functional dependency is...but what is that within an actual database and how does this apply to SQL? We spent 2-3 lectures on the theory and underlying implementation of indexes....but didn't even touch how to actually create an index in SQL. We didn't introduce us to any of the numerous databases available (MySQL, Postgres, SQLite, ...) and had us play with a variant of an Oracle database that I'm pretty sure NO ONE uses in industry. And now I'm thrown out into the real world with a hammer and I have no idea how to use it. A month later I'll probably be nailing my finger into the wall by accident.\nBesides that, the professor creates slides that are basically copy-pasted from the textbook (and the textbook is horrible with typos, mathematical notation gibberish with no explanation, and no real-world application mentions). He hates taking questions, his TAs are half of the time absent from their OHs, and he obviously doesn't care about the class. I guess he's funny though (if you like \"haha wow I can't believe I'm sitting in this classroom funny\").\nIf you plan on taking this course I recommend the following advice.\n1) Never go to class, and just read the textbook.\n2) The textbook is horrible so find online slides, lecture videos, and other SQL/databases notes to actually understand the textbook\nWhat does this advice mean? Basically, if you take this class you will be paying a few thousand dollars in tuition to find and learn everything on your own.\nWorkload:\nFour hws where the answers are straight from the textbook (if you understand it). A project where you build a web app with an underlying database (he gives no tutorial on how to build a web app and the Oracle database you use is never actually used within industry). A final and a midterm where the answers are arbitrary (is this really good database design? is this really the best SQL query you could have used?)  or the answers are cookie-cutter (vocab, exactly like the hw or class example).\n"
        },
        {
            "course_name": "Introduction to Databases",
            "review_date": "May 15, 2011",
            "review_content": "\nYes, his command over English is not the best. Yes, he does take digs at what students say if he doesn't understand them. But overall I wouldn't describe Biliris and this class as awful. His lectures are 2.5 hour long rambles, but not without comical interludes. His jokes are often funny, and he gives a ten minute break in the middle of class, which often extended to fifteen. Having said that, you can manage even without ever going to class, so apart from the few jokes there's very little value addition by his lectures.\nThe class material itself is interesting. It c, ould have been presented better (He reuses slides from several years ago, and doesn't even change the semester in the footer), but he has his limitations in teaching ability, and so you just need to make do with it. The four homework assignments are fairly easily. The projects can take time, but if your partner isn't completely lost, you can divide up the work and finish it over the course of a night. The exams are both fair, but of course, there's thinking involved, so it's easy to panic if things aren't going your way.\nIf you're not a CS major, I'd recommend to buy the book. His lecture slides are essentially a summary of the book, but there are some concepts that aren't very clearly explained in his slides. If you were sleeping in class (or absent, like I was), the slides will be of very little help in such instances.\nI can't say whether Biliris genuinely cares about this class or not, but he definitely gives the impression that he cares about the students. In our first class, he announced that we could call him up at any time before 11PMexcept if we were going through a breakup, in which case he said feel free to call me even after.\nIn summary: his lectures are pointless. But he's a nice chap. His material is interesting. The workload: not too bad.\nWorkload:\nFour homework assignments - the first couple take 3-4 hours maybe. The third and fourth are shorter.\nTwo projects - done in pairs.\nOne midterm and one final - both fair.\nThree grace days for assignment submissions and three for projects make life much better.\n\n"
        },
        {
            "course_name": "Introduction to Databases",
            "review_date": "May 12, 2010",
            "review_content": "\nAbsolutely awful. His lectures are boring as shit and he doesn't actually realize that a 2.5 hour class can be taught in more than 8 powerpoint slides (literally). For some reason, he's obsessed with Barbados too and won't stop talking about it.\nBut now onto the real stuff:\nDon't bother going to class. Read his lectures that he posts online (takes about 30 min) and save yourself the other 2 hours. I can't stress enough how useless his lectures were. It's basically like taking a class online, you just have to show up for the midterm and final. The material is actually extremely useful and somewhat interesting.\nLuckily though, the material is easy and there's not much of it. There's a grand total of 10 short lectures (only 9 of them are tested on), compared to other classes that have about 25 a semester. The average won't be that high because you're with a bunch of IEOR majors and grad students that don't know how to program. The 4 homeworks can be tricky at times, but honestly not too bad.\nThe group projects are relatively easy and straightforward. You just have to demonstrate that your projects contain every concept that was taught in class, regardless of whether or not your Database schema will benefit with it (i.e. Aggregation is great in theory, but NOBODY puts it into practice in their database. it makes things painfully redundant and difficult. but since we learned it in class, you'll lose a substantial amount of points if you don't have aggregation in your database). Don't bother making your project look pretty or have much functionality. As long as you demonstrate the concepts that were in class, you'll get full credit. The median on project 2 was 49/50, if that says anything to you.\nYou have a total of 6 late days, 3 for the individual homeworks, in total, and 3 for the projects, in total. So clutch.\nMidterm and final are straightforward. If you know relational algebra, SQL, and the concepts, you'll do fine. And let me remind you, DON'T GO TO HIS LECTURES.\nWorkload:\n4 homeworks\n2 group projects\n1 midterm\n1 final\n(all reasonable)\n"
        },
        {
            "course_name": "Introduction to Databases",
            "review_date": "May 02, 2010",
            "review_content": "\nWhere to begin...\n1) This class was useless. Biliris is a mediocre lecturer and an incompetent teacher (or he just wasn't trying). His lectures were a complete waste of time. He would crap on and on about some simple concept in the most unintelligible way for an hour at a clip. I can honestly say that I did not learn anything substantial from this class. By the sixth week half of the students did not show up or left at the break. By the fourteenth week it was more like 80%. The material was presented with no context and no depth. I could have taught this class better than he did, and I do not have near the amount of database and teaching experience as he does.\n2) I ended up doing all of the group work by myself because my partner was so lost. I cannot blame him considering the lectures were essentially black holes. If I had not had database experience prior to this course I would have probably been as lost as my partner, who had none.\n3) A bit of the material was out of date. This happens in CS classes often, but it was particularly bad in this class. I think the textbook we were using was from 2003.\n4) We were forced to use Oracle for our projects, which was a nightmare. Oracle is one of the most bloated and hard to learn database systems around. Why we would use Oracle and not MySQL (very popular, modern, and easy to use) is beyond me.\n5) Biliris does not understand English well enough to teach a course. He can hold a conversation, but he cannot explain complex ideas. He did not understand questions asked by students and he often hid this by making fun of them.\n6) The grading in this class was ridiculous. Often points were taken off if we did not answer a question exactly how the TAs thought we should have, despite those requirements not being specified in the assignment description. Each homework and test problem was graded by a different TA, which meant you had to contact many TAs if you had questions about more than one problem. This was incredibly inconvenient.\n7) My assigned TA had worse English skill than Biliris, which made him useless to me.\nWorkload:\nThere were two projects. The first is pretty substantial and took some time, but was by no means difficult. The second could have been done in a few hours if Biliris actually ever mentioned PL/SQL during the lectures. \nThere were four homework assignments. Some were a bit challenging, but all were mostly irrelevant when it comes to actually learning something useful about databases.\nA midterm and a final. I have yet to take the final. The midterm was not hard, but the questions were as irrelevant as the homework problems. \n"
        },
        {
            "course_name": "Data Structures and Algorithms",
            "review_date": "January 21, 2004",
            "review_content": "\nProfessor Biliris is really not as bad as all that.  I will concede that he is an extremely boring lecturer; however, one of my friends who is among the smartest people I have ever met was able to go to class and pick up everything from the lectures and never even had to open the book.  Apparently, that was his goal with the lectures (to be a substitute for the book), and it didn't bother him at all when people just got up and left class.\nAs has been mentioned, he is a very easy grader, although the homework assignments are designed a little thoughtlessly.  Generally speaking, the portions of the assignment that take 80%+ of the time spent coding are the parts that are irrelevant to the material being taught by the homework.  For example, the homework assignment involving trees and hierarchies was easy enough conceptually, but the mechanics of getting the applet to display the way you wanted were a royal pain in the posterior.  This shows inexperience and some obliviousness.\nHowever, the man isn't uncaring.  A little begging post-thanksgiving convinced him to extend the deadline of one of the homework assignments, and he seems very approachable and eager to help.  Plus he's got that cute little Greek accent, which is always good for something.\nAn average teacher overall, in Columbia terms.\n"
        },
        {
            "course_name": "Data Structures and Algorithms",
            "review_date": "December 23, 2003",
            "review_content": "\nThis man is utterly incompetent. Going to class consists of you sitting there and staring while he copies code for data structures such as linked list or disjoint sets on the blackboard VERBATIM from the text. He doesn't even bother to change variable names. He basically stands there and reads the textbook to you in a somewhat difficult to understand accent. Sometimes he makes fun of people (especially people who leave) but that's the high point of class. Personally, I didn't go to any of his classes at all except the midterm and final.\nWhat ends up actually is that the four or five TAs for the class are the real teachers. Laziness overtakes the average student and most of them do the learning from the homework assignments. Usually people ask questions via the bulletin board which sometimes complicates things (for example, the second homework turned into a swing nightmare once a few students started asking about implementing scroll bars and other gui components to a simple tree application). Don't worry though. The curve is spectacular. I'm not even a CS major and I did the minimum but still scored an A+. \nWorkload:\n5 programming projects which take anywhere from 1 hr to 10 hrs. the homeworks also consist of a theory portion - several questions which ask you to act like a computer and perform some algorithms on data structures that they set up. very easy midterm and final (if you are careful and study from the book).\n"
        },
        {
            "course_name": "Data Structures and Algorithms",
            "review_date": "December 01, 2003",
            "review_content": "\nTeaches verbatim from the book, which is not a very good book. The examples he uses in classs are simply a regurgitation of the book's examples, except that he often makes errors in presenting them (which is usually fairly understandable -- but since he did not design the examples, he has trouble finding his errors.) Lectures are boring, though he does have moments of personality. \nWorkload:\nIt's a programming class. You write programs. They get tougher as they go along, and some of them build on earlier programs. The real problem here is not the programs themselves, but rather the amount of time you get. He designs them as two-week projects, but he *always* forgets to post them until after the weekend, which means that they become 10-day programs (with only one weekend to devote to them.) Homeworks consist of a theory part and a programming part. Not too bad, but the TA's are of absolutely no help, and the seminar sessions are a waste of time. \n"
        },
        {
            "course_name": "Introduction to Databases",
            "review_date": "January 18, 2003",
            "review_content": "\nThis was his first semester, and it showed. He just presented the lecture slides that came with the book, and read them outloud. Going to class was simply useless, if you had some other time to read it yourself. The first part of the class is  easy and straighforward. There's a big project in 3-stages to build your own database application (duh). The second part of the course reminded me of the good old days at Unger's comp org. However, even though Biliris is as boring and mistake-prone as Unger, he is really a cool guy. He even uses the break to go out and smoke. The second project had nothing to do with database. It could have been given to anyone who had taken statistics and data structures. Everything is graded by the TA.\nWorkload:\n5 problem sets taken mostly from the book, 2 programming projects in Java or C++ in groups of two, a midterm, and a NON-cumulative final. Don't be surprised to find something in the homework that was never mentioned in class. If you ask him in class, he will explain it, but he expects you to just read the book. In that sense, this class reminded me a lot of comp org; the book was almost as thick, but the details were just as disgusting. His tests are short and to the point. Even the final was only an hour and a half with 4-5 questions. \n"
        }
    ]
}