{
    "prof_info": [
        {
            "prof_name": "Laura Silverberg",
            "prof_id": 3376,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 21, 2009",
            "review_content": "\nSilverberg seems to have eased up a bit since the previous reviewer. There was no facebook group, and the workload was very light (see below). She was very passionate about the subject and did her best to encourage class participation. She humored every question, was flexible & accessible. She seemed very knowledgeable about the subject & spoke eloquently. However, there was a lot of focus on the formal and technical aspects of the music being played - not tons of fun. I'd say that she is one of the better teachers of a mediocre course, but doesn't have a particularly colorful personality. Keep in mind however that the exams are very memorization-focused. If you take copious notes & have a decent memory, you will do well in this class. \nWorkload:\nLight. 10 short blog entries (2-3 sentences) and 10 longer blog entries (1-2 paragraphs) by the end of the semester. One 2-page concert report. Midterm & Final that will be easy if you thoroughly memorize notes & remember which techniques are associated with which composers. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 20, 2008",
            "review_content": "\nInsanely organized, outwardly very sweet and humors a lot of bad questions. Encouraged outside concerts, but the Facebook group for class was a little too much.\nShe e-mails constantly, and she's incredibly accessible, but similar to high school in terms of workload. Just...unnecessary.\nAnd for a Core class in which most students had no background, I thought some of her exams were ridiculous and her grading unwarranted. \nNice enough, but I'd skip her if you've got a heavy courseload.\nWorkload:\n3 listening assignments (can take forever), 2 concert reviews (easy), 4 discussion postings,  4 quizzes (ranged from easy to really difficult), a HEINOUS final (class average was 72, totally unnecessary), and an optional extra-credit assignment\n"
        }
    ]
}