{
    "prof_info": [
        {
            "prof_name": "Joseph Ulichny",
            "prof_id": 3213,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "C1500 General Chemistry Lab",
            "review_date": "August 27, 2014",
            "review_content": "\nThough this class is a lot of work, it's a great class. Joseph is a wonderful teacher and person- he makes it very clear what is expected of you from the start, and the whole course as well as the labs are all meticulously planned out. He's also very accessible, kind, understanding, and explains things very clearly (he cleared up a lot of things that I was still confused about from Chem I & II). The workload includes weekly quizzes, pre-lab assignments, lab reports, writing assignments etc.. None of it is too difficult, just kind of tedious. \nThe labs themselves are fun and useful. Definitely recommend sticking around for the whole lab lecture as it usually includes information to successfully complete the labs, and gives you info on what to look out for during the actual lab. \nBe very diligent about writing your observations in your lab report during lab- that seemed to be where most students (myself included) lost points. \nWorkload:\nModerate to heavy- I took this class in the summer as well as Chem II and I definitely spent way more time preparing for this class than I did for Chem II. \nWeekly quizzes aren't too tricky- doing the prepared questions Joseph posts as well as the ones in the manual is enough to prepare you for them. \nExams also aren't too difficult- most questions rely on what you retained from Chem I. \n"
        },
        {
            "course_name": "C1500 General Chemistry Lab",
            "review_date": "August 17, 2013",
            "review_content": "\nJoseph Ulichny's chem lab is one of the best science courses I've ever taken. I took the 12-week summer session version, and the students were mostly premed postbacs.\n- Joseph is just a really nice person. He was friendly and relaxed, knows the material very well, and was super-available to students. He also has this quirky interest in art history which he includes in his lectures from time to time.\n- The lectures, which were largely theoretical, really did explain what was happening in lab. Looking back, none of the 10 labs was pointless, or do I still fail to understand what we were doing or why. Sometimes that theory was complicated, but by the end of the course everything did make sense.\n- A lot of students studied together in the otherwise abandoned chem library in Chandler, which is where the TAs held office hours. I really hope that they keep that space open for this purpose. We mostly collaborated, rather than competed, as could have been tempting for a premed class.\n- Unless you're a science genius of some kind, it's wise to work closely with your TA in this class. That person will be grading your lab reports. Each TA has different things he or she is looking for, and you want to be able to match that. I got hit a little hard on the lab grading because I had to work at my job during my TA's office hours. However, once I started communicating with him by email and meeting with him separately, I got the hang of what he wanted.\n- I don't know how the people in the 6-week version of this class do it. For the 12-week version, it's already a lot of work. I'd say that I put in about 20 hours a week work, outside of the labs and lectures themselves.\n- Better to take this after gen chem, rather than concurrently. There are a lot of concepts that need to sink in, and they change rapidly from week to week.You don't want to be encountering them for the first time in lab.\n- DO ALL THE EXERCISES AND PRE-LAB STUFF BEFORE THE PRE-LAB QUIZ. Know the lab inside and out a week beforehand. That way, you won't be blindsided by quiz questions about the labs, you'll know what you're doing before you go into lab, and your brain will have a chance to cognate a bit about what you're going to write in your lab report, before you rush to get it done.\nWorkload:\n1.5 hrs lecture + 4 hrs lab + about 20 hours studying/writing lab reports / week.\nYou have to do all kinds of work in this class: multiple choice exams, written partial-credit quizzes, lab reports, a paper, \"quiz questions\" (he'll explain), \"dry labs\" (problem sets), and of course do the actual lab work itself. You use lots of different parts of your brain in this class. It's not just number-crunching. You have to be able to write, too.\n"
        },
        {
            "course_name": "C1500 General Chemistry Lab",
            "review_date": "May 18, 2010",
            "review_content": "\nJoseph is a great teacher and a great lecturer.  In lab he is extremely helpful, and out of lab he is great about answering questions.  He is approachable and fair.  Overall, the course was a fair amount of work, but it was the most fair course I took throughout freshman year.  For every quiz, there were practice problems and the TAs were always available.  USE THE TA'S OFFICE HOURS!   They spot your lab errors and help you fix them!\nWorkload:\nA solid amount.  1 quiz weekly, 1 lab weekly.  To be successful, study before each quiz for a couple hours doing all of the practice problems.  GO TO OFFICE HOURS to have your lab calculations checked.  Midterm and Final both not difficult, but VERY tricky.\n"
        },
        {
            "course_name": "C1500 General Chemistry Lab",
            "review_date": "December 28, 2009",
            "review_content": "\nJoseph was a great TA. He is a good lecturer and simplifies difficult information well. Before each lab, he really emphasizes what you should do to get the best results. He is also very helpful while in lab and will immediately come to your aid if you have a problem. He responds really quickly to e-mails which is extremely convenient. He responded to my emails while I was completing the lab reports. He is also patient and helpful in reviewing difficult material for the midterm and final. The quizzes really require you to know how to do specific calculations as well as understand the theory of the labs so I recommend doing the lab study problems and going to TA office hours if you have questions before taking the quizzes. I found most of the TAs in the General Chemistry Lab department accessible and helpful during office hours, so you should go to them if you have any problems. \nWorkload:\nFairly heavy: Weekly quizzes, weekly lab reports and pre-labs. The pre-labs and weekly lab reports take a long time to complete. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 25, 2007",
            "review_content": "\nVery nice guy. Very accessable. Explains things ok. Gives really easy quizzes (most important trait of a good TA). \n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "September 08, 2007",
            "review_content": "\nJoseph was a fantastic TA.  He was very nice, knew the material and always responded to e-mails.  His quizzes required some studying, but they were fair, forced you to stay on top of the material, and helped you gauge whether you were ready for the exams (the questions tended to be easier than the exam questions).  He obviously put some effort into his job, which is more than you can say about a lot of TA's.\nWorkload:\nIf you just do the problems assigned on the syllabus, which you should be doing anyway, you should be fine.  Recitation required no extra work.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "March 28, 2007",
            "review_content": "\nJoseph is very nice and approachable. He's great with answering emails instantly and arranging personal office hours. However, he tends not to cover all the material for the exam (usually just the first third, but that is covered well). His exams nicely mimic the exam and thus are a good prep for them.\nWorkload:\n9 quizzes in recitiation, drop the lowest 4\n"
        }
    ]
}