{
    "prof_info": [
        {
            "prof_name": "Susan Crane",
            "prof_id": 1996,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "British Literature to 1500",
            "review_date": "October 23, 2016",
            "review_content": "\nThis class is essential for anyone interested in the English literary tradition. You'll be introduced to (or much better acquainted with) compulsory works like Sir Gawain and the Green Knight, Beowulf, Tristram and Isolde, and Le Morte d'Arthur. If you are an English or Creative Writing major you will benefit enormously from taking this class with Susan Crane, specifically. Her knowledge of and enthusiasm for the material makes for a riveting experience. She'll read to you in Middle English and share relevant music and art that make for a thoroughly immersive encounter with this rich period. (She also possesses a David Foster Wallace-like understanding of syntax and grammar that will help you to refine your prose in ways that University Writing never did.) This is easily one of the most rewarding classes I have ever taken. I should also add, after our trip to the Rare Book & Manuscript Library, I've become obsessed with rare books and older forms manuscript production. I don't know if the other professors who teach this class offer as much supplementary insight into the period and material, so I'd suggest playing it safe and taking it with Professor Crane (who also happens to be one of the warmest/friendliest professors on campus).   \nWorkload:\nThe workload is what you would expect from an English course at this level. But the material is so engaging it doesn't feel taxing. I was very moved by many of the texts and they served as a respite from my other classes.  \n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "October 22, 2016",
            "review_content": "\nThis was an excellent and interesting class. I took this class for a literature requirement at Barnard because I like medieval history and culture, but I don't think you need to have a prior interest in medieval literature in order to enjoy the class. All the texts are fun reads and don't take too long to go through. Professor Crane is great and she happily answers questions and encourages discussion of the readings. Her lectures are easy to follow and introduce historical and cultural context for the texts. She is really kind and supportive and was awesome to work with for a semester.\nWorkload:\nAround fifty to a hundred pages of reading per week, some in older forms of English. I did not find it difficult to keep up with the readings week to week because they were usually interesting stories or myths. We had three essays through the course of the semester and Professor Crane would read through our rough drafts to give us suggestions before grading them. Occasional short writing assignments in class to prepare for essay topics.\n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "September 02, 2016",
            "review_content": "\nEven though I am not an English major, this has so far been my favorite course at Columbia. I love medieval literature and culture and took this as a general education requirement for Barnard. Professor Crane was very kind and obviously loves the subject, and the readings she assigns are all interesting and relatively short, and if anything is unclear she will gladly provide answers in class, through email, or during office hours. She encourages participation in class but this can be in the form of questions about the readings or general comments or opinions. The texts are probably only compelling for fans of medieval art (we read Beowulf, King Arthur, etc.), but it is a great English class and Professor Crane is excellent.\nWorkload:\nModerate - short readings for each class and three essays total over the semester.\n"
        },
        {
            "course_name": "Medieval Literature",
            "review_date": "August 23, 2016",
            "review_content": "\nI really enjoyed this class. I found Professor Crane to be a dynamic lecturer, who impressively related much of what we were reading to contemporary thinkers like Foucault. I found her to be deeply caring toward her students and also the subject matter. She was a professor who actually wanted her students to succeed in her class, and most importantly put the work in herself to make that happen. For all the essays she had an excellent system for students to turn in the paper on a reasonable time schedule that worked for them, and was very active in helping students meet with her on their topics. \nNot only that, she was always clear in her expectations for the papers, and they were always fair and fun. Furthermore, in class she encouraged lots of participation, and was incredibly thoughtful in her responses to students. She be clear when someone was misguided, but kindly corrected the student and even found ideas/logics within their comments to rift on. She was the opposite of a typically cocky, \"expert\" professor, and even though she had more historic context on the era, always guided us with the goal not of forcing her extensive knowledge on us, but sharing and helping the class come to a consensus. A joy!\nWorkload:\nNot bad, very fair. 3 papers, no tests, good amounts of readings.\n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "August 23, 2016",
            "review_content": "\nThis class was a great experience!  Professor Crane was engaging and clearly interested in the subject matter, which was itself also quite interesting.  There was a nice balance of in-class discussion and lecture.  Professor Crane was always very attentive to students and receptive of their comments.  The additional activites, such  as manuscript reading, Middle English practice, and the trip to the Rare Books and Manuscripts Library, were also very engaging and connected well to the subject matter.  She gave great feedback and comments on the papers as well.  Really enjoyed it!\nWorkload:\nNot too bad.  No more than 25 pages for a class, though a lot of it is in Middle English, which is slow reading.  Three papers due throughout the semester, 5 pages, 7 pages, and 10 pages long each.\n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "August 23, 2016",
            "review_content": "\nI loved this class. Learning about the English literary tradition seemed essential for me as a writer (and erstwhile, aspiring academic), but I was worried it might be a little dull. Fortunately, Professor Crane really breathed life into the lectures and and thoroughly immersed us in the material. I ended up finding myself incredibly moved by the texts as a result. Moreover, her Steven Pinker-like grasp of style/grammar was invaluable for--I'm almost certain--everyone. She would address common mistakes made in papers and it was clear that she was filling in gaps that had obviously been neglected by countless professors/courses... Anyone with even the most remote interest in English literature HAS to take this class. And anyone who wants to further develop their academic writing would do well to take ANY class offered by her.    \n\nWorkload:\nReasonable/manageable. (I.e., what you would expect from a literature course.)  \n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "May 17, 2015",
            "review_content": "\nI noticed there's a bad review for this professor and I don't know why! I was in her English to the 1500s class, and I really enjoyed it! She gave a good overview of some very interesting literature, with an easy to follow crash course on Middle English, and she went out of her way to guide us when it came to paper-writing. The discussions were insightful as well, and I have used the basic knowledge of texts I learned in this class for many later courses :)\nWorkload:\nThe class had an average amount of reading for an English course, with manageable paper assignments.The only worry might be reading in Middle English, but we went over the hard-to-follow parts in class, and she made sure we could all follow the basic plot of each piece :)\n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "January 04, 2009",
            "review_content": "\nIf, like me, you've chosen to major in English because you like reading books, not having to come to class, not having to go to an optional discussion section, not taking tests, and writing papers on open-ended topics that stimulate rather than quash creativity and encourage novel, iconoclastic thoughts over regimented regurgitation, then don't take this class.  Back in elementary school, I felt that nothing good had been written prior to 1990; in middle school, it was 1950; in high school, it was 1900; now, it's 1800, and nothing on Susan Crane's syllabus - which encompassed the usual medieval standards of Beowulf and Sir Gawain, through Chaucer and Malory - convinced me otherwise.  This is to say nothing of Susan Crane's lectures.  The word \"professorial\" - with all its valences of superiority, didacticism, inarticulateness, as well as donnishness, monotony, and absentmindedness - perfectly encapsulates her style; I bet she's really quite the dullard at dinner parties, and her anecdotes about going to dinner parties and the like - carefully sprinkled over the course of the semester so as to give off the faintest semblance of humanity and string us along - would seem to indicate exactly that.\nOf course, by teaching what she does in the first place, Crane's put herself in a bit of a catch-22: on one hand, she should love what she teaches, but on the other hand, it would be ridiculous to do so.  As the semester progressed she seemed to vacillate between the two extremes: her ambivalence ultimately said, like the Milton moron in Animal House, that she cared about her subject just because, and that I should do the same.  I didn't bat an eye when she assigned a paper, but a rejection of my original thesis - after I'd already written it - and a horrible grade replete with exhaustive commentary on subjects I couldn't have hoped to cover in five to seven pages was a sign of things to come.  \nI skipped out on the midterm by sitting through soporific sections led by a TA who'd already had all the life sucked out of her, but copies distributed the day after proved conclusively that the only material tested was that covered in lecture.  Gee, I wish I had known this before I decided to skip out on half of them on account of the extreme boredom.  This tacit coercion emblematized what the class was about, and by the time the second paper and final rolled around, I was ready for them.  But I still got nothing out of them but a vaguely disappointing grade, a few snippets of literary theory, and the dim outline of a \"professorial\" character to be filled in when I actually write something that people might want to read outside academia someday.\nI stayed in this class because I wanted to fulfill my pre-1800 requirement, and because the other CULPA reviews promised better literature, optional attendance, easy tests, and enjoyable papers.  Don't make the same mistake as me.\nWorkload:\nTrivial but unpleasant.\n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "April 23, 2008",
            "review_content": "\nI'm very interested in Medieval Literature, and I found that Professor Crane's class only made me love the topic more.  Crane is extremely engaging and interesting as a professor.  The reading aren't too difficult, and she's very open to student ideas and discussion.  Go to class, though, as her midterms and finals are based on her lectures.  I found her to be an extremely fair grader, and really enjoyed listening to her comments in class.  I would highly recommend taking a class with her.\nWorkload:\n2 papers (5-7ish pages each), a midterm and a final (quote explications and definitions)\n"
        },
        {
            "course_name": "Medieval Literature",
            "review_date": "May 06, 2007",
            "review_content": "\nI am a big fan of Medieval literature (didn't even take this class to fulfill a requirement), but Professor Crane is one of the most disappointing professor I have had in my 4 years at Columbia.  She's not a stupid woman, but she is certainly not one of Columbia's finest (and there are some very excellent professors in the English Department here).  She's very nice and friendly.  She reminded me of a kindergarten teacher, which is great, except we're not in kindergarten. She gives very topical lectures, which leave much wanting, and provide little illumination of the many interesting texts.  She tries to familiarize you with Medieval culture, but all you really get are fragmented ideas and less than insightful discussions on the texts.  There is a required discussion section that they don't tell you about until you get to the class, too (it's not one that you register for).  The discussion sections are inane.  The TA was nice, but I thought the sections were a waste of time - we never worked on reading Middle English.  Sometimes we had paper workshops, which is good if you're a freshman, I guess - but isn't University Writing supposed to cover that?  We're in college.\nThere are far better ways to fulfill the pre-1600 requirement for the English majors, and far better courses on Chaucer and other Medieval writers.  This course is a waste of time.\nWorkload:\nTwo papers (25% each), a midterm (25%), and a final (25%).  You need to go to class if you want to do well on the exams - another reason I hated the class - the lectures are unbearably boring, but you have to be there. \n"
        },
        {
            "course_name": "Literature of the Medieval Court",
            "review_date": "January 22, 2007",
            "review_content": "\nA good class.\nProf. Crane  chose interesting readings.  The class was supposed to be about performance in the Medieval court Lit.  I was hard pressed to see the linkage in some of the material chosen.\nThere were 2 papers for the class, both of your own choosing and very easy to research and graded.  \nOverall Prof. Crane was available for questions, she was in control and had interesting topics for discussion.\n\nWorkload:\naverage for a lit class. 50 pages or so a week\n"
        },
        {
            "course_name": "Chaucer and His Contemporaries",
            "review_date": "June 27, 2006",
            "review_content": "\nI thought the class was fantastic.  I was not a fan of Chaucer in high school, but Susan Crane explores the text in a manner that is just fascinating.  I was impressed on the first day by her lecture and even though reading middle english takes a couple weeks to get down--it is worth it.  Just paying attention during class and taking decent notes can pretty much get you a good grade.  \nThis class is lecture style--with questions permitted--and very valuable.\n\nWorkload:\nThe class is actually pretty easy.  For the two papers, she supplies plenty of interesting topics and the midterm and final is pretty easy as well.  She gives a list of words/topics to know (which you should) and if you can write maybe three points per topic or a simple definition--you get full credit.  You should know the texts very well, but this isn't hard if you do the reading and pay attention during class.  \n"
        },
        {
            "course_name": "Chaucer and His Contemporaries",
            "review_date": "May 17, 2006",
            "review_content": "\nI am no fan of anything written before modern English but this class was fun. Dr. Crane really appreciates class participation and makes it known. She brings out all sorts of little nuances in the works and gets you to understand a lot of interesting gender, class, religious,  national and political issues connected with the literature. \nI think her tests expect you to know things in a way that you are not expecting so everybody underperformed on the mid term and she curved it. She gives you a list of terms that will be on the test but what she doesn't tell you before hand is that she really wants you to know those poems inside out so that you are really fluent with the way those terms work in the story. I don't see how anyone not already fluent in Chaucer et al. can do well without attending lecture. This is not a class to skip. \nThe final was easier because we had been exposed to her testing style.  Read everything and even though they tell you not to read it in translation, if you need to pick up a translation do so -- half the fun of reading these works is lost when you start taking 30 minutes to get through one stanza and you have other classes waiting. \nShe'll go over the Middle English in class anyway as she tries to get you to be able to read with the correct pronunciation and understanding.  \nOverall Dr. Crane has a good handle on the fact that this is an entry level class and while she will cite other authors to consult for further study, she discusses the works and their complexities for the beginner. Her paper grading is fair and she will read a 1st draft for you and give you feedback so you can really excel. \nWorkload:\n2 exams and 2 papers\n"
        },
        {
            "course_name": "Chaucer and His Contemporaries",
            "review_date": "May 14, 2006",
            "review_content": "\nWhile Prof. Crane is a good lecturer, she does not have much interaction with the majority of the class. She knows a few people from previous classes and she obviously likes them immensely. She doesn't respond to comments during class but rather just says \"hmm\" or \"interesting.\" If you want to do the reading and go to class and listen to a lecture, this class if for you. If you want to get a lot out of it, don't pick a teacker who obviously plays favorites. The TA did a lot of the grading so Prof. Crane was pretty out of touch with the students\nWorkload:\nTwo papers, two midterms. No final. Difficult grader. Most people got C's on the midterms and B's on the essays, with a final grade of something in the B range.\n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "November 14, 2004",
            "review_content": "\nI felt completely differently about this class than the previous reviewer. Prof. Crane usually had only one or two things to say about the texts, and then she would belabor the point to fill up the class time. She tried to make the lecture dission based, but she usually couldn't answer students' questions and was sometimes even left bewildered when they corrected her.  She didn't seem to know how to steer the discussion in interesting directions, so the class ended up with a very surface analysis of almost every text.\nWorkload:\nNot too heavy.  The reading load is reasonable. Short papers, midterm, final, and some short answer homework questions.\n"
        },
        {
            "course_name": "English Literature to 1500",
            "review_date": "February 17, 2004",
            "review_content": "\nI was very pleasantly surprised by this class. I took it solely to fill the pre-1800s requirement and found it not only un-painful but enjoyable. While I probably would have been bored by the material if I read it on my own, professor Crane inspired me to look for the threads of our own culture within the values expressed in the literature of the past, thus making the material interesting.  She is an animated lecturer who clearly loves the material she is discussing. She both gives well-planned lectures and allows moments for feedback from the students. The work is distributed throughout the semester so you always have a pretty good idea of where you stand. She also does her best to allow creativity in class and written assignments, ranging from performing plays, to writing poetry. Be wary, however, of doing assignments in writing styles (such as iambic pentameter) that you have not used before; you will be graded on form as well as content. \nWorkload:\nAverage. 2 papers, 3 quizzes, mid-term and a final (both reasonable and non-cumulative) \n"
        }
    ]
}