{
    "prof_info": [
        {
            "prof_name": "Irena Penev",
            "prof_id": 5495,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "May 01, 2012",
            "review_content": "\nTo be honest, Irena Penev really gets underneath my skin. She constantly talks about how she has a \"beef\" with our Calculus textbook and wants us to do things HER way even if it's more convoluted and complicated. She will constantly answer questions with \"look in your notes\" instead of actually clarifying your confusion. There was one instance where she presented HER way of doing a problem which was way more complicated than the book's. When someone asked if she could explain the other way she simply said \"you can read that on your own.\" The whole point of her being an instructor is to TEACH us the material and answer our questions, not tell us to read the material in the book. I keep wanting to tell her that she should do her job by explaining everything in the book. \nShe also takes off an enormous amount of points for careless errors. Randomly forgetting to carry over a sign or do a square root may lose you a quarter of the points for a problem. Yes, her tests and homeworks are easy, but if you really want to enjoy the math (I am considering a math major) and understand different ways to do the same problem I would suggest taking another professor's section. \nThat said, she seems really nice as a person and is constantly smiling at her students. She holds office hours and additional problem solving sessions where you can ask about homework or practice problems that she has assigned. I think she's just very young (being a graduate student) and doesn't quite yet know exactly how to teach. \nWorkload:\nLight homework assignments, the first test was on the easier side but on the second the average was 40%. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 23, 2011",
            "review_content": "\nI really looooved this class! I admit, I have taken a calculus class before, but even to those who are new to the topic, Penev does a great job at explaining the material. I think she is a graduate student and has an accent, but it's not very heavy. I was still able to understand her. Also, she assigns light problem sets that shouldn't take more than an hour to complete. Most of these sets are like 5 to 6 questions long. \nHer exams are also fair. She does not give out complicated questions, and sometimes throws in an extra credit question. I've talked to friends with other calculus 1 teachers and seen their exams, they all seem much harder. \nAlso, the main reason why I picked this class was because it's very small compared to all the other calculus classes. Most of the other lectures/professors have classes with about 60-120 students, but Penev's class is only 30 students! She does have a low voice so you might have a hard time hearing her, but you can move up if you want. Also, the small class environment allows people to ask questions freely. She seems to be a little socially awkward but I find it amusing. I definitely recommend her. \nWorkload:\n2 exams\n1 final\n11 HW (lowest dropped)\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 06, 2011",
            "review_content": "\nI had this class at 6:10 and found myself more focused on how much I wanted food than on Calculus. That said, Penev is a genius. Very, very, very quirky, but a genius. She can explain any question you have in a way you'll understand. \nHer midterms were also really, really easy if you knew what you were doing, and the homework is a good example of what will be on the midterm. \nClass is boring though, and the extra two minutes she always tacks onto the end of class are the most painful two minutes of the day.\nStill, good teacher. Worth taking. Don't be stupid. \nWorkload:\ntwo easy midterms, final, weekly homework around 10 problems at the most\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "October 30, 2010",
            "review_content": "\nOdd but brilliant and a fairly good teacher. This was a tough subject matter to teach in 6weeks, but Irena manged to get most points across. Proof intensive, so make sure you have time to absorb such ideas (unless such things are not an issue for you). Irena was always there after class to go over the points of the class. However sometimes her points were not so helpful as \"look at it harder\" doesn't always help. Nevertheless I found her willingness to go over the problems and each step of a proof to be helpful. \nWorkload:\nHomework once a week two exams, not too bad and she's nice with the curve. Learn to love proofs--it will help--on the other hand the computational aspect of this class is easy.\n"
        }
    ]
}