{
    "prof_info": [
        {
            "prof_name": "Robert Melville",
            "prof_id": 2561,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Electronic Circuits",
            "review_date": "May 25, 2005",
            "review_content": "\nA demanding class with an intensive workload (especially if you also consider the associated lab class). Melville makes you really work for the 3.5+1 points. He's a no-nonsense guy who is kind of high strung and talks a mile-a-minute, but is typically well prepared for class. He places a strong emphasis on practicality over theory and often has you approach problems from the perspective of a professional circuit designer, as opposed to a theorist. After getting through the easy stuff (op-amps and diodes), the crux of the class covers transistors--MOSFETs and BJTs and their different models. The sometimes weekly, sometimes biweekly homework assignments are pretty difficult and are always problems towards the end of the chapter without answers in the back to check against.\nThe class has two midterms and a final, along with the homework. The exams, unfortunately, are not similar to the textbook problems. They are exceedingly difficult with means in the 50s and 60s, consisting of a couple of involved problems which he develops on his own. He even includes these true/false questions focused on data-sheet characteristics of devices and their prices--personally, I found that to be a little over the top. You're allowed a full page of notes for each exam, which is absolutely necessary. He keeps saying that the best way to prepare for the tests are to look over the homework. Realistically, though, the exam problems are so much more difficult than homework questions (and are often design questions), the work done in the lab is often the best preparation for the type of problems you will see on the test.\nThere's a very generous curve at the end of the year when he does grades, but you'll have to work your ass off during the semester. He also covers material outside of the book and even had the class write a computer program to simulate circuits.\nWorkload:\n2 midterms (25% each), Homeworks (20%), Final (30%)\n"
        }
    ]
}