{
    "prof_info": [
        {
            "prof_name": "Qazi Hai",
            "prof_id": 1711,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Chem lab 1500",
            "review_date": "May 14, 2004",
            "review_content": "\nQazi is amazing. I ended up taking this course on Saturday mornings, and aside from the obvious drawbacks, it was a fantastic class. We didn't have a TA, we had our own lecture and Qazi in the lab the whole time. Qazi is so helpful, funny, caring, and he lets you know what's important and what isn't. I learned far more from this class than I did from Valentini, especially about acids/bases and kinetics. \nAdvice: beware of the quizzes, they will either make or break your grade. Once you figure out how to do the lab report the way he wants, that's the easy part. It's remembering all the little details for the quiz that separates the B's from the A's in this class. Also, try to take this class spring semester, it really illuminates the 2nd semester lecture material.\nWorkload:\n6-10 hours per lab report, and 1/2 hour weekly to study for the quiz.\n"
        },
        {
            "course_name": "Chem 1500 (Night Lab)",
            "review_date": "April 14, 2004",
            "review_content": "\nDon't believe what everyone else had said about Qazi being a lab nazi, Qazi is probably the best thing the chemistry department has going for it. I will not lie to you guys, he is a hardass, his quizzes are hard, and his accent (at first) is hard to decipher, but the man truly does care about his students and if you go to him for help, he will help you because he loves his students. Qazi approached me on two occassions before lecture and asked how the lecture was going for me and whether I felt he was doing a good job teaching. And if you see him while he's riding home on the 3 train, he actually says hello to you. If you pay attention in the lab lecture you will definitely learn something about chemistry because he teaches some finer points about say kinetics or colligative properties that were not addressed at all by Professor Valentini in my chem lecture. \nBe warned though, you have to study for the quizzes. Read the lab manual a couple of times, memorize definitions, formulas and do the practice problems and look at the solutions posted on the website. I cannot stress this enough because Qazi likes asking challenging questions and will pick out the tiniest details out of the lab manual and make a question out of it. But I didn't hate him for screwing me over a couple of times because I was lazy and didn't prepare for the exams because Qazi is awesome. \nWorkload:\nInsane: About 2 to 4 hours study time for 9 quizzes, 10+ hours on lab reports (they take forever) and at least 1 to 2 hours pre - lab preparation. \n"
        },
        {
            "course_name": "Chem Lab",
            "review_date": "January 20, 2004",
            "review_content": "\nQazi is a lab nazi, no kidding, he yells and shouts at everyone and his restrictions are just about everything including sniffing breathing and going to the bathroom, better pick another lab secion if you could, but it seems that he is the dictator of the whole undergrad lab.\n"
        },
        {
            "course_name": "Chem Lab",
            "review_date": "January 19, 2004",
            "review_content": "\nQazi is the best.  Not only is his accent captivating, but he also has fabulous glasses (think Terik Aziz's glasses circa 1983).  As for the course material, the lab manual is horribly written and always contains many mistakes, omissions, and inaccuracies.  For this reason, become very good friends with Dr. Qazi Hai.  He'll help you out whenever.  Just go to his office.  The dude will help you.\nWorkload:\nSome of the labs take hours to write up, but if you get stuck, don't despair!  Just go and ask Qazi Hai for help.\n"
        },
        {
            "course_name": "Chem Lab",
            "review_date": "January 08, 2004",
            "review_content": "\njust the coolest guy you could ever want as a professor. just his accent is tons of fun to listen to. you will hate the class when you take it, but you'll look back on the class and say how much you loved qazi\n"
        },
        {
            "course_name": "General Chemistry Lab",
            "review_date": "December 16, 2003",
            "review_content": "\nIf chem lab is a requirement for you, then definitely take it with Qazi.  At first, you won't understand him, because of his accent, but as soon as you get past that and can understand him, he's a great teacher.  He seems harsh at first, but he's actually warm, understanding, and reasonable.  Extremely helpful during office hours.\nWorkload:\nExtremely hard and there's a lot of it.  This was definitely the class I did the most homework for, the write-ups are really hard, and you have to go to his office hours.\n"
        },
        {
            "course_name": "Chem Lab C1500 Lecture",
            "review_date": "September 02, 2003",
            "review_content": "\nWhile it can be very hard to understand this professor in the beginning, once you get used to the way he speaks things get better.  Once you get past the intimidation caused by his sharp speaking you realize that he truly cares whether his students are learning or not.  If he asks you if you understand something, it's not to yell at you, it's to teach it to you better.  Ask him any questions and he'll gladly explain to you the answers.  As far as TA's go, they vary a lot.  I had a young english-speaking grad student who was fabulous.\nWorkload:\nThe course is a lot of work, but it can be enjoyable, especially if you're into chemistry and working in labs.  Having to write out the lab procedure before class can be very tedious, and the discussion questions are often unrelated to the lab or about specific questions.  But there's a curve and if you do all the lab reports thoroughly it shouldn't be too difficulty.  There's a quiz each week but most students don't study for it so if you even glance at the study questions at the end of the lab you'll be ahead of the game and on top of the curve.\n"
        },
        {
            "course_name": "G-Chem Lab Lecture",
            "review_date": "August 18, 2003",
            "review_content": "\nThe man just cannot speak English.  He tries to communicate and give his lecture, but it is a struggle.  Eventually, I just stopped going, unless I knew a quiz was being given.  Try to take the daytime lab, so you can avoid Qazi and avoid all the Post-Bacs who have nothing better to do than spend 25 hours a week on their lab reports.  \nWorkload:\nQuiz that requires some studying, and Lab reports are pretty tedious--long but not too difficult.  DO the work, get the A and get outta there\n"
        }
    ]
}