{
    "prof_info": [
        {
            "prof_name": "Yvonne Zivkovic",
            "prof_id": 9645,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 25, 2014",
            "review_content": "\nI had Yvonne for both semesters of Lit Hum - it was her first year teaching, and it did show. My experience in her class was mediocre -- however, to be fair, the time and location of the class were both unideal (6:10 - 8pm, in an odd and smelly room in Hartley). I felt like Yvonne was certainly well-read, intelligent, and able to discern good ideas (in essays, class discussion comments, etc) from poor ones. I had faith in her grading, which was always very fair and well-thought out. Nevertheless, the classroom experience was far from enlightening, and I was frustrated for not gaining much from the class. There were only a few people who spoke up often, and they ended up running the discussion at times. Yvonne made attempts at increasing participation by doing participation quizzes (which were obviously effective at getting people to talk, but also felt sort of contrived), and doing group work often (which I did NOT enjoy... because usually people had not read the texts, and were not motivated to be productive), but ultimately it felt like a slog. Overall she didn't really inspire us to become interested in Lit Hum, which is a shame.  \nThat being said, Yvonne was a responsible instructor and prepared us well for the final, and we did end up covering all the major ideas and themes from the texts. She also offered a lot of extra credit assignments, including out-of-class movie nights, which was quite nice and helpful. Hopefully in the future she will improve and have more command and control over the class, which I think she will.\nWorkload:\n2 papers per semester, weekly Courseworks postings (which for the majority of the year I thought were graded on quality of content, but then I found out that you get a check as long as you posted something in the word range that was not just babble...), standard Lit Hum reading that goes by the syllabus. As long as you make an attempt to appear intelligent in class, write the papers diligently, and do as much of the readings as you can, then you can do well in her class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 12, 2014",
            "review_content": "\nI disagree with the previous review of Yvonne. I thought Yvonne was an excellent Lit Hum teacher. She ensured that every essential passage, theme, character and plot point in each of the readings was covered thoroughly, especially in her favorites like Medea, and when I took the final it was clear that she taught the readings in a way that we would be prepared. In fact, in the spring, she based our essay assignments on the essay sections of the final to give us practice. As the reviewer said, class was heavily discussion based, and Yvonne usually just worked to steer us in the right direction. This, however, is not incompetence, but the way literature classes are supposed to work. It's a seminar, not a discussion. By ensuring everybody participated (she even gave \"participation quizzes\" once a semester in which everybody had to speak 10 times) she ensured that nobody could sleep through class, bomb their participation grade and have everyone practice thinking about the readings in preparation for writing the papers. The weekly required courseworks postings did the same thing. One thing that was also surprisingly effective was the large amount of group work, in which she would assign longer passages to groups, have us discuss them for a while, and then regroup and discuss them as a whole class. This actually made us cover more ground than we would have if we'd gone through each passage as a class because the discussion was prepared and smoother. She is indeed a very nice person, who made sure we could schedule movie nights and extracurriculars each semester. The time slot (night) and the room (Hartley) were awful, but if she gets a better timeslot I think you couldn't do better, especially because we were her first class and she now has experience and evaluations from both semesters, \nWorkload:\nReadings follow the syllabus, weekly courseworks posting, short paper, long paper, midterm and final. Pop and scheduled quizzes of different formats\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 26, 2014",
            "review_content": "\nI had Yvonne for Lit Hum in the fall, and promptly switched out by spring.  Yvonne was easily one of the worst literature teachers I have ever had.  It was probably her first time ever teaching, so I do feel bad being this harsh, but I really felt I wasted a lot of Lit Hum's first semester.  Our discussions never really elevated above: \"So why do you think this character did that.. [student responds]... cool, what do you think [points to another student].\"  I went through the entire first semester with her, and I could not tell you her opinions on anything.  The class felt meandering and never really resolved to learn or discover anything, and it made Lit Hum really feel too easy.  I was able to do very well in the class without killing myself (doing all the reading).   She did try to do a few fun things in class, such as a trial or having us bring in some piece of media that reflected some themes in the works we read, but they could feel contrived and never came to any conclusions.  I switched into a silver nugget second semester, and it blew me away how different the class was.  I felt I learned more in the first week of my new class than all of first semester.  Granted, perhaps simply as a function of Lit Hum, there is a certain sense of pride when studying for the final and you really feel like you have become familiar with a good bunch of these great works.  All in all, I didn't feel like I got a lot out of this class, but I know some others did, and I do have to say that she is a very nice woman, and she's very understanding.  Hopefully, she'll get better with time, and perhaps she was more engaged with the modern works of the spring.\nWorkload:\nWeekly short posts on Courseworks, Normal Lit Hum reading, 2 essays, very easy midterm, and standard final.\n"
        }
    ]
}