{
    "prof_info": [
        {
            "prof_name": "Francisca Aguilo Mora",
            "prof_id": 13586,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 07, 2020",
            "review_content": "\nWow. Just wow. How does she not have a gold start on CULPA? She should. Most enjoyable class/professor I have had at any school I've been to. She gets to know students on a personal level and makes learning the language fun. Online is obviously less enjoyable, but she adapted well by having very clear instructions and utilizing the break out rooms. Break out rooms can be hit or miss, but the way she holds the class makes everyone want to participate. We had a blast. AND it was at 8:40, so the odds were not in her favor!\nWorkload:\nMANAGEABLE \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "August 08, 2018",
            "review_content": "\nProfessor Aguilo Mora was the best spanish teacher I've ever had, or could have dreamed of having. She is legitimately gifted at using real world material to incorporate advanced grammatical concepts while increasing your general vocabulary without really noticing all that much. Rather than just arbitrarily studying grammar, she's hand picked perfect topics of discussion that naturally  integrate the grammar concepts, in a way that makes what would have been challenging not so challenging after all. She's amazing. She's also willing to work with you where you're at. She's compassionate, and extremely professional in the process. I wish I would take a class with her for the rest of my life. My spanish is a bazillion times better than its ever been. \nWorkload:\nHomework every day. Without question, always homework. Sometimes average, sometimes a lot. Never anything to blow through, because the homework is very integrated into the quizzes and tests throughout the semester. So, if you do the homework, she essentially rewards you by making the unit tests based on the homework--the homework is basically studying for the test. And she really wants her students to do well, so if you listen closely to what she says, you will hear her tell you how to succeed on the test--even as she's passing it out. \nThe final exam was really hard. I will say that. But all in all if you go to class and do your homework, you will succeed. It's a good amount of work, but it's worth doing. \n"
        }
    ]
}