{
    "prof_info": [
        {
            "prof_name": "Abigail Manock",
            "prof_id": 6518,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Basic Drawing",
            "review_date": "April 14, 2010",
            "review_content": "\nYour experience in this class really depends on what you are looking for in an art class.\nIf you are looking for a disciplined, systematic class to help you master the basics, then you may be disappointed taking drawing with Abby. Same goes for anyone who expects the typical line->negative space->perspective->shading-> figure progression that normally accompanies a drawing class. You will not get lectures on theory or drilling of technique. While we did cover most of the normal elements discussed in a drawing class, it was done in a non-systematic, slightly disorganized way. Several of my classmates expressed a sneaking suspicion (despite having taught the class before) that she was making everything up as she went along.\nThese above qualities, however, are not necessarily negatives. Her sometimes-unconventional class activities and homework assignments were often quite entertaining (sample assignments include drawing \"the worst drawing ever,\" sketching a storyboard to an imagined music video for a song of our choice, artistic responses to a selection of youtube videos, producing abstractions of classic paintings, etc). On the other hand, there were also quite a few in-class activities that had us shaking our heads in mild confusion. We had \"field trips\" where we drew outside, various places on campus, and the MoMA. The class environment itself was relatively friendly and laid-back, and the \"critiques\" very rarely involved criticism but rather focused on commentary. \nI found Abby to be incredibly entertaining and endearing (which makes it hard for me to write anything negative about her). She often had the class laughing with her funny stories, unconventional ideas and almost larger-than-life persona. It is obvious that her personal style of art is more focused on creative expression and process rather than painstaking realism, but she was generally accepting of students' individual styles. While absolutely not a pushover, was generally receptive to student ideas and suggestions regarding future assignments and class progression.\nI personally enjoyed the class very much, but take that with a grain of salt as I suspect that some others in the class had differing opinions. So really, it all depends on your outlook/expectations.\nWorkload:\nBiweekly homework that generally takes 2-4 hours, depending on thorough you choose to be. A personal sketchbook which we work on in our time and fill however we choose. Final project of our own choosing for which we are given almost complete freedom as to topic and style.\n"
        }
    ]
}