{
    "prof_info": [
        {
            "prof_name": "Armen Karayan",
            "prof_id": 932,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Modern Eastern Armenian",
            "review_date": "December 24, 2004",
            "review_content": "\nArmen is ok...not excellent but not terrible either. His lack of preparation for the class was sometimes frustrating, but what more does one expect from a grad student instructor in a language class with at most four people in it. There was very little practice in class, but he says he plans on talking much more in Armenian in the second semester...he also focuses a lot more on grammar in class, and if you can sit through 2 hours of explanation of case uses you'll be ok. Distractions help the time go by, however...\nWorkload:\none midterm, one final, some exercises from the book that he never collects, but if you want to learn the vocabulary you'll have to do it entirely on your own\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 24, 2002",
            "review_content": "\nI am one of those freaks who actually enjoys not only writing but also learning about grammar and even I hated this class. Armen knows next to nothing about grammar (grammatical questions were regularly answered by him reading aloud to us from the Bedford) and even less about logic. Our first assingment was devise a scientific experiment to define free will, and it pretty much went from there. Avoid him at all costs. He ruined a class that would have otherwise been enjoyable for me.\nWorkload:\naverage L&R; amount of essays, retarded assignments, and less work always equals a higher grade\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 22, 2002",
            "review_content": "\nWhoever let a bio-chem grad student teach L and R should be shot. Though he is well intentioned, his class comes off repetative, exceedingly boring, and non-instructional. I learned all the grammer I knew in eight grade again, but my writing only improved by the critiques of my lit hum prof. If you can, get away: say that practice times conflict, you have a core conflict, anything. Plus, the very, very few A's he handed out were a suprise to everyone in the class, including the recipiants, who never got anything above a b-. Confused? Yah, so were we.\nWorkload:\nTedious and pointless topics for 10 papers in 5 weeks, then even more worthless research papers (3) for the next 5 weeks.\n"
        }
    ]
}