{
    "prof_info": [
        {
            "prof_name": "Matt Vaz",
            "prof_id": 2828,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Crime and Policing",
            "review_date": "December 30, 2016",
            "review_content": "\nI am basically just writing this review to help Vaz get a gold nugget, because all these other reviews are spot on, Vaz is an incredible professor, lecturer, and person, and if you have the opportunity to take a class with him, you should absolutely do it.  \nThis particular class is incredibly relevant right now and has a fantastic syllabus. I learned a lot I hadn't learned before, and I also have a much better understanding now of things I had some understanding of before, but didn't really think about in an impactful way.  This course addresses issues such as the history of incarceration in America, race in America, immigration, and the treatment of vice in American history and the effect that these methods of treatment have had on modern American history.  Because the material of the course is so interesting, I actually really enjoyed doing the readings and writing the papers.  \nVaz is a phenomenal speaker, he is clearly brilliant, but is able to break down history into a very comfortable and understandable lecture.  He is candid and comfortable, and manages to facilitate real discussion in a ~100 person lecture.  I literally looked forward to going to his class, do yourself a favor and take it. \nWorkload:\nattendance/ participation - 25% (if you just show up to every class you get an A- in this category, and it is not hard to participate beyond being there!) \n2 ~8 page research papers, around 25% each \ntake home final - 25%\nvery fair and manageable amount of interesting reading, which he acknowledges most people will not do all of, but you do need to do some to reference in class and on the final, and it helps because he discusses important points and sends you questions to really focus on \n"
        },
        {
            "course_name": "Crime and Policing",
            "review_date": "May 09, 2016",
            "review_content": "\nProfessor Vaz is one of the best lecturers I've had at Columbia. He creates a coherent narrative through out the semester, situating his material both in the larger context of American political history and in current events. He presents central themes which he develops each class and then structures the final around. I came away with a much deeper and more nuanced understanding of race relations in America after this class, and would recommend it to anyone of any major. Professor Vaz is all around great - very funny and personable - which makes going to lectures all the better. \nWorkload:\nVery manageable - really interesting readings (journal articles + 4 books) which will be very relevant and useful for the final \n2 essays (25% each): 5-8 pages, gives you much liberty about what you want to write about, one is grounding a current even in a larger historical narrative and the other is a comparative essay (ie US race relations v. another country)\nAttendance/participation (25%) there is no discussion section, so you just have to show up to lecture and participate in discussion about the readings (gives designated time to do this)\nFinal (25%) - 4 short essays (take home) on themes from the class that he hints at mid semester; very straightforward - if you've been keeping up with the reading and going to class, these will be easy and also will leave you with a very good grasp on the material \n"
        },
        {
            "course_name": "Survey of American Civilization since the Civil War",
            "review_date": "April 29, 2016",
            "review_content": "\nProfessor Vaz is the kind of professor that makes college worthwhile. \nI sincerely believe that one would be hard-pressed to find a reviewer who'd say anything negative about him, unless they never showed up to class and in turn didn't do particularly well.\nI quite literally wrote down verbatim some of the things he said to us in class, they were THAT meaningful to me. I'm not a history major, but I had to take the survey class as a pre-req, and it's what inspired me to take America Since 1945. Going to class was truly a pleasure, I found myself angry when I had to miss it for whatever reason. \nAs a lecturer, Vaz is dynamic and charismatic. He has notes to look at, but he rarely refers to them. He has a seemingly endless amount of knowledge about Supreme Court cases, which may sound dry but I assure you, it's not at all. He could probably teach a history class structured around some of the most pivotal cases. This is knowledge I used in other classes, papers, and even in conversation. His lectures on American history covered abortion and housing discrimination in ways I never knew about. During the very last class of the semester, he commented on the Black Lives Matter movement. \nOutside of the classroom, Professor Vaz is incredibly approachable and supportive. Without any real incentive or necessity, he read and commented on my senior thesis. Because his classes are rather large, it's easy to go a semester without ever really engaging with him one-on-one - DO NOT LET THIS HAPPEN. It is so valuable to talk with him, whether or not you actually have something to go over. He's cool and incredibly wise.\nIf you are reading this review and considering whether or not to take his class, drop everything and take it. The only reason you shouldn't is if it conflicts with a mandatory course...so plan to take a class with him next semester. I've had a lot of professors while at BC/CC, and he ranks as one of the absolute best.\nWorkload:\nThere are 3 or so essays, each with associated reading. You can't get away with not doing ANY of the reading, because it's necessary for the papers, but I'd mentally separate class v. coursework. Essays are partially graded by TAs, and the topics are generously broad and often fun to write. One of my papers was on race in 1960s Oakland - I wrote it during spring break and it was still great. The workload doesn't even matter for his classes, his lectures make everything worthwhile. \n"
        },
        {
            "course_name": "Crime and Policing",
            "review_date": "April 28, 2016",
            "review_content": "\nMatt Vaz is totally deserving of a GOLD NUGGET. He has a deep understanding of the material and presents it in a very open way, as the topics are usually controversial or misrepresented by the media or something. He's a very engaging speaker has a great sense of humor. Totally take this class. \nSet up: Most days are lecture, often with videos and images. And some days are discussion days, these are the only days for which readings are assigned and the readings are interesting! Some are boring, but usually there's an acorn of substance. It's easy to participate, literally just raise your hand and BOOM. The TA's usually run the discussions and they get super engaged and open to opinions as well.\nOverall great, interesting class and definitely not a stress!\nWorkload:\n2 papers, I think the longest was like 10 and the first one was about 5-6\nTakes attendance, so that's a good way to get \"participation\"\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "January 17, 2006",
            "review_content": "\nThis man is so amazing. I was told to take his discussion section by a friend and I thank him to this day. Matt insisted that most of us were smarter than he was, but that is definately wrong. In the least aggressive or pompous way, Matt (or Matty as people call him) demonstrated his amazing breadth of knowledge--especially cultural and political (something at which K.J. was not so good). He is very encouraging to his students, whom he wants to see really excited about some aspect or the other of the City. He also has this uncanny way of connecting with us--maybe the age, maybe the kind of student rebelliousness he has, I don't know. He is a real fair grader in that if you get excited and do your part, he will do the same and all will be copasetic.\nWorkload:\nIt's K.J.'s... do the reading so Matty does not have to summarize it himself. It all works when BOTH sides are participating--don't take advantage of his \"understandingness\" because he deserves better!\n"
        }
    ]
}