{
    "prof_info": [
        {
            "prof_name": "Francoise Murail",
            "prof_id": 1056,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Ear Training III",
            "review_date": "May 05, 2009",
            "review_content": "\nOh Francoise, how I wish I could speak French so that I could actually understand you!\nThis class was a joke if you had perfect pitch, less so if you didn't.  But, in any case, the workload was minimal, and most of it could be done while waiting in the hallway for the classroom door to be unlocked.  Francoise was really nice but really difficult to understand; most of the \"mistakes\" made by students resulted from Francoise not clearly giving instructions for the assignment.  Other than that, though, the class is fun and pretty chill.\nWorkload:\nImaginary?\n"
        },
        {
            "course_name": "Ear Training III",
            "review_date": "January 08, 2009",
            "review_content": "\nFrancoise is a great musician, but a poor professor.  She very obviously knows her stuff, but her ability to communicate that knowledge is sorely lacking.  She'll get halfway through a concept and then suddenly get sidetracked...and then never return to the original idea.  Or she'll explain something, then forget that she's explained it and explain it again next class.  There's no real continuity.  I feel like I learned very little as a result.\nWorkload:\nVariable.  She has a habit of assigning things and then forgetting that she did so.  Generally, the assignment will take about 15 minutes and is easily completed right before class.  One midterm, one final, very charitable grading.  She offers extra credit and tells you what the E.C. question will be beforehand.\n"
        },
        {
            "course_name": "Ear Training IV",
            "review_date": "May 11, 2007",
            "review_content": "\nI arrived on Francoise's doorstep in the middle of first semester, a refugee from the horrible atmosphere effected by Professors Francisco Iovino (really boring) and Eric Sewell (really Darwinian).  Immediately I was seduced by her continental bon-vivant charms, transferred to ET III, and had such a great time for the remainder of the term that I registered for ET IV in the spring as well.  Learning in Francoise's class is pleasant, natural, and painless: merely by sitting in her room and doing the inane tasks of sight-singing and dictation that she assigns to you, you will osmote the knowledge and come out a better at the speciously defined field of \"Ear Training.\"  But I'm not really sure how much I actually learned, and I'm pretty sure I could have learned more -- an example of Francoise's frivolity is assigning weird modern music for sight-singing/dictation even after it was made abundantly clear that we needed several play-\nthroughs to do dictation of a simple, logical passage by Mozart.  It was fun, though.\nThe bottom line is: Ear Training through either IV or V is compulsory if you're a music major; you shouldn't be a music major here, but if you are, then take Francoise; also give serious thought to skipping out of ET I and II (an effortless process expedited by Francoise) because those classes are hell and III is not that much harder and even if it is you'll be brought up to speed by the innocuous midterm.  Francoise's favorite grades are A+ and A, which shows how enthusiastic yet delusional she is about her students' abilities.  But it's Ear Training, so who cares?\nWorkload:\nNothing tougher than, say, the questions the guy asks on Blue's Clues.  And you can always just turn the television off.\n"
        },
        {
            "course_name": "Ear Training III",
            "review_date": "April 11, 2004",
            "review_content": "\ni love Francoise. She's such a passionate teacher! She tries very hard to make the class entertaining (whether it's a success depends on your personal taste). \nshe's very linient and helpful. to me a good teacher is one who loves to teach and loves her students. and therefore i think she's a great teacher. the class may seem slow and \"a waste of time\".. but hey you get a credit relaxing\nWorkload:\nnone whatsoever, unless you really want to do it\n"
        },
        {
            "course_name": "Ear Training IV",
            "review_date": "September 24, 2003",
            "review_content": "\nI don't get how people could not like this woman.  She's so into the music that it's impossible not to get into it yourself.  Class was always entertaining, and you leave humming tunes you never thought you'd hum (like Stravinsky or Messiaen).  Class is amazing as long as your not tone-deaf.\nWorkload:\nwork?\n"
        },
        {
            "course_name": "Ear-Training",
            "review_date": "May 30, 2003",
            "review_content": "\nI've heard a lot of people say that Francoise's class is a waste of time, and they are totally wrong.  You may not see progress day by day (and you may feel like you aren't losing anything by skipping class), but you notice the difference at the end of the semester.  And that's what makes Francoise such a phenomenal teacher.  She makes really hard stuff seem incredibly easy.  Take her class.\nWorkload:\nSo, so light.  Don't worry at all.  But you will see that you've made serious progress without lifting a finger.\n"
        },
        {
            "course_name": "Ear Training III",
            "review_date": "May 07, 2003",
            "review_content": "\nI'm not sure what drugs the other reviewers are on (or the teacher, for that matter) but Francois is TERRIBLE!  She's the nicest woman, and very kooky , but I've never had such a bad teacher in my life!  This class is a complete waste of time\nWorkload:\nI managed to get away with doing no work whatsoever in this class\n"
        },
        {
            "course_name": "Ear-Training",
            "review_date": "May 07, 2003",
            "review_content": "\nI'm pretty sure every music major/minor/concentrate resents having to take four semesters of this silly 1-point class, but Francoise makes it a little easier on you.  You study insanely hard music (since when can we sing along with Debussy piano pieces?) but she makes it more enjoyable and fun than you'd expect.  She's a smart, kind, and mildly goofy person who makes you feel at ease in the classroom.  Take her; you won't regret it.\nWorkload:\nWork ... ?\n"
        },
        {
            "course_name": "Ear Training III",
            "review_date": "February 17, 2003",
            "review_content": "\nYou will love her.  She's fun, likes what she's doing, and like the students she works with.  You will develop your ear in this class, which is the point of it.\nIn other words, this is 2 hours a week of fun\nWorkload:\nWork?\n"
        },
        {
            "course_name": "Ear Training IV",
            "review_date": "January 20, 2003",
            "review_content": "\nThis class is like an absurdist play. Most of the time, it was bizarre enough to keep me somewhat entertained, but other times, it was just incredibly slow and frustrating. Francoise is a wonderful person but a horrendous teacher, incapable of gauging the level of her students. The class is easy as sin, but feels like a waste of time. Only take it if you must for the requirement.\nWorkload:\njust be nice to francoise and you're golden.\n"
        },
        {
            "course_name": "Ear Training V",
            "review_date": "December 15, 2002",
            "review_content": "\nDamn, this class is hard! Not because there's any work (there isn't), not because you won't get an A or A+ (you will), but because the music you'll sight-sing here is mind-warpingly difficult. And really, what more could you ask for than to learn so much and be challenged so rigorously with so little effort? Francoise is, without a doubt, one of the best professors in the department, and her inscrutable French accent and terrible vocabulary somehow enhance, rather than detract from, the experience. Take Ear Training with her whenever possible, and go all the way through the sequence; it's absolutely worth it!\nWorkload:\n2-3 exams (depending on how the class progresses) that are extremely difficult but graded very leniently.\n"
        },
        {
            "course_name": "Ear Training IV",
            "review_date": "April 30, 2002",
            "review_content": "\nI love Francoise! Never before have I met someone with so little command of English who managed to still get her points across so well. She's energetic and engaging with a great sense of humor. She loves her students and would bend over backwards for them. Best of all, the material is challenging, but the grading is super-easy, so you really learn, and bolster your GPA ever so slightly while you're at it. Well worth sitting through the first three semesters of ear training to get to her.\nWorkload:\nNOTHING.\n"
        },
        {
            "course_name": "Ear Training II",
            "review_date": "December 31, 1999",
            "review_content": "\nFrancoise is a very lively professor. She has a passion for what she teaches, as well as music, itself. This class seems very time-crunched (this is not Francoise's fault at all) since it meets for only 50 minutes, twice a week. It is definitely a difficult class if you do not have perfect pitch, and do not have a lot of experience with LISTENING exersizes (melodic dictations). All in all, Francoise's a great teacher. she'll definitely try and help you out as much as she is able to do so. If you are taking an ear training sequence, you'll probably get Francoise, anyway, since she is the only ET IV and V teacher.\nWorkload:\nAlmost nothing at all, unless you would like to practice the material on your own, to improve your ET skills. One midterm and one final, which she is VERY lenient on. Final grades are extremely generous, as well.\n"
        }
    ]
}