{
    "prof_info": [
        {
            "prof_name": "Rebecca Fan",
            "prof_id": 2037,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 16, 2006",
            "review_content": "\nOh man that last one is great. banging head against wall. \naffirmative. Plenty of people did that spring semester too. \nI do not see that she is teaching this semester. Which is good because she failed me for not correctly addressing musicology concepts in my final paper. Whatever, Im a rock royalty princess, and I wasnt going to take her bs, so I was kind of deserving it. \nWorkload:\neverything else is manageable except for the ridiculous field trips at 9pm on a school night to NYU and a big crap load of a paper not about music but about musicology.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 09, 2005",
            "review_content": "\nRebecca Fan either purposefully chose not to cover anything in the Music Hum Curriculum or is a little off.  I can look back on this class and honestly say that I learned nothing.  The first day of class she gave us a list of notable Western composers such as Wagner, Vivaldi, Mozart, etc. and asked us to write down the country of origin of each of these men.  So naturally, I assumed that during the semester we would learn about these composers.  Hell to the no!  She never mentioned their names again.  We spent about three weeks talking about rhythm, tone, meter, etc, moved on to talking about ethical issues concerning music, next organology, and now I'm not quite sure what we're doing because I find that this class provides perfect time to get other work done.  Every minute I spend in this class is torturous.  At the start of the semester, we had to read random articles and write responses.  However, now it has come to the point where everybody just discontinued writing the responses altogether.  I can't even begin to reveal to you the horror that is this class.  Personally, I sit in the back of the room where I can bang my head against the wall.  If you get into this class, don't be fooled by Rebecca Fan's smile the first day and her little list of composers; you need to get out.  Drop that class like it's hot.   I guarantee that slowly but surely every student in Rebecca Fan's class came to despise and dread it.  I have always been a huge fan of Christmas; it's my favorite holiday.  However, this year Christmas doesn't seem as special to me because I already experienced the best day of the year...It was when Rebecca Fan canceled class.  I will never forget that day.  Please get out of this class if you have the chance!  If you don't heed my advice and instead write me off as being melo-\ndramatic, it's ok...you'll pay.\nWorkload:\nLight.  Responses to articles for a few weeks until you decide to stop doing them.  Reading you'll do until Fan Fan assigns readings on Reserve at the Music Library in the 7th floor of Dodge.  Who has time to go to the Music Library to read an article that has nothing to do with nothing?   Two easy quizzes and a 10 page maximum final paper.  You have to attend a live performance, come up with some thesis, and write about it using what you have learned in the class.  Haha!    \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 24, 2005",
            "review_content": "\nWhat has been said by the other posters barely skim the surface of how bad and poorly run this class truly was.  I still have no idea what we were taught for the last 4 months, but one thing I know for sure, it had NOTHING to do with music..of any kind...least of all Western.  I found Rebecca Fan's approach insulting, condescending, idiotic and unproductive.  If she wanted to turn the students on about non-traditional music, even though most of us were already pretty aware and interested, but the only thing she succeeded in doing was turning every minute in the classroom unbearable for all of us.\nWorkload:\n2 presentations, 2 simple quizes and 1 final (10-15pg) paper that I'm still trying out what it was supposed to be\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 07, 2005",
            "review_content": "\nI would not suggest taking a Music Hum section with Rebecca Fan.  Actually, I would not suggest that Columbia allow her to continue teaching, because she is not a very good professor at all.  I agree with what is posted below and will reiterate that the class has nothing to do with WESTERN music at all.  Maybe she is not aware that CU offers a class on eastern music, but the only time she brought up western music was to mock it or as an example of western hegemony, which would be fine, I guess, if the class wasn't called \"Masterpieces of Western Music\".  If you mistakenly find yourself in this class and can't get out, remember that americans are bad, capitalism is bad, Paul Simon is a bad, bad man who should be punished, and only people who do not live in the states or europe are real musicians.  \nWorkload:\na 15 page paper that has to include an ABSTRACT.  don't ask why.  no one knows, least of all the professor.  lots of reading that makes no sense that nobody else will read, 2 tests \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 10, 2005",
            "review_content": "\nRebecca Fan is perhaps the worst instructor I have had in my lifetime.  At first I thought that the class would be rather fun and engaging because she seemed to have a well developed and different approach to the subject, but I quickly found that every moment in which I must interact with her would be painful and confusing.  Her paper instructions are unclear and when questioned about her requirements she reprimands you for not reading them.  She changes the syllabus at random, including class meeting times and locations so that we may attend public lectures which are rarely connected to the coursework  This presents a problem for anyone with other classes, a job, or other important responsibilites.  Better yet, while she shows no respect for students time, she is quite strict about lateness, meaning being 4 minutes late twice in the semester WILL be reflected in your final grade.  I agree with the poster below who mentioned that she speaks to college students as if they were 8, and will add that she does the same to adult GS students.  I would certainly not recommend this course to GS students unless they are full timers who live on campus, because Professor Fan seems to assume that all her students fit into this catagory even though she teaches one of the few sections offered in the evenings.  She also seems to play favorites, which is reflected in her attitude toward students in and out of class.  Which brings us to her final fault: the class does not focus on music or learning about music of the western tradition.  Actually, the class is totally without any real focus.  The ever changing syllabus is case in point, as is the fact that I cannot name one thing I've learned, exept what a Pakistani harp sounds like.  Really, that's it.  The course is less music hum than a poorly run anthropology class.  I would prefer and, possibly find more educational, lying in a ditch beside the Jersey Turnpike for three hours a week.\nWorkload:\nit seems like nothing at all until she suddenly wants to know every book and article you plan to use for your paper and then requires near constant contact.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 10, 2005",
            "review_content": "\nRebecca Fan is perhaps the worst instructor I have had in my lifetime.  At first I thought that the class would be rather fun and engaging because she seemed to have a well developed and different approach to the subject, but I quickly found that every moment in which I must interact with her would be painful and confusing.  Her paper instructions are unclear and when questioned about her requirements she reprimands you for not reading them.  She changes the syllabus at random, including class meeting times and locations so that we may attend public lectures which are rarely connected to the coursework  This presents a problem for anyone with other classes, a job, or other important responsibilites.  Better yet, while she shows no respect for students time, she is quite strict about lateness, meaning being 4 minutes late twice in the semester WILL be reflected in your final grade.  I agree with the poster below who mentioned that she speaks to college students as if they were 8, and will add that she does the same to adult GS students.  I would certainly not recommend this course to GS students unless they are full timers who live on campus, because Professor Fan seems to assume that all her students fit into this catagory even though she teaches one of the few sections offered in the evenings.  She also seems to play favorites, which is reflected in her attitude toward students in and out of class.  Which brings us to her final fault: the class does not focus on music or learning about music of the western tradition.  Actually, the class is totally without any real focus.  The ever changing syllabus is case in point, as is the fact that I cannot name one thing I've learned, exept what a Pakistani harp sounds like.  Really, that's it.  The course is less music hum than a poorly run anthropology class.  I would prefer and, possibly find more educational, lying in a ditch beside the Jersey Turnpike for three hours a week.\nWorkload:\nit seems like nothing at all until she suddenly wants to know every book and article you plan to use for your paper and then requires near constant contact.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 19, 2004",
            "review_content": "\nProfessor Fan is a really nice professor. Unfortunately, I wish she would be more specific with the subject material. She tends to be very iffy. Iffy meaning an answer in a class discussion could swing either way. And that discussion normally comes up in the exams, which isn't helpful because the answer in the class discussion wasn't specific. The material we've been discussing does in a way, relate to Western Music, but I don't know what the significance of the field trips are, for example, the trip to the MIDI place and to the Ethnomusicology Center. It's confusing because although I can see how the two centers relate to the course, I don't know what's going to be on the exam. It's okay if the exam question is going to be: what's a MIDI? But if it's going to be: what's a patial, then I'm going to be like, huh?\nI know this review will only make sense to the class who's been through this with me but the point is that if she can be more specific with what she wants from us, it will be really beneficial (to me at least). One good thing though was that Professor Fan had called in a choir group to demonstrate and explain parts of the course material at the beginning of the term (Josquin). That proved effective.\nA really flexible professor as well. Willing to compromise according to class consensus.\nWorkload:\n3 tests, 1 essay, attendance is crucial to the final grade\n"
        }
    ]
}