{
    "prof_info": [
        {
            "prof_name": "Jeremy Forster",
            "prof_id": 12740,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 25, 2015",
            "review_content": "\nJeremy Forster was a fantastic preceptor for CC, and I can see him working well for any type of student. If you're like me, and you're just in a philosophy course because it's a core requirement, Jeremy will really sell you on these texts. If you have a genuine interest in the field, Forster knows his stuff, and he can get into very nuanced discussions about the arguments that most of the class will enjoy.\nOne of the best parts of the class was that Jeremy really limited the amount of reading required. Instead of trying to digest a book per week, Jeremy selects chapters and excerpts that you will actually discuss in class, and they were often only 40 or so pages per week (although occasionally you had to read the whole book). The class was usually structured as 1/3rd Jeremy lecturing on the work, 1/3rd class discussion on the work, and 1/3rd class discussion on a concept that was related to the work but allowed everyone who had not actually read the works to particulate. He also gave us a ten-minute break to eat snacks in the middle. \nEach week you had to write a one-page response paper, although I forgot to do one or two and it didn't end up having an impact on my grade. The papers were also very straight-forward, and you could either write a fairly straight-forward paper on one of the prescribed topics or a more creative paper on the topic of your choice. The midterm and final were both fairly easy, with one of them taking place in class and one as a take-home. The excerpts on the exams were incredibly easy to identity, and the essay topics were taken straight from the class discussion. \nParticipate a lot, write good papers and you'll be fine!!\nWorkload:\nWeekly response paper, two 6-8 page papers, and midterm and final (one in-class, one take-home)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 13, 2013",
            "review_content": "\nGreat professor. I recommend him to anyone. He works extremely hard to have you understand exactly what he expect from you, as well as what each reading is about. He doesn't make you do pointless reading, but takes each book and cuts out reading that he believes isn't important. This allows all to do the reading, and makes discussion fluid and everyone gets involved. He is a fair grader. Not too hard, not too easy. He also has makes us do one page responses every week which is blessing because it makes you stay on top of the reading which doesn't leave you scrambling. Overall a good experience, with a professor that cares a lot, will make you care, but understand you take five other classes.\n\nWorkload:\nStandard CC reading with his recommending reading. two essays, one 5 pages, the other 5-9 pages. Midterm and Final very doable and fair. He gives you exactly what he is expecting and for essays he is available any time to look over it and help. Weekly 1 page response. \n"
        }
    ]
}