{
    "prof_info": [
        {
            "prof_name": "Michael Tippett",
            "prof_id": 12860,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "May 27, 2014",
            "review_content": "\nLECTURES: Boring, long, proof based. Hard to follow. Makes lots of mistakes in class but answers questions well.\nHOMEWORK: Mostly from the textbook. Two problem sets made by the professor--more difficult than textbook problems. Textbook problems not very indicative of exam questions. Each one for me took ~4 hours\nEXAMS: Two midterms one is ODE, second is Linear Algebra. Generally average is in the ~70% range. Linear Algebra is easier to study for since we had the problems he made for the psets. ODE is harder to study for since we only had overly easy textbook problems. Final is evenly distributed through topics--questions as vague and confusing as preceding quizzes. \nCURVE: Wow. I wanna make it clear that this is an opinion since I have no idea what other people got. The curve for me was awful. Did average on the quizzes and well on the homeworks and for some reason ended up with a not so hot grade... Also, I know this isn't unheard of but it is quite rare for a professor to fail a student... right? \ntl;dr: wasn't hell but I suggest you look for a different professor if you could\n\nWorkload:\nWeekly pset (20%)  (for me, that was about ~4 hrs per pset)\n2 Midterms (20% each)\nFinal (40%)\nHe said he put more weight on your final if that was to your benefit. \n\n"
        },
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "May 26, 2014",
            "review_content": "\nOverall, pretty good! The course was an introduction to differential equations and linear algebra. I have to say (possibly naively, seeing as I only just finished freshman year) that this was a very useful class. Critical material showed up in three of my other classes. I strongly recommend taking this as early as you can.\nFor the first half of the semester, we covered first-order differential equations in their many forms. These are very useful and showed up in my calc, physics, and EE classes, even during freshman year. The second half covered linear algebra and second order differential equations. I think most people (me included) felt that the first half was not that bad, but the second half got pretty trippy.\nThe textbook is not good. Advanced Engineering Mathematics. It is not helpful at all. Something iconic that I remembered was that on the first homework, it asked us to distinguish whether certain equations were linear or nonlinear. The definition of a nonlinear equation was: \"A nonlinear equation is one that is simply not linear.\" The definition of a linear equation wasn't given until the next chapter. It wasn't a very good definition either. And there was more stuff like that everywhere.\nSome of the linear algebra stuff was pretty weird and confusing. Just about everybody had trouble with it. To worsen the situation, the most confusing parts weren't in the textbook. I learned from a classmate that the stuff people had trouble with was pulled straight from a textbook listed on courseworks as recommended. He also told me that this textbook explained it clearly. To make matters even worse, some of the TAs didn't understand this part and couldn't help with it.\nNow, I am highlighting the negatives a lot. But this was a good course! We covered 1st order ODEs, linear algebra, and a little bit of 2nd order ODEs. 1st order ODEs took the most time. I think that Professor Tippett covered everything pretty well. The first few lectures of each major unit were a little confusing (the linear algebra one especially), but after you got the hang of it (the homeworks were helpful), it became a lot easier.\nProfessor Tippett is a very nice man. I had to reschedule a quiz because of a competition, and he was happy to help me do so. He's a very smiley guy, and I find him very funny, in a dry sort of way. He makes a lot of simple mistakes (like writing '+' instead of '-'), and he solves the questions (as in, he doesn't copy them from notes), so the errors get carried through. However, he invites people to correct him as soon as they see mistakes. And when they do, he apologizes and redoes the problem, continuing from where he messed up. He also takes questions well. If somebody asks about something they don't understand (even if it's from weeks back), he'll go over it on the board. I believe that he really does want students to learn. I do think that he teaches well. In my opinion, he is an exceptional professor.\nTl;dr:\nVery useful class. Bad textbook. One unit was very confusing (and was the main unit on one of the quizzes). Very nice, smiley, and helpful professor. \nWorkload:\nNot bad. One problem set each week, and they're pretty short.\n40% Final Exam (cumulative, but weighted towards latest units)\n40% Quizzes (3 were scheduled, but we only had two. I don't know how that was resolved.)\n20% Homework (lowest dropped)\nThe problems on the quizzes and final were a lot like the homeworks. The ODE stuff was easier on the quizzes and tests than on the homework. The linear algebra stuff was about the same difficulty.\n"
        },
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "April 04, 2014",
            "review_content": "\nI took Prof. Tippett for APMA E2101 - Intro. to Applied Math. Never have I before had a professor so bad that I felt the need to write a review. At the beginning Prof. Tippett was a decent professor even though he was prone to making mistakes while doing examples in class. However, for the first part of the semester when he was teaching ODEs, it was decent, but once we got into the Linear Algebra part of the course, he was dreadful and probably one of the worst professors I have ever had the displeasure of being taught by. \nIf you have to do the class, AVOID Tippett! It is the most painful experience I have ever been through. \nWorkload:\nA problem set a week, 2 midterms and a final.\n"
        }
    ]
}