{
    "prof_info": [
        {
            "prof_name": "Lingjun Hu",
            "prof_id": 3126,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Chinese",
            "review_date": "August 09, 2009",
            "review_content": "\nFantastic! I had for both Fall and Spring semesters. Spring semester was much better in terms of class size (7 students compared to 16 students Fall semester) so our Spring semester class had a lot more practice.\nHu Laoshi is an excellent teacher because she gets you to learn the stuff without you feeling stupid. If you don't understand something, she'll explain it and repeat it until you feel that you have mastered it. She explains everything well enough that you don't need to come to her office hours. But even at office hours she was very nice and helpful. I remember coming to her office hour for my final presentation. She spent 1 1/2 helping me selecting better words and using more sophisticated grammar points.\nThe class is conducted entirely in Chinese and if you speak English, she'll either make you buy the class something (some kind of food) for the next class. If you are late, you either have to sing a song at the next class of make food for everybody. So don't ever be late to her class.\nWe would think all third-year students would have gotten their tones down by now but the case was different for my class. None of the students \"mastered\" all the tones. I consider myself to be pretty good at Chinese until I got my tones corrected. But instead of penalizing us for not having mastered the tones, Hu Laoshi would spend the last five minutes of each class (this is more 2nd semester than the first) to make us read aloud the passages in the book. My tones improved significantly after this.\nThe class is discussion based. So you come to class to mostly discuss the lesson that you learned on your own. Grammar points are reviewed in class.\nIntroduction to simplified characters as well as literary Chinese (expressions/words that you'll find in newspapers and books).\nI learned a lot from this class and my writing, speaking, reading, and listening skills improved a whole lot. Third year Chinese is not easy but if you work hard (recommended 10hours/week) you will earn an A. What makes third-year hard is the nuances of Chinese languages. You'll learn when to use when to use one word as opposed to another word that has the same meaning in English (bu neng hui bi vs. bu neng bi mian; bian gu vs. shi gu). If you take it seriously, you'll learn a lot. And it's good that Hu Laoshi is teaching 3rd year as well because she is really good at explaining these nuances.\nWorkload:\nTextbook: Gan Shou Zhongguo (Written by Shi ZhongQi Laoshi). Daily dictations (drop 3 lowest). Drill section once a week. 4 tests + Final (Fall semester); 3 tests + Final (Spring Semester). Mid-semester presentation (5-6 minutes/person); Final Presentation (6-8minutes/person). 1 movie screening for Fall Semester (Yi Ge Dou Bu Neng Shao) for class discussion.\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "July 27, 2009",
            "review_content": "\nHu Laoshi is a wonderful teacher who makes learning a difficult language very enjoyable. If you're late she makes you sing in Chinese or dance. Don't take advantage of her kindness or she will know...I haven't met one of my classmates that doesn't cry when they think about having to leave Laoshi's class at the end of the semester.\nWorkload:\nIt's not the easiest in the world, but that's more reflective of EALAC than Hu Laoshi. At least once a week: Quiz (pinyin, characters), memorization, diary. About every two weeks: test, recording.\nIt really isn't that bad though. 2 hours a day is recommended, but most of the time 30 min. max will do.\nOh, and grading is not by the point but usually by the fraction (-.10 of a point or so) for most mistakes on quizzes and tests :)\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "January 22, 2009",
            "review_content": "\nA very excellent professor. She has a good sense of humor and a practical approach to teaching the class (ie powerpoints, going through the textbook, etc). The workload is very heavy and its absolutely essential to practice regularly and to be as precise as possible, but its manageable and you do learn a lot. The language textbooks are excellent because the professors tailored it to Columbia students and allows you to build your vocab very consistently; with spring and fall semester's textbooks, flashcards (so-so) and character sheets is only $35 which is not bad at all. In the case that you're having trouble Hu Laoshi is very helpful & understanding & negotiable. Definitely suggest her for Elementary.\nWorkload:\nWorkload will help you in the long run, although if you're just looking to fullfill a LAN requirement it might not be for you.\nSeven chapters in the book, about 40-65 words a chapter. You're required to read traditional and you can't write in pinyin (the Romanized version) but you can write in simplified characters. There's a test for every two chapters, as well as a pinyin quiz, character quiz and memorization for every chapter (about one or two of any of these a week). You will also have a character sheet, textbook exercises, and a dialogue recording for each chapter as homework.\n"
        },
        {
            "course_name": "Intermediate Chinese II (N)",
            "review_date": "January 08, 2007",
            "review_content": "\nHu is a great instructor whose teaching style is very different from others in the Chinese department.  She never made the students pair up and make-up those dumb contrived dialogues that are just a waste of time.  Anyone who has taken a Chinese class knows that half of the time spent \"preparing\" for the dialogues could be much better spent.  Hu Laoshi has a way of explaining sentence patterns, grammar, and vocabulary, that is extremely intuitive and easy to follow.  Her English is VERY good which certainly helps when she explains how a grammatical construction in Chinese should be built.  Her command of the English language was good enough that she understood obscure American expressions, and she even occasionally made puns.  Most importantly, she is an easy-going person who would poke fun at herself and at her students for the sake of teaching and learning.  I think that everyone in my class really had fun and enjoyed attending class.  \nHer experience includes Princeton in Beijing, Columbia in Beijing, some university in Minnesota, and possibly Texas(?).  The textbook is called \"David and Helen in China\" which was written by a professor at Columbia.  The textbook is a lot of fun.  Every chapter is basically an episode in the soap opera/love drama between the American born David and the Taiwanese immigrant Helen.  There is a ton of explanations in English on Chinese grammar, culture, and expressions.  Really, a great book.  \nWorkload:\nThe entire course is scheduled on the first day of class.  Each chapter is broken up into 4 days.  On the first 2 days you cover vocabulary and grammar (quizzes), on the 3rd day you practice sentence constructions (written hw due), and on the 4th day you practice listening exercises (listening hw due).  This schedule is standard for every Chinese section.  Every 2 lessons, there is a test.  For the semester there are 4 tests, a midterm and final oral exam, a final, listening and written hws, weekly drill sections, quizzes, and 3 essays.  Sounds like a lot of work, but if you keep on top of it, its really easy to learn a lot and get a good grade.  \n"
        }
    ]
}