{
    "prof_info": [
        {
            "prof_name": "David Cooper",
            "prof_id": 1428,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 26, 2003",
            "review_content": "\ni definately agree with whoever said that the boring nature of the class can be attributed to the students. cooper may not ask the most amazing questions, but its not his fault that theres no interesting discussions because that would involve more than just him talking. seriously, ive never seen a group of students care less about discussions. i feel so bad when he asks something and everyone just stares at him. maybe he could be a really good teacher if he had a chance to do it, he already has the disposition to be a good teacher. also, i was impressed with how much he kept up with the class considering he had his first child in the beginning of the year\nWorkload:\nsame as everyone else said, not a tough grader\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 17, 2003",
            "review_content": "\nCooper is overall quite a solid instructor.  He is a first-time teacher and a PhD candidate in the Slavic Languages dept (his stay at Columbia is nudging close to the decade mark).  Always good-humored and understanding, often amusingly self-deprecatory, he succeeds in keeping class discussion moving fairly well, though every so often his questions are either too daunting or too obvious.  Of course, the quality of discussion always depends on students' willingness to participate and engage with the material.  He works from a few pages of notes, making sure to address all the main topics he feels he needs to cover during each class period, and he leaves time for open-ended questions about the reading and a five-minute break at the class' halfway point.\nA bit disappointingly, Cooper does have those texts on which he is markedly weaker when compared to others.  While he's a smart guy who creates a comfortable, productive classroom environment, don't look for him to be an assured authority on anything in the course.  He's most proficient with Crime and Punishment (devoting four classes to it, which also means more reading time) and also handles much of the first semester's syllabus and the first half of the second semester's texts well.  Yet Don Quixote and King Lear seemed to present some struggle unfortunately, and I didn't feel as though he ended up digging as deeply into them as he did with other works.  As an optional text, he chose selections from Borges' collected fictions.\nWorkload:\nthree essays (4-5 pages each, numerous topics to choose from), standard Lit Hum reading pace, the rare pop quiz (plot-related), weekly discussion questions, straightforward midterm in the same style as the standard Lit Hum final (nothing to worry about)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 07, 2003",
            "review_content": "\nThis is getting ridiculous -- the other reviewers are putting way too much responsibility on Cooper's shoulders. Cooper is a very kind, very intelligent man with many interesting insights into the selected texts. That said, he does have some trouble initiating discussions, due in part to the confusingly obvious nature of many of his leading questions. What the other reviews fail to mention is that he receives no help from his class, which is currently made up of a very disaffected and unresponsive group of individuals. It is that, in my personal opinion, that causes the class to more boring than it should, and not so much any failing of Cooper's.  Cooper is generous with his grades, and is very accommodating in the case of illness, or anything else that may cause a student to get behind in his or her work. And the so called pop quizzes are two plot-related questions about the reading for the day, count for almost nothing, and i believe we had a maximum of 4 last semester. I would hardly put this class on the masochist's recommended course list -- there isn't much work, the grading is fair, and while somewhat boring it's nothing anyone who's sat through an introductory lecture course can't handle. The class is as interesting as you choose to make it.\nWorkload:\nthree 4-5 page essays, some 'pop quizzes,' nightly reading, and weekly discussion questions\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 17, 2003",
            "review_content": "\ni would like to give Mr. Cooper more credit than he deserves because he is a very nice guy, but that is all.  He doesn't know how to make class discussions interesting and go over small details in the text without talking much about some of the major, interesting issues.  but at least his is not that tough of a grader. overall he has the personality to be a great teacher, but he definately needs to learn how to engage students better.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 13, 2003",
            "review_content": "\nAt first,  I thought I had been placed into one of the better lit hums... boy was i wrong. Mr. Cooper will rarely let you out early. Be sure to bring a pillow to class, because each minute you'll find yourself looking at the clock and the pain is unbearable. The discussions overuse and reuse the topics until the time runs out, so don't be surprised if you discuss the same thing two or three times in a class. He has his favorites, and he is a tough grader. Avoid this class at all costs unless you are a masochist.\nWorkload:\nThree 4-5 page papers, pop quizes, tricky midterm, final\n"
        }
    ]
}