{
    "prof_info": [
        {
            "prof_name": "Hideki Hamada",
            "prof_id": 4396,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Japanese II",
            "review_date": "June 17, 2011",
            "review_content": "\nI had Hamada Sensei for two semesters for first year Japanese and I think he's a wonderful, very effective professor with a charmingly quirky personality. Hamada Sensei's Japanese class was definitely the most stress-free, chill, and happy class every day. His powerpoint slides were EXTREMELY helpful. We practice a lot of speaking and he was practically speaking Japanese 70% of the time since day one and that was why the listening and oral exams were really easy to me. I feel like I've learned more and gained more confidence in Japanese in this one year with Hamada Sensei than I did with Spanish for five years before college. I really appreciate how Hamada Sensei teaches, which is often very animated (he also constantly mentions his passion for video games) and I think I'd miss this geeky youthful energy a lot in the future. \n\nWorkload:\nif you put in the effort that you're supposed to for a language course, than you'll have a super easy A.\n"
        },
        {
            "course_name": "Elementary Japanese A",
            "review_date": "May 14, 2011",
            "review_content": "\nOverall, Hamada sensei's class was a rough introduction to the Japanese language. \nTo start, the class should have focused on hiragana and katakana before even touching the books, which were all in hiragana/katakana. The books themselves are quite useful, that is, if you know the script!.\nHamada sensei provided \"Supplementary Materials\" on Courseworks, but believe me, they are not JUST supplementary by any stretch of the imagination. They are quite necessary, but should not have been! The class was introduced to the books BEFORE the student had any familiarity with hiragana or katakana, the supplementary materials were essential in order to print out a romanized portion of the book, which included chapters 1-4. This was only the beginning of what would be an unnecessarily lengthy and confusing \"introduction\" to the class let alone the language. That's the last thing anyone needs as the semester \"evolves\" later on.\nFamiliarization of BOTH writing scripts are absolutely crucial before embarking within the unfamiliar territory of Japanese. During class, hiragana was the first thing we were introduced to. Unfortunately, the class was instructed that memorizing the katakana was OPTIONAL. This would have created a complete catastrophe (in our class at least) if one chose not to memorize it. I'll explain my reasons for this further on.\nThis particular class with Hamada sensei did not FOCUS on the script first and then the book afterwards. The entire class was scrambling to switch focus between 3 primary goals from the outset. These included memorizing how to write hiragana, memorizing Japanese words (romanized), and grammar structure. Since the student was not able to read hiragana yet, one had to read and write everything in romaji. Obviously, such a lack of structure and organization will only detract from the actual learning experience. It would not have been bad if it were just words and grammar AFTER completely memorizing the script. But for me, it was sloppy and ruined the class experience. This pattern of discord continued until the very end. I could not in good conscience follow along with the class like this! He made the class more work than it had to be.\nBecause of this Hamada sensei was a tough act to follow. Why would I say this? Well, I stated before that he gave students the option of memorizing completely the katakana script. As it turned out, katakana had a significant role to play with respect to quizzes, tests, and exams. Do yourself a favor and learn the characters AFTER hiragana! Not knowing both scripts will certainly cause one to lose points on tests. He was misleading with respect to this. Also, the listening comprehension played a much larger role on exams, in particular, then the online language labs really prepared the student for. The syllabus, while organized and easy to follow, was condensed with the aforementioned material. The \"Supplementary Materials\" could have been excluded to free up more time to practice reading hiragana. Afterwards, Chapter 1 should have been introduced right from the book, focusing on vocabulary and grammar.\nGrammar during the course was primarily glossed over very quickly via PowerPoint instruction. Doing that won't teach anyone anything. Second to learning the scripts themselves, this is the most important factor in understanding how to actually construct a sentence in Japanese. These two things are the absolute fundamentals! More time should definitely have been set aside to learn grammatical rules IN CLASS along with questions and answers without the damned insinuating comments from the professor, which was also a problem. His attitude was smiles one moment and mockery the next!\nHamada sensei is accustomed to teaching higher level Japanese as well DURING THE SAME SEMESTER. Obviously, his patience will run short when it's time to teach the lower level classes again. Whether you take these risks or not is entirely up to you. Personally, I think the whole curriculum needs to be reevaluated in terms of organization. That is unless the course is designed by Hamada sensei. In which case, I would simply tell you to choose someone else!\n\nWorkload:\nAt the beginning of the course, the student is slammed with a lot of unnecessary nonsense, including tons of papers to print out from a \"Supplementary Materials\" file. After Chapter 4, it is memorization of words and grammar in hiragana only. There will be homework every night either in the form of written assignments, listening labs, or memorizing Japanese itself. There also will be a quiz every session which is why memorizing the terms is crucial... The syllabus is very useful in organizing one's time.\nAt the end, there will be a composition essay that is completely foreign to an introductory student and significant research outside of class will need to be done in order to ensure that the composition sounds appropriate and not foolish. It will need to be memorized and presented in front of the class. This is another factor that could certainly have been removed from the course. This did not teach me anything!! I could have used this time to practice writing sentences or something.\n"
        },
        {
            "course_name": "Second Year Japanese 1",
            "review_date": "January 02, 2011",
            "review_content": "\nHamada-sensei is a spirited and engaging teacher who runs a very decent class. His method is prepared and systematic - class begins, the projector rolls down, everyone takes the quiz (which takes 1 or 2 minutes), and then the lesson begins. Hamada-sensei round-robins the material off his slides so that everyone takes turns speaking and listening. If you struggle, he hits you with smiles and helpful explanations until you can answer correctly. His emphasis in class is on grammar/structure and not at all vocab, which I like and think is the more appropriate way to spend our class time. After all, you can easily learn vocab & kanji on your own from the books or even online (which is actually faster most of the time). You have to, in order to do well on the blog posts and in the one composition we had to write.\nHamada-sensei is good, but he also may not for everyone. Although his personality is easygoing enough, his class PACE is not - he really fires through the slides as efficiently as possible, never pausing to yawn or stretch or admire the sunset. This is an admirable quality to some students, but not ideal for others. If somebody asks a good question, Hamada-sensei thinks about it and answers it fully. But he does not nonchalantly welcome stupid questions like some mother goose, so if you feel really lost/uncertain on the topic at hand (and there are admittedly some confusing-ass topics in the japanese language), go to him in office hours, do NOT interrupt the powerpoint to muse your brain farts to him and your fifteen classmates, you will simply fall a few points in Hamada-sensei's mental dossier. What else... Hamada-sensei does not really tolerate late homework, and if you fall behind, I feel like he would not come and coddle you. But then again, 5-credit language classes are serious business and if your desire to excel in Japanese cannot even drive you to hand in shit on time, then you probably shouldn't be there in the first place. There are no unpleasant suprises in Hamada's class, just a perpetual tsunami of various work and exercises where everything is graded in some way. But this is the tsunami we choose to endure, and Hamada-sensei leads us through it with energy and discipline.\nWorkload:\nHomework - Daily (1 to 2 hours on average)\nQuizzes - Daily (short and easy, we're basically given the exact material to study in advance) \nTests - Four throughout the term (plus the departmental midterm & final) \nBlog postings - We're supposed to do two a month.... just do these early/on weekends so they're fun and not chores\nLanguage lab - Weekly, one hour of relatively easy and painless speaking & convo\nOverall - Heavy, but probably no different from the other sections\n"
        }
    ]
}