{
    "prof_info": [
        {
            "prof_name": "Amiya Sen",
            "prof_id": 2567,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Electromagnetics",
            "review_date": "January 20, 2010",
            "review_content": "\nSen is actually a pretty good teacher. \nGranted he only teaches from his own notes, and any \"textbook\" in the class is a joke. Mostly he teaches his own examples, he tests you on his own examples, and all the exams are pretty much problems straight from the home work. \nDon't even think about getting in contact with him through email. Either show up at his office hours or try to snag the TA. If you can get him in person he's actually pretty approachable, just realize that he won't bother teaching you how to work out \"trivial\" algebra problems.\nHis teaching style is a little dry, but if you can manage to stay awake during class you will learn something. Halfway into the semester when people stop coming he will start taking attendace.\n The lectures themselves are a little boring, but the actual workload isn't too bad at all. Weekly problem sets can be done from his handed out notes. The entire class can really just be boiled down to \"Memorize Maxwell's Equations!\"  Everying is closed book closed note. \nGrading isn't that bad, but seems a little arbitrary. He doens't change the material much from year to year, so grades are influnced by a \"Historical Curve\"\nWorkload:\n12 Problem sets, 2 problems each. 2 Midterms , Final\n"
        },
        {
            "course_name": "Electromagnetics",
            "review_date": "April 29, 2008",
            "review_content": "\nThe absolute worst professor I have ever had at Columbia after Fine.\nHe makes you buy a textbook you NEVER use and it doesn't even correlate with the lectures. There are many ways to do EM problems and his techniques are what goes for the exams and problem sets. I wished at least he assigned relevant reading from the text.\nHe is also NOT approachable in any form whatsoever. He never responds to emails and makes you feel insecure if you talk to him.\nI wish the EE department would not let tenured professors teach. They just make the whole class so MISERABLE thinking they can teach when really all we need is a prof who can articulate the difficult material in such a way that we understand it.\nHorrible horrible professor.\nWorkload:\nNot so heavy. Homeworks are doable by his method only. Need to memorize the notes and homeworks to do even remotely decent. One midterm and one final. Does not use courseworks, or any other electronic form. Takes attendance randomly.\n"
        },
        {
            "course_name": "Electromagnetics",
            "review_date": "March 29, 2006",
            "review_content": "\nSen is one of the worst professors in the entire department. It's stunning to me to learn that he once earned a great teacher award twenty years ago.\nSen started out the first class of the year by trying to turn the twice a week class into a three times a week class on his personal whim. Luckily for the class, after major conflict, he relented and realized that he had to stick to the class times that we had registered for.\nThe class is supposed to be an upper level Physics class. Sen is a decent lecturer, but his notes are entirely indecipherable. His handwriting is horrendous and he passes out photocopied notes riddled with errors that are barely legible. Moreover, he assigns a textbook that is never used. The class has no correlation to the textbook.\nThe material in the class is extremely difficult and Sen fails to teach it effectively. Instead, he teaches specific examples and tests you on those examples--but in the process you learn almost nothing about electromagnetics and only about the specific homework problems.\nHis exams are closed book and similar to the homework problems. One exam question was actually \"List every single formula that you know\". By the end of the semester, almost the entire class was lost and just memorized the homework problems/solutions as opposed to learning the material.\nThe class is graded on a very strict curve. \nWorkload:\n10 problem sets, two midterms, final. First midterm is straightforward, second is harder, final is very hard. Grading is seemingly arbitrary.\n"
        },
        {
            "course_name": "Electromagnetics",
            "review_date": "May 30, 2005",
            "review_content": "\nProf. Sen begins the class by saying that he will take everything into consideration when distributing the term grades, this includes 2 midterms, a final, and about 12 hw sets. \nIn his push to try to get every one to learn and to justify to himself that people care to learn, half way through the semester he decided to take attendance. Not very consistent with it as he at times forgot to take attendance, so you never really knew what he was up to.\nTeaching wise, he is an ok professor. Not the best, not the worst, just enough to get you through the class. His goal is not for you to get the right answer persay but the correct approach, but his exam grading doesn't reflect that. He distributes his own handwritten notes after class and asks that you just watch what he writes on the board and not take notes. DO TAKE NOTES. his handwriting is absolutely illegible, it is a pain to take them off of the board and his math isn't always right so come exam time you may have a little confusion on how to do things, ASK THE TA or goto office hours.\nLectures are somewhat organized, I wish he had used the internet a little bit. HW assignments weren't always clear, hw solutions magically appeared in the class box about a week or two later, you never quite new what was going on.\nOk professor, I hear he is a better alternative to Diament, but in my opinion, not by much.\nWorkload:\n11-12 Psets, 1 per week.; 2 midterms; 1 final\nmidterms moderate difficulty, final considerably tougher.\n"
        }
    ]
}